[
    {
        "Title": "The Map Book",
        "Authors": "By Barber, Peter (EDT)",
        "Description": "'Journey over all the universe in a map, without the expense and fatigue of traveling, without suffering the inconveniences of heat, cold, hunger, and thirst.' --Miguel de Cervantes, in Don Quixote From the earliest of times, maps have fired our imaginations and helped us make sense of our world, from the global to the very local.  Head of Map Collections at the British Library, Peter Barber has here compiled an historic and lavish atlas, charting the progress of civilization as our knowledge of the world expanded. Simply organized as a progression through time, The Map Book collects some 175 maps that span four millennia - from the famed prehistoric Bedolina (Italy) incision in rock from around 1500 B.C. to the most modern, digitally enhanced rendering.  Many of the maos are beautiful works of art in their own right.  From Europe to the Americas, Africa to Asia, north to south, there are maps of oceans and continents charted by heroic adventurers sailing into the unknown, as accounts spread of new discoveries, shadowy continents begin to appear n the margins of the world, often labeled 'unknown lands.'  Other maps had a more practical use: some demarcated national boundaries or individual plots of land; military plans depicted enemy positions; propaganda treatises showed one country or faction at an advantage over others. So much history resides in each map--cultural, mythological, navigational--expressing the unlimited extent of human imagination.  This is captured in the accompanying texts--mini essays by leading map historians--that are as vivid and insightful as the maps themselves.  They make The Map Book as much a volume to be read as to be visually admired.",
        "Category": " Reference , Atlases, Gazetteers & Maps",
        "Publisher": "Walker Books",
        "Price Starting With ($)": "9.06",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "It Didn't Start With Watergate",
        "Authors": "By Lasky, Victor",
        "Description": "The author contends that Watergate was mainly a media event, points to Democratic scandals which have been relatively ignored, and claims that leading Democrats were fully aware of plans for the break-in and did nothing to prevent it",
        "Category": " Social Science , General",
        "Publisher": "E P Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1977"
        }
    },
    {
        "Title": "Just Courage: God's Great Expedition for the Restless Christian",
        "Authors": "By Haugen, Gary A.",
        "Description": "\"There must be more to the Christian life than this--more than church each Sunday and waving to my neighbors and giving some clothes to Goodwill when I go through my closet each spring.\"These aren't bad things, of course. But they're safe and comfortable and easy. And there's a reason they're not satisfying your desire for something more significant and meaningful--we're created by God for adventure.International Justice Mission president Gary Haugen has found that engaging in the fight for justice is the most deeply satisfying way of life. This book shows how we too can be a part of God's great expedition.",
        "Category": " Religion , Christian Living , Social Issues",
        "Publisher": "IVP Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "The Skeptic's Guide To Global Poverty (The Skeptic's Guide)",
        "Authors": "By Bourke, Dale Hanson",
        "Description": "",
        "Category": " Social Science , Poverty & Homelessness",
        "Publisher": "Authentic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Security First: For a Muscular, Moral Foreign Policy",
        "Authors": "By Etzioni, Amitai",
        "Description": "?Rarely have more profound changes in American foreign policy been called for than today,” begins Amitai Etzioni in the preface to this book. Yet Etzioni’s concern is not to lay blame for past mistakes but to address the future: What can now be done to improve U.S. relations with the rest of the world?What should American policies be toward recently liberated countries such as Iraq and Afghanistan, or rogue states like North Korea and Iran? When should the United States undertake humanitarian intervention abroad? What must be done to protect America from nuclear terrorism? The author asserts that providing basic security must be the first priority in all foreign policy considerations, even ahead of efforts to democratize. He sets out essential guidelines for a foreign policy that makes sense in the real world, builds on moral principles, and creates the possibility of establishing positive relationships with Muslim nations and all others.Etzioni has considered the issues deeply and for many years. His conclusions fall into no neat categories?neither ?liberal” nor ?conservative”?for he is guided not by ideology but by empirical evidence and moral deliberation. His proposal rings with the sound of reason, and this important book belongs on the reading list of every concerned leader, policy maker, and voter in America.",
        "Category": " Political Science , General",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Crispin's Day: The Glory of Agincourt",
        "Authors": "By Jarman, Rosemary Hawley",
        "Description": "Seventy full-color medieval prints embellish an account of the victory of Henry V of England at Agincourt, a battle of unparalleled pageantry which marked the culmination of the most famous campaign of the Hundred Years War",
        "Category": "",
        "Publisher": "Little Brown",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Leo the Lop",
        "Authors": "By Cosgrove, Stephen",
        "Description": "",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1978"
        }
    },
    {
        "Title": "Nurture by Nature: Understand Your Child's Personality Type - And Become a Better Parent",
        "Authors": "By Tieger, Paul D. and Barron-Tieger, Barbara",
        "Description": "Every parent knows that children, even babies, have distinct personalities. Any parent with more than one child is probably well aware of how different from each other children, even siblings, can be. So it's only natural that the parenting strategies that work with one child may be less effective with another child. How can you be sure that your nurturing is well suited to your child?With this one-of-a-kind parenting guide, you can use Personality Type analysis - a powerful and well-respected psychological tool - to understand your child better and become a more effective parent. In Nurture by Nature you'll learn which of 16 distinctly different types best matches your child's personality; how this personality type affects your child in each of the three stages of development - preschool, school age, and adolescence; how other parents, whose experiences are recounted in scores of case studies, deal with a wide array of challenging situations you may encounter: reining in a preschooler whose boundless energy constantly gets him into trouble; communicating with a child who keeps her thoughts and feelings secret; understanding an adolescent who seems not to care that he is forever losing things (his homework, his baseball cap, his keys); broadening the horizons of a child who resists trying anything new or unfamiliar...; and how you can adapt your parenting style to your child's type - and get better results when communicating, supporting, motivating, and disciplining.Whether your child is a tantrum-prone toddler, a shy third-grader, a rebellious teen, or somewhere in between, Nurture by Nature will give you the power to understand why children are the way they are - and to become the best parent you can be.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Little, Brown Spark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Women's Bodies, Women's Wisdom",
        "Authors": "By Northrup, Christiane",
        "Description": "A groundbreaking book on women’s physical and emotional well-being, Women’s Bodies, Women’s Wisdom has become a classic, with more than 1.25 million copies in print. Here in this revised edition is the most up-to-date information available on women’s health issues.Women’s Bodies, Women’s WisdomChristiane Northrup’s vision of mind-body wellness has received an extraordinary response from women all over the world. Women’s Bodies, Women’s Wisdom powerfully demonstrates that when women change the basic conditions of their lives that lead to health problems, they heal faster, more completely, and with far fewer medical interventions.Dr. Northrup brings us vital information about the best techniques of Western medicine and the best alternative therapies, showing how to incorporate both into a complementary whole. She guides readers through the entire range of women’s health problems and offers innovative, positive perspectives on normal processes, such as menstruation, pregnancy, and menopause. This edition includes:• A nutrition chapter emphasizing individual dietary needs and body chemistry• Information on improving fertility after age 35--and how to cut the risk of C-section by 50 percent• A comprehensive program for menopause, including how to decide whether natural hormone replacement is right for you• Holistic ways to prepare and heal faster if surgery is necessary• Plus dozens of natural treatments and a wealth of hard-to-find health care resourcesFilled with dramatic case histories from her medical practice in Maine, Women’s Bodies, Women’s Wisdom is contemporary medicine at its best, combining new technologies with natural remedies and the miraculous healing powers within the body itself.",
        "Category": " Medical , Nursing , Maternity, Perinatal, Women's Health",
        "Publisher": "Bantam",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Why the Dalai Lama Matters: His Act of Truth as the Solution for China, Tibet, and the World",
        "Authors": "By Thurman, Robert",
        "Description": "he suppression of Tibet’s cultural heritage has the potential to set a precedent for all oppressed peoples of the world. Perched on the top of the world. changes in Tibet’s ecosystem affect the entire global climate. And, most importantly, Tibet is the spiritual and physical home of His Holiness the Dalai Lama, to which he can never return.But why does Tibet matter to you? Tibet is more than its mountains, its monks, and its martyrs. Robert Thurman, renowned Tibetan scholar, teacher, and activist, presents his provocative, five-point plan that will enable China to win the respect of the entire world by allowing Tibet to regain its cultural, economic, and political autonomy. Thurman shows how the Dalai Lama's tireless work is the harbinger of peace for the world yet to come and essential for human survival. The book outlines several key factors that will educate and empower readers to take action:- What is the history of Tibet, and how do the political, religious, ecological, and social factors affect each other?- Who is the Dalai Lama, and why does his work matter to the world?- What does the China-Tibet relationship represent for the global community?- What can individuals do to bring attention to this issue, and make a change where they are?- How can the five-point plan be used as a model of peaceful change in the world?",
        "Category": " Religion , Buddhism , Tibetan",
        "Publisher": "Atria Books/Beyond Words",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Too Many Dogs (Step-Into-Reading, Step 1)",
        "Authors": "By Fuge, Charles (ILT), Mathieu, Joseph (ILT), Haskins, Lori, and Jordan, Hannah",
        "Description": "Waggy dog, shaggy dog, doggies in a bunch. Floppy dog, sloppy dog, doggies eating lunch. Kids will love this bouncy, colorful book, bursting with every kind of dog imaginable!",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Hilary Knight's The Twelve Days of Christmas",
        "Authors": "By Knight, Hilary and Knight, Hilary (ILT)",
        "Description": "A reissue of this holiday classic provides young readers with a colorful picture book where all the gifts from each of the twelve days are presented through brilliant illustrations and simple text.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Simon & Schuster Children's Publishing",
        "Price Starting With ($)": "11.44",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Culture Shock! China ( A Survival Guide to Customs & Etiquette)",
        "Authors": "By Sinclair, Kevin and Wong, Iris Po-Yee",
        "Description": "Whether you travel for business, pleasure, or a combination of the two, the ever-popular \"Culture Shock!\" series belongs in your backpack or briefcase. Get the nuts-and-bolts information you need to survive and thrive wherever you go. \"Culture Shock!\" country guides are easy-to-read, accurate, and entertaining crash courses in local customs and etiquette. \"Culture Shock!\" practical guides offer the inside information you need whether you're a student, a parent, a globetrotter, or a working traveler.Each \"Culture Shock!\" title is written by someone who's lived and worked in the country, and each is packed with practical, accurate, and enjoyable information to help you find your way and feel at home.",
        "Category": " Travel , Asia , China",
        "Publisher": "Graphic Arts Center Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Creating a World Without Poverty: Social Business and the Future of Capitalism",
        "Authors": "By Weber, Karl and Yunus, Muhammad",
        "Description": "In the last two decades, free markets have swept the  globe, bringing with them enormous potential for positive  change. But traditional capitalism cannot solve problems  like inequality and poverty, because it is hampered  by a narrow view of human nature in which people are  one-dimensional beings concerned only with profit.  In fact, human beings have many other drives and  passions, including the spiritual, the social, and the  altruistic. Welcome to the world of social business, where  the creative vision of the entrepreneur is applied to  today's most serious problems: feeding the poor, housing  the homeless, healing the sick, and protecting the planet.  Creating a World Without Poverty tells the stories of  some of the earliest examples of social businesses,  including Yunus's own Grameen Bank. It reveals the next  phase in a hopeful economic and social revolution that is  already under way?and in the worldwide effort to eliminate  poverty by unleashing the productive energy of every  human being.",
        "Category": " History , Modern , General",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Night Before Thanksgiving",
        "Authors": "By Lyon, Tammie (ILT) and Wing, Natasha",
        "Description": "Everyone’s favorite fun-filled, family-filled, food-filled holiday is almost here! Follow along as the feast is prepared, cousins are greeted, and everyone gathers around the table, all with an extra helping of holiday fun.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Thanksgiving",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Geography of Bliss: One Grump's Search for the Happiest Places in the World",
        "Authors": "By Weiner, Eric.",
        "Description": "Part foreign affairs discourse, part humor, and part twisted self-help guide, The Geography of Bliss takes the reader from America to Iceland to India in search of happiness, or, in the crabby author's case, moments of \"un-unhappiness.\" The book uses a beguiling mixture of travel, psychology, science and humor to investigate not what happiness is, but where it is. Are people in Switzerland happier because it is the most democratic country in the world? Do citizens of Qatar, awash in petrodollars, find joy in all that cash?  Is the King of Bhutan a visionary for his initiative to calculate Gross National Happiness? Why is Asheville, North Carolina so damn happy? With engaging wit and surprising insights, Eric Weiner answers those questions and many others, offering travelers of all moods some interesting new ideas for sunnier destinations and dispositions.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Twelve",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Fallen Angels",
        "Authors": "By Bloom, Harold and Podwal, Mark (ILT)",
        "Description": "Harold Bloom, our preeminent literary critic, essays to explain the meaning of angels in world literature In this lovely gift book published for the holiday season, Harold Bloom again combines his lifelong interests in religion and literature. He begins by observing our present-day obsession with angels, which reached its greatest intensity as the current millennium approached. For the most part, these popular angels are banal, even insipid. Bloom is especially concerned with a particular subspecies of angels: fallen angels.  He proceeds to examine representations of fallen angels from Zoroastrian texts and the Bible to Milton’s Paradise Lost to Tony Kushner’s Angels in America, arguing that familiarity with this rich literary tradition improves our reading and spiritual lives. Bloom’s text is accompanied by more than a dozen original watercolors, line drawings, and illuminated letters by award-winning artist Mark Podwal.Every angel is terrifying, Rilke wrote. For Bloom, too, this is true in one sense, since he maintains that all angels are fallen angels. The image of Satan, the greatest of fallen angels, retains the ability to fascinate and frighten us, he argues, because we share a close kinship with him. Indeed, from a human perspective, we must agree that we are fallen angels. Fallenness is ultimately a human condition: the recognition of our own mortality. Throughout world literature angels have always served as metaphors for death. We may take consolation, however, in our double awareness that angels also represent love and the celebration of human possibilities.",
        "Category": " Body, Mind & Spirit , Astrology , Eastern",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Billy Graham, God's Ambassador: A Celebration of His Life and Ministry",
        "Authors": "By Busby, Russ",
        "Description": "For over sixty years, Billy Graham has traveled the world preaching the Gospel face-to-face to more than one hundred million people. Across the globe in Europe, Asia, North and South America, Australia, and Africa, his crusades have broken stadium attendance records. And with the advent of radio, television, and satellite broadcasts, Graham has reached more than two billion people in his lifetime. Billy Graham: God's Ambassador includes hundreds of photos from the archives of Graham's photographer, Russ Busby, along with quotes, comments, and personal reflections from the past half century, most of them in the words of Graham himself and those who have been the closest to him. Unlike any other book ever published on his life and ministry, this insightful edition captures Graham the advocate, preaching for human rights and world peace; Graham the counselor, with presidents and world leaders; Graham the inspirer, a positive influence in times of conflict and discord; and Graham the husband and father, at home with his family. This unique, once-in-a-lifetime volume beautifully captures the public and private moments of one of the world's most prominent figures, and certainly the most influential Christian of the twentieth century.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Arthur's Loose Tooth (An I Can Read Book) (I Can Read Books (Harper Hardcover))",
        "Authors": "By Hoban, Lillian",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "The Nativity Story",
        "Authors": "By Voiland, Stephanie (EDT)",
        "Description": "Exclusive photos taken on the set of The Nativity Story, together with scripture from the New Living Translation, present the story of Jesus' birth in vivid detail. Similar toThe Passion, this gift book presents the most memorable and magical scenes from the movie.The Nativity Story tells the extraordinary tale of two common people, Mary and Joseph, a miraculous pregnancy, an arduous journey, and the history-defining birth of Jesus. Driven by powerful moving images and told through the Scriptures, this book will enhance the movie experience. The Nativity Story, directed by Catherine Hardwicke (Thirteen, Lords of Dogtown), written by Mike Rich(Finding Forrester, Radio, The Rookie) and starring Keisha Castle-Hughes (nominated for an Oscar for best actress for her role inWhale Rider) as Mary opens on 3,000 screens nationwide December 1, 2006. The film is currently in production with locations in Matera, Italy, and Morocco. New Line Cinema is the most successful independent film company in the world. A pioneer in franchise filmmaking, New Line's Oscar-winning The Lord of the Rings trilogy is one of the most successful film franchises in history. 96 pages, hardcover with jacket makes an excellent gift or coffee table book.",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Diners: American Retro",
        "Authors": "By Moss, Alison (EDT)",
        "Description": "",
        "Category": " Photography , General",
        "Publisher": "Sourcebooks Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "After the Constitution: Party Conflict in the New Republic",
        "Authors": "By Banning, Lance",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Wadsworth Pub. Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Santa Is Coming (Christmas S.)",
        "Authors": "By Ann Ricketts",
        "Description": "",
        "Category": "",
        "Publisher": "Brimax Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Richard Scarry's A Day at the Fire Station (Pictureback(R))",
        "Authors": "By Scarry, Richard",
        "Description": "Sound the alarm for a day of fire-station fun with the one and only Richard Scarry! From fast fire trucks and out-of-control hoses to sliding down fire poles and saving the day, this exciting and funny Richard Scarry story wiill have little ones asking to read it over and over again. Includes a sheet of stickers!",
        "Category": " Juvenile Fiction , Business, Careers, Occupations",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Addie's Bad Day (An I Can Read Book)",
        "Authors": "By Truesdell, Sue (ILT) and Robins, Joan",
        "Description": "Max's best friend Addie is embarrassed to go to Max's birthday party because she is afraid that everyone will laugh at her new haircut",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Harpercollins Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Centenarians: The Story of the 20th Century by the Americans Who Lived It",
        "Authors": "By Edelman, Bernard (EDT)",
        "Description": "An oral history of the twentieth century in America.By 1990, over 37,000 Americans had lived to the age of one hundred. Their lives spanned world wars, the Depression, the rise and demise of the great Red Menace, and the emergence of the United States as a world power.Through interviews with centenarians across the country, Bernard Edelman draws a dazzling portrait of Americans in the twentieth century, evoking the work ethic of rural farms, the nation's awe at inventions such as the automobile, and the collective despair at the onset of world war. These recollections are a treasure of the century's social history. The young immigrant survivor who can still smell the smoke of the Triangle Shirtwaist Factory fire. The rookie pitcher who struck out the first batter he ever faced in the big leagues: Ty Cobb. The dashing artillery officer who won a Silver Star in the Great War. The officer in the Quartermaster Corps who witnessed the signing of the Treaty of Versailles. The motorcycle racer who barnstormed the nation, setting records that will never be broken. The feisty woman who led a walkout at the premiere of Gone With the Wind. The man who invented Pampers.Their memories serve as a timeless reminder of life in twentieth-century America.",
        "Category": " History , United States , 20th Century",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Red, White, and Drunk All Over: A Wine-Soaked Journey from Grape to Glass",
        "Authors": "By Maclean, Natalie",
        "Description": "After three years of sipping, spitting, and slogging her way through bushy vine leaves and cellar cobwebs, award-winning writer Natalie MacLean takes readers behind the scenes of the international wine world, exploring its history, visiting its most evocative places, and meeting some of its most charismatic personalities. In Red, White, and Drunk All Over, Natalie travels to the ancient vineyards of Burgundy to uncover the secrets of the pinot noir, the \"heartbreak grape\" from which some of the most coveted and expensive wines in the world are made. She visits the labyrinthine cellars of Champagne to examine the myths and the mystique of luxury bubbly and the grandes dames who made it the drink of celebration the world over. She pulls on sturdy boots to help with the harvest at the vineyards of iconoclastic Californian winemaker Randall Grahm and goes undercover as sommelier for a night in a five-star restaurant with a wine list the thickness of a phone book. She looks at the influence of powerful critics, notably Robert Parker and Jancis Robinson, invites readers into her dining room for an informal wine tasting, and compares collecting notes at a bacchanalian dinner with novelist Jay McInerney. As funny and engaging as she is knowledgeable, Natalie has an unconventional wit, curiosity, and obsession with all things related to wine that make for a tour both amusing and informative, from grape to bottle to glass.",
        "Category": " Cooking , Beverages , Alcoholic , General",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Legend of Sir Miguel",
        "Authors": "By Cain, Michael",
        "Description": "Miguel, aspiring to become a knight in armor, goes on a quest after the oval crystal of Merlin, the only amulet that can save the kingdom from the spells of the evil witch Dorinda",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Landmark Editions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Passion and Principle: John and Jessie Fremont, the Couple Whose Power, Politics, and Love Shaped Nineteenth-Century Americ",
        "Authors": "By Denton, Sally",
        "Description": "John Charles Fremont was the illegitimate child of a Virginia aristocrat and a working class French immigrant; Jessie Benton was the daughter of the most powerful pre-Civil War U.S. senator, Thomas Hart Benton of Missouri. John was twenty-seven when they first met, tanned and handsome, just back from an expedition exploring the American West. Jessie was sixteen, a schoolgirl who had been raised at her father's knee in Washington, D.C., groomed as much as any young man to be president, if not for her gender. From the moment they locked eyes, John and Jessie's lifelong love affair began.The man who unknowingly brought them together, Senator Benton, had been courting Fremont to fulfill the national destiny he envisioned of an expanded United States. But he never imagined his daughter would fall in love with Fremont, who was widely known to be of dubious background and breeding and was certainly not an appropriate mate for Jessie. None of Senator Benton's considerable efforts, however, could keep the young couple apart.Jessie and John made a formidable couple. Both together and apart they contributed significantly to shaping our country: He was a key figure in western expansion, and the first presidential candidate for the Republican Party. She was a savvy political operator who played confidante and adviser to the highest political powers in the country. Despite their great efforts on behalf of their country, their reputations could not survive a Washington smear campaign led by none other than Jessie's father. As a result, John and Jessie were eclipsed and opposed by some of the most mythic characters of their era, not least Abraham Lincoln.As much as Passion and Principle is about the dynamics of this family triangle, it is also about the tumultuous period that forms the backdrop for John and Jessie's lives together, from the abolition of slavery to the building of the railroad. Written with an investigative journalist's eye for detail and a novelist's flair, Passion and Principle restores the reputations of John and Jessie and places them at the center of our country's history.",
        "Category": " History , United States , General",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Little House Baby Photograph Album (Based on The Little House books by Laura Ingalls Wilder)",
        "Authors": "By Graef, Renee (ILT) and Wilder, Laura Ingalls",
        "Description": "A baby's photograph album provides the ideal location for preserving such moments as baby's first day home to a first birthday, in a sturdy memory book with Little House illustrations and easy-to-use adhesive photo corners.",
        "Category": "",
        "Publisher": "Harpercollins Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Ghosts and Haunted Houses of Maryland",
        "Authors": "By Gallagher, Trish and Burns, Howard (ILT)",
        "Description": "Tells the stories of haunted colleges, taverns, and homes, poltergeists, strange apparitions, and unexplained noises",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Schiffer Pub Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "The Lost World of James Smithson: Science, Revolution, and the Birth of the Smithsonian",
        "Authors": "By Ewing, Heather",
        "Description": "In 1836 the United States government received a strange and unprecedented gift--a half-million dollar bequest to establish a foundation in Washington \"for the increase and diffusion of knowledge among men.\" The Smithsonian Institution, as it would be called, eventually grew into the largest museum and research complex in the world. Yet the man behind what became \"America's attic,\" James Smithson, has remained a shadowy figure for more than 150 years.Drawing on unpublished diaries and letters from across Europe and the United States, historian Heather Ewing tells his compelling story in full. The illegitimate son of the Duke of Northumberland, Smithson was the youngest member of Britain's Royal Society and a talented chemist admired by the greatest scientists of his age. At the same time, however, he was also a suspected spy, an inveterate gambler, and a radical revolutionary during the turbulent years of the Napoleonic Wars. But at the heart of Smithson's story is his bequest--worth $9 million in today in today's currency--which sparked an international lawsuit and a decade-long congressional battle, featuring a dizzying cast of historical figures, including John Quincy Adams, and Alexander Graham Bell, both of whom grappled with how--and even whether--to put Smithson's endowment to use.Fascinating and magisterial, Ewing's biography presents a sweeping portrait of a remarkable man at the center of the English Enlightenment and the creation of America's greatest museum.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Tale of Peter Rabbit Coloring Book (Dover Classic Stories Coloring Book)",
        "Authors": "By Potter, Beatrix",
        "Description": "It’s every child’s dream come true … to color the irresistible Peter Rabbit drawings. And it’s the best way to enjoy this enduringly delightful tale. Rendered by Nancy Perkins, these large illustrations with the full story beneath tempt even the parent’s hand to color away and let the imagination run wild. Coloring while you read increases the hours of pleasure both parent and child can share recounting the adventures of the mischievous rabbit.",
        "Category": " Juvenile Fiction , Activity Books",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1971"
        }
    },
    {
        "Title": "I'm Still Here in the Bathtub: Brand New Silly Dilly Songs",
        "Authors": "By Catrow, David (ILT) and Katz, Alan",
        "Description": "If you like... \"Wheels on the Bus\"  and  \"Itsy Bitsy Spider,\" you'll go NUTS for \"The Meals at My Camp\"  and  \"Tiny Baby Brother\"! Songwriter and comedy writer par excellence Alan Katz has done it again! He's turned fourteen favorite songs upside down and created new nonsense songs kids will love. With hilariously funny pictures by illustrator and cartoonist David Catrow, this new collection promises giggles, guffaws, and hours of silly dillyness for kids everywhere!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Corn Is Maize: The Gift of the Indians (Let's-Read-and-Find-Out Science 2)",
        "Authors": "By Aliki",
        "Description": "Popcorn, corn on the cob, cornbread, tacos, tamales, and tortillas—all of these and many other good things come from one amazing plant. With simple prose and beautiful illustrations, award-winning author-illustrator Aliki tells the story of how Native American farmers thousands of years ago found and nourished a wild grass plant and made corn an important part of their lives. This is a Stage 2 Let's-Read-and-Find-Out, which means the book explores more challenging concepts for children in the primary grades. Let's-Read-And-Find-Out is the winner of the American Association for the Advancement of Science/Subaru Science Books & Films Prize for Outstanding Science Series. Supports the Common Core Learning Standards and Next Generation Science Standards",
        "Category": " Juvenile Nonfiction , Science & Nature , Flowers & Plants",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "The Hutchinson Treasury of Children's Literature",
        "Authors": "By Sage, Alison",
        "Description": "A beautifully produced celebration of children’s literature that will carry a child through his or her reading life, with nursery rhymes, short stories, fables, fairy tales and extracts from the classics. Each entry is a work of true literary distinction.",
        "Category": " Young Adult Nonfiction , Literary Criticism & Collections",
        "Publisher": "Hutchinson Children's Books",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "My Horizontal Life: A Collection of One-Night Stands",
        "Authors": "By Handler, Chelsea",
        "Description": "In this raucous collection of true-life stories, actress and comedian Chelsea Handler recounts her time spent in the social trenches with that wild, strange, irresistible, and often gratifying beast: the one-night stand.You've either done it or know someone who has: the one-night stand, the familiar outcome of a night spent at a bar, sometimes the sole payoff for your friend's irritating wedding, or the only relief from a disastrous vacation. Often embarrassing and uncomfortable, occasionally outlandish, but most times just a necessary and irresistible evil, the one-night stand is a social rite as old as sex itself and as common as a bar stool.Enter Chelsea Handler. Gorgeous, sharp, and anything but shy, Chelsea loves men and lots of them. My Horizontal Life chronicles her romp through the different bedrooms of a variety of suitors, a no-holds-barred account of what can happen between a man and a sometimes very intoxicated, outgoing woman during one night of passion. From her short fling with a Vegas stripper to her even shorter dalliance with a well-endowed little person, from her uncomfortable tryst with a cruise ship performer to her misguided rebound with a man who likes to play leather dress-up, Chelsea recalls the highs and lows of her one-night stands with hilarious honesty. Encouraged by her motley collection of friends (aka: her partners in crime) but challenged by her family members (who at times find themselves a surprise part of the encounter), Chelsea hits bottom and bounces back, unafraid to share the gritty details. My Horizontal Life is one guilty pleasure you won't be ashamed to talk about in the morning.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Waiting for Daisy: A Tale of Two Continents, Three Religions, Five Infertility Doctors, an Oscar, an Atomic Bomb, a Romantic Night and One Woman's Quest to Become a Mother",
        "Authors": "By Orenstein, Peggy",
        "Description": "Waiting for Daisy is about loss, love, anger and redemption. It's about doing all the things you swore you'd never do to get something you hadn't even been sure you wanted. It's about being a woman in a confusing, contradictory time. It's about testing the limits of a loving marriage. And it's about trying (and trying and trying) to have a baby. Orenstein's story begins when she tells her new husband that she's not sure she ever wants to be a mother; it ends six years later after she's done almost everything humanly possible to achieve that goal, from \"fertility sex\" to escalating infertility treatments to New Age remedies to forays into international adoption. Her saga unfolds just as professional women are warned by the media to heed the ticking of their biological clocks, and just as fertility clinics have become a boom industry, with over two million women a year seeking them out.  Buffeted by one jaw-dropping obstacle after another, Orenstein seeks answers both medical and spiritual in America and Asia, along the way visiting an old flame who's now the father of fifteen, and discovering in Japan a ritual of surprising solace. All the while she tries to hold onto a marriage threatened by cycles, appointments, procedures and disappointments. Waiting for Daisy is an honest, wryly funny report from the front, an intimate page-turner that illuminates the ambivalence, obsession, and sacrifice that characterize so many modern women's lives.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Jenny Jellyfish: A Tale of Wiggly Jellies (No. 23 in Suzanne Tate's Nature Series)",
        "Authors": "By Tate, Suzanne and Melvin, James (ILT)",
        "Description": "A day in the life of Jenny Jellyfish and her friends includes being beached by a storm.",
        "Category": " Juvenile Fiction , Animals , Fish",
        "Publisher": "Nags Head Art, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Bite-Sized Science: Activities for Children in 15 Minutes or Less",
        "Authors": "By Falk, John H. and Rosenberg, Kristi S.",
        "Description": "Here’s a fun way to get young minds discovering the wonders of the natural world by making predictions, testing them, and then evaluating the results&#151;learning the scientific method. These short, bite-sized, deliciously fun activities like \"Sounds of Chewing,\" \"Clinks in the Kitchen,\" \"Tangy Tongue,\" and \"Shoe Show\" take only 15 minutes to organize, do, and clean up. Many of the activities involve food, so children will learn and get a snack at the same time.",
        "Category": " Education , Teaching Methods & Materials , Science & Technology",
        "Publisher": "Chicago Review Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Flintstones The Movie Storybook",
        "Authors": "By Parker, Tom S., Jennewein, Jim, De Souza, Steve, and Larson, Wendy S.",
        "Description": "The Water Buffalos are in the bowling finals, the Rubbles adopt Bamm-Bamm, and Fred is the new vice-president at the quarry, but Fred's evil boss has a plan that may ruin everything. Movie tie-in.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Colors, colors everywhere! (Disney's read and grow library) by Janet Craig (1997-05-04)",
        "Authors": "By Craig, Janet",
        "Description": "",
        "Category": "",
        "Publisher": "Advance Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Commanding Heights: The Battle Between Government and the Marketplace That Is Remaking the Modern World",
        "Authors": "By Yergin, Daniel and Stanislaw, Joseph",
        "Description": "A look at how the enormous shift of assets from central governments to private enterprise in Europe, Asia, Latin America, and the Middle East analyzes the diverse ways in which such changes will affect the balance of economic power throughout the world. 75,000 first printing. Tour. BAKER & TAYLOR",
        "Category": " Business & Economics , Development , Economic Development",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Essential Managers: Project Management (Essential Managers Series)",
        "Authors": "By Langdon, Ken and Bruce, Andy",
        "Description": "",
        "Category": " Business & Economics , Decision-Making & Problem Solving",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Presentations (Adams Critical Skills for Your Business)",
        "Authors": "By Bowman, Daria Price",
        "Description": "Tells how to prepare for various types of presentations, and discusses charts and graphs, meetings, public speaking, and answering questions",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Harvard Business Review on Strategies for Growth (Harvard Business Review Paperback Series)",
        "Authors": "By Harvard Business Review",
        "Description": "The Harvard Business Review paperback series is designed to bring today's managers and professionals the fundamental information they need to stay competitive in a fast-moving world. Here are the landmark ideas that have established the Harvard Business Review as required reading for ambitious business people in organizations around the globe. The Harvard Business Review on Strategies for Growth presents the latest tactics--including acquisitions, diversification, and innovation--for helping managers find and exploit the best opportunities for growth and profitability. Articles include: Breaking Compromises, Breakaway Growth by George Stalk, Jr., David K. Pecaut, and Benjamin Burnett; Value Innovation: The Strategic Logic of High Growth by W. Chan Kim and Renee Mauborgne; Growth Through Acquisitions: A Fresh Look by Patricia L. Anslinger and Thomas E. Copeland; To Diversify or Not to Diversify by Constantinos C. Markides; The Living Company by Arie De Geus; Making the Deal Real: How GE Capital Integrates Acquisitions by Ronald N. Ashkenas, Lawrence J. DeMonaco, and Suzanne C. Francis; Capturing the Value of Supplementary Services by James C. Anderson and James A. Narus; and Exploiting the Virtual Value Chain by Jeffrey F. Rayport and John J. Sviokla.",
        "Category": " Business & Economics , Management",
        "Publisher": "Harvard Business Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Readings in the Classical Historians",
        "Authors": "By Grant, Michael",
        "Description": "Grant, a preeminent classics scholar, presents an anthology of classical historians, from early Greek, up to the beginnings of the Christian era. Included are the significant writers who chronicled the major events of early Western civilization and laid the foundations of the historical discipline: Herodotus, Thucydides, Xenophon, Julius Caesar, Livy, Plutarch, and others. Through the general introduction, chronology of events, and introductions to each historian, Grant places the historians in the context of their world, and overall in Western culture. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Don't Try This At Home: Culinary Catastrophes from the World's Greatest Chefs",
        "Authors": "By Friedman, Andrew (EDT) and Witherspoon, Kimberly (EDT)",
        "Description": "DON'T TRY THIS AT HOMECulinary Catastrophes from the World's Greatest ChefsA hilarious and heartening collection of kitchen disasters.In this raucous new collection, over forty of the world's greatest chefs relate outrageous true tales from their kitchens. From hiring a blind line cook to flooding the room with meringue to being terrorized by a French owl, these behind-the-scenes accounts are as wildly entertaining as they are revealing. A delicious reminder that even the chefs we most admire aren't always perfect, Don't Try This at Home is a must-have for anyone who loves food or is fascinated by those who masterfully prepare it.Ferrán Adrià on when lobsters go badJosé Andrés on asking for help Dan Barber on talking to your fishMario Batali on the perfect risottoMichelle Bernstein on the many uses of chocolateHeston Blumenthal on the angriest maître d' in England Daniel Boulud on one thousand bowls of soup Anthony Bourdain on beating up the customersJimmy Bradley on drinking gamesScott Bryan on too many salamanders David Burke on hiding the laundry Samuel Clark on cooking for royalty Tom Colicchio on sneaking through customsScott Conant on the persistence of eelsTamasin Day-Lewis on how not to store a pheasantTom Douglas on the strange destiny of snowstormsWylie Dufresne on birds of preyJonathan Eismann on the healing powers of electricity Claudia Fleming on runaway meringue Gabrielle Hamilton on second sightFergus Henderson on the far from ordinaryPaul Kahan on caller IDHubert Keller on tempting fateGiorgio Locatelli on the art of the French ambushMichael Lomonaco on feeding Pavarotti Pino Luongo on summer school in the HamptonsMary Sue Milliken and Susan Feniger on getting away with it Sara Moulton on how to destroy a food processor Tamara Murphy on the misuses of foie gras Cindy Pawlcyn on eating at homeNeil Perry on unexpected showersMichel Richard on how to rescue a wayward cake Eric Ripert on getting to the kitchenAlain Sailhac on salty coffee and solitary confinementMarcus Samuelsson on the languages of gelatin Bill Telepan on the Fish Guys versus the Meat GuysLaurent Tourondel on rib-eye rush hour Tom Valenti on the grounds for revengeNorman Van Aken on Key West hi-jinksGeoffrey Zakarian on a license to eat dangerously",
        "Category": " Cooking , General",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Nature's Mind: Biological Roots Of Thinking, Emotions, Sexuality, Language, And Intelligence",
        "Authors": "By Gazzaniga, Michael S.",
        "Description": "The co-discoverer of the &#147;split brain” theory tells how science is recasting the age-old question of nature versus nurture to create a startling new view of human behavior. Recent discoveries suggest that natural selection affects not only physical characteristics but also mental processes, from learning to substance abuse.",
        "Category": " Psychology , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Dictionary of Science",
        "Authors": "By Ardley, Neil",
        "Description": "A cross-referenced volume provides concise definitions of more than two thousand words and concepts while offering examples of how each word is used in context, enabling young readers to become familiar with the fundamental principles of science.",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Curious George Tadpole Trouble (CGTV 8x8)",
        "Authors": "By Williams, Mark London and Akiyama, Bruce",
        "Description": "Curious George’s friend Bill has put him in charge of several tadpoles. George sends the tadpoles for a nice swim in the lagoon, but to his dismay, the tadpoles don’t return! Each time he goes back to the lake he tries to find the tadpoles, but he finds only tadpole-like creatures without tails . . . and with legs. A trip to the museum teaches George about the development of tadpoles into frogs, and he and Bill are happy to make the acquaintance of their new froggy friends!",
        "Category": " Juvenile Fiction , Animals , Apes, Monkeys, etc.",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Berenstain Bears' Trouble with Money",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "This classic Berenstain Bears story is a perfect way to teach children about the importance of being responsible with money!Come for a visit in Bear Country with this classic First Time Book® from Stan and Jan Berenstain. Mama and Papa are worried that Brother and Sister seem to think money grows on trees. To make money of their own, the cubs decide to start their very own businesses, from a lemonade stand to a pet-walking service. Includes over 50 bonus stickers!",
        "Category": " Juvenile Fiction , Concepts , Money",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Grayson",
        "Authors": "By Cox, Lynne",
        "Description": "The true story of a miraculous encounter between a teenaged girl and a baby whale off the coast of California It was the dark of early morning; seventeen-year-old Lynne Cox was swimming her last half mile back to the pier after a long workout when she became aware that something was swimming with her. The ocean was charged with energy as if a squall was moving in; whatever it was felt large enough to be a white shark coursing beneath her body. In fact, it was a baby gray whale. Lynne quickly realized that if she swam back to the pier, the young calf would follow her to shore and die from collapsed lungs. On the other hand, if Lynne didn't find the mother whale, the baby would suffer from dehydration and starve to death. Something so enormous'the mother whale would be at least fifty feet long'suddenly seemed very small in the vast Pacific Ocean. This is the story'part mystery, part magical tale'of what happened.",
        "Category": " Nature , Animals , Marine Life",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Charlie Needs a Cloak",
        "Authors": "By dePaola, Tomie",
        "Description": "A shepherd shears his sheep, cards and spins the wool, weaves and dyes the cloth, and sews a beautiful new red cloak.",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "Uncle John's Bathroom Reader Extraordinary Book of Facts: And Bizarre Information (Bathroom Readers)",
        "Authors": "By Bathroom Readers' Institute",
        "Description": "Uncle John's Bathroom Reader Extraordinary Book of Facts combines the most intriguing, enlightening material from nine previous Bathroom Reader favorites into one concise volume. Flush with delightfully useless — and sometimes even useful — information about sports, movies, music, politics, American and world history, and much more, the book is the most extensive reference guide in the series to date. Contained within this handy, portable tome are the fascinating narratives, terrific trivia, and easy-to-read lists that fans have come to delight in, as well as quotes, facts, findings, and historical tidbits. Weird and wonderful factoid footers on the bottom of each page are perfect for super-quick trips, while quizzes and puzzles enliven lengthier stays. Arranged for simple and speedy reference, the book is the perfect companion for trivia buffs and knowledge junkies who need a quick, fun read not just “at the office,” but in airports, waiting rooms, while traveling, or for any other moments that would otherwise be wasted.",
        "Category": " Reference , Trivia",
        "Publisher": "Portable Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "A Sweetness to the Soul (Dreamcatcher Series #1)",
        "Authors": "By Kirkpatrick, Jane",
        "Description": "Based on historical characters and events, A Sweetness to the Soul recounts the captivating story of young, spirited Oregon pioneer Jane Herbert who at the age of twelve faces a tragedy that begins a life-long search for forgiveness and love. In the years that follow, young Jane finds herself involved in an unusual and touching romance with a dreamer sixteen years her senior, struggles to make peace with an emotionally distant mother, and fights to build a family of her own. Filled with heart-warming insight and glimpses of real-life pain, A Sweetness to the Soul paints a brilliant picture of love that conquers all obstacles and offers a powerful testimony to the miracle of God's healing power.",
        "Category": " Fiction , Historical",
        "Publisher": "Multnomah Publishers",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "In Revere, in Those Days",
        "Authors": "By Merullo, Roland",
        "Description": "In this richly evocative novel--the moving story of one boy's coming of age--acclaimed author Roland Merullo will make you nostalgic for a small Massachusetts city called Revere even if you've never been there. Providing a window into an unspoiled America of forty years ago, In Revere welcomes you to the fiercely loyal and devoted Italian-American family of the Benedettos.Although he was orphaned as a child, young Anthony Benedetto was always surrounded by family, and the vibrant warmth of the Revere community. His Uncle Peter, a former Golden Gloves boxer whose days of glory were behind him, believed Tonio was bound for great things. So did his daughter Rosie, Tonio's favorite cousin, who would take many wrong turns--away from Tonio--through adolescence. His gentle grandparents, who took him in, encouraged him to claim a future outside of Revere, but the warm, unconditional love of his family, and the smells and sounds of Revere stay with him forever.",
        "Category": " Fiction , Coming of Age",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Singing and Dancing Daughters of God",
        "Authors": "By Schaffert, Timothy",
        "Description": "A blithe and redemptive seriocomic love story filled with country music, the ghosts of Halloween, and an ironic brand of down-home religion.Newly divorced and feeling the pain of separation from his family, Hud Smith channels his regret into writing country-western songs, contemplating life on the lam with his 8-year-old daughter, and searching cryptic postcards for news of his teenage son who has run off with The Daughters of God, an alternative Gospel-punk band of growing fame. Then he finds himself inching toward reconciliation with his ex, tossing his whole talent for misery into question as they head off in a borrowed school bus, hoping so very tentatively to bring the entire family together again.In this endearing misadventure that threatens to turn out right in spite of it all, Schaffert writes a thin line between tragedy and hilarity, turning wry humor and a keen sense of the paradoxical onto characters who deserve all the tender care he gives them.",
        "Category": " Fiction , Literary",
        "Publisher": "Unbridled Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Our Lady of the Lost and Found: A Novel of Mary, Faith, and Friendship",
        "Authors": "By Schoemperlen, Diane",
        "Description": "One Monday morning in April, a middle-aged writer walks into her living room to water the plants and finds a woman standing beside her potted fig tree. Dressed in a navy blue trench coat and white Nikes, the woman introduces herself as \"Mary. Mother of God.... You know. Mary.\" Instead of a golden robe or a crown, she arrives bearing a practical wheeled suitcase. Weary after two thousand years of adoration and petition, Mary is looking for a little R & R. She's asked in for lunch, and decides to stay a week. As the story of their visit unfolds, so does the story of Mary-one of the most complex and powerful female figures of our time-and her changing image in culture, art, history, as well as the thousands of recorded sightings that have placed her everywhere from a privet hedge to the dented bumper of a Camaro.As this Everywoman and Mary become friends, their conversations, both profound and intimate, touch upon Mary's significance and enduring relevance. Told with humor and grace, Our Lady of the Lost and Found is an absorbing tour through Mary's history and a thoughtful meditation on spirituality, our need for faith, and our desire to believe in something larger than ourselves.",
        "Category": " Fiction , Religious",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Joy of Pi",
        "Authors": "By Blatner, David",
        "Description": "No number has captured the attention and imagination of people throughout the ages as much as the ratio of a circle's circumference to its diameter. Pi–or ? as it is symbolically known–is infinite and, in The Joy of pi, it proves to be infinitely intriguing. With incisive historical insight and a refreshing sense of humor, David Blatner explores the many facets of pi and humankind's fascination with it–from the ancient Egyptians and Archimedes to Leonardo da Vinci and the modern-day Chudnovsky brothers, who have calculated pi to eight billion digits with a homemade supercomputer.The Joy of Pi is a book of many parts. Breezy narratives recount the history of pi and the quirky stories of those obsessed with it. Sidebars document fascinating pi trivia (including a segment from the 0. J. Simpson trial). Dozens of snippets and factoids reveal pi's remarkable impact over the centuries. Mnemonic devices teach how to memorize pi to many hundreds of digits (or more, if you're so inclined). Pi-inspired cartoons, poems, limericks, and jokes offer delightfully \"square\" pi humor. And, to satisfy even the most exacting of number jocks, the first one million digits of pi appear throughout the book.A tribute to all things pi, The Joy of pi is sure to foster a newfound affection and respect for the big number with the funny little symbol.",
        "Category": " Young Adult Nonfiction , Mathematics , General",
        "Publisher": "Walker Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Miracles of Santo Fico",
        "Authors": "By Smith, D. L.",
        "Description": "A magical story of love...and miracles After twenty years, Leo Pizzola has come back to the Tuscan village of Santo Fico, still single and still looking for a way to get rich. The town is as poor as it was when Leo left, yet some things have changed. Of Leo's childhood companions, only little Guido, whom everyone calls \"Topo,\" embraces him. His best friend is long dead. The woman he once adored refuses to talk to him. And, worst of all, the kindly old town priest seems to have lost his faith. Perhaps what Santo Fico needs is a miracle-even if Leo and Topo have to manufacture one themselves. Now, as one botched scheme after another unravels, something completely unexpected happens, and wonders indeed begin to transform this Italian town, including the greatest miracle of all... Published around the world, this debut novel sparkles with the Italian spirit and emotions that will dance off the page and into your heart.",
        "Category": " Fiction , Religious",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Hazards of Good Breeding: A Novel",
        "Authors": "By Shattuck, Jessica",
        "Description": "This \"richly appointed and generously portrayed\" (Kirkus Reviews) debut novel tells the story of a WASPy, old-Boston family coming face to face with an America much larger than the one it was born in. Told from five perspectives, the novel spans an explosive week in the life of the Dunlaps, culminating in a series of events that will change their way of life forever.Caroline Dunlap has written off the insular world of the Boston deb parties, golf club luaus, and WASP weddings that she grew up with. But when she reluctantly returns home after her college graduation, she finds that not everything is quite as predictable, or protected, as she had imagined. Her father, the eccentric, puritanical Jack Dunlap, is carrying on stoically after the breakup of his marriage, but he can't stop thinking of Rosita, the family housekeeper he fired almost six months ago. Caroline's little brother, Eliot, is working on a giant papier-mâché diorama of their town—or is he hatching a plan of larger proportions?As the real reason for Rosita's departure is revealed, the novel culminates in a series of events that assault the fragile, sheltered, and arguably obsolete world of the Dunlaps.Opening a window into a family's repressed desires and fears, The Hazards of Good Breeding is a startlingly perceptive comedy of manners that heralds a new writer of dazzling talent.A New York Times Notable Selection and a Boston Globe Book of the Year.",
        "Category": " Fiction , Literary",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "It's in the Bag (Leisure Arts #15920)",
        "Authors": "By Leisure Arts",
        "Description": "",
        "Category": "",
        "Publisher": "Leisure Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Beneath a Marble Sky: A Love Story",
        "Authors": "By Shors, John",
        "Description": "Journey to dazzling seventeenth-century Hindustan, where the reigning emperor, consumed with grief over the tragic death of his beloved wife, commissioned the building of a grand mausoleum as a testament to the marvel of their love. This monument would soon become known as the Taj Mahal—a sight famous around the world for its beauty and the emotions it symbolizes.   Princess Jahanara, the courageous daughter of the emperor and his wife, recounts their mesmerizing tale, while sharing her own parallel story of forbidden love with the celebrated architect of the Taj Mahal. Set during a time of unimaginable wealth and power, murderous sibling rivalries, and cruel despotism, this impressive novel sweeps you away to a historical Hindustan brimming with action and intrigue in an era when, alongside the brutalities of war and oppression, architecture and the art of love and passion reached a pinnacle of perfection.",
        "Category": " Fiction , Historical",
        "Publisher": "NAL Trade",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Dancing Naked at the Edge of Dawn: A Novel",
        "Authors": "By Radish, Kris",
        "Description": "From the bestselling author of The Elegant Gathering of White Snows comes a poignant, outrageous, refreshingly liberating story about one woman whose life takes an unexpected turn....Meg Fratano has just witnessed the unthinkable: her husband of twenty—seven years making love to another woman. In her bed. And all Meg wanted to do was watch. Quietly, secretly, watch. Then she realized her life would never be the same. Meg isn’t sure what she wants, but she knows it’s not what she had. After almost three decades of marriage and two children, she has finally awakened to how unhappy she is. Now, with the help of friends old and new, and even her teenage daughter—a former brat who has blossomed into a startlingly wise young woman—Meg just might break through the chains of everyone’s expectations for her and find the strength to take the first step on her own path. To strip away a lifetime of inhibitions. To dance naked at the edge of dawn...",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "The Last Empress: A Novel",
        "Authors": "By Min, Anchee",
        "Description": "The last decades of the nineteenth century were a violent period in China’s history marked by humiliating foreign incursions and domestic rebellion, ultimately ending in the demise of the Ch’ing dynasty. The only constant during this tumultuous time was the power wielded by one person, the resilient, ever-resourceful Tzu Hsi,  Lady Yehonala -- or Empress Orchid, as readers came to know her in Anchee Min’s critically acclaimed novel covering the first part of her life.The Last Empress is the story of Orchid’s dramatic transition from a strong-willed, instinctive young woman to a wise and politically savvy leader who ruled China for more than four decades. Moving from the intimacy of the concubine quarters into the spotlight of the world stage, Orchid must face not only the perilous condition of her empire but also a series of devastating personal losses, as first her son and then her adopted son succumb to early death. Yearning only to step aside, and yet growing constantly into her role, only she—allied with the progressives, but loyal to the conservative Manchu clan of her dynasty—can hold the nation’s rival factions together.Anchee Min offers a powerful revisionist portrait based on extensive research of one of the most important figures in Chinese history. Viciously maligned by the western press of the time as the “Dragon Lady,” a manipulative, blood-thirsty woman who held onto power at all costs, the woman Min gives us is a compelling, very human leader who assumed power reluctantly, and who sacrificed all she had to protect those she loved and an empire that was doomed to die.",
        "Category": " Fiction , Historical",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Good People of New York",
        "Authors": "By Nissen, Thisbe",
        "Description": "When Roz Rosenzweig meets Edwin Anderson fumbling for keys on the stoop of a Manhattan walk-up, the last thing on her mind is falling for a polite Nebraskan–yet fall for him she does. So begins Thisbe Nissen’s breathtaking debut novel, a decidedly urban fairy tale that follows Roz and Edwin as they move from improbable courtship to marriage to the birth of daughter Miranda–the locus of all Roz’s attention, anxiety, and often smothering affection. As Miranda comes of age and begins to chafe against the intensity of her mother’s neurotic love, Roz must do her best to let those she cherishes move into the world without her. On crowded subways, in strange bedrooms, at Bar Mitzvahs, in brownstone basements and high school gymnasiums, Nissen’s unforgettable characters make their hilarious and wrenching way–and prove, indeed, that good things thrive in New York City.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Enchanted Castle (Puffin Classics)",
        "Authors": "By Nesbit, Edith and Millar, H. R.",
        "Description": "E. Nesbit's classic story of how Gerald, Cathy and Jimmy find an enchanted garden and awake a princess from a hundred-year sleep, only to have her immediately made invisible by a magic ring. Her rescue is difficult, funny and sometimes frightening.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Blood of Heaven (Fire of Heaven Trilogy, Book 1)",
        "Authors": "By Myers, Bill",
        "Description": "Mysterious blood has been discovered on the remains of an ancient religious artifact. Some believe it is the blood of Christ. And experiments with specific genes from the blood have brought surprising findings. Now it’s time to introduce those genes into a human.Enter Michael Coleman: multiple killer, death-row resident . . . and, if he is willing, human guinea pig.There are no promises. The effects may kill Coleman or completely destroy his sanity. He agrees to the experiment, with results so astonishing that the research must continue--but not in prison. Given a new identity and new employer, Katherine Lyon, Coleman reenters society. And that’s when a plot far darker than science alone could construct begins to emerge.A carefully researched science and psychological thriller, Blood of Heaven is a nonstop page turner that looks deep into the heart of man, examining the nature of good and evil, flesh versus spirit, and the ever-growing controversy over genetically determined",
        "Category": " Fiction , Christian , Suspense",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "The Potomac",
        "Authors": "By Gutheim, Frederick Albert",
        "Description": "Traces the course of the Potomac River from its origin in West Virginia to the Chesapeake Bay, and recounts historic events that have occurred along the river",
        "Category": "",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "11.02",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Sexual Healing",
        "Authors": "By Nelson, Jill",
        "Description": "Now in paperback, the critically acclaimed Essence bestseller is a blistering satire of American gender, race, and economic relations. Sexual Healing starts by exploring a simple if sensational premise?what would happen if two black businesswomen started a brothel that served up male sex workers hired and trained to meet black women’s most intimate needs? Jill Nelson uses this set-up as an opportunity to spin a comedy of outrageous manners for the 21st century in her inimitably uninhibited voice. The result is what Ebony called, ?A post-feminist fable of sexual empowerment that’s smart, explicit, and side-splittingly funny.”",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Agate Bolden",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The Canon: A Whirligig Tour of the Beautiful Basics of Science",
        "Authors": "By Angier, Natalie",
        "Description": "From the Pulitzer Prize winner and best-selling author of Woman, a playful, passionate guide to the science all around usWith the singular intelligence and exuberance that made Woman an international sensation, Natalie Angier takes us on a whirligig tour of the scientific canon. She draws on conversations with hundreds of the world's top scientists and on her own work as a Pulitzer Prize-winning writer for the New York Times to create a thoroughly entertaining guide to scientific literacy. Angier's gifts are on full display in The Canon, an ebullient celebration of science that stands to become a classic.The Canon is vital reading for anyone who wants to understand the great issues of our time -- from stem cells and bird flu to evolution and global warming. And it's for every parent who has ever panicked when a child asked how the earth was formed or what electricity is. Angier's sparkling prose and memorable metaphors bring the science to life, reigniting our own childhood delight in discovering how the world works. \"Of course you should know about science,\" writes Angier, \"for the same reason Dr. Seuss counsels his readers to sing with a Ying or play Ring the Gack: These things are fun and fun is good.\"The Canon is a joyride through the major scientific disciplines: physics, chemistry, biology, geology, and astronomy. Along the way, we learn what is actually happening when our ice cream melts or our coffee gets cold, what our liver cells do when we eat a caramel, why the horse is an example of evolution at work, and how we're all really made of stardust. It's Lewis Carroll meets Lewis Thomas -- a book that will enrapture, inspire, and enlighten.",
        "Category": " Science , Reference",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Ex-Girl To The Next Girl",
        "Authors": "By Poole, Daaimah S.",
        "Description": "After stealing--and marrying--her former best friend Kim's fiancé, Shonda expects to have a good life but instead gets a rude awakening when he takes up with another woman, while Kim, moving on with her life, finds a new man who just might be Mr. Right. Original.",
        "Category": " Fiction , General",
        "Publisher": "Dafina",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Cloud of Unknowing",
        "Authors": "By Cook, Thomas H.",
        "Description": "David Sears grew up in the shadow of his brilliant sister, Diana, convinced by their father that she would accomplish great things. Instead, she married and had a son, Jason, who—like David and Diana’s father—is schizophrenic. Her husband, Mark, a geneticist, never made peace with Jason’s condition. Perhaps this is why Diana will not accept the authorities’ conclusion that Jason’s drowning death was accidental. Or perhaps Diana is going mad. As she builds a case against her husband and the seductive qualities of her manic energy become impossible to ignore, David finds himself afraid for his own family’s safety. In The Cloud of Unknowing, Cook explores the power of blood and family mythology.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Sleepover Sleuths (Nancy Drew and the Clue Crew #1)",
        "Authors": "By Keene, Carolyn and Pamintuan, Macky (ILT)",
        "Description": "Eight-year-old Nancy Drew has her first case to crack! Can you help?   Nancy and her two best friends, George and Bess, are so excited! They have been invited to Deirdre's sleepover party! There will be pizza, cake, and even a pajama fashion show. But the most exciting thing is that the party has a City Girls doll theme. All of the guests are bringing their dolls with them!   But then Deirdre's City Girls doll -- Hollywood Heather -- goes missing. Is her sleepover ruined? Or is there a detective in the room who can make sense of this mystery?",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "The Berenstain Bears and the Missing Honey",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "This classic Berenstain Bears story is full of fun and excitement for even the littlest of detectives!Come for a visit in Bear Country with this classic First Time Book® from Stan and Jan Berenstain. Someone has stolen Papa’s blackberry honey, and it’s up to Brother, Sister, and Cousin Fred –The Bear Detectives ­– to solve the case. Includes over 50 bonus stickers!",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Clifford's ABC",
        "Authors": "By Bridwell, Norman",
        "Description": "Every letter in this alphabet book is illustrated with inspiring pictures featuring Clifford, the big red dog",
        "Category": "",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Pondlarker",
        "Authors": "By Gwynne, Fred",
        "Description": "Not satisfied being a frog, Pondlarker seeks a princess' kiss to fulfill his princely ambitions",
        "Category": "",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Take Me Out of the Bathtub and Other Silly Dilly Songs",
        "Authors": "By Catrow, David (ILT) and Katz, Alan",
        "Description": "Remember...  \"Take Me Out to the  Ballgame\"  and  \"I've Been Working on the  Railroad\"?  Songwriter and comedy writer extraordinaire Alan Katz has turned those and other old favorites on their ears and created new nonsense songs kids will love. With zany, spirited pictures by illustrator and cartoonist David Catrow, this kooky collection guarantees laughs and plenty of silly dillyness for kids everywhere!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Rooster's off to See the World",
        "Authors": "By Carle, Eric",
        "Description": "",
        "Category": "",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "You Be Good and I'll Be Night",
        "Authors": "By Schmidt, Karen Lee (ILT) and Merriam, Eve",
        "Description": "Bounce on the bed! Touch the sky! Take a train! Stop for lunch! Make a wish! Acclaimed poet Eve Merriam invites children to enjoy all these marvelous experiences -- and more -- through lively, exuberant verse guaranteed to inspire them to respond to the rhythmic delights of poetry.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "HarperTrophy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Bob's Egg Hunt (Bob the Builder)",
        "Authors": "By Auerbach, Annie and Goldberg, Barry (ILT)",
        "Description": "CAN THEY FIND THEM? YES, THEY CAN!  To celebrate spring, Bob has planned a special egg hunt for his friends. Lift the flaps and join in the fun as Bob's team looks for eggs and finds lots of unexpected surprises along the way!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Revealers",
        "Authors": "By Wilhelm, Doug",
        "Description": "Throwing light on a dark problemParkland Middle School is a place the students call Darkland, because no one in it does much to stop the daily harassment of kids by other kids. Three bullied seventh graders use their smarts to get the better of their tormentors by starting an unofficial e-mail forum at school in which they publicize their experiences. Unexpectedly, lots of other kids come forward to confess their similar troubles, and it becomes clear that the problem at their school is bigger than anyone knew. The school principal wants to clamp down on the operation, which she does when the trio, in their zealousness for revenge, libel a fellow student in what turns out to have been a setup. Now a new plan of attack is needed . . . This suspenseful story of computer-era underground rebellion offers fresh perspectives on some of the most enduring themes in fiction for young readers.  The Revealers is a 2004 Bank Street - Best Children's Book of the Year.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Farrar, Straus and Giroux (BYR)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Teddy Bear For Sale (level 1) (Hello Reader)",
        "Authors": "By Herman, Gail and Cushman, Doug (ILT)",
        "Description": "A childless teddy bear decides to run away from the store when customers prefer balls, bats, paint sets, and toy trucks to him, in an easy-to-read adventure with a happy ending. Original.",
        "Category": "",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Wartime: Understanding and Behavior in the Second World War",
        "Authors": "By Fussell, Paul",
        "Description": "Winner of both the National Book Award for Arts and Letters and the National Book Critics Circle Award for Criticism, Paul Fussell's The Great War and Modern Memory was one of the most original and gripping volumes ever written about the First World War.  Frank Kermode, in The New York Times Book Review, hailed it as \"an important contribution to our understanding of how we came to make World War I part of our minds,\" and Lionel Trilling called it simply \"one of the most deeply moving books I have read in a long time.\"  In its panaramic scope and poetic intensity, it illuminated a war that changed a generation and revolutionized the way we see the world.Now, in Wartime, Fussell turns to the Second World War, the conflict he himself fought in, to weave a narrative that is both more intensely personal and more wide-ranging. Whereas his former book focused primarily on literary figures, on the image of the Great War in literature, here Fussell examines the immediate impact of the war on common soldiers and civilians. He describes the psychological and emotional atmosphere of World War II.  He analyzes the euphemisms people needed to deal with unacceptable reality (the early belief, for instance, that the war could be won by \"precision bombing,\" that is, by long distance); he describes the abnormally intense frustration of desire and some of the means by which desire was satisfied; and, most important, he emphasizes the damage the war did to intellect, discrimination, honesty, individuality, complexity, ambiguity and wit.  Of course, no Fussell book would be complete without some serious discussion of the literature of the time.  He examines, for instance, how the great privations of wartime (when oranges would be raffled off as valued prizes) resulted in roccoco prose styles that dwelt longingly on lavish dinners, and how the \"high-mindedness\" of the era and the almost pathological need to \"accentuate the positive\" led to the downfall of the acerbic H.L. Mencken and the ascent of E.B. White. He also offers astute commentary on Edmund Wilson's argument with Archibald MacLeish, Cyril Connolly's Horizon magazine, the war poetry of Randall Jarrell and Louis Simpson, and many other aspects of the wartime literary world. Fussell conveys the essence of that wartime as no other writer before him.  For the past fifty years, the Allied War has been sanitized and romanticized almost beyond recognition by \"the sentimental, the loony patriotic, the ignorant, and the bloodthirsty.\"  Americans, he says, have never understood what the Second World War was really like. In this stunning volume, he offers such an understanding.",
        "Category": " Fiction , Classics",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Hole in My Life",
        "Authors": "By Gantos, Jack",
        "Description": "Becoming a writer the hard wayIn the summer of 1971, Jack Gantos was an aspiring writer looking for adventure, cash for college tuition, and a way out of a dead-end job. For ten thousand dollars, he recklessly agreed to help sail a sixty-foot yacht loaded with a ton of hashish from the Virgin Islands to New York City, where he and his partners sold the drug until federal agents caught up with them. For his part in the conspiracy, Gantos was sentenced to serve up to six years in prison.In Hole in My Life, this prizewinning author of over thirty books for young people confronts the period of struggle and confinement that marked the end of his own youth. On the surface, the narrative tumbles from one crazed moment to the next as Gantos pieces together the story of his restless final year of high school, his short-lived career as a criminal, and his time in prison. But running just beneath the action is the story of how Gantos – once he was locked up in a small, yellow-walled cell – moved from wanting to be a writer to writing, and how dedicating himself more fully to the thing he most wanted to do helped him endure and ultimately overcome the worst experience of his life. Hole in My Life is a 2003 Bank Street - Best Children's Book of the Year.",
        "Category": " Young Adult Nonfiction , Law & Crime",
        "Publisher": "Farrar, Straus and Giroux (BYR)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Body Surfing: A Novel",
        "Authors": "By Shreve, Anita",
        "Description": "\"Always readable-sometimes compulsively so-Shreve's novels are typically emotionally resonant, nicely paced, and populated by memorable characters.\" -People  At the age of 29, Sydney has already been once divorced and once widowed. Trying to regain her footing, she has signed on to tutor the teenage daughter of a well-to-do couple as they spend a sultry summer in their oceanfront New Hampshire cottage.  But when the Edwardses' two grown sons arrive at the beach house, Sydney finds herself caught up in a destructive web of old tensions and bitter divisions. As the brothers vie for her affections, the fragile existence Sydney has rebuilt is threatened.With the subtle wit, lyrical language, and brilliant insight into the human heart that has led her to be called \"an author at one with her métier\" (Miami Herald), Shreve weaves a novel about marriage, family, and the supreme courage it takes to love.\"Shreve excels at nuance and detail. She skillfully illuminates the tiniest of moments, offering readers a peek at the complex undertones coursing through the characters throughout the story.\" -Rocky Mountain News\"There is something satisfyingly clean, well functioning, pale, and delicious about an Anita Shreve novel. . . . Shreve's characters, grappling with desire, juggling their shame against their regret, are entirely welcome.\" -Boston Globe\"Shreve's writing is textured, reflective, and generally flows with ease, to the point where the reader may be surprised at how quickly the pages turn.\" -Newsday",
        "Category": " Fiction , Literary",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Unless: A Novel (P.S.)",
        "Authors": "By Shields, Carol",
        "Description": "“Nothing short of astonishing.”  — New Yorker“A thing of beauty—lucidly written, artfully ordered, riddled with riddles and undergirded with dark layers of philosophical meditations.”  — Los Angeles TimesFor all of her life, 44 year old Reta Winters has enjoyed the useful monotony of happiness: a loving family, good friends, growing success as a writer of light 'summertime' fiction. But this placid existence is cracked wide open when her beloved eldest daughter, Norah, drops out to sit on a gritty street corner, silent but for the sign around her neck that reads 'GOODNESS.' Reta's search for what drove her daughter to such a desperate statement turns into an unflinching and surprisingly funny meditation on where we find meaning and hope. The final book from Pulitzer Prize-winner Carol Shields, Unless, is a harrowing but ultimately consoling story of one family's anguish and healing, proving Shields's mastery of extraordinary fictions about ordinary life.",
        "Category": " Fiction , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Through Grandpa's Eyes (Reading Rainbow Books)",
        "Authors": "By MacLachlan, Patricia and Ray, Deborah",
        "Description": "From Patricia MacLachlan, beloved author of the Newbery Medal–winning Sarah, Plain and Tall, comes a touching story that teaches children how to look at the world in different ways. John’s favorite house is his grandfather’s—not because it is fancy or new but because he sees it through his Grandpa’s eyes. Grandpa is blind, and so when John visits him he gets to see things from a new perspective. If he closes his eyes, everything comes alive through sound and touch. This house is the place where John gets to experience the special way Grandpa sees and moves in the world.",
        "Category": " Juvenile Fiction , Social Themes , New Experience",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "Marie Antoinette: The Journey",
        "Authors": "By Fraser, Antonia",
        "Description": "France's iconic queen, Marie Antoinette, wrongly accused of uttering the infamous \"Let them eat cake,\" was alternately revered and reviled during her lifetime. For centuries since, she has been the object of debate, speculation, and the fascination so often accorded illustrious figures in history. Married in mere girlhood, this essentially lighthearted child was thrust onto the royal stage and commanded by circumstance to play a significant role in European history. Antonia Fraser's lavish and engaging portrait excites compassion and regard for all aspects of the queen, immersing the reader not only in the coming-of-age of a graceful woman, but in the culture of an unparalleled time and place.",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Who Sank the Boat? (Paperstar)",
        "Authors": "By Allen, Pamela",
        "Description": "A charmingly funny read-aloud that asks an important question: \"Who sank the boat?\"Beside the sea, there once lived a cow, a donkey, a sheep, a pig, and a tiny little mouse. They were good friends, and one warm, sunny morning, for no particular reason, they decided to go for a row in the bay. Do you know who sank the boat? “The idea is funny, the pictures are splendid, and the easy text is just right for the very young.”—The New Yorker “A bright, brisk tale, simply told, illustrated by cheerful, comical pictures.”—The Bulletin of the Center for Children’s Books",
        "Category": " Juvenile Fiction , Transportation , Boats, Ships & Underwater Craft",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Tortoise and the Hare (A Little Golden Book)",
        "Authors": "By Margo Lundell",
        "Description": "Recounts the race between the boastful hare and the persevering tortoise.",
        "Category": "",
        "Publisher": "Western Pub. Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Walt Disney Productions presents Aladdin and the missing jewel chest (Disney's wonderful world of reading)",
        "Authors": "By Walt Disney Company",
        "Description": "With the help of his magic medal, Aladdin attempts to rescue his magic lamp and his wife's jewel chest from a wicked magician.",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Tara Road",
        "Authors": "By Binchy, Maeve",
        "Description": "With each new book, Maeve Binchy continues a remarkable progression of sales and audience growth, reaching fans of all ages and backgrounds with her matchless wit, warmth, and sheer storytelling magic.  Tara Road, her first full-length novel since The Glass Lake, again shows her incomparable understanding of the human heart in the tale of two women, one from Ireland, one from America, who switch lives, and in doing so learn much about each other, as well as much about themselves.Ria lived on Tara Road in Dublin with her dashing husband, Danny, and their two children.  She fully believed she was happily married, right up until the day Danny told her he was leaving her to be with his young, pregnant girlfriend.  By a chance phone call, Ria meets Marilyn, a woman from New England unable to come to terms with her only son's death and now separated from her husband.  The two women exchange houses for the summer with extraordinary consequences, each learning that the other has a deep secret that can never be revealed.Drawn into lifestyles vastly differing from their own, at first each resents the news of how well the other is getting on.  Ria seems to have become quite a hostess, entertaining half the neighborhood, which at first irritates the reserved and withdrawn Marilyn, a woman who has always guarded her privacy.  Marilyn seems to have become bosom friends with Ria's children, as well as with Colm, a handsome restaurateur, whom Ria has begun to miss terribly.  At the end of the summer, the women at last meet face-to-face.  Having learned a great deal, about themselves and about each other, they find that they have become, firmly and forever, good friends.A moving story rendered with the deft touch of a master artisan, Tara Road is Maeve Binchy at her very best--utterly beautiful, hauntingly unforgettable, entirely original, and wholly enjoyable.",
        "Category": " Fiction , Literary",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Classroom Crack-ups! (SpongeBob SquarePants)",
        "Authors": "By Lewman, David",
        "Description": "Presents jokes about school and the characters from the television show \"SpongeBob SquarePants.\"",
        "Category": " Juvenile Nonfiction , Humor , Jokes & Riddles",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Pooh Goes Visiting (A Winnie-The-Pooh Story Book)",
        "Authors": "By Milne, A. A. and Shepard, Ernest H. (ILT)",
        "Description": "When Winnie-the-Pooh visits his friend Rabbit, he gets stuck in the entrance hole.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Dutton Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "The C & O Canal Companion",
        "Authors": "By High, Mike",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Bridges: A History of the World's Most Famous and Important Spans",
        "Authors": "By Judith Dupre",
        "Description": "",
        "Category": "",
        "Publisher": "Black Dog & Leventhal Publishers",
        "Price Starting With ($)": "18.81",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "True Valor (Uncommon Heroes, Book 2)",
        "Authors": "By Henderson, Dee",
        "Description": "Air Force pararescueman Bruce \"Striker\" Stanton spends his life rescuing pilots downed behind enemy lines, and Grace Yates flies an F/A-18 Hornet for the Navy. On their dangerous jobs away from home, they exchanged love letters. Now a fight between Syria and Turkey over water rights on the Euphrates has spiraled into a confrontation NATO finds itself struggling to prevent. For the military deployed in the region, it's not just the occasional news headline -- it's their daily problem. But when a missing Navy pilot turns out to be Gracie, Bruce has got one mission: get her out alive ...",
        "Category": " Religion , Christianity , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Jesus: His life and times",
        "Authors": "By Timothy J. Dailey, PH.D., Don Blosser, PH.D., Dietrich Gruen, Randy Petersen, Thomas E. Schmidt, PH.D.",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    }
]