[
    {
        "Title": "Internet Resources for Nurses",
        "Authors": "By Fitzpatrick, Joyce J. (EDT) and Montgomery, Kristen S. (EDT)",
        "Description": "This new edition of the award-winning guide to the web for nurses is nearly double in size and twice as useful! Expert nurses in more than 50 content areas have carefully selected and reviewed nearly 400 web sites available in their specialty areas --- resulting in an authoritative guide to the best the web has to offer for the professional nurse. Each web description includes a summary of the site, intended audience, sponsor, level of information, and relevance to nurses. The book also indicates sites which can be referred to patients.",
        "Category": " Medical , Nursing , General",
        "Publisher": "Springer Pub Co",
        "Price Starting With ($)": "10.49",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Workfare or Fair Work: Women, Welfare, and Government Work Programs",
        "Authors": "By Rose, Nancy Ellen",
        "Description": "Can the welfare system  in the United States accord  people dignity? That question is often left out of the current debates  over welfare and workfare. In this provocative book, Nancy Rose argues  that the United States has been successful in the past––notably during  the New Deal and in the 1970s––at shaping programs that gave people  “fair work.”            However, as Rose documents, those innovative  job creation programs were voluntary and were mainly directed at  putting men back to work. Women on welfare, and especially women of  color,  continue to be forced into a very different kind of program:  mandatory, punitive, and demeaning. Such workfare programs are set up  for failure. They rarely train women for jobs with futures, they ignore  the needs of the women’s families, and they do not pay an honest wage.  They perpetuate poverty rather than prevent it.           Rose  uses the history of U.S. job creation programs to show alternatives to  mandatory workfare. Any effort to redesign welfare in America needs to  pay close attention to the lessons drawn from this perceptive analysis  of the history of women, welfare, and work. This is an indispensable  book for students, scholars, policymakers, politicians, and  activists––for everyone who knows the system is broken and wants to fix  it.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Rutgers University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "I am not the other Houdini",
        "Authors": "By Conner, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Hard Sell",
        "Authors": "By Anthony, Piers",
        "Description": "When Fisk Centers is persuaded to invest in some Martian real esate, he finds he has bought himself more trouble than he expected, from participating in a suicide fusion car race to narrowly escaping from premature embalming by a robot mortician",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tafford Pub",
        "Price Starting With ($)": "17.56",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Quantitative Analysis for Management (Quantitative Methods and Applied Statistics)",
        "Authors": "By Stair, Ralph M. and Render, Barry",
        "Description": "",
        "Category": "",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "7.92",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Chelsea Girl Murders: A Robin Hudson Mystery (Robin Hudson Mysteries)",
        "Authors": "By Hayter, Sparkle",
        "Description": "When a fire forces TV executive Robin Hudson to vacate her apartment, she and her cat, Louise Bryant, move into the fabled Chelsea Hotel, the bohemian hostelry where artists both famous and infamous have long lived in semipeaceful coexistence with countless hangers-on, wanna-bes, and rubberneckers looking for the \"real\" New York.Then a smoky-eyed art dealer she's just met dies on her doorstep, drawing Robin reluctantly into a murder investigation. Is the murder related in some way to the star-crossed and rather irritable young lovers who have appealed to Robin for help? Or to a deadly catfight between rival lovers of the dead man? And how do the cake-baking nuns of Immaculate Confection, Inc., figure in it?To sort it out, Robin must brave the whole downtown scene and more: guerrilla artists, jealous women, Zen bodybuilders, gouty widows, and befuddled tourists. It could make a girl crazy, having to dig deep into the history of the venerable hotel nicknamed (not without reason) \"the mother ship.\" Oh, plus ... one final, terrible complication: Robin seems to have fallen accidentally in love.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The werewolf trace",
        "Authors": "By Gardner, John E.",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Lots of limericks: light, lusty, and lasting",
        "Authors": "By Untermeyer, Louis",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "9.92",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Communication: Means and Technologies for Exchanging Information",
        "Authors": "By Ventura, Piero and Casalini, Max",
        "Description": "A colorfully illustrated, humorous exploration of the development of human communication tracks progress from Stone Age pictograms and cave paintings, through the evolution of writing, to today's books, films, and satellites.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Big Sky Country: The Best of Montana, North Dakota, Wyoming, and Idaho",
        "Authors": "By Melford, Michael (PHT), Melford, Michael, and Kittredge, William (INT)",
        "Description": "The rugged mountains and pristine valleys of the Northern Rockies are captured in Michael Melford's photographs - landscapes of power and beauty that evoke a sense of wonder at the infinite variety of nature that can never be fully explored or understood.Included are famous natural landmarks - Craters of the Moon in Idaho, St. Mary's Lake in Glacier National Park, Devil's Tower in Wyoming, and, of course, Old Faithful - as well as the simple structures of the plains - churches, barns, and school houses - that speak to life in the Far West.In the introduction William Kittredge describes the realities of life in Montana, a place he chose in his search for \"a genuine world to inhabit.\"",
        "Category": " History , United States , General",
        "Publisher": "Rizzoli",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Basic Bookbinding",
        "Authors": "By Lewis, Arthur William",
        "Description": "Starting from basic principles and assuming no previous experience, this modern exposition of the elements of bookbinding enables both the beginner and the expert to apply the latest and most simplified techniques to rebinding old favorites and binding many new paperback books.A complete list of all necessary materials, including a guide to the proper selection of tools, paper, boards, cloth, leather, or sheepskin covering fabrics and lettering inks and pigments, introduces the subject. In surprisingly easy stages, you are shown how to collate a book, sew it, back it, trim it, make boards, and attach them to the book. Step-by-step instructions and hundreds of photographs and diagrams of equipment and key operations reduce the process to essentials.Individual chapters are devoted to single-sectioned, multi-sectioned, and case-bound books, hollow-backed and library style binding, the use of end papers, and the most practical methods of lettering the finished book. The author includes a valuable appendix which summarizes the precise steps followed in each operation in convenient tabular form.An elementary text, simple enough for the beginner yet containing new material of interest to the expert, Basic Bookbinding avoids intricate techniques and elaborate equipment. Mr. Lewis, twice first prize winner in national competition, presents the subject with the clarity born of many years of experience in teaching bookbinding.",
        "Category": " Crafts & Hobbies , Book Printing & Binding",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1957"
        }
    },
    {
        "Title": "Ties That Stress: The New Family Imbalance",
        "Authors": "By Elkind, David",
        "Description": "What has happened to the American family in the last few decades? And what are these changes doing to our children? David Elkind, renowned child psychologist and author of The Hurried Child, has devoted his career to these urgent questions. This eloquent book puts together all the puzzling facts and conflicting accounts to show us as never before what the American family has become.",
        "Category": " Psychology , General",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Ernest Hemingway: Rediscovered",
        "Authors": "By Fuentes, Norberto, Sotolongo, Roberto Herrera (PHT), and Herrera Sotolongo, Roberto",
        "Description": "",
        "Category": " Biography & Autobiography , Philosophers",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Fabergé eggs: Imperial Russian fantasies",
        "Authors": "By Fabergé (Firm)",
        "Description": "",
        "Category": "",
        "Publisher": "H. N. Abrams",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Out of the Past: Amish Tradition and Faith",
        "Authors": "By McDonald, Mary Ann",
        "Description": "",
        "Category": "",
        "Publisher": "Smithmark",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Decorating With Flowers",
        "Authors": "By Maia, Ronaldo",
        "Description": "",
        "Category": "",
        "Publisher": "Harry N. Abrams, Inc.",
        "Price Starting With ($)": "6.8",
        "Publish Date": {
            "Month": "November",
            "Year": "1978"
        }
    },
    {
        "Title": "All Century Team",
        "Authors": "By Vancil, Mark (EDT) and Hirdt, Peter (EDT)",
        "Description": "Profiles the 30 best baseball players of the twentieth century as chosen by fans and a panel of baseball writers, officials, and broadcasters",
        "Category": " Sports & Recreation , General",
        "Publisher": "Rare Air Media",
        "Price Starting With ($)": "8.14",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Through the Eyes of a Child: An Introduction to Children's Literature",
        "Authors": "By Norton, Donna E and Norton, Saundra E.",
        "Description": "One of the most respected, comprehensive sources on available children's literature.  Surveys the history of children' literature, explores the child's response to literature, and explains how to evaluate and select literature for children. Features unique two-part genre chapters -- one part content and one part methods. Covers artists and their illustrations, picture books, traditional literature, modern fantasy, poetry, contemporary realistic fiction, historical fiction, multicultural literature, and nonfiction (biographies and informational books). Contains illustrations from favorite full-color children's books (in their original colors), and art from real children. Features guest editorials by authors and illustrators; flashbacks of historical events, works, and people; and a section on multicultural literature in every chapter. Provides a dual-platform CD-ROM with annotated reference information on the more than 3000 children's literature titles listed in the book.  For anyone interested in children's literature.",
        "Category": " Literary Criticism , Books & Reading",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "7.93",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "The Inheritor's Handbook: A Definitive Guide for Beneficiaries (Bloomberg Personal Bookshelf (Hardcover))",
        "Authors": "By Rottenberg, Dan",
        "Description": "The Inheritor's Handbook is remarkable for its jargon-free solutions to sophisticated family-wealth issues and its relentless focus on the beneficiary's point of view, a view absent from most books on estate planning. This book delivers proven advice from experts and heirs, with real-life examples that dramatize dozens of problems.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Bloomberg Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Walt Disney's Masterpiece: Snow White and the Seven Dwarfs",
        "Authors": "By Holliss, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown & Company",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The World's Armies",
        "Authors": "By Westhorp, Chris (EDT)",
        "Description": "International military historians, intelligence analysts, and others discusses the armies of the world, including the troops, weapons, and vehicles of all of the world's land forces",
        "Category": " Political Science , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Electronics With Digital and Analog Integrated Circuits",
        "Authors": "By Higgins, Richard J.",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "6.91",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "How to Write Magazine Articles That Sell",
        "Authors": "By Williams, William Proctor",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "Watermen of the Chesapeake Bay",
        "Authors": "By Whitehead, John Hurt",
        "Description": "",
        "Category": " Fiction , Literary",
        "Publisher": "Cornell Magazine",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "Roadrunner: A Novel",
        "Authors": "By Thomas, Trisha R.",
        "Description": "1. The opening chapter of Roadrunner reveals Dell's state of despair. He relies on a cocktail of prescription drugs to take him to a zone where there are 'no paparazzi, no reporters, no questions he couldn't answer.' Do you get the impression that the bulk of these unanswerable questions come from the press, or from his family? Who is he trying to escape from? Is your first reaction to Dell pity or revulsion? Does that reaction change at any point in the story? 2. Just before their violent incident, Leah offers Dell a choice between his family and his misery. Do you think she is right to lay it all on the line at this point? How far should a spouse go to help his/her partner recover from an addiction or a debilitating depression? Does your answer change when you factor children into the equation? Why or why not? 3. Dell fantasizes about his pre-injury athletic prowess: 'Crouched in stance, anticipating the speed and shape of the ball . . . the crack of the bat . . . the run!' But he also dwells on his golden reputation: 'the high unmatched by any other, fans, superiority, and recognition.' Is he addicted to the game of baseball, or simply to fame? Do you think the cult of personality that the professional sports world engenders is necessarily corrupting? Or does it serve a useful purpose in providing kids with recognizable heroes? 4. As the squad car pulls up to her house, Leah recognizes that a severe shift in balance has just occurred between 'what her life really was and what she thought it ought to be.' Weeks later, as she fends off one of Angel's stronger advances, she laments that 'This wasn't supposed to be her life . . . This wasn't supposed to be happening.' Where else in the novel do we see the theme of shattered expectations and thwarted 'supposed to's? Which characters are able to adapt to the disappointments of reality, and which are destroyed by them? 5. What influence has Leah's mother had on her in terms of relationships? What influence has Angel's mother had on him? What do you think Josh learns from Leah in the course of the story? 6. Dell makes a show of thanking God for his successes in front of the media, but privately considers himself his own god, fully responsible for all his own actions. 'His days and nights had been filled with strategy, with maintaining control of his destination.' In what ways is Angel similar? Do you think Angel truly feels for Leah all that he professes, or is his obsession with her all about him? Given Angel's background, what does the wife of a professional athlete symbolize to him? 7. Does Angel's tragic family situation cause you to sympathize with him? Why do you think he's unable to go through with the dire crimes he contemplates, Squire's murder and Dell's murder among them? Is he a coward? 8. In what ways does Roadrunner address the theme of addiction? What is Leah addicted to? Angel? Elicia? Does anyone make a full recovery by the end of the novel? 9. Angel's behavior with Kayla seems to seal the deal that he's a creep. Does he overstep his bounds before this? At what point do you lose trust in Angel? Would Leah be justified in filing a sexual harassment charge against him? Why does she never consider doing so? 10. Dell often hides in his son's room because Leah 'rarely came down the hall past the point where organization and structure became disheveled, where mess and clutter lurked behind every closed door . . . She simply asked that the children's doors be kept closed so what she didn't know wouldn't hurt her.' Is this Leah's key problem—that she can't process life's messiness? If so, does Dell recognize it as a problem? 11. Right before Dell decides to piece together the puzzle of who and where he is, he awakens from an exhausting baseball dream to the realization that 'he was merely a man, nothing more.' Do you read this as a final defeat for Dell, or as a positive turning point? 12. Angel is profoundly affected by the discovery that his childhood idol has devolved into a drug-addled wife-beater. How much of his treatment of Dell is motivated by anger at having his own bubble burst? Does he pursue Leah because he has a newfound sense of his own potential, or because he wants to prove a point about men like Dell wasting their precious gifts? 13. Since money is no object in the Fletcher household, are you surprised that Leah fails to hire detectives to hunt for Dell? Is her judgment impaired by her own ambivalent feelings about her marriage, and her growing weakness toward Angel's advances? Or is she simply so used to Dell making the household decisions that she's paralyzed without him? What course of action would you take in her shoes? 14. As Leah contemplates the events that have led her and Dell to their predicament, she recalls him not as an equal partner, but as an 'opponent,' forging ahead rapidly toward his goals, while she is left 'trailing behind like a quiet breeze.' How much of her behavior toward him is motivated by jealousy and/or resentment that he pursued his dream while she raised the kids? What could they have done to ensure more equality in the marriage?",
        "Category": " Comics & Graphic Novels , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Ending hunger: An idea whose time has come",
        "Authors": "By Hunger Project",
        "Description": "",
        "Category": "",
        "Publisher": "Praeger",
        "Price Starting With ($)": "8.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Cannibal Isle",
        "Authors": "By Stevens, William",
        "Description": "",
        "Category": "",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "11.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "An Eye for an Eye",
        "Authors": "By Schorr, Mark",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Guglielmo Marconi (Lifetimes Series)",
        "Authors": "By Tames, Richard",
        "Description": "Discusses the visionary inventor's life and his application of theories in physics to discover the \"wireless\" and thus achieve wealth and international renown",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Gloucester Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Britain: Off the Motorway",
        "Authors": "By Peck, Christopher",
        "Description": "",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.4",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "The Earth: A Physical and Human Geography",
        "Authors": "By De Blij, Harm J.",
        "Description": "This standard text in the field provides an overview of basic concepts and theory of physical and human geography. The revised presentation links more closely the physical and human themes, and connects historic events and modern phenomena. New material includes expanded treatments of spatial and environmental topics, crustal plate movements, biogeography, energy resources, demography, political geography, regional concepts and structures, plus a new chapter on careers in geography. Also contains additional color plates and many references to the geographical literature.",
        "Category": " Science , Earth Sciences , Geography",
        "Publisher": "Wiley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Mortgaging the Earth",
        "Authors": "By Rich, Bruce",
        "Description": "The World Bank, Environmental Impoverishment, and the Crisis of Development\"A detailed and thought-provoking look at an important subject from the viewpoint of a passionate advocate.\"— The New York Times Book Review",
        "Category": " Science , Environmental Science",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Modern Hospital Psychiatry",
        "Authors": "By Lion, John R. (EDT), Adler, Wolfe N. (EDT), and Webb, W. L. (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "NORTON & COMPANY",
        "Price Starting With ($)": "11.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Breaking the Watch: The Meanings of Retirement in America",
        "Authors": "By Savishinsky, Joel S.",
        "Description": "The topic of retirement becomes increasingly compelling as the U.S. population ages. It's easy to find books about how to plan financially for those years after careers end, but Breaking the Watch focuses on the many ways of creating a life, not just making a living, as a retired person.This book follows women and men from a rural American community as they approach and experience the first years of retirement. Joel Savishinsky focuses on the efforts people make to find meaning in a stage of life American culture often views in a confused or disdainful way.In conversations and stories, 13 men and 13 women demonstrate a deep commitment to defining their own retirement. They bring to their mature years a diversity of backgrounds, interests, and responsibilities. They include former teachers, librarians, doctors, farmers, lawyers, bankers, mail carriers, and secretaries. Some are married, others divorced or single; many have children and grandchildren, but some have neither. Their finances run the gamut from the modest to the munificent, while their health ranges from robust to disabled. From an examination of the \"rites of passage\" that marked their exit from full-time work, Breaking the Watch moves on to consider how to plan appropriately for retirement; renegotiate ties to friends, family, and community; and create a sense of passion—be it for t'ai chi, travel, painting, or politics—that will drive a new sense of purpose. These intimate glimpses into real lives allow a rare understanding of the retirement process.",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "Cornell University Press",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Maryland Lost and Found: People and Places from Chesapeake to Appalachia",
        "Authors": "By Meyer, Eugene L.",
        "Description": "Sixteen essays describe various aspects of life in Maryland, including an air shuttle service, the Choptank River bridge, the local ecology, fishing villages, tobacco farming, military bases, and interstate highways",
        "Category": "",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "Fabulous Flowers",
        "Authors": "By Westland, Pamela",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "7.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Memos to the President: Management Advice From the Nation's Top CEOs",
        "Authors": "By Schiro, James J. (EDT)",
        "Description": "Eavesdrop in the corridors of power . . .The nation's top CEOs share their valuable insights, experiences, and techniques running large, powerful organizations with the President of the United States. James J. Schiro, CEO of leading consulting firm PricewaterhouseCoopers, has compiled important advice that reveals the crucial factors that determine the success of the country's top companies.In Memos to the President, chief executive officers from leading U.S. corporations apply their knowledge of managing complex organizations to the monumental challenges facing the federal government. In memos addressed directly to the president, they discuss major management issues and offer valuable insights and strategies that will help the president leverage technology to improve performance; create new programs for developing future leaders; improve internal communications; manage large-scale organizational change; and promote ethical behavior. This invaluable advice comes from major business figures, including:James B. Kelly of UPSJ. W. Marriott Jr. of Marriott InternationalEsther Dyson of EDventure HoldingsEarnest Deavenport of Eastman ChemicalArthur Blank of Home DepotSolomon D. Trujillo of U S WestSeymour Sternberg of New York LifeJoseph Neubaur of AramakLars Nyberg of NCR",
        "Category": " Business & Economics , Management",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Shape Your Life",
        "Authors": "By Harris, Barbara (EDT) and Hynes, Angela (EDT)",
        "Description": "",
        "Category": " Health & Fitness , Exercise , General",
        "Publisher": "Hay House",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Illuminated Soul",
        "Authors": "By Stollman, Aryeh Lev",
        "Description": "Fleeing Prague in the wake of the outbreak of World War II, scientist Eva Laquedem wanders the world aimlessly, drifting rootlessly from place to place until she arrives in Windsor, Canada, at the home of a devout widow with two sons, carrying the Augsburg Miscellany, a beautiful fifteenth-century illuminated Hebrew manuscript. Reprint.",
        "Category": " Fiction , Literary",
        "Publisher": "Riverhead Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "A Creek Called Wounded Knee",
        "Authors": "By Douglas C. Jones",
        "Description": "",
        "Category": "",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Lover Too Many",
        "Authors": "By Lewis, J. R.",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Distribution Services",
        "Price Starting With ($)": "8.28",
        "Publish Date": {
            "Month": "September",
            "Year": "1969"
        }
    },
    {
        "Title": "The Book of the Royal Year",
        "Authors": "By Graham, Tim",
        "Description": "Features photographs of the Royal family, from the July 1986 wedding of the Duke and Duchess of York to a polo match at Windsor",
        "Category": " History , General",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "5.85",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Cuisines of Europe (No. 06440)",
        "Authors": "By Schmaeling, Tony",
        "Description": "Provides recipes for appetizers, soups, salads, vegetable dishes, main dishes, and desserts from France, Italy, Germany, Britain, Hungary, Switzerland, Austria, Spain, Greece, and Scandinavia",
        "Category": " Cooking , General",
        "Publisher": "Bookthrift Co",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "The Mystery Lover's Companion",
        "Authors": "By Bourgeau, Art",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "24.95",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Ham Martin, class of '17",
        "Authors": "By Streeter, Edward",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Judges",
        "Authors": "By Jackson, Donald Dale",
        "Description": "",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Franklin D. Roosevelt: Portrait of a President.",
        "Authors": "By Gies, Joseph",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Company",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Fur-Bearing Animals of North America",
        "Authors": "By Rue, Leonard Lee",
        "Description": "Using black-and-white photographs, a standard reference book on the furbearing animals of North America explores their habitats, behavioral characteristics, and physical attributes",
        "Category": " Science , General",
        "Publisher": "Crown Pub",
        "Price Starting With ($)": "19.25",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "A Clear Conscience",
        "Authors": "By Fyfield, Frances",
        "Description": "Fyfield takes us back into the life and world of Helen West, Prosecutor for the Crown. Overwhelmed by her own crisis of faith, Helen has put her beliefs - in the law, in her job, in herself - under the razor-sharp attorney's scrutiny she normally saves for the witness stand. What she finds is that winning her cases no longer triggers the satisfaction and excitement it once did. Frustrated with justice-by-the-rules, haunted by the \"knowledge of guilt and misery\" it gives her, and surrounded by people in both her professional and personal lives who believe that the rules can work only by being stretched, Helen is beginning to think they may be right.Now - as if someone had designed a test case for her - Helen becomes involved in the private and legal life of a battered woman whose shockingly dire circumstances might, to some minds, be deemed excuse enough for even the most gruesome crime. As the \"truth\" about the woman's actions is revealed - piece by piece, version by version - Helen must confront the arrogance and cynicism that have crept up around her sense of compassion and justice, and that may have skewed her judgment, shrouding her conscience in order to keep it clear...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Pantheon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "New Complete Guide to Gardening (Better Homes & Gardens)",
        "Authors": "By Roth, Susan A.",
        "Description": "An invaluable reference for both novice and experienced gardeners with 600 full-color pages packed with over 750 photos of overall gardens and individual plants.Readers will find complete information on perennials, roses, bulbs, annuals, lawns, trees, shrubs, vines, ground covers, fruits, vegetables, and herbs.270 pages of plant encyclopedias provide detailed how-to-grow-it informa-tion for nearly 500 plants. A photo accompanies each encyclopedia entry.100 page special design section helps homeowners translate basic information into specific solutions for the challenges in their own yard.Step-by-step illustrations show all the techniques critical to proper plant maintenance.Dozens of handy charts help readers at a glance learn which plants are best for which situations.Information provided for all regions of the country.",
        "Category": " Gardening , General",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "8.77",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The intelligent traveller's guide to historic Britain: England, Wales, the Crown Dependencies",
        "Authors": "By Crowl, Philip Axtell",
        "Description": "",
        "Category": "",
        "Publisher": "BARNES & NOBLE",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Genius in Disguise: Harold Ross of the New Yorker",
        "Authors": "By Kunkel, Thomas",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Carroll & Graf Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Soar Above the Madness: Surviving Office Politics Without Losing Your Mind, Your Job, or Your Lunch",
        "Authors": "By Drennan, Miriam and Anderson, Joel",
        "Description": "Success, motivation, and teamwork are the goals of the guys on the top forthose of us pretending to work away at the bottom. Now you can get the insidepoop on the secret plots of upper management withSoar above the Madness: Surviving Office Politics Without Losing Your Mind, Your Job, or Your Lunch.Responsibility - Why stick your neck out when you can stick your head in? Communication - Speak softly and carry a big bag of excuses. Teamwork - In the office body, there are many armpits. Service - \"Start each day with a smile - and get it over with.\" - W.C. FieldsPriorities - Feather your own nest while others around you are molting. Productivity - Anything worth not having is worth not working for. Success - After clawing your way to the top, get used to your new title: #1 Lightning Rod.A full-color book of inside secrets such as how to interpret your boss'sactions and the top ten never-fail methods for shifting blame,Soar above theMadness gives new meaning to the phrase \"surviving the workplace.\"",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Microbiology: Principles and Applications",
        "Authors": "By Black, Jacquelyn G.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall College Div",
        "Price Starting With ($)": "8.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Business and Legal Forms for Crafts",
        "Authors": "By Crawford, Tad",
        "Description": "",
        "Category": " Law , General",
        "Publisher": "Allworth Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Lifeboats to Ararat",
        "Authors": "By Campbell, Sheldon",
        "Description": "",
        "Category": "",
        "Publisher": "Times Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Private Life of Dr. Watson",
        "Authors": "By Hardwick, Michael (EDT)",
        "Description": "Dr. John Watson relates the story of his life and adventures prior to meeting the consulting detective, Sherlock Holmes",
        "Category": " Biography & Autobiography , General",
        "Publisher": "E. P. Dutton, Inc.",
        "Price Starting With ($)": "24.26",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Israel 25. A Pictorial Celebration of Israel's 25th Birthday.",
        "Authors": "By David (Ed. ) Pedahtsur",
        "Description": "",
        "Category": "",
        "Publisher": "Arlington House",
        "Price Starting With ($)": "7.93",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Strength for the Journey",
        "Authors": "By Falwell, Jerry",
        "Description": "Revealing the story of his life and his work, the author describes his private and public struggles from childhood, through his spiritual rebirth and transformation by Christianity to his thirty years in the ministry and beyond",
        "Category": " Religion , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "The Power of Love: The Key to Opening the Gifts Hidden in Our DNA",
        "Authors": "By Michelle Anderson",
        "Description": "",
        "Category": "",
        "Publisher": "Master Alignment",
        "Price Starting With ($)": "6.25",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Advanced Autograph Collecting",
        "Authors": "By Baker, Mark Allen",
        "Description": "",
        "Category": " Antiques & Collectibles , Reference",
        "Publisher": "Krause Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "In Quest of the Least Coin",
        "Authors": "By Grace Nies Fletcher",
        "Description": "",
        "Category": "",
        "Publisher": "W. Morrow",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Growth Experiment: How the New Tax Policy Is Transforming the U.S. Economy",
        "Authors": "By Lindsey, Lawrence B.",
        "Description": "President Bush's key advisor on tax matters demonstrates the success of Reagan's great tax experiment, which permanently changed the nation's tax system, and proposes new tax cuts for the middle and lower classes",
        "Category": " Business & Economics , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Illustrated Guide to Shaker Furniture",
        "Authors": "By Meader, Robert F. W.",
        "Description": "Best guide to subject. 267 individual pieces in 175 photographs: chairs, footstools, tables, clocks, stoves, other pieces. Additional 60 photos show finials, decals, peggings, caning, drawers, more. Captions provide details on size, color, wood, etc.",
        "Category": " Antiques & Collectibles , Furniture",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1972"
        }
    },
    {
        "Title": "Secret Harvest",
        "Authors": "By Shuster, Bud",
        "Description": "",
        "Category": " Fiction , Historical",
        "Publisher": "White Mane Publishing Company",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Post Conservative America: People, Politics, and Ideology",
        "Authors": "By Phillips, Kevin P.",
        "Description": "",
        "Category": "",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Katie Brown Entertains: 16 Menus 16 Occasions 16 Tables",
        "Authors": "By Brown, Katie and Lippman, Catherine",
        "Description": "16 Menus 16 Occasions 16 TablesKatie Brown's knack for mixing homey appeal with a hip sense of style makes her both an irreverent and engaging personality. In Katie Brown Entertains, she illustrates how to decorate tabletops and put together menus to create 16 different occasions and parties. With simple, step-by-step instructions and more than 250 sumptuous, full-color photos throughout, this fabulous book celebrates everything from a Texan Fourth of July to a homespun family Christmas, from a romantic breakfast for two to a book club dinner with the girls.Katie covers every element of a party, including more than 125 projects that contribute a special touch to invitations, table and chair arrangements, centerpieces, place cards, and favors. Plus, she adds her own personal flavor by describing her favorite dishes and sharing personal stories and anecdotes. More than 125 delicious recipes feature such enticing entrees as Oven-Fried Chicken with a Garlic and Parmesan Crust, BBQ Pork Marinated in Tequila and Coriander, Snapper en Papillote, and Scallops with Ginger-Scallion Sauce. Herb and Onion Focaccia and Buttermilk Biscuits with Cheddar Cheese are just two of the tempting breads. Almond Apricot Tart and Gingersnap Ice Cream Sandwiches are among a delightful array of desserts.Chockful of delicious recipes, innovative tips, and affordable how-tos, Katie Brown Entertains takes the stress out of party planning and makes the formal art of celebration a relaxing and fun occasion.",
        "Category": " Cooking , Reference",
        "Publisher": "Harper Collins",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Beginner's Book of Dreams A Novel",
        "Authors": "By Benedict, Elizabeth",
        "Description": "Eight-year-old Esme Singer embarks on a ten-year search for inner truth, as she accepts--then rejects--the self-deluding role models of her alcoholic mother and an absent father who dreams of getting rich",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Eveolution: Understanding Women--Eight Essential Truths That Work in Your Business and Your Life",
        "Authors": "By Popcorn, Faith and Marigold, Lys",
        "Description": "190 million female consumers . . . $4.4 trillion in buying power . . . one book--the national bestseller now in paperback and newly revised--that tells you how to reach them.She knows business. She knows women. And she definitely knows better than anyone on Madison Avenue how to bring them together. Faith Popcorn, America's leading trend forecaster, shows that no one can succeed in business or successfully start one without understanding how to market to women.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Coffee Cookery",
        "Authors": "By Ceil Dyer",
        "Description": "",
        "Category": "",
        "Publisher": "HP Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Tribal Warfare in Organizations: Turning Tribal Conflict into Negotiated Peace",
        "Authors": "By Neuhauser, Peg C.",
        "Description": "Discusses the impact of interdepartmental rivalries, and explains how managers can improve relations between warning groups",
        "Category": " Business & Economics , General",
        "Publisher": "Ballinger Pub Co",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Biology of microorganisms",
        "Authors": "By Brock, Thomas D., etc.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "8.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "One More Time: The Best of Mike Royko",
        "Authors": "By Terkel, Studs (FRW), Royko, Mike, and Wille, Lois",
        "Description": "With the incisive pen of a newspaperman and the compassionate soul of a poet, Mike Royko was a Chicago institution who became, in Jimmy Breslin's words, \"the best journalist of his time.\" Culled from 7500 columns and spanning four decades, from his early days to his last dispatch, the writings in this collection reflect a radically changing America as seen by a man whose keen sense of justice and humor never faltered. Faithful readers will find their old favorites and develop new ones, while the uninitiated have the enviable good fortune of experiencing this true American voice for the first time.\"A treasure trove lies between these covers. Royko was in a class by himself. He was a true original.\"—Ann Landers\"The joy of One More Time is Royko in his own words.\"—Mary Eileen O'Connell,New York Times Book Review\"Reading a collection of Royko's columns is even more of a pleasure than encountering them one by one, and that is a large remark for he rarely wrote a piece that failed to wake you up with his hard-earned moral wit. Three cheers for Royko!\"—Norman Mailer\"Powerful, punchy, amazingly contemporary.\"—Neil A. Grauer, Cleveland Plain Dealer\"This crackling collection of his own favorite columns as well as those beloved by his fans reminds us just how much we miss the gruff, compassionate voice of Mike Royko.\"—Jane Sumner,Dallas Morning News\"A marvelous road map through four decades of America.\"—Elizabeth Taylor, Chicago Tribune Books\"Royko was an expert at finding universal truths in parochial situations, as well as in the larger issues—war and peace, justice and injustice, wealth and poverty—he examined. Think ofOne More Time as one man's pungent commentary on life in these United States over the last few decades.\"—Booklist\"Royko was one of the most respected and admired people in the business, by readers and colleagues alike. . . . Savor [his sketches] while you can.\"—Jonathan Yardley,Washington Post Book World\"Book collections of columns aren't presumed to be worth reading. This one is, whether or not you care about newspapering or Chicago.\"—Neil Morgan,San Diego Union-Tribune\"A treasure house for journalism students, for would-be writers, for students of writing styles, for people who just like to laugh at the absurdity of the human condition or, as Studs Terkel said, for those who will later seek to learn what it was really like in the 20th century.\"—Georgie Anne Geyer, Washington Times\"Full of astonishments, and the greatest of these is Royko's technical mastery as a writer.\"—Hendrik Hertzberg,New Yorker\"A great tribute to an American original, a contrarian blessed with a sense of irony and a way with words.\"—Bob Minzesheimer,USA Today\"In this posthumous collection of his columns, journalist Royko displays the breezy wit that made him so beloved in the Windy City.\"—People",
        "Category": " Language Arts & Disciplines , Journalism",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "The Crazy Ape:",
        "Authors": "By Szent-Gyorgyi, Albert",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Everyday Family Favourites",
        "Authors": "By n/a",
        "Description": "There's something to tempt even the fussiest of eaters in this family cook book. Each of the 125 recipes has easy-to-follow instructions and step-by-step photographs.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Gardners Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Great Recipes From Great Gardeners",
        "Authors": "By Horticu, Pennsylvania",
        "Description": "",
        "Category": "",
        "Publisher": "Favorite Recipes Press (FRP)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Portrait of the Soviet Union",
        "Authors": "By Maclean, Fitzroy",
        "Description": "Describes the cultural, religious, social, and economic character of the Soviet Union and includes a brief survey of Russian history",
        "Category": "",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Belly Up to the Blue Line",
        "Authors": "By Waldron, Bruce",
        "Description": "",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Commonwealth Pubns Inc",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "The Penguin companion to European literature (Penguin companion to world literature)",
        "Authors": "By Thorlby, Anthony (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Magazine Editors Talk to Writers (WILEY BOOKS FOR WRITERS SERIES)",
        "Authors": "By Mandell, Judy",
        "Description": "Interviews with magazine publishers cover contracts, copyrights, kill fees, the role of editors, successful proposals, and magazine jargon",
        "Category": " Language Arts & Disciplines , Authorship",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "The Macmillan Writer: Rhetoric and Reader (Brief 4th Edition)",
        "Authors": "By Nadell, Judith, Langan, John, and McMeniman, Linda",
        "Description": "",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "American Slavery - American Freedom: The Ordeal of Colonial Virginia",
        "Authors": "By Morgan, Edmund S.",
        "Description": "",
        "Category": "",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1980"
        }
    },
    {
        "Title": "Why Aren't Black Holes Black?",
        "Authors": "By Hazen, Robert M., Gould, Stephen Jay (INT), and Singer, Maxine",
        "Description": "Explores the unanswered questions of science, such as \"Are we alone in the universe?\" and \"Can we unravel our genetic code?\"",
        "Category": " Science , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "A question of courage",
        "Authors": "By Darke, Marjorie",
        "Description": "",
        "Category": "",
        "Publisher": "Crowell",
        "Price Starting With ($)": "20.84",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Out of the Garden: Women Writers on the Bible",
        "Authors": "By Spiegel, Celina and Buchmann, Christina",
        "Description": "\"Essays of considerable literary erudition and sophistication that... dislodge dull stereotypes to enable both women and men readers to see the Bible with fresh eyes.\"--Los Angeles Times Book ReviewAs the one work that has held moral and religious sway over the Judeo-Christian tradition for thousands of years, the Bible is unsurpassed in world literature. For women, its meaning is particularly complex; traditionally, the Bible has been used to keep women in their place, but it has also been a book of enduring inspiration. Out of the Garden marks a new stage in women's relations to the Bible: this is the first collection of essays in which women read and respond to the Bible out of pleasure and curiosity--free to explore what is really relevant to women's lives.Drawing on their own experiences and interests, Louise Erdrich, Cynthia Ozick, Fay Weldon, Phyllis Trible, Rebecca Goldstein, June Jordan, Ursula K. Le Guin, and twenty-one other writers boldly, imaginatively--and sometimes reproachfully--address the Old Testament stories, characters, and poetry that mean the most to them. Thoughtful, challenging, and playful, these beautifully written essays explore the Bible in fresh new ways. Out of the Garden reclaims the Bible for women and shows readers that the Bible is a source we can return to again and again.\"A many-splendored achievement...This grand collection is a bold revitalization of our relation to our tradition. It offers the reader the gorgeously varied company of strongly delineated temperaments as they take on the compelling, threatening figures of our imaginative forebears.\"--Harold Bloom Author of The Book of J and The Western Canon",
        "Category": " Body, Mind & Spirit , Spiritualism",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Death of an Irish Sea Wolf: A Peter McGarr Mystery",
        "Authors": "By Gill, Bartholomew",
        "Description": "Fifty years ago, Clement Ford first appeared on Clare Island, a remote community off the west coast of Ireland. Now, well into his old age, he still retains the physical stature and quiet authority that earned him the nickname \"Sea Wolf.\" Ford has always lived a simple life, but rumors abound that he is fabulously wealthy, and the anonymous source of the \"Clare Island Trust,\" the philanthropic fund that has done so much to improve the lot of the islanders.One night a schooner pulls into harbor carrying a figure from Clement Ford's past, and the tranquil life of the island is shattered. By morning, three people are dead, Clement Ford is missing, and Chief Superintendent Peter McGarr is on the case.Accompanying him in his investigations are his young cerebral wife, Noreen, and his trusted lieutenants from the Murder Squad - the gregarious Bernie McKeon, the ladies' man Hughie Ward, and the formidable Ruth Bresnahan. When McGarr starts to piece together what happened that night, he is left only with questions. Who is Clement Ford? What does he have that is worth killing so many people for? And who is doing the killing? Before the Chief Inspector has any answers, Ford and his dangerous visitor surface, and it is all McGarr can do to stay alive in the violent climax of a drama that began half a century ago.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Halloween Knight (The Cavendish Chronicles)",
        "Authors": "By Phillips, Tori",
        "Description": "Halloween Knight by Tori Phillips released on Aug 25, 2000 is available now for purchase.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "A Wilderness of Birds",
        "Authors": "By Bahrt, Sidney",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Thirty - Two Presidents Square (The Acropolis international business history series)",
        "Authors": "By Carr, Roland",
        "Description": "",
        "Category": "",
        "Publisher": "Acropolis Books Inc",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "Behind the Secret Window",
        "Authors": "By Toll, Nelly S.",
        "Description": "Illustrated with Nelly's original watercolors, this powerful memoir tells the true story of how a little girl's imagination helped her survive World War II.The Nazis come to Poland when Nelly is six.  By the time she turns eight, the events of World War II have taken almost everyone she loves. Scared, lonely, and running from the Nazis, Nelly hides in the bedroom of a Gentile couple in Lwow, Poland.  For over a year, she lives in fear of discovery, writing in her diary and painting pictures of a fantasy world filled with open skies and happy families. For 13 months during World War II, the author and her mother were hidden from the Nazis. Like Anne Frank, Nelly kept a diary and through that outlet transformed her grim reality into an enchanting fantasy world.\"Without emphasizing horror and loss, Toll conveys the effects of human evil and human folly, summoning up the forces of tragedy and courage.\" --Publishers Weekly \"In Toll's remembrance, art equals hope: her happy family pictures, painted in the secret room where she and her mother hid from the Nazis and the Poles, show extraordinary preteen talent as well as the will to survive.\" --Kirkus Reviews",
        "Category": " Juvenile Nonfiction , History , Holocaust",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "U.S. on the moon;: What it means to us",
        "Authors": "By Newman, Joseph",
        "Description": "",
        "Category": "",
        "Publisher": "Books by U.S. News & World Report",
        "Price Starting With ($)": "7.8",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Oh Where Are Bloody Marys Earrings",
        "Authors": "By Player, Robert.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "9.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Man Who Dared the Lightning: A New Look at Benjamin Franklin",
        "Authors": "By Thomas J. Fleming",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow and Company",
        "Price Starting With ($)": "17.38",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Render Up the Body",
        "Authors": "By Wesson, Marianne",
        "Description": "A decomposed body is found high in the mountains of central Colorado. The remains are identified as those of Nicole Marie Caswell, age twenty-two. Ten months later Jason Smiley is arrested and charged with Nicole Caswell's rape and murder.Long before Smiley's arrest, Cinda Hayes had become disillusioned working as chief sex-crimes prosecutor for the Boulder County District Attorney's Office - a job muddled by too many calculating egos, too much machismo, and not enough decency. When the opportunity arises for her to become director of the Boulder County Rape Crisis Center, she doesn't think twice - she jumps at the chance to leave the practice of law behind.But six months after Jason Smiley is convicted and sentenced to death, Cinda is abruptly summoned by her old mentor, Justice Hilton James of the Colorado Supreme Court, and told that the state has chosen her to handle Smiley's appeal. The appointment creates obvious conflicts for Cinda - her new profession is built on defending rape victims - but Justice James assures her that she will not be expected to argue her client's innocence. She is instructed, instead, to scrutinize the trial record for errors that may have compromised Smiley's right to procedural justice.Cinda's strenuous efforts to avoid being drawn deeper into Smiley's case are failing, as Smiley insists that the only error at his trial was the conviction of an innocent man. At a memorial service for a fallen Boulder mountain climber, Cinda begins to sense the truth, which may include a deep cover-up involving Tory and the D.A.'s office. Armed with what she has learned, Cinda must decide whether to defy the court's instructions and demand to have a high-profile death-row case reopened.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Ludwig Van Beethoven (Lifetimes)",
        "Authors": "By Tames, Richard",
        "Description": "Examines Beethoven's life and musical achievements in the context of his historical period",
        "Category": " Music , General",
        "Publisher": "Franklin Watts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "The Making of a Conservative Environmentalist",
        "Authors": "By Durnil, Gordon K.",
        "Description": "\"[Durnil’s attack on chlorine is] one of the single boldest environmental policy ideas of the 1990’s.... The message is that if someone as conventional and as conservative as Mr. Durnil can latch on to one of the great social transformations of the American century, then so can every other Republican in the country.\" —New York Times Book Review\"This is a serious, thoughtful book. If they would read it, the phoney ‘conservatives’ now performing in the center ring in Congress might be shamed into mending their ways. —Village Voice Literary Supplement\"Here comes a thoughtful, experienced conservative with impeccable Republican credentials a dedicated environmentalist with a different point of view. A thoughtful, readable mandate.\"—Ken Bode, Moderator, Washington Week in Review",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Indiana University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Breaking the Ice: A Guide to Understanding People from Other Cultures (2nd Edition)",
        "Authors": "By Kabagarama, Daisy",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Originals",
        "Authors": "By McLennaghan, Bonnie G. (EDT)",
        "Description": "",
        "Category": " Architecture , General",
        "Publisher": "Lindal Cedar Home",
        "Price Starting With ($)": "8.51",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "The Rainforest Book: How You Can Save the World's Rainforests",
        "Authors": "By Lewis, Scott",
        "Description": "Explores the remarkable diversity of rainforests, discusses threats to their survival, and suggests how average citizens can help preserve rainforests",
        "Category": " Business & Economics , General",
        "Publisher": "Living Planet Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Caleb's Story (Sarah, Plain and Tall)",
        "Authors": "By MacLachlan, Patricia",
        "Description": "The third book in the series that began with the Newbery Medal–winning Sarah, Plain and Tall by Patricia MacLachlan.Anna has done something terrible. She has given me a journal to fill.\"It's your job now,\" Anna says as she hands Caleb her journals, asking him to continue writing the family story. But Sarah, Jacob, Anna, Caleb, and their new little sister, Cassie, have already formed a family, and Caleb fears there will be nothing left to write about. That is, before Cassie discovers a mysterious old man in the barn, and everything changes. Everyone is excited about the arrival of a new family member—except for Jacob, who holds a bitter grudge. Only the special love of Caleb, and the gift he offers, can help to mend the pain of the past.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    }
]