[
    {
        "Title": "Richard Nixon and His America",
        "Authors": "By Parmet, Herbert S.",
        "Description": "",
        "Category": "",
        "Publisher": "Konecky, William S",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Little Genie: Castle Magic (#4)",
        "Authors": "By Jones, Miranda and Calver, David (ILT)",
        "Description": "“NO MAGIC!” Ali tells Little Genie. Against her better judgment, Ali lets Genie come along on her class trip to Popplehoff Castle. Little Genie is sure that won’t be a problem. She’s too busy peering in dungeons and examining heirloom jewels for magic. But that’s before she and Ali meet Henrietta, a ghost who lives in the castle. Henrietta wants a doll . . . and she’s decided that Genie fits the bill!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Heller with a Gun: A Novel",
        "Authors": "By L'Amour, Louis",
        "Description": "Tom Healy was in trouble. His theatrical troupe needed to get to Alder Gulch, Montana,  and the weather was turning. Andy Barker promised Tom he could get them there safely,  but Tom was reluctant to trust him: he had the lives of three actresses to consider,  and his personal feelings for Janice further heightened his concern. Then King Mabry  showed up. Although Tom didn’t like the way he looked at Janice, he could see that  Mabry made Barker uneasy. So Tom invited Mabry to join them. Tom was right to be  worried, because Barker had a plan. He knew that the wagons carried something more  than actors and scenery. He and his men were going to steal it any way they could.  And that included murder.",
        "Category": " Fiction , Westerns",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "For My Child: A Mother's Keepsake",
        "Authors": "By Kranz, Linda",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Northland",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Water Gardens: How to Design, Install, Plant and Maintain a Home Water Garden",
        "Authors": "By Heriteau, Jacqueline and Thomas, Charles B.",
        "Description": "In this definitive book, readers will learn how to create and maintain water features--ponds, fountains, waterfalls, and small containers--and how to plant the garden and stock it with fish. An illustrated encyclopedia of 200 hardy and tropical lilies, the sacred lotus, delicate floating plants, and plants for pond edges makes this an authoritative book on the subject.",
        "Category": " Gardening , Techniques",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.91",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "One Fifth Avenue",
        "Authors": "By Bushnell, Candace",
        "Description": "From one of the most consistently astute and engaging social commentators of our day comes another look at the tough and tender women of New York City--this time, through the lens of where they live. One Fifth Avenue, the Art Deco beauty towering over one of Manhattan's oldest and most historically hip neighborhoods, is a one-of-a-kind address, the sort of building you have to earn your way into--one way or another. For the women in Candace Bushnell's new novel, One Fifth Avenue, this edifice is essential to the lives they've carefully established--or hope to establish. From the hedge fund king's wife to the aging gossip columnist to the free-spirited actress (a recent refugee from L.A.), each person's game plan for a rich life comes together under the soaring roof of this landmark building. Acutely observed and mercilessly witty, One Fifth Avenue is a modern-day story of old and new money, that same combustible mix that Edith Wharton mastered in her novels about New York's Gilded Age and F. Scott Fitzgerald illuminated in his Jazz Age tales. Many decades later, Bushnell's New Yorkers suffer the same passions as those fictional Manhattanites from eras past: They thirst for power, for social prominence, and for marriages that are successful--at least to the public eye. But Bushnell is an original, and One Fifth Avenue is so fresh that it reads as if sexual politics, real estate theft, and fortunes lost in a day have never happened before. From Sex and the City through four successive novels, Bushnell has revealed a gift for tapping into the zeitgeist of any New York minute and, as one critic put it, staying uncannily \"just the slightest bit ahead of the curve.\" And with each book, she has deepened her range, but with a light touch that makes her complex literary accomplishments look easy. Her stories progress so nimbly and ring so true that it can seem as if anyone might write them--when, in fact, no one writes novels quite like Candace Bushnell. Fortunately for us, with One Fifth Avenue, she has done it again.",
        "Category": " Fiction , Women",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Your heart, your planet",
        "Authors": "By Diamond, Harvey",
        "Description": "",
        "Category": "",
        "Publisher": "Hay House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Grammar Smart: A Guide to Perfect Usage, 2nd Edition",
        "Authors": "By Princeton Review (EDT)",
        "Description": "The words you use say a lot about you. Grammar makes a lasting impression on friends, co-workers, and teachers, but learning the rules has always been boring. That's why the folks at The Princeton Review createdGrammar Smart.Grammar Smart uses a witty, irreverent approach to help individuals write and speak with greater clarity and confidence. Instead of boring readers with countless rules and confusing grammatical terms, The Princeton Review shows them the logic behind each correct sentence. Everything in Grammar Smart is nuts-and-bolts English designed to help readers express themselves more clearly. They'll learn how to choose between \"that\" and \"which\" and when to use \"as\" instead of \"like,\" and they'll know for sure if this is between \"you and me\" or \"you and I.\"Includes:• The basic parts of speech -- nouns, verbs, adjectives, etc.• Pronoun-verb agreement and parallel construction• Tips on how to avoid misplaced modifiers and dangling participles• Lively, humorous examples to illustrate meanings• Brief question-and-answer reviews",
        "Category": " Language Arts & Disciplines , Grammar & Punctuation",
        "Publisher": "Princeton Review",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "A Woman's Notebook (Miniature Editions)",
        "Authors": "By Shapiro, Amy",
        "Description": "",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Running Press Miniature Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1980"
        }
    },
    {
        "Title": "The Peacemaker: A Biblical Guide to Resolving Personal Conflict",
        "Authors": "By Sande, Ken",
        "Description": "",
        "Category": "",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "The graphic designer's handbook",
        "Authors": "By Campbell, Alastair",
        "Description": "A comprehensive manual on the fundamentals of graphic design includes discussions of typesetting systems, photography, reproduction, and print production",
        "Category": "",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The National Gallery Companion Guide [Illustrated]",
        "Authors": "By Langmuir, Erika",
        "Description": "",
        "Category": " Art , Reference",
        "Publisher": "National Gallery Publications, London",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "The Great Turning: From Empire to Earth Community",
        "Authors": "By Korten, David C.",
        "Description": "In his classic international bestseller, When Corporations Rule the World, David Korten exposed the destructive and oppressive nature of the global corporate economy and helped spark a global resistance movement. Now, he shows that the problem runs deeper than corporate domination—with far greater consequences.   Here, Korten argues that corporate consolidation of power is merely one manifestation of what he calls “Empire”: the organization of society through hierarchy and violence that has largely held sway for the past 5,000 years. Empire has always resulted in misery for the many and fortune for the few, but now it threatens the very future of humanity. Korten points to global terrorism, climate change, and rising poverty as just a few of the signs that the burdens of Empire now exceed what people and planet will bear.  The Great Turning traces the roots of Empire to ancient times and charts the long evolution of its favored instruments of control, from monarchies and bureaucracies to the transnational institutions of the global economy. Korten also tells the parallel story of the attempt to develop a democratic alternative to Empire, beginning in Athens and continuing with the founding of the United States of America. But this remains an unfinished project—Korten documents how elitists with an imperial agenda have consistently sought to undermine the bold and inspiring “American experiment,“ beginning in the earliest days of the republic and continuing to the present day. Empire is not inevitable, not the natural order of things—we can turn away from it. Korten draws on evidence from sources as varied as evolutionary theory, developmental psychology, and religious teachings to make the case that “Earth Community”—a life-centered, egalitarian, sustainable way of ordering human society based on democratic principles of partnership—is indeed possible. And he details a grassroots strategy for beginning the momentous turning toward a future of as-yet-unrealized human potential. The Great Turning illuminates our current predicament, provides a framework for grasping the potential of this historic moment, and shows us how to take action for the future of our planet, our communities, and ourselves.",
        "Category": " Language Arts & Disciplines , Linguistics , General",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Ten Minute Facelift (Rejuvenate Your face the Natural Way)",
        "Authors": "By Jennie Harding",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "January",
            "Year": "2016"
        }
    },
    {
        "Title": "Bicycling With Children",
        "Authors": "By Bell, Trudy E. and Bell, Roxana K.",
        "Description": "Covers cycling with toddlers, teaching children to ride, bike safety and maintenance, tandem cycling, and bicycling for challenged children",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "Mountaineers Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Healing Through Humor",
        "Authors": "By hunter, charles, Hunter, Charles (FRW), and Hunter, Frances Gardner",
        "Description": "Join the Happy Hunters in some healthy amusement!Humor strengthens the immune system, enabling the body to fight sickness and disease. Drawing from two lifetimes of joyful ministry, Charles and Frances Hunter have compiled some fabulous jokes, anecdotes, musings and mind twisters to make your heart merry and speed healing to your body and soul. Get ready to laugh! “Positive emotions invoked by humor have healing effects. If you read this book and no positive emotions come about, you need to check if you have a pulse. This book is great, and I plan to prescribe it to my patients! Enjoy.” -Francisco Contreras, M.D. Author of The Coming Cancer Cure \"Charles and Frances, thank you for your HEALING THROUGH HUMOR book! The jokes just crack us up! We get it out and read a few to guests who visit us. Laughing is good for the soul. We need more laugh lines in our faces rather than frown lines. You two are incredible!\" -Love, Oral and Evelyn Roberts “A merry heart doeth good like a medicine.” -Proverbs 17:22",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Creation House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Kellys and the O'Kellys: Or Landlords and Tenants (The World's Classics)",
        "Authors": "By Trollope, Anthony and McCormack, W. J.",
        "Description": "The humorous story of two marriages shows the striking similarities between a poor and a wealthy Irish family",
        "Category": " History , Latin America , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "Buffett: The Making of an American Capitalist",
        "Authors": "By Lowenstein, Roger",
        "Description": "Since its hardcover publication in August of 1995, Buffett has appeared on the Wall Street Journal, New York Times, San Francisco Chronicle, Los Angeles Times, Seattle Times, Newsday and Business Week bestseller lists. The incredible landmark portrait of Warren Buffett's uniquely American life is now available in paperback, revised and updated by the author.Starting from scratch, simply by picking stocks and companies for investment, Warren Buffett amassed one of the epochal fortunes of the twentieth century--an astounding net worth of $10 billion, and counting. His awesome investment record has made him a cult figure popularly known for his seeming contradictions: a billionaire who has a modest lifestyle, a phenomenally successful investor who eschews the revolving-door trading of modern Wall Street, a brilliant dealmaker who cultivates a homespun aura.Journalist Roger Lowenstein draws on three years of unprecedented access to Buffett's family, friends, and colleagues to provide the first definitive, inside account of the life and career of this American original. Buffett  explains Buffett's' investment strategy--a long-term philosophy grounded in buying stock in companies that are undervalued on the market and hanging on until their worth invariably surfaces--and shows how it is a reflection of his inner self.",
        "Category": " Biography & Autobiography , Business",
        "Publisher": "Broadway Books / Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Lists to Live By for Every Caring Family: For Everything That Really Matters",
        "Authors": "By Gray, Alice (COM), Van Diest, John (COM), and Stephens, Steve (COM)",
        "Description": "Moms and dads will welcome the loving, insightful, and to-the-point wisdom found in Lists to Live By for Every Caring Family. Each of the eighty lists compiled by three successful and respected authors offers encouragement and tender advice for today's parenting challenges. This isn't another trivia book; Lists provides new inspiration on how to love, teach, understand, uplift, and communicate with children in topics such as \"Helping Your Child Succeed,\" \"Pray for Your Children,\" and \"Four Ways to Encourage Your Kids.\" Parents will cherish each nugget of truth in this latest, timeless collection of Lists to Live By.",
        "Category": " Religion , Spirituality",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Recommended Dietary Allowances",
        "Authors": "By National Research Council (U. S.) and Committee on Dietary Allowances",
        "Description": "Cited in  BCL3  and  Sheehy . Here is the new edition of the standard upon which US nutritional requirements are based. Includes new research results and expert interpretations from nine years of progress in nutrition research. Provides not only RDAs but also \"Estimated Safe and Adequate Daily Dietary Intakes\" provisional values for nutrients where data are insufficient to set an RDA. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "National Academies Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Christian Perspectives on Politics (Revised and Expanded)",
        "Authors": "By Wogaman, J. Philip",
        "Description": "",
        "Category": " Religion , Philosophy",
        "Publisher": "Westminster John Knox Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Tempted (House of Night, Book 6)",
        "Authors": "By Cast, P. C. and Cast, Kristin",
        "Description": "So…you'd think after banishing an immortal being and a fallen High Priestess, saving Stark's life, biting Heath, getting a headache from Erik, and almost dying, Zoey Redbird would catch a break.  Sadly, a break is not in the House of Night school forecast for the High Priestess in training and her gang.  Juggling three guys is anything but a stress reliever, especially when one of them is a sexy Warrior who is so into protecting Zoey that he can sense her emotions.  Speaking of stress, the dark force lurking in the tunnels under the Tulsa Depot is spreading, and Zoey is beginning to believe Stevie Rae could be responsible for a lot more than a group of misfit red fledglings.  Aphrodite's visions warn Zoey to stay away from Kalona and his dark allure, but they also show that it is Zoey who has the power to stop the evil immortal.  Soon it becomes obvious that Zoey has no choice: if she doesn't go to Kalona he will exact a fiery vengeance on those closest to her.  Will Zoey have the courage to chance losing her life, her heart, and her soul?  Find out in the next spectacular installment in the House of Night Series, Tempted.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Illustrated Woody Allen Reader",
        "Authors": "By Allen, Woody and Sunshine, Linda (EDT)",
        "Description": "Woody Allen - accomplished film actor and director, brilliant monologist and gifted prose stylist. In this book, selections from his best, wittiest, and most profound work in every area have been gathered together for the first time.The excerpts from the published and never-before-published work range from one-liners to memorable on-screen exchanges to essays, and are drawn from Woody's stand-up routines (which have never appeared in print before), his classic New Yorker pieces, his screenplays, film outtakes, magazine articles, plays, and interviews.Here is vintage Woody Allen on the topics that have dominated his work for more than thirty years: Intellectuals (\"They're like the Mafia, they only kill their own\"); Analysts (\"My poor analyst got so frustrated. The guy finally put in a salad bar\"); Love (\"Should I marry W.? Not if she won't tell me the other letters in her name\"); Work (\"Show business is dog eat dog. It's worse than dog eat dog. It's dog doesn't return dog's phone calls\"); Death (\"I don't want to achieve immortality through my work, I want to achieve it through not dying\"); and much more.Here is marvelous dialogue from twenty-six original screenplays, including Annie Hall, Hannah and Her Sisters, Bananas, Take the Money and Run, Play It Again, Sam, Broadway Danny Rose, Zelig, Radio Days, Manhattan, Husbands and Wives, and all the others.Here are highlights from monologues, including the first one he ever recorded in March, 1964; Woody dicussing his grandfather (\"On his deathbed he sold me this pocket watch\"); remembering a moth who ate his sports jacket; and telling the now-classic tale of the time he shot a moose.Also included are excerpts from more than sixty essays: \"No Kaddish for Weinstein,\" \"Confessions of a Burglar,\" \"The UFO Menace,\" \"The Discovery and Use of the Fake Ink Blot,\" \"A Guide to Some of the Lesser Ballets,\" and \"If the Impressionists Had Been Dentists,\" in which a distraught Dutch dentist named Vincent writes in anguish to his brother, Theo.Hilarious, nostalgic, poignant prose; stunning photographs by Brian Hamill, Mary Ellen Mark, Philippe Halsman, Jill Freedman, and others; color reproductions of paintings by Van Gogh, Picasso, Klee, Chagall, Ernst, Magritte, Pollock, Lichtenstein, Munch - all evoked in Woody's work.The Illustrated Woody Allen Reader is a demonstration and celebration of a great talent.",
        "Category": " Humor , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Strip Tease",
        "Authors": "By Hiaasen, Carl",
        "Description": "A single mom turned stripper finds herself locking horns with a high-powered Congressman when a bachelor party gets out of hand in this inventive tale yet of savage appetites and sweet justice. Only in America could an innocent, if drunken, guest of honor at a strip joint bachelor party become a mortal threat against Big Money and Big Government. Only in south Florida, land of roadside honky-tonks and sinister pleasure boats -- not to mention blackmail and murder -- would a virtuous topless dancer join forces with a cool but clueless cop. And only in the fiction of Carl Hiaasen do readers experience riveting suspense and razor-sharp characters along with the most wicked humor imaginable. Don't miss Strip Tease, Hiaasen's crazed romp through lust, murder, and government machinations.  p.p1 {margin: 0.0px 0.0px 0.0px 0.0px; line-height: 16.0px; font: 12.0px Times; color: #333333; -webkit-text-stroke: #333333; background-color: #ffffff} span.s1 {font-kerning: none}",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The R.A.T. (Real-world Aptitude Test) Revised: Preparing Yourself for Leaving Home (Capital Ideas)",
        "Authors": "By Moyer, Homer E., Jr.",
        "Description": "Just revised with new chapters on \"Living Away from Home\" and \"The Environment\" -- The R.A.T. Revised is perfect for young adults leaving the nest for the first time. Do you know how many teaspoons of sugar the average 12 ounce can of soda contains? Can you change a flat tire? Can you identify the ten largest cities in the world? The R.A.T. (Real-World Aptitude Test) answers these questions and more. Divided into two parts, like the SATs, the first section contains questions in thirty different subject areas, and the second part provides answers and explanations to these life-defining questions. Subject areas include cooking, managing money, etiquette, geography, sports and many more.  As a test of preparedness for the real world, the R.A.T. provides answers to some of life’s most common stumbling blocks, such as how to change a flat tire or how to handle computer problems as well as facts on generalized knowledge in areas such as geography and politics. The R.A.T. is perfect for young adults leaving the nest and adults who are entering a new phase of life such as parenthood or retirement.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Capital Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Reiver's Bride (Secret Clan)",
        "Authors": "By Scott, Amanda",
        "Description": "ABDUCTED HEIRESS is Volume One in this quartet-series.  Molly Gordon, the Maid of Dunsithe, was the wealthiest lass in Scotland-or she would be if anyone could find her fortune. Her father had hidden the fabulous Dunsithe treasure, only to pass away before he could reveal his secret...and before Molly and her sister were spirited away and separated, perhaps forever. Now, on the misty island where she's kept captive, Molly longs for a hero brave enough to rescue her.Sir Finlay Mackenzie-known as Wild Fin-is a hot-tempered warrior who has been granted possession of the Maid of Dunsithe. Armed with the right to marry her or barter her, he must deal with a proud woman who resists his passion and defies his commands. As they wrestle with danger and desire, neither will see the ancient, mystical bond that connects their fates...until Wild Fin and Molly open their hearts to magic and love.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Forever",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Great cooks' guide to fish cookery: America's leading food authorities share their home-tested recipes and expertise on cooking equipment and techniques",
        "Authors": "By American Leading Food Authorities",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "6.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Infallible?: An inquiry",
        "Authors": "By KuÌ\u0088ng, Hans",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Absolute Pleasure",
        "Authors": "By Holt, Cheryl",
        "Description": "She Was A Complete Innocent...The lonely, never-married Lady Elizabeth Harcourt desperately longs for a distraction. She finds one when a chance encounter leads her to the lush studios of artist Gabriel Cristofore. Gabriel insists upon painting Elizabeth's portrait, vowing to do justice to her ravishing figure. But Elizabeth soon realizes that Gabriel's plans for her have little to do with painting-for his true passion in life is the art of seduction...Until He Showed Her The Most Irresistible Passion The first moment Gabriel sets eyes on Elizabeth, he can see she's not his usual mark. Her lush auburn locks, luscious skin, and ruby lips offer just a hint of the pleasure they promise. Despite his desire, he is torn between seducing her instantly and taking his time so that he can explore every aspect of her. But Gabriel is about to discover that some affairs cannot be so easily abandoned-especially when the heart of a rogue has been captured. . .",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "The Ways of Grace: A Novel",
        "Authors": "By Lee, Linda Francis",
        "Description": "GRACE COLEBROOK HAS A WAY ABOUT HER THAT JACK BERENGER CAN’T FORGET. . . .If there’s one thing Grace Colebrook cannot tolerate, it’s hysterics. So when her fiancé betrays her on their wedding day, she refuses to make a scene. She simply walks away—straight into the arms of a powerful stranger. The morning after, regrets fly. But life gets truly complicated when it turns out that the man lives in the apartment below hers. Legendary ER doctor Jack Berenger is a man used to getting what he wants. And he doesn’t want Grace Colebrook—or so he tells himself when he can’t get her out of his mind. She’s prim, passionate, and unpredictable, a far cry from the ice queens who usually catch his eye. But most of all, she breaks through the hard shell he has built around himself . . . filling him with a burning hunger to possess her. At once deeply moving and wildly romantic, two unforgettable people find each other in a world turned upside-down. Now Jack has one final chance to open his heart and prove he can be the sort of man a woman like Grace could love. . . .",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Claiming the Highlander (The MacAllisters)",
        "Authors": "By MacGregor, Kinley",
        "Description": "Determined to end a long-running feud, a fiery young Scottish woman convinces the women of her clan to refuse their men everything until they lay down their arms, but she finds her own plans undermined by her growing attraction to a dashing Highlander. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Man Called Noon: A Novel",
        "Authors": "By L'Amour, Louis",
        "Description": "In one swift moment, a fall wiped away his memory. All he knew for certain was that  someone wanted him dead—and that he had better learn why. But everywhere he turned  there seemed to be more questions—or people too willing to hide the truth behind  a smoke screen of lies. He had only the name he had been told was his own, his mysterious  skill with a gun, and a link to a half million dollars’ worth of buried gold as evidence  of his past life. Was the treasure his? Was he a thief? A killer? He didn’t have  the answers, but he needed them soon. Because what he still didn’t know about himself,  others did—and if he didn’t unlock the secret of his past, he wasn’t going to have  much of a future.",
        "Category": " Fiction , Westerns",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "U is for Undertow: A Kinsey Millhone Novel",
        "Authors": "By Grafton, Sue",
        "Description": "Sue Grafton takes the mystery genre to new heights with this twisting, complex #1 New York Times bestseller that draws private investigator Kinsey Millhone into a case shrouded in the sins of the past.Looking solemn, Michael Sutton arrives in Kinsey Millhone's office with a story to tell. When he was six, he says, he wandered into the woods and saw two men digging a hole. They claimed they were pirates, looking for buried treasure. Now, all these years later, the long-forgotten events have come back to him—and he has pieced them together with news reports from the time, becoming convinced that he witnesses the burial of a kidnapped child.Kinsey has nearly nothing to go on. Sutton doesn't even know where he was that day—and, she soon discovers, he has a history of what might generously be called an active imagination. Despite her doubts, Kinsey sets out to track down the so-called burial site. And what's found there pulls her into a hidden current of deceit stretching back more than twenty years...",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Marian Wood Books/Putnam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "My Final Answer, Celebrity Edition: Thirty Interactive Quizzes That Put You in the Hot Seat",
        "Authors": "By Tiner, John",
        "Description": "",
        "Category": " Reference , Trivia",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Trial by Fire: A Novel of Suspense",
        "Authors": "By Jance, Judith A.",
        "Description": "In the heat of the Arizona desert, a raging fire pushes temperatures to a deadly degree, and one woman is left to burn. Pulled naked and barely breathing from the fire, the victim has no idea who she is, let alone who would do this to her -- or why. In her hospital bed she drifts in and out of consciousness, her only means of communicating a blink of the eye. And then an angel appears. Misguidedly known around town as the \"Angel of Death,\" Sister Anselm has devoted her life to working as an advocate for unidentified patients. To her burn patient, she is a savior. But to this Jane Doe's would-be killer, Sister Anselm's efforts pose a serious threat. Ali Reynolds is on the scene as the new media relations consultant for the Yavapai County Police Department, keeping reporters at bay and circumventing questions about arson and a link to a domestic terrorist group called Earth Liberation Front. But her job quickly becomes much more. As Ali struggles to help Sister Anselm uncover the helpless woman's identity, they realize that by locating the missing relatives they may be exposing the victim once more to a remorseless killer determined to finish the job. Faced with the possibility of putting all three of their lives in jeopardy, Ali fearlessly pursues justice -- and what she discovers is a secret even darker and more twisted than she ever could have imagined.With unerring skill, Jance delivers relentless suspense in what is surely her finest novel yet in this riveting and addictive series.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "London Up Close: District to District, Street by Street (Up Close Series)",
        "Authors": "By Glass, Leonie, Duncan, Fiona, and Sharpe, Carolyn",
        "Description": "Presents information on London's historic buildings, museums, parks, and other points of interest, and includes maps of each city district",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "Natl Textbook Co Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The Diabetes Carbohydrate and Fat Gram Guide : Quick, Easy Meal Planning Using Carbohydrate and Fat Gram Counts",
        "Authors": "By Holzmeister, Lea Ann",
        "Description": "For people with diabetes, counting carbohydrates and fats is the approach recommended by dietitians. This user-friendly guide describes how to use many generic and brand-name foods in meal planning and teaches you to convert carbohydrate grams into carbohydrate exchanges. Nutrient counts for food planning, how to understand grocery store food labels, and how to incorporate different sources of food-count information into meal planning are also covered.",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "American Diabetes Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Househusband",
        "Authors": "By Hudler, Ad",
        "Description": "Lincoln Menner is finding out just how hard it is to be a woman. When his wife Jo was offered her dream job, Linc supported her wholeheartedly, leaving his thriving landscape business in Los Angeles and moving to Rochester, New York. This was a chance to escape the cloying needs and atrocious tastes of his celebrity clientele, start over in fresh surroundings, and spend a little quality time with their three-year-old daughter, Violet. But Linc had no idea what it really meant to be a househusband: To stay home every day, folding laundry, cleaning soap scum, and teaching his little girl to use the potty. To be ignored at parties by his wife’s colleagues who see him as just a homemaker. To be looked upon with suspicious eyes by the neighborhood women who can’t understand what sort of man would choose to stay home. And with each new day, Linc is sure that the next load of whites will be the one that sends him off the deep end.Though he has the house humming, Linc misses the outside world, longing to carry on an adult conversation with adult friends (the electrician and the UPS guy are starting to avoid him). Most of all he misses Jo, who is working all hours of the day and night and barely notices the fabulous dinners he slaves over, much less the husband who cooked them. And then there is Marilyn, the attractive next-door neighbor, who has been so friendly and supportive. . . .Now the only thing Linc knows for sure is that something’s got to give. Should he go back to work and leave Violet in the hands of someone who is sure to be less competent? Or should he give in and embrace his role as househusband extraordinaire? At turns funny, neurotic, and endearingly vulnerable, Linc Menner will win your heart–and make you wish you had a househusband all your own. (and you’l love the recipes!).",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Magic & Malice: Mairelon the Magician / Magician's Ward",
        "Authors": "By Patricia C. Wrede",
        "Description": "",
        "Category": "",
        "Publisher": "SFBC Fantasy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Going Public with Your Faith: Becoming a Spiritual Influence at Work",
        "Authors": "By Larimore, Walter L. and Peel, Bill",
        "Description": "How to take evangelism out of the religious box and weave it into your life at work In every part of the world, people are looking for spiritual answers and resources as never before. But you don’t need to travel to some exotic foreign mission field to find hungry hearts. You spend hours every day in the most strategic place of impact in the world—your workplace. Going Public With Your Faith offers a proven model for evangelism that respects the unique relationships you have with your coworkers, clients, or customers. It shows how you can be authentic instead of artificial when sharing what you believe, build trust with even the most skeptical person, and cultivate caring connections with those who have not yet come to a saving faith in Christ.",
        "Category": " Religion , Christian Ministry , Evangelism",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Crazy about Chocolate: 'Cause it makes me feel so Good!",
        "Authors": "By Gilroy, Mark",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Old Twentieth",
        "Authors": "By Haldeman, Joe",
        "Description": "The twentieth century lies hundreds of years in humanity’s past. But the near-immortal citizens of the future yearn for the good old days—when people’s bodies were susceptible to death through disease and old age. Now, they immerse themselves in virtual reality time machines to explore the life-to-death arc that defined existence so long ago. Jacob Brewer is a virtual reality engineer, overseeing the time machine’s operation aboard the starship Aspera. But on the thousand-year voyage to Beta Hydrii, the eight-hundred member crew gets more reality than they expect when people entering the machine start to die.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "The History of North American Steam",
        "Authors": "By Chant, Christopher",
        "Description": "",
        "Category": " Transportation , Railroads , History",
        "Publisher": "Chartwell Books",
        "Price Starting With ($)": "6.83",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "The Complete Guide to Beer",
        "Authors": "By Kenning, David and Jackson, Robert",
        "Description": "",
        "Category": " Cooking , Beverages , Alcoholic , Beer",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Easy Guitar Tunes (Tunebooks Series)",
        "Authors": "By Danes, Emma and Buckton, Richard",
        "Description": "Tells how to play different types of guitar, introduces the history and construction of the guitar and related instruments, highlights famous guitarists, and provides a collection of simple tunes based on a variety of different styles of music.",
        "Category": " Juvenile Nonfiction , Performing Arts , General",
        "Publisher": "Edc Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Poe, The Selected Writings of Edgar Allan: Poems, Tales, Essays and Reviews (English Library)",
        "Authors": "By Poe, Edgar Allan",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Jorge el Curioso (Curious George) (Spanish Edition)",
        "Authors": "By Rey, H. A. and Rey, Margret",
        "Description": "A Spanish translation of the original Curious George story  Curious George, el personaje favorito de millones de niños alrededor del mundo, tomó el nombre de Jorge el Curioso hace más de quince años, cuando sus cuentos se empezaron a traducir al español. Curious George, a favorite of millions of children all over the world, became Jorge el curioso when translated into Spanish more than fifteen years ago.",
        "Category": " Juvenile Fiction , Animals , Apes, Monkeys, etc.",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "On My Own Two Feet: A Modern Girl's Guide to Personal Finance",
        "Authors": "By Thakor, Manisha and Kedar, Sharon",
        "Description": "Most young women would love to live a carefree lifestyle filled with lunches, Louis Vuitton, and lattes, but what you might not know is that doing so can lead to future financial breakdown.Whether you've been living paycheck-to-paycheck, are trying to save for a down payment on your first home, or are hoping to one day retire in comfort, On My Own Two Feet teaches you how to balance your desire to live well today with the need to save and invest for tomorrow. This lively, no-nonsense financial guide explains:How much of your income to saveHow to avoid the perils of credit card debtHow to create a budget you can live with (and still have fun!)How to invest widely using a keep-it-simple planHow to deal with real-life situations The sooner you apply the financial concepts highlighted by Manisha Thakor and Sharon Kedar, the more likely you'll achieve common life goals--all free from financial stress.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Adams Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Sex Wars: A Novel of Gilded Age New York",
        "Authors": "By Piercy, Marge",
        "Description": "Post–Civil War New York City is the battleground of the American dream. In this era of free love, emerging rights of women, and brutal sexual repression, Freydeh, a spirited young Jewish immigrant, toils at different jobs to earn passage to America for her family. Learning that her younger sister is adrift somewhere in the city, she begins a determined search that carries her from tenement to brothel to prison—as her story interweaves with those of some of the epoch's most notorious figures: Elizabeth Cady Stanton; Susan B. Anthony; sexual freedom activist Victoria Woodhull, the first woman to run for president; and Anthony Comstock, founder of the Society for the Suppression of Vice, whose censorship laws are still on the books.In the tradition of her bestselling World War II epic Gone to Soldiers, Marge Piercy once again re-creates a turbulent period in American history and explores changing attitudes in a land of sacrifice, suffering, promise, and reward.",
        "Category": " Fiction , Historical , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Snow Flower and the Secret Fan: A Novel",
        "Authors": "By See, Lisa",
        "Description": "Lily is haunted by memories–of who she once was, and of a person, long gone, who   defined her existence. She has nothing but time now, as she recounts the tale of   Snow Flower, and asks the gods for forgiveness. In nineteenth-century China, when   wives and daughters were foot-bound and lived in almost total seclusion, the women   in one remote Hunan county developed their own secret code for communication: nu   shu (“women’s writing”). Some girls were paired with laotongs, “old sames,” in emotional   matches that lasted throughout their lives. They painted letters on fans, embroidered   messages on handkerchiefs, and composed stories, thereby reaching out of their isolation   to share their hopes, dreams, and accomplishments. With the arrival of a silk fan   on which Snow Flower has composed for Lily a poem of introduction in nu shu, their   friendship is sealed and they become “old sames” at the tender age of seven. As the   years pass, through famine and rebellion, they reflect upon their arranged marriages,   loneliness, and the joys and tragedies of motherhood. The two find solace, developing   a bond that keeps their spirits alive. But when a misunderstanding arises, their   lifelong friendship suddenly threatens to tear apart. Snow Flower and the Secret   Fan is a brilliantly realistic journey back to an era of Chinese history that is   as deeply moving as it is sorrowful. With the period detail and deep resonance of   Memoirs of a Geisha, this lyrical and emotionally charged novel delves into one of   the most mysterious of human relationships: female friendship.",
        "Category": " Fiction , Psychological",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "We Are All the Target: A Handbook of Terrorism Avoidance and Hostage Survival",
        "Authors": "By Derrer, Douglas S.",
        "Description": "",
        "Category": "",
        "Publisher": "Naval Institute Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Presidents Birthplaces, Homes and Burial Sites",
        "Authors": "By Kochmann, Rachel M.",
        "Description": "",
        "Category": "",
        "Publisher": "Osage Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Above the Law",
        "Authors": "By Green, Tim",
        "Description": "Readers last saw Casey Jordan in The Letter of the Law, where she defended her law professor for the grisly murder of a student only to discover he was guilty. After, Casey left her high-powered practice and wealthy husband and opened a legal aid clinic. When an illegal Mexican immigrant is shot on a ranch outside Dallas, it makes the news, not because of the immigrant, but because of the shooter, Senator Tucker Dean. It looks like a hunting accident, and the well-loved young Senator spins the disaster artfully with his tearful press conference. . . until the sister in law of the victim steps forward with another tale. The senator's wife was regularly visiting the victim, so Casey theorizes he was shot by the husband for revenge. When INS takes the victim's daughter away and tries to deport his wife, it looks like a cover-up of epic proportions. Casey approaches the D.A.'s office with information, only to discover that no prosecutor will take on this case. The senator is powerful and on track for a presidential nomination in a few years, so no one wants to tangle with him. Casey is determined to see the truth come out. If the state won't prosecute a murderer, she will sue him in civil court on behalf of the mother. But this popular senator is wily, vindictive, and dangerous. What will happen to Casey when she goes up against a man who seems above the law?",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The Deep Blue Sea for Beginners",
        "Authors": "By Rice, Luanne",
        "Description": "A legendary island steeped in the mystery and wisdom of centuries…A runaway heiress learning to trust life, and love… A mother and daughter, separated for years, searching for a way to face the future together…New York Times bestselling author Luanne Rice tells a powerful story of love, family, and friendship through the lives of two women who reunite at a place where dreams begin—and where they may be fulfilled at last….Years ago, Lyra Davis left behind a world of wealth and privilege and the people she loved most in the world, unable to reconcile the expectations of her celebrated family with the longings of her own wild heart. Now she lives quietly among a community of expatriates on the isle of Capri, slowly, carefully learning to live fully for the first time, flourishing in the friendship of a singular man who recognizes in her a kindred spirit. Granddaughter of the reigning doyenne of Newport, Rhode Island, wise beyond her sixteen years, Pell Davis is poised to take her place at the pinnacle of society. Yet she and her young sister still long for the mother who ran away from them when they were children so that they could be raised by the father they adored. Pell knows that Lyra felt she loved them best by leaving. But with her father now dead and her sister veering dangerously into fantasy, she will travel across an ocean to find the mother she remembers and the deeper truths they all need so desperately….Lyrical, unforgettable, Luanne Rice’s new novel unfolds against a background of timeless beauty, as an unlikely love affair reshapes the meaning of devotion and three generations of women resist the pull of memory and tradition to find a new way forward.",
        "Category": " Fiction , Women",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Realistic Figure Drawing",
        "Authors": "By Sheppard, Joseph",
        "Description": "Realistic Figure Drawing offers hundreds of beautiful figure drawings executed in Sheppard's classical, timeless style. Each of the ten chapters opens with a brief introduction, followed by illustrations presenting the key ideas about drawing the figure. Through studying these drawings, and honing your own skills through practice, you'll learn how to:Capture the dynamic action of the figureRender the figure in light and shadeProportion the figure so it has dignity and graceDraw the masses and forms of the figure accurately",
        "Category": " Art , Techniques , Drawing",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Yes/No Design: Discover Your Decorating Style With Taste-Revealing Exercises and Examples",
        "Authors": "By Love, Diane, Sarramon, Christian (PHT), and Sarramon, Christian",
        "Description": "Acclaimed designer and artist Diane Love shows you how, in this beautifully photographed volume, to discover and define your personal taste, then demonstrates how to build a decor that is functional, aesthetically pleasing, and truly reflective of your personality. Within the pages of this beautifully photographed book, acclaimed designer and artist Diane Love presents a truly innovative approach to interior design by equipping you with an understanding of your unique taste and the ability to use it to create your personal decorating style. Through easy, fully illustrated, step-by-step exercises and examples, she helps you to discover and define your taste, then demonstrates how you can use this knowledge to create a functional and aesthetic decor that is a true reflection of your personality. PART I: WHAT IS YOUR TASTE? Seven exercises, comprised of simple activities and questions, and free of self-conscious personal evaluation, help you to better define and articulate your taste. The exercises begin by asking you to select from magazines rooms that you love (your YESs) and those you don't (your NOs), then they help you to find words to express your impressions about a room's decoration, to distinguish the common denominators always present in the rooms you choose, and to pinpoint your likes and dislikes through your reactions to elements of a room's design, from architectural elements to furnishings to the color palette. PART II: EXERCISE YOUR TASTE Eleven methods taken in sequence explain the step-by-step process of decorating a room and show you how to incorporate what you have learned about your taste in Part I in order to create a decor that is comfortable and aesthetically pleasing to you. Topics covered include: using space efficiently, evaluating architectural elements, renovating economically, making a furniture plan, achieving visual balance, arranging objects and pictures, choosing lighting, and working with mirrors. QUESTIONNAIRE AND WORKBOOKS A questionnaire specially conceived to assist you in analyzing your decorating style enables you to track your aesthetic attitudes, reactions, and preferences. The two workbooks-one of which is separate from the book and easily portable.",
        "Category": " House & Home , Decorating",
        "Publisher": "Rizzoli",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Toulouse: The Story of a Canada Goose",
        "Authors": "By Cummings, Priscilla and Cohen, A. R. (ILT)",
        "Description": "Uncle Toulouse describes his first migration from Canada to Chesapeake Bay, when he got separated from the rest of his flock along with Dezzy, a snow goose, and the two of them survived the winter together after an encounter with hunters.",
        "Category": " Juvenile Fiction , Animals , Birds",
        "Publisher": "Tidewater Pub",
        "Price Starting With ($)": "8.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Caring for Your Adolescent: Ages 12 to 21",
        "Authors": "By American Academy of Pediatrics and Greydanus, Donald E. (EDT)",
        "Description": "Offers advice on communication, discipline, motivation, learning problems, alcohol and drugs, depression and suicide, social development, and sexuality",
        "Category": " Medical , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "TV WEDDINGS An Illustrated Guide to Prime-Time Nuptials",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "TV Books",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Hungry Girl: Recipes and Survival Strategies for Guilt-Free Eating in the Real World",
        "Authors": "By Lillien, Lisa",
        "Description": "Do you want to eat burgers, chocolate cake, frozen margaritas, fudge, and French fries—and still fit into your pants?  Is life not worth living without brownies and onion rings?  Do you want a surefire way to tame your cravings? From breakfast ideas and chopped salads to guilt-free junk food and cocktails, Hungry Girl recipes taste great but are low in fat and calories.  Check it out!• Eggs Bene-Chick: 183 calories• Bring on the Breakfast Pizza: 127 calories• Ooey Gooey Chili Cheese Nachos: 216 calories• Big Bopper Burger Stopper: 202 calories• Dreamy Chocolate Peanut Butter Fudge: 65 calories• Lord of the Onion Rings: 153 calories• Rockin' Tuna Melt: 212 calories• 7-Layer Burrito Blitz: 277 calories• I Can't Believe It's Not Sweet Potato Pie: 113 calories• Cookie-rific Ice Cream Freeze:  160 calories• With easy instructions, simple steps, and hilariously fun facts and figures, Hungry Girl recipes are as fun to read as they are to make!And when you're not in your kitchen, check out HG's 10 mini survival guides, plus tips 'n tricks that'll help you make smarter food choices anywhere, anytime!",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Macmillan Animal Encyclopedia for Children",
        "Authors": "By Few, Roger",
        "Description": "An encyclopedia of animals, arranged according to their habitats",
        "Category": " Juvenile Fiction , Animals , General",
        "Publisher": "Simon & Schuster Children's Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Christopher Lowell's You Can Do It! Small Spaces: Decorating to Make Every Inch Count",
        "Authors": "By Lowell, Christopher",
        "Description": "Christopher Lowell has done it again! In response to thousands of letters requesting a book on small-room decorating, the Emmy Award-winning star of the Discovery Channel's most popular decorating show applies his innovative thinking to the challenge of turning cramped quarters into a comfortable, stylish home.  He takes the Seven Layers of Design system introduced in his first book one step further by applying it to small spaces and inspiring readers to create extraordinary rooms out of the ordinary.With his trademark energy and innovation, Lowell guides us through two modular homes, one designed in a traditional style, the other in a more modern decor, but both intended to offer the reader a myriad of design options and ideas.  The traditional home features a Nantucket-style master bath, a sunroom with faux stone walls, a French-influenced guest bedroom, and a separate dining room.  The modern home contains a kitchen finished in sophisticated stainless-steel paint, a living room-guest bedroom partitioned with sliding bookcases, and a Zen master bedroom with a space-saving platform bed.Room by room, Lowell tackles such problems as how to make the most of tiny master bedrooms, how to create several rooms from one, what to do with narrow hallways, how to conserve space by creating multipurpose rooms, and how to renovate a guest bathroom for under $100.  Before and after pictures show how anyone can perform miracles just by \"thinking outside the box.\" Once again, Christopher Lowell inspires readers to dream big, no matter how small their space.",
        "Category": " House & Home , Decorating",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Essential Guide to Wilderness Camping and Backpacking in the United States",
        "Authors": "By Cook, Charles",
        "Description": "",
        "Category": " Sports & Recreation , General",
        "Publisher": "Michael Kesend Pub Ltd",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Design on a Dime: Achieve High Style on a $1,000 Budget",
        "Authors": "By Tincher-Durik, Amy (EDT) and Hgtv Books (EDT)",
        "Description": "Design-conscious readers can examine creative makeovers that cost less than $1,000.Highlights 20 rooms from the show, including before-and-after photos.In-depth instruction for projects from stenciling walls to customizing furniture.Show’s talented design team provides plenty of practical tips and foolproof techniques to restyle, recolor, remake, and rearrange any room of the home.Includes a room arranging kit with dozens of templates.Provides detailed buying resource information.",
        "Category": " House & Home , Decorating",
        "Publisher": "HGTV",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Rogers Gray Italian Country Cook Book",
        "Authors": "By Gray, Rose and Rogers, Ruth",
        "Description": "A healthful and delicious collection of recipes from a noted London eatery representing the best in Italian country cuisine features a wide range of soups, pasta, vegetables, and fish dishes. 15,000 first printing.",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Castles of the World Coloring Book (Dover History Coloring Book)",
        "Authors": "By Smith, A. G.",
        "Description": "This carefully researched coloring book offers a fascinating pictorial survey of castles in varying styles from Great Britain, France, Italy, Spain, Portugal, Germany, and other countries, including Japan. You'll find meticulously accurate depictions — ready for coloring — of 31 magnificent structures, from the early English motte-and-bailey strongholds to the romantic nineteenth-century royal residence at Neuschwanstein, built for King Ludwig II of Bavaria.The finely detailed drawings — each printed in authentic detail on a full page or two-page spread — appear in roughly chronological order and illustrate the architectural development of the castle from the primitive tower on the hill of the eleventh century to the sophisticated Norman castle of the mid-thirteenth century, to later structures that represented a shift from fortress to residential castles. Colorists are invited to re-create the appearance of such famed castles as Windsor and Caernarvon (Great Britain), Blarney (Ireland), the Segovia Alcázar (Spain), Krak des Chevaliers (Syria), Hochosterwitz (Austria), Provins and Pierrefonds (France), and many more. Identifying captions provide concise background information on each structure's history, construction, and inhabitants.This attractive volume offers not only hours of educational entertainment for colorists of all ages but a fascinating glimpse of the history and architecture of the medieval era.",
        "Category": " Juvenile Nonfiction , Architecture",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Comfort and Joy (Zebra Historical Romance)",
        "Authors": "By Madden, Sandra",
        "Description": "After his memory returns, Charles Rycroft an art collector from one of Boston's oldest and wealthiest families, is stunned to discover that he is now married to Maeve O'Malley, who saved his life but is of Boston's serving class, and is determined to end their marriage, but when they both are unexpectedly plunged into a world of stolen art and intrigue, Charles learns a lesson in love. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "A History of Washington County Maryland - Volume I",
        "Authors": "By Thomas J. C. Williams",
        "Description": "",
        "Category": "",
        "Publisher": "John M. Runk & L. R. Titsworth",
        "Price Starting With ($)": "189.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1906"
        }
    },
    {
        "Title": "Influencing with Integrity: Management Skills for Communication and Negotiation",
        "Authors": "By Laborde, Genie Z.",
        "Description": "Shows how to use neurolinguistic programming to improve one's skills in communication and negotiation, and stresses the importance of rapport, body language, flexibilty, and goal setting",
        "Category": " Business & Economics , Management",
        "Publisher": "Syntony Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "CISSP Certification All-in-One Exam Guide, Fourth Edition",
        "Authors": "By Harris, Shon",
        "Description": "All-in-One is All You NeedFully revised for the latest exam release, this authoritative volume offers thorough coverage of all the material on the Certified Information Systems Security Professional (CISSP) exam. Written by a renowned security expert and CISSP, this guide features complete details on all 10 exam domains developed by the International Information Systems Security Certification Consortium (ISC²). Inside, you'll find learning objectives at the beginning of each chapter, exam tips, practice questions, and in-depth explanations. CISSP All-in-One Exam Guide, Fourth Edition will not only help you pass the test, but also be your essential on-the-job reference.Covers all 10 subject areas on the exam:Access controlApplication security Business continuity and disaster recovery planning Cryptography Information security and risk managementLegal, regulations, compliance, and investigationsOperations security Physical (environmental) security Security architecture and designTelecommunications and network security The CD-ROM features:Simulated exam with practice questions and answers Video training from the authorComplete electronic book",
        "Category": " Study Aids , Tests (Other)",
        "Publisher": "McGraw-Hill Osborne Media",
        "Price Starting With ($)": "7.93",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "One Wicked Night",
        "Authors": "By Robins, Sari",
        "Description": "To save her kindly protector, a high-ranking marquis, who has been wrongfully accused of murder and incarcerated in Newgate Prison, Lillian Kane enlists the aid of Nicholas Redford, a man who has no interest in allowing a murderous scoundrel escape justice or in risking his fledgling inquiry firm by becoming involved with the man's mistress. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Hot Temper",
        "Authors": "By Rogers, Evelyn",
        "Description": "When she takes a job at Buckingham Ranch, Temperance Tyler, a veritable spitfire, meets her match in half-breed Brit Hand, half-Comanche and the son of an English earl who shows her a passion like she has never known. Reprint.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The Circle of a Promise",
        "Authors": "By Rosburg, Helen A.",
        "Description": "After his one true love, Amarantha of Ullswater, dies in his arms, Stephen of Bellingham, a valiant knight, wakes up in the future where the power of reincarnation reunites him with his beloved, giving him a second chance at saving her life and fulfilling his destiny. Original.",
        "Category": " Fiction , Romance , Time Travel",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Print's Best Typography 2: Winning Designs from Print Magazine's National Competition",
        "Authors": "By Silver, Linda (EDT)",
        "Description": "",
        "Category": " Design , Graphic Arts , Typography",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Open: An Autobiography",
        "Authors": "By Agassi, Andre",
        "Description": "From Andre Agassi, one of the most beloved athletes in history and one of the most gifted men ever to step onto a tennis court, a beautiful, haunting autobiography.Agassi’s incredibly rigorous training begins when he is just a child. By the age of thirteen, he is banished to a Florida tennis camp that feels like a prison camp. Lonely, scared, a ninth-grade dropout, he rebels in ways that will soon make him a 1980s icon. He dyes his hair, pierces his ears, dresses like a punk rocker. By the time he turns pro at sixteen, his new look promises to change tennis forever, as does his lightning-fast return. And yet, despite his raw talent, he struggles early on. We feel his confusion as he loses to the world’s best, his greater confusion as he starts to win. After stumbling in three Grand Slam finals, Agassi shocks the world, and himself, by capturing the 1992 Wimbledon. Overnight he becomes a fan favorite and a media target.Agassi brings a near-photographic memory to every pivotal match and every relationship. Never before has the inner game of tennis and the outer game of fame been so precisely limned. Alongside vivid portraits of rivals from several generations—Jimmy Connors, Pete Sampras, Roger Federer—Agassi gives unstinting accounts of his brief time with Barbra Streisand and his doomed marriage to Brooke Shields. He reveals a shattering loss of confidence. And he recounts his spectacular resurrection, a comeback climaxing with his epic run at the 1999 French Open and his march to become the oldest man ever ranked number one.In clear, taut prose, Agassi evokes his loyal brother, his wise coach, his gentle trainer, all the people who help him regain his balance and find love at last with Stefanie Graf. Inspired by her quiet strength, he fights through crippling pain from a deteriorating spine to remain a dangerous opponent in the twenty-first and final year of his career. Entering his last tournament in 2006, he’s hailed for completing a stunning metamorphosis, from nonconformist to elder statesman, from dropout to education advocate. And still he’s not done. At a U.S. Open for the ages, he makes a courageous last stand, then delivers one of the most stirring farewells ever heard in a sporting arena.With its breakneck tempo and raw candor, Open will be read and cherished for years. A treat for ardent fans, it will also captivate readers who know nothing about tennis. Like Agassi’s game, it sets a new standard for grace, style, speed, and power.",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Without Warning (The Disappearance)",
        "Authors": "By Birmingham, John",
        "Description": "In Kuwait, American forces are locked and loaded for the invasion of Iraq. In Paris, a covert agent is close to cracking a terrorist cell. And just north of the equator, a sailboat manned by a drug runner and a pirate is witness to the unspeakable. In one instant, all around the world, everything will change. A wave of inexplicable energy slams into the continental United States. America as we know it vanishes. From a Texas lawyer who happens to be in the right place at the right time to an engineer in Seattle who becomes his city’s only hope, from a combat journalist trapped in the Middle East to a drug runner off the Mexican coast, Without Warning tells a fast, furious story of survival, violence, and a new, soul-shattering reality.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Things I've Been Silent About: Memories of a Prodigal Daughter",
        "Authors": "By Nafisi, Azar",
        "Description": "\"Absorbing . . . a testament to the ways in which narrative truth-telling—from the greatest works of literature to the most intimate family stories—sustains and strengthens us.”—O: The Oprah MagazineIn this stunning personal story of growing up in Iran, Azar Nafisi shares her memories of living in thrall to a powerful and complex mother against the backdrop of a country’s political revolution. A girl’s pain over family secrets, a young woman’s discovery of the power of sensuality in literature, the price a family pays for freedom in a country beset by upheaval—these and other threads are woven together in this beautiful memoir as a gifted storyteller once again transforms the way we see the world and “reminds us of why we read in the first place” (Newsday).Praise for Things I've Been Silent About“Deeply felt . . . an affecting account of a family’s struggle.”—New York Times  “A gifted storyteller with a mastery of Western literature, Nafisi knows how to use language both to settle scores and to seduce.”—New York Times Book Review  “An immensely rewarding and beautifully written act of courage, by turns amusing, tender and obsessively dogged.”—Kirkus Reviews (starred review) “A lyrical, often wrenching memoir.”—People",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "How to Sew a Button: And Other Nifty Things Your Grandmother Knew",
        "Authors": "By Bried, Erin",
        "Description": "“Waste not, want not” with this guide to saving money, taking heart, and enjoying the simple pleasures of life.Nowadays, many of us “outsource” basic tasks. Food is instant, ready-made, and processed with unhealthy additives. Dry cleaners press shirts, delivery guys bring pizza, gardeners tend flowers, and, yes, tailors sew on those pesky buttons. But life can be much simpler, sweeter, and richer–and a lot more fun, too! As your grandmother might say, now is not the time to be careless with your money, and it actually pays to learn how to do things yourself!Practical and empowering, How to Sew a Button collects the treasured wisdom of nanas, bubbies, and grandmas from all across the country–as well as modern-day experts–and shares more than one hundred step-by-step essential tips for cooking, cleaning, gardening, and entertaining, including how to• polish your image by shining your own shoes• grow your own vegetables (and stash your bounty for the winter)• sweeten your day by making your own jam• use baking soda and vinegar to clean your house without toxic chemicals• feel beautiful by perfecting your posture• roll your own piecrust and find a slice of heaven• fold a fitted sheet to crisp perfection• waltz without stepping on any toesComplete with helpful illustrations and brimming with nostalgic charm, How to Sew a Button provides calm and comfort in uncertain times. By doing things yourself, with care and attention, you and your loved ones will feel the pleasing rewards of a job well done.",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Bricklayer: A Novel",
        "Authors": "By Boyd, Noah",
        "Description": "“Terrific pace, surprises galore….Move over Jack Reacher, here comes The Bricklayer.” —James Patterson There is a brand new master on the thriller scene. Noah Boyd makes a truly spectacular entrance with The Bricklayer—the first in an explosive new series featuring former FBI agent Steve Vail that recalls the #1 bestsellers of John Sandford and Lee Child. An ex-FBI agent himself, Boyd adds gritty insider knowledge and color to this stunning novel, and the word on the street is The Bricklayer is fabulous. Kay Scarpetta’s creator, New York Times bestseller Patricia Cornwell, calls it, “Dazzling,” while Lee Child himself raves, “Non-stop action and non-stop authenticity make this a real winner.”",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The Information Officer: A Novel",
        "Authors": "By Mills, Mark",
        "Description": "Mark Mills's bestselling novels Amagansett and The Savage Garden have won him widespread acclaim for his singular brand of suspense. Weaving a haunting and atmospheric historical backdrop with a tense plot of murder and an unforgettable love story, he delivers another riveting tale in The Information Officer.Summer 1942: Malta, a small windswept island in the Mediterranean, has become the most bombed patch of earth on the planet, worse even than London during the Blitz. The Maltese, a fiercely independent people, withstand the relentless Axis air raids.Max Chadwick is the British officer charged with manipulating the news on Malta to bolster the population's fragile esprit de corps. This is all, besides a few broken-down fighter planes, that stands in the face of Nazi occupation and perhaps even victory—for Malta is the stepping-stone the Germans need between Europe and North Africa.When Max learns of the brutal murder of a young island woman—along with evidence that the crime was committed by a British officer—he knows that the Maltese loyalty to the war effort could be instantly shattered. As the clock ticks down toward all-out invasion, Max must investigate the murder—beyond the gaze of his superiors, friends, and even the woman he loves.Filled with remarkably poignant and atmospheric details of life under siege, and indelible characters who live and breathe, The Information Officer is a taut, transporting thriller—an enthralling novel told with exceptional skill and style.",
        "Category": " Fiction , Mystery & Detective , Historical",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "The Biological Time Bomb",
        "Authors": "By Gordon Rattray Taylor",
        "Description": "",
        "Category": "",
        "Publisher": "New American Library World",
        "Price Starting With ($)": "5.57",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Parenting Bible: The Answers to Parents' Most Common Questions",
        "Authors": "By Goldstein, Robin and Gallant, Janet",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Sourcebooks Inc",
        "Price Starting With ($)": "6.03",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Altar of Eden",
        "Authors": "By Rollins, James",
        "Description": "“Every James Rollins delivers mach-speed mayhem, throat-clutching suspense, high-style adventure, and a terrific story told terrifically.”—Steve Berry, author of The Romanov ProphecyThe thriller king praised for his “edge-of-your-seat excitement” (San Francisco Chronicle), James Rollins storms the New York Times bestseller list with every novel he writes. With his latest breathtaking blockbuster, Altar of Eden, Rollins takes a breather from his Sigma Force adventures (Map of Bones, Black Order, The Judas Strain, et al) while delivering all the action, surprise, and intensity for which he’s well known—and loved. Combining science, history, and breakneck suspense—and a secret tied to the Book of Genesis—Altar of Eden is sure to satisfy every James Rollins fan while winning over a slew of new converts.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Not My Daughter",
        "Authors": "By Delinsky, Barbara",
        "Description": "A pregnancy pact between three teenaged girls puts their mothers' love to the ultimate test in this explosive new novel from Barbara Delinsky, “a first-rate storyteller who creates characters as familiar as your neighbors.” (Boston Globe)  When Susan Tate's seventeen-year-old daughter, Lily, announces she is pregnant, Susan is stunned. A single mother, she has struggled to do everything right. She sees the pregnancy as an unimaginable tragedy for both Lily and herself. Then comes word of two more pregnancies among high school juniors who happen to be Lily's best friends-and the town turns to talk of a pact. As fingers start pointing, the most ardent criticism is directed at Susan. As principal of the high school, she has always been held up as a role model of hard work and core values. Now her detractors accuse her of being a lax mother, perhaps not worthy of the job of shepherding impressionable students. As Susan struggles with the implications of her daughter's pregnancy, her job, financial independence, and long-fought-for dreams are all at risk. The emotional ties between mothers and daughters are stretched to breaking in this emotionally wrenching story of love and forgiveness. Once again, Barbara Delinsky has given us a powerful novel, one that asks a central question: What does it take to be a good mother?",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Boredom Busters!: The Curious Kids' Activity Book (Williamson Kids Can! Series)",
        "Authors": "By Hart, Avery, Mantell, Paul, and Braren, Loretta Trezzo (ILT)",
        "Description": "Suggests a variety of both indoor and outdoor activities which relate to nature, the environment, ecology, music, sky watching, backyard fun, the neighborhood, and the wider world",
        "Category": " Juvenile Nonfiction , Activity Books , General",
        "Publisher": "WorthyKids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Kids and Weekends!: Creative Ways to Make Special Days",
        "Authors": "By Hart, Avery, Mantell, Paul, and Braren, Loretta Trezzo (ILT)",
        "Description": "Provides instructions for making a home recycling center, putting on a magic show, making musical instruments, and performing other types of weekend activities.",
        "Category": " Family & Relationships , Reference",
        "Publisher": "Williamson Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Where the God of Love Hangs Out: Fiction",
        "Authors": "By Bloom, Amy",
        "Description": "Love, in its many forms and complexities, weaves through this collection by Amy Bloom, the New York Times bestselling author of Away. Bloom's astonishing and astute new work of interconnected stories illuminates the mysteries of passion, family, and friendship.Propelled by Bloom's dazzling prose, unmistakable voice, and generous wit, Where the God of Love Hangs Out takes us to the margins and the centers of real people's lives, exploring the changes that love and loss create. A young woman is haunted by her roommate's murder; a man and his daughter-in-law confess their sins in the unlikeliest of places. In one quartet of interlocking stories, two middle-aged friends, married to others, find themselves surprisingly drawn to each other, risking all while never underestimating the cost. In another linked set of stories, we follow mother and son for thirty years as their small and uncertain family becomes an irresistible tribe. Insightful, sensuous, and heartbreaking, these stories of passion and disappointment, life and death, capture deep human truths. As The New Yorker has said, \"Amy Bloom gets more meaning into individual sentences than most authors manage in whole books.\"",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Comeback America: Turning the Country Around and Restoring Fiscal Responsibility",
        "Authors": "By Walker, David M.",
        "Description": "He's one of America's most capable, canny, candid, and independent financial experts. Now David M. Walker sounds a call to action. Comeback America is a tough-minded, innovative, inspiring guide to help us avoid the approaching economic abyss and put the country back on track again.As comptroller general of the United States and head of the Government Accountability Office (GAO)—\"the nation's top auditor\"—Walker warned Congress and the administration as the federal surplus became a giant deficit under George W. Bush. As president and CEO of the Peter G. Peterson Foundation, he now works full-time to raise public awareness regarding mounting debt burdens being imposed on future generations. Comeback America is his crucial manifesto, a way for President Obama to end out-of-control government spending and reform our tax, retirement, health care, defense, and other systems—before it's too late.Walker believes that by 2030, absent significant reforms to current government programs and policies, federal taxes could double from current levels, meaning less money and poorer education for kids—which will hurt families along with our nation's economic strength and position in the world. If our foreign creditors—such as China—decide to buy fewer of our Treasury bonds, interest rates will rise and cars and homes will become less affordable. But it doesn't have to be that way. Comeback America shows how we can return to our founding principles of fiscal responsibility and stewardship for future generations. The book includes bold ideas to control spending, save Social Security, dramatically alter Medicare, and simplify the tax code—all taking into account the Obama Administration's current efforts, which receive never-before-published assessments both complimentary and critical.    Nonpartisan, nonideological, and filled with a love of the country its esteemed author has spent his life serving, Comeback America is a book for anyone interested in America's economic future—in other words, a book everyone should read.",
        "Category": " Political Science , Public Policy , Economic Policy",
        "Publisher": "Random House",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Heart and Soul",
        "Authors": "By Binchy, Maeve",
        "Description": "New York Times BestsellerA story of patients and staff, family, and friends who are part of a heart clinic in a community caught between the old Ireland and the new. Dr. Clara Casey has been offered the thankless job of establishing the underfunded clinic and agrees to take it on for a year. She has plenty on her plate already—two difficult adult daughters and the unwanted attentions of her ex-husband—but she assembles a wonderfully diverse staff devoted to helping their demanding, often difficult patients.Before long the clinic is established as an essential part of the community, and Clara must decide whether or not to leave a place where lives are saved, courage is rewarded, and humor and optimism triumph over greed and self-pity. \"Good-hearted and entertaining.... Offers many honest pleasures.\" —The Washington Post",
        "Category": " Fiction , Women",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Night of the Living Mad Libs: World's Greatest Word Game",
        "Authors": "By Price, Roger and Stern, Leonard",
        "Description": "If you just heard someone say: \"My (part of body) was pounding and my breath was coming in gasps. I screamed as I felt the slimy hand of the (noun) touch my neck!\" you've obviously been playing Night of the Living Mad Libs R!Just when you thought it was safe to turn out the lights, here comes this hilarious new addition to the series that's been keeping readers in stitches for over 35 years. You'll die laughing as you play your way through gleefully gruesome stories about everyone's favorite monsters and supernatural experiences. Just read the simple directions and play Mad Libs&#174 with friends or by yourself. It's the world's greatest word game-complete with a sturdy chip-board for portable Mad Libs&#174 fun.",
        "Category": " Juvenile Fiction , Sports & Recreation , Games",
        "Publisher": "Mad Libs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Lark and Termite (Vintage Contemporaries)",
        "Authors": "By Phillips, Jayne Anne",
        "Description": "National Bestseller New York Times Notable Book  Chicago Tribune, Christian Science Monitor, The Washington Post and Los Angeles Times Best Book of the YearLark and Termite is a rich, wonderfully alive novel about seventeen year old Lark and her brother, Termite, living in West Virginia in the 1950s. Their mother, Lola, is absent, while their aunt, Nonie, raises them as her own, and Termite’s father, Corporal Robert Leavitt, is caught up in the early days of the Korean War. Award-winning author Jayne Anne Phillips intertwines family secrets, dreams, and ghosts in a story about the love that unites us all.",
        "Category": " Fiction , Sagas",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Let the Great World Spin: A Novel",
        "Authors": "By McCann, Colum",
        "Description": "NATIONAL BOOK AWARD WINNER • Colum McCann’s beloved novel inspired by Philippe Petit’s daring high-wire stunt, which is also depicted in the film The Walk starring Joseph Gordon-LevittIn the dawning light of a late-summer morning, the people of lower Manhattan stand  hushed, staring up in disbelief at the Twin Towers. It is August 1974, and a mysterious  tightrope walker is running, dancing, leaping between the towers, suspended a quarter  mile above the ground. In the streets below, a slew of ordinary lives become extraordinary  in bestselling novelist Colum McCann’s stunningly intricate portrait of a city and  its people.  Let the Great World Spin is the critically acclaimed author’s most ambitious  novel yet: a dazzlingly rich vision of the pain, loveliness, mystery, and promise  of New York City in the 1970s. Corrigan, a radical young Irish monk, struggles with  his own demons as he lives among the prostitutes in the middle of the burning Bronx.  A group of mothers gather in a Park Avenue apartment to mourn their sons who died  in Vietnam, only to discover just how much divides them even in grief. A young artist  finds herself at the scene of a hit-and-run that sends her own life careening sideways.  Tillie, a thirty-eight-year-old grandmother, turns tricks alongside her teenage daughter,  determined not only to take care of her family but to prove her own worth. Elegantly  weaving together these and other seemingly disparate lives, McCann’s powerful allegory  comes alive in the unforgettable voices of the city’s people, unexpectedly drawn  together by hope, beauty, and the “artistic crime of the century.”A sweeping and  radical social novel, Let the Great World Spin captures the spirit of America in  a time of transition, extraordinary promise, and, in hindsight, heartbreaking innocence.  Hailed as a “fiercely original talent” (San Francisco Chronicle), award-winning novelist  McCann has delivered a triumphantly American masterpiece that awakens in us a sense  of what the novel can achieve, confront, and even heal.Praise for Let the Great World Spin“This is a gorgeous book, multilayered and deeply felt, and it’s a damned lot of fun to read, too. Leave it to an Irishman to write one of the greatest-ever novels about New York. There’s so much passion and humor and pure lifeforce on every page of Let the Great World Spin that you’ll find yourself giddy, dizzy, overwhelmed.”—Dave Eggers“Stunning . . . [an] elegiac glimpse of hope . . . It’s a novel rooted firmly in time and place. It vividly captures New York at its worst and best. But it transcends all that. In the end, it’s a novel about families—the ones we’re born into and the ones we make for ourselves.”—USA Today “The first great 9/11 novel . . . We are all dancing on the wire of history, and even on solid ground we breathe the thinnest of air.”—Esquire “Mesmerizing . . . a Joycean look at the lives of New Yorkers changed by a single act on a single day . . . Colum McCann’s marvelously rich novel . . . weaves a portrait of a city and a moment, dizzyingly satisfying to read and difficult to put down.”—The Seattle Times “Vibrantly whole . . . With a series of spare, gorgeously wrought vignettes, Colum McCann brings 1970s New York to life. . . . And as always, McCann’s heart-stoppingly simple descriptions wow.”—Entertainment Weekly “An act of pure bravado, dizzying proof that to keep your balance you need to know how to fall.”—O: The Oprah Magazine",
        "Category": " Fiction , Literary",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "No Angel: My Harrowing Undercover Journey to the Inner Circle of the Hells Angels",
        "Authors": "By Dobyns, Jay and Johnson-Shelton, Nils",
        "Description": "From the first federal agent to infiltrate the inner circle of  the outlaw Hells Angels Motorcycle Club comes the inside story of the 21-month  operation that almost cost him his family, his sanity, and his life. Getting shot  in the chest as a rookie agent, bartering for machine guns, throttling down the highway  at 100 mph, and responding to a full-scale, bloody riot between the Hells Angels  and their rivals, the Mongols—these are just a few of the high-adrenaline experiences  Dobyns recounts in this action-packed, hard-to-imagine-but-true story. Dobyns leaves  no stone of his harrowing journey unturned. At runs and clubhouses, between rides  and riots, Dobyns befriends bad-ass bikers, meth-fueled “old ladies,” gun fetishists,  psycho-killer ex-cons, and even some of the “Filthy Few”--the elite of the Hells Angels  who’ve committed extreme violence on behalf of their club. Eventually, at parties  staged behind heavily armed security, he meets legendary club members such as Chuck  Zito, Johnny Angel, and the godfather of all bikers, Ralph “Sonny” Barger. To blend  in with them, he gets full-arm ink; to win their respect, he vows to prove himself  a stone-cold killer. Hardest of all is leading a double life, which has him torn  between his devotion to his wife and children, and his pledge to become the first  federal agent ever to be “fully patched” into the Angels’ near-impregnable ranks.  His act is so convincing that he comes within a hairsbreadth of losing himself.   Eventually, he realizes that just as he’s been infiltrating the Hells Angels, they’ ve been infiltrating him. And just as they’re not all bad, he’s not all good. Reminiscent  of Donnie Brasco’s uncovering of the true Mafia, this is an eye-opening portrait  of the world of bikers--the most in-depth since Hunter Thompson’s seminal work—one  that fully describes the seductive lure criminal camaraderie has for men who would  otherwise be powerless outsiders. Here is all the nihilism, hate, and intimidation,  but also the freedom—and, yes, brotherhood—of the only truly American form of organized  crime.",
        "Category": " True Crime , Organized Crime",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Green Zone (Imperial Life/Emerald City Movie Tie-In Edition)",
        "Authors": "By Chandrasekaran, Rajiv",
        "Description": "The fullest, most intimate account of life in the Green Zone, the sheltered bubble where idealistic Americans planned the occupation while Iraq fell apart.The Green Zone, Baghdad, 2003: in this walled-off compound of swimming pools and luxurious amenities, Paul Bremer and his Coalition Provisional Authority set out to fashion a new, democratic Iraq. Staffed by idealistic aides chosen primarily for their political affiliations and views on issues such as abortion, the CPA spent the crucial first year of occupation pursuing goals that had little to do with the immediate crises of a postwar nation. In this acclaimed firsthand account, the former Baghdad bureau chief of The Washington Post gives us an intimate and remarkably dispassionate portrait of life inside this Oz-like place, which continued unaffected by the growing mayhem outside. This is a quietly devastating portrait of imperial folly, and an essential book for anyone who wants to understand those early days when things went irrevocably wrong in Iraq.",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Conversational Spanish (Living Language Series)",
        "Authors": "By Stern, Irwin, Weiman, Ralph William, and Succar, O. A.",
        "Description": "Booklet included in the book/cassette or book/CD package of Living Spanish.",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Crown Publishers/Living Language",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Secrets of Eden",
        "Authors": "By Bohjalian, Christopher A.",
        "Description": "From the bestselling author of The Double Bind, Midwives, and Skeletons at the Feast comes a novel of shattered faith, intimate secrets, and the delicate nature of sacrifice.\"There,\" says Alice Hayward to Reverend Stephen Drew, just after her baptism, and just before going home to the husband who will kill her that evening and then shoot himself. Drew, tortured by the cryptic finality of that short utterance, feels his faith in God slipping away and is saved from despair only by a meeting with Heather Laurent, the author of wildly successful, inspirational books about . . . angels. Heather survived a childhood that culminated in her own parents' murder-suicide, so she identifies deeply with Alice’s daughter, Katie, offering herself as a mentor to the girl and a shoulder for Stephen – who flees the pulpit to be with Heather and see if there is anything to be salvaged from the spiritual wreckage around him.But then the State's Attorney begins to suspect that Alice's husband may not have killed himself. . .and finds out that Alice had secrets only her minister knew.Secrets of Eden is both a haunting literary thriller and a deeply evocative testament to the inner complexities that mark all of our lives.  Once again Chris Bohjalian has given us a riveting page-turner in which nothing is precisely what it seems.  As one character remarks, “Believe no one.  Trust no one.  Assume all of our stories are suspect.”",
        "Category": " Fiction , Psychological",
        "Publisher": "Shaye Areheart Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "The Death of American Virtue: Clinton vs. Starr",
        "Authors": "By Gormley, Ken",
        "Description": "Ten years after one of the most polarizing political scandals in American history, author Ken Gormley offers an insightful, balanced, and revealing analysis of the events leading up to the impeachment trial of President William Jefferson Clinton. From Ken Starr’s initial Whitewater investigation through the Paula Jones sexual harassment suit to the Monica Lewinsky affair, The Death of American Virtue is a gripping chronicle of an ever-escalating political feeding frenzy.In exclusive interviews, Bill Clinton, Ken Starr, Monica Lewinsky, Paula Jones, Susan McDougal, and many more key players offer candid reflections on that period. Drawing on never-before-released records and documents—including the Justice Department’s internal investigation into Starr, new details concerning the death of Vince Foster, and evidence from lawyers on both sides—Gormley sheds new light on a dark and divisive chapter, the aftereffects of which are still being felt in today’s political climate.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Crown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Now Eat This!: 150 of America's Favorite Comfort Foods, All Under 350 Calories: A Cookbook",
        "Authors": "By DiSpirito, Rocco",
        "Description": "#1 NEW YORK TIMES BESTSELLER • Fried chicken, macaroni and cheese, brownies, and 147 other favorite recipes under 350 calories! In this delectable cookbook, award-winning chef Rocco DiSpirito transforms America’s favorite comfort foods into deliciously healthy dishes—all with zero bad carbs, zero bad fats, zero sugar, and maximum flavor. What’s more, Rocco provides time-saving shortcuts, helpful personal advice, and nutritional breakdowns for each recipe from a board-certified nutritionist. So prepare your favorite foods without the guilt. Finally, a world-class chef has made healthy food taste great!",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "My Very First Hansel and Gretel Storybook (Creative Child Press)",
        "Authors": "By Rochelle, Illustrated by Alan Leiner Larkin",
        "Description": "",
        "Category": "",
        "Publisher": "Playmore Inc and Waldman Publishing Company, 1992",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Wings of the Hawk",
        "Authors": "By James, Leigh Franklin",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    }
]