[
    {
        "Title": "Something Wicked (A Mallorean Novel)",
        "Authors": "By Beverley, Jo",
        "Description": "Bored and frustrated, Lady Elfled Malloren disguises herself as a mysterious beauty at the Vauxhall Gardens Masquerade, only to find herself in bed with her family's most dangerous enemy, the Earl of Walgrave. Reissue.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Cheshire Cat's Eye (A Sharon Mccone Mystery)",
        "Authors": "By Muller, Marcia",
        "Description": "Investigating her friend's murder, private eye Sharon McCone follows a trail into San Francisco's glamorous architectural community in search of a very valuable clue--a Tiffany lamp adorned with the grinning face of a Cheshire Cat. Reissue.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Three Dog Bakery Cookbook: Over 50 Recipes for All-Natural Treats for Your Dog",
        "Authors": "By Dye, Dan, Beckloff, Mark, and Three Dog Bakery (COR)",
        "Description": "Three Dog Bakery stores are legendary. Stocked with cleverly named canine confections--from SnickerPoodles to Scotty Biscotti to Big Scary Kitties -- the pooch patisserie has grown into an international operation, featuring its fresh-baked, all-natural bakery treats for dogs.Three Dog Bakery&#39;s 1996 autobiography, Short Tails and Treats from Three Dog Bakery, tells all about how Dan Dye and Mark Beckloff, with inspiration from their three dogs, came to run 12 retail bakeries around the world, as well as wholesale and mail-order divisions. Now, Three Dog Bakery is sharing its secrets with dog devotees everywhere. With this new Three Dog Bakery Cookbook, readers will be able to concoct the kind of tasty treats that canines crave.Featuring more than 50 recipes--from Banana Mutt Cake to Great Danish, and from Fiesta Bones to Gracie&#39;s Megapizza--the Three Dog Bakery Cookbook will have dogs salivating like Pavlov&#39;s proverbial pet. Full-color finished dish photographs give human cooks a look at what they&#39;re making, while health tips and canine trivia sprinkled throughout the book both educate and entertain.Arranged into six chapters, Three Dog Bakery Cookbook covers the dog-snack gamut, from savory morsels to carob-coated treats, from luscious entrees to chewy soft-baked confections. Readers will find recipes for all doggie occasions, from birthdays to obedience school graduation.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Blood Shot: A V. I. Warshawski Novel",
        "Authors": "By Paretsky, Sara",
        "Description": "“No one, male or female, writes better P.I. books than Paretsky.”—The Denver Post V. I. Warshawski isn’t crazy about going back to her old south Chicago neighborhood, but a promise is something she always keeps. Caroline, a childhood friend, has a dying mother and a problem—after twenty-five years she wants V.I. to find the father she never knew. But when V.I. starts probing into the past, she  stumbles onto some long-buried secrets—and a very new corpse. Now she’s stirring up a deadly mix of big business and chemical corruption that may become a toxic shock to a snooper who knows too much. “[Paretsky’s] work does more than turn the genre upside down: her books are beautifully paced and plotted, and the dialogue is fresh and smart.”—Newsweek “Her best and boldest work to date . . . a criminal investigation that is a genuine heroic quest.”—The New York Times Book Review",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "The Scarlet Letter (Barnes & Noble Classics Series) (B&N Classics)",
        "Authors": "By Hawthorne, Nathaniel",
        "Description": "The Scarlet Letter, by Nathaniel Hawthorne, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics: New introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. America’s first psychological novel, Nathaniel Hawthorne’s The Scarlet Letter is a dark tale of love, crime, and revenge set in colonial New England. It revolves around a single, forbidden act of passion that forever alters the lives of three members of a small Puritan community: Hester Prynne, an ardent and fierce woman who bears the punishment of her sin in humble silence; the Reverend Arthur Dimmesdale, a respected public figure who is inwardly tormented by long-hidden guilt; and the malevolent Roger Chillingworth, Hester’s husband—a man who seethes with an Ahab-like lust for vengeance. The landscape of this classic novel is uniquely American, but the themes it explores are universal—the nature of sin, guilt, and penitence, the clash between our private and public selves, and the spiritual and psychological cost of living outside society. Constructed with the elegance of a Greek tragedy, The Scarlet Letter brilliantly illuminates the truth that lies deep within the human heart. Nancy Stade is trained as a lawyer and has worked in the federal government and the private sector. She currently lives in Mexico, where she is working on a novel.",
        "Category": " Fiction , Classics",
        "Publisher": "Sterling Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Windows Vista For Dummies",
        "Authors": "By Rathbone, Andy",
        "Description": "Create music CDs and photo DVDs or even watch TV  Move your files to a new computer, or get your old PC ready for Vista The thing that's made Windows For Dummies so successful is that it's packed with the basics you need to make Windows work. This book gets you through all the Windows Vista tasks and tripwires, including starting programs, finding files, navigating the new see-through interface, staying safe while you cruise the Internet, and much more. Discover how to  Find files when they're hiding Hook up with another computer Make Vista work like XP Block Internet bad guys Share a PC without sharing your files Fix problems yourself",
        "Category": " Computers , Operating Systems , Windows Server",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Chicago Diner Cookbook",
        "Authors": "By Kaucher, Jo A.",
        "Description": "",
        "Category": " Cooking , Vegetarian & Vegan",
        "Publisher": "Native Voices",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Scienceworks: 65 Experiments That Introduce The Fun And Wonder Of Science",
        "Authors": "By Ontario Science Centre",
        "Description": "Did you know you could take a piece of paper, get a pair of scissors, and cut a hole in it big enough for you to step through? That it’s possible to see sound and to hear through your teeth? To make it rain in your living room or find out how fast the earth is spinning? These are just a few of the 65 projects in this engaging book created by the prestigious Ontario Science Centre that will enable children to experience and enjoy science—as they’re learning about it.Many of these easy-to-perform experiments are presented as puzzles or tricks, each representing one of the fundamental principles of science. Others present complex phenomena on a small, observable scale. For example, kids will discover why icebergs float and where the wind gets its strength. They’ll construct a camera, support a stack of books on mere eggshells, and life a floating ice cube out of a glass of water by using just one end of a piece of string. And there’s much more.Each project is explained in clear step-by-step instructions and humorous drawings, and it ends with a word on the scientific forces at work. And most important, none of the experiments requires sophisticated equipment—only some curiosity and a few everyday household items. Parents will find these activities as amusing and intriguing as their kids—as they find out together how science works.",
        "Category": " Science , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "On Beyond Bugs: All About Insects (Cat in the Hat's Learning Library)",
        "Authors": "By Seuss, Dr., Rabe, Tish, and Ruiz, Aristides (ILT)",
        "Description": "Find out all you ever wanted to know about insects when the Cat and company get an up-close view of life as a bug. Kids will learn how insects -- from the spittlebug to the honeybee to the moth -- see, smell, communicate, and pollinate, as well as sometimes pester and amaze and generally make life better for us humans. Catch the bug buzz with the Cat in the Hat and all his friends!",
        "Category": " Juvenile Nonfiction , Animals , Insects, Spiders, etc.",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Speak (Platinum Edition)",
        "Authors": "By Anderson, Laurie Halse",
        "Description": "Laurie Halse Anderson’s award-winning, highly acclaimed, and controversial novel about a teenager who chooses not to speak rather than to give voice to what really happened to her marks ten years in print with this special anniversary edition. Bonus material created for this edition includes a new introduction and afterword from the author, resources, and discussion guide. Will also include a preview of Anderson’s newest book, Wintergirls. The quintessential edition for all fans of this powerfully moving book.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Speak",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Tether's End",
        "Authors": "By Allingham, Margery",
        "Description": "",
        "Category": "",
        "Publisher": "Manor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Cambridge Quintet: A Work Of Scientific Speculation (Helix Books)",
        "Authors": "By Casti, John L.",
        "Description": "In this narrative tour de force, gifted scientist and author John L. Casti contemplates an imaginary evening of intellectual inquiry&#151;a sort of &#147;My Dinner with” not Andre, but five of the most brilliant thinkers of the twentieth century.Imagine, if you will, one stormy summer evening in 1949, as novelist and scientist C. P. Snow, Britain&#39;s distinguished wartime science advisor and author of The Two Cultures, invites four singular guests to a sumptuous seven-course dinner at his alma mater, Christ&#39;s College, Cambridge, to discuss one of the emerging scientific issues of the day: Can we build a machine that could duplicate human cognitive processes? The distinguished guest list for Snow&#39;s dinner consists of physicist Erwin Schrodinger, inventor of wave mechanics; Ludwig Wittgenstein, the famous twentieth-century philosopher of language, who posited two completely contradictory theories of human thought in his lifetime; population geneticist/science popularizer J.B.S. Haldane; and Alan Turing, the mathematician/codebreaker who formulated the computing scheme that foreshadowed the logical structure of all modern computers. Capturing not only their unique personalities but also their particular stands on this fascinating issue, Casti dramatically shows what each of these great men might have argued about artificial intelligence, had they actually gathered for dinner that midsummer evening.With Snow acting as referee, a lively intellectual debate unfolds. Philosopher Wittgenstein argues that in order to become conscious, a machine would have to have life experiences similar to those of human beings&#151;such as pain, joy, grief, or pleasure. Biologist Haldane offers the idea that mind is a separate entity from matter, so that regardless of how sophisticated the machine, only flesh can bond with that mysterious force called intelligence. Both physicist Schrodinger and, of course, computer pioneer Turing maintain that it is not the substance, but rather the organization of that substance, that makes a mind conscious.With great verve and skill, Casti recreates a unique and thrilling moment of time in the grand history of scientific ideas. Even readers who have already formed an opinion on artificial intelligence will be forced to reopen their minds on the subject upon reading this absorbing narrative. After almost four decades, the solutions to the epic scientific and philosophical problems posed over this meal in C. P. Snow&#39;s old rooms at Christ&#39;s College remains tantalizingly just out of reach, making this adventure into scientific speculation as valid today as it was in 1949.",
        "Category": " Science , Philosophy & Social Aspects",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Wine Roads of Europe",
        "Authors": "By Millon, Marc & Kim",
        "Description": "Suggests tours through the best wine regions of France, Germany, Italy, Spain, and Portugal, and recommends hotels, restaurants, and points of interest in each area",
        "Category": " Travel , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "Deaf Child Crossing",
        "Authors": "By Matlin, Marlee",
        "Description": "Megan is excited when Cindy moves into her neighborhood -- maybe she'll finally have a best friend. Sure enough, the two girls quickly become inseparable. Cindy even starts to learn sign language so they can communicate more easily.  But when they go away to summer camp together, problems arise. Cindy feels left out, because Megan is spending all of her time with Lizzie, another deaf girl; Megan resents that Cindy is always trying to help her, even when she doesn't need help. Before they can mend their differences, both girls have to learn what it means to be a friend.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Rights of Aliens",
        "Authors": "By Carliner, David",
        "Description": "Answers questions about the right of aliens to enter the United States and to study, work, own property, and receive government benefits in the country and outlines procedures for becoming a citizen",
        "Category": " Law , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1977"
        }
    },
    {
        "Title": "Northanger Abbey (The Penguin English library)",
        "Authors": "By Austen, Jane and Ehrenpreis, Anne Henry",
        "Description": "",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1972"
        }
    },
    {
        "Title": "The Holy Thief",
        "Authors": "By Peters, Ellis",
        "Description": "The 19th chronicle of Brother Cadfael. In the chill autumn of 1144, rising flood waters endanger the sacred remains of St. Winifred, the abbey's most cherished possession. When the bones disappear and a corpse is found, Brother Cadfael needs his prayers answered to catch a killer.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "8.06",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "IN HIS IMAGE The Cloning of a Man",
        "Authors": "By Rorvik",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1978"
        }
    },
    {
        "Title": "Heck: Where the Bad Kids Go",
        "Authors": "By Basye, Dale E. and Dob, Bob (ILT)",
        "Description": "When Milton and Marlo Fauster die in a marshmallow-bear explosion, they get sent straight to Heck, an otherworldly reform school. Milton can understand why his kleptomaniac sister is here, but Milton is—or was—a model citizen. Has a mistake been made? Not according to Bea “Elsa” Bubb, the Principal of Darkness. She doesn’t make mistakes. She personally sees to it that Heck—whether it be home ec class with Lizzie Borden, ethics with Richard Nixon, or gym with Blackbeard the pirate—is especially, well, heckish for the Fausters. Will Milton and Marlo find a way to escape? Or are they stuck here for all eternity, or until they turn eighteen, whichever comes first?★ “The author’ umpteen clever allusions . . . make this book truly sparkle.”—Publishers Weekly, Starred",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Blueprints for Continuous Improvement: Lessons from the Baldrige Winners (AMA Management Briefing)",
        "Authors": "By Hodgetts, Richard M.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Amacom Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Fear Nothing",
        "Authors": "By Koontz, Dean R.",
        "Description": "Christopher Snow is the best-known resident of 12,000-strong Moonlight Bay, California. This is because 28-year-old Chris has xeroderma pigmentosum (XP)—a light-sensitivity so severe that he cannot leave his house in daylight, cannot enter a normally-lit room, cannot sit at a computer. Chris's natural element is the night, and his parents, both academics, chose to live in Moonlight Bay because in a small town Chris can make the nightscape his own—roaming freely through the town on his bike, surfing in the moonlight, exploring while most people sleep.But Chris's brilliant mother, a scientist, was killed in a car accident 2 years ago, and as the book opens his father, Steven Snow, is dying of cancer; Chris's protected life is about to change forever. We meet Chris as he is carefully preparing himself to go out in the late-afternoon sun to visit the hospital. In his last moments of life his father tells Chris he is \"sorry\" and that Chris should \"fear nothing\"—cryptic words that Chris cannot really relate to.Steven Snow's body is removed to the hospital basement for transport to the funeral home/crematorium, and when Chris goes downstairs for a final moment of farewell, he witnesses a frightening and clandestine encounter: the funeral director and another man Chris doesn't recognize are substituting the body of a hitchhiker for Steven Snow's body–which is being taken not to the crematorium but to some secret destination.For Chris, this scene is the first intimation of a conspiracy that he will come to realize envelopes many of his townspeople. His parents knew of it and wanted to protect Chris from it. His best friend has had hints of something wrong because of the frightening nocturnal visitors that have come to his beachhouse. And the first person to try to explain to Chris what's going on—and warn him about the special danger he himself is in—will be hideously murdered.In the 24 hours this book encompasses, Christopher Snow will find out that, sheltered though he's been, he has the soul of a fighter and an adventurer. By the end of the book he will have killed a man, will have discovered the role his own mother played in the birth of the conspiracy, will have come to recognize the extraordinary guardians that, unknown to him, have watched over him for years. He will realize that some people hate him, others revere him, and neither his own life nor those of anyone he knows will ever be the same.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Splendor in the Glass: A Den of Antiquity Mystery",
        "Authors": "By Myers, Tamar",
        "Description": "Antiques dealer Abby Timberlake Washburn is thrilled when the Mrs. Amelia Shadbark—doyenne of Charleston society—invites her to broker a pricey collection of Lalique glass sculpture. These treasures will certainly boost business at the Den of Antiquity, and maybe hoist Abby into the upper crust—which would please her class-conscious mom, Mozella, no end. Alas, Abby's fragile dream is soon shattered when Mrs. Shadbark meets a foul, untimely end. And as the last known visitor to the victim's palatial abode, Abby's being pegged by the local law as suspect Numero Uno. Of course there are other possible killers—including several dysfunctional offspring and a handyman who may have been doing more for the late Mrs. S than fixing her leaky faucets. But Abby's the one who'll have to piece the shards of this deadly puzzle together—or else face a fate far worse than a mere seven years of bad luck!",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Dreams and Shadows: The Future of the Middle East",
        "Authors": "By Wright, Robin",
        "Description": "A magnificent reckoning with the extraordinary changes engulfing the Middle East, by one of our greatest reporters on the region  Robin Wright first landed in the Middle East on October 6, 1973, the day the fourth Middle East war erupted. She has covered every country and most major crises in the region since then, through to the rise of Al-Qaeda and the U.S. invasion of Iraq. For all the drama of the past, however, the region's most decisive traumas are unfolding today as the Middle East struggles to deal with trends that have already reshaped the rest of the world. And for all the darkness, there is also hope. Some of the emerging trends give cause for greater optimism about the future of the Middle East than at any time since the first Arab-Israeli War in 1948.  Dreams and Shadows is an extraordinary tour d'horizon of the new Middle East, with on-the-ground reportage of the ideas and movements driving change across the region-and the obstacles they confront. Through the powerful storytelling for which the author is famous, Dreams and Shadows ties together the players and events in Iraq, Iran, Egypt, Syria, Lebanon, Morocco, Turkey, the Gulf states, and the Palestinian territories into a coherent vision of what lies ahead.  A marvelous field report from the center of the storm, the book is animated by the characters whose stories give the region's transformation its human immediacy and urgency. It is also rich with the history that brought us to this point. It is a masterpiece of the reporter's art and a work of profound and enduring insight.",
        "Category": " History , Modern , General",
        "Publisher": "Penguin Press",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Twilight Whispers",
        "Authors": "By Delinsky, Barbara",
        "Description": "Privilege, Passions, and Secrets Katia Morrell grew up amid wealth, sharing the idyllic childhood enjoyed by America's aristocracy without ever really being one of them. As daughter of the housekeeper to the powerful Warren family, she never truly belonged. Now she is back at the Warren mansion, hoping to see the man she always loved, Jordan Whyte, heir to the Whyte fortune. The occasion is the mysterious deaths of Jordan's brother and his brother's wife. Now chic and rich in her own right, Katia returns feeling strong. But once she sees Jordan and how much he needs her, the old feelings come flooding back. Soon she is learning secrets about the family she thought she knew-and getting trapped in a chilling drama of murder and money, men and women, and truths so shocking they can only be revealed in...",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "SOLD",
        "Authors": "By McCormick, Patricia",
        "Description": "Lakshmi is a thirteen-year-old girl who lives with her family in a small hut on a mountain in Nepal. Though she is desperately poor, her life is full of simple pleasures, like playing hopscotch with her best friend from school, and having her mother brush her hair by the light of an oil lamp. But when the harsh Himalayan monsoons wash away all that remains of the family's crops, Lakshmi's stepfather says she must leave home and take a job to support her family. He introduces her to a glamorous stranger who tells her she will find her a job as a maid in the city. Glad to be able to help, Lakshmi journeys to India and arrives at \"Happiness House\" full of hope.  But she soon learns the unthinkable truth:  she has been sold into prostitution.An old woman named Mumtaz rules the brothel with cruelty and cunning.  She tells Lakshmi that she is trapped there until she can pay off her family's debt-then cheats Lakshmi of her meager earnings so that she can never leave.Lakshmi's life becomes a nightmare from which she cannot escape.  Still, she lives by her mother's words-Simply to endure is to triumph-and gradually, she forms friendships with the other girls that enable her to survive in this terrifying new world.  Then the day comes when she must make a decision-will she risk everything for a chance to reclaim her life? Written in spare and evocative vignettes, this powerful novel renders a world that is as unimaginable as it is real, and a girl who not only survives but triumphs.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Natural Remedies (Ask Dr. Weil)",
        "Authors": "By Weil, Andrew and Petrow, Steven (EDT)",
        "Description": "The author of the New York Times best-seller, Spontaneous Healing, presents simple and effective natural remedies for poison ivy, swimmer's ear, nosebleeds, bee stings, and other common ailments. Original.",
        "Category": " Health & Fitness , General",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Common Illnesses (Ask Dr. Weil)",
        "Authors": "By Weil, Andrew and Petrow, Steven",
        "Description": "A guide to natural alternatives reveals the body's inherent ability to heal itself and presents safe, easy-to-use treatments for such common conditions as Lyme disease, chronic fatigue syndrome, and depression. Original.",
        "Category": " Medical , General",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Just Plain Pickled to Death (Pennsylvania Dutch Mystery)",
        "Authors": "By Myers, Tamar",
        "Description": "The fourth novel in a humorous series featuring authentic Pennsylvania-Dutch recipes finds Magdalena Yoder, owner of the PennDutch Inn, sorting through a house of unwanted guests for the killer of her fiance+a7's well-preserved cousin. Original.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Dime Store Magic (Women of the Otherworld)",
        "Authors": "By Armstrong, Kelley",
        "Description": "From one of today’s most original writers comes the mesmerizing tale of an exceptional young woman caught up in an otherworldly realm where some will stop at nothing to get what they want.Paige Winterbourne was always either too young or too rebellious to succeed her mother as leader of one of the world’s most powerful elite organizations—the American Coven of Witches. Now that she is twenty-three and her mother is dead, the Elders can no longer deny her.  But even Paige’s wildest antics can’t hold a candle to those of her new charge—an orphan who is all too willing to use her budding powers for evil...and evil is all too willing to claim her. For this girl is being pursued by a dark faction of the supernatural underworld. They are a vicious group who will do anything to woo the young, malleable, and extremely powerful neophyte, including commit murder—and frame Paige for the crime. It’s an initiation into adulthood, womanhood, and the brutal side of magic that Paige will have to do everything within her power to make sure they both survive.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "While She Was Sleeping",
        "Authors": "By Forster, Suzanne",
        "Description": "Ex-lovers Jennifer Nash, a forensic sketch artist, and chief investigator Russ Sadler are forced to cast aside their feelings of animosity toward one another when a brutal kidnapping that ends in murder, where the only witness is an unstable homeless woman, brings them together once again. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Secret in the Old Book  (Elizabeth Bryan Mysteries #6)",
        "Authors": "By Erwin, Vicki Berger",
        "Description": "Elizabeth explores an old house filled with books and encounters a mysterious boy trying to sell a first edition of a novel.",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Concordia Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Sweet and Deadly",
        "Authors": "By Harris, Charlaine",
        "Description": "While investigating the suspicious death of her parents six months earlier, Catherine Linton discovers that someone in the town of Lowfield, Mississippi, wants the truth buried forever when she finds the dead body of her late father's longtime nurse. Original.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Mammals, 3rd Edition (Peterson Field Guide)",
        "Authors": "By Burt, William Henry",
        "Description": "Describes species with common and scientific names with detailed information",
        "Category": "",
        "Publisher": "Houghton Mifflin (P)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "Horse Shy (The Saddle Club #2)",
        "Authors": "By Bryant, Bonnie",
        "Description": "When one of Pine Hollow's students makes a terrible mistake, causing a tragic accident, Carole is done with riding forever. Unless Stevie and Lisa can remind her what friendship and the Saddle Club are all about.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "New Illustrated Guide to Modern Attack Aircraft",
        "Authors": "By Spick, Mike and Ripley, Tim",
        "Description": "",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "The New Illustrated Guide to the Modern Us Navy",
        "Authors": "By Jordan, John",
        "Description": "",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Phantom of the Opera (Puffin Classics)",
        "Authors": "By Leroux, Gaston",
        "Description": "The thrilling story of the 'Opera Ghost', legendary for making performers at the Paris Opera House apprehensive when they sit in their dressing-rooms or walk alone in the building's corridors. But it isn't until the triumphant performance the sensual Christine and her startling disappearance that a sense of dread begins to pervade. In an ever increasing pattern of fear and violence, the phantom of the opera begins to strike, but always with the beautiful young singer at the centre of his macabre desires. Filled with the colour and theatrical spectacle of the Paris Opera House and the fascination of love transformed into murderous obsession, this classic work of suspense remains a rivetting journey into the dark regions of the human heart.",
        "Category": " Young Adult Fiction , Classics",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Easy Slow Cooker Cookbook",
        "Authors": "By Jones, Barbara C.",
        "Description": "",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Cookbook Resources, LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Evermore: The Immortals (The Immortals, 1)",
        "Authors": "By Noel, Alyson",
        "Description": "Don't miss Evermore, the first book in Alyson Noël's #1 New York Times bestselling The Immortals series. Enter an enchanting new world where true love never dies. . . After a horrible accident claimed the lives of her family, sixteen-year-old Ever Bloom can see people's auras, hear their thoughts, and know someone's entire life story by touching them. Going out of her way to avoid human contact and suppress her abilities, she has been branded a freak at her new high school—but everything changes when she meets Damen Auguste.Damen is gorgeous, exotic and wealthy. He's the only one who can silence the noise and random energy in her head—wielding a magic so intense, it's as though he can peer straight into her soul.  As Ever is drawn deeper into his enticing world of secrets and mystery, she's left with more questions than answers. And she has no idea just who he really is—or what he is. The only thing she knows to be true is that she's falling deeply and helplessly in love with him.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The Unofficial Guide to Online Genealogy",
        "Authors": "By Hahn, Pamela Rice",
        "Description": "Genealogy is one of the hottest topics on the Internet, with thousands of sites, forums, and newsgroups clamoring to help--or confuse--family history sleuths. How do you cut through the noise and find the best tools to trace your roots? This opinionated guide can help. Zeroing in on the science of online genealogical research, author Pamela Rice Hahn shows you how to:  * Map out a research strategy  * Target the best Internet resources>  * Dig up info and swap leads with other researchers  * Evaluate genealogy software  * Steer clear of hype, dead ends, and time-wasters  * Organize a family reunion",
        "Category": " Computers , Internet , General",
        "Publisher": "John Wiley & Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Winds of Promise (The Wayward Wind Series)",
        "Authors": "By Thoene, Bodie and Thoene, Brock",
        "Description": "Tells the adventurous story of twenty-eight-year-old pilot Rafer Maddox as he undertakes an 18,000 mile journey around Cape Horn to California's gold country to foil a plot to repossess his new paddle wheeler \"New World\"",
        "Category": " Fiction , Westerns",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Meanest Hound Around",
        "Authors": "By Wallace, Bill, Gurney, John Steven (ILT), and Wallace, Carol",
        "Description": "DUMPED!  Freddie is a well-bred, well-mannered, fluffy white dog -- not the sort you'd expect to get dumped. But that's what happens. Now he's on his own -- alone on the streets -- until he meets up with Spike, a watchdog-in-training, who's just not mean enough to satisfy his cruel junkyard master.  Freddie helps his new friend escape, and together they set out, struggling through danger and adventure to find a new home.  But can either one really trust humans again? And if so, will Spike's past life threaten his newfound happiness -- and Freddie's as well?",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Moon Charleston and Savannah (Moon Handbooks)",
        "Authors": "By Sigalas, Mike and Bigner, Melissa",
        "Description": "The charming and elegant cities of Charleston and Savannah are some of the only cities in the United States that don't look like they were built yesterday, and the depth of history and southern charisma that cling to these cities make them some of the most alluring cities around. With  Moon Charleston and Savannah  you can learn about the history of the sister cities, find out where to shop in Savannah or club in Charleston, and get details on biking the Sea Island Coast or finding the best seafood. Mike Sigalas helps you have a truly personal experience in these beautiful hotspots.Suggested travel strategies and lists of must-see sights provide you with real insights so you can decide where you should go, stay, and eat?without hassles or regrets. Mike details where to hike, bike, shop, golf, stroll, and more. Complete with maps, photographs, illustrations, and special emphasis on leading destinations such as Fort Sumter, Charleston Historic District, Magnolia Plantation and Gardens, Hunting Island, St. Helena Island, Fort Pulanski, Cumberland Island, Saint Simons Village, and the Historic Districts of Charleston and Savannah.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Moon Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "How to Buy Antiques at Bargain Prices!",
        "Authors": "By Gollehon, John",
        "Description": "",
        "Category": "",
        "Publisher": "Gollehon Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Now & Then",
        "Authors": "By Sheehan, Jacqueline",
        "Description": "Living a dog's life...now and then.Anna O'Shea has failed at marriage, shed her job at a law firm, and she's trying to re-create herself when she and her recalcitrant nephew are summoned to the past in a manner that nearly destroys them. Her twenty-first-century skills pale as she struggles to find her nephew in nineteenth-century Ireland. For one of them, the past is brutally difficult, filled with hunger and struggle. For the other, the past is filled with privilege, status, and a reprieve from the crushing pain of present-day life. For both Anna and her nephew, the past offers them a chance at love.Will every choice they make reverberate down through time? And do Irish Wolfhounds carry the soul of the ancient celts?The past and present wrap around finely wrought characters who reveal the road home. Mystical, charming, and fantastic, New York Times bestselling author Jacqueline Sheehan's Now & Then is a poignant and beautiful tale of a remarkable journey. It is a miraculous evocation of a breathtaking place in a volatile age filled with rich, unforgettable, deeply human characters and one unforgettable dog named Madigan.",
        "Category": " Fiction , Romance , Time Travel",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Golden Booklet of the True Christian Life Devotional Classic",
        "Authors": "By Calvin",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1975"
        }
    },
    {
        "Title": "Evangelism and the Sovereignty of God",
        "Authors": "By Packer, James I.",
        "Description": "",
        "Category": " Social Science , Freemasonry",
        "Publisher": "Intervarsity Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1961"
        }
    },
    {
        "Title": "Four to Score (Stephanie Plum, No. 4) (Stephanie Plum Novels)",
        "Authors": "By Evanovich, Janet",
        "Description": "A Featured Alternate Selection of the Literary Guild and Doubleday Book Club and a Main Selection of the Mystery GuildJanet Evanovich, bestselling author of One for the Money, Two for the Dough, and Three to Get Deadly, scores big with Four to Score, her most thrilling Stephanie Plum adventure yet. Working for her bail bondsman cousin Vinnie, Stephanie is hot on the trail of revenge-seeking waitress Maxine Nowicki, whose crimes include bail jumping, theft, and extortion. Someone is terrifying Maxine's friends, and those who have seen her are turning up dead. Also on the hunt for Maxine is Joyce Barnhardt, Stephanie's archenemy and rival bounty hunter. Stephanie's attitude never wavers-- even when aided by crazy Grandma Mazur, ex-hooker and wannabe bounty hunter Lula, and transvestite rock musician Sally Sweet-- and even when Stephanie makes an enemy whose deadly tactics escalate from threatening messages to firebombs. All of this pales in comparison, though, with an even greater danger Stephanie faces, when, homeless and broke, she and her hamster Rex move in with a vice cop Joe Morelli. RATED PG35 for licentious wit and libidinous cohabitation.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Never Lose Heart",
        "Authors": "By Meyer, Joyce",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Harrison House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "A Kiss of Shadows (Meredith Gentry, Book 1)",
        "Authors": "By Hamilton, Laurell K.",
        "Description": "NEW YORK TIMES BESTSELLER • “Stunning . . . steamy . . . an exciting and original world.”—San Jose Mercury News   Meet Merry Gentry, paranormal P.I., and enter a thrilling, sensual world as dangerous as it is beautiful, full of earthly pleasures and dazzling magic, and ruled by the all-consuming passions of immortal beings once worshipped as gods . . . or demons.   Merry Gentry, princess of the high court of Faerie, is posing as a human in Los Angeles, working as a private investigator specializing in supernatural crime. But now the queen’s assassin has been dispatched to fetch her—whether she likes it or not. Suddenly Merry finds herself a pawn in her dreaded aunt’s plans. The job that awaits her: enjoy the constant company of the most beautiful immortal men in the world. The reward: the crown—and the opportunity to continue to live. The penalty for failure: death.   Praise for Laurell K. Hamilton and A Kiss of Shadows   “One of the most inventive and exciting writers in the paranormal field.”—Charlaine Harris   “Sexy . . . Merry’s adventures are engaging and keep the reader turning the pages.”—St. Louis Post-Dispatch   “I’ve never read a writer with a more fertile imagination.”—Diana Gabaldon",
        "Category": " Fiction , Fantasy , Paranormal",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "For Mom With Love (Quote-A-Page)",
        "Authors": "By Carnahan, Mary (EDT)",
        "Description": "How do you say thanks to the woman who raised and nurtured you? This beautiful Quote-a-Page Book is the best way to get started.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Natural Born Charmer (Chicago Stars, 7)",
        "Authors": "By Phillips, Susan Elizabeth",
        "Description": "Chicago Stars quarterback Dean Robillard is the luckiest man in the world: a bona-fide sports superstar and the pride of the NFL with a profitable side career as a buff billboard model for End Zone underwear. But life in the glory lane has started to pale, and Dean has set off on a cross-country trip to figure out what's gone wrong. When he hits a lonely stretch of Colorado highway, he spies something that will shake up his gilded life in ways he can't imagine. A young woman . . . dressed in a beaver suit. Blue Bailey is on a mission to murder her ex. Or at least inflict serious damage. As for the beaver suit she's wearing . . . Is it her fault that life keeps throwing her curveballs? Witness the expensive black sports car pulling up next to her on the highway and the Greek god stepping out of it.Blue's career as a portrait painter is the perfect job for someone who refuses to stay in one place for very long. She needs a ride, and America's most famous football player has an imposing set of wheels. Now, all she has to do is keep him entertained, off guard, and fully clothed before he figures out exactly how desperate she is. But Dean isn't the brainless jock she imagines, and Blue—despite her petite stature—is just about the toughest woman Dean has ever met. They're soon heading for his summer home where their already complicated lives and inconvenient attraction to each other will become entangled with a charismatic but aging rock star; a beautiful fifty-two-year-old woman trying to make peace with her rock and roll past; an eleven-year-old who desperately needs a family; and a bitter old woman who hates them all.As the summer progresses, the wandering portrait artist and the charming football star play a high-stakes game, fighting themselves and each other for a chance to have it all. Natural Born Charmer is for everyone who's ever thought about leaving their old life in the dust and never looking back. New York Times bestselling author Susan Elizabeth Phillips takes us home again . . . and shows us where love truly lives",
        "Category": " Fiction , Women",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Gambling Handbook: The Illustrated Step-By-Step Guide to Playing and Winning On-Line and in the Casino",
        "Authors": "By French, Peter",
        "Description": "Covers all casino games individually: from blackjack to roulette, slots to spread betting and including a section on the popular versions of poker. This work offers explanations of the rules and tactics, step-by-step illustrated examples of play, and clarifications of the odds. It examines casino etiquette, and explains house percentages.",
        "Category": " Games , Gambling , General",
        "Publisher": "Quercus Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Chesapeake Bay Book: A Complete Guide, Sixth Edition (Great Destinations)",
        "Authors": "By Blake, Allison",
        "Description": "A resident of both Maryland and Virginia for more than 20 years, Blake's intimate knowledge of the area and her explorations of much of the thousands of miles of shoreline and countryside give her the tools to offer again what Travel + Leisure has called the best book on the area.As in each Explorer's Great Destinations series guidebook, you'll find important contact information for lodging, dining, shopping, and recreational activities, transportation details, a calendar of events, special \"If Time Is Short\" options, local history, over 60 photos and maps, and essential information for residents. Find out why the Explorer's Great Destinations series is \"consistently rated the best guides to the regions covered. Readable, tasteful, appealingly designed,\" according to National Geographic Traveler. No visitor should be without this indispensable guidebook.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Countryman Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Medicine Show",
        "Authors": "By Nye, Jody Lynn",
        "Description": "Taylor's Ark, an unusual starship medical unit that makes house calls throughout the galaxy, run by Dr. Shona Taylor and her menagerie of assistants, comes to the aid of a planet on which humans and aliens alike are dying of a mysterious aging epidemic. Reissue.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Mall, Mayhem & Magic",
        "Authors": "By Lisle, Holly and Guin, Chris",
        "Description": "Learning of an imminent collision between the human and mythical worlds, bookseller Jim Franklin seeks assistance from a book of genuine spells, a group of larcenous elves, and a two-centuries-old virgin. Original.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "New Crimes 2",
        "Authors": "By Jakubowski, Maxim (ed.)",
        "Description": "",
        "Category": "",
        "Publisher": "Carroll & Graf",
        "Price Starting With ($)": "5.21",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "A Titanic Journey Across the Sea, 1912 (American Sisters)",
        "Authors": "By Lawlor, Laurie",
        "Description": "A Pocketful of Dreams  They were sisters yet strangers: realistic sixteen-year-old Alfreda Anderson and fanciful ten-year-old Erna, divided by hardship but united in the adventure of sailing to America. Alfreda dreamed of new beginnings, far from the drugery of life with her aunt and uncle on a small islad off the coast of Sweden, while Erna already missed her home and feared the journey to Chicago and the father they hadn't seen in years. Papa had sent tickets for Mother and their sick little brother, Karl, but only the girls would make the journey -- on the splendid new ship Titanic.",
        "Category": " Juvenile Nonfiction , History , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Broccoli by Brody: Recipes for America's Healthiest Vegetable",
        "Authors": "By Brody, Lora",
        "Description": "A guide to making delicious dishes with the much maligned broccoli features seventy-five quick and easy recipes for such treats as Broccoli Pesto, Broccoli Spanokopita, and Broccoli, Leek, and Potato Soup. 25,000 first printing. $15,000 ad/promo.",
        "Category": " Cooking , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Compassion: Showing Care in a Careless World (Lifemaps)",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Youth League Football: Coaching and Playing (Spalding Sports Library)",
        "Authors": "By O'Connor, Bob and Flores, Tom",
        "Description": "",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Masters Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Illustrated Directory of Submarines of the World (Illustrated Directory)",
        "Authors": "By Miller, David",
        "Description": "More than 250 submarines, from the Civil War to the missile-launching, nuclear-powered vessels of today, are described in detail and illustrated  with contemporary and archival photography and drawings. Arranged by types: diesel-electrics, non-nuclear, nuclear-attack, missile-armed, and special-role vessels-the book provides a comprehensive overview of every major submarine class around the globe. Each entry includes specifications and incisive development and battle histories.",
        "Category": " History , Military , Aviation",
        "Publisher": "Zenith Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Do You Promise Not to Tell?",
        "Authors": "By Clark, Mary Jane",
        "Description": "TV producer Farrell Slater just stumbled on a story that might save her career...or get her killed.  A prestigious New York auction house just sold a Fabergé Egg for six million dollars. But Farrell knows it is a fake.  So does a college student who promised never to tell the location of the real one.  And so does a cunning murderer who has already dismembered one victim...set fire to another...and strangled still another in order to carry off the greatest scam of the century.  And now he or she has a special fate in mind for a TV newswoman who just can't keep a secret. . .",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Learning to Eat Soup with a Knife: Counterinsurgency Lessons from Malaya and Vietnam",
        "Authors": "By Nagl, John A. and Schoomaker, Peter J. (FRW)",
        "Description": "Invariably, armies are accused of preparing to fight the previous war. In Learning to Eat Soup with a Knife, Lieutenant Colonel John A. Nagl—a veteran of both Operation Desert Storm and the current conflict in Iraq—considers the now-crucial question of how armies adapt to changing circumstances during the course of conflicts for which they are initially unprepared. Through the use of archival sources and interviews with participants in both engagements, Nagl compares the development of counterinsurgency doctrine and practice in the Malayan Emergency from 1948 to 1960 with what developed in the Vietnam War from 1950 to 1975. In examining these two events, Nagl—the subject of a recent New York Times Magazine cover story by Peter Maass—argues that organizational culture is key to the ability to learn from unanticipated conditions, a variable which explains why the British army successfully conducted counterinsurgency in Malaya but why the American army failed to do so in Vietnam, treating the war instead as a conventional conflict. Nagl concludes that the British army, because of its role as a colonial police force and the organizational characteristics created by its history and national culture, was better able to quickly learn and apply the lessons of counterinsurgency during the course of the Malayan Emergency. With a new preface reflecting on the author's combat experience in Iraq, Learning to Eat Soup with a Knife is a timely examination of the lessons of previous counterinsurgency campaigns that will be hailed by both military leaders and interested civilians.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "The University of Chicago Press",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Say It in Spanish (American) (Dover Language Guides Say It Series)",
        "Authors": "By Cohen, L. J.",
        "Description": "Contains over 1,000 useful sentences and phrases for travel or everyday living abroad: food, shopping, medical aid, courtesy, hotels, travel, and other situations. Gives the English phrase, the foreign equivalent, and a transliteration that can be read right off. Also includes many supplementary lists, signs, and aids. All words are indexed. 128 to 190pp",
        "Category": " Foreign Language Study , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1954"
        }
    },
    {
        "Title": "The People's Almanac Presents The Book of Lists",
        "Authors": "By Wallechinsky, David",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Small Town Christmas: An Anthology",
        "Authors": "By Macomber, Debbie",
        "Description": "PROMISE, TEXAS, is a good place to live with the person you love. When rancher Cal Patterson and his wife, Jane&#151;better known as Dr. Texas&#151;face a threat to their marriage, she leaves Promise, the town that's become her home as much as his. Will Jane be back by Christmas? Because, for both of them, the greatest gift of all would be her Return to Promise.GOLD RIVER, ALASKA, isn't your average town. After being jilted by her fiancé, Caroline Myers ends up there&#151;thanks to her matchmaking aunts, who send her on what appears to be an autumn vacation. Not surprisingly, they have something different in mind. Something that involves spending a snowy Christmas in handsome Paul Trevor's home&#151;as his Mail-Order Bride.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "The Quartered Sea",
        "Authors": "By Huff, Tanya",
        "Description": "When an expedition into the uncharted waters to find the homeland of the legendary Dark Sailor ends in disaster, Benedikt, a young bard, finds himself stranded in a mysterious unknown world, the pawn in a deadly game of politics and religion that destroy a kingdom's precarious balance of power. Original.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Daw Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Illustrated Directory of American Automobiles",
        "Authors": "By Montgomery, Andrew",
        "Description": "",
        "Category": "",
        "Publisher": "Salamander Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Heir to the Shadows",
        "Authors": "By Bishop, Anne",
        "Description": "In the second novel set in the “darkly fascinating world” (SF Site) of Anne Bishop’s Black Jewels Trilogy, ambitions unfurl as the realm’s dreams of a liberator have finally been made flesh...The Blood have waited centuries for the coming of Witch, the living embodiment of magic. But Jaenelle, the young girl singled out by prophecy, is haunted by the cruel battles fought over her—for not all the Blood await her as their Savior. Some dismiss her as a myth. Some refuse to believe. And still others look forward to using her, making her a pawn to their shadowy devices.Only time and the devotion of her loyal guardians have healed Jaenelle’s physical wounds. But her mind is fragile, barely able to protect her from the horrifying memories of her childhood. Nothing, however, can deflect her from her destiny—and the day of reckoning looms near. When her memories return. When her magic matures. When she is forced to accept her fate.On that day, the dark Realms will know what it means to be ruled by Witch.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Roc Fantasy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Midnight Awakening (The Midnight Breed, Book 3)",
        "Authors": "By Adrian, Lara",
        "Description": "With a dagger in her hand and vengeance on her mind, Darkhaven beauty Elise Chase prowls Boston’s streets in search of retribution against the Rogue vampires who took from her everything she cherished. Using an extraordinary psychic gift, she tracks her prey, well aware that the power she possesses is destroying her. She must learn to harness this gift, and for that she can turn to only one man—the deadliest of the Breed warriors, Tegan.No stranger to loss, Tegan knows Elise’s pain. He knows fury, but when he slays his enemies it is with ice in his veins. He is perfect in his self-control, until Elise seeks his aid in her personal war. An unholy alliance is forged—a bond that will link them by blood and vow—and plunge them into a tempest of danger, desire, and the darkest passions of the heart. . . .",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Hope's Folly",
        "Authors": "By Sinclair, Linnea",
        "Description": "Admiral Philip Guthrie is in an unprecedented position: on the wrong end of the law, leading a ragtag band of rebels against the oppressive Imperial forces. Or would be if he can get his command ship—the derelict cruiser called Hope’s Folly—functioning. Not much can rattle Philip’s legendary cool—but the woman who helps him foil an assassination attempt on Kirro Station will. She’s the daughter of his best friend and first commander—a man who died while under Philip’s command and whose death is on Philip’s conscience.Rya Bennton has been in love with Philip Guthrie since she was a girl. But can her childhood fantasies survive an encounter with the hardened man, and newly minted rebel leader, once she learns the truth about her father’s death? Or will her passion for revenge put not only their hearts but their lives at risk? It’s an impossible mission: A man who feels he can’t love. A woman who believes she’s unlovable. And an enemy who will stop at nothing to crush them both.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Conquering the Paper Pile-Up",
        "Authors": "By Culp, Stephanie",
        "Description": "Offers an alphabetized guide to sorting all kinds of paper--mail, bills, school papers, insurance forms, and credit applications, among others",
        "Category": " Language Arts & Disciplines , Study & Teaching",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Secret Desires of a Gentleman (The Girl-Bachelor Chronicles, 3)",
        "Authors": "By Guhrke, Laura Lee",
        "Description": "Once Upon a Time . . .Maria Martingale was going to elope. But Phillip Hawthorne, Marquess of Kayne, put a stop to those plans when he learned his younger brother intended to marry a cook's daughter. Now, twelve years later, Maria discovers that the man who holds her fate in his hands is none other than the haughty gentleman who sent her packing—and he's as handsome and arrogant as ever.Happily Ever After?Always the proper gentleman, Phillip will do anything to protect his family from scandal, and when Maria dares to move in right next door, he knows scandal will surely follow. She is as tempting as he remembered . . . and the more he sees her, the harder it is for Phillip to keep his own secret desire for her a secret . . .",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Hidden Agendas (Tempting SEALs)",
        "Authors": "By Leigh, Lora",
        "Description": "SAVING LIVES IS HIS MISSION.Tough-as-nails Navy SEAL Kell Kreiger is the best there is at searching, rescuing, and taking no prisoners…yet even the rush of ever-more dangerous missions isn't enough to satisfy him. Haunted by a tortured past, Kell seeks distraction in a secret world of dark intimacies. But when Emily Stanton, the one ray of light in Kell's shadowy existence, is pursued by a ruthless drug lord, the rules of the game suddenly change—and Kell will have to go deeper undercover than he ever imagined...SAVING HER IS HIS PASSION.Emily has loved Kell ever since her father, a prominent politician, rescued him from a brutal life on the streets. They were kids then, too young to act on what was growing between them…but now that Emily is ready, the handsome, headstrong SEAL has decided he's no good for her. Ever since he rescued her from Diego Fuentes' compound, Kell's only duty has been to keep Emily safe. But Fuentes isn't finished with Emily—or Kell. And to protect Emily, Kell has no choice but to lay himself—body, soul, and secrets—bare…and fight against evil with all his heart.",
        "Category": " Fiction , Erotica , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Midnight Rising (The Midnight Breed, Book 4)",
        "Authors": "By Adrian, Lara",
        "Description": "In a world of shadows and dark, cosuming hungers, desire is the deadliest weapon...For journalist Dylan Alexander, it began with the discovery of a hidden tomb, thrusting her into the center of a gathering storm of violence and secrets. But nothing is as dangerous as the scarred, lethally seductive man who rises from the shadows to draw her into his world of dark desire and endless night. Fueled by pain and rage over a shattering betrayal, the warrior Rio has pledged his life to the war against the Rogues. He will let nothing stand in his way—least of all a mortal woman with the power to expose the entire vampire race. For an ancient evil has been awakened, and a stunning darkness is on the rise. Suddenly Dylan is powerless to resist Rio’s touch, even as she uncovers a shocking link to her own past. And now she must choose: Leave Rio’s midnight realm, or risk it all for the man who has shown her true passion and the infinite pleasures of the heart. . . .",
        "Category": " Fiction , Romance , Paranormal",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Shrubs: Easy Plants for More Beautiful Gardens (Taylor's 50 Best Series)",
        "Authors": "By Tenenbaum, Frances (EDT)",
        "Description": "Both the Taylor's Guides to individual plant groups and the Taylor's Weekend Guides on basic techniques and popular gardening styles are highly acclaimed and well established. We now enthusiastically add a quick-reference series for readers who don't have the time or the experience to do their own research. Taylor's 50 Best books highlight the most attractive foolproof plants and include detailed information that every gardener needs in order to grow them. Color photos, full-color drawings, and growing tips make each plant entry useful and complete. Six books introduce the series and cover the most popular plants for backyard gardeners: perennials for sun, perennials for shade, herbs and edible flowers, roses, shrubs, and trees.",
        "Category": " Gardening , Shrubs",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Pennsylvania's Breweries (Breweries Series)",
        "Authors": "By Bryson, Lew",
        "Description": "",
        "Category": " Business & Economics , Management",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Chess Basics",
        "Authors": "By Short, Nigel",
        "Description": "Whether you’re a total beginner or just think you’d like to play, International Grandmaster Nigel Short can show you how to play and win the ?game of kings.” With over 140 two-color diagrams and photographs, learn the setup of the board, the moves and origins of the pieces, how to play, how to study famous games by following notation, and how to finish off an opponent?with tips on gamesmanship.",
        "Category": " Games , Chess",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Undoing of a Lady (De lady's van Fortune's Folly, 4)",
        "Authors": "By Cornick, Nicola",
        "Description": "Courting scandal since girlhood, free-spirited Lady Elizabeth Scarlet vows there is just one way to save her childhood friend from a loveless marriage: to kidnap him! But Nathaniel is furious. So angry that he challenges her to take their assignation to its natural conclusion and seduce him.When her inexperienced attempt flares into intense passion, Lizzie is ruined…and hopelessly, unexpectedly, in love with Nathaniel, the Earl of Waterhouse. Now the wild and willful Lizzie must convince Nat that they are a perfect match—in every way.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "ABC Practical Guide to Dog Training",
        "Authors": "By Appelbaum, Steven",
        "Description": "With the proliferation of titles in the market today, why another book on pet dog training?Because most of them sound wonderful, but don't work! And the dogs being trained often develop problems as a result.  Frustrated pet owners are looking for practical, humane answers -- that provide results.The experienced approach contained in The ABC Practical Training Guide has proven itself with over 40,000 dog owners across the United States and Canada who have found their answers \"\"as simple as ABC.\"\"",
        "Category": " Pets , Dogs , General",
        "Publisher": "*Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Home Theater For Dummies (For Dummies (Computer/Tech))",
        "Authors": "By Briere, Daniel D. and Hurley, Pat",
        "Description": "Select the best equipment for your home theaterThe fun and easy way™ to create the movie theater experience in your own homeAre you ready for HDTV? Checking out surround sound and DVRs? This value-priced guide clearly explains the latest advances in home entertainment electronics and makes sense out of all the available choices. It then helps you choose the right equipment and shows you how to put it all together to build the home theater system of your dreams!The Dummies WayExplanations in plain English\"Get in, get out\" informationIcons and other navigational aidsTear-out cheat sheetTop ten listsA dash of humor and fun",
        "Category": " Technology & Engineering , Television & Video",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Living Well in a Down Economy For Dummies",
        "Authors": "By Barr, Tracy L.",
        "Description": "Get smart about spending and saving -- and ride out a recession!Looking for practical ways to make every dollar count? This savvy guide gives you expert tips for tightening your belt and saving cash in every area of your life -- from your house and car to dining and entertaining to banking and managing debt. You get realistic solutions for making smarter choices and living well in this time of economic turmoil -- without extraordinary sacrifice!Bump up your take-home pay-- spiff up your resume, find a good job fast, explore telecommuting, or start a home-based businessGet your personal finances in tip-top shape -- create a budget, pay down debt, save on insurance, and protect your retirement fundsDevelop recession-proof habits -- use coupons and rebates, extend the life of your wardrobe, utilize community resources, travel on a budget, and save on utilities and fuel expensesDecorate on a dime and entertain on a shoestring -- plan parties, celebrate the holidays, and give gifts without losing your shirtBounce back from bad financial situations -- improve bad credit scores, and negotiate with creditors or the IRSOpen the book and find:125 tips for making changes in your life that allow you to continue to live wellWays to stand out on paper and in an interview when looking for a jobTips on managing debt -- from working with credit counselors and consolidating your debts to boosting your incomeSmart solutions for weathering financial emergencies, from bankruptcy to foreclosure",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "100 Helpful Household Hints - Salt",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "The Gift Of ADHD: How To Transform Your Child's Problems Into Strengths",
        "Authors": "By Honos-webb, Lara",
        "Description": "As a parent, you already know that your child has many gifts. What you may not know is that attention-deficit hyperactivity disorder (ADHD) related symptoms—the very qualities that lead him or her to act out and distract others—may be among them.    This second edition of The Gift of ADHD includes compelling new research indicating that the impulses that lead your child to act exuberantly may correspond with unusual levels of creativity and a heightened capacity for insight into the feelings and emotions of others. Could it be that ADHD is not a hindrance, but an asset in our fast-paced digital age?   ADHD expert Lara Honos-Webb presents the evidence for this revolutionary concept and explains how you can help your child develop control over inattentive, hyperactive behavior and enhance the five gifts of ADHD: creativity, attunement to nature, interpersonal intuition, energetic enthusiasm, and emotional sensitivity. Filled with easy skill-building activities you and your child can do together, this book will help your child transform problematic symptoms into strengths, then build the self-esteem they need to let those gifts shine.",
        "Category": " Family & Relationships , Children with Special Needs",
        "Publisher": "New Harbinger Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Hard-To-Solve Brainteasers (Mensa®)",
        "Authors": "By American Mensa Limited (COR), Poniachik, Jaime, Poniachik, Lea, and Gordon, Peter",
        "Description": "Don't try too hard. That's the secret. The solutions to these tantalizing teasers take common sense, not great knowledge of deep subjects. So relax, have fun, and wait for the answers to bob to the surface. Along the way you'll meet a strange collection of humanity: the harem of the Great Tamerlane; Englishmen stranded on a desert island; the twins Peter and Paul, one of whom always tells the truth and one who always lies (you figure out who's lying when one of them answers one question with one word). Solve a murder on a train as four fellow passengers speak only one sentence each. Try this short teaser: The month begins on a Friday and ends on a Friday, too. What month is it? Win bets by shifting coins from one design to another with the fewest moves. Guess your beautiful math teacher's zodiac sign. Take on the fiendishly frustrating Hidden Words and Secret Numbers, and play dominos with no dots. Hints and clues are available along the way, and so are the answers if you try too hard and simply have to have them.  96 pages, 60 b/w illus., 5 3/8 x 8 1/4.",
        "Category": " Games , Logic & Brain Teasers",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Tremor: A John Taft Novel",
        "Authors": "By Dirgo, Craig",
        "Description": "More than 100 years ago, inventor Nikola Tesla created a device for transferring electricity without wires. It was supposed to be his greatest triumph?but his invention spawned a nightmare. And the nightmare has returned? When unusual surges of electricity are tracked emanating from the former Yugoslavia, Special Agent John Taft uncovers a conspiracy of terror led by a fanatical Serbian nationalist?and powered by a machine capable of causing apocalyptic earthquakes to strike on command. As the terrorists fell cities at will with their earth-shattering weapon, Taft must fight a battle on dangerous ground, against an unstable foe whose greatest desire is to control the world?or destroy it.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Onyx",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Keeping Faith: A Novel",
        "Authors": "By Picoult, Jodi",
        "Description": "For the second time in her marriage, Mariah White catches her husband with another woman, and Faith, their seven-year-old daughter, witnesses every painful minute. In the aftermath of a sudden divorce, Mariah struggles with depression and Faith begins to confide in an imaginary friend. At first, Mariah dismisses these exchanges as a child's imagination. But when Faith starts reciting passages from the Bible, develops stigmata, and begins to perform miraculous healings, Mariah wonders if her daughter--a girl with no religious background-might actually be seeing God. As word spreads and controversy flares, Mariah and Faith are besieged by believers and disbelievers alike, caught in a media circus that threatens what little stability they have left. Building inexorably to a climactic battle for custody, Keeping Faith explores a family plagued by the media, the medical profession, and organized religion in a world where everyone has an opinion but no one knows the truth. Fascinating, thoughtful, and suspenseful, this extraordinary novel is Jodi Picoult at her best: controversial and compelling.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Content Area Reading: Literacy and Learning Across the Curriculum (7th Edition)",
        "Authors": "By Vacca, Jo Anne L. and Vacca, Richard T.",
        "Description": "A textbook for student teachers first published over 20 years ago. It emphasizes the transaction that takes place between readers and texts rather than the transmission of knowledge from text to readers, and thus highlights the contributions students themselves make to their own learning. The new edition includes a separate chapter on the struggling reader. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Language Arts & Disciplines , Literacy",
        "Publisher": "Pearson",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The colonial silversmith: His techniques & his products",
        "Authors": "By Kauffman, Henry J.",
        "Description": "",
        "Category": "",
        "Publisher": "Galahad Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Private Scandals",
        "Authors": "By Roberts, Nora",
        "Description": "Deanna Reynolds had it all planned: She'd start out in the newsroom of a small Chicago station, then move up to one day host her own talk show. When her mentor Angela Perkins leaves for the big time in New York, Deanna risks everything for the chance to replace Angela on the air. Finn Riley, the network's sexiest journalist, falls for the risk-taker in the small town girl. But soon they are caught up in the bitter backlash of Angela's revenge?Together Finn and Deanna must unmask the hidden betrayals of Deanna's fiercest rival by taking the biggest risk of all?",
        "Category": " Fiction , Romance , General",
        "Publisher": "Jove",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Kingless Land (Band of Four)",
        "Authors": "By Greenwood, Ed",
        "Description": "Aglirta is known as the Kingless Land--once prosperous and peaceful, it has now fallen into lawlessness, studded with feuding baronies engaged in a constant state of war. The only hope for peace lies in the legend of the Sleeping King: destined to rise and restore peace when the Dwaerindim stones are recovered.Lady Embra Silvertree is the sorceress daughter of a bellicose baron with an eye towards world domination. She has been imprisoned by her father who hopes to use her as a magical battery to fortify his castle. When a pair of good natured rogues attempt to steal one of her jewel encrusted gowns, they are quickly enlisted as allies to help her escape and, with the aid of a shape-shifting cleric, to seek out the Dwaerindim.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Sleeping Doll: A Novel (Kathryn Dance, No 1)",
        "Authors": "By Deaver, Jeffery",
        "Description": "Lincoln Rhyme is back! The brilliant criminologist returns with his partner and paramour Amelia Sachs, in a blistering bestseller that tests forensic detective work in a brave new world.When Special Agent Kathryn Dance—a brilliant interrogator and kinesics expert with the California Bureau of Investigation—is sent to question the convicted killer Daniel “Son of Manson” Pell as a suspect in a newly unearthed crime, she feels both trepidation and electrifying intrigue. Pell is serving a life sentence for the brutal murders of the wealthy Croyton family in Carmel years earlier—a crime mirroring those perpetrated by Charles Manson in the 1960s. But Pell and his cult members were sloppy: Not only were they apprehended, they even left behind a survivor—the youngest of the Croyton daughters, who, because she was in bed hidden by her toys that terrible night, was dubbed the Sleeping Doll. But the girl never spoke about that night, nor did the crime's mastermind. Indeed, Pell has long been both reticent and unrepentant about the crime. And so with the murderer transported from the Capitola superprison to an interrogation room in the Monterey County Courthouse, Dance sees an opportunity to pry a confession from him for the recent murder—and to learn more about the depraved mind of this career criminal who considers himself a master of control, a dark Svengali, forcing people to do what they otherwise would never conceive of doing. In an electrifying psychological jousting match, Dance calls up all her skills as an interrogator and kinesics—body language—expert to get to the truth behind Daniel Pell. But when Dance's plan goes terribly wrong and Pell escapes, leaving behind a trail of dead and injured, she finds herself in charge of her first-ever manhunt. But far from simply fleeing, Pell turns on his pursuers—and other innocents—for reasons Dance and her colleagues can't discern. As the idyllic Monterey Peninsula is paralyzed by the elusive killer, Dance turns to the past to find the truth about what Daniel Pell is really up to. She tracks down the now teenage Sleeping Doll to learn what really happened that night, and she arranges a reunion of three women who were in his cult at the time of the killings. The lies of the past and the evasions of the present boil up under the relentless probing of Kathryn Dance, but will the truth about Daniel Pell emerge in time to stop him from killing again?",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Mop's Mountain Adventure",
        "Authors": "By Schaap, Martine and Wolf, Alex De",
        "Description": "Twins Julie and Justin find another use for Dad's wheelbarrow after they finish unloading his grass clippings. The wheelbarrow becomes a freight train that takes them and their neighbor friends to the mountains for a camping adventure. Mop joins in the fun.Three activity pages follow, including a how-to- mountain craft, a recipe for trail mix, a mountain fishing game, and instructions for a Native-American game.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Gingham Dog Press",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Clarinet Polka: A Novel",
        "Authors": "By Maillard, Keith",
        "Description": "Author Keith Maillard received critical acclaim with his novel Gloria, which told the story of a young woman on the cusp of womanhood in a town called Raysburg, West Virginia. In his newest book, The Clarinet Polka, Maillard turns that same eagle-eyed attention to the other side of the tracks of that very same town and creates a stunning portrait of Polish America and of one man’s struggle to find meaning in his life and roots.The year is 1969, and young Jimmy Koprowski returns from his stint in the airforce to Raysburg, his blue-collar Polish American hometown where nothing much happens beyond working at the steel mill, going to Mass, and getting drunk at the local PAC. Jimmy’s efforts at rebuilding his life result in sleeping off hangovers in his parents’ attic and drifting into a destructive affair with a married woman.But things change when his younger sister Linda decides to start an all-girl polka band, and Jimmy falls for the band’s star clarinetist, Janice, whose young life is haunted by tragic events that happened before she was born. The threads of Jimmy’s family life, the legacy of WWII Poland, and the healing power of music, language, and tradition all begin to converge.At once gritty and compassionate, moving and witty, The Clarinet Polka showcases the emotional and perfectly pitched voice of a lost soul finding his way.",
        "Category": " Fiction , Literary",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Life You've Always Wanted: Spiritual Disciplines for Ordinary People",
        "Authors": "By Ortberg, John",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The Calhouns: Suzanna and Megan (The Calhoun Women)",
        "Authors": "By Roberts, Nora",
        "Description": "Two classic tales, centering around the Calhoun family, from the  best-selling author are contained within one volume that features Suzanna's Surrender, in which an ex-cop falls for a beautiful single mother as she searches for her family's missing jewels, and Megan's Mate, in which practical Megan O'Riley finds herself falling for dashing ship captain Nate Fury. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "If I'm So Smart, Why do I Eat Like This?",
        "Authors": "By Miller, Peter M. and Rankin, Howard",
        "Description": "",
        "Category": " Self-help , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Opening Atlantis",
        "Authors": "By Turtledove, Harry",
        "Description": "Atlantis lies between Europe and the East Coast of Terranova. For many years, this land of opportunity lured dreamers from around the globe with its natural resources, offering a new beginning for those willing to brave the wonders of the unexplored territory. It is a new world indeed: ripe for discovery, for plunder, and eventually for colonization?but will its settlers destroy the very wonders they had journeyed to Atlantis to find?",
        "Category": " Fiction , Alternative History",
        "Publisher": "A Roc Book",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Sun Kissed (Coulter Family)",
        "Authors": "By Anderson, Catherine",
        "Description": "New York Times bestselling author Catherine Anderson, known for “blending sweetness and sensuality in a poignantly written story”(Booklist), delivers a contemporary-set romance that joins the Coulter and Harrigan families…   When Samantha Harrigan attends the local rodeo, she doesn't expect to wind up in jail. But that’s precisely what happens when she tries to stop a drunkard from abusing his horse. At least she isn’t alone. Tucker Coulter, a handsome local veterinarian, comes to her defense—and is arrested too. The charges are dropped, but Sam’s troubles have only started. Her champion quarter horses are falling ill and the culprit is poison. As the insurance beneficiary, Sam is the prime suspect. Unswayed by the rumors floating around town, Tucker offers to help prove her innocence. Sam, though, is uneasy about accepting his assistance—and about the way he makes her feel. If only she could believe in him the way he seems to believe in her...",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    }
]