[
    {
        "Title": "Landscaping (Home repair and improvement)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": "",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Dried Flowers: How to Prepare Them",
        "Authors": "By Whitlock, Sarah and Rankin, Martha",
        "Description": "To make a beautiful arrangement of dried flowers, all you need to have are fresh flowers in various colors, forms and shapes; a selection of berries, seed pods, grasses, and foliage; and a knowledge of how to dry each plant item properly and efficiently. In a very short time, this book will teach you how to dry flowers by the hanging method and the surrounding and covering method, as well as giving you tips on storage, arranging flowers, and more.Within the past few years a great deal has been learned about dehydrating flowers so that effects are possible that our ancestors never dreamed of. The most sensational development has been the introduction of silica gel, the best of all materials now in use for drying flowers, and the authors give complete instructions on how to mix and use it. They also give instructions for using other mediums — meal and borax, perlite aggregate (crushed volcanic rock), and sand and borax — as well as using glycerin and water for drying foliage in three dimensions. This is probably the largest number of techniques ever given in a small volume.Also included are two valuable reference lists: a list of flowers arranged according to color, and a list of 48 flowers and 35 other plant items giving recommended method of drying and other useful information. Beginners will love this book and the way flowers look after being dried with modern techniques, while even experienced workers will find much helpful advice on specific flowers and methods.",
        "Category": " Crafts & Hobbies , Flower Arranging",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "Totally Chile Pepper Cookbook (Totally Cookbooks) (Totally Cookbooks Series)",
        "Authors": "By Siegel, Helene and Gillingham, Karen",
        "Description": "Spice up your palate with some chile peppers! Try the zesty flavors of Chile Arbol Salsa, Jalapeño Flank Steak, or Poblano Corn Quesadillas. Whether you want to add just a touch of heat to your meals or you’re a chilehead who craves a really fiery dish, this little pocket-size cookbook packs a punch.",
        "Category": " Cooking , Reference",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Time Management",
        "Authors": "By Cook, Marshall J.",
        "Description": "",
        "Category": " Business & Economics , Management",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "A Girl Like Moi: The Fashion-Forward Adventures of Imogene",
        "Authors": "By Barham, Lisa and Rim, Sujean (ILT)",
        "Description": "A girl. A dream job. A city full of possibilities...   Imogene is obsessed with fashion. Combine that with her talent for trouble (aka maxing out her \"emergencies only\" AmEx) and suddenly she's not going to chere Paris with her best friend for the summer. No, she must do the unthinkable for a stylish Greenwich girl such as herself -- get a job.   Resourceful as always, Imogene works her connections and lands a dream internship at a fashion forecasting agency in New York. Now she's lunching at Serendipity, first on line at the Barney's warehouse sale, and skoshing seats at fashion week.   But when Imogene's dream is threatened by a cute Italian boy and one very evil intern, she questions what she really wants. And she learns that even in fashion, being true to yourself and following your dreams can go hand in hand.",
        "Category": " Young Adult Fiction , Fashion & Beauty",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Perfect Shot (Young Adult Fiction)",
        "Authors": "By Alphin, Elaine Marie",
        "Description": "Someone murdered Brian's girfriend, Amanda. The police think it was her father. Brian isn’t so sure. But everyone he knows is telling him to move on, get over it, focus on the present. Focus on basketball. Focus on hitting the perfect shot. Brian hopes that the system will work for Amanda and her father. An innocent man couldn’t be wrongly convicted, could he?  But then Brian does a school project on Leo Frank, a Jewish man lynched decades ago for the murder of a teenage girl—a murder he didn’t commit. Worse still, Brian’s teammate Julius gets arrested for nothing more than being a black kid in the wrong place at the wrong time. Brian can’t deny any longer that the system is flawed.   As Amanda’s father goes on trial, Brian admits to himself that he knows something that could break the case. But if he comes forward, will the real killer try for another perfect shot—this time against Brian?",
        "Category": " Young Adult Fiction , Law & Crime",
        "Publisher": "Carolrhoda Lab ®",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Bombingham: A Novel",
        "Authors": "By Grooms, Anthony",
        "Description": "From the war-torn rice fields of Vietnam to the riot-filled streets of Birmingham, Alabama, Bombingham is the affecting story of a middle-class black family riven by its personal chaos. When Walter Burke is faced with writing a letter to the parents of a fallen friend and fellow soldier, he is taken back to his childhood amidst the Civil Rights Movement. From it, he recalls the segregated city, the fledgling movement, and the momentous responsibility to act.  Walter reflects on how he and his family were challenged by the swelling resistance to the horrific realities of segregation in a city where little girls could be bombed in church and their fathers jailed for just looking at a white person in the wrong way. The parents' sense of security is increasingly threatened, while the children are forced to make moral decisions that portend grave consequences.  As Walter struggles to make sense of his presence in Vietnam, he wonders if the victory of the movement meant nothing more than being sent into a battlefield of another kind. Joining two pivotal periods in the American experience, this beautifully written novel from the winner of the 1996 Lillian Smith Award for Fiction makes an important contribution to our understanding of the period. With wry humor and haunting description, it is a portrait of the wonder and the terror of childhood in a time when ordinary citizens risked their lives to change America. By turns both reflective and dramatic, Grooms chronicles the events of the Civil Rights Movement and the Vietnam War through the heightened perspective of a narrator who struggles to find the meaning of his role in both events. Bombingham is a moving testament to the power of responsibility and faith in the face of tragedy.",
        "Category": " Fiction , Literary",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The New Truth About Vitamins & Minerals",
        "Authors": "By Sardi, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Here and Now Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Mouse Who Wanted To Marry",
        "Authors": "By Doris Orgel",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell Publishi",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Rootabaga Stories, Part Two (Odyssey Classic)",
        "Authors": "By Sandburg, Carl, Petersham, Maud Fuller (ILT), and Petersham, Miska (ILT)",
        "Description": "This second volume of unique fairy tales includes stories originally published in 1923. Each reflects the warmth of a midwestern childhood, a zest for life, and a love of the American language that has never been equaled.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Sandpiper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "The People's Almanac Presents the Book of Lists/the '90s Edition",
        "Authors": "By Wallechinsky, David and WALLACE, AMY",
        "Description": "New edition of the quirky reference first published in 1977. It is irresistible (even to those who are list-aversive). Some examples: 11 men who have cried in public, seven famous people expelled from school, 9 recent cases of tv censorship, 11 prominent people who died while exercising, 11 foods and their filth levels, six ways cats talk with their tails, 19 innocent Americans who were almost executed, nine people misquoted by Ronald Reagan, 12 museums of limited appeal. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Reference , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Healthy Sleep Habits, Happy Child: A Step-by-Step Program for a Good Night's Sleep, 3rd Edition",
        "Authors": "By Weissbluth, Marc",
        "Description": "One of the country's leading researchers updates his revolutionary approach to solving--and preventing--your children's sleep problemsHere Dr. Marc Weissbluth, a distinguished pediatrician and father of four, offers his groundbreaking program to ensure the best sleep for your child. In Healthy Sleep Habits, Happy Child, he explains with authority and reassurance his step-by-step regime for instituting beneficial habits within the framework of your child's natural sleep cycles. This valuable sourcebook contains brand new research that- Pinpoints the way daytime sleep differs from night sleep and why both are important to your child- Helps you cope with and stop the crybaby syndrome, nightmares, bedwetting, and more- Analyzes ways to get your baby to fall asleep according to his internal clock--naturally- Reveals the common mistakes parents make to get their children to sleep--including the inclination to rock and feed- Explores the different sleep cycle needs for different temperaments--from quiet babies to hyperactive toddlers- Emphasizes the significance of a nap schedule-Rest is vital to your child's health growth and development. Healthy Sleep Habits, Happy Child outlines proven strategies that ensure good, healthy sleep for every age. Advises parents dealing with teenagers and their unique sleep problems",
        "Category": " Family & Relationships , Life Stages , Infants & Toddlers",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Quest for Global Dominance: Transforming Global Presence into Global Competitive Advantage",
        "Authors": "By Govindarajan, Vijay and Gupta, Anil K.",
        "Description": "The current transformation of isolated state-dominated economies into market-driven globally integrated economies is creating business challenges and opportunities around the globe. Over the last ten years, these authors have studied over one hundred global corporations through a variety of research methods and here distill their findings into four essential goals that executives must achieve in order to transform a company into a global success: Identify and pursue opportunities in key markets. Convert global presence into global competitive advantage. Cultivate a global mindset in order to recognize and exploit good ideas wherever they arise. And constantly reinvent the global game by creating value for customers. Case studies involving Yahoo!, Wal-Mart, and other global players show how the authors' findings can be applied in real-world situations.",
        "Category": " Business & Economics , Decision-Making & Problem Solving",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Minitab handbook",
        "Authors": "By Ryan, Barbara F.",
        "Description": "",
        "Category": "",
        "Publisher": "Duxbury Resource Center",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "On the River Styx and Other Stories",
        "Authors": "By Matthiessen, Peter",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Little Critter at Play (Golden Board Book)",
        "Authors": "By Mayer, Mercer",
        "Description": "Little Critter shows how he plays with his train, truck, spaceship, crayons, teddy bear, boat, and hammer",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Animal Underworld",
        "Authors": "By Green, Alan",
        "Description": "A vast and previously undisclosed underground economy exists in the United States. The products bought and sold: animals. In Animal Underworld, veteran investigative journalist Alan Green exposes the sleazy, sometimes illegal web of those who trade in rare and exotic creatures. Green and The Center for Public Integrity reveal which American zoos and amusement parks dump their \"surplus\" animals on the middlemen adept at secretly redirecting them into the private pet trade. We're taken to exotic-animal auctions, where the anonymous high bidders are often notorious dealers, hunting-ranch proprietors, and profit-minded charlatans masquerading as conservationists. We visit some of the nation's most prestigious universities and research laboratories, whose   diseased monkeys are \"laundered\" through this same network of breeders and dealers until they finally reach the homes of unsuspecting pet owners. And we meet the men and women who make their living by skirting through loopholes in the law, or by ignoring the law altogether. For anyone who cares about animals; for pet owners, zoo-goers, wildlife conservationists, and animal   welfare advocates, Animal Underworld is gripping, shocking reading.",
        "Category": " Nature , Animal Rights",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Vegetable Gardening (The American Garden Guides)",
        "Authors": "By Chambers, David and Mays, Lucinda",
        "Description": "Offers advice on planning a vegetable garden and recommends specific varieties",
        "Category": " Gardening , Vegetables",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Calphalon cooks weekends",
        "Authors": "By Sunset Books and Calphalon Corporation",
        "Description": "",
        "Category": "",
        "Publisher": "Sunset Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Lawyer's Career Change Handbook: More Than 300 Things You Can Do With a Law Degree, Updated and Revised",
        "Authors": "By Greenberg, Hindi",
        "Description": "There Are More Than One Million Lawyers in AmericaA law degree is not necessarily a ticket to succes, wealth and happiness.  Perhaps it's dissatisfaction with the hours, the firm, or the work itself, but every year, more and more lawyers want out.  Now there's a real-world primer that can help virtually anyone in this position.  Wheather you're merely considering a change or firmly committed to one, The Lawyer's Career Change Handbook provides all the tools and information you need. A surprising number of lawyers in this country have discovered that a law degree is not necessarily a ticket to wealth, success and happiness, and now they want out. Hindi Greenberg -- founder and president of Lawyers in Transition -- has written an indispensable quidebook for those in that position.  Chock full of helpful advice, exercises, listings of resources and real-life stories, The Lawyer's Career Change Handbook provides all the tools needed to help the unsatisfied many who are either considering a new career or actively pursuing one. This one-of-a-kind volume can help legal professionals identify, target, and get new jobs that best suit their abilities, background, personality and interests, while offering them ways to cope with the inevitable stress of changing fields. And those who wish to remain in the law world will discover invaluable methods for creating more satisfaction in their current fields, for exploring other areas of the law that they  may not have previously considered, and for determining if a solo or small practice is the right way to go.",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Entre Amis: An Interactive Approach 4th",
        "Authors": "By Larbi Oates Michael D. and Oukada",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Corporate Religion: Building a Strong Company Through Personality and Corporate Soul",
        "Authors": "By Kunde, Jesper",
        "Description": "",
        "Category": " Business & Economics , Forecasting",
        "Publisher": "Financial Times Management",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Electronic devices (Merrill's international series in electrical and electronics technology)",
        "Authors": "By Thomas L. Floyd",
        "Description": "",
        "Category": "",
        "Publisher": "Merrill Publishing Company A Bell & Howell Informa",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Understanding Financial Statements",
        "Authors": "By Fraser, Lyn M. and Ormiston, Aileen",
        "Description": "This classic volume presents the conceptual background and analytical tools necessary to understand and interpret financial statements. The emphasis throughout is on the evaluation of financial statements and their usefulness for business decision-making?rather than on how the financial statements are constructed. Straightforward, understandable, and accessible--regardless of readers' background--it orients them toward what they will actually encounter in practice. By emphasizing how to solve unstructured problems and how to use accounting information for decision-making, it helps them learn how to think and reason through complex, real-world situations. Includes mini-cases using the financial statements of actual companies.  The Balance Sheet; The Income Statement and Statement of Stockholders' Equity; Statement of Cash Flows; The Analysis of Financial Statements; A Guide to Earnings Quality; The Analysis of Segmental Data; Understanding Bank Financial Statements.  For investors and others who make decisions based on the analysis of financial statements.",
        "Category": " Business & Economics , Accounting , General",
        "Publisher": "Pearson Education Prentice Hall",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "A Country Music Christmas: Songs, Memories, Family Photographs and Recipes from America's Favorite Country and Gospel Stars",
        "Authors": "By Hand, Edie and Killen, Buddy",
        "Description": "Through the pages of this book, country music fans can share the joys of Christmas with some of America’s most beloved stars.   This rich collection of memories and traditions features stories—in the stars’ own words—of childhood memories and favorite ways of celebrating the most festive holiday of the year. Stars like Dolly Parton and Billy Ray Cyrus recall how childhoods like theirs—poor in terms of money, but rich in terms of love—resulted in some of the happiest Christmas memories they have. And memories are being made today with stars like Tim McGraw, Tanya Tucker, and Clint Black, who discover anew the magic of Christmas through their children’s eyes.Photos reveal the private side of the stars, and their recipes make Christmas country-style easy to achieve, with dishes such as Barbara Mandrell’s Christmas turkey and Alan Jackson’s cornbread stuffing, John Michael Montgomery’s wild goose with currant sauce, Charlie Daniels’s sugar cookies, Naomi Judd’s miniature fruitcakes, and many more.The 15-track CD features songs specially recorded for this book. The album includes Tim Rushlow’s “Little Drummer Boy,” The Jordanaires’s “Joy to the World,” and Kristy Rhode’s “Come On Ring Those Bells.” A portion of the proceeds from this book will benefit St. Jude Children's Research Hospital®, the Country Music Hall of Fame and Museum®, and the Edie Hand Foundation™.The Country Music Hall of Fame and Museum is operated by the non-profit, educational Country Music Foundation (CMF). The mission of the CMF is to identify and preserve the evolving history and traditions of country music and to educate its audiences. The Country Music Hall of Fame and Museum presents the country music story through its treasure trove of historic country music video clips and recorded music, dynamic exhibits with state-of-the-art design, and a regular menu of live performances and public programs.St. Jude Children's Research Hospital is internationally recognized for its pioneering work in finding cures and saving children with cancer and other catastrophic diseases. Founded by late entertainer Danny Thomas and based in Memphis, Tennessee, St. Jude freely shares its discoveries with scientific and medical communities around the world. No family ever pays for treatments not covered by insurance, and families without insurance are never asked to pay. St. Jude is financially supported by ALSAC, its fund-raising organization.The Edie Hand Foundation’s mission is to raise and donate money to Alabama communities and national charities to help raise a child or to defeat an incurable disease or to provide children joy at Christmas. Visit www.ediehandfoundation.org.More than 65 stars of country music share their favorite recipes, cherished holiday memories, and family photos in this country-style Christmas treasury that includes a 15-song CD.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "French Women for All Seasons: A Year of Secrets, Recipes, and Pleasure",
        "Authors": "By Guiliano, Mireille",
        "Description": "By letter, e-mail, and in person, readers of Mireille Guiliano’s phenomenal best seller, French Women Don’t Get Fat, have inundated her with requests for more of her cunning but simple secrets to living the good life, the ways French women manage to enjoy wine, chocolate, and many other seductive pleasures without gaining weight. Mireille’s answer? This buoyant book brimming with fresh advice and seasonal stories—on food bien sûr (more than 100 delicious new recipes) but also on many other aspects of living that should bring us pleasure, such as picking a wine, dressing well, even arranging flowers.French women not only stay slim while relishing life to the fullest, they also have the longest life expectancy in the Western world. And now Mireille shows us how they attune themselves to the rhythms of the year. Together with a bounty of new dining ideas and menus, she offers us a treasury of tips on style, grooming, and entertaining, all designed to focus the mind on sensory pleasure for maximum enjoyment. Here are four seasons’ worth of strategies for shopping, cooking, and exercising, as well as some pointers for looking effortlessly chic. Whether your aim is finding two scoopfuls of pleasure in one of crème brûlée or entertaining beautifully when time is short and expectations are high, the inspiration you need is here. Taking us from her childhood in Alsace-Lorraine to her summers in Provence and her busy life in New York and Paris, this book of scrumptious Gallic wisdom and wit shows how anyone anywhere can develop a healthy, holistic lifestyle.In the voice that entranced more than a million honorary French women, Mireille demonstrates that there is indeed an art to joyful living, and that equilibrium—being bien dans sa peau and true to one’s individual nature—is the key to a long and healthy life. Full of sage, irresistible advice on everything from decanting to detoxing, from yogurt to yoga, French Women for All Seasons is an essential guide to savoring all life’s moments—in moderation, in season, and, above all, with pleasure.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Traveler's Diet: Eating Right and Staying Fit on the Road",
        "Authors": "By Greenberg, Peter",
        "Description": "Expand your travel horizons without expanding your waistlineNo matter how healthy or balanced your diet, the minute you start traveling, all bets are off. And Peter Greenberg should know. After two decades as a television correspondent (logging an average of 400,000 air miles a year), this frequent flier finally stepped on the scale and then vowed to lose seventy pounds. Now, after sharing insider secrets on hotels, airlines, and cruise ships, he tells you the secret of diet, exercise, sleep, and losing weight while on the road. Each component of the travel process is examined; the results will surprise you and help you to learn: • What new time zones do–and don’t do–to your metabolism• Which airports have the best/worst food. • What to eat before flying• The real truth about how much water to drink–and what kind• How to work out in flight, without turbulence• The “healthy choice” hotel menus that lie• When to sleep and when to stay awake–some real surprises.• How to turn your hotel room into an instant gym• How to stay in ship-shape while actually at sea.• Eat well without overdoing it–even in France and Italy• How to create healthy structure with an unstructured scheduleTogether with medical, fitness, nutrition experts, and aeromedicine and exercise physiology consultants, Peter Greenberg provides a practical plan that works for road warriors and leisure travelers alike. Whether you’re jetting off to Mumbai or Memphis, this entertaining guide ensures that you arrive at your destination in style and in shape.",
        "Category": " Travel , Special Interest , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "I Am the New Black",
        "Authors": "By Bozza, Anthony and Morgan, Tracy",
        "Description": "The outrageously funny, heartbreaking, and surprising story of Tracy Morgan's rise from ghetto wiseass to superstar comedian.Who is Tracy Morgan? The wildly unpredictable funnyman who rocketed to fame on Saturday Night Live? The Emmy-nominated actor behind the sly and ingenious character Tracy Jordan on the award-winning hit sitcom 30 Rock, whose turbulent personal life often mirrors that of his fictional alter ego? Is he Chico Divine, the life of the party–any party, anytime, anywhere–getting ladies pregnant everywhere he goes? Or is he a soulful, tender family man who emerged from a hardscrabble ghetto upbringing and, against all odds, achieved superstardom, raised a solid family, prevailed over a collection of lethal bad habits, and is still ascending new heights and coming into his own? The answer is: Tracy Morgan is all that. And a bag of potato chips with a 50¢ soda.When he was just a boy living in the Tompkins Projects in Bed-Stuy, Brooklyn, being funny was about survival. With the right snap, Tracy could shut down the playground bullies who picked on him and his physically disabled older brother. And with a wild enough prank, he could exact revenge on whoever stole his Pumas at the community pool. Later, being funny was about escape–from the untouchable sadness of his father's death, from the desperation of the drug dealer's trade, from the life-and-death battles waged on the streets of the South Bronx in the age of crack. But these days being funny is about living his dream–a dream born in the comedy clubs of Harlem and realized on shows like Martin and Saturday Night Live, where he was a cast member for seven years, and in movies like The Longest Yard and Half-Baked. With brutal honesty and his trademark take-no-prisoners humor, Tracy tells the story of his rise to fame, with all its highs and its many lows–from the very public battles with alcohol and diabetes that threatened both his career and his life to the private and poignant end of his twenty-year marriage. In his singularly warped and brilliant way he muses on family, love, sex, race, politics, ambition, and what it takes to bring the funny.Hilarious, inspiring, searing, and touching, I Am the New Black is a fascinating peek inside the minds of one of the most compelling and defining comedians of our time.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Spiegel & Grau",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The American Civil War: A Military History",
        "Authors": "By Keegan, John",
        "Description": "For the past half century, John Keegan, the greatest military historian of our time, has been returning to the scenes of America’s most bloody and wrenching war to ponder its lingering conundrums: the continuation of fighting for four years between such vastly mismatched sides; the dogged persistence of ill-trained, ill-equipped, and often malnourished combatants; the effective absence of decisive battles among some two to three hundred known to us by name. Now Keegan examines these and other puzzles with a peerless understanding of warfare, uncovering dimensions of the conflict that have eluded earlier historiography.While offering original and perceptive insights into psychology, ideology, demographics, and economics, Keegan reveals the war’s hidden shape—a consequence of leadership, the evolution of strategic logic, and, above all, geography, the Rosetta Stone of his legendary decipherments of all great battles. The American topography, Keegan argues, presented a battle space of complexity and challenges virtually unmatched before or since. Out of a succession of mythic but chaotic engagements, he weaves an irresistible narrative illuminated with comparisons to the Napoleonic Wars, the First World War, and other conflicts. The American Civil War is sure to be hailed as a definitive account of its eternally fascinating subject.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Vintage Caper",
        "Authors": "By Mayle, Peter",
        "Description": "Set in Hollywood, Paris, Bordeaux, and Marseille, Peter Mayle’s newest and most delightful novel is filled with culinary delights, sumptuous wines, and colorful characters. It’s also a lot of fun.The story begins high above Los Angeles, at the extravagant home and equally impressive wine cellar of entertainment lawyer Danny Roth. Unfortunately, after inviting the Los Angeles Times to write an extensive profile extolling the liquid treasures of his collection, Roth finds himself the victim of a world-class wine heist.Enter Sam Levitt, former corporate lawyer, cultivated crime expert, and wine connoisseur. Called in by Roth’s insurance company, which is now saddled with a multimillion-dollar claim, Sam follows his leads—to Bordeaux and its magnificent vineyards, and to Provence to meet an eccentric billionaire collector who might possibly have an interest in the stolen wines. Along the way, bien sûr, he is joined by a beautiful and erudite French colleague, and together they navigate many a château, pausing frequently to enjoy the countryside’s abundant pleasures.The unraveling of the ingenious crime is threaded through with Mayle’s seductive rendering of France’s sensory delights—from a fine Lynch-Bages and Léoville Barton to the bouillabaisse of Marseille and the young lamb of Bordeaux. Even the most sophisticated of oenophiles will learn a thing or two from this vintage work by a beloved author.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Black Ships",
        "Authors": "By Graham, Jo",
        "Description": "\"Haunting and bittersweet, lush and vivid, this extraordinary story has lived with me since I first read it.\" --Naomi Novik, author of His Majesty's DragonThe world is ending. One by one the mighty cities are falling, to earthquakes, to flood, to raiders on both land and sea. In a time of war and doubt, Gull is an oracle. Daughter of a slave taken from fallen Troy, chosen at the age of seven to be the voice of the Lady of the Dead, it is her destiny to counsel kings. When nine black ships appear, captained by an exiled Trojan prince, Gull must decide between the life she has been destined for and the most perilous adventure -- to join the remnant of her mother's people in their desperate flight. From the doomed bastions of the City of Pirates to the temples of Byblos, from the intrigues of the Egyptian court to the haunted caves beneath Mount Vesuvius, only Gull can guide Prince Aeneas on his quest, and only she can dare the gates of the Underworld itself to lead him to his destiny. In the last shadowed days of the Age of Bronze, one woman dreams of the world beginning anew. This is her story.",
        "Category": " Fiction , Fantasy , Historical",
        "Publisher": "Orbit",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Museum of Innocence",
        "Authors": "By Pamuk, Orhan and Freely, Maureen (TRN)",
        "Description": "“It was the happiest moment of my life, though I didn’t know it.” So begins the new novel, his first since winning the Nobel Prize, from the universally acclaimed author of Snow and My Name Is Red. It is 1975, a perfect spring in Istanbul. Kemal, scion of one of the city’s wealthiest families, is about to become engaged to Sibel, daughter of another prominent family, when he encounters Füsun, a beautiful shopgirl and a distant relation. Once the long-lost cousins violate the code of virginity, a rift begins to open between Kemal and the world of the Westernized Istanbul bourgeosie—a world, as he lovingly describes it, with opulent parties and clubs, society gossip, restaurant rituals, picnics, and mansions on the Bosphorus, infused with the melancholy of decay—until finally he breaks off his engagement to Sibel. But his resolve comes too late. For eight years Kemal will find excuses to visit another Istanbul, that of the impoverished backstreets where Füsun, her heart now hardened, lives with her parents, and where Kemal discovers the consolations of middle-class life at a dinner table in front of the television. His obsessive love will also take him to the demimonde of Istanbul film circles (where he promises to make Füsun a star), a scene of seedy bars, run-down cheap hotels, and small men with big dreams doomed to bitter failure. In his feckless pursuit, Kemal becomes a compulsive collector of objects that chronicle his lovelorn progress and his afflicted heart’s reactions: anger and impatience, remorse and humiliation, deluded hopes of recovery, and daydreams that transform Istanbul into a cityscape of signs and specters of his beloved, from whom now he can extract only meaningful glances and stolen kisses in cars, movie houses, and shadowy corners of parks. A last change to realize his dream will come to an awful end before Kemal discovers that all he finally can possess, certainly and eternally, is the museum he has created of his collection, this map of a society’s manners and mores, and of one man’s broken heart.A stirring exploration of the nature of romantic attachment and of the mysterious allure of collecting, The Museum of Innocence also plumbs the depths of an Istanbul half Western and half traditional—its emergent modernity, its vast cultural history. This is Orhan Pamuk’s greatest achievement.",
        "Category": " Fiction , Literary",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Perfume of Paradise",
        "Authors": "By Blake, Jennifer",
        "Description": "On the island of Haiti, Elene Larpent, the daughter of a plantation owner, escapes her marriage and a slave revolt, only to fall into the hands of Ryan Bayard, captain of a merchant ship on its way to New Orleans",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Fawcett Columbine / Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Martha Stewart's Cupcakes: 175 Inspired Ideas for Everyone's Favorite Treat: A Baking Book",
        "Authors": "By Martha Stewart Living (EDT)",
        "Description": "The perfect cupcake for every occasion.Swirled and sprinkled, dipped and glazed, or otherwise fancifully decorated, cupcakes are the treats that make everyone smile. They are the star attraction for special days, such as birthdays, showers, and holidays, as well as perfect everyday goodies. In Martha Stewart’s Cupcakes, the editors of Martha Stewart Living share 175 ideas for simple to spectacular creations–with cakes, frostings, fillings, toppings, and embellishments that can be mixed and matched to produce just the right cupcake for any occasion. Alongside traditional favorites like yellow buttermilk cupcakes swirled with fluffy vanilla frosting and devil’s food cupcakes crowned with rich, dark chocolate buttercream, there are also sweet surprises such as peanut butter and jelly cupcakes, dainty delights like tiny almond-cherry tea cakes, and festive showstoppers topped with marizpan ladybugs or candy clowns. The book features cupcakes for everyone, every season, and every event: Celebrations (monogram heart cupcakes perfect for an elegant wedding); Birthdays (starfish-on-the-beach cupcakes sure to be a hit at children’s parties); Holidays (gumdrop candy ghouls and goblins ideal for Halloween revelers); and Any Day (red velvet cupcakes with cream cheese frosting for a picnic, or caramel-filled mini chocolate cakes for grown-up gatherings).  In singular Martha Stewart style, the pages are both stunning in design–with a photograph of each finished treat–and brimming with helpful how-to information, from step-by-step photographs for decorating techniques to ideas for packaging and presenting your cupcakes. Whether for any day or special days, the treats in Martha Stewart’s Cupcakes will delight one and all.",
        "Category": " Cooking , Courses & Dishes , Cakes",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "6.46",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "The Splendid Table's How to Eat Supper: Recipes, Stories, and Opinions from Public Radio's Award-Winning Food Show",
        "Authors": "By Kasper, Lynne Rossetto and Swift, Sally",
        "Description": "A fresh take on weeknight cooking from The Splendid Table's Lynne Rossetto Kasper and Sally SwiftAs loyal listeners know, Lynne  and Sally share an unrelenting curiosity about everything to do with food. Their  show, The Splendid Table, looks at the role food plays in our lives—inspiring us,  making us laugh, nourishing us, and opening us up to the world around us. Now they  have compiled all the most trenchant tips, never-fail recipes, and everyday culinary  know-how from the program in How to Eat Supper, a kitchen companion unlike any other.This  is no mere cookbook. Like the show, this book goes far beyond the recipe, introducing  the people and stories that are shaping America’s changing sense of food. We don’ t eat, shop, or cook as we used to. Our relationship with food has intensified, become  more controversial, richer, more pleasurable, and sometimes more puzzling. How to  Eat Supper gives voice to rarely heard perspectives on food—from the quirky to the  political, from the grassroots to the scholarly, from the highbrow to the humble—and  shows the essential role breaking bread together plays in our world.How to Eat  Supper takes you through a plethora of inviting recipes simple enough to ensure success  even if you’ve never cooked before. And if you are experienced in the kitchen, you’ ll find challenging new concepts and dishes to spark your imagination.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Robin Rescues Dinner: 52 Weeks of Quick-Fix Meals, 350 Recipes, and a Realistic Plan to Get Weeknight Dinners on the Table",
        "Authors": "By Miller, Robin",
        "Description": "Set the table for fantastic weeknight meals with the help of Food Network star Robin Miller.It’s great to have an ambitious plan to cook healthy dinners from scratch every night. It’s an entirely different story to execute it! Not to worry. Robin Miller–star of Food Network’s Quick Fix Meals with Robin Miller and Robin to the Rescue–is here to save the day. Known for her quick, bright ideas for healthy and satisfying meals, Robin shares her unique and completely realistic strategy for a busy workweek in Robin Rescues Dinner. It’s as simple as planning three dishes in advance so that you’re prepared, no matter what the week brings! Here you’ll find 52 weeks of meals, each including three weeknight main dishes, heaps of suggestions for morphing one dish into another, a bounty of side dishes and desserts, and clever tips and techniques to speed up preparation time. Robin pairs her practical know-how with delectable flavors in more than 350 brand-new recipes brought to life in 38 beautiful color photographs. Starting in January and ending in December, the recipes follow the seasons, with comforting cold-weather dishes in winter and summer plates that make the most of seasonal produce. With Robin Rescues Dinner, weeknight dinners have never been easier–or more delicious!",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Down Home with the Neelys: A Southern Family Cookbook",
        "Authors": "By Neely, Patrick, Neely, Gina, and Disbrowe, Paula",
        "Description": "Meet the Neelys: Pat and Gina, husband-and-wife team, hosts of their own television show, and proprietors of the celebrated Memphis and Nashville eateries, Neely’s Bar-B-Que.The Neelys’ down-home approach to cooking has earned them the highest accolades from coast to coast. It has also won them millions of viewers on the Food Network. Simply put, the Neelys are all about good food and good times. In this, their eagerly awaited debut cookbook, the Neelys share the delicious food they have been cooking up for years both at home and in their restaurants.Pat and Gina hail from families with a boundless love of cooking and bedrock traditions of sharing meals. At the Neelys’, mealtime is family time, and that means no stinting on “the sauce.” Indeed, that’s one of the Neely secrets: the liberal application of barbeque sauce to almost anything—spaghetti, nachos, salad, you name it. Of course, there are other secrets as well, and you will find them all in the pages of Down Home with the Neelys, along with more than 120 mouthwatering recipes.Here are the tried-and-true southern recipes that have been passed down from one Neely generation to the next, including many of their signature dishes, such as Barbeque Deviled Eggs, Florida Coast Pickled Shrimp, Pat’s Wings of Fire, Gina’s Collard Greens, Grandma Jean’s Potato Salad, Nana’s Southern Gumbo, Memphis-sized Pulled Pork Sandwiches with Slaw, Get Yo’ Man Chicken, and Sock-It-to-Me Cake. Certainly, no self-respecting southerner would dream of offering a meal to a guest without a proper drink, so Pat and Gina have included some of their favorite libations here, too.The Neelys work, laugh, love, and play harder than any family you’ll ever meet. Their love for good food is infectious, and in Down Home with the Neelys, they bring their heavenly inspired cooking down to earth for all to share.",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Knopf",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Quick and Easy Topiary and Green Sculpture: Create Traditional Effects with Fast-Growing Climbers and Wire Frames",
        "Authors": "By Hendy, Jenny",
        "Description": "A guide to topiary provides instructions for making wire frames; shaping, styling, and caring for plants; and includes an illustrated guide to more than 150 varieties of flowering and foliage plants",
        "Category": " Gardening , Topiary",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Gastronomy of Marriage: A Memoir of Food and Love",
        "Authors": "By Maisto, Michelle",
        "Description": "“On our first date, Rich ordered a chocolate soufflé at the beginning of the meal, noting an asterisk on the menu warning diners of the wait involved. At the time, I imagined he did it partly to impress me, which it did, though today I know well that he’s simply the type of man who knows better than to turn down a hot-from-the-oven soufflé when one is offered to him.”When Michelle Maisto meets Rich–like her, a closet writer with a fierce love of books and good food–their single-mindedness at the table draws them together, and meals become a stage for their long courtship. Finally engaged, they move in together, but sitting down to shared meals each night–while working at careers, trying to write, and falling into the routines that come to define a home–soon feels like something far different from their first dinner together.Who cooks, who shops, who does the dishes? Rich craves the light fare his mother learned to prepare as a girl in China, but Michelle leans toward the hearty dishes her father knew as a boy in Italy. Rich eats meat, but Michelle doesn’t. His metabolism races through carbohydrates, hers holds to them tightly. And while her idea of a quick meal is a fried egg, his is to head to a restaurant. After Rich takes additional work to pay for their wedding, Michelle offers to do his half of the cooking chores–which, along with the newness of their living together, challenges her feelings about the kitchen and what it means to be a modern wife.As they save and plan for a wedding, the nightly compromises, small generosities, and stubborn stakings of ground that take place around the dinner table offer a context in which Maisto considers what she’s learned from the marriages around her, and what she and Rich might create for themselves.",
        "Category": " Cooking , Essays & Narratives",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Sunset Gardener's Answer Book",
        "Authors": "By Sunset Books",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "The Gardens in the Royal Park at Windsor",
        "Authors": "By Roper, Lanning",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Co.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Better Homes and Gardens Your Yard",
        "Authors": "By Better Homes & Gardens Editors",
        "Description": "Supplies advice on landscaping the grounds surrounding a house and explains how to construct porches, decks, swimming pools, and other outdoor structures",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "A Baby Panda Is Born (Penguin Young Readers, Level 3)",
        "Authors": "By Washburn, Lucia (ILT) and Ostby, Kristin",
        "Description": "Kids will love reading all about the panda Mei Lan, born at the Atlanta Zoo in September 2006. Through her story, they?ll learn about what newborn pandas are like (they?re the size of a stick of butter!), about their development, and about what life is like for pandas in the wild. This book also touches on efforts to protect this endangered species.",
        "Category": " Juvenile Nonfiction , Animals , Bears",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Jill's Glasses",
        "Authors": "By Nancy Parent",
        "Description": "",
        "Category": "",
        "Publisher": "Modern Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Galactic Empires : Volume Two",
        "Authors": "By Aldiss, Brian W. (editor)",
        "Description": "",
        "Category": "",
        "Publisher": "St Martins",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Quiet Moments with God for Mothers",
        "Authors": "By Honor Books (EDT)",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Cook Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Way Forward Is with a Broken Heart",
        "Authors": "By Walker, Alice",
        "Description": "\"These are the stories that came to me to be told after the close of a magical marriage to an extraordinary man that ended in a less-than-magical divorce. I found myself unmoored, unmated, ungrounded in a way that challenged everything I'd ever thought about human relationships. Situated squarely in that terrifying paradise called freedom, precipitously out on so many emotional limbs, it was as if I had been born; and in fact I was being reborn as the woman I was to become.\"So says Pulitzer Prize-winning author Alice Walker about her beautiful new book, in which \"one of the best American writers today\" (The Washington Post) gives us superb stories based on rich truths from her own experience. Imbued with Walker's wise philosophy and understanding of people, the spirit, sex and love, The Way Forward Is with a Broken Heart begins with a lyrical, autobiographical story of a marriage set in the violent and volatile Deep South during the early years of the civil rights movement. Walker goes on to imagine stories that grew out of the life following that marriage—a life, she writes, that was \"marked by deep sea-changes and transitions.\" These provocative stories showcase Walker's hard-won knowledge of love of many kinds and of the relationships that shape our lives, as well as her infectious sense of humor and joy. Filled with wonder at the power of the life force and of the capacity of human beings to move through love and loss and healing to love again, The Way Forward Is with a Broken Heart is an enriching, passionate book by \"a lavishly gifted writer\" (The New York Times Book Review).",
        "Category": " Fiction , Romance , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Mammals of the Northern Rockies",
        "Authors": "By Ulrich, Tom J.",
        "Description": "",
        "Category": " Nature , Animals , Mammals",
        "Publisher": "Mountain Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Little Heathens: Hard Times and High Spirits on an Iowa Farm During the Great Depression",
        "Authors": "By Kalish, Mildred Armstrong",
        "Description": "I tell of a time, a place, and a way of life long gone. For many years I have had the urge to describe that treasure trove, lest it vanish forever. So, partly in response to the basic human instinct to share feelings and experiences, and partly for the sheer joy and excitement of it all, I report on my early life. It was quite a romp.So begins Mildred Kalish’s story of growing up on her grandparents’ Iowa farm during the depths of the Great Depression. With her father banished from the household for mysterious transgressions, five-year-old Mildred and her family could easily have been overwhelmed by the challenge of simply trying to survive. This, however, is not a tale of suffering.Kalish counts herself among the lucky of that era. She had caring grandparents who possessed—and valiantly tried to impose—all the pioneer virtues of their forebears, teachers who inspired and befriended her, and a barnyard full of animals ready to be tamed and loved. She and her siblings and their cousins from the farm across the way played as hard as they worked, running barefoot through the fields, as free and wild as they dared.Filled with recipes and how-tos for everything from catching and skinning a rabbit to preparing homemade skin and hair beautifiers, apple cream pie, and the world’s best head cheese (start by scrubbing the head of the pig until it is pink and clean), Little Heathens portrays a world of hardship and hard work tempered by simple rewards. There was the unsurpassed flavor of tender new dandelion greens harvested as soon as the snow melted; the taste of crystal clear marble-sized balls of honey robbed from a bumblebee nest; the sweet smell from the body of a lamb sleeping on sun-warmed grass; and the magical quality of oat shocking under the light of a full harvest moon.Little Heathens offers a loving but realistic portrait of a “hearty-handshake Methodist” family that gave its members a remarkable legacy of kinship, kindness, and remembered pleasures. Recounted in a luminous narrative filled with tenderness and humor, Kalish’s memoir of her childhood shows how the right stuff can make even the bleakest of times seem like “quite a romp.”",
        "Category": " Family & Relationships , Parenting , Grandparenting",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Year's Best Science Fiction: Twenty-Third Annual Collection",
        "Authors": "By Dozois, Gardner R. (EDT)",
        "Description": "In the heart of the new millennium, worlds beyond our imagination have opened up, blurring the line between life and art. Embracing the challenges and possibilities of cyberspace, genetics, the universe, and beyond, the world of science fiction has become a porthole into the realities of tomorrow. In The Year's Best Science Fiction Twenty-third Annual Collection,our very best SF authors explore ideas of a new world with such compelling stories as:\"Beyond the Aquila Rift\": Critically acclaimed author Alastair Reynolds takes readers to the edge of the universe, where no voyager has dared to travel before---or so we think.\"Comber\": Our world is an ever-changing one, and award-winning author Gene Wolfe explores the darker side of our planet's fluidity in his own beautiful and inimitable style.\"Audubon in Atlantis\": In a world not quite like our own, bestselling author Harry Turtledove shows us that there are reasonssome species have become extinct.The twenty-nine stories in this collection imaginatively take us far across the universe, into the very core of our beings, to the realm of the gods, and the moment just after now. Included here are the works of masters of the form and of bright new talents, including:Neal Asher, Paolo Bacigalupi, Stephen Baxter, Elizabeth Bear, Chris Beckett, Dominic Green, Daryl Gregory, Joe Haldeman, Gwyneth Jones, James Patrick Kelley, Jay Lake and Ruth Nestvold, Ken MacLeod, Ian McDonald, Vonda N. McIntyre, David Moles, Derryl Murphy, Steven Popkes, Hannu Rajaniemi, Alastair Reynolds, Robert Reed, Chris Roberson, Mary Rosenblum, William Sanders, Bruce Sterling, Michael Swanwick, Harry Turtledove, Peter Watts, Liz Williams, and Gene Wolfe.Supplementing the stories are the editor's insightful summation of the year's events and a lengthy list of honorable mentions, making this book both a valuable resource and the single best place in the universe to find stories that stir the imagination and the heart.",
        "Category": " Fiction , Science Fiction , Collections & Anthologies",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "11.11",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Seven African Amercian Scienti (Achievers : African Americans in Science and Technology)",
        "Authors": "By Hayden, Robert C.",
        "Description": "Examines the lives and achievements of seven black Americans who left their mark through scientific work, from Benjamin Banneker to Matthew Henson",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Science & Technology",
        "Publisher": "21st Century",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The Coming Prince (Sir Robert Anderson Library Series)",
        "Authors": "By Anderson, Robert",
        "Description": "",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Kregel Classics",
        "Price Starting With ($)": "17.83",
        "Publish Date": {
            "Month": "June",
            "Year": "1957"
        }
    },
    {
        "Title": "How to Buy and Sell a Business: How You Can Win in the Business Quadrant (Rich Dad's Advisors)",
        "Authors": "By Sutton, Garrett",
        "Description": "Sutton, who is a corporate attorney, identifies the pitfalls and obstacles to avoid when buying and selling a business, and emphasizes the importance of putting together a team of professional advisors for help along the way. He discusses confidentiality, franchises, the elements of a selling prospectus, reading financial reports, valuations methods, negotiations to structure the deal, and tax considerations. No index is provided. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , General",
        "Publisher": "Business Plus",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Scholastic Book of World Records",
        "Authors": "By Morse, Jenifer Corr",
        "Description": "A comprehensive reference guide to many records in the realm of politics, sports, the environment, space, popular culture, and more comes complete with more than 600 full-color graphics and a record for each of the 50 states. Original.",
        "Category": " Young Adult Nonfiction , Reference",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "A Problem of Evidence: How the Prosecution Freed O.J. Simpson",
        "Authors": "By Bosco, Joseph",
        "Description": "Just when you thought nothing new could be said about the Trial of the Century - the O. J. Simpson courtroom drama that held America transfixed for sixteen months - here comes A Problem of Evidence, Joseph Bosco's sensational, truth-seeking missile of a book. Bosco, a seasoned crime journalist, is that rare thing - an unpuffed-up writer with no ax to grind. He simply tells the crime story as he sees it, and proves - beyond any doubt - that the prosecution bungled the case.He takes us with him into the courtroom where he sat every day of the trial and introduces us to the full cast of characters. In a series of remarkable vignettes and close-up impressions, we watch them in action - for better and worse. We see what television did not show. We measure the real evidence and the real actors after all the spin, deception, and lies. And in exclusive interviews, about material never before revealed, we hear from Dr. Henry Lee, the country's leading forensic scientist; Pat McKenna, private investigator for the defense; Dr. Mark Goulston, psychiatrist who consulted for the prosecution; and Peter Bozanich, assistant Los Angeles district attorney.",
        "Category": " Law , Courts",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Science of the Mind: 2nd Edition",
        "Authors": "By Flanagan, Owen J.",
        "Description": "Consciousness emerges as the key topic in this second edition of Owen Flanagan's popular introduction to cognitive science and the philosophy of psychology. in a new chapter Flanagan develops a neurophilosophical theory of subjective mental life. He brings recent developments in the theory of neuronal group selection and connectionism to bear on the problems of the evolution of consciousness, qualia, the unique first-personal aspects of consciousness, the causal role of consciousness, and the function and development of the sense of personal identity. He has also substantially revised the chapter on cognitive psychology and artificial intelligence to incorporate recent discussions of connectionism and parallel distributed processing.",
        "Category": " Psychology , Cognitive Psychology & Cognition",
        "Publisher": "A Bradford Book",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Great Ideas in Physics",
        "Authors": "By Lightman, Alan",
        "Description": "The conservation of energy, the second law of thermodynamics, the theory of relativity, quantum mechanics­­together, these concepts form the foundation upon which modern physics was built. But the influence of these four landmark ideas has extended far beyond hard science. There is no aspect of twentieth-century culture­­including the arts, social sciences, philosophy, and politics­­that has not been profoundly influenced by them.In Great Ideas in Physics, Alan Lightman clearly explains the physics behind each of the four great ideas and deftly untangles for lay readers such knotty concepts as entropy, the relativity of time, and the Heisenberg uncertainty principle. Throughout the book he uses excerpts from the writings of scientific luminaries such as Newton, Kelvin, Einstein, and de Broglie to help place each in its proper historical perspective. And with the help of expertly annotated passages from the works of dozens of writers, philosophers, artists, and social theorists, Lightman explores the two-way influences of these landmark scientific concepts on our entire human culture and the world of ideas.",
        "Category": " Science , Physics , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Great Film Directors: A Critical Anthology",
        "Authors": "By Braudy",
        "Description": "Investigates the careers and cinematic accomplishments of twenty-three great directors including Antonioni, Bergman, Capra, Chaplin, Fellini, Hitchcock, Truffaut, and Welles",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1978"
        }
    },
    {
        "Title": "Of Beetles and Angels: A Boy's Remarkable Journey from a Refugee Camp to Harvard",
        "Authors": "By Asgedom, Mawi and Berger, Dave",
        "Description": "Read the remarkable true story of a young boy's journey from civil war in east Africa to a refugee camp in Sudan, to a childhood on welfare in an affluent American suburb, and eventually to a full-tuition scholarship at Harvard University. Following his father's advice to \"treat all people-even the most unsightly beetles-as though they were angels sent from heaven,\" Mawi overcomes the challenges of language barriers, cultural differences, racial prejudice, and financial disadvantage to build a fulfilling, successful life for himself in his new home. Of Beetles and Angels is at once a harrowing survival story and a compelling examination of the refugee experience. With hundreds of thousands of copies sold since its initial publication, and as a frequent selection as one book/one school/one community reads, this unforgettable memoir continues to touch and inspire readers. This special expanded fifteenth anniversary edition includes a new introduction and afterword from the author, a discussion guide, and more.",
        "Category": " Young Adult Nonfiction , History , Africa",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Indoor Bonsai: Plants and Gardens (Brooklyn Botanic Garden Record)",
        "Authors": "By Dreilinger, Sigmund",
        "Description": "",
        "Category": " Gardening , Techniques",
        "Publisher": "Brooklyn Botanic Gardens, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "The Nation's Choice, Phonics Library Level 1 Theme 10: Houghton Mifflin the Nation's Choice California (Houghton Mifflin Reading: The Nation's Choice)",
        "Authors": "By Read (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Next Grilleration Great Grilling Recipes",
        "Authors": "By George Foreman",
        "Description": "",
        "Category": "",
        "Publisher": "George Foreman",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Small Business Bible: Everything You Need To Know To Succeed In Your Small Business",
        "Authors": "By Strauss, Steven D.",
        "Description": "Whether youre a novice entrepreneur or a seasoned pro, The Small Business Bible is a comprehensive, easy-to-read, A-to-Z library of everything you might need to know. Not only does it teach new entrepreneurs what works and what doesnt?giving them scores of tips, hints, insider information, and secrets of success?its also a reliable, valuable, and insightful resource for established business owners who want to help their businesses continue to grow and succeed. The book covers all aspects of small business operations and strategies, and includes straightforward information on almost every topic. Plus, youll find secrets of great entrepreneurs, a wealth of online resources, real-life success stories, and cutting-edge strategies that work.",
        "Category": " Business & Economics , Small Business",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Introducing Philosophy",
        "Authors": "By Robinson, Dave and Groves, Judy",
        "Description": "",
        "Category": " Philosophy , Reference",
        "Publisher": "Icon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Manet:The Influence of the Modern",
        "Authors": "By Cachin, Francoise and Kaplan, Rachel (TRN)",
        "Description": "Exploring Edouard Manet's earliest influences and retracing events that led to his becoming the \"godfather of Impressionism,\" a colorful account looks closely at the controversies that surrounded his most famous paintings: Le De+a7jeuner sur l'Herbe and Olympia. Original.",
        "Category": " Art , Individual Artists , General",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Your Complete Retirement Planning Road Map: A Comprehensive Action Plan for Securing IRAs, 401(k)s, and Other Retirement Plans for Yourself and Your Family",
        "Authors": "By Slott, Ed",
        "Description": "Corporate pensions are disappearing. Social Security is in trouble. And the sizable postwar generation is reaching retirement age. With the futures of millions of Americans at stake, Ed Slott, the country’s foremost retirement planning adviser, now offers expert advice on weathering the perfect storm of financial instability that looms on the horizon.Your Complete Retirement Planning Road Map provides clear step-by-step directions through the highways and byways of IRAs, 401(k)s, 403(b)s, and other major accounts.In five focused sections, Slott combines crucial facts with checklists and questionnaires to teach investors and beneficiaries alike the best way to save and to maximize an inheritance. Inside you’ll discover• an overview of every retirement savings account you own–from what it is and where it is to who gets it and how, plus where to put important data• how to properly fill out retirement account beneficiary forms so that money goes to whomever you choose and not to relatives who pop up out of nowhere• what to do when you inherit so that you won’t lose any tax benefits or make a mistake that could wipe out an inherited fortune that took years to build up• how to handle out-of-the-box issues such as divorce or incapacity; tax issues for unmarried partners; decisions about trusts• how to determine whether your professional retirement adviser is really up to the task of preserving and protecting your money• the most up-to-date information on tax laws, including the Pension Protection Act, which provides major new retirement incentives that you can take advantage ofYour Complete Retirement Planning Road Map is an indispensable planning solution that is sure to become the standard how-to on a complex subject that is becoming relevant to more people every day.“IRA savant Ed Slott [helps] you make the most of your retirement earnings or inherited account.”–USA Today“Ed Slott knows more about the care and feeding of IRAs than anybody else.”–Newsday",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "The Holy Grail",
        "Authors": "By Goodrich, Norma Lorre",
        "Description": "In the final volume of her fascinating, comprehensive, and authoritative Camelot tetralogy, Norma Lorre Goodrich examines one of the most enduring themes of all time, the search for the Holy Grail.",
        "Category": " History , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Marley & Me",
        "Authors": "By John Grogan",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Our Hero (Babymouse #2)",
        "Authors": "By Holm, Jennifer L. and Holm, Matthew",
        "Description": "NEW YORK TIMES bestselling and Newbery Honor winning author Jennifer Holm teams up with Matthew Holm to bring you a fully illustrated graphic novel series packed with humor and kid appeal—BABYMOUSE!  With multiple Children's Choice awards and over 1.7 million books in print, kids, parents, and teachers agree that Babymouse is perfect for fans of Junie B. Jones, Ivy and Bean, Big Nate, Dork Diaries, and the Ramona chapter books!For Babymouse, school is a constant battle between good (Babymouse), evil (Felicia  Furrpaws), and more evil (gym class!). Can things get any worse? Yup. Because it’s  time for the annual dodgeball tournament. What’s a mouse to do? Don’t miss the excitement  in Our Hero—the 2nd hilarious, action-packed installment of the beloved Babymouse graphic novel series!Here's what people are saying about Babymouse! The  Chicago Sun-Times: \"Move over, Superman, here comes  Babymouse!\" Starred Review, The Horn  Book: \"Nobody puts Babymouse in the corner!\"  Booklist: \"Cute, smart, sassy Babymouse is fun and funny, and this book, like its  predecessors, will draw reluctant readers as well as Babymouse fans.\"The Bulletin: \"An almost absurdly likeable  heroine.\"",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "The Post-American World",
        "Authors": "By Zakaria, Fareed",
        "Description": "In this international bestseller, Fareed Zakaria describes \"the rise of the rest\"—the political and economic ascendance of countries such as China, India, Brazil, Russia, South Africa, and Kenya. With his customary lucidity, insight, and imagination, Zakaria outlines the contemporary diffusion of power, drawing on lessons of history to help the United States face the challenges—and opportunities—of the post-American world.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "How to Read a Film: The World of Movies, Media, Multimedia: Language, History, Theory",
        "Authors": "By Monaco, James",
        "Description": "First published in 1977, this popular book has become the source on film and media. Now, James Monaco offers a revised and rewritten third edition incorporating every major aspect of this dynamic medium right up to the present.Looking at film from many vantage points, How to Read a Film: Movies, Media, Multimedia explores the medium as both art and craft, sensibility and science, tradition and technology. After examining film's close relation to such other narrative media as the novel, painting, photography, television, and even music, Monaco discusses those elements necessary to understand how films convey meaning and, more importantly, how we can best discern all that a film is attempting to communicate.In a key departure from the book's previous editions, the new and still-evolving digital context of film is now emphasized throughout How to Read a Film. A new chapter on multimedia brings media criticism into the twenty-first century with a thorough discussion of topics like virtual reality, cyberspace, and the proximity of both to film. Monaco has likewise doubled the size and scope of his \"Film and Media: A Chronology\" appendix. The book also features a new introduction, an expanded bibliography, and hundreds of illustrative black-and-white film stills and diagrams. It is a must for all film students, media buffs, and movie fans.",
        "Category": " Performing Arts , Film , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Prince Charming: Identify the Guys With True Prince Charming Potential",
        "Authors": "By Khoo, Valerie and Smiedt, David",
        "Description": "We can conquer careers, earn advanced degrees and reasonable livings, scale mountains, win tennis matches and softball games. We've come a long way--so why do some of us have such a hard time in the realm of love and romance? Prince Charming won't solve all problems, but it will go a long way.This charming, illustrated book is every girl's guide to finding the right guy and keeping the relationship exciting once you've found him. But, first off, our authors one a guy and one a gal say, \"Relax.\" They caution we shouldn't be in such a hurry to tie the knot. Enjoy the process if you can. Nurture your own self-esteem. Explore your own needs. Banish bad attitudes. Trust your intuition.Valerie & David tell it like it is: if the new guy seems too good to be true he probably is. If he's so boring you're yawning on the first date, you'll be asleep by the second. He may be a Stayer, but Stayers with a little Player in their blood make for more fun. There are lists of what to look for and what NOT. And plenty of advice on separating the keepers and how to throw the others back. Not to mention a glossary of Male-Speak, what he says, what he really means, especially when he says he can't say \"I'm sorry.\"",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Red Wheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Purple Climbing Days (The Kids of the Polk Street School)",
        "Authors": "By Giff, Patricia Reilly",
        "Description": "What's worse than a blue Monday? For Richard \"Beast\" Best, it's a purple Monday spent climbing a fat brown rope with fat brown knots.Beast wishes he could climb up that rope like Emily Arrow and Matthew Jackson. Just looking at it hanging down from the gym ceiling makes him dizzyBeast is afraid and hopes his friends won't find out. But Mrs. Miller, the meanest substitute teacher in the whole school, finds out his secret and tells him to meet her in the gym after school. Miller the Killer. What will she do to him?",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "The Love of Baseball",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Essential Psychopathology and Its Treatment (Second Editon, Revised for DSM-IV)",
        "Authors": "By Maxmen, Jerrold S and Ward, Nicholas G.",
        "Description": "Everyone's favorite textbook on modern psychiatric diagnosis and treatment has been revised and updated not only to address changes introduced by DSM-IV but also to include more pointers on treatment and to add chapters on childhood disorders and sleep disorders.In a style remarkable for its clarity, wit, and practicality, the book explains DSM-IV, presents its diagnostic categories, and illuminates them with psychodynamic, behavioral, social, and biological theories. Avoiding jargon, it describes the genetics, epidemiology, neurochemistry, and psychopharmacology of mental disorders. Guidelines for treatment are given for each disorder. Amply illustrated with case vignettes, the book stresses the practical.This is a concentrated, yet sophisticated, presentation. The authors want the reader to finish this book knowing the subject, caring about it, curious about it, and most importantly, doing a better job diagnosing and treating patients.",
        "Category": " Psychology , Psychopathology , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Mummies Unwrapped (level 3) (Hello Reader)",
        "Authors": "By Weinberger, Kimberly and Sloan, Portia (ILT)",
        "Description": "An in-depth beginners history lesson in ancient Egypt and the fascinating process of the making of a mummy.Author Kimberly Weinberger presents an insightful look at the life of the ancient Egyptians, with very basic, easy-to-comprehend text. In four brief chapters, readers learn important facts about the Egyptians' belief  on life and death, stories and superstitions surrounding  their gods and goddesses,  intriguing facts about burial  tombs filled with treasures, and  the origin of the practice of making mummies. The author's thorough description of the mummy-making process is further illuminated by Portia Sloan's very detailed illustrations. The book ends with a look at the discovery of  a tomb that contained the most  incredible riches ever -- the tomb of the world- famous mummy, King Tutankhamen.",
        "Category": " Juvenile Nonfiction , Readers , Chapter Books",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Emotional Problems of Normal Children: How Parents Can Understand and Help",
        "Authors": "By Wernick, Sarah and Turecki, Stanley, M.D.",
        "Description": "Dr. Stanley Turecki's acclaimed first book, The Difficult Child, has become a parenting classic, with more than 250,000 copies in print. He brings the same compassion and practicality to this essential new guide, a lifeline for every parent who has ever asked the frightening question, \"Is something wrong with my child?\" Whether the difficulty is poor self-image or defiance, fearfulness or hyperactivity, lying or sibling rivalry, this original and thought-provoking book can help.Dr. Turecki begins with two powerful reassurances: \"Normal children can have problems\" and \"Parents can help them.\" Step-by-step, he shows how mothers and fathers can use their intimate knowledge of their child to understand what's happening - and to intervene effectively.The book offers innovative tools that will make every parent a more effective and confident family leader:Planned communication: how to discuss problems without destructive arguments and win your child's cooperation.The parental evaluation: a systematic way to gather facts and gain insight into causes and solutions.Active acceptance: how to strengthen your child's self-esteem by acknowledging his or her individuality.Effective discipline: a new approach that focuses on planning and prevention rather than punishment.Co-expert collaboration: how to work with teachers on school problems such as hyperactivity and learning disabilities; and when to seek additional help for a troubled child.Dr. Turecki also invites readers to sit in while he evaluates a child and his or her family. The book includes many vivid vignettes of cases from his practice, illustrating a wide range of problems - and how they were successfully resolved.",
        "Category": " Family & Relationships , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "On Intelligence: How a New Understanding of the Brain Will Lead to the Creation of Truly Intelligent Machines",
        "Authors": "By Blakeslee, Sandra and Hawkins, Jeff",
        "Description": "From the inventor of the PalmPilot comes a new and compelling theory of intelligence, brain function, and the future of intelligent machinesJeff Hawkins, the man who created the PalmPilot, Treo smart phone, and other handheld devices, has reshaped our relationship to computers. Now he stands ready to revolutionize both neuroscience and computing in one stroke, with a new understanding of intelligence itself.Hawkins develops a powerful theory of how the human brain works, explaining why computers are not intelligent and how, based on this new theory, we can finally build intelligent machines.The brain is not a computer, but a memory system that stores experiences in a way that reflects the true structure of the world, remembering sequences of events and their nested relationships and making predictions based on those memories. It is this memory-prediction system that forms the basis of intelligence, perception, creativity, and even consciousness.In an engaging style that will captivate audiences from the merely curious to the professional scientist, Hawkins shows how a clear understanding of how the brain works will make it possible for us to build intelligent machines, in silicon, that will exceed our human ability in surprising ways.Written with acclaimed science writer Sandra Blakeslee, On Intelligence promises to completely transfigure the possibilities of the technology age. It is a landmark book in its scope and clarity.",
        "Category": " Science , Physics , Atomic & Molecular",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Lizard Care from A to Z",
        "Authors": "By Bartlett, Richard D. and Bartlett, Patricia Pope",
        "Description": "The A stands for anoles, the Z for zonosaurs-and both potential and current lizard owners will find descriptions of many lizard species. To keep lizards active and healthy in captivity, owners need to know about each variety's habitat, diet, and special requirements. The authors provide all of this information, and much more. Color photos, drawings, glossary, and bibliography.",
        "Category": " Pets , Reptiles, Amphibians & Terrariums",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "A Concise History of Modern Painting, with 500 Plates",
        "Authors": "By Read, Herbert Edward",
        "Description": "",
        "Category": "",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Colorful World (FUN FLAPS)",
        "Authors": "By Foster, Rachael (CRT)",
        "Description": "Full of fun and surprises, this board book for babies will allow your child to explore the exciting world of colors and shapes. Pull back the flaps to reveal bursts of color. Associate colors with friendly shapes. With expressive baby phrases and entertaining noises that are enjoyable to read and stimulate talking, Fun Flaps are tuned into baby's developmental milestones, encouraging early conversation between the parent and child, and helps to develop language skills.",
        "Category": " Juvenile Nonfiction , Concepts , Colors",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "A Pony to Love",
        "Authors": "By Morgan, Mary (ILT), Morgan-Vanroyen, Mary (ILT), and Taylor-Butler, Christine",
        "Description": "With just a little imagination and this appealing story, horse-loving girls and boys will be off on a magical ride, galloping from sea to mountains on the backs of their friendly, gentle ponies. So many adventures await: prancing on the beach, trotting through fields of flowers, and showing off in the Big Top, a grand parade, and the rodeo, where they'll win best of show. And, at every moment, the pretty pictures capture the warm affection between child and animal. There's no better proof that \"with a pony to love, you can't go wrong.\"",
        "Category": " Juvenile Fiction , Animals , Horses",
        "Publisher": "Union Square Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Film Theory and Criticism: Introductory Readings",
        "Authors": "By Mast, Gerald",
        "Description": "Brought up to date with an expanded range of selections, extended historical coverage, and a dedicated pluralistic commitment, the third edition of this highly popular text on film aesthetics features major additions of contemporary topics in film theory--including psychoanalytic, feminist, and Marxist approaches--and new essays on television, horror films, and experimental movie making. Of the 53 selections, 13 are new. The section \"Kinds of Film\" has been retitled \"Film Genres\" and concentrates exclusively on the distinctions within a single type of film: classical Hollywood narrative cinema.  The final section, now called \"Film: Psychology, Society, and Ideology\" is substantially revised to take into account film's relationship to its consumers: how films shape or reflect cultural attitudes, reinforce or reject dominant modes of cultural thinking, and stimulate or frustrate people's needs and drives. Throughout the book chapter introductions have been rewritten to reflect today's concerns. Current and comprehensive, the book that The Journal of Aesthetics and Art Criticism called \"the best collection available on the disparate comments in the fields of film theory and criticism\" is now even better.",
        "Category": " Performing Arts , Film & Video , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Reading Comprehension, Grade 2 (Home Workbooks)",
        "Authors": "By",
        "Description": "Build essential skills while having fun with Home Workbooks! Each book measures 7\" x 9.25\" and is filled with 64 pages of age-appropriate activities, puzzles, and games. These teacher-approved books are perfect for extra practice at home or at school. They can even be used to build upon basic skills during school breaks or family vacations! 140 full-color stickers, an incentive chart to help parents or teachers track student progress, and easy-to-use pullout answer keys are also included. Home Workbooks are available for prekindergarten through grade 3 students, and feature titles in a wide variety of skill areas to suit any need.",
        "Category": " Education , Teaching Methods & Materials , Reading & Phonics",
        "Publisher": "Carson Dellosa Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Putting Amazing Back into Grace",
        "Authors": "By Horton, Michael Scott",
        "Description": "",
        "Category": "",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Florence & Tuscany (Eyewitness Travel Guides)",
        "Authors": "By Catling, Christopher",
        "Description": "",
        "Category": " Travel , Europe , Italy",
        "Publisher": "DK Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Michelin The Green Guide Germany (Michelin Green Guides)",
        "Authors": "By Michelin Travel Publications",
        "Description": "",
        "Category": " Travel , Europe , Germany",
        "Publisher": "Michelin Travel Publications",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Nobody Dies In A Casino (Worldwide Library Mysteries)",
        "Authors": "By Millhiser, Marlys",
        "Description": "A vacation in Las Vegas sounds great to stressed-out literary agent Charlie Greene, but when she witnesses a murder on the strip and falls in with a oddball group obsessed with Area 51, she gets a lot more than she had bargained for. Reprint.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Worldwide Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Chinese Cooking for Two",
        "Authors": "By ma, nancy",
        "Description": "",
        "Category": "",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Roles speakers play",
        "Authors": "By Humes, James C.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Frank Sinatra Reader",
        "Authors": "By Petkov, Steven (EDT) and Mustazza, Leonard (EDT)",
        "Description": "From the time he made hordes of hysterical fans swoon at the Paramount in 1942 up until the present day, Frank Sinatra has never been out of the public spotlight. With some 1,800 recordings, 60 film credits, two Oscars, numerous Grammys and a Grammy Legends Award, and the undying loyalty of millions of fans around the world, Sinatra has become an American hero. Songs sung by the Italian-American phenomenon, such as \"New York, New York,\" \"My Way,\"\"Fly Me to the Moon,\" and \"That's Life\" are now among the undisputed classics of American popular music. In The Frank Sinatra Reader, Leonard Mustazza and Steven Petkov have brought together for the first time a singular selection of writings about the famous singer that focuses on his music and his legendary voice. A unique anthology of reviews, photographs, and memoirs, many of them back in print for the first time in decades, this collection tells the story of Sinatra's extraordinary musical career from its inception to the present. We see Sinatra as a teen phenomenon and follow his rise and fall as a solo performer, his comeback as a mature recording artist with Capitol Records, and his reign as a powerful and influential personality in the '60s. Lastly, the book contemplates Sinatra's ability to endure and triumph in a changing musical world. Included among the prominent writers, musicians, and journalists that recount and applaud the star's progress through the twentieth century are Henry Pleasants, Arnold Shaw, Stephen Holden, Gay Talese, Whitney Balliet, Gene Lees, Bill Boggs, Will Friedwald, and William Kennedy. Readers will also find intimate recollections by writers who knew not only the musician but the man himself, such as those by Pete Hamill, Jonathan Schwartz, and Rosalind Russell. The editors provide introductions to each section, a selected discography, a complete filmography, as well as a biographical chronology of the author's life and a selected bibliography. In The Frank Sinatra Reader, the man and his music become inseparable as the reader develops a greater understanding and appreciation of both. Mustazza and Petkov have created an invaluable collection that both illuminates and reflects Sinatra's incredible impact on the American cultural landscape. It is a must read for all Sinatra fans and for anyone interested in popular music and culture.",
        "Category": " Business & Economics , Management",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Illustrations Unlimited: A Topical Collection of Hundreds of Stories, Quotations, & Humor",
        "Authors": "By Hewett, James S. (EDT)",
        "Description": "For added spice and color for sermons and articles, here are more than 1,700 anecdotes, quotations, stories, and proverbs for all occasions.",
        "Category": " Religion , Sermons , Christian",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Crafting for Dollars: Turn Your Hobby into Serious Cash",
        "Authors": "By Landman, Sylvia",
        "Description": "In this era of corporate downsizing and cost cutting, thousands of people are looking to home-based businesses for income and job security. For the creative person, a career in crafts can be both fulfilling and profitable. Professional craft designer and successful craft entrepreneur Sylvia Landman has written the definitive guide for those wishing to start or expand a home-based craft business. Crafting for Dollars is a step-by-step guide for woodworkers, quilters, knitters, and all other craftspeople wanting to establish an independent livelihood creating the crafts they love. It provides solid business guidelines and practical advice on establishing and maintaining a successful craft-based profession. Landman includes interviews with successful crafters who share their varied experiences in developing a business plan, organizing an efficient home office, and maximizing sales at craft fairs and trade shows. Among those profiled are: ·Bonnie Boots who sells doll patterns by mail-order ·Debi Linker who started a designer fashion fabric store in 1969, and now employs over 125 people ·Crochet enthusiast Gwen Blakely Kinsler who organized the First Annual Crochet Conference ·Joe and Kathy Lamancusa who built a strong marriage and business designing programs for craft manufacturers Landman describes the myriad roles a craft entrepreneur must play in order to keep a small business alive. She addresses some of the difficult situations that can arise when one works from home. Issues such as child care, distractions, and interruptions are all challenges that need to be recognized and handled with care. Also included are tips on how to separate personal and professional tasks within the home, and how to maintain creativity and motivation.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Bride of Fortune",
        "Authors": "By Henke, Shirl",
        "Description": "Wandering the world in search of a place to belong, war-weary mercenary Nicholas Fortune takes on the identity of another man and claims the man's wife, Mercedes Alvarado, who is valiantly struggling to survive the war and family scorn. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Martha Stewart Living Special Occasions",
        "Authors": "By Stewart, Martha",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Son of the Morning (Pocket Books Romance)",
        "Authors": "By Howard, Linda",
        "Description": "The New York Times bestselling author of Troublemaker and Heartbreaker delivers a heart-pounding and romantic thriller about a woman who must travel back in time to stop a ruthless killer—but can she also protect her heart from the irresistible, dark lover she finds there?Is it possible to unravel a convoluted mystery from the past…by living it? A scholar specializing in ancient manuscripts, Grace St. John never imagined that a cache of old documents she discovered was the missing link to a lost Celtic treasure. But as soon as she deciphers the legend of the Knights of the Templar—long fabled to hold the key to unlimited power—Grace becomes the target of a ruthless killer bent on abusing the coveted force. Determined to stop him, Grace needs the help of a warrior bound by duty to uphold the Templar’s secret for all eternity. But to find him, she must go back in time to fourteenth-century Scotland…and to Black Niall, a fierce man of dark fury and raw, unbridled desire. “A romantic time-travel thriller with a fascinating premise” (Publishers Weekly), Son of the Morning is perfect for fans of Pamela Clare and Karen Robards.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Dora's Christmas Parade (Dora the Explorer)",
        "Authors": "By Aikins, Dave (ILT) and Valdes, Leslie",
        "Description": "It's Christmastime, and Dora and Boots are celebrating Christmas with their families. But Dora's grandma is unable to come because she is not feeling well. Dora and Boots decide to use their Christmas presents -- soome new musical instruments -- and start a musical parade to Abuela's house, picking up Benny, Isa and Tico along the way!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Essential Theodore Roosevelt (Library of Freedom)",
        "Authors": "By Roosevelt, Theodore and Hunt, John Gabriel (EDT)",
        "Description": "Magnificent collection of the speeches and writings of this beloved American president, social reformer, and winner of the Nobel Peace Prize.  352 pages.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "The biggest job in the world: the American Presidency",
        "Authors": "By Reinfeld, Fred",
        "Description": "",
        "Category": "",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Cooking with Nora: Seasonal Menus from Restaurant Nora - Healthy, Light, Balanced, and Simple Food with Organic Ingredients",
        "Authors": "By Pouillon, Nora and Hayashi, Koji (PHT)",
        "Description": "Provides light and healthy recipes including soups, salads, main courses, and desserts",
        "Category": " Cooking , General",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "10.12",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    }
]