[
    {
        "Title": "Murder Walks the Plank (Death on Demand Mysteries, No. 15)",
        "Authors": "By Hart, Carolyn G.",
        "Description": "It's \"Corpse ahoy!\" when death takes a pleasure cruise -- as we set sail once more with that incomparable, crime-solving duo, the Darlings.Annie Darling, popular proprietress of the Death on Demand bookstore, has done it again! Her murder-mystery cruise in the waters off her not-always-idyllic isle of Broward's Rock is sure to be a roaring success, with every participant dressing up as a favorite fictional sleuth. And sure enough, everything goes swimmingly -- until one of the revelers plunges overboard. And despite hubby Max Darling's courageous rescue attempt, faux murder turns all too quickly into real-life death.  Over the next few days, the body count rises and Annie strongly suspects that all the victims were murdered most foully and that they are all connected in some unknown way. The trick now will be to prove it, with the able assistance of investigator-spouse Max, best friend and best customer Henny Brawley, local bestselling superstar Emma Lloyd, and even (surprise!) Annie's normally ditsy mother-in-law, Laurel.But what the intrepid crime solvers do not realize is that the killer they seek is more ingeniously efficient than most -- and the puzzle they wish to solve is, in reality, a time bomb packed with an explosive mix of arson, assault, kidnapping, robbery . . . and homicide, of course. One false step and Annie and her canny cohorts will be blown off Broward's Rock for good . . . and they'll sink like stones into the cold, briny deep.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Good News, Bad News",
        "Authors": "By Wolstencroft, David",
        "Description": "First, there's the good news: George and Charlie are on their last posting for the Agency before retiring from the spy game. But in this business, the bad news is never far away. And in this case, the bad news could not be worse. In the blink of an eye, these two friends become lethal enemies - until it occurs to them that some orders just aren't meant to be followed. The two are catapulted into a gauntlet of international espionage to uncover secrets that lie in the heart of the Agency - secrets that no one wants them to find. Using their spy tools against their old masters, George and Charlie live on their wits, fight for answers - and soon realize that the only people they can trust are each other. But in a world where no one is to be trusted, how much can you trust a fellow spy?",
        "Category": " Fiction , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Sight of the Stars : A Novel",
        "Authors": "By Plain, Belva",
        "Description": "New York Times bestselling author Belva Plain beguiles us once again with a novel that explores the bonds that sustain families—and the lies that can shatter them forever.  Sweeping through the pivotal events of twentieth-century America, The Sight of the Stars chronicles four generations of one remarkable family as they journey through years of love, loss, sacrifice, and unimaginable betrayal.Dressed in a brand-new suit, with one hundred and fifty dollars in his pocket, Adam Arnring says good-bye to his family and boards a train for the fabled West. The year is 1907. Adam is nineteen years old, a young man with stars in his eyes who has always dreamed of a future in the great open spaces of America. Now, far from his New Jersey home, he takes the first step toward attaining that dream, landing a job in a small department store in a booming Texas town. Here he meets a woman who excites him beyond all measure. The exquisite, untouchable Emma Rothirsch lives in a world whose doors are firmly closed to him. But Adam is a man willing to take great risks to get what he wants. One is Emma. The other is to build a lasting business enterprise that will live on through his children and grandchildren.  But just when Adam’s dreams are within reach, fate intervenes.  Tragedy strikes from the trenches of World War I, setting in motion a series of events that echo down through the years. The owner of a prospering department store and the head of a growing family, Adam succumbs to a moment of weakness that culminates in an unforgivable act of betrayal. And now, as another generation prepares to take its rightful place in the family’s legendary empire, the tenuous threads of the Arnrings’ past begin to unravel, revealing a shattering secret that reaches back nearly a century.  Across a teeming canvas of history, through world wars and the close of a century, The Sight of the Stars tells a deeply affecting story of family and forgiveness, guilt and redemption. Brimming with the emotional depth and moral complexity we have come to expect from this incomparable storyteller, The Sight of the Stars is about what happens when we dare to dream, and the moments that can change families forever.",
        "Category": " Fiction , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Senator for Sale: An Unauthorized Biography of Senator Bob Dole",
        "Authors": "By Hilton, Stanley G.",
        "Description": "How much do we actually know about that most familiar of political figures, Senator Bob Dole? In this remarkable biography, Stanley Hilton paints a disturbing portrait. Using his personal experiences as an aide to the senator and his insights as a lawyer and teacher, Hilton offers a number of surprising revelations, including: Dole's brokering for power and catering to a host of special-interest groups (most notably, his becoming a major tobacco industry batboy); his numerous violations of election financing laws; the senator's career-long habit of flip-flopping on virtually every major national issue (including his positions on Israel, Saddam Hussein, and affirmative action); his role as the architect of the two largest tax hikes in U.S. history; and Dole's link with David Owen, a former top aide, who served time in a federal prison.In this chilling portrait, Hilton exposes Dole's colossal political money machine, which generates contributions amounting to almost $500,000 a week. Senator for Sale compares Senator Dole to his role model and hero Richard Nixon, and traces the senator's career from his origins in Kansas to Capitol Hill. Finally, while celebrating Dole's acknowledged wit and intelligence, Senator for Sale speculates on what a Dole presidency would be like.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Atkins Shopping Guide: Indispensable Tips and Guidelines for Successfully Stocking Your Low-carb Kitchen",
        "Authors": "By Atkins Health & Medical Information Services (COR)",
        "Description": "This easy-to-use pocket guide, the ultimate shopping reference and an indispensable companion to the #1 New York Times bestseller Dr. Atkins’ New Diet Revolution, will show you which foods to buy and which to avoid as you follow the Atkins Nutritional Approach™— a celebrity-favorite diet perfect for losing weight before your wedding or to bounce back into shape post-baby, or if you just want to look and feel your best.What should I eat, and where can I find it?Which products are the most Atkins-friendly?Are there hidden dangers in seemingly \"acceptable\" foods?Now Food Shopping the Atkins Way is Easier Than Ever!Whether you&#39;re one of the millions already losing weight and feeling great thanks to the remarkable Atkins Nutritional Approach™ or you are just discovering the healthy benefits of a low-carb lifestyle, shopping for food need no longer be a daunting process.The Atkins Shopping Guide contains everything you must know to stock your pantry with the right foods, while avoiding products devoid of nutrients and full of sugar and white flour.With foods clearly arranged by category, this essential handbook takes you aisle-by-aisle through the supermarket, putting helpful information at your fingertips. It also provides useful pointers for shopping at \"superstores\" and natural foods retailers, all in a handy format portable enough to carry in your pocket or purse.So throw away that misguided food pyramid chart and stop counting fat grams and calories. With The Atkins Shopping Guide, confusion about the right way to eat will be a thing of the past, as you follow the proven Atkins path to healthy living!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Making & Selling Herbal Crafts: Tips, Techniques, Projects",
        "Authors": "By Nadeau, Alyce",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Scar Vegas: And Other Stories",
        "Authors": "By Paine, Tom",
        "Description": "Featuring ten stunning stories, Scar Vegas grips the reader with breathtaking, gut-wrenching, and relentlessly entertaining narratives set on a bedrock of piercing political consciousness and clear-eyed reportorial vision. From a teenage anarchist to a Marine Corps general, Tom Paine's passionate characters make the kind of heartbreaking decisions that crackle with moral-and spiritual-consequences. And with each story Paine displays his mastery of language and nuance, flowing effortlessly from drug culture dialect to the clipped English of a Romanian émigré. With stinging wit and unmatched skill, Tom Paine will \"startle you with the muscular vigor of his prose and the ability to tell a tale that sucks you in and won't let go from start to finish\" (Newsday).",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Four Seasons of the Chesapeake: Fall and Winter",
        "Authors": "By Hamer, Red",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Four Seasons Book Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "Projects for a Healthy Planet: Simple Environmental Experiments for Kids",
        "Authors": "By Levine, Shar, Grafton, Allison, and Chui, Terry (ILT)",
        "Description": "Simple and fun activities that inspire understanding and respect for the environment.  Discover what pollution is and what it does Learn how you can limit pollution through conservation and recycling Make your own environmentally friendly products  The activities in this book will show you things like how to make scratch-and-sniff paper, how to build your own greenhouse, and how to sprout seeds in old tea bags. Each activity is fun to read and is explained in step-by-step drawings that are easy to follow, and all materials are readily available household items.",
        "Category": " Juvenile Nonfiction , Science & Nature , Experiments & Projects",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Christmas With Norman Rockwell",
        "Authors": "By Kirk, John",
        "Description": "Capturing the warmth and nostalgia of the season, more than seventy-five paintings from the beloved American artist include family favorites spanning sixty years of Rockwell's career, along with commentary on the artist's life in a colorful keepsake volume.",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "TERRORISTS & NOVELISTS",
        "Authors": "By Johnson, Diane",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Reading America",
        "Authors": "By Donoghue, Denis",
        "Description": "Featuring essays and commentaries on American themes and American writers, this volume identifies and explores the central dynamic of American literature; the imperatives of a powerful national past vs. the subversions of an endlessly anarchic spirit",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Case studies in American industry (Introduction to economics series)",
        "Authors": "By Weiss, Leonard W.",
        "Description": "",
        "Category": "",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Community organizers and social planners;: A volume of case and illustrative materials (Community organization series)",
        "Authors": "By Ecklein, J.L., Lauffer, Armand",
        "Description": "",
        "Category": "",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Guts: The Seven Laws of Business That Made Chrysler the World's Hottest Car Company",
        "Authors": "By Lutz, Robert A.",
        "Description": "In May 7, 1998 Chrysler Corporation and Germany's Daimler-Benz (owner of Mercedes) shocked the business world by announcing their intention to merge. What led to this largest industrial merger of all time? How did Chrysler—which not too long ago needed government-backed loans in order to survive—transform itself into not just a partner coveted by Daimler (the gold standard of European car makers) but the most profitable car company in the world? And what does their mega-merger portend for consumers, governments, shareholders and workers around the world In Guts, Robert A. Lutz, the product-development genius and iconoclastic leader behind Chrysler's second renaissance, answers these questions and many, many more. With wit and a surprising frankness, Lutz tells how Chrysler in the early '90s recovered from a second near-death experience to go on and post record profits, emerging as Forbes magazine's \"Company of the Year.\" He credits this remarkable turnaround to Chrysler's having embraced (at his urging) a deliberately \"schizophrenic\" corporate culture: tough, buttoned-down financial controls coupled with a rock-the-boat, provocative, highly creative product development process. The marriage of these two gave birth to a large family of hit products, starting with the radical, hugely popular Dodge Viper sports car, whose creation Lutz here describes. Along the way, he propounds what he humorously calls \"Lutz's Immutable Laws of Business\"—seven controversial maxims meant to stand conventional business wisdom on its ear Guts explains how and why every organization must cultivate a \"split personality\" combining common sense with freewheeling creativity. It defines the leader's role in maintaining a healthy balance between the two. And it argues that a dynamic tension between them is the prime attribute that enables top-performing companies to introduce new products and achieve record profits This embracing of opposites is, to say the least, unusual in the corporate world. For Lutz, however, it is business and life—as usual. What else would you expect from a vegetarian who loves a good cigar, a high-achiever who didn't graduate from high school until he was 22, a former Marine fighter pilot whose \"Law of Life\" is a line from a Rolling Stones song? Add to these paradoxes the fact that Lutz, unlike many of his peers, got into the automobile business because he actually likes cars, and he emerges as the quintessential maverick. Cinderella success story, unorthodox business primer, portrait of an iconoclastic icon, Guts is many books in one, each supplying its own brand of informative, amusing, and entertaining reading LUTZ'S LAWS: The Customer Is Not Always Right The Primary Purpose of Business Is Not \"To Make Money\" When Everyone Else Is Doing It, DON'T! Too Much Quality Can Ruin You Financial Controls Are Bad Disruptive People Are An Asset Teamwork Isn't Always Good \"Bob Lutz is one of America's most imaginative and most insightful business leaders. He thinks way outside the box, and when he talks, everyone needs to listen.\"—Michael Hammer Coauthor, Reengineering the Corporatio \"Lutz has made Chrysler into the feistiest, and most profitable, automaker on the planet.\"—Steve Miller CEO, Waste Management Inc \"Listening to Lutz is like hearing a Viper engine come to life. It's raw and pure. He loves speed, whether it's related to cars, fighter jets, or change in an organization.\"—Kent Kresa Chief Executive Officer Northrop Grumman Corporatio \"Bob Lutz knows more about cars than anyone. And he knows more than anyone about fixing car companies . . . but what makes Bob unique is his extraordinary sense of self-confidence—call it guts—which has permitted him always to have fun doing the right thing. So, go get some Guts, and share the fun!\"—James P. Womack Author, The Machine That Changed the World, and President, Lean Enterprise Institut \"Original and daring in his actions, Bob Lutz has lived with big business problems and big mistakes to become a rare pioneering winner.\"—Donald E. Petersen Retired Chairman and CEO, Ford Motor Compan",
        "Category": " Business & Economics , Industries , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Richard III: England's Black Legend",
        "Authors": "By Seward, Desmond",
        "Description": "A biography of the controversial British monarch examines the evidence of his guilt in politically motivated murders, and attempts to portray his complex personality",
        "Category": " History , General",
        "Publisher": "Franklin Watts",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Baudolino",
        "Authors": "By Weaver, William (TRN) and Eco, Umberto",
        "Description": "It is April 1204, and Constantinople, the splendid capital of the Byzantine Empire, is being sacked and burned by the knights of the Fourth Crusade. Amid the carnage and confusion, one Baudolino saves a historian and high court official from certain death at the hands of the crusading warriors and proceeds to tell his own fantastical story.  Born a simple peasant in northern Italy, Baudolino has two major gifts-a talent for learning languages and a skill in telling lies. When still a boy he meets a foreign commander in the woods, charming him with his quick wit and lively mind. The commander-who proves to be Emperor Frederick Barbarossa-adopts Baudolino and sends him to the university in Paris, where he makes a number of fearless, adventurous friends. Spurred on by myths and their own reveries, this merry band sets out in search of Prester John, a legendary priest-king said to rule over a vast kingdom in the East-a phantasmagorical land of strange creatures with eyes on their shoulders and mouths on their stomachs, of eunuchs, unicorns, and lovely maidens.  With dazzling digressions, outrageous tricks, extraordinary feeling, and vicarious reflections on our postmodern age, this is Eco the storyteller at his brilliant best.",
        "Category": " Fiction , Literary",
        "Publisher": "HarperVia",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "This Boy's Life: A Memoir",
        "Authors": "By Wolff, Tobias",
        "Description": "In this unforgettable memoir of boyhood in the 1950s, we meet the young Toby Wolff, by turns tough and vulnerable, crafty and bumbling, and ultimately winning. Separated by divorce from his father and brother, Toby and his mother are constantly on the move. Between themselves they develop an almost telepathic trust that sees them through their wanderings from Florida to a small town in Washington State. Fighting for identity and self-respect against the unrelenting hostility of a new stepfather, Toby's growing up is at once poignant and comical. His various schemes--running away to Alaska, forging cheeks, and stealing cars--lead eventually to an act of outrageous self-invention that releases him into a new world of possibility.",
        "Category": "",
        "Publisher": "Perennial",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "You're the Boss",
        "Authors": "By Josefowitz, Natasha",
        "Description": "A noted management consultant offers a practical guide for new supervisors to the basics of effective management, discussing the importance of image and relationship with staff, personal management style, communication, productivity, time management, interview techniques, leadership qualities, and more",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "The Art of the Dessert: 350 Delightful Recipes with 50 Color Art Reproductions",
        "Authors": "By Lesberg",
        "Description": "",
        "Category": "",
        "Publisher": "Haddington House - a division of Peebles Press",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Truth About Work: Making a Life, Not a Living",
        "Authors": "By Harder, David",
        "Description": "",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Hci",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Goodness of Potatoes and Roots (Goodness Series)",
        "Authors": "By Midgley, John and Sidaway, Ian (ILT)",
        "Description": "Outlines the nutritional benefits of potatoes and other root vegetables and offers thirty recipes from cultures around the world featuring potatoes, carrots, turnips, and beets",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.33",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Sexual Life of Catherine M.",
        "Authors": "By Hunter, Adriana (TRN) and Millet, Catherine",
        "Description": "A national best-seller that was featured on such lists as The New York Times, the Los Angeles Times, The Washington Post, the San Francisco Chronicle, The Boston Globe, and Publishers Weekly, The Sexual Life of Catherine M. was the controversial sleeper hit of the year. Since her youth, Catherine Millet, the eminent editor of Art Press, has led an extraordinarily active and free sexual life -- from al fresco encounters in Italy to a gang bang on the edge of the Bois du Boulogne to a high-class orgy at a chichi Parisian restaurant. A graphic account of sex stripped of sentiment, of a life of physical gratification and a relentlessly honest look at the consequences -- both liberating and otherwise -- have created this candid, powerful, and deeply intelligent depiction of unfettered sexuality.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Congress: Keystone of the Washington Establishment, Revised Edition (Perspectives; 12)",
        "Authors": "By Fiorina, Morris P.",
        "Description": "This highly readable book makes a strong case that a Washington establishment does exist and that members of Congress are responsible for it. Fiorina’s description of the self-serving interconnections that have developed between Congress, bureaucrats, and citizens with special interests leads to provocative and disturbing conclusions about the way our political system works. First published in 1977, this greatly enlarged second edition discusses the new developments that have occurred over the past twelve years, provides supportive data through the 1988 election, and reveals Fiorina’s current thoughts on Congress and American politics.Reviews of the first edition:“A stimulating indictment of the role of Congress in perpetuating a triangle of self-interest: constituents want benefits at someone else’s expense; Congressmen, seeking reelection, try to oblige; bureaucrats want growth for their agencies and accordingly provide favors for Congressmen. The general welfare is ill-served.”—Foreign Affairs“A fascinating book . . . on the factors which keep members of Congress in office . . . . A tract that no student of Congress can afford to neglect.”—Eric M. Uslaner, American Political Science Review“Written with insight, originality, and verve.”—Washington Monthly",
        "Category": " Political Science , American Government , Legislative Branch",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Mothers and Daughters: Loving and Letting Go",
        "Authors": "By Bassoff, Evelyn, Ph.D.",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Diabetic Desserts",
        "Authors": "By Wedman-St. Louis, Betty and Wedman, Betty",
        "Description": "More than 80 delicious easy-to-follow recipes for cookies, cakes, pies, pastries, puddings, breads, and beverages, all within diabetes nutrition guidelines.",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "On the Day You Were Born",
        "Authors": "By Frasier, Debra",
        "Description": "In simple words and radiant collages, Debra Frasier celebrates the natural miracles of the earth and extends an exuberant welcome to each member of our human family. Accompanied by a detailed glossary explaining such natural phenomena as gravity, tides, and migration, this is an unforgettable book. “A book filled with reverence for the natural order of the world and the place of the individual in it.”--School Library Journal",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "Harcourt Brace",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Froggy's First Kiss",
        "Authors": "By Remkiewicz, Frank (ILT) and London, Jonathan",
        "Description": "Does Froggy have a girlfriend?He can't even think straight when she's around. When Frogilina smiles at him through the monkey bars, Froggy falls smack on his head-bonk! So with Valentine's Day just a week away, Froggy gets busy making an extra-special valentine. The fifth book about the irrepressible Froggy, this is sure to keep children giggling with delight.An IRA-CBC Children's Choice Book\"The narrative is smoothly written with rhythmic language and the repetition that young children love...A great read-aloud for Valentine's Day, or whenever love is in the air.\" —School Library Journal",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Wish",
        "Authors": "By Bellows, Melina Gerosa",
        "Description": "When your entire life has been one long search for that mysterious \"something\" that will finally make you happy and complete, what you want changes faster than the fashions in Vogue. But that doesn't mean you stop wishing, does it?This is Bella Grandelli's heartbreaking, hilarious, and seemingly hopeless quest-from her days as a pudgy, insecure eight-year-old in the seventies, to a Madonna-worshipping Notre Dame co-ed in the eighties, where she tries on boyfriends as if they're leg-warmers, to a martini-sipping entertainment journalist in the nineties. The only constant through her love-life chaos is her twin brother, Bobby, whose mysterious illness has been a source of both triumph and tragedy-no matter how hard Bella tries to wish him well. But it's only when her family faces a devastating crisis that she finally realizes the painful truth about herself and her life. And no one is more surprised than Bella herself when that journey leads her to the only person in the world who holds the key to her heart.",
        "Category": " Fiction , General",
        "Publisher": "NAL",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Saving America's Treasures",
        "Authors": "By Young, Dwight (EDT) and Block, Ira",
        "Description": "America's treasures come in all shapes and sizes. Tucked away in every corner of the nation, they literally embody the history of our country and our culture -- but all too often they languish forgotten, the priceless legacy of our past crumbling quietly, inexorably, irreplaceably away. \"As a nation,\" writes First Lady Hillary Rodham Clinton in her eloquent foreword, \"we have allowed too much of our heritage -- the places and objects that comprise the collective memory of America -- to deteriorate. Their preservation is our sacred trust.\"  At the heart of this important effort is Save America's Treasures, a partnership between the White House Millennium Council and the National Trust for Historic Preservation, nourished by countless ordinary citizens who have pitched in to help identify and reclaim hundreds of landmark artifacts, buildings, and sites. Taken together, they tell the story of America. This fascinating, vividly illustrated book is a wonderfully varied showcase of 47 treasures, carefully selected to display the extraordinary breadth of the project's scope and profiled in a concise text that captures its place in our national chronicle.  Each chapter features an essay by such prominent writers as Thomas Mallon, Francine Prose, and Ian Frazier, who explore the many facets of the American experience: politics and government, invention and industry, quiet congregations at prayer, and exuberant crowds at play. We visit San Esteban del Rey, the mission at the heart of what is thought to be the oldest continuously inhabited community in America, and the African Meeting House in Boston, where black Americans have worshiped for two centuries. In a Texas airfield hangar we ogle a glamour girl painted lovingly onto the sleek nose of a World War II-era bomber; in Florida, we gawk at the opulent Gulf Coast palazzo of circus impresario John Ringling; in New Jersey, we peer into the prolific world of Thomas Edison, whose West Orange laboratory is a living mirror of his fertile mind. Along with these highlighted landmarks, there's also a complete list of the more than 500 preservation projects gathered into Save America's Treasures.  In these pages, we find a remarkable portrait of America: her barns and lighthouses, her factories and fun houses, and above all, her people. Encompassing everything from the private papers of our Founding Fathers to Babe Ruth's personal scrapbooks, from the ancient cliff dwellings of Mesa Verde to Taliesin, home of our quintessentially modern architect, Frank Lloyd Wright, this evocative volume offers a glimpse of a marvelous but endangered legacy -- and a heartfelt call to safeguard our heritage before it vanishes forever.",
        "Category": " Antiques & Collectibles , Care & Restoration",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The perfect Christmas picture (An I can read book)",
        "Authors": "By Manushkin, Fran",
        "Description": "Mr. Green tries repeatedly to get perfect Christmas picture of his rambunctious family.The hapless Mr. Green has been determined to take the perfect family Christmas picture since spring, but all his efforts remain unsuccessfull and usually generate unintended calamity",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Barn",
        "Authors": "By Atwell, Debby",
        "Description": "Barn watches history unfold, from the Depression through the Vietnam War to the present day, dutifully serving its masters as a place for peace rallies and gatherings, a hobo camp, a site for business, a shelter for animals, and a symbol of the warmth of times past and what will become.",
        "Category": " Juvenile Fiction , Lifestyles , Country Life",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Dick: The Man Who Is President",
        "Authors": "By Nichols, John",
        "Description": "Here is the definitive portrait of the ultimate power broker by “the toughest, most in-your-face investigative reporter in the U.S.A.” (Greg Palast). Dick Cheney sets energy policy. He guided the nation into war with Iraq. And, working closely with Karl Rove, he oversees the political infrastructure that allows corporate interests and the religious right to control lawmaking, regulation, the selection of judges, and the development of foreign policy. As John Dean put it, “This page-turner closes the case: Cheney is our de facto president.”With an emboldened administration that has turned a thin victory into a renewed mandate—rewarding ideologues and purging dissenters—John Nichols’s question is more urgent than ever: can this nation survive four more years of Dick Cheney?The Rise and Rise of Richard B. Cheney draws on groundbreaking reporting—including exclusive interviews with Cheney’s college professors, Nelson Mandela, Gore Vidal, and political insiders.",
        "Category": " Political Science , General",
        "Publisher": "The New Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Richard Scarry's Bedtime Stories (Pictureback(R))",
        "Authors": "By Scarry, Richard",
        "Description": "Join Huckle Cat, Lowly Worm, and more in five funny stories from Richard Scarry, perfect for bedtime reading. Includes a sticker sheet! Make story time special with this fun-filled collection from the one and only Richard Scarry!",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "129.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "The Great Unraveling: Losing Our Way in the New Century",
        "Authors": "By Krugman, Paul R.",
        "Description": "No one has more authority to call the shots the way they really are than Paul Krugman, whose provocative New York Times columns are keenly followed by millions. One of the world's most respected economists, Krugman has been named America's most important columnist by the Washington Monthly and columnist of the year by Editor and Publisher magazine.In this long-awaited work containing Krugman's most influential columns along with new commentary, he chronicles how the boom economy unraveled: how exuberance gave way to pessimism, how the age of corporate heroes gave way to corporate scandals, how fiscal responsibility collapsed. From his account of the secret history of the California energy crisis to his devastating dissections of dishonesty in the Bush administration, Krugman tells the uncomfortable truth about how the United States lost its way. And he gives us the road map we will need to follow if we are to get the country back on track.",
        "Category": " Business & Economics , Economic History",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Rodin Museum",
        "Authors": "By Laurent, Monique",
        "Description": "",
        "Category": "",
        "Publisher": "HAZAN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Speeches of Adlai Stevenson (Stevenson: Speeches)",
        "Authors": "By Adlai E Stevenson, Debs Myers and Ralph Martin",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "13.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "Dinosaur!",
        "Authors": "By Norman, David",
        "Description": "Discusses dinosaurs, their life, death, and discovery, and describes the techniques used for making the TV series \"Dinosaurs!\"",
        "Category": " Science , General",
        "Publisher": "John Wiley & Sons, Inc.",
        "Price Starting With ($)": "14.44",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Great Food: Over 175 Recipes from Six of the World's Greatest Chef's",
        "Authors": "By n/a",
        "Description": "Presents recipes from the television program \"Great Food,\" including Antonio Carluccio's Italian feast, Ken Hom's hot wok, and Nick Nairn's wild harvest of Scotland",
        "Category": " Cooking , Regional & Ethnic , International",
        "Publisher": "West One Hundred Seventy Five",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Lost and Found",
        "Authors": "By Uzelac, Ellen",
        "Description": "",
        "Category": "",
        "Publisher": "Wrs Pub",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Why We Rule! 101 Great Reasons to Love Our Country",
        "Authors": "By Cohen, Rob and Wollock, David",
        "Description": "Plymouth Rock meets Kid Rock in Why We Rule! an irreverent and unabashedly patriotic celebration of the United States of America. Inspiring, educational, and almost as much fun as getting high and watching TV! Why do we love our country so much? We're the home of the free, the land of the brave, and the wacky inventors of everything from toilet paper to People magazine. Join us as we take one giant leap for mankind with lists, stats, and facts on:Rock 'n' RollFrom Elvis to Britney...the lindy hop to hip-hop!HollywoodThe best flicks, from Jaws to Deep Throat! InventionsThe internet, martinis, and the slinky!MedicinePioneers in kidney transplants and breast implants!EatsHome of hot apple pie, and hot pizza delivered in thirty minutes or less!Sexy ChicksFrom Angelina Jolie to the Statue of Liberty!#1In Nobel prizes, Olympic gold medals, and worldwide production of salt!If that's not enough, how about celebrating our entrepreneurial spirit, landing on the moon, hot-and-cold running showers, big national monuments, and oh, yeah...a little thing called freedom.",
        "Category": " Humor , Topic , Political",
        "Publisher": "It Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Holidays in Cross Stitch, 1988: The Vanessa-Ann Collection (VANESSA ANN'S HOLIDAYS IN CROSS-STITCH)",
        "Authors": "By Vanessa-Ann",
        "Description": "",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The pleasures of cross-stitch (Better homes and gardens books)",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corp",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "War Story",
        "Authors": "By Edelman, Gwen",
        "Description": "Kitty and Joseph meet in a bookstore in New York. She is thirty-two, an aspiring writer. He is sixty, a Viennese Jew, a famous playwright who has survived the Holocaust. In a faded bohemian hotel (a place, he tells her, for madmen and artists), they begin an obsessive and all-consuming affair.Night after night he spins stories for her, tales of prewar Vienna, his childhood in Amsterdam hiding from the Nazis, his literary triumphs, the endless wanderings from Vienna to Amsterdam, Palestine, Paris, New York. And he describes for her the countless women he has loved and left. One day, he tells her, he will leave her too.Many years later, as Kitty journeys by train from Paris to attend Joseph's funeral in Amsterdam, she remembers.",
        "Category": " Fiction , War & Military",
        "Publisher": "Riverhead Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Hashemite Kingdom of Jordan and the West Bank: A handbook (The Middle East confrontation states)",
        "Authors": "By Sinai, Anne and Pollack, Allen",
        "Description": "",
        "Category": "",
        "Publisher": "American Academic Association for Peace in the Middle East",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "Fireball: A Courtroom Drama",
        "Authors": "By Begam, Robert G.",
        "Description": "A courtroom battle envelops the top lawyers in the country after an explosion in a small Ohio town leaves dozens dead, hundreds injured, and property damage in the millions",
        "Category": " Fiction , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "Girl Talk",
        "Authors": "By Baggott, Julianna",
        "Description": "Lissy Jablonski was fifteen during the summer of 1985. That was the summer her father, a soft-spoken gynecologist, up and left her mother for a redheaded bank teller. The same summer Lissy and her mother disappeared from their quiet New Hampshire lives to have an adventure of their own amid a cast of unlikely characters, including a Valium-addicted ex-debutante and a suspected mobster. The summer the reliably comforting \"girl talks\" with her mother began to reveal startling secrets.  Now an almost-thirty-year-old advertising executive in Manhattan, faced with her father's imminent death and newly pregnant by her married ex-lover, an unmoored Lissy finds herself looking back across the years. Contending with her affections for an old flame and his doomed marriage to a Korean stripper named Kitty Hawk, as well as the tangible legacies of that unmentionable summer with her mother, she realizes that she has become more like her mother than she ever could have imagined.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Through Irish Eyes: A Visual Companion to Angela McCourt's Ireland",
        "Authors": "By McCourt, Malachy",
        "Description": "",
        "Category": " Travel , Europe , Ireland",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Wiener Dog Art: A Far Side Collection (Volume 15)",
        "Authors": "By Larson, Gary",
        "Description": "1990 FarWorks, Inc. All Rights Reserved. The Far Side and the Larson signature are registered trademarks of FarWorks, Inc.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "129.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "America's Working Women: A Documentary History-1600 to the Present",
        "Authors": "By Baxardall, Rosalyn",
        "Description": "Diaries, letters, essays, and other documents provide a comprehensive historical survey of working-class women, from the period of early settlement to the recent economic crisis. Bibliogs",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1976"
        }
    },
    {
        "Title": "The Third Garfield Treasury!",
        "Authors": "By Davis, Jim",
        "Description": "The perfect holiday gift for fans of the world’s favorite fat cat!It's the third of the best of Garfield. You know him, you love him, you can't get enough, so here he is, collected in one glorious volume of irrascible lovability. Garfield weighs in for fun and tips the scales of laughter once again!",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Women Who Hurt Themselves: A Book Of Hope And Understanding",
        "Authors": "By Miller, Dusty",
        "Description": "Many books have described victims of rape and battering, but scant attention has been paid to another form of harm increasingly common among women. Here at last is a book that provides help for the thousands of women who secretly inflict violence on themselves. Filled with moving stories, this powerful and compassionate book is the first to focus on women who harm themselves through self-mutilation, compulsive cosmetic surgeries, eating disorders, and other forms of chronic injury to the body.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Natural Pharmacist: Everything You Need to Know About Arthritis",
        "Authors": "By Hobbs, Ron, Bucco, Gloria, and Barton, Anna M.",
        "Description": "Discover Nature's Treatment for ArthritisDid you know that there are natural treatments that may ease—or help you manage—the pain of arthritis? If you are one of the millions who suffer from chronic joint pain, this book can point the way to alternative treatments that may improve mobility and reduce the pain of osteoarthritis and rheumatoid arthritis.Inside you'll learn how glucosamine may help reduce arthritis symptoms, what natural treatments may slow the progression of osteoarthritis, which herbs and nutrients may help manage your arthritis, natural ways to improve mobility, and much more! Includes up-to-date information on arthritis and: ·Glucosamine ·Chrondroitin ·SAMe ·Fish Oil ·Devil's Claw ·Boswellia ·Bromelain ·Turmeric ·Boron ·Capsaicin ·Willow Bark ·Vitamin C ·Vitamin E ·Ginger ·Beta-Carotene ·Pantothenic Acid ·Selenium ·And conventional medical treatmentsIt's all here in simple, straightforward language. You'll find yourself turning to this helpful, trusted companion again and again.",
        "Category": " Health & Fitness , Naturopathy",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Five Little Pumpkins (Harper Growing Tree)",
        "Authors": "By Yaccarino, Dan",
        "Description": "A wickedly fun rhyming treat! With bouncy, rhyming text in verse from the classic nursery rhyme and bold, dynamic illustrations from acclaimed author-illustrator Dan Yaccarino, Five Little Pumpkins is a must-have Halloween board book!Roll along with the pumpkins and their spooky friends as they get into some spirited Halloween fun. The perfect gift for little pumpkins everywhere.Five Little Pumpkins sitting on a gate.The first one said, “Oh my, it’s getting late!”",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Dugan Under Ground: A Novel",
        "Authors": "By De Haven, Tom",
        "Description": "In This Issue: Sex! Drugs! Kosmic Trooths! And a Comic Book Rebel Named Looby!In his earlier novels, Funny Papers and Derby Dugan's Depression Funnies, Tom De Haven embarked on a dazzling tour of twentieth-century America, revealed through the world of the comic strips and their creators. Now in Dugan Under Ground, he transports us to explosive underground comics scene of the sixties.It's 1967, the Summer of Love. Roy Looby, a gifted young cartoonist, deserts his mentor, the legendary strip man Ed Biggs, and heads to join the drop-outs and musicians in San Francisco's Haight Ashbury. In the reckless spirit of the times, Looby creates \"The Imp Eugene,\" a libidinous comic book character who is a far cry from Biggs' signature figure, Derby Dugan--the cheerful icon of a more optimistic generation.  Just like his real-world counterpart, hippie cartoonist R. Crumb, Looby is soon celebrated and vilified for his creation.  And then he disappears, rumored to have lost his mind during the drug-fueled creation of a cartoon masterpiece.A fabulous, strange trip across a wildly changing America, Dugan Under Ground is a rich, inventive tale about the suffocations of jealousy, the regrets that kill the spirit, and the mythic qualities of American popular culture.",
        "Category": " Fiction , Humorous",
        "Publisher": "Metropolitan Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "And My Shoes Keep Walking Back to You",
        "Authors": "By Goldmark, Kathi Kamen",
        "Description": "\"Smashing...the characters are unforgettable\" raves Amy Tan; \"funny, authentic, and moving\" says Dave Barry; \"the female Kinky Friedman has arrived\" lauds Olivia Goldsmith. This hilarious, fast-paced novel about musicians, love, and family is the literary debut of Kathi Kamen Goldmark, founder of the Rock Bottom Remainders, the publishing industrys hottest band. The tale follows sexy Sarah Jean Pixlie as she catapults from struggling back-up singer to blazing star on the country music scene. Along the way, she pours out her irreverent, savvy soul in the delicious, humorous lyrics to more than a dozen original songs, including \"Put Me on the Guest List (To Your Heart),\" \"Hell on Heels,\" and \"My Baby Used to Hold Me (Now He's Putting Me on Hold).\" Witty and fresh, this romp is a great performance on stage and on the page.",
        "Category": " Fiction , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "The Saints and Sinners of Okay County",
        "Authors": "By Dunbar, Dayna",
        "Description": "In the tradition of Fannie Flagg and Lorna Landvik, The Saints and Sinners of Okay County is a heartfelt and compelling debut novel with an unforgettable heroine. It’s the story of a woman whose ability to see the futures of others leads her right back into her own troubled past.It’s the summer of 1976, and it seems like the entire state of Oklahoma is celebrating America’s bicentennial. But in the small town of Okay, Aletta Honor has much more on her mind than flags and fireworks. She’s pregnant with her fourth child and hasn’t seen her husband, Jimmy, in weeks. Although she can guess where the hound dog has parked his red-white-and-blue van—in front of the local gin mill or outside the home of yet another woman for a little Yankee Doodle Diddle. Discretion is not in the man’s constitution.Flat broke and desperate for some cash, Aletta decides to set up a food stand on the front lawn during the Okay Czech Festival. But when a woman touches her hand in sympathy, Aletta is completely unsettled. She never touches anyone outside her family—if she does, she gets overwhelming visions of their lives and futures. It started when she was a young girl and has scared her ever since. Now Aletta immediately sees the woman in a tragic accident, and gives her a warning that will save her life. When the woman returns the next day to thank her, Aletta figures out how to save her own life. With all the courage she can muster—figuring the townsfolk will most likely think she’s nuts—she puts a sign in the front yard: ALETTA HONOR. PSYCHIC READER. DROP-INS WELCOME. But doing readings for people opens a door she thought she had locked long ago, as memories of a terrible event come flooding back. She may not be able to see into her future, but she realizes she must face the demons in her past if she’s going to make a new life for herself and her kids. First, though, she’ll have to tell a few fortunes. . . .Poignant, touching, and full of the kind of wisdom that can only come straight out of the heartland, Dayna Dunbar’s The Saints and Sinners of Okay County is a wonderful novel of a woman who confronts pain in order to reclaim her belief in herself, lay her past to rest, and bring order back to a life that has veered too far off track.",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "A Hundred and One Days: A Baghdad Journal",
        "Authors": "By Seierstad, Asne and Christophersen, Ingrid (TRN)",
        "Description": "From January until April 2003—for one hundred and one days—Åsne Seierstad worked as a reporter in Bagdad for Scandinavian, German, and Dutch media. Through her articles and live television coverage she reported on the events in Iraq before, during, and after the attacks by the American and British forces.But Seierstad was after a story far less obvious than the military invasion. From the moment she arrived in Baghdad Seierstad was determined to understand the modern secrets of an ancient place and to find out how the Iraqi people really live. In A Hundred and One Days, she introduces us to daily life under the constant threat of attack—first from the Iraqi government and later from American bombs. Moving from the deafening silence of life under Hussein to the explosions that destroyed the power supply, the water supply, and security, Seierstad sets out to discover: What happens to people when the dam bursts? What do they choose to say when they can suddenly say what they like? What do they miss most when their world changes overnight?Displaying the novelist’s eye and lyrical storytelling that have won her awards around the world, Seierstad here brings to life an unforgettable cast of characters to tell the stories we never see on the evening news. The only woman in the world to cover both the fall of Kabul in 2001 and the bombings of Baghdad in 2003, Åsne Seierstad has redefined war reporting with her mesmerizing book.",
        "Category": " Political Science , Political Ideologies , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Real State Of The Union: From The Best Minds In America, Bold Solutions To The Problems Politicians Dare Not Address (New America Books)",
        "Authors": "By Halstead, Ted (EDT)",
        "Description": "Resulting from a collaboration between The Atlantic Monthly magazine and the New America Foundation, The Real State of the Union features 18 original essays on the most important facets of our national well-being. Written by many of our nation's most insightful observers, the essays provide an objective and penetrating analysis of the most critical challenges facing America as well as innovative solutions to many of them.The State of the Union Address is among the nation's oldest rituals, but one that has deviated from its original purpose: Rather than a candid assessment of the country or a meaningful self-evaluation by the current administration, it has become a political spectacle marked by self-congratulation and spin. The Real State of the Union seeks to turn an empty exercise into a more meaningful national dialogue about the social, political, and economic health of our country. Rejecting the political correctness of both parties, this volume tells the American public what it needs to know about the real problems that plague the country and why the political solutions that are offered too often fail to address the real nature of those problems.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Crewel Needlepoint World",
        "Authors": "By Donnelly, Barbara H.",
        "Description": "",
        "Category": "",
        "Publisher": "Morgan & Morgan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Another Song About the King: A Novel (Ballantine Reader's Circle)",
        "Authors": "By Stern, Kathryn",
        "Description": "\"You were named for Elvis. . . .  Darlin', did you hear me? You were named for Elvis Presley. Not even your father knows that. Wouldn't you like to share a secret, just you and me?\"                Simone \"Mimi\" Page once dated Elvis--and will never let her daughter forget it. Though Silvie grew up in the shadow of the King, it was her mother's unfulfilled life that really darkened her childhood. Flamboyant and passionate, with a southerner's flair for colorful stories, Mimi could inspire Silvie like no one else. Nothing is worse than being ordinary were words she pounded daily into young Silvie's mind. But too much success, too much talent, too much Being Somebody--even when that Somebody was her own daughter--could stir up a torrent of envy that Silvie would come to know too well. Determined to escape her mother's long reach, Silvie moves to New York to become an artist--something Mimi has always aspired to be. But even when her career takes off and she meets a wonderful man, Silvie finds her complicated relationship with her mother remains a forceful tide, pulling at her dreams and sense of self. Silvie has nearly given up on reconciling with her past. Then a family crisis draws her back home--and she discovers what Elvis was really all about. . . .",
        "Category": " Fiction , Psychological",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Asafetida: that was my bag",
        "Authors": "By Hobrock, Peg Masters",
        "Description": "",
        "Category": "",
        "Publisher": "Dorrance",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Glass Art: The Easy Way to a Stained Glass Look",
        "Authors": "By PLAID",
        "Description": "",
        "Category": " Crafts & Hobbies , Glass & Glassware",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Boomer's Big Day: (Dog Books for Kids, Puppy Dog Book, Children's Book About Dogs)",
        "Authors": "By McGeorge, Constance W. and Whyte, Mary (ILT)",
        "Description": "Boomer's ready for his morning walk. Here's his leash. There's the door. But try as he might, he can't get anyone to pay attention to him. The humans in the house don't rush out the door after breakfast as they normally do. And, most confusing of all, strangers arrive to pack all the things in Boomer's house into boxes. There's definitely something unusual going on.The simple text and heartwarming pictures charmingly depict Boomer's confusion, anxiety, concern, and ultimate delight on this day familiar to allmoving day.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Detective",
        "Authors": "By hailey, arthur",
        "Description": "Hours before he is due to set off on a long-delayed and much-deserved vacation with his wife and son, Det.-Sgt. Malcolm Ainslie takes a phone call he would have been better off ignoring. The caller is the chaplain at Florida State Prison, delivering a message from Elroy Doil, the serial murderer Ainslie helped put on the prison's death row. On the eve of his execution, Doil has asked to make a confession. But there is a condition: he will deliver it only in person to Ainslie.Ainslie has no choice. Doil was convicted of a double murder, but he was suspected in ten more. No homicide detective could turn down the opportunity to close ten murder cases in a single night. What Ainslie learns from the condemned man, however, propels the ex-priest-turned-cop into an investigation that reaches into the most elite levels of his own department and the Miami city government. And it tests as never before his skills as a cop and his character as a man.Master storyteller Arthur Hailey is legendary for the scrupulously researched authenticity and electrifying realism of his novels, for taking readers inside the places where men and women endure and sometimes crack under the pressures of jobs that shape our lives and world. Bristling with the sights, sounds, and true-to-life details of a contemporary urban homicide division, and with all the narrative suspense that has made him one of the best-selling fiction writers of our time, Detective is the novel Arthur Hailey was destined to write.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Operations Research",
        "Authors": "By Hillier, Frederick S.",
        "Description": "",
        "Category": "",
        "Publisher": "Holden Day",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "February",
            "Year": "1975"
        }
    },
    {
        "Title": "Be your own caterer",
        "Authors": "By Cannon, Trudy",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Along wit's trail: The humor and wisdom of Ronald Reagan",
        "Authors": "By Troxler, William (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Illustrated Who's Who of the Cinema",
        "Authors": "By Lloyd, Ann and Fuller, G.",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "7.88",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "From the Revolution Through the Age of Jackson: Innocence and Empire in the Young Republic",
        "Authors": "By Howe, John R.",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1973"
        }
    },
    {
        "Title": "Dear Wit: Letters from the World's Wits",
        "Authors": "By Lang, H. Jack",
        "Description": "Presents a collection of letters written by Balzac, Twain, Wilde, Wodehouse, Churchill, Mencken, Shaw, Groucho Marx, and other luminaries",
        "Category": "",
        "Publisher": "Prentice Hall General",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Women on Divorce: A Bedside Companion",
        "Authors": "By Austin-Smith, Vicki (EDT), Kaganoff, Penny (EDT), and Spano, Susan (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Winning Styles Cookbook",
        "Authors": "By Jeffords, Elin",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Feeding Frenzy, Inc.",
        "Price Starting With ($)": "8.17",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Society and education",
        "Authors": "By Levine, Daniel U.",
        "Description": "",
        "Category": "",
        "Publisher": "Allyn and Bacon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Listening to the Page",
        "Authors": "By Cheuse, Alan",
        "Description": "Not how to get the message on your beeper. Fiction writer, critic, and radio book commentator Cheuse collects 21 essays and an interview with him, most previously published, looking back at the thousands of books he has read, reviewed, and loved. He clearly distinguishes between ancient and modern literature, and among the contemporary literatures of various cultures. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Columbia University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Land of the Free: What Makes Americans Different",
        "Authors": "By Codrescu, Andrei, Graham, David, and Graham, David (PHT)",
        "Description": "Take an Elvis impersonator, a Ben Franklin look-a-like and a circus animal trainer and what do you get? Just a few of the colorfully entertaining portraits created by one of America's favorite photographers and humorists, David Graham, in Land of the Free: What Makes Americans Different. A tireless traveler and a natural-born storyteller, Graham has photographed ordinary folks in their homes, at work, and at play across the nation—from his native Pennsylvania to New Mexico, and many places in between. Circus trainers, farmers, fishermen, and folks on vacation all captured on film, and all capturing the vibrant essence of being unique.Accompanied by the wry insights of National Public Radio commentator and author Andrei Codrescu, Land of the Free showcases the figures that give America its character--from the amusing portraits of celebrity look-a-likes Bette Davis, Marilyn Monroe, and Elvis--to the stately poses of historical legends Ben Franklin, Christopher Columbus, and George Washington--to the lively real-life characters in-between.",
        "Category": " Photography , Individual Photographers , General",
        "Publisher": "Aperture",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "The Mammoth Book of Eyewitness Everest: Marking the 50th Anniversary of the Ascent of Everest, 32 Firsthand Accounts of the Most Memorable Climbs (Mammoth Books)",
        "Authors": "By Lewis, Jon E. (EDT) and Scott, Doug (FRW)",
        "Description": "The Mammoth Book of Eyewitness Everest celebrates the spirit to mount the ultimate peak??Because,” as George Mallory famously summed up, ?it is there.” This new anthology encompasses the assaults on Everest from the beginnings in 1921, through Sir Edmund Hillary’s achievement in 1953, to the notorious 1996 ?extreme-tourism” disaster caught so memorably in Jon Krakauer’s Into Thin Air. There are the legendary climbs of Mallory, Irvine’s tragic disappearance, Hillary and Tenzing Norgay’s 1953 first ascent, and Reinhold Messner’s solo ascent?without the use of oxygen tanks?in 1980. There are also such electrifying tales by Mallory on surviving an avalanche in 1922, and Jon Krakauer on the 1996 disasters, plus more stories from ?the roof of the world” by such climber-writers as Eric Shipton, Tom Hornbein, Frank Smythe, Bill Tilman, Wilfred Noyce, Walt Unsworth, and many more.",
        "Category": " Sports & Recreation , Horse Racing",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Noah's Ark",
        "Authors": "By Spier, Peter",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Christianity",
        "Publisher": "Doubleday Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "Geraldine's Blanket",
        "Authors": "By Keller, Holly",
        "Description": "Geraldine loves her baby blanket. Trouble is, she's no baby, and her blanket is old and tattered. \"It looks silly,\" says her mother. \"There's hardly any blanket left,\"says her father. But geraldine refuses to part with her old friend. Will a new doll from Aunt Bessie at Christmas change her mind?",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Kid-O-Rama",
        "Authors": "By Stoltz, Craig, Epstein, Noel, Kelly, John F.",
        "Description": "",
        "Category": "",
        "Publisher": "Washington Post Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Do We Still Need Doctors? (Reflective Bioethics)",
        "Authors": "By Lantos, John D.",
        "Description": "Written with poignancy and compassion, Do We Still Need Doctors? is a personal account from the front lines of the moral and political battles that are reshaping America's health care system.",
        "Category": " Medical , Ethics",
        "Publisher": "Routledge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Austrian Example.",
        "Authors": "By Waldheim, Kurt",
        "Description": "",
        "Category": "",
        "Publisher": "MacMillan Publishing Company.",
        "Price Starting With ($)": "8.14",
        "Publish Date": {
            "Month": "June",
            "Year": "1973"
        }
    },
    {
        "Title": "The Golf Doctor: How to Play a Better, Healthier Round of Golf",
        "Authors": "By Dennis, Larry and Mallon, Bill",
        "Description": "Dr. Bill Mallon has been advising golfers how to get the most out of their game despite nagging injuries, health problems, or weather concerns for ten years through his column, \"Ask the Doctor\" in Golf Digest. Now his helpful tips and good advice are gathered in one volume and accompanied by photos that show how to break bad habits and begin a program to improve your game. He examines which pro golfers have injuries and how they play through successfully; how your equipment may be hurting your game; how to hit the ball farther; exercises for your aching back, shoulder, knee, wrist, hand, or elbow; and how to overcome and play with special health problems, and much more.A practicing orthopedist specializing in sports medicine, Dr. Bill Mallon was also a professional golfer until injuries cut short his career. The Golf Doctor combines his medical and golf experience to help every golfer play a healthier round.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Keeping Passover: Everything You Need to Know to Bring the Ancient Tradition to Life and Create Yo",
        "Authors": "By Steingroot, Ira",
        "Description": "\"Although the idea of 'keeping Passover' has too often come to mean the strict observance of an unending string of ordinances, decrees, rules, regulations, testimonies, precepts, laws, and statutes, it can as well mean the safekeeping of something precious and worth preserving. Tradition should be like the ballast that keeps a ship steady in an ocean of constant stormy change.\"From one of the nation's leading Haggadah experts comes the ultimate guide to creating a faithful and personal seder celebration. Emphasizing \"thou may\" instead of \"thou shalt,\" Steingroot presents all the traditional and alternative options. Keeping Passover explores:the meaning of the Passover symbolshow to choose the right Haggadahfood, cookbooks, and table arrangementsmusic, recordings, and learning to sing the songsways to involve childrenthe art of keeping Passover fresh every yearKeeping Passover is a much needed and highly accessible resource offering a rich assortment of methods -- from simple to elaborate, traditional to innovative -- to enhance, preserve, and celebrate the seder.",
        "Category": " Religion , Judaism , Rituals & Practice",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Macroeconomics",
        "Authors": "By Dornbusch, Rudiger",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The McGraw-Hill High-Speed LANs Handbook (McGraw-Hill Series on Computer Communications)",
        "Authors": "By Saunders, Stephen",
        "Description": "If you're a network manager or designer, this surefire guide will enable you to make informed decisions about all of the high-speed LANs available now or coming soon. Written by the LAN expert at Data Communications magazine, the book examines all eight of the standards-based high speed LAN technologies, as well as the five proprietary switching technologies that can be added to low-speed LANs in order to boost performance. You'll find a precise definition of each high-speed LAN technology, an analysis of their effectiveness and cost, as well as cross-comparisons of their strengths and weaknesses.This indispensable reference tool covers eight high-speed LAN Standards: ATM, FDDI, FDDI II, Fibre Channel, HIPPI, IsoEnet, 100Base-T (Fast Ethernet), and 100VG-AnyLAN; Ethernet switches, Token Ring switches, FDDI switches, 100Base-T switches, and 100 VG-AnyLAN switches; all the information required to cope with bandwidth crisis on your LAN; and reliable guidance on designing and implementing LANs.Filled with many helpful illustrations, this unique reference will show you how to choose the high speed LAN that's right for your network - and avoid potential pitfalls on the path to higher performance.",
        "Category": " Computers , General",
        "Publisher": "McGraw-Hill Companies",
        "Price Starting With ($)": "23.38",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Sonet",
        "Authors": "By Goralski, Walter",
        "Description": "UP-TO-DATE GUIDE TO SONETOriginally intended for use in broadband ISDN and ATM networks, SONET has taken on a life of its own as more telcos and other carriers deploy SONET fiber to support leased line services. Experts predict most publicnetworks will soon be close to 100% SONET/SDH. Get ready with SONET, Second Edition, by Walter Goralski. This new edition of the industry leader brings you up to speed on this fast-moving technology, from an introduction to fiber optics and SONET, a clear explanation of how SONET works, SONET network equipment, deployment and services,to its state-of-the-art treatment of WDM and DWDM (Wave Division Multiplexing) and SONET. You get:*Full-scale coverage of IP packets directly on a SONET transport, and direct-to-fiber interfaces without SONET*Examples of SONET deployments and full details on how they were accomplished*Details on SONET vendors, with analysis of available products*Hands-on treatment of how to implement SDH, the European standard*More!",
        "Category": " Computers , Reference",
        "Publisher": "McGraw-Hill Companies",
        "Price Starting With ($)": "7.12",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Solutions to Exercises",
        "Authors": "By WILSON ET AL",
        "Description": "",
        "Category": "",
        "Publisher": "Pearson Higher Education",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "American Tongue",
        "Authors": "By Quinn, Jim",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1982"
        }
    },
    {
        "Title": "Step Lightly: Poems for the Journey",
        "Authors": "By Willard, Nancy",
        "Description": "The poems in this collection come from Nancy Willard's cardboard boxes--she's collected them to accompany her on her journey through life, and she hopes young people will take them along on their own adventures. Works by well-known poets--Elizabeth Bishop, e. e. cummings, Emily Dickinson, and Wallace Stevens--are gathered here, along with verse from lesser known writers from other countries and other times.  All of the poems in Step Lightly share a common readability, and the spark of joy that caught a remarkable poet's eye.",
        "Category": " Young Adult Nonfiction , Poetry",
        "Publisher": "Graphia",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Meri's Dream",
        "Authors": "By Jewell, Jan Albach",
        "Description": "",
        "Category": "",
        "Publisher": "Birthday Express",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Sedgewood Book of Baking",
        "Authors": "By SEDGEWOOD PRESS",
        "Description": "",
        "Category": "",
        "Publisher": "Sedgewood Press",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "ENTERTAINING DESSERTS",
        "Authors": "By Pirie, Deirdre and Wallach, Louis (ILT)",
        "Description": "Provides two hundred recipes for cakes, tortes, roulades, tarts, pies, meringues, mousses, ice creams, souffles, and other treats",
        "Category": " Cooking , Entertaining",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "7.0",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "The Story and Its Writer: An Introduction to Short Fiction",
        "Authors": "By Charters, Ann",
        "Description": "",
        "Category": "",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Power Trip: U.S. Unilateralism and Global Strategy After September 11 (Open Media Series)",
        "Authors": "By Feffer, John (EDT)",
        "Description": "A concise dissection of the new U.S. unilateralism, Power Trip is the first book-length critique of this fundamental shift in U.S. foreign policy to consolidate and extend U.S. global control. Charting the new terrain of foreign policy after September 11 and demonstrating how the Bush administration is building on the policies of its successors, here are Barbara Ehrenreich, William Hartung, Ahmed Rashid, Michael Ratner, Noy Thrupkaew, Coletta Youngers, Mark Weisbrot, and their contemporaries on the Bush administration and its flawed ambition to control the world.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Natural Healthcare For Women",
        "Authors": "By Viagas, Belinda Grant",
        "Description": "Offers advice on staying healthy and treating specific conditions throughout a woman's life, from puberty, through sexual maturity and childbearing, to menopause and aging",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Old Hat New Hat",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "Illus. in full color. \"Out shopping, the Bears look at frilly and silly hats, bumpy and lumpy ones. Offers slapstick humor and simple concepts of sizes and shape.\"--School Library Journal.",
        "Category": " Juvenile Fiction , Clothing & Dress",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "States of Mind: A Personal Journey Through the Mid-Atlantic",
        "Authors": "By Yardley, Jonathan and Geterhs, Peter (EDT)",
        "Description": "Alone among the principal regions of the United States, the Mid-Atlantic suffers from an identity problem. Think of the South and you think at once of grits, the Civil War, and magnolias. The same applies to the Northeast (Boston baked beans, town meetings), the Midwest (the Mississippi River, corn as high as an elephant's eye), and West (John Wayne, hot tubs). But think of the Mid-Atlantic and you're likely to draw a blank.Is that fair? Does the Mid-Atlantic really possess no singular qualities? After all, it's the site of the nation's capital and of seven substantial states, each of which has its own history, geography, and culture. Doesn't this region have its own characteristics and quirks, ones that are distinctly and uniquely Mid-Atlantic in flavor?That's the question Jonathan Yardley, Pulitzer Prize-winning book critic, columnist, and native of the Mid-Atlantic, sets out to answer. In States of Mind he paints a new and surprising portrait of this previously unrecognized region, bringing out the true colors of these states in the middle, revealing their charms, their flaws, and their personalities.Starting in his adopted hometown of Baltimore, Yardley drives his high-performance all-American automobile to and through New Jersey, Pennsylvania, Delaware, Maryland, Virginia, North Carolina, West Virginia, and Washington, D.C., a journey that enables him to capture - in the distinctive style that has made him one of the most respected newspaper writers in the country today - the essence of the Mid-Atlantic, a microcosm of the nation itself.During his travels he says farewell to Memorial Stadium in Baltimore and hello to its celebrated successor, Oriole Park at Camden Yards; visits Frank Lloyd Wright's house, Fallingwater, in the Laurel Mountains of Pennsylvania; attends a reunion at his beloved alma mater, the University of North Carolina at Chapel Hill; gives a comparison test to the region's most famous mountain resorts, the Homestead Inn in Virginia, and its rival in turn-of-the-century splendor, the Greenbrier in West Virginia. He stops in, grudgingly, at Williamsburg, \"home of crass commercialism\"; searches for his grandparents' grave in Philadelphia; and enjoys the singular pleasure of seeing his family's name plastered all over Yardley, Pennsylvania. The author visits the birthplaces of much of America's history, and goes to the centers of much of its present - malls, outlet stores, and fast-food restaurants. He also spends a lot of time stuck in traffic on unsightly, crowded highways, musing in his curmudgeonly way about the modern world and its dubious delights.It's a journey that takes him many places, including one he had not expected to find. The reader will share his surprise and delight in this, his final discovery.",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Son of It Was a Dark and Stormy Night (Bulwer-Lytton Contest)",
        "Authors": "By Rice, Scott",
        "Description": "Includes an all-new selection of the most awful opening sentences for nonexistent novels ever to appear in print from the Bulwer-Lytton Fiction contests of the last two years",
        "Category": " Humor , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "The Living World",
        "Authors": "By Farino, Teresa",
        "Description": "",
        "Category": "",
        "Publisher": "Bdd Promotional Book Co",
        "Price Starting With ($)": "9.31",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    }
]