[
    {
        "Title": "Joy of Scrapbooking (Leisure Arts #108711)",
        "Authors": "By Bearnson, Lisa",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Leisure Arts, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Baby Names Made Easy: The Complete Reverse-Dictionary of Baby Names",
        "Authors": "By Barden, Amanda Elizabeth",
        "Description": "Looking for a name that means something special to you?Given the dizzying array of choices available, picking the right name for your baby can be daunting. Why waste hours looking through one long alphabetical list of names just to burn out even before you’ve run through A, B, and C? In this creative twist on the traditional name book, Baby Names Made Easy offers selections organized into categories of meaning, making it easier than ever to choose a name that is significant to you. Traditional or trendy, American in origin or from all over the globe, the names here cover an array of topics. For example, look under: -Animals & Insects (and find “Naia”—Hawaiian for “dolphin”) -Victory (and find “Vincent”—Latin for “conquerer”) -Love & Affection (and find “Mia”—Italian for “mine”) -Religion & Faith (and find “Dev”—Sanskrit for “God”) The book's handy alphabetical index makes cross-referencing easy, so you can find the perfect name in no time. Baby Names Made Easy is a practical and one-of-a-kind reference for anyone searching for the most important gift they can give their child.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "American Elegance: Classic and Contemporary Menus from Celebrated Hosts and Hostesses (Winterthur Book)",
        "Authors": "By Gibbs, Cheryl K. (COM)",
        "Description": "Shares celebrities' menus for breakfasts, brunches, luncheons, dinners, picnics, and holiday meals",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Abbeville Pr",
        "Price Starting With ($)": "8.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Final Four of Everything",
        "Authors": "By Reiter, Mark (EDT), Sandomir, Richard (EDT), and Pine, D. W. (CON)",
        "Description": "In American Bracketology, Mark Reiter and Richard Sandomir take the elegant art of “bracketology” and use it as an eye-opening and hilarious tool to celebrate everything that’s good, bad, and silly in our American way of life.• It’s great entertainment: Americans have an insatiable appetite for knowing what is good, better, and best in their world. If the issue is historical, they want their knowledge base refined. If the issue is sociopolitical, they want their preferences acknowledged. If the issue is popular culture, they want to be entertained. If it’s a consumer issue, they don’t want to be cheated. For the uninitiated, bracketol- ogy is, literally, “the study of brackets.” It derives from the bracket format used to rank the top sixty-four basketball teams in the annual NCAA tournament known as March Madness. That knockout tournament format, the subject of heated debate among hundreds of thousands of people participating in office pools around the land, gave birth to the term bracketology. This is a book that allows Americans to play this game on a much bigger field. The authors have assigned more than 150 brackets—tackling challenges from the serious to the comic, the vital to the trivial—to the finest experts, writers, and personalities this country has on tap. • It’s authoritative: So imagine: Gail Collins on First Ladies, Walter Isaacson on Ben Franklin Wisdom, David Remnick on Pound-for-Pound-fighters, Calvin Trillin on Sandwiches—you get the picture. Frank Rick on The Underserving Hall of Fame, Kevin Conley on Greatest Movie Stunts, Paul Slansky on the Lucky Sperm Club.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Angels & Demons Special Illustrated Edition: A Novel (Robert Langdon)",
        "Authors": "By Brown, Dan",
        "Description": "Before The Da Vinci Code there was Angels & Demons, the explosive thriller that introduced the mysterious world of Harvard symbologist Robesrt Langdon. Now Dan Brown's legions of fans can add a breathtaking new dimension to the Angels & Demons reading experience with this Special Illustrated Edition, featuring 150 images of the architectural highlights, religious symbols, paintings, maps, culptures, and locations found in this contemporary classic.  An ancient secret brotherhood. A devastating new weapon of destruction. An unthinkable target. When world-renowned Harvard symbologist Robert Langdon is summoned to a Swiss research facility to analyze a mysterious symbol -- seared into the chest of a murdered physicist -- he discovers evidence of the unimaginable: the resurgence of an ancient secret brotherhood known as the Illuminati...the most powerful underground organization ever to walk the earth. The Illuminati has now surfaced to carry out the final phase of its legendary vendetta against and age-old enemy.  Langdon's worst fears are confirmed on the eve of the Vatican's holy conclave, when a messenger of the Illuminati announces they have hidden an unstoppable time bomb at the very heart of Vatican City. With the countdown under way, Langdon jets to Rome to join forces with Vittoria Vetra, a beautiful and mysterious Italian scientist, to assist the Vatican in a desperate bid for survival.  No Dan Brown library is complete without this lavishly illustrated special edition. No true lover od suspense fiction will be able to resist the exhilarating blend of scholarly intrigue and relentless adventure found in Angels & Demons.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Passionate Church: The Art Of Life-Changing Discipleship (Life Shape, The Language Of Leadership)",
        "Authors": "By Kallestad, Walt and Breen, Mike",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "NexGen (Cook Communications Ministries )",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Christmas in the Netherlands",
        "Authors": "By World Book Inc Staff",
        "Description": "",
        "Category": "",
        "Publisher": "World Book Childcraft International",
        "Price Starting With ($)": "5.83",
        "Publish Date": {
            "Month": "November",
            "Year": "1981"
        }
    },
    {
        "Title": "This Is the Star",
        "Authors": "By Dunbar, Joyce and Blythe, Gary (ILT)",
        "Description": "This retelling of the Nativity story features carefully crafted verse describing the magical night, complemented by magnificent full-color oil paintings. By the author of Ten Little Mice.",
        "Category": " Juvenile Fiction , Nature & the Natural World , General",
        "Publisher": "Harcourt Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Good Design Can Change Your Life: Beautiful Rooms, Inspiring Stories",
        "Authors": "By Pennington, Ty",
        "Description": "BRING TY PENNINGTON, THE HOST OF EXTREME MAKEOVER: HOME EDITION, INTO YOUR HOME AND MAKE YOUR DESIGN DREAMS BECOME REALITY.Ty Pennington and the millions of people who watch Extreme Makeover: Home Edition know that you can not only transform a home in seven days, you can transform someone's life. If he could, Ty would renovate every home in America, but even he doesn't have that much energy! So he's written Good Design Can Change Your Life: Beautiful Rooms, Inspiring Stories and filled the book with proof that you don't need a bulldozer and a million bucks to realize your dreams.Focusing on the three most important parts of your home -- sleeping spaces, living spaces, and working spaces -- Ty offers low-cost, high-impact ideas for every budget. You'll learn how to express your personality and your passions in your design and how to get the most out of small spaces and limited time. Whether you want to create a welcoming living room that helps you connect with friends and family, a restful bedroom that lets you face the day energized and optimistic, or a streamlined home office that keeps you productive, Ty has some great ideas to share. From the elegant to the funky, the whimsical to the restful; from walls, floors, and lighting to storage, wallpaper, and fabric -- it's all here, infused with Ty's vitality and great style, along with the emotional stories of the people who changed his life as much as the Extreme Makeover: Home Edition crew changed theirs.",
        "Category": " House & Home , Decorating",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Common Stream",
        "Authors": "By Parker, Rowland",
        "Description": "",
        "Category": "",
        "Publisher": "Academy Chicago Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Complete Home Fitness Handbook",
        "Authors": "By Burke, Edmund (EDT)",
        "Description": "Now you can get in great shape without stepping outside your door. The Complete Home Fitness Handbook shows you how to achieve total fitness at home.Packed with stretches, exercise techniques, and individual workouts from internationally known fitness experts Bob Anderson, Wayne Westcott, Harvey Newton, Ed Burke, and Jackie Berning, this one-of-a-kind resource shows you how to develop a personal fitness program that's convenient and effective, choose the best equipment for your fitness level and budget, exercise injury-free, eat right and control your weight, improve your flexibility, and increase your endurance and muscular strength.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Treating Common Diseases of Your Horse",
        "Authors": "By Conn, George Harold",
        "Description": "",
        "Category": "",
        "Publisher": "Wilshire Book Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1973"
        }
    },
    {
        "Title": "The How and Why Wonder Book of Beginning Science.",
        "Authors": "By Notkin, Jerome J. & Gulkin, Sidney.",
        "Description": "",
        "Category": "",
        "Publisher": "Wonder Books",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Movies and TV: The New York Public Library Book of Answers",
        "Authors": "By Ochoa, George and Corey, Melinda",
        "Description": "If you're a movie or television fan - how many of these questions can you answer?   What was the last picture show in The Last Picture Show? Where was the stagecoach headed in Stagecoach? What was the name of the dinosaur bone in Bringing Up Baby? What did Gomer Pyle do before he entered the Marines? Who played Gentle Ben?  Like The Book of Answers, this book answers hundreds of questions in one of the New York Public LIbrary Telephone Reference Service's most popular areas - film and television. It covers the biggest stars, breakthrough productions, famous on-and-off-screen incidents, and film and TV history and trivia.   Movies and TV: The New York Public Library Book of Answers is both informative and entertaining - a treasure trove of fascinating movie and TV facts, a perfect companion to The Book of Answers, and a real treat for movie and TV fans.",
        "Category": " Performing Arts , Reference",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "The Star of Kazan",
        "Authors": "By Ibbotson, Eva and Hawkes, Kevin (ILT)",
        "Description": "Left on a church doorstep and raised by two loving servants, Annika's happy life is greatly altered when a rich aristocrat arrives at her door, tells her that she is her real mother, and takes her to live in a crumbling castle far away from the only family she has ever known. An ALA Notable Book. Reprint.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "What Your Doctor Doesn't Know About Nutritional Medicine May Be Killing You",
        "Authors": "By Strand, Ray D. and Wallace, Donna K.",
        "Description": "When Dr. Ray Strand found himself in a losing battle, unable to successfully treat his wife who had suffered chronically with pain and fatigue, he agreed to try the regimen of nutritional supplements that a neighbor suggested. Much to his surprise, his wife's condition began to improve almost immediately. That amazing turn of events led him to dedicate himself to researching alternative therapies in medicine, particularly in the arena of nutritional supplements.Dr. Strand's illumination of the body's silent enemy-oxidative stress-will astound you. But, more importantly, his research will equip you to protect or reclaim your nutritional health, possibly reversing disease and preventing illness.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "T. F. H. Book of Hamsters",
        "Authors": "By Roberts, Mervin F.",
        "Description": "Tells how to choose, house, feed, breed, and care for hamsters and describes their color variations and behavior",
        "Category": " Technology & Engineering , General",
        "Publisher": "Olympic Marketing Corp",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "New Zealand, an Emerging Force",
        "Authors": "By J. Garcia Lourdes, J. Garcia Lourdes",
        "Description": "",
        "Category": "",
        "Publisher": "Auge International",
        "Price Starting With ($)": "44.27",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Inu-Yasha : A Feudal Fairy Tale, Vol. 2",
        "Authors": "By Takahashi, Rumiko",
        "Description": "",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "VIZ Media LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Complete Speaker's and Toastmaster's Desk Book: Featuring Kirk Kirkpatrick's Audience Control Techniques",
        "Authors": "By Kirkpatrick, A. L.",
        "Description": "Offers tested techniques for using the power of showmanship, handling specific program slots, and gaining and maintaining audience control and immediate rapport",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Welcome to My Studio: Adventures in Oil Painting With Helen Van Wyk",
        "Authors": "By Van Wyk, Helen",
        "Description": "",
        "Category": " Art , Techniques , Oil Painting",
        "Publisher": "Art Instruction Associates",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "CliffsNotes Getting on the Internet (Cliffsnotes Literature Guides)",
        "Authors": "By Crowder, Rhonda and Crowder, David A.",
        "Description": "Who has the time to read a 500-page book about the Internet? This quick and concise guide will show you how to choose your Internet service provider (ISP), how to set up your computer, and how to get working on the Web. There's a wealth of information at your fingertips, and this guide will help you become a savvy surfer.\"",
        "Category": " Computers , Web , General",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Natural Wonders of North America",
        "Authors": "By Ruth Binney",
        "Description": "",
        "Category": "",
        "Publisher": "Avenues, Inc",
        "Price Starting With ($)": "5.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "A spirituality named compassion and the healing of the global village, Humpty Dumpty and us",
        "Authors": "By Fox, Matthew",
        "Description": "",
        "Category": "",
        "Publisher": "Winston Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Late Great USA: NAFTA, the North American Union, and the Threat of a Coming Merger with Mexico and Canada",
        "Authors": "By Corsi, Jerome R., Ph.D.",
        "Description": "Now in paperback, the New York Times bestseller that exposes the business and government leaders who want the United States, Mexico, and Canada to merge into a North American Union similar to the European Union. The European Union was put into place incrementally over fifty years, not by the citizens of the member states, but by the efforts of an intellectual elite who disguised their ultimate goal of a regional government. Today, a bloated, unelected bureaucracy rules over hundreds of millions of people—people who have no say over the EU’s actions...or their own futures. Think it could never happen here? According to author Jerome Corsi, it already has.  The Security and Prosperity Partnership—announced in 2005 by the leaders of Mexico, the U.S., and Canada, but never presented to Congress for approval—is already laying the groundwork for the merger of the three nations into a North American Union. Here, in The Late Great U.S.A, the #1 New York Times bestselling author of The Obama Nation makes a boldly provocative argument about the future of our country, in this important book that was, in part, the inspiration for the final chapter in Glenn Beck’s #1 New York Times bestseller An Inconvenient Book.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Threshold Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "A Slant of Sun: One Child's Courage",
        "Authors": "By Kephart, Beth",
        "Description": "Named a Best Book of the Year by Salon magazine and The Philadelphia Inquirer, A Slant of Sun was praised for its incandescent prose about the experience of loving a child who brings tremendous frustration and incalculable rewards and for its extraordinary resonance. Like Operating Instructions and The Liars' Club, A Slant of Sun is a contemporary classic.Nearly one in five children grow up facing a developmental or behavioral challenge, and like them, Beth Kephart's son, Jeremy, showed early signs of being different: language eluded him, he preferred playing alone to an afternoon on the jungle gym. Doctors diagnosed Jeremy with a mild form of autism called Pervasive Developmental DisorderNot Otherwise Specified. A Slant of Sun is a passionate memoir about how Kephart, guided by the twin tools of intuition and imagination, helped lead her son toward wholeness. Pulsing with the questions, \"Is normal possible? Definable?\" A Slant of Sun speaks to everyonenot just parentsof the redemptive power of love.",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "Harper-perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Lost Summer",
        "Authors": "By McAulay, Alex",
        "Description": "From the author of Bad Girls comes another dramatic novel of survival and suspense. It's Laguna Beach meets Cape Fear when a rich girl from California confronts murder and isolation on North Carolina's stormy Outer Banks.   When Caitlin Ross's mother takes her and her brother to an island in the remote Outer Banks for the summer, Caitlin is furious. She was planning on spending the summer hanging out by the pool, partying, shopping, and singing backup in her boyfriend's band, Box of Flowers. North Carolina isn't anything like California, and Caitlin doesn't fit in. But her troubled mother is too busy popping pills and trying to win back her creepy ex-boyfriend to care.   At first, the only friend Caitlin makes on the desolate island is a local misfit named Danielle. But things start to improve when she meets a bunch of visiting prep school boys and gets swept up in their exciting world. Then, one dark night, she witnesses a murder and begins to suspect that her new friends aren't really her friends at all. With a powerful hurricane approaching, and the island cut off from the outside world, Caitlin has no one to turn to but herself . . . and whether she'll live to see another summer is the biggest mystery of all.",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "MTV Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Software Configuration Management Strategies and Rational Clearcase: A Practical Introduction (Addison-wesley Object Technology Series)",
        "Authors": "By White, Brian A.",
        "Description": "A practical guide to a popular software configuration management tool. Explains fundamentals, then shows how ClearCase supports best practices through the Unified Change Management model. Demonstrates how ClearCase can be used to facilitate and control changes in software development projects, and deals with advanced topics such as managing multiple projects and managing project teams located at different sites. For software developers and managers. White has a decade of experience with software configuration management tools. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Computers , Software Development & Engineering , General",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Great Chefs Cook American",
        "Authors": "By Brown, Ellen (EDT)",
        "Description": "For more than a decade Great Chefs television has journeyed from sea to shining sea to film a constellation of superstar chefs who are culinary trailblazers updating classic American dishes with sophisticated personal flair. And the more than one hundred dazzling dishes in The Great Chefs Cook American will wow guests when they emerge from your kitchen. The tantalizing taste of these recipes - from Jeremiah Tower's famed Black Bean Cake to Larry Forgione's signature Cedar-Planked Salmon and Mark Miller's innovative Wild Mushroom Tamales - comes from exciting flavor combinations made with easy-to-find ingredients and simple preparation techniques. The recipes were selected and edited to their essential elements by award-winning cookbook author Ellen Brown, who has added a skill-building chapter on basic techniques as well as many chef's tips so home cooks can learn the tricks of the professional trade. The recipes encompass appetizers to desserts and reflect all the delicious regions of American food.",
        "Category": " Cooking , General",
        "Publisher": "Main Street Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Gift of Holy Communion: For Parents of Children Celebrating First Eucharist",
        "Authors": "By Glavich, Kathleen",
        "Description": "",
        "Category": " Religion , Christian Rituals & Practice , Sacraments",
        "Publisher": "ACTA Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Carpentry Essentials: Quick Steps (Black & Decker Essentials)",
        "Authors": "By Black & Decker Corporation",
        "Description": "",
        "Category": " House & Home , Do-It-Yourself , Carpentry",
        "Publisher": "Cowles Creative Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Lonely Planet Watching Wildlife: Southern Africa",
        "Authors": "By Hunter, Luke and Rhind, Susan",
        "Description": "",
        "Category": " Travel , Africa , General",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Don't Get Caught with Your Skirt Down: A Practical Girl's Recession Guide",
        "Authors": "By Keto, Jill and Keto, Daniel",
        "Description": "A straightforward, no-nonsense, practical, woman-to-woman guide to understanding the economy and personal finance, navigating the sea of confusing investment options and cutting back on spending during this difficult, belt-tightening recession.We’re in the midst of some of the toughest times we’ve ever seen. But it’s not time to panic—with some solid guidance and financial savvy, you can weather this recession and come out on top. Jill Keto—a selfmade entrepreneur and mother of two—gives you the real scoop on personal finance, the markets, and how to spend and save wisely the way only a girlfriend can, in a down-toearth and straightforward manner we haven’t heard from any of the experts. You’ll learn: • Where the economy is headed and what that means for you • How to create backup income • Essential skills to help you thrive • How to deal with your big fat mortgage • How to keep your job • How to get what you need, cheaply • Where to save your money so it doesn’t vaporize • How to haggle like a pro • How to cut your food bill in half • How to have no car payment • How to look gorgeous without spending a fortune • And much more!",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Survival French (English and French Edition)",
        "Authors": "By Lubke, Diethard and Scherling, Theo (ILT)",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Langenscheidt Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "The Atom Hell of Grautier",
        "Authors": "By Kurt Mahr",
        "Description": "",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Home Offices and Work Spaces",
        "Authors": "By Sunset Books",
        "Description": "Presents ideas, floorplans, and decorating tips for workspace and storage designs in both modern and traditional motifs",
        "Category": " Art , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Secret Barrier X (Perry Rhodan #16)",
        "Authors": "By Shols, W. W",
        "Description": "",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "PERRY RHODAN #95 : THE PLASMA MONSTER",
        "Authors": "By Kurt Mahr",
        "Description": "",
        "Category": "",
        "Publisher": "Ace",
        "Price Starting With ($)": "7.55",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Perimenopause: Changes in Women's Health After 35, 2nd Edition",
        "Authors": "By Lanka, Darlene, Huston, James E., and Jovanovic, Lois (FRW)",
        "Description": "Perimenopause encompasses a life transition that begins for most women with subtle physiological changes in the mid-thirties, gathers pace in the forties, and culminated with menopause. It’s common to experience a bewildering array of symptoms, including hot flashes, mood swings, irregular menstruation, unexplained fatigue, and trouble sleeping.The second edition of this popular self-help guide explains why the changes occur and presents the best strategies for dealing with them. The authors show women what they can do to cope with symptoms and offer practical suggestions for minimizing the long-term health risks that can occur as a result of menopause. Throughout, their goal is to energize and empower readers to manage their own transition through perimenopause in ways that will ensure health and vitality in the years ahead.New in the Second Edition:      Expanded chapter on alternative health options     Relevance and updated facts about heart disease, osteoporosis, and breast cancer     Revised guidelines for birth control and infertility procedures     Latest word on hormones, hormone balancing, and hormone replacement     New help for PMS and incontinence",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "New Harbinger Publications, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Heal Your Heart: The New Rice Diet Program for Reversing Heart Disease Through Nutrition, Exercise, and Spiritual Renewal",
        "Authors": "By Rosati, Kitty Gurkin",
        "Description": "Heal Your Heart combines the best of ancient spiritual wisdom and the best of modern nutrition to provide a holistic program for real living. -- Morton T. Kelsey, Professor Emeritus, University of Notre Dame Author of The Other Side of Silence and God,Dreams, and Revelation\"\"Kitty Rosati offers the range of information and wisdom needed for long-term lifestyle changes. It's so nice to see a dietary book extend beyond nutrition and inspire the reader.\"\" -- Gerald G. Jampolsky, M.D. Author of Love Is Letting Go of Fear\"\" We recommend Heal Your Heart as an excellent guide for anyone seeking health and wholeness. Kitty Rosati advocates a renewed emotional and spiritual journey along with her nutrition plan and extensive collection of delicious recipes.\"\" -- Redford Williams, M.D., and Virginia Williams, Ph.D. Authors of Anger KillsThe world-renowned Duke University Rice Diet Program has helped thousands of people regain their health and vastly improve the quality of their lives. Here's the life-saving information you need to make the new Rice Diet Program a force for your own longevity and wellness.A thorough analysis of your major risk factors for heart disease, including excess weight, high cholesterol, diabetes, and high blood pressure* A detailed, heart-healthy nutrition plan tailored to your health needs* Over 150 delicious, easy-to-prepare recipes* A heart-healthy exercise plan to help heal and strengthen your heart* Guidance on using the powerful, often untapped resources of your mind and spirit to achieve--and maintain--your goals* Helpful resource information on support groups, newsletters, and where to get the best health foods",
        "Category": " Health & Fitness , Nutrition",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Keys to Developing Your Child's Self-Esteem (Barron's Parenting Keys)",
        "Authors": "By Pickhardt, Carl E.",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Frommer's Budapest & the Best of Hungary (Frommer's Complete Guides)",
        "Authors": "By Lieber, Joseph S., Shea, Christina, and Barat, Erzsebet (CON)",
        "Description": "You'll never fall into the tourist traps when you travel with Frommer's. It's like having a friend show you around, taking you to the places locals like best. Our expert authors have already gone everywhere you might go--they've done the legwork for you, and they're not afraid to tell it like it is, saving you time and money. No other series offers candid reviews of so many hotels and restaurants in all price ranges. Every Frommer's Travel Guide is up-to-date, with exact prices for everything, dozens of color maps, and exciting coverage of sports, shopping, and nightlife. You'd be lost without us!Budapest, awakened in 1989 after its long slumber behind the Iron Curtain, is one of Europe's hottest destinations. It stands proudly at the center of Eastern Europe's cultural rebirth, and best of all, it still ranks as one of the continent's best bargains. Frommer's Budapest & the Best of Hungary has all the practical details and candid advice you need to plan a successful trip. We've reviewed the very best places to stay and dine, from historic hotels to intimate guesthouses, from grand cafes to atmospheric taverns and pubs. With Frommer's in hand, it's easy to explore the all the city's highlights; our detailed walking tours will introduce you to a wealth of gorgeous architecture and show you the hidden treasures of the city. And of course, we've got all the details on Budapest's exciting nightlife, its vibrant arts scene, and its fabulous thermal baths and spas.Then we'll take you to explore the best of the Hungarian countryside, where you'll discover sunburnt hillside vineyards and deep verdant valleys, lush cherry orchards, the lovely riverside towns along the Danube Bend, the famous caves in Aggletek, and the shores of Lake Balaton. Frommer's puts it all at your fingertips, with a handy glossary of Hungarian phrases and detailed color maps.",
        "Category": " Travel , Europe , Eastern",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Prize: The Epic Quest for Oil, Money & Power",
        "Authors": "By Yergin, Daniel",
        "Description": "Deemed \"the best history of oil ever written\" by Business Week and with more than 300,000 copies in print, Daniel Yergin’s Pulitzer Prize–winning account of the global pursuit of oil, money, and power has been extensively updated to address the current energy crisis.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "In a Good Place: A Novel",
        "Authors": "By Johnson, Rachel",
        "Description": "In this wickedly funny and heartwarming novel from the author of the international bestseller Notting Hell, one woman’s dream of English country living meets the complicated ups and downs of an enduring marriage.  Mimi and her husband Ralph have left social climbing, pushy parenting, and their marital problems behind them in London in favor of perfect, bucolic tranquility. Or so they thought. The village of Honeybourne has mud, masses of fresh air, and handsome hayseeds in abundance, but what should be rural heaven turns out to be just as tricky to navigate as Notting Hell, even with Mimi’s new best friend Rose—Dorset’s answer to Martha Stewart—by her side. Mimi can get by without world-class restaurants, spas, and vintage markets, but living without central heating is another challenge entirely. And while Honeybourne is thankfully free of prestigious preschools with waiting lists that begin in utero, it has its own fierce brand of competition—between landowners and eco-warriors, Old Money and No Money, Ralph Lauren-sporting racehorses and Barbour-wearing brood mares. Without a helipad for trophy guests, an organic farm shop, and a bottom that looks good in jodphurs, Mimi is at a distinct disadvantage. And that’s just the start of her problems, because Mimi also has a secret she must keep to save her marriage. With a gimlet eye for telling details and human foibles, Rachel Johnson has crafted a novel that is fresh, hilarious, and irresistibly funny—a brilliant slice of social satire with surprising depth and heart.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "The Gabriel Method: The Revolutionary DIET-FREE Way to Totally Transform Your Body",
        "Authors": "By Gabriel, Jon",
        "Description": "Author Jon Gabriel uses his own remarkable transformation—from 409 pounds to 184 pounds—to show the solution to changing the inner belief systems that keep our bodies from thin.The pile of recent dieting books is growing faster than the average American's waistline. From the well-known programs that deprive and restrict to ones that rely on juice alone, it seems that everybody has an answer to the growing problem of obesity. When Jon Gabriel's life took an unexpected turn, he suddenly was awakened to the marvelous gift that he had been given -- the opportunity to live -- and was disgusted at how he had treated his body. At over four hundred pounds, walking, sleeping, and working was a struggle against gravity, and his life was a constant battle between emotional and physical satiation. He was slowly killing himself with food. Like the estimated 58 percent of Americans, and rising numbers in other countries, Jon was trapped in what he came to call the FAT - Famine and Temperature - trap. By studying biochemistry, Gabriel learned that your body has an internal logic that determines how fat or thin you will be at any given time. The way to lose weight is not to struggle or to force yourself to lose weight but to understand this internal logic and work with it so that your body wants to be thinner. When your body wants to be thinner, weight loss is inevitable and becomes automatic and effortless. You simply crave less food, you crave healthier foods, your metabolism speeds up and you become very efficient at burning fat, just like a naturally thin person. And that's the real transformation -- to transform yourself into a naturally thin person, so that you can eat whatever you want whenever you want and still be thin, fit, and vibrantly healthy. After reading The Gabriel Method, you will learn: -Your body has a reason why it's holding on to weight--and it's not your fault. -Fat is a cushion--a protective barrier that our mind believes is helping to protect us. -If you can change that belief, you can change your body; Stop the cycle of crash dieting and start eating what you want, when you want it. -How to choose healthy, nutritious foods that nourish the cells in your body, not starve them. -Delicious shakes and smoothies, and super-power supplements, that can jump start your success. -The simple way you can train your mind and body to work with your goal of health, not against it. -Eliminate the emotional and mental reasons your body holds on to weight in just 10 minutes a day. It certainly worked for Jon; he lost 225 pounds in two-and-a-half years, going from 409 pounds to 184, without suffering, dieting, or anguishing over his body. Unlike most people who lose an extensive amount of weight, his skin tightened up and now is indistinguishable from that of a person who has been healthy his whole life.",
        "Category": " Body, Mind & Spirit , Healing , General",
        "Publisher": "Beyond Words",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "What Color Is Your Parachute? for Retirement: Planning Now for the Life You Want by Richard N. Bolles (2007-05-01)",
        "Authors": "By Bolles, Richard Nelson",
        "Description": "",
        "Category": "",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Blind Fall: A Novel",
        "Authors": "By Rice, Christopher",
        "Description": "From three-time New York Times bestselling author Christopher Rice -- whose novels have been called \"bold and ambitious\" by The New York Times, \"chillingly perverse\" by USA Today, and \"shocking, sexy...intricate\" by Glamour -- comes this startling psychological thriller about an Iraq War vet who seeks redemption and revenge when a fellow Marine he failed to protect during the war is brutally murdered.   John Houck became a Marine to become a hero. But his life changed when he failed to notice an explosive device that ended up maiming the captain of his Force Recon Company, a respected Marine who nearly sacrificed himself to save John's life.   Home from Iraq, John pays a visit to his former captain, only to discover the captain has been gruesomely murdered. John pursues a strange man he sees running from the scene, but he discovers that Alex Martin is not the murderer. Alex is, in fact, the former captain's secret male lover and the killer's intended next victim.   When it becomes clear that local law enforcement has direct connections to the murder itself, John realizes that to repay his debt of honor, he must teach Alex Martin how to protect himself, even if that means teaching Alex to kill. In the process, John confronts the painful truth about the younger brother he was unable to protect and the older sister he always felt he failed.   Blind Fall is a story of honor and integrity, of turning failure into victory. It is a stunning departure for Christopher Rice: the story of two men, one a Marine, one gay, who must unite to avenge the death of the man they both loved -- one as a brother-in-arms, one as a lover -- and to survive.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Through the Looking-Glass (Dover Thrift Editions: Classic Novels)",
        "Authors": "By Carroll, Lewis and Tenniel, John",
        "Description": "This 1872 sequel to Lewis Carroll's beloved Alice's Adventures in Wonderland finds the inquisitive heroine in a fantastic land where everything is reversed. Looking-glass land, a topsy-turvy world lurking just behind the mirror over Alice's mantel, is a fantastic realm of live chessmen, madcap kings and queens, strange mythological creatures, talking flowers and puddings, and rude insects.Brooks and hedges divide the lush greenery of looking-glass land into a chessboard, where Alice becomes a pawn in a bizarre game of chess involving Humpty Dumpty, Tweedledum and Tweedledee, the Lion and the Unicorn, the White Knight, and other nursery-rhyme figures. Promised a crown when she reaches the eighth square, Alice perseveres through a surreal landscape of amusing characters that pelt her with riddles and humorous semantic quibbles and regale her with memorable poetry, including the oft-quoted \"Jabberwocky.\"This handsome, inexpensive edition, featuring the original John Tenniel illustrations, makes available to today's readers a classic of juvenile literature long cherished for its humor, whimsy, and incomparable fantasy.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Chicken Soup for the Grieving Soul: Stories About Life, Death and Overcoming the Loss of a Loved One (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM) and Hansen, Mark Victor (COM)",
        "Description": "This collection of inspirational stories will undoubtedly touch many hearts. Written by authors who have lost loved ones, these stories offer comfort, peace and understanding to those going through the grieving process.Individual people deal with grief in their own ways and within their own time, but the guidance and support they receive from others is what helps them through it. One of the key messages of Chicken Soup for the Grieving Soul is that togetherness and sharing are the keys to moving on. In these stories people share their experiences with coping and they share deep memories. Each one has found that putting thoughts and feelings into words is not only cathartic, it allows them to reconnect with their loved one and others. Words of encouragement are plentiful in this edition and they go straight to the heart. Chapters encompass the complete grieving experience and include: Final Gifts, the Power of Support, Coping and Healing, Those We Will Miss, Special Moments, Insights and Lessons, and Living Again. Readers will be comforted and inspired by the stories of regaining strength and hope, such as holding meaningful services, performing thoughtful deeds and cherishing special memories. Most important, just as the writers have come to appreciate life through the grieving process, readers will discover how to do the same. This soothing bowl of stories is the perfect gift to bring comfort, strength and courage.",
        "Category": " Family & Relationships , Death, Grief, Bereavement",
        "Publisher": "HCI",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "The politics of the budgetary process",
        "Authors": "By Wildavsky, Aaron B",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "6.07",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Adventures of Richard Hannay: Containing The Thirty Nine Steps; Greenmantle; Mr. Standfast",
        "Authors": "By John Buchan",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin Company: Boston",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1919"
        }
    },
    {
        "Title": "Maternal Fitness: Preparing for a Healthy Pregnancy, an Easier Labor, and a Quick Recovery",
        "Authors": "By Thompson, Andrea and Tupler, Julie",
        "Description": "Get Your Body Ready for the Marathon of Labor!  If you're newly pregnant, you're probably watching your diet carefully, getting plenty of rest, and preparing for the arrival of your new baby. You're also thinking about the big day itself and what the experience of labor will be like. Even if you're following a regular fitness program, you'll want to do everything you can to strengthen and prepare your body for the rigors of labor.  Maternal Fitness features clearly illustrated exercises that focus specifically on the muscle groups you'll use throughout labor, especially the transverse abdominals -- the stomach muscles that play a critical role during delivery. A powerful set of transverse abs can speed labor and delivery and make for a quick recovery. By learning how to strengthen your abdominals and relax your pelvic floor muscles, you'll be able to push more effectively.  While the Maternal Fitness program is designed specifically for the big moment, it also has other benefits, from minimizing backache and fatigue to giving you a welcome head start on getting back into shape after childbirth. Developed by a professional trainer who is also a registered nurse and childbirth educator, the Maternal Fitness program is safe for you and your baby and easy to do. Once learned, it can be incorporated into any workout.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "How to Eat a Poem: A Smorgasbord of Tasty and Delicious Poems for Young Readers (Dover Children's Classics)",
        "Authors": "By American Poetry & LIterarcy Project (EDT), American Poetry & Literacy Project (EDT), and Kooser, Ted (FRW)",
        "Description": "Focusing on popular verse from the nineteenth century through today, this anthology invites young readers to sample a taste of irresistible poems that will nourish their minds and spirits. Selected for both popularity and literary quality, seventy charming poems cover a wide range of subjects: poetry, books, words, and imagination; the beauty of the natural world; travel, adventure, sports, and play; love, friendship, sadness, hope, and other emotions. Included are:\"Prickled Pickles Don't Smile,\" Nikki Giovanni\"W. D., Don't Fear that Animal,\" W. D. Snodgrass\"A Jelly-Fish,\" Marianne Moore\"The Porcupine,\" Ogden Nash\"Annabel Lee,\" Edgar Allan Poe\"The Falling Star,\" Sara Teasdale\"Sick,\" Shel Silverstein\"Casey at the Bat,\" Ernest Lawrence Thayer\"With Kitty, Age Seven, At the Beach,\" William Stafford\"Hope is the Thing with Feathers,\" Emily Dickinson. . . . and sixty other notable works.Chosen by the American Poetry & Literacy Project and the Academy of American Poets, two of the nation's most respected nonprofit poetry organizations, these much-loved and highly readable poems promise young readers and poetry lovers of all ages hours of reading pleasure.",
        "Category": " Juvenile Nonfiction , Poetry , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Shela",
        "Authors": "By Menen, Aubrey",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.85",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "SpongeBob SquarePants Survival Guide",
        "Authors": "By Lewman, David",
        "Description": "You probably think living in a pineapple under the sea is easy.  Well, think again. Life beneath the waves can be fraught with peril -- well, little inconveniences anyway -- where even the most optimistic sponge can be put to the test. That's why SpongeBob SquarePants, star of the hit animated series on Nickelodeon, together with his friends and neighbors in the underwater world of Bikini Bottom, have contributed their...unique...insights on getting through life in this hilarious guidebook. Inspired by actual episodes, the SpongeBob SquarePants Survival Guide is packed with important tips and essential advice on everything from taming wild jellyfish to escaping a pool of tartar sauce. And we all know how important it is to know these things, don't we?  Don't we...?",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Vangel Griffin",
        "Authors": "By Herbert Lobsenz",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Brothers",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "The World Turned Upside Down: Children of 1776",
        "Authors": "By Ramsey, Marcy Dunn (ILT) and Jensen, Ann D.",
        "Description": "",
        "Category": " Young Adult Nonfiction , History , United States , Colonial & Revolutionary Periods",
        "Publisher": "Schiffer Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Hondo and Fabian",
        "Authors": "By McCarty, Peter",
        "Description": "Hondo the dog has a fun day at the beach while Fabian the cat stays home.\" Wake up, Hondo. Time to go!\"Hondo will have an adventure.Fabian will stay home.A dog named Hondo and his friend Fred are going to the beach for a day of excitement. Fabian the cat is left behind at home to play with the baby. Who will cause more trouble? And who will have more fun? Peter McCarty's exquisite illustrations and understated wit turn an ordinary day in the lives of two pets into a rare delight.Hondo and Fabian is a 2002 New York Times Book Review Best Illustrated Book of the Year and Notable Children's Book of the Year, and a 2003 Caldecott Honor Book.",
        "Category": " Juvenile Fiction , Animals , Pets",
        "Publisher": "Square Fish",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Tarzan and the Vikings/the Sinister Safari (the Burroughs Bibliophile No. 5)",
        "Authors": "By Burroughs, Edgar Rice/Hal Foster",
        "Description": "",
        "Category": "",
        "Publisher": "House of Greystoke, Kansas City, MO.",
        "Price Starting With ($)": "11.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Saint John the Evangelist: The History of the Parish, 1774-1984; Forest Glen/Silver Spring, Maryland",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "St. John the Evangelist Parish",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Japan Took the J.A.P. Out of Me",
        "Authors": "By Cook, Lisa Fineberg",
        "Description": "Six days after an InStyle-worthy wedding in Los Angeles, Lisa Fineberg Cook left behind her little red Jetta, her manicurist of ten years, and her very best friend for the land of the rising sun. When her husband accepted a job teaching English in Nagoya, Japan, she imagined exotic weekend getaways, fine sushi dinners, and sake sojourns with glamorous expatriate friends. Instead, she's the only Jewish girl on public transportation, and everyone is staring. Lisa longs for regular mani/pedis, valet parking, and gimlets with her girlfriends, but for the next year, she learns to cook, clean, commute, and shop like the Japanese, all the while adjusting to another foreign concept -- marriage. Loneliness and frustration give way to new and unexpected friendships, the evolution of old ones, and a fresh understanding of what it means to feel different -- until finally a world she never thought she'd fit into begins to feel home-like, if not exactly like home.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "A Short Guide to Writing About History (Short Guide Series)",
        "Authors": "By Marius, Richard",
        "Description": "",
        "Category": " History , Historiography",
        "Publisher": "Longman Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Blood, Tears, and Folly: An Objective Look at World War ll",
        "Authors": "By Deighton, Len and Bishop, Denis (ILT)",
        "Description": "Despite the volumes written about World War II, many questions remain un-answered. In this balanced and thoughtful chronicle, historian and World War II expert Len Deighton dares to explore intriguing questions, including why the British weren't more prepared for the Blitz and why Hitler failed to thoroughly support his U-boat program. He also warns that we haven't yet learned the lessons of World War II, as ethnic cleansing, Middle East violence, and the widening gap between rich and poor still plague the world.",
        "Category": " History , Military , World War II",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "The People's Republic of China Cookbook",
        "Authors": "By Sakamoto, Nobuko",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Woman of a Thousand Secrets",
        "Authors": "By Wood, Barbara",
        "Description": "The Bestselling Author of The Blessing Stone and Daughter of the SunShe came to them from the sea, and to the sea they returned her. . . . A story of sacrifice and survival in the New World.Tonina lives an idyllic life on a small island in the Caribbean hundreds of years before Europeans discovered it. But she has always been an outsider among her people. Unlike them, Tonina is tall and lean and light skinned, and her origins remain a mystery. Her adoptive parents had found her floating in a basket in the sea—a sacrifice? A shipwreck? No one knows. When Tonina turns nineteen, her parents know she must return to the sea so that the gods don't become angry with the village for keeping something that is not theirs. Under the guise of finding a medicinal plant, they send Tonina to the mainland, a terrifying place she can't even imagine. They know, however, that they will never see her again. And here is where her adventure begins. It is a tale of survival and sacrifice, of luck, magic, intrigue, and danger, romance and betrayal, an epic filled with ancient lore, tales of bearded white men who sailed to this shore in giant ships, and discoveries of medicinal miracles in faraway places. But most of all, it's the story of one woman's quest to discover where—and to whom—she really belongs. This sweeping story of the undiscovered world before the time of Columbus is Barbara Wood at her very best.",
        "Category": " Fiction , Historical",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "An Amish Gathering (Inspirational Amish Romance Collection)",
        "Authors": "By Cameron, Barbara, Fuller, Kathleen, and Wiseman, Beth",
        "Description": "Three heartwarming tales of old friends and new beginnings that span one year in an Amish community.A Change of Heart by Beth WisemanLeah is no good at cooking, cleaning, sewing, gardening—the skills that young women need to make a proper Amish wife. All she wants to do is write stories, but she's sincerely tired of being a disappointment. Will she ever find someone who accepts her just as she is? And can an almost-Amish angel in red polka dots help her find her way?A Place of His Own by Kathleen FullerWhen Josiah left Paradise the first time, he didn't even say good-bye. Now he's back, ten years later, and he's changed. Why is he so distant and bitter? Where is the boy who used to be Amanda's best friend? Amanda is learning that there are things even a capable Amish girl can't fix. But can she stand there and watch him walk away . . . again?When Winter Comes by Barbara CameronIt's been too long since Rebecca has done what she loves—put on her skates and fly across the ice. Five years have passed since a winter accident took her twin Lizzie and left Rebecca heartbroken. And Ben has waited for her all that time. At last she's starting to heal. But has too much time passed for their hearts to reconnect?",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Birth Of God,",
        "Authors": "By Kavanaugh, James J",
        "Description": "",
        "Category": "",
        "Publisher": "Trident Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The family tomb",
        "Authors": "By Gilbert, Michael Francis",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "BEING RED",
        "Authors": "By Fast, Howard",
        "Description": "The best-selling author describes his membership in the Communist Party from 1944 to 1957; his hardships, blacklisting, and prison term during the McCarthy era; and his eventual disillusionment with the party",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "The Daring Deception",
        "Authors": "By Cartland, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Imadoki! Nowadays, Vol. 2: Magnolia",
        "Authors": "By Watase, Yuu and Watase, Yuu (ILT)",
        "Description": "It sure isn't easy being a working-class girl attending the most posh high school in town. Even more difficult is starting up a Gardening Committee in a place where every bit of flora and fauna is artificial (wouldn't want to flare up the aristocratic student body's allergies). It's a good thing that Tanpopo Yamazaki is as tenacious and full of moxy as they come. With her eye on the prize, and an adorable pet fox named Poplar, Tanpopo is prepared to make friends and plant flowers by any means necessary.",
        "Category": " Comics & Graphic Novels , Manga , General",
        "Publisher": "VIZ Media LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Imadoki! Nowadays, Vol. 5: Poppy",
        "Authors": "By Watase, Yuu and Watase, Yuu (ILT)",
        "Description": "Just as Koki and Tanpopo are about to confess their true feelings for one another, both are called away on family emergencies! Realizing how much her ailing grandparents need her, Tanpopo is faced with a heartbreaking choice: staying by her family's side in Hokkaido, or being with her soul mate in Tokyo! Will the two young lovers ever be together? Find out in the dramatic conclusion of IMADOKI! Plus two Yuu Watase short stories!",
        "Category": " Comics & Graphic Novels , Manga , General",
        "Publisher": "VIZ Media LLC",
        "Price Starting With ($)": "7.33",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Gus Goes To School",
        "Authors": "By Thayer, Jane",
        "Description": "Determined to learn how to spell, Gus the ghost enrolls in school, only to endure the embarrassment of being kept back",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Prize Winning Paintings Representational & Abstract (Prize Winning Paintings, Book III)",
        "Authors": "By Harold, Margaret, compiled by",
        "Description": "",
        "Category": "",
        "Publisher": "Allied Publications",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Writing S O A P Notes",
        "Authors": "By Kettenback, Ginge",
        "Description": "",
        "Category": "",
        "Publisher": "F A Davis Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Bismarck and His Times",
        "Authors": "By Kent, George O.",
        "Description": "A new account of the life and policies of the first German chancellor, Otto von Bismarck, this concise historical-biography reflects, for the first time in English, the historical shift in emphasis from the traditional political-economic approach to the more complex social-economic one of post—World War II scholarship. Since the middle of the 1950s, much new material on Bismarck and nine­teenth-century Germany and new inter­pretations of existing material have been published in Germany, Great Britain, and the United States. Pro­fessor George O. Kent’s brilliant syn­thesis, drawing on this mass of mate­rial, examines changes in emphasis in post—World War II scholarship. The book, particularly in the historiograph­ical notes and bibliographical essay, provides the serious student with an invaluable guide to the intricacies of recent Bismarckian scholarship. For the general reader, the main text presents a picture of the man, the issues, and the age in the light of modern scholarship. The major shift in historical emphasis described in this new account is the importance scholars give to the period 1877–79, the years of change from free trade to protectionism, rather than to 1870–71 the founding of the Reich. Bismarck’s political machinations, par­ticularly his willingness to explore the possibilities of a coup d’état, are more fully discussed here than in any other book.",
        "Category": " History , Modern , 19th Century",
        "Publisher": "Southern Illinois University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1978"
        }
    },
    {
        "Title": "The Simple Guide to Rabbits",
        "Authors": "By Land, Bobbye",
        "Description": "Provides information on choosing a rabbit for a pet, rabbit breeds, grooming, health care, shelter, training, and taming.",
        "Category": " Pets , Rabbits, Mice, Hamsters, Guinea Pigs, etc.",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Selected Speeches and Writings: Abraham Lincoln",
        "Authors": "By Lincoln, Abraham",
        "Description": "Ranging from finely honed legal argument to dry and sometimes savage humor to private correspondence and political rhetoric of unsurpassed grandeur, the writings collected in this volume are at once the literary testament of the greatest writer ever to occupy the White House and a documentary history of America in Abraham Lincoln's time. They record Lincoln's campaigns for public office; the evolution of his stand against slavery; his pyrotechnic debates with Stephen Douglas; his conduct of the Civil War; and the great public utterances of his presidency, including the Emancipation Proclamation and the Gettysburg Address.For the first time, the authoritative editions of works by major American novelists, poets, scholars, and essayists collected in the hardcover volumes of The Library of America are being published singly in a series of handsome paperback books. A distinguished writer has contributed an introduction for each volume, which also includes a chronology of the author's life and career, an essay on the text, and notes.",
        "Category": " Political Science , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Discovering Pottery",
        "Authors": "By Memmott, Harry",
        "Description": "",
        "Category": "",
        "Publisher": "Paul Hamlyn",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "At the Point of a Gun: Democratic Dreams and Armed Intervention",
        "Authors": "By Rieff, David",
        "Description": "Writing from the front lines of the hot wars of the post-Cold War world -- the Balkans, Africa, the Middle East, and most recently Afghanistan and Iraq for The New York Times Magazine -- David Rieff witnessed firsthand most of the armed interventions waged by the West or the United Nations in the name of human rights and democratization. His report is anything but reassuring. In this timely collection of his most illuminating articles, Rieff, one of our leading experts on the subject, reassesses some of his own judgments about the use of military might to solve the world's most pressing humanitarian problems and curb the world's cruelest human rights abusers, presenting what, taken as a whole, is a thoughtful and impassioned argument against armed intervention in all but the most extreme cases.  At the Point of a Gun raises critical questions we cannot ignore in this era of gunboat democracy. When, if ever, is it appropriate to intervene militarily in the domestic affairs of other nations? Are human rights and humanitarian concerns legitimate reasons for intervening, or is the assault on sovereignty -- sovereignty that is as much an article of faith at the UN as it is in Washington -- a flag of convenience for the recolonization of part of the world? What role should the United Nations play in alleviating humanitarian crises? And, above all, can democracy be imposed through the barrel of an M16?  Collected here for the first time, Rieff's essays draw a searing portrait of what happens when the grandiose schemes of policymakers and the grandiose ethical ambitions of human rights activists go horribly wrong in the field. Again and again, they ask the question: Do these moral ambitions of ours to protect people from massacre and want match either our means or our wisdom?  Rieff's articles appear as they were written. Some, however, are accompanied by brief reconsiderations in which the author describes how and why his thinking has changed both as he has reflected on what it means, as in Iraq, to impose democracy by force, and as he has witnessed, firsthand, what that redemptive project actually looks like in practice.  This is not an optimistic report. To the contrary, it is the chastened conclusion of a writer who was once one of the leading advocates of such interventions. But the questions Rieff raises are of the essence as the United States grapples with the harsh consequences of what it has wrought on the ground in Afghanistan and Iraq.",
        "Category": " Political Science , Comparative Politics",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Bad Girls",
        "Authors": "By McAulay, Alex",
        "Description": "Thick with suspense and simmering with adolescent turmoil, Bad Girls is an action-adventure survival story that pits a group of troubled teens against a forbidding tropical landscape, an elusive enemy, and, worst of all, each other. It's Mean Girls meets Lord of the Flies, and it marks the debut of an innovative new voice in fiction.  Anna Wheeler's parents have had it up to here. They can't seem to control their daughter anymore and so, one night, Anna's yanked from her bed and carted off to Camp Archstone -- bootcamp for troubled teen girls. There, on a vast, remote, sparsely populated island, Anna will be expected to change her ways and repent for the sins her religious father just can't seem to forgive. Here's a hint: There's a boy involved. No, a man.  Life at Camp Archstone is Anna's worst nightmare. Every minute of the day is scheduled, the counselors are hardcore, and one girl is crueler than the next. But when a grueling hike into the forest goes horribly wrong, things go from bad to worse. Stalked by an unknown foe and left to fend for themselves, the girls band together to try to find their way back to civilization -- and that's when the real trouble begins.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "MTV Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Humor for a Woman's Heart: Stories, Quips, and Quotes to Lift the Heart (Humor for the Heart)",
        "Authors": "By Various, MacDonald, Shari (COM), and Myers, Kristen",
        "Description": "Humor has the unique power to lift a heart to new heights, to heal the hurts of a bad day, and to infuse the soul with inspiration.   Samplings from some of your favorite authors and comedians include Patsy Clairmont, Martha Bolton, Mark Lowry, Carolyn Arends, and many more. This feel-good book will delight your feminine funny bone and tickle your female fancy.   Take a deep breath, inhale the joy, soak up the merriment, and you'll surely find that your heart is lighter, your day brighter, and your soul hilariously refreshed.",
        "Category": " Humor , Topic , Adult",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Miracle in a Daddy's Hug",
        "Authors": "By Burns, John",
        "Description": "In a world where so many boys and girls grow up deprived of their father's love, we see the repercussions of this depravation in the individual lives of these children and in society as a whole. The Miracle in a Daddy's Hug has a two-fold meaning: It's about the child who is a miracle full of miracles, and it's about the miracle-producing power of a daddy wrapping his arms, words, and heart around his child.This easy to read and understand book shares seven components of the miracle in a daddy's hug: First it examines the miracle of the child and the dad. Then, it looks at the value of touch, words, time, love, and faith. This book helps parents understand their children, it provides vision and strategies for both moms and dads, and it builds confidence in every dad that he can raise miracles called children.",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Howard Books/Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Queen of Clean Conquers Clutter",
        "Authors": "By Cobb, Linda",
        "Description": "When it comes to freeing your home of clutter (let's face it -- we all have it), The Queen of Clean really spells things out for you: Question Unpack Evaluate Eliminate Neaten up!  It's a foolproof sorting system for even the most devoted packrat: Question the best possible use of a room, a closet, a drawer...Unpack all of your clutter to get a sense of what you have (and what you need to do with it)...Evaluate each and every item you own...Eliminate unwanted possessions without guilt or regrets...and Neaten up your belongings in their newly decluttered space. You'll find your home and your life organized like never before as you conquer clutter in the kitchen, bedroom, bathroom, attic, basement -- even the garage!  The key, says the Queen, is to start small...and soon you'll be revved up and ready to straighten out every nook and cranny of your home. Her down-to-earth clutter-busting advice is built for speed; in a flash she sorts through and tidies up wallets, purses, drawers, closets, pantries, clothes, shoes, cosmetics, junk mail, linens, toys, books, videos, photos, collectibles, and much, much more!  The Queen makes even the most dreaded organizing tasks a breeze with hundreds of easy and practical tips! Find out how good it feels to be a savvy manager of all that threatens to invade your orderly domain with these simple and effective strategies from America's #1 housekeeping expert, the Queen of Clean®.",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Warrior: An Autobiography",
        "Authors": "By Chanoff, David and Sharon, Ariel",
        "Description": "Israel's newest prime minister as of February 6, 2001, Ariel Sharon is a dynamic and controversial leader. A hero in Israel's wars, perhaps the most daring and successful commander in Israel's extraordinary military history, Sharon has always been a warrior, whether the enemies were hostile Arab nations, terrorists, Time magazine, or rival politicians. The public man is well known -- aggressive in battle, hard-line in politics -- but the private man has always been obscured by Sharon's dazzling career and powerful personality. In this compelling and dramatic auto-biography, the real Sharon appears for the first time: a complex man, a loving father, a figure of courage and compassion. He is a warrior who commands the respect and love of his troops, a visionary, and an uncompromising, ruthless pragmatist.  Sharon tells his story with frankness, power, intelligence, and a brilliant gift for detail. Always controversial, he is as outspoken as his friends -- and enemies -- would expect him to be.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Williams-Sonoma New Healthy Kitchen: Starters: Williams-Sonoma New Healthy Kitchen: Starters",
        "Authors": "By Williams, Chuck (EDT) and Goldberg, Dan (PHT)",
        "Description": "With New Healthy Kitchen Starters, you can improve your diet while enjoying appetizers such as Cantaloupe and Feta Cheese Salad, Grilled Zucchini Skewers with Coriander, or Prosciutto-Wrapped Radicchio Wedges.   This colorful series of healthy cookbooks takes a commonsense approach to eating right. Food fads and trendy diets may come and go, but your family doctor can tell you that you will never go wrong eating a wide variety of fresh vegetables and fruits, whole grains, and legumes.   We all know that we're supposed to be eating several servings of each of these foods every day. But you might not know that we're also supposed to be eating as many different colors of fruit and vegetable as possible. The naturally occurring pigments that give vibrant colors to fruits and vegetables also offer an array of unique health benefits, boosting your immune system and fighting common diseases and conditions as you age. These pigments and other plant compounds -- known as antioxidants and phytochemicals -- work in tandem with vitamins, minerals, and fiber to keep our bodies strong and well.   The amazing benefits of colorful foods, whole grains, legumes, seeds, and nuts are being studied in labs across the country and touted by government experts on nutrition. But all the good advice in the world won't help you put a healthy dinner on the table. The books of the New Healthy Kitchen series -- Starters, Main Dishes, and Desserts -- will do just that.   The 60 recipes in these pages, grouped by the color of a key ingredient, offer dozens of appealing and easy ways to bring a rainbow of fruits, vegetables, and grains into your daily meals. Even better, 24 \"Fresh Ideas\" suggest simple ways of enjoying fresh produce as a wholesome and impromptu snack.   With New Healthy Kitchen Starters, eating right won't be a sacrifice or a chore. In these books, healthy food means good food, simply prepared and a pleasure to eat.",
        "Category": " Cooking , Courses & Dishes , Appetizers",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Williams-Sonoma New Healthy Kitchen: Main Dishes: Colorful Recipes for Health & Well-Being",
        "Authors": "By Williams, Chuck",
        "Description": "With New Healthy Kitchen Main Dishes, you can improve your diet while enjoying recipes such as Honey-Glazed Lamb Chops with Apricot Salsa, Quail with Roasted Fresh Figs, or Tabbouleh with Lemony Scallops. This colorful series of healthy cookbooks takes a commonsense approach to eating right. Food fads and trendy diets may come and go, but your family doctor can tell you that you will never go wrong eating a wide variety of fresh vegetables and fruits, whole grains, and legumes.   We all know that we're supposed to be eating several servings of each of these foods every day. But you might not know that we're also supposed to be eating as many different colors of fruit and vegetable as possible. The naturally occurring pigments that give vibrant colors to fruits and vegetables also offer an array of unique health benefits, boosting your immune system and fighting common diseases and conditions as you age. These pigments and other plant compounds -- known as antioxidants and phytochemicals -- work in tandem with vitamins, minerals, and fiber to keep our bodies strong and well.   The amazing benefits of colorful foods, whole grains, legumes, seeds, and nuts are being studied in labs across the country and touted by government experts on nutrition. But all the good advice in the world won't help you put a healthy dinner on the table. The books of the New Healthy Kitchen series -- Starters, Main Dishes, and Desserts -- will do just that.   The 60 recipes in these pages, grouped by the color of a key ingredient, offer dozens of appealing and easy ways to bring a rainbow of fruits, vegetables, and grains into your daily meals. Even better, 24 \"Fresh Ideas\" suggest simple ways of enjoying fresh produce as a snack or side dish.   With New Healthy Kitchen Main Dishes, eating right won't be a sacrifice or a chore. In these books, healthy food means good food, simply prepared and a pleasure to eat.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Never to forget: The Jews of the holocaust",
        "Authors": "By Meltzer, Milton",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.92",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Guinea Pigs: A Complete Pet Owner's Manual",
        "Authors": "By Behrend, Katrin",
        "Description": "Describes different kinds of guinea pigs and offers advice on selecting and keeping them as pets",
        "Category": " Pets , Reference",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Promise of the Wolves: A Novel (The Wolf Chronicles)",
        "Authors": "By Hearst, Dorothy",
        "Description": "The first in The Wolf Chronicles trilogy, brilliantly weaving together original research, lovable characters and a dynamic, thoroughly engaging plot, Promise of the Wolves is a historical adventure story in the tradition of Clan of the Cave Bear and Watership Down.Set 14,000 years ago in what is now Southern Europe, Promise of the Wolves is told from the point of view of Kaala, a young wolf born of a forbidden, mixed-blood litter. An outcast after her mother is exiled, Kaala struggles to earn her place in her pack. But her world is turned upside down when she rescues a human girl from drowning. Kaala and her young packmates begin hunting and playing with humans—risking expulsion from their pack and banishment from their home in the Wide Valley. When war between humans and wolves threatens, Kaala learns that she is the last in a long line of wolves charged with keeping watch over humans in order to prevent them from losing touch with nature and thus destroying the world. But to do so she must solve the great paradox of wolfkind: though wolves must always be with humans, humans cannot abide the presence of wolves, and every time the two come together, war ensues. Kaala must choose between safety for herself, her friends, and their human companions and the survival of her pack—and perhaps all of wolf and humankind.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Parker's Wine Buyer's Guide: The Complete, Easy-to-Use Reference on Recent Vintages, Prices, and Ratings for More than 8,000 Wines from All the Major Wine Regions, 7th Edition",
        "Authors": "By Parker, Robert M., Jr.",
        "Description": "Featuring a fresh layout, revised maps, and more detail than ever before, the eagerly anticipated seventh edition of Parker's Wine Buyer's Guide offers collectors and amateurs alike the ultimate resource to the world's best wines. In every way, this edition bears out Parker's stated goal: “To make you a more formidable, more confident wine buyer by providing you with sufficient insider's information to permit the wisest possible choice when you make a wine-buying decision.”Understanding that buyers on every level appreciate a good deal, Parker separates overvalued bottles from undervalued, with wine prices instantly shifting according to his evaluations. Indifferent to the wine's pedigree, Parker's eminent 100-point rating system allows for independent, consumer-oriented, inside information. The latest edition of Parker's Wine Buyer's Guide includes expanded information on Spain, Portugal, Germany, Australia, Argentina, and Chile, as well as new sections on Israel and Central Europe. As in his previous editions, Parker provides the reassurance of a simple number rating, predictions for future buying potential, and practical overviews of regions and grapes. Altogether, an indispensable resource from the man the Los Angeles Times calls “the most powerful critic of any kind.”",
        "Category": " Cooking , Beverages , Alcoholic , Wine",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Lonely Planet Arabian Peninsula (Travel Guides)",
        "Authors": "By Gordon, Frances Linzee and Ham, Anthony",
        "Description": "",
        "Category": " Travel , Middle East , General",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Greenwitch (The Dark is Rising Sequence)",
        "Authors": "By Cooper, Susan",
        "Description": "Simon, Jane, and Barney, enlisted by their mysterious great-uncle, arrive in a small coastal town to recover a priceless golden grail stolen by the forces of evil -- Dark. They are not at first aware of the strange powers of another boy brought to help, Will Stanton -- nor of the sinister significance of the Greenwitch, an image of leaves and branches that for centuries has been cast into the sea for good luck in fishing and harvest.  Their search for the grail sets into motion a series of distubing, sometimes dangerous events that, at their climax, bring forth a gift that, for a time at least, will keep the Dark from rising.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Put Your Eyes Up Here: And Other School Poems",
        "Authors": "By Karas, G. Brian (ILT) and Dakos, Kalli",
        "Description": "Put your eyes up here, put your eyes on me! Ms Roys asks for her students' attention, but she doesn't really need to. Who can ignore a teacher who wears silly hats and colorful skirts, has a graveyard for used-up pencils, believes in magic and ghosts, and has special eyeballs that let her see the things that make her students unique?   In this collection of fun, lively poems by Kalli Dakos, you'll explore the world of Ms. Roys's classroom -- and you may not want to go home!",
        "Category": " Juvenile Nonfiction , School & Education",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Standing Still: A Novel",
        "Authors": "By Simmons, Kelly",
        "Description": "Journalist and suburban mom Claire Cooper suffers from panic disorder. Most of her anxieties seem irrational, nothing that can't be fixed with the help of some Xanax. But late one stormy summer night, when her husband, Sam, is away on one of his frequent business trips, Claire's fears come to life. She discovers an intruder has broken into her young daughter's bedroom. She watches helplessly as he picks up her sleeping child from her bed. Desperate to protect her family, Claire puts herself in the line of fire and utters the plea that will undo her: \"Take me instead.\"   As she drives away in the kidnapper's car, Claire fears for her children, but not for herself. And she can't help noticing the reversal in her marriage -- for the first time in ten years, Sam will not know where she is.   For the next week, Claire is tied to a bed in a strange motel room, the intruder her only com-panion. She is forced to lie still and contemplate the reasons for this assault on her family. Is this just a random crime, or something more sinister? Has the shadowy past that she tried so hard to leave behind finally caught up with her? Day after day, she goes deeper into herself, reevaluating her marriage and her role as a mother, and unburying the source of her crippling anxiety. In seven days she will step out to the very brink of her soul -- perhaps never to return.   A riveting debut novel that will appeal to fans of Sue Miller and Janet Fitch, Standing Still is a powerful exploration of the darker side of mother-hood and marriage.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Sell & Resell Your Magazine Articles",
        "Authors": "By Burgett, Gordon",
        "Description": "Teaches marketing techniques to sell magazine articles, and includes advice on research, copyright, taxes, and topic-spoking",
        "Category": " Language Arts & Disciplines , Journalism",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Podium Humor",
        "Authors": "By Humes, James C.",
        "Description": "Explains the principles and techniques of effective use of humor in speeches and provides a cross-indexed smorgasbord of over six hundred stories, anecdotes, gags, and jokes for every occasion",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "A Simple Guide to U.S. Immigration and Citizenship (Esperanza)",
        "Authors": "By Cortes, Luis, Jr. and Immigrant Legal Resource Center (COL)",
        "Description": "A Simple Guide to U.S. Immigration and Citizenship    Immigration in America is a complex issue. And as with any worthwhile goal, securing your citizenship requires a lot of work. You'll face many obstacles, and potential pitfalls, but being educated about the process is the first step toward getting what you want.   The Reverend Luis Cortés Jr. has developed this simple guide to lead you through the complicated web of bureaucracy and to answer many of your questions. For example: What happens if you're in the United States without papers? What could prevent you from getting a green card? What are the different types of visas? You'll also find \"Warnings\" to protect you from fraudulent offers and the risk of deportation. Most important, Cortés informs you of your rights, because whether you're a legal immigrant or not, you do have rights.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Madeline In London",
        "Authors": "By Ludwig Bemelmans",
        "Description": "",
        "Category": "",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The (Reluctant , Nervous, Lazy, Broke, Busy, Confused) College Student's Cookbook",
        "Authors": "By Lambert, Joshua N. and Lee, Debby (ILT)",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    }
]