[
    {
        "Title": "Remembering Your Story,: A Guide for Spiritual Autobiography (Pathways in Spiritual Growth)",
        "Authors": "By Morgan, Richard Lyon",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Upper Room",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Gardener's Book of Needlepoint",
        "Authors": "By Bodi, Jack",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Hallie's Horrible Handwriting (Hopscotch Hill School)",
        "Authors": "By Allen, Joy (ILT) and Tripp, Valerie",
        "Description": "Hallie likes everything about school except handwriting, but her new teacher and a project with butterflies helps her like that too. Includes tips for parents to help their children with learning.",
        "Category": " Juvenile Fiction , Readers , Intermediate",
        "Publisher": "Amer Girl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Reading Fun",
        "Authors": "By Kerby, Mona",
        "Description": "Provides the busy library media specialist with seventy simple, but effective, activities designed to motivate students to read—and reproducible bookmarks, worksheets, games, and certificates to facilitate them.",
        "Category": " Language Arts & Disciplines , Library & Information Science , General",
        "Publisher": "Scarecrow Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Berlitz Japanese for travellers (Berlitz Phrase Books)",
        "Authors": "By Berlitz Guides",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Etiquette Guide to Japan: Know the Rules That Make the Difference",
        "Authors": "By De Mente, Boye",
        "Description": "",
        "Category": "",
        "Publisher": "Tuttle Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Gertie's Great Gifts",
        "Authors": "By Perle, Ruth Lerner",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier Enterprises",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "What Color is Your Parachute? A Practical Manual for Job-Hunters & Career-Changers",
        "Authors": "By Bolles, Richard Nelson",
        "Description": "A guide to discovering personal goals and interests explains how to apply that information toward obtaining satisfying employment",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Ten Little Monkeys Jumping on the Bed (Books with Holes (Paperback))",
        "Authors": "By Freeman, Tina (ILT)",
        "Description": "In this version of the traditional counting rhyme, illustrations and lyrics depict a doctor becoming increasingly annoyed as one monkey after another bumps his or her head while jumping on a bed, in a book that features die-cut pages.",
        "Category": " Juvenile Fiction , Toys, Dolls & Puppets",
        "Publisher": "Child's Play",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Robin Hood and the Great Coach Robbery. (Disney's wonderful world of reading)",
        "Authors": "By Walt Disney Productions",
        "Description": "Disguised as fortune tellers, Robin Hood and Little John stop Prince John's coach, tell his fortune, and carry off his gold.",
        "Category": "",
        "Publisher": "Random House Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1974"
        }
    },
    {
        "Title": "The Modern American Presidency",
        "Authors": "By Gould, Lewis L.",
        "Description": "The modern presidency, in the formulation of Gould (emeritus, history, U. of Texas at Austin), is characterized by the accretion of White House bureaucracy, formalized relations with Congress, greater power for the president as commander in chief, and the emergence of \"presidential stardom.\" While many historians mark Franklin Roosevelt's administration as the first modern presidency, Gould traces its earliest manifestations to the tenure of William McKinley and argues that it had emerged virtually full formed by 1921. He also makes the case for considering the Republican administrations of Harding, Coolidge, and Hoover important in the formation of modern presidential management, especially in terms of media relations. Annotation (c) Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , History & Theory",
        "Publisher": "Univ Pr of Kansas",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "America's Global Interests: A New Agenda",
        "Authors": "By Hamilton, Edward K. (EDT)",
        "Description": "Surveys the relative decline of American and Soviet influence in the world and the emergence of new powers, arguing that America can foster democracy and lessen military tension in this new world by using its still formidable powers",
        "Category": " Political Science , General",
        "Publisher": "Amer Assembly",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Explaining the History of American Foreign Relations",
        "Authors": "By Paterson, Thomas G., Hogan, Michael J. (EDT), Hogan, Michael J., and Paterson, Thomas G. (EDT)",
        "Description": "This collection of essays presents many of the newer, innovative, and stimulating analytical approaches and methods used to study the history of American foreign relations. The essays highlight a variety of conceptual categories, including bureaucratic, dependency, and models, culture, gender, and ideology. The book seeks to define the study of American relations, stimulate research in fresh directions, and encourage cross-disciplinary thinking, especially between historians and political scientists.",
        "Category": " History , United States , General",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Mastering Change: The Key to Business Success",
        "Authors": "By Martel, Leon",
        "Description": "A political scientist defines structural change and cyclical change and reveals the path to a successful personal and business future by anticipating change, preparing for it, and turning it to personal advantage",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Cat Who Lived High",
        "Authors": "By Braun, Lilian Jackson",
        "Description": "When a glamorous art dealer is killed in Jim Qwilleran’s high-rise, he and cats Koko and Yum Yum reach new heights of detection in this mystery in the Cat Who series.The colorful Casablanca apartment building is in danger of demolition—but not if Jim Qwilleran can help it. He’s determined to restore the building to its original grandeur. So he moves in with Koko and Yum Yum—and discovers that the Casablanca is steeped in history...and mystery. In Qwill’s very apartment, a glamorous art dealer met an untimely fate, and the veteran journalist and his crime-solving cats are about to reach new heights in detection as the evidence builds up...and the Casablanca threatens to crumble down around them!",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Class Cold Cuisine P",
        "Authors": "By Green, Karen",
        "Description": "",
        "Category": "",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Crazies to the Left of Me, Wimps to the Right: How One Side Lost Its Mind and the Other Lost Its Nerve",
        "Authors": "By Goldberg, Bernard",
        "Description": "The number one New York Times bestselling author Bernard Goldberg is back with more hard-hitting observations and no-nonsense advice for saving America from the lunatics on the Left and the sellouts on the Right. In Crazies to the Left of Me, Wimps to the Right, Goldberg speaks for the millions of Americans who are saying: Enough!Enough of lunatics like Rosie O'Donnell who think \"Radical Christianity\"—whatever that means—is \"as big a threat to America as Radical Islam.\" Enough of the hyperbolic liberal rhetoric comparing Bush to Hitler and Abu Ghraib to a Saddam Hussein torture chamber. Enough of the liberal media, in particular the New York Times, which Goldberg claims doesn't publish \"all the news that's fit to print\" so much as \"all the news that fits our ideology.\" And please, enough of the military-hating crazies who run San Francisco! (\"Just what this country needs,\" Goldberg writes, \"a city with Rice-A-Roni and a foreign policy.\")But Goldberg doesn't stop with the crazies on the Left. Speaking for fed-up conservatives, he also goes after the wimps on the Right—the gutless wonders in Washington who sold out their principles for power.He's had it with hypocritical Republicans who say they're for small government but then spend our hard-earned tax money like Imelda Marcos in a shoe store. He's also had it with the weak and timid Republicans who won't stand up and fight against racial preferences, too afraid that the Al Sharptons and Jesse Jacksons of the world will call them bigots. In plain English, he's had it with Republicans who are afraid to be conservative!In his most personal, provocative book yet, Bernard Goldberg argues that while conservatives still believe in important things, the jury is out on Republicans. The 2006 election was a wake-up call, he warns, and if the wimps on the Right fail to regain their courage, recover their principles, and reclaim their sense of fiscal responsibility, the crazies on the Left just might win the White House in 2008.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "JFK & Jackie. Unseen Archives",
        "Authors": "By Hill, Tim",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "7.52",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "First Lady, Public Wife",
        "Authors": "By Rosebush, James S.",
        "Description": "",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Madison Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Great Gardens of Britain",
        "Authors": "By Coats, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "TREASURE PRESS",
        "Price Starting With ($)": "6.74",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Bush Versus the Environment",
        "Authors": "By Devine, Bob",
        "Description": "Since becoming president, George W. Bush has walked away from the Kyoto Protocol, pushed for oil drilling in the Arctic National Wildlife Refuge, undermined protections for endangered species and wilderness, and retreated from his campaign pledge to regulate carbon dioxide. But the president’s agenda reaches deeper than these well-known policies. In Bush Versus the Environment, Robert Devine shows how the White House is quietly undermining the entire system of environmental safeguards that has developed over the past thirty years. The administration's tactics include:-Encouraging lawsuits against the federal government that challenge existing environmental laws, and then feebly defending the cases in court.-Ignoring science that doesn’t support the president's goals, and pressuring government scientists to produce the results the administration wants.-Using fuzzy math to overestimate the costs and underestimate the benefits of regulations that protect human health and the environment, which can lead to the elimination of much-needed rules.These are just a few of the administration’s strategies, which are being pursued beneath the radar of a public that overwhelmingly supports environmental protections. Bush Versus the Environment is a compelling and important look at one of the most important issues facing America today, one that will have consequences that last long after Bush has left office.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "The Judas Strain (Sigma Force)",
        "Authors": "By Rollins, James",
        "Description": "ju·das strain, n. A scientific term for an organism that drives an entire species to extinctionA master at combining historical and scientific intrigue with cutting-edge adventure, New York Times bestselling author of Map of Bones and Black Order James Rollins returns with his most relentless, high-octane thriller to date—a terrifying story of an ancient menace reborn to plague the modern world . . . and of an impossible hope that lies hidden in the most shocking place imaginable: within the language of angels.From the depths of the Indian Ocean, a horrific plague has arisen to devastate humankind—a disease that's unknown, unstoppable . . . and deadly. But it is merely a harbinger of the doom that is to follow.Aboard a cruise liner transformed into a makeshift hospital, Dr. Lisa Cummings and Monk Kokkalis—operatives of the shadowy covert organization SIGMA Force—search for answers to the bizarre affliction that has inexplicably washed ashore. But there are others with far less altruistic intentions. In a savage and sudden coup, terrorists hijack the vessel, turning a mercy ship into a floating bio-weapons lab.At a Fourth of July celebration a world away, SIGMA's commander Gray Pierce thwarts the murderous schemes of a beautiful assassin—a would-be killer who holds the first clue to the discovery of a possible cure. With the fate of every man, woman, and child on Earth hanging in the balance, Pierce joins forces with the woman who wanted him dead, and together they embark upon an astonishing quest—one that winds through Venetian tombs, Byzantine cathedrals, and jungle-encrusted ruins—following the trail of the most fabled explorer in history: Marco Polo.But time is an enemy as a worldwide pandemic grows rapidly out of control. And as a relentless madman dogs their every step, Pierce and his unlikely ally are being pulled into an astonishing mystery buried deep in antiquity and in humanity's genetic code. And as the seconds tick closer to doomsday, Pierce will realize he can truly trust no one—not the bewitching enigma who runs at his side or even those who are closest to him—for any one of them could be . . . a Judas.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "The Dragon's Eye: The Dragonology Chronicles, Volume One (Ologies)",
        "Authors": "By Steer, Dugald and Carrel, Douglas (ILT)",
        "Description": "For the first time ever, DRAGONOLOGY fiction! Introducing the Dragonology Chronicles — full-length novels with enough fire-breathing adventure to satisfy true DRAGONOLOGY fans who just can't get enough!Adventure! Villains! And dragons, dragons, dragons! Brought to us by the creators of the runaway NEW YORK TIMES bestsellers DRAGONOLOGY and THE DRAGONOLOGY HANDBOOK, the Dragonology Chronicles are a series of dragon adventures told by one of Dr. Drake's young students. In Volume 1 of the Chronicles, THE DRAGON'S EYE, Daniel Cook and his sister, Beatrice, spend the summer with their parents' eccentric former tutor, Dr. Ernest Drake. Not only do Daniel and Beatrice begin to study dragonology, but they are also soon caught up in the race to find the stolen Dragon's Eye jewel - which has the power to reflect the true Dragon Master - before it is stolen by evil dragonologist Ignatius Crook. The two must work with Dr. Drake — as well as many friendly dragons — to foil Ignatius and recover the Dragon's Eye.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Freedom Writers Diary: How a Teacher and 150 Teens Used Writing to Change Themselves and the World Around Them",
        "Authors": "By Freedom Writers, Gruwell, Erin, and Filipovic, Zlata (FRW)",
        "Description": "Shocked by the teenage violence she witnessed during the Rodney King riots in Los Angeles, Erin Gruwell became a teacher at a high school rampant with hostility and racial intolerance. For many of these students–whose ranks included substance abusers, gang members, the homeless, and victims of abuse–Gruwell was the first person to treat them with dignity, to believe in their potential and help them see it themselves. Soon, their loyalty towards their teacher and burning enthusiasm to help end violence and intolerance became a force of its own. Inspired by reading The Diary of Anne Frank and meeting Zlata Filipovic (the eleven-year old girl who wrote of her life in Sarajevo during the civil war), the students began a joint diary of their inner-city upbringings. Told through anonymous entries to protect their identities and allow for complete candor, The Freedom Writers Diary is filled with astounding vignettes from 150 students who, like civil rights activist Rosa Parks and the Freedom Riders, heard society tell them where to go–and refused to listen.Proceeds from this book benefit the Freedom Writers Foundation, an organization set up to provide scholarships for underprivieged youth and to train teachers",
        "Category": " Education , Student Life & Student Affairs",
        "Publisher": "Broadway",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Clue of the Velvet Mask (Nancy Drew #30)",
        "Authors": "By Keene, Carolyn",
        "Description": "A masquerade party at the Hendricks’ mansion quickly turns into a mystery when Nancy and her favorite date, Ned Nickerson, spy a stranger about to climb the rose trellis to the second story. Who is this enigmatic man in the black cloak and the exotic woman in the Javanese costume? Are they members of a gang of wily thieves who sneak into partied given by wealthy people and steal jewels and art treasures? And why is the owner of the black velvet hooded mask that Ned finds in the Hendricks’ garden so desperate to get it back? To find the answers Nancy and her friend George devise a daring plan. The two girls switch identities! George soon discovers that while it is exciting to play amateur detective it can be dangerous to masquerade as Nancy Drew.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "Special purpose rooms (Home repair and improvement)",
        "Authors": "By Time-Life Books",
        "Description": "Shows how to create a utility room, sewing room, studio, and playroom, discusses modifications for the disabled, and demonstrates techniques for working with plumbing and electrical circuits",
        "Category": "",
        "Publisher": "School and library distribution by Silver Burdett Co",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Devil's Dream",
        "Authors": "By Smith, Lee",
        "Description": "\"She writes lyric, luminous prose; her craft is so strong it becomes transparent, and, like the best of storytellers, she knows how to get out of the way so that the story can tell itself.\"SAN FRANCISCO CHRONICLEMoses Bailey, a preacher's son, forbade his fiddle-loving wife Kate Malone to play. But while he was gone on his travels, looking for God, Kate couldn't help herself, and began fiddling for her three children. For the love of music, Kate is willing to defy anyone who tries to stop her. From generation to generation, the gift and love of music cannot be stopped, and no Malone is immune from its spell.",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Berlitz French Phrase Book & Dictionary",
        "Authors": "By Berlitz International, Inc.",
        "Description": "",
        "Category": " Travel , Reference",
        "Publisher": "Berlitz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Jewish Festivals: History and Observance (English and Hebrew Edition)",
        "Authors": "By Schauss, Hayyim",
        "Description": "Traces the rich symbolism, ritual practices and prayers, special foods, and customs of the Jewish holidays to their historical roots.",
        "Category": "",
        "Publisher": "Schocken",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "1001 Do-It-Yourself Hints and Tips",
        "Authors": "By Reader's Digest Association",
        "Description": "1001 Do-It-Yourself Hints & Tips covers the basics of keeping the household in safe, working order inside and outside. There are tips on repairing damaged tile, plaster, and wallboard; cleaning a water heater; silencing squeaky stairs and floors; patching the roof; installing gutters and fixing gutters that leak; replacing wood clapboard and repairing timeworn vinyl or aluminum siding; and weatherproofing drafty doors and windows.1001 Do-It-Yourself Hints & Tips is also packed with suggestions for improving the look of your home. The easy-to-follow instructions for painting and wallpapering are just the start. You'll also discover how to bring order to kitchens, closets, workshops, and storage spaces; strip and refinish furniture; reupholster, recane, or rewicker chairs; install wainscoting; and replace a ceiling fixture or put in track lighting. Home security is also covered with essential how-tos on installing home alarms, dead-bolt locks, and smoke and carbon monoxide detectors.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Clean It Fast, Clean It Right : The Ultimate Guide to Making Absolutely Everything You Own Sparkle and Shine",
        "Authors": "By Bredenberg, Jeff (EDT)",
        "Description": "Drawing on the know-how of more than two hundred experts and organized in an easy-to-find format, this entertaining reference offers valuable advice on cleaning, removing problem spots, saving money, and developing efficient cleaning methods. 15,000 first printing.",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Practicing Our Faith",
        "Authors": "By Bass, Dorothy C. (EDT)",
        "Description": "As wise as grandparents, a good guide to living within our families and communities with integrity and generosity.-- Kathleen Norris, author of Dakota and The Cloister WalkMany people are looking for ways to deepen their relationship with God by practicing their faith in everyday life. Some go on retreats but are often disappointed. Many thoughtful, educated people search for spiritual guidance in Eastern religious traditions, unaware of the great riches within their own heritage. Dorothy Bass and the other contributors to this multi-denominational collection show how they can shape a faithful way of life during challenging times at work, at home, and in the community. This book explores the stuff of everyday life, placing ordinary activities in a biblical and historical context, and discovering in them opportunities to realize God's active presence in life.Practices include:* Honoring the body * Hospitality * Household economics * Saying yes and saying no* Keeping Sabbath* Testimony* Discernment* Shaping Communities* Forgiveness* Healing",
        "Category": " Religion , Christian Life , General",
        "Publisher": "John Wiley & Sons Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "LOST RIGHTS: The Destruction of American Liberty",
        "Authors": "By Bovard, James",
        "Description": "From Justice Department officials seizing people's homes based on mere rumors to the IRS and its master plan to prohibit the nation's self-employed from working for themselves to the perpetrators of the Waco siege, government officials are tearing the Bill of Rights to pieces. Today's citizen is now more likely than ever to violate some unknown law or regulation and be placed at the mercy of an administrator or politician hungering for publicity. Unfortunately, the only way many government agencies can measure their \"public service\" is by the number of citizens they harass, hinder, restrain, or jail. James Bovard's Lost Rights provides a highly entertaining analysis of the bloated excess of government and the plight of contemporary Americans beaten into submission by a horrible parody of the Founding Fathers' dream.",
        "Category": " Political Science , Civil Rights",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Book of Shadowboxes: A Story of the ABC's",
        "Authors": "By Seeley, Laura L. and Seeley, Laura L. (ILT)",
        "Description": "Welcome to an enchanting world of shadowboxes, where the ABCs spring magically to life.Each shadowbox is filled with richly colorful creatures, objects, and people drawn in an intricately engaging style. From smiling acorns and alphabet stew to zany old zeroes with nothing to do, the vibrant illustrations and bouncing verses delight and instruct. Shadow, the reader’s guide through the shadowboxes, follows each letter and poses an intriguing mystery to solve. At the back of the book is a key to all the other hidden treasures collected in the shadowboxes.",
        "Category": " Juvenile Nonfiction , Concepts , Alphabet",
        "Publisher": "Peachtree Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Inside the Asylum: Why the UN and Old Europe are Worse Than You Think",
        "Authors": "By Babbin, Jed L.",
        "Description": "Babbin details how the United Nations actively pursues anti-American policies and appeases America's enemies, while being largely funded by $3 billion worth of annual American dues. After revealing the depth of rampant corruption in the UN, Babbin concludes that it is time to recognize the changes in Old Europe and redesign America's alliances that line up with America's national interests.",
        "Category": " Political Science , International Relations , Diplomacy",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Activists beyond Borders: Advocacy Networks in International Politics",
        "Authors": "By Keck, Margaret E. and Sikkink, Kathryn",
        "Description": "In Activists beyond Borders, Margaret E. Keck and Kathryn Sikkink examine a type of pressure group that has been largely ignored by political analysts: networks of activists that coalesce and operate across national frontiers. Their targets may be international organizations or the policies of particular states. Historical examples of such transborder alliances include anti-slavery and woman suffrage campaigns. In the past two decades, transnational activism has had a significant impact in human rights, especially in Latin America, and advocacy networks have strongly influenced environmental politics as well. The authors also examine the emergence of an international campaign around violence against women.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Cornell University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "5 Minute Bedtime Stories",
        "Authors": "By Nicole Baxter",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "The Little Mermaid: A Read-Aloud Storybook",
        "Authors": "By Edgar, Amy",
        "Description": "Based on the hit Disney film, a special edition storybook with a pull-out poster lets even the youngest child re-live Princess Ariel's underwater adventures and her search for a handsome prince.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "World and United States Aviation & Space Records 2001",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "National Aeronautic Association of USA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Primitive Art",
        "Authors": "By Adam, Leonhard",
        "Description": "",
        "Category": "",
        "Publisher": "Pelican Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1949"
        }
    },
    {
        "Title": "Pre-Calculus Demystified",
        "Authors": "By Huettenmueller, Rhonda",
        "Description": "Packed with practical examples, graphs, and Q&As, this complete self-teaching guide from the best-selling author of Algebra Demystified covers all the essential topics, including: absolute value, nonlinear inequalities, functions and their graphs, inverses, proportion and ratio, and much more.",
        "Category": " Mathematics , Pre-Calculus",
        "Publisher": "McGraw-Hill Professional",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Physics Demystified : A Self-Teaching Guide (Demystified)",
        "Authors": "By Gibilisco, Stan",
        "Description": "YOU DON’T HAVE TO BE A ROCKET SCIENTIST TO UNDERSTAND PHYSICSNow anyone with an interest in the physical sciences can master physics -- without formal training or drowning in a sea of complicated formulas and equations. In Physics Demystified best-selling author Stan Gibilisco offers a fun, effective, and totally painless way to learn the fundamentals and general concepts of physics. With Physics Demystified you master the subject one simple step at a time – at your own speed. Unlike most books on physics, general principles are presented first – and the details follow. In order to make the learning process as clear and simple as possible, heavy-duty math, formulas, and equations are kept to a minimum.  This unique self-teaching guide offers questions at the end of each chapter and section to pinpoint weaknesses, and a 100-question final exam to reinforce the entire book.Simple enough for a beginner but challenging enough for an advanced student, Physics Demystified is your direct route to learning or brushing up on physics.HERE’S EVERYTHING YOU NEED TO:* Understand the math used in physical science* Solve mass/force/acceleration problems* Create mathematical models of physical phenomena* Perform distance vs. time calculations* Determine potential and kinetic energy* Calculate the wavelength of sounds and radio signals* Understand visible light interference patterns* Calculate the energy and frequency of a moving particle* Understand atomic structure* Learn about electric current, voltage, resistance, power, and energy",
        "Category": " Science , Physics , General",
        "Publisher": "McGraw-Hill Professional",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "The Philosophy of Modern Art",
        "Authors": "By Read, Herbert",
        "Description": "",
        "Category": "",
        "Publisher": "Meridian",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "How to Carve Wood: A Book of Projects and Techniques",
        "Authors": "By Butz, Richard",
        "Description": "Woodcarver Richard Butz teaches chapter by chapter whittling, chip carving, wildlife carving, relief carving, lettering, and architectural carving. In How to Carve Wood, the reader learns by doing, working through carefully illustrated and progressively more challenging exercises and projects. Butz provides scaled patterns for each project and ends each chapter with a gallery of additional projects using the techniques learned.",
        "Category": " Crafts & Hobbies , Carving",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Better Homes and Gardens Stretching Living Space",
        "Authors": "By Better Homes and Gardens Books (COR)",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Reader's Digest Home Improvements Manual",
        "Authors": "By Reader's Digest Association (EDT)",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1982"
        }
    },
    {
        "Title": "Wiring 1-2-3",
        "Authors": "By Home Depot",
        "Description": "Offers over 150 tips and 125 interior wiring projects for improving older electrical systems and replacing switches.",
        "Category": " House & Home , Do-It-Yourself , Electrical",
        "Publisher": "The Home Depot",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Harp of the Grey Rose: The Legend of Cerin Songweaver",
        "Authors": "By De Lint, Charles",
        "Description": "When young Cerin, an outsider in the village of Wran Cheaping, falls in love with the maid of the Grey Rose, the betrothed of Yarac Stone-slayer, Yarac abducts his promised bride, and Cerin vows to save her",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Cat Who Moved a Mountain",
        "Authors": "By Braun, Lilian Jackson",
        "Description": "A murder in the mountains has Jim Qwilleran and his cats Koko and Yum Yum feeling on edge in this mystery in the bestselling Cat Who series.Qwill’s on top of the world when he rents a house on Big Potato Mountain. The owner, J.J. Hawkinfield, brought real estate development to the once-peaceful Potatoes. But Hawkinfield paid a steep price for his enterprise: He was pushed off a cliff by an angry mountain dweller. Qwilleran, however, suspects the man is innocent—and Koko’s antics have him convinced something’s wrong. He may be making a mountain out of a molehill...but he’s determined to find the truth. Even if it means jumping out of the frying pan and into the fire!",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Environmental Politics and Policy (Environmental Politics & Policy)",
        "Authors": "By Rosenbaum, Walter A",
        "Description": "The latest edition of Rosenbaum's long-lived text reorganizes the foundational chapters for greater clarity and continuity, updates the case studies and other examples, and eliminates material that's no longer essential. The text provides an overview of the more enduring institutions and processes of American environmental policy making as well as an assessment of their ongoing transformation and implications. Rosenbaum is professor emeritus of political science at the U. of Florida. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , Public Policy , Environmental Policy",
        "Publisher": "Cq Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Causal Modeling (Quantitative Applications in the Social Sciences)",
        "Authors": "By Asher, Herbert B",
        "Description": "A substantially revised and updated edition of an earlier volume in the series. Asher presents a number of techniques of causal modelling, beginning with the work of Simon and Blalock, and moving on to recursive and non-recursive path estimation. Special attention is given to a number of problems in the causal analysis of data, with illustrations from studies in political socialization and voting behaviour.",
        "Category": " Social Science , Research",
        "Publisher": "SAGE Publications, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Canonical Analysis and Factor Comparison (Quantitative Applications in the Social Sciences)",
        "Authors": "By Levine, Mark S.",
        "Description": "An advanced study which presumes a knowledge of multiple regression and factor analysis techniques, this paper considers two techniques for comparing entire sets of data, and develops the canonical correlation model as an extension of regression analysis in which there are several dependent variables.",
        "Category": " Social Science , Research",
        "Publisher": "SAGE Publications, Inc",
        "Price Starting With ($)": "16.5",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "Losing A Parent",
        "Authors": "By Marshall, Fiona",
        "Description": "",
        "Category": "",
        "Publisher": "Fisher Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The French Betrayal of America",
        "Authors": "By Timmerman, Kenneth R.",
        "Description": "Can we trust France? Apparently not. After more than 200 years of shared history and interests, the U.S.-France marriage looks as if it's ending in an acrimonious divorce. Here is the shocking insider account.In the wake of French behavior at the United Nations, where Foreign Minister Dominique de Villepin systematically undermined the efforts of Secretary of State Colin Powell to convince the Security Council to authorize force against Iraq, Americans have at best come to suspect our ally of double dealing, and at worst come to view them as the enemy. Almost daily over the past year, new stories have emerged of how the government of French President Jacques Chirac has sought to undermine the U.S. war on terror, publicly sniping at America and inciting other countries to do the same. What's wrong with France? What's behind their recent perfidy? According to bestselling author Kenneth R. Timmerman, the American public doesn't know half the story. After they read The French Betrayal of America, American anger at France will turn to outrage.Timmerman, who worked as a journalist in France for eighteen years and knows the players on both sides, lifts the veil of Jacques Chirac's scandalous love affair with Saddam Hussein, beginning in 1975, when he took him on a tour of top-secret French nuclear facilities. The French attitude toward the dictator, which seemed to baffle American politicians, was in fact entirely predictable. Put bluntly, it was all about money, oil, and guns. Chirac needed Saddam's oil and Saddam's money, and Saddam needed French weapons and French nuclear technology. Despite this, the relationship between France and America was not only amicable but at times very mutually beneficial. That was until the most recent war on Iraq, where France turned the tables, engaging in dirty diplomacy and helping to sway other European countries to their side. French war coverage was not merely one-sided: It was viciously inaccurate, skewed, and openly anti-American. Timmerman also presents incredible new evidence of France's duplicity, including the fact that the French stood to gain $100 billion from secret oil contracts they had concluded with Saddam Hussein.The French Betrayal of America raises questions of whether the nuclear cooperation agreements still in force with the French today should be canceled in light of France's behavior. Our security interests no longer converge, and our economic systems increasingly appear to be at loggerheads. The war in Iraq harshly exposed French treachery and their desire to do business with the worst of international tyrants, putting their economy, their international standing, and their relationship with a 200-year-old friend in severe jeopardy. Shocking new revelations in The French Betrayal of AmericaThe French president lied to Bush and to the public about the war in Iraq.President Jacques Chirac had personally told President George W. Bush well ahead of time that France would be at America's side.France urged Saddam to commit genocide.Saddam launched his genocidal campaign against the Marsh Arabs in southern Iraq to make their region \"safe\" for French oil engineers.France helped build Saddam's long-range missiles and nukes.Based on exclusive access to new documents, provided by Iraq to the United Nations -- that French defense companies were key partners in helping Saddam Hussein perfect the long-range missiles that killed U.S. soldiers in Saudi Arabia in 1991 and rained terror onto Israel. Chirac has blocked cooperation on a high-profile terrorism case.France's top counter-terrorism judge was ordered to stop cooperating with the United States in the prosecution of Zacarias Moussaoui despite mounds of documents that would have helped the United States to convict Moussaoui of conspiracy to commit mass murder.France illegally sold U.S. military secrets to Saddam Hussein.A prominent French defense company shipped U.S.-designed laser designator pods to Iraq in the 1980s that compromised the most high-tech weapons in the U.S. arsenal.President Mitterrand, a Socialist, became Ronald Reagan's best ally in Europe.The French Betrayal of America reveals the extent of French strategic and intelligence cooperation with the United States at the peak of the Cold War, in areas that will surprise readers on both sides of the Atlantic. The French ran a key agent inside the KGB, whose \"cosmic\" reach -- right up to the general secretary of the Communist Party of the Soviet Union -- hastened the collapse of the Soviet Union. President Chirac almost went to jail for corruption.Chirac was on the verge of getting indicted on corruption charges in 1999 until he cooked up an immunity deal with the head of the French Supreme Court, former Socialist foreign minister Roland Dumas. While the French corruption scandals are well known in France, they have rarely been reported in the United States and will alternately shock and amuse American readers.The Bush administration is now offering France the secrets of our national missile defense.The French Betrayal of America reveals the hitherto top secret missile defense cooperation between the United States and France that has taken off at precisely the same time the Chirac government was undermining the United States on Iraq. Meanwhile, United States and French nuclear weapons designers continue to meet to exchange secrets of maintaining our respective nuclear arsenals.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Crown Forum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Exploratory Data Analysis (Quantitative Applications in the Social Sciences)",
        "Authors": "By Hartwig, Frederick and Dearing, Brian E.",
        "Description": "An introduction to the underlying principles, central concepts, and basic techniques for conducting and understanding exploratory data analysis -- with numerous social science examples.",
        "Category": " Social Science , Research",
        "Publisher": "SAGE Publications, Inc",
        "Price Starting With ($)": "16.5",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "Multiple Indicators: An Introduction (Quantitative Applications in the Social Sciences)",
        "Authors": "By Sullivan, John Lawrence and Feldman, Stanley",
        "Description": "A presentation and critique of the use of multiple measures of theoretical concepts for the assessment of validity (using the multi-trait multi-method matrix) and reliability (using multiple indicators with a path analytic framework).",
        "Category": " Social Science , Research",
        "Publisher": "SAGE Publications, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "All Fall Down: America's Tragic Encounter With Iran",
        "Authors": "By Sick, Gary",
        "Description": "A former naval intelligence officer and National Security Council staff member provides a day-to-day account of the Iranian revolution, the hostage crisis, and America's failure to deal effectively with both",
        "Category": " History , United States , 20th Century",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Kitchen Wisdom",
        "Authors": "By Arkin, Frieda",
        "Description": "An updated and expanded revision of The Cook's Companion provides the new or experienced cook with complete information on foods, methods, and utensils",
        "Category": "",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1977"
        }
    },
    {
        "Title": "The Official Encyclopedia of Bridge",
        "Authors": "By Richard L. Frey",
        "Description": "",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Phenomenon: Everything You Need to Know About The Paranormal",
        "Authors": "By Browne, Sylvia and Harrison, Lindsay",
        "Description": "An a-to-z compendium of elements in the spiritual and supernatural world that influence mortal life explores the nature of numerology, reincarnation, ghosts, and other phenomena, in a volume complemented by case stories and predictions for future events. By the author of The Other Side and Back. 300,000 first printing.",
        "Category": " Body, Mind & Spirit , Parapsychology , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Secret Societies",
        "Authors": "By Daraul, Arkon",
        "Description": "",
        "Category": "",
        "Publisher": "Fine Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Sacred Origins of Profound Things: The Stories Behind the Rites and Rituals of the World's Religions (Compass)",
        "Authors": "By Panati, Charles",
        "Description": "In this enlightening and entertaining work, Charles Panati explores the origins of hundreds of religious rituals, customs, and practices in many faiths, the reasons for religious holidays and sacred symbols, and the meanings of vestments, sacraments, devotions, and prayers. Its many revelations include:*          Why the Star of David became the Jewish counterpart of the Christian cross*          What mortal remains of the Buddha are venerated today*          How the diamond engagement ring became a standard*          That the first pope was a happily married man*          How Hindu thinkers arrived at their concept of reincarnation*          Why Jews don't eat pork, why some Muslims don't eat certain vegetables, and how some Christians came to observe meatless FridaysSacred Origins of Profound Things is an indispensable resource for all those interested in the history of religion and the history of ideas--and an inspiring guide to those seeking to understand their faith.",
        "Category": " Social Science , Sociology of Religion",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "The Wounded Spirit",
        "Authors": "By Peretti, Frank E.",
        "Description": "If you've ever been there,you've never forgotten. The feeling is as haunting and familiar as the smellof a junior high school locker room.It's the feeling of being undersized … or oversized … or klutzy … or less than beautiful. Of being a nerd … or a geek … or just, somehow, different.It's knowing you are vulnerable-and someone is ready and willing to take full advantage of your weakness by making your life miserable.It's the fraternity you never wanted to join-the fellowship of the wounded spirit.And bestselling novelist Frank Peretti is a member, too.This book is the haunting true story of pain Frank Peretti never forgot but never, until recently, shared with the world. It's the story of growing up with a medical condition that left him disfigured. A series of surgeries and the slow miracle of answered prayer took care of the deformity, but not the underdeveloped frame or the excruciating reality of being different. And it was for these petty \"crimes\" that Peretti was prosecuted every day at school-especially in gym class, but also in the halls, on the school grounds, even in his own neighborhood. No wonder he found himself relating to movie monsters who were hated but also feared-and who eventually exacted a bloody revenge on their tormentors!In Peretti's case, deliverance eventually came-through time, through prayer, through a teacher's caring intervention, and his own willingness to seek help. But he has never forgotten what life was like at the bottom of the junior high foodchain. And from the reservoir of those agonizing memories he sends a compelling message to victims, to bullies, and to authorities who have the power to intervene-that it's never OK for the strong to abuse the weak. And that we allow such abuse at the expense of our souls … and our very civilization.Especially in the wake of the massacre at Columbine High School-perpetuated by two troubled but also tormented outsiders--this message takes on haunting resonance. Frank Peretti believes we cannot afford to overlook the continuing reality of wounded spirits, not only in our schools, but in our homes, churches, and workplaces. His approach is both tender and tough as he issues a ringing call for a change in attitude.It's a call for all of us to stop thinking of abuse as \"normal,\" even among kids.It's a call for the strong to stand up and protect the weak, not prey upon them.It's a call for those in authority to pay attention to the violence being done to the vulnerable in the midst of our everyday lives and to take action to help.Most of all, it's a call for bullies and victims alike (many of us are both) to seek the healing and forgiveness offered in Jesus Christ. For that healing is really the heart of this book-the only reality that can break the natural cycle of victimization and abuse.Only in Christ, Peretti reminds, is there hope for the wounded spirits-but that hope ispowerful enough to change everything.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Marsalis on Music",
        "Authors": "By Marsalis, Wynton",
        "Description": "Marsalis on Music, the illustrated companion book-with-CD to Wynton Marsalis's groundbreaking television series, is the perfect introduction to the joy of music, both classical and jazz, for families, young people, and music-hungry readers of all ages.In chapters that correspond to the four one-hour programs in the series, and a Listening Guide and audio CD prepared exclusively for the book, Wynton Marsalis uses wonderfully appealing examples and analogies to communicate the fundamentals of music. Whether likening the rhythmic structures of music to playing basketball, teaching sonata form through a story about chasing a pet hamster through a shopping mall, or revealing the connections between classical music and jazz, Marsalis on Music makes so-called \"difficult\" music vivid, immediately graspable, and most of all fun.Produced by an Emmy Award-winning team from Sony Classical Film & Video, the television and home video series \"Marsalis on Music\" was shot at the Tanglewood Music Center with the participation of Seiji Ozawa, Yo-Yo Ma, the Wynton Marsalis Septet, the Liberty Brass Band, the Tanglewood Music Center Orchestra, and an excited audience of young people. Its premiere around the world in 1995 includes broadcasts in the United States, Great Britain, Japan, and Europe.",
        "Category": " Music , Genres & Styles , Classical",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Police Your Planet",
        "Authors": "By Lester Del Rey",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "April",
            "Year": "1975"
        }
    },
    {
        "Title": "Symbols of Islam (Symbols of religion series)",
        "Authors": "By Chebel, Malek",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Cat Who Saw Red",
        "Authors": "By Braun, Lilian Jackson",
        "Description": "Jim Qwilleran and his cats Koko and Yum Yum must solve a curious caper in this mystery in the bestselling Cat Who series.Something is amiss at Maus Haus. Not just the mystery of an unsolved “suicide” which hangs over the old mansion, but something ominous in the present-day residence. When Qwilleran moves in to work on his new gastronomical assignment, strange things begin to happen. First it's a scream in the night, then a vanishing houseboy. But when his old girlfriend disappears, something has to be done. Qwilleran, Koko and Yum Yum set out to solve the mystery—and find a murderer!",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "Cruelty and Silence: War, Tyranny, Uprising and the Arab World",
        "Authors": "By Makiya, Kanan",
        "Description": "The first alarm about the brutality and totalitarian nature of Saddam Husain's regime was sounded eloquently in the widely praised international bestseller, Republic of Fear. Writing then under the pseudonym Samir al-Khalil, Kanan Makiya, an Iraqi dissident in exile, exposed the premise and methodology of Saddam's Ba'ath Party and the power it wields over the state. Now - in Cruelty and Silence, writing for the first time under his own name, Makiya widens his scope to bravely - and certainly controversially - confront the rhetoric of Arab and pro-Arab intellectuals with the realities of political cruelty in the Middle East.Part One, a compelling example of the literature of witness, is a journey through cruelty told in the words of Khalil, Abu Haydar, Omar, Mustafa, and Taimour - the Arab and Kurdish heroes of this book. In a bid to place cruelty at the center of Arab discourse, the author fashions their testimony into stories, or metaphors for occupation, prejudice, revolution, and routinized violence. In 1991 Makiya entered Northern Iraq on a clandestine mission. He was the first person to bring the Ba'ath Party's campaign of mass murder known as the Anfal - a campaign comparable to those perpetrated by the Nazis and the Khmer Rouge - to the attention of the outside world. His account of the Anfal is contained in \"Taimour\" and it brings the journey through cruelty to a close.In Part Two, \"Silence,\" Makiya links these tales of survival to an examination of the Arab intelligentsia's response to Saddam Husain and the Gulf War, showing that the flood of condemnation of the West for its handling of the crisis was barely matched by a trickle of protest over Saddam's brutal massacres of Arabs and Kurds. The words of intellectuals, he demonstrates, are separated by a gigantic chasm from those of the survivors. Makiya is sharply critical of the Israeli occupation of the West Bank and Gaza and also of the way the Gulf War was conducted and left unfinished by the Allied coalition. But he also argues that \"anti-Zionism\" and \"anti-imperialism\" have been turned by the Arab and pro-Arab intelligentsia into a \"politics of silence\" towards cruelty.In his exploration of these \"landscapes of cruelty and silence,\" Makiya lays out the nationalist mythologies that underpin them. He calls for a new politics in the Arab world - a politics that puts absolute respect for human life, and revulsion at cruelty, above all else.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "The Tale Of The Tardy Oxcart",
        "Authors": "By Swindoll, Charles R. (EDT)",
        "Description": "In The Tale of The Tardy Oxcart, Charles Swindoll shares from his lifelong collection of his and others' personal stories, sermons, and anecdotes. 1501 various illustrations are arranged by subjects alphabetically for quick-and-easy access. A perfect resource for all pastors and speakers.Publisher's Note: This book is now available as Swindoll's Ultimate Book of Illustrations & Quotes(ISBN 0785250255)",
        "Category": " Religion , Christian Ministry , Preaching",
        "Publisher": "Nelson Reference & Electronic Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Purpose Driven Church: Every Church Is Big in God's Eyes",
        "Authors": "By Warren, Rick",
        "Description": "“The Purpose Driven® Church has brought focus and direction to more pastors and church leaders than you can count. What a gift!”—John Ortberg, bestselling author Every church is driven by something. Tradition, finances, programs, personalities, events, seekers, and even buildings can each be the controlling force in a church. But Rick Warren believes that in order for a church to be healthy it must become a purpose-driven church, built around the five New Testament purposes given to the church by Jesus. “The issue is church health, not church growth!” declares Warren. “If your church is healthy, growth will occur naturally. Healthy, consistent growth is the result of balancing the five biblical purposes of the church.” Rick Warren shares a proven five-part strategy that will enable your church to grow • warmer through fellowship • deeper through discipleship • stronger through worship • broader through ministry • larger through evangelism The Purpose Driven® Church shifts the focus away from church building programs to emphasizing a people-building process. Warren says, “If you will concentrate on building people, God will build the church.”",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Aerie",
        "Authors": "By Lackey, Mercedes",
        "Description": "Kiron has secretly gathered an army of dragon riders to seek refuge in the abandoned desert city they have named Sanctuary, where they join with other dragon riders to rid their world of both war and magical domination. But now it is time to build a new society in Aerie: an ancient city that seems to have been designed for dragon riders and their dragons.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "DAW",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Cat Who Knew a Cardinal",
        "Authors": "By Braun, Lilian Jackson",
        "Description": "The stage is set for Jim Qwilleran and his cats, Koko and Yum Yum, to solve a puzzling mystery in this New York Times bestseller in the Cat Who series.All the world’s a stage—and now Jim Qwilleran’s apple orchard has become the stage for a real-life murder scene. The much-disliked director of the Pickax Theatre Club’s Shakespeare production, Hilary VanBrook, has been found dead after the closing-night cast party. With the help of his super-smart Siamese, Qwill must cast a suspicious eye on all the players—especially the ones pussyfooting around behind the scenes...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Lean and Lovin' It: Exceptionally Delicious Recipes for Low-Fat Living and Permanent Weight Loss",
        "Authors": "By Mauer, Don",
        "Description": "How did Don Mauer, who had been heavy all of his life, finally manage to lose weight and keep it off? Mauer-whose nickname was \"Big Guy\"-dieted for over thirty years. He tried every diet that came along. They all worked, but he would inevitably gain back what he lost, plus ten pounds more. Then Mauer discovered two words: low fat. An avid cook, he decided to revamp his own recipes, blasting away the fat and permanently losing 100 pounds in the bargain. The happy results of his success is Lean and Lovin' It: Exceptionally Delicious Recipes for Low-Fat Living and Permanent Weight Loss, which has over 200 low-fat recipes, ranging from 'Good Morning' Griddlecakes to Southern-Style Oven-Fried Chicken. Mauer goes to extraordinary lengths to replace fat with flavor in breakfasts like Buttermilk French Toast with Blueberry Honey (6.2g fat) and Lean Breakfast Sausage (1.8g fat). He transforms lean cuts of meat into rich-tasting dishes like Spicy Chinese Beef Sauté (7.5g fat) and Pork Tenderloin",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Chapters Pub Ltd",
        "Price Starting With ($)": "12.96",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Fresh Vegetable and Fruit Juices",
        "Authors": "By Walker, N. W.",
        "Description": "",
        "Category": " Cooking , Beverages , General",
        "Publisher": "Norwalk Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "The Associated Press Stylebook and Libel Manual: With Appendixes on Photo Captions, Filing the Wire",
        "Authors": "By Associated Press",
        "Description": "A standard style manual on all aspects of writing and preparing material for newspapers includes expanded guidelines for writing captions and a chapter on libel",
        "Category": "",
        "Publisher": "Addison Wesley Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1982"
        }
    },
    {
        "Title": "A Family of Poems: My Favorite Poetry for Children",
        "Authors": "By Muth, Jon J. (ILT) and Kennedy, Caroline (EDT)",
        "Description": "Caroline Kennedy has chosen a rich variety of Kennedy family favorite poems to include in this priceless collection.   With thoughtful personal introductions written by Caroline herself, and beautiful new original artwork by award-winning artist, Jon J Muth, this collection is sure to become a family favorite for years to come.",
        "Category": " Juvenile Nonfiction , Poetry , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "High Expectations: The Remarkable Secret for Keeping People in Your Church",
        "Authors": "By Rainer, Thom S.",
        "Description": "For over a quarter of a century the problem of losing church members has progressively increased. Today the situation is so bad that less than one-third of the members in some churches attend worship services. Church leaders are crying for help.In an effort to help church leaders, the Billy Graham School of the Southern Baptist Theological Seminary conducted a massive research project involving nearly 287 churches. The most revealing aspect of the study was that the higher expectations placed on members, the greater the likelihood that the members would stay and be involved with the church. Using the data gathered from this project, Thom Rainer presents the first-ever comprehensive study about 'closing the back door.' Rainer looks at why people are leaving the church and how church leaders can keep the members.",
        "Category": " Religion , Christian Ministry , Pastoral Resources",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Extraordinary Uses For Ordinary Things",
        "Authors": "By Reader's Digest Association",
        "Description": "Provides a collection of household hints involving unexpected uses for common items from meat tenderizer to yogurt, arranged alphabetically, along with lists of the most useful things to have on hand for different jobs and other details.",
        "Category": " Technology & Engineering , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "The Bridesmaid",
        "Authors": "By Rendell, Ruth",
        "Description": "Philip Wardman had more than just the ordinary squeamishness where death was concerned. Philip's feminine ideal is the statue of the Roman goddess Flora in his mother's garden. The two embark on a passionate affair that soon becomes dangerous when Senta sets Philip a test;",
        "Category": " Fiction , Crime",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "The Inner Reaches of Outer Space: Metaphor as Myth and as Religion",
        "Authors": "By Joseph Campbell",
        "Description": "Paper reprint. Cloth, $18.95. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Gilded Man",
        "Authors": "By Dickson, Carter",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley F1290",
        "Price Starting With ($)": "34.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Wild Discovery",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "In the natural world, all creatures move within an eternal cycle, one that begins at birth and involves the struggle for connection, continuity, and ultimately, the renewal of life.Now, Wild Discovery celebrates this dance of life with a collection of stunning photographs of animals from all corners of the world. Master wildlife photographers have captured the unique expressions of animal behavior in 128 full-color images.Wild Discovery features six chapters, each exploring a facet of animal life. \"Genesis\" reveals the power of the procreative instinct that drives the doting orangutan and the fierce Nile crocodile. In \"Eat or Be Eaten,\" victory rests on the cunning or camouflage of both the hunter and the hunted: A six-spotted fishing spider lurks in a stream for its unwitting prey while a herd of zebras' mesmerizing stripes confuse would-be predators. \"Two Together\" showcases brilliant courtship displays and mating rituals, from the elaborate structure built and decorated by the bowerbird to woo his female to the communal mating song sung by male humpback whales. In \"Sanctuary,\" a home can range from the two inch nest of a tiny bee hummingbird to an elaborate miles-long maze of prairie-dog tunnels. \"Community\" describes intricate relationships on which animals depend for survival - from cooperative fishing sessions by dolphins to the shared mothering duties of mole rats. Finally, \"Circle of Life\" depicts animal aging and death, chronicling the respect still extended to an older lion by younger pride members and ultimate sacrifice paid by the sockeye salmon to ensure a new generation.",
        "Category": " Photography , Subjects & Themes , Plants & Animals",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "8.08",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "GP28 - Walt Disney Favorites for Piano",
        "Authors": "By Jane Smisor Bastien",
        "Description": "",
        "Category": "",
        "Publisher": "Kjos Music Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Zookeeper's Wife: A War Story",
        "Authors": "By Ackerman, Diane",
        "Description": "When Germany invaded Poland, Stuka bombers devastated Warsaw—and the city's zoo along with it. With most of their animals dead, zookeepers Jan and Antonina Zabinski began smuggling Jews into empty cages. Another dozen \"guests\" hid inside the Zabinskis' villa, emerging after dark for dinner, socializing, and, during rare moments of calm, piano concerts. Jan, active in the Polish resistance, kept ammunition buried in the elephant enclosure and stashed explosives in the animal hospital. Meanwhile, Antonina kept her unusual household afloat, caring for both its human and its animal inhabitants—otters, a badger, hyena pups, lynxes.With her exuberant prose and exquisite sensitivity to the natural world, Diane Ackerman engages us viscerally in the lives of the zoo animals, their keepers, and their hidden visitors. She shows us how Antonina refused to give in to the penetrating fear of discovery, keeping alive an atmosphere of play and innocence even as Europe crumbled around her.",
        "Category": " History , Military , World War II",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Lore of Running",
        "Authors": "By Noakes, Timothy D.",
        "Description": "Dr. Noakes (U. of Cape Town Medical School) explores the physiology of running, all aspects of training, and recognizing, avoiding, and treating injuries. Previous editions copyright by Oxford U. Press in 1985 and 1986. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "Human Kinetics (Trade)",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The Marines",
        "Authors": "By Simmons, Edward Howard -Editor -etal.",
        "Description": "",
        "Category": "",
        "Publisher": "Marine Corps Heritage Foundation",
        "Price Starting With ($)": "9.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "You Are Being Lied To: The Disinformation Guide to Media Distortion, Historical Whitewashes and Cultural Myths",
        "Authors": "By Kick, Russ (EDT)",
        "Description": "You Are Being Lied To is a massive collection of articles that ruthlessly destroy the distortions, myths, and outright lies that are fed to us by the government, the media, corporations, history books, organized religion, science and medicine, and society in general. No one is spared, and all sacred cows are candidates for the grinder.Do you believe any of the following?Alcoholics Anonymous is effective.Hackers pose a grave threat to the nation.There's a hidden code in the Bible.The Big Bang is an airtight fact.Thousands of species have gone extinct because of deforestation. Licking certain toads will get you high.Most terrorists are Middle Eastern.Wake up! You're being lied to.This book acts as a battering ram against the distortions, myths, and outright lies that have been shoved down our throats by the government, the media, corporations, organized religion, the scientific establishment, and others who want to keep the truth from us. An unprecedented group of researchers--investigative reporters, political dissidents, academics, media watchdogs, scientist-philosophers, social critics, and rogue scholars--paints a picture of a world where crucial stories are ignored or actively suppressed and the official version of events has more holes in it than Swiss cheese. A world where real dangers are downplayed and nonexistent dangers are trumpeted. In short, a world where you are being lied to.Among the revelations inside:Pulitzer Prize-winning reporter Sydney Schanberg on John McCain's efforts to conceal information on POW/MIAsHoward Bloom on liars in the mediaRiane Eisler on the realities of human natureJames Ridgeway on tainted blood and moreJim Marrs on missing evidence in important casesGreenpeace cofounder Peter Moore on environmental mythsMichael Parenti on atrocities in KosovoDouglas Rushkoff on the information arms raceGary Webb on the gutless corporate mediaHoward Zinn on Columbus",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Disinformation Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Mind of the Market: Compassionate Apes, Competitive Humans, and Other Tales from Evolutionary Economics",
        "Authors": "By Shermer, Michael",
        "Description": "Bestselling author Michael Shermer explains how evolution shaped the modern economy—and why people are so irrational about money How did we make the leap from ancient hunter-gatherers to modern consumers and traders? Why do people get so emotional and irrational about bottom-line financial and business decisions? Is the capitalist marketplace a sort of Darwinian organism, evolved through natural selection as the fittest way to satisfy our needs? In this eye-opening exploration, author and psychologist Michael Shermer uncovers the evolutionary roots of our economic behavior. Drawing on the new field of neuroeconomics, Shermer investigates what brain scans reveal about bargaining, snap purchases, and establishing trust in business. He scrutinizes experiments in behavioral economics to understand why people hang on to losing stocks, why negotiations disintegrate into tit-for-tat disputes, and why money does not make us happy. He brings together astonishing findings from psychology, biology, and other sciences to describe how our tribal ancestry makes us suckers for brands, why researchers believe cooperation unleashes biochemicals similar to those released during sex, why free trade promises to build alliances between nations, and how even capuchin monkeys get indignant if they don’t get a fair reward for their work.",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Times Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Season to Taste",
        "Authors": "By Ferrary, Jeannette and Fiszer, Louise",
        "Description": "A detailed guide to herbs and spices and their culinary applications features separate chapters devoted to particular seasonings, providing lore and lineage; tips on buying, storing and use, and selected recipes",
        "Category": " Cooking , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "The Natural Lawn & Alternatives (Plants & Gardens)",
        "Authors": "By Marinelli, Janet (EDT)",
        "Description": "Aside from discussing the use of chemical-free fertilizer and insect controls for typical grass lawns, this volume offers suggestions for such alternatives as a flower-filled meadow, moss and ground coverings, sedge lawns, and prairie grass and wildflower lawns",
        "Category": " Gardening , General",
        "Publisher": "Brooklyn Botanic Garden",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Simon & Schuster's Guide to House Plants",
        "Authors": "By Chiusoli, Alessandro and Boriani, Maria Luisa",
        "Description": "Simon & Schuster's Guide to House Plants is the definitive guide to selecting the right plants for your indoor environment and making them flourish. The introductory chapter explains how plants grow; how and when to feed, repot, and prune them; how to protect them from pests and diseases; the best ways to arrange and support house plants; and how to engage in hydroculture. Each of the 243 entries, illustrated in lush full color, gives the plant's family, place of origin, description, propagation requirements, and complete instructions on temperature, lighting, and watering.  Whether you are a novice or an expert indoor gardener, this indispensable guide is the most authoritative and useful handbook on house plants you can own.",
        "Category": " Technology & Engineering , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Holiday Collection (The Best of Food & Wine)",
        "Authors": "By Food & Wine (New York, N. Y.)",
        "Description": "A compendium of recipes, tips, and techniques for holiday cooking includes an assortment of kitchen-tested recipes for beverages, soups, appetizers, main courses, vegetables, salads, stuffings, and desserts, with ideas for wine selection.",
        "Category": " House & Home , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Passing of Armies: An Account Of The Final Campaign Of The Army Of The Potomac (Eyewitness to the Civil War)",
        "Authors": "By Chamberlain, Joshua Lawrence",
        "Description": "A member of the Fifth Corps recounts the dramatic final acts of the Civil War, describing Sheridan's rise, Warren's fall, and the slow, inexorable stalking of Lee's forces across the battle-scarred countryside. Reprint.",
        "Category": " History , United States , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "Our energy, regaining control: A strategy for economic revival through redesign in energy use",
        "Authors": "By Williams, Robert H.",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Washington D.C. Home Book: A Comprehensive, Hands-On Guide to Building, Remodeling, Decorating, Furnishing and Landscaping a Home in Washington D.C. and Its Suburbs, First Edition",
        "Authors": "By Ashley Group",
        "Description": "",
        "Category": " House & Home , Reference",
        "Publisher": "Ashley Group",
        "Price Starting With ($)": "7.66",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Better Homes and Gardens Blue Ribbon Bazaar Crafts",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "A collection of more than one hundred projects for gifts, home accessories, and holiday trims, with dozens of ideas, tips, and suggestions about materials, techniques, and designs and includes special sections on holding successful bazaars",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Jackboot a History of the German Soldier",
        "Authors": "By Laffin, John",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Island of Mending Hearts",
        "Authors": "By Ashley, Tim",
        "Description": "",
        "Category": " Fiction , Gay",
        "Publisher": "GMP",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Modern Bridge Conventions",
        "Authors": "By Root, William S. and Pavlicek, Richard",
        "Description": "This easy-to-follow book covers in detail more than 50 of the most practical bridge conventions in use today. A glossary, which also serves as an index, lists more than 250 popular conventions, treatments, and systems. \"Every bridge enthusiast should have it on his bookshelf.\"--Alfred Sheinwold, Los Angeles Times Syndicate.",
        "Category": " Games & Activities , Card Games , Bridge",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Family Traditions: Celebrations for Holidays and Everyday",
        "Authors": "By Berg, Elizabeth",
        "Description": "Presents a wide range of activities, traditions, ideas, and rituals that are designed to encourage families to share quality time together, including suggestions for the major holidays, seasonal celebrations, everyday customs, and more. 20,000 first printing.",
        "Category": " Social Science , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    }
]