[
    {
        "Title": "Lonely Planet Alaska: A Travel Survival Kit",
        "Authors": "By Dufresne, Jim",
        "Description": "",
        "Category": "",
        "Publisher": "Lonely Planet Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Made in Italy: A Shoppers Guide to Florence, Milan, Rome & Venice",
        "Authors": "By Brody, Annie and Schultz, Patricia",
        "Description": "",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Workman Pub Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "The Simon & Schuster Guide to the Wines of Italy",
        "Authors": "By Anderson, Burton",
        "Description": "",
        "Category": " Cooking , Beverages , Wine & Spirits",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Handbook of American English Spelling (Harvest/Hbj Book)",
        "Authors": "By Deighton, Lee C.",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "December",
            "Year": "1978"
        }
    },
    {
        "Title": "Too Many Babas (An I Can Read Book)",
        "Authors": "By Croll, Carolyn",
        "Description": "Four peasant ladies discover that too many cooks without a plan can spoil the broth",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Show No Fear: A Nina Reilly Novel",
        "Authors": "By O'Shaughnessy, Perri",
        "Description": "A brand-new Nina Reilly thriller takes readers back to Nina's first murder investigation, to the case that ignites her passionate commitment to fighting for justice. As a single mom working as a paralegal and attending law school at night, Nina has her hands full fighting for custody of her young son Bob and overseeing a medical malpractice lawsuit on behalf of her mother. But when a woman falls to her death off a bridge near Big Sur and witnesses disappear, Nina suspects there is more to the \"accident\" than the authorities are saying. With the help of homicide cop Paul van Wagoner, she rushes to uncover the truth. Show No Fear illumines what makes the brilliant Nina Reilly tick -- and, in this fascinating prequel to an illustrious career, begins a love affair for her fans and readers of complex, gripping thrillers everywhere!",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "A Whole New Light",
        "Authors": "By Brown, Sandra",
        "Description": "From the heat of an Acapulco night...Cyn McCall knew she could always count on her late husband's friend and business partner, Worth Lansing. He could make her laugh and forget her problems. She could tease him about his many romantic entanglements. The last thing Cyn expected was to find herself longing for a man who could never settle down.From the Paperback edition.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "The Feng Shui Workbook: A Room-By-Room Guide to Effective Feng Shui in Your Home and Workplace",
        "Authors": "By Palmer, Martin, Wong, Eva, O'Brien, Joanne, Xing, Wu, and Zhao, Xiaomin",
        "Description": "Teachers readers how to apply the principles of feng shui to different rooms in apartments and houses, in the workplace, and in gardens and other external spaces",
        "Category": " House & Home , Decorating",
        "Publisher": "Tuttle Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Lush Life: A Novel",
        "Authors": "By Price, Richard",
        "Description": "A National BestsellerA New York Times Notable Book of the YearLush Life is a tale of two Lower East Sides: one a high-priced bohemia, the other a home to hardship, it's residents pushed to the edges of their time-honored turf. When a cocky young hipster is shot to death by a street kid from the \"other\" lower east side, the crime ripples through every stratum of the city in this brilliant and kaleidiscopic portrait of the \"new\" New York.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Plum Spooky (Stephanie Plum: Between the Numbers)",
        "Authors": "By Evanovich, Janet",
        "Description": "The First Full Length Stephanie Plum Between-the-Numbers Novel from #1 Bestselling Author Janet Evanovich.Turn on all the lights and check under your bed. Things are about to get spooky in Trenton, New Jersey. According to legend, the Jersey Devil prowls the Pine Barrens and soars above the treetops in the dark of night. As eerie as this might seem, there are things in the Barrens that are even more frightening and dangerous. And there are monkeys. Lots of monkeys. Wulf Grimoire is a world wanderer and an opportunist who can kill without remorse and disappear like smoke. He’s chosen Martin Munch, boy genius, as his new business partner, and he’s chosen the Barrens as his new playground. Munch received his doctorate degree in quantum physics when he was twenty-two. He’s now twenty-four, and while his brain is large, his body hasn’t made it out of the boys’ department at Macy’s. Anyone who says good things come in small packages hasn’t met Munch. Wulf Grimoire is looking for world domination. Martin Munch would be happy if he could just get a woman naked and tied to a tree. Bounty hunter Stephanie Plum has Munch on her most-wanted list for failure to appear in court. Plum is the all-American girl stuck in an uncomfortable job, succeeding on luck and tenacity. Usually she gets her man. This time she gets a monkey. She also gets a big guy named Diesel.  Diesel pops in and out of Plum’s life like birthday cake – delicious to look at and taste, not especially healthy as a steady diet, gone by the end of the week if not sooner. He’s an über bounty hunter with special skills when it comes to tracking men and pleasing women. He’s after Grimoire, and now he’s also after Munch. And if truth were told, he wouldn’t mind setting Stephanie Plum in his crosshairs. Diesel and Plum hunt down Munch and Grimoire, following them into the Barrens, surviving cranberry bogs, the Jersey Devil, a hair-raising experience, sand in their underwear, and, of course . . . monkeys.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Best Behavior, Unleashing Your Dog's Instinct to Obey (The Good Dog Library)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Tufts Media Enterprises",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Everything's an Argument with Readings",
        "Authors": "By Lunsford, Andrea A., Ruszkiewicz, John J., and Walters, Keith",
        "Description": "Accessible in style, while offering thorough and well-organized content and heavyweight ideas. The attention to visual design makes the text interesting and appealing, as well as easy to navigate.\"---Anthony Baker, Tennessee Technological University\"Everything's an Argument is the total package---no other reader is this good a rhetoric and no other argument text is this good a reader.\" ---Jim Coppoc, Iowa State University\"For many years, Everything's an Argument has been my favorite textbook to use for the second-semester composition course. It covers complex concepts in a way that is very accessible for students. The text is up-to-date with contemporary issues.\" ---Lisa Kirby, North Carolina Wesleyan College\"Chapter 1 gets five stars from me; it begins a semester-long conversation about whether everything is, indeed, an argument. I think students have never considered this concept and are challenged by and excited about it.\" ---Ellen Johnson, Arizona State University\"The readings are current and timely, which helps students apply what they are reading to their lives and encourages making connections between what they are reading and what crosses their path outside the classroom walls.\" ---Kristin Smith, Durham Technical Community College\"Controversial at times, very thorough, interesting and has something for everybody's taste and teaching style.\" ---Sarah Eichelman, Walters State Community College",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Know It All: 5087 Weird and Wachy Trivia Questions and Answers",
        "Authors": "By Marsha, Kranas",
        "Description": "",
        "Category": "",
        "Publisher": "Tess Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Revolution: A Manifesto",
        "Authors": "By Paul, Ron",
        "Description": "This Much Is True: You Have Been Lied To.  The government is expanding.  Taxes are increasing.  More senseless wars are being planned.  Inflation is ballooning.  Our basic freedoms are disappearing. The Founding Fathers didn't want any of this. In fact, they said so quite clearly in the Constitution of the United States of America. Unfortunately, that beautiful, ingenious, and revolutionary document is being ignored more and more in Washington. If we are to enjoy peace, freedom, and prosperity once again, we absolutely must return to the principles upon which America was founded. But finally, there is hope . . . In THE REVOLUTION, Texas congressman and presidential candidate Ron Paul has exposed the core truths behind everything threatening America, from the real reasons behind the collapse of the dollar and the looming financial crisis, to terrorism and the loss of our precious civil liberties. In this book, Ron Paul provides answers to questions that few even dare to ask. Despite a media blackout, this septuagenarian physician-turned-congressman sparked a movement that has attracted a legion of young, dedicated, enthusiastic supporters . . . a phenomenon that has amazed veteran political observers and made more than one political rival envious. Candidates across America are already running as \"Ron Paul Republicans.\"\"Dr. Paul cured my apathy,\" says a popular campaign sign. THE REVOLUTION may cure yours as well.",
        "Category": " Philosophy , Political",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "29.96",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "New York: Metropolis of the American Dream (Urban Tapestry Series)",
        "Authors": "By Mayer, Martin and Ouellette, Christopher",
        "Description": "",
        "Category": " Photography , Photojournalism",
        "Publisher": "Towery Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Essential English Grammar (Dover Language Guides Essential Grammar)",
        "Authors": "By Gucker, P.",
        "Description": "This English grammar has been specially designed for readers with limited learning time, who wish to gain command of all the important points of grammar needed for everyday speech and comprehension, yet who do not wish to be unnecessarily burdened with archaic, highly literary, or seldom used forms. Summarizing all the major constructions, principles, and basic terminology, this book will provide readers with a firm foundation in essential English grammar.The text proceeds in easy, natural steps, beginning with simple sentence structure and advancing logically to more difficult constructions. More than 600 practice exercises and solutions make this an excellent home-study text. Organized with clarity and emphasizing explanation rather than rote memorization, this selective grammar can be used effectively as a course supplement, as an introduction for beginners, or as a reference for students and teachers.",
        "Category": " Foreign Language Study , Multi-Language Phrasebooks",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1966"
        }
    },
    {
        "Title": "New York (The Magnificent Great Cities)",
        "Authors": "By Visalli, Santi",
        "Description": "This is award-winning photojournalist Santi Visalli's tribute to his adopted home.  Great monuments are freshly framed as the Empire State Building stands at attention against a crisp winter sky and the art deco detail of Rockefeller Center glows in gilded splendor.  In a city famed for its neighborhoods, Visalli has provided fascinating glimpses of the diverse areas that comprise the dynamic whole.  From architecture to people, from sidewalk to skyline, Santi Visalli has documented in stunning color photographs the spirit and energy of New York as only he can.",
        "Category": " Travel , General",
        "Publisher": "Universe",
        "Price Starting With ($)": "6.2",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Abraham Lincoln (Young Reader's Christian Library)",
        "Authors": "By Wellman, Sam",
        "Description": "",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Crafter's Design Library: Christmas",
        "Authors": "By Bennett, Sharon",
        "Description": "Choose from over 350 striking Christmas themed motifs, and apply them to all your favourite crafts year after year.   Crafters of all skill levels need an extensive selection of motifs and patterns to apply to their work. Part One explains how to choose and then, step by step, transfer the motifs to your chosen crafts. There are even instructions for combining and embellishing motifs, and applying colour for all manner of wonderful festive effects. A gallery of completed projects provides ideas and inspiration.  Part Two is the extensive library of clear, high quality Christmas motifs. The subjects give a wide variety of festive images that progress in complexity within each chapter, starting with simple and easy motifs, moving on to more detailed images. Whether you want a quick motif for a Christmas card or rubber stamped gift wrap, or a more intricate look for a beautiful piece of glass painting or wall frieze, there is sure to be lots to delight and inspire.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Jazzy Gift Baskets (Making & Decorating Glorious Presents)",
        "Authors": "By Marie Browning",
        "Description": "",
        "Category": "",
        "Publisher": "Sterling Publishing Co",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Mother Goose on the farm (A Golden Tell-a-tale book)",
        "Authors": "By Muldrow, Diane / illust.by Amy Aitken",
        "Description": "A selection of nursery rhymes relating to farm life.",
        "Category": "",
        "Publisher": "Western Pub. Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Classic Pasta at Home (Williams-Sonoma Lifestyles , Vol 1)",
        "Authors": "By Williams, Chuck, Williams, Chuck (EDT), Time-Life Books (COR), Fletcher, Janet Kessel, and Eskite, Richard",
        "Description": "Offers advice on making and cooking pasta, and shares recipes for penne, linguine, mostaccioli, fettuccine, bucatini, pappardelle, ravioli, lasagne, spaghetti, farfalle, orecchiette, cavatappi, and rigatoni",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Everything Organize Your Home (Everything Series)",
        "Authors": "By Rich, Jason",
        "Description": "A useful guide to getting organized shows readers how to clear the chaos, create storage space, organize with flair, and establish good storage habits. Original.",
        "Category": " House & Home , Reference",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "All For Love: The Scandalous Life and Times of Royal Mistress Mary Robinson",
        "Authors": "By Elyot, Amanda",
        "Description": "A bold and bawdy historical novel-from the acclaimed author of Too Great a Lady.  Mary Robinson's talent, beauty, and drive led her from debtors' prison to the glamour and scandal of the London stage, where a star was born-and sold as society's darling, envied by women, and desired by men. From her shocking affair with the Prince of Wales to heartbreaking betrayals and a restless pursuit of true romance, this breathtaking novel paints a vivid portrait of a woman who changed history by doing as she pleased-for money, for fame, for pleasure, and above all, for love.",
        "Category": " Fiction , Historical",
        "Publisher": "NAL",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Every Dog's Survival Guide to Living with a Neurotic Owner",
        "Authors": "By Steve Duno",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Tools of the writer's trade: Writers tell all about the equipment and services they find the best",
        "Authors": "By American Society of Journalists & Author",
        "Description": "Some 200 members of The American Society of Journalists and Authors describe, in their own words, the equipment and services they find most helpful, in terms of computer hardware and software, copiers, modems and faxes, delivery and mail services, office supplies, office design, answering machines, and travel. Includes an appendix of mail-order sources. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Don't Tell Me What to Do, Just Send Money: The Essential Parenting Guide to the College Years",
        "Authors": "By Johnson, Helen E. and Schelhas-Miller, Chrisine",
        "Description": "Finally, a Dr. Spock for College ParentsDoes your daughter call home in tears over the latest \"crisis,\" leaving you feeling helpless and concerned? Is your son confused about his major? When children leave for college many parents feel uncertain about their shifting role. By emphasizing the importance of being a mentor, Don't Tell Me What to Do, Just Send Money shows that parents may have lost control over their college student, but they haven't lost influence.Brimming with humorous case examples and realistic dialogues, this comprehensive guide covers the fundamental college issues, including:* Preparing for College: what to bring, how to stay in touch, and how to handle money* Adjusting Socially: roommates, stress, time management, and Greek life* The Search for Identity: intimate relationships, choosing a major, and lifestyle and value decisions* Handling Crises: depression, drug and alcohol abuse, dropping out, and eating disorders* Postgraduate Choices: job hunting, internships, and graduate schoolsFinally, a Dr. Spock for College ParentsDoes your daughter call home in tears over the latest \"crisis,\" leaving you feeling helpless and concerned? Is your son confused about his major? When children leave for college many parents feel uncertain about their shifting role. By emphasizing the importance of being a mentor, Don't Tell Me What to Do, Just Send Money shows that parents may have lost control over their college student, but they haven't lost influence.Brimming with humorous case examples and realistic dialogues, this comprehensive guide covers the fundamental college issues, including:* Preparing for College: what to bring, how to stay in touch, and how to handle money* Adjusting Socially: roommates, stress, time management, and Greek life* The Search for Identity: intimate relationships, choosing a major, and lifestyle and value decisions* Handling Crises: depression, drug and alcohol abuse, dropping out, and eating disorders* Postgraduate Choices: job hunting, internships, and graduate schools",
        "Category": " Family & Relationships , Education",
        "Publisher": "Golden Guides from St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Passing for Normal: A Memoir of Compulsion",
        "Authors": "By Wilensky, Amy S.",
        "Description": "I am crazy. But maybe I am not.  For most of her life, these thoughts plagued Amy Wilensky as her mind lurched and veered in ways she didn't understand and her body did things she couldn't control. While she excelled in school and led an otherwise \"normal\" life, she worried that beneath the surface she was a freak, that there was something irrevocably wrong with her.  Passing for Normal is Wilensky's emotionally charged account of her lifelong struggle with the often misunderstood disorders Tourette's syndrome and obsessive-compulsive disorder.  A powerful witness to her own dysfunction, Wilensky describes the strain it bore on her relationships with the people she thought she knew best: her family, her friends, and herself.  Confronting the labels we apply to ourselves and others--compulsive, crazy, out of control--Amy describes her symptoms, diagnosis, and her treatment with courage and a healthy dose of humor, gradually coming to terms with the absurdities of a life beset by irrational behavior.  This compelling narrative, by turnstragic and comic, broadly extends our understanding of the won-drously complex human mind, and, with subtlety and grace, challenges our notion of what it is to be \"normal.\"",
        "Category": " Psychology , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Works: Harmful Intent / Vital Signs / Blindsight",
        "Authors": "By Cook, Robin",
        "Description": "A trio of chilling tales of medical mayhem features unabridged versions of Harmful Intent, Vital Signs, and Blindsight.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Bridal and Baby Showers: Surefire Recipes and Exciting Menus for a Flawless Party! (The Perfect Party)",
        "Authors": "By Rodgers, Rick and Gourley, Robbin (ILT)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Warner Treasures",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Beef, Pork and Lamb (Robert Rose's Favorite)",
        "Authors": "By Robert Rose Inc. (COR)",
        "Description": "With Robert Rose's Favorite Beef, Pork & Lamb, you get over 50 delicious recipes for a wide variety of meat dishes, ranging from succulent Barbecued Steak with Flavored Butters to sophisticated Beef Tomato Garlic Spring Rolls. Also included are accompaniments--such as Greek Baked Potatoes Stuffed with Tomatoes, Olives and Cheese, specially selected to complement your meat dishes.",
        "Category": " Cooking , Specific Ingredients , Meat",
        "Publisher": "Robert Rose",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Critical Thinking: An Introduction",
        "Authors": "By Fisher, Alec",
        "Description": "In this book, Alec Fisher aims to teach directly an important range of thinking skills. The skills are fundamental critical (and creative) thinking skills, and they are taught in a way which expressly aims to facilitate their transfer to other subjects and other contexts. The method is to use 'thinking maps' which help improve thinking by asking key questions of students when they are faced with different types of problems.   Alec Fisher explains the language of reasoning, how to understand different kinds of arguments and how to ask the right question. Other topics include: different patterns of reasoning and standards which apply in different contexts, how to clarify and interpret ideas, how to judge the credibility of claims, and how to decide whether a person really justifies their conclusions, given their audience. Particular attention is given to understanding casual explanations and evaluating decisions. THe book includes many examples and exercises which give extensive practice in developing critico-creative thinking skills.",
        "Category": " Education , Curricula",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Small Steps",
        "Authors": "By Sachar, Louis",
        "Description": "Two years after being released from Camp Green Lake, Armpit is home in Austin, Texas, trying to turn his life around. But it’s hard when you have a record, and everyone expects the worst from you. The only person who believes in him is Ginny, his 10-year old disabled neighbor. Together, they are learning to take small steps. And he seems to be on the right path, until X-Ray, a buddy from Camp Green Lake, comes up with a get-rich-quick scheme.  This leads to a chance encounter with teen pop sensation, Kaira DeLeon, and suddenly his life spins out of control, with only one thing for certain. He’ll never be the same again.In his first major novel since Holes, critically acclaimed novelist Louis Sachar uses his signature wit combined with a unique blend of adventure and deeply felt characters to explore issues of race, the nature of celebrity, the invisible connections that determine a person’s life, and what it takes to stay on course. Doing the right thing is never a wrong choice–but a small step in the right direction.",
        "Category": " Young Adult Fiction , People & Places , United States , African American",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Cooking Class Mexican Cookbook",
        "Authors": "By Anon",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , Mexican",
        "Publisher": "Pubns Intl Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "CRM at the Speed of Light: Capturing and Keeping Customers in Internet Real Time",
        "Authors": "By Greenberg, Paul",
        "Description": "Get winning strategies for acquiring and retaining customers by leveraging the latest advanced technologies. This insightful and authoritative book shows you how to select the right tools for your business--so it can grow today--and on into the future.",
        "Category": " Computers , Networking , General",
        "Publisher": "McGraw-Hill Osborne Media",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Adventure of the Buried Treasure (A Little Apple Paperback)",
        "Authors": "By Trivas, Irene (ILT) and McArthur, Nancy",
        "Description": "After discovering a long-buried lunch box containing a valuable Joe DiMaggio baseball card, Susie and her friends set out to locate the owner of the lunch box",
        "Category": "",
        "Publisher": "Little Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Campus Visits and College Interviews: All-New Second Edition",
        "Authors": "By Schneider, Zola Dincin",
        "Description": "How to get the most out of your campus visits, and get the stress out of your college interviews.Updated to give the pros and cons of college Web sites and \"virtual visits,\" and reformatted with easy-to-use charts and checklists, this quick and handy guide will help you get the right impression during your visit and make the right impression during your interview. It tells you the best times to visit; what to look for while you're there; what questions to expect during your interview; what questions you should ask; and more.",
        "Category": " Study Aids , College Entrance",
        "Publisher": "College Board",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Great Short Stories of the World: 71 of the Finest Stories Ever Written",
        "Authors": "By Reader's Digest Association",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1972"
        }
    },
    {
        "Title": "Faceless Killers",
        "Authors": "By Murray, Steven T. (TRN) and Mankell, Henning",
        "Description": "From the dean of Scandinavian noir, the first riveting installment in the internationally bestselling and universally acclaimed Kurt Wallander series, the basis for the PBS series staring Kenneth Branagh.It was a senselessly violent crime: on a cold night in a remote Swedish farmhouse an elderly farmer is bludgeoned to death, and his wife is left to die with a noose around her neck. And as if this didn’t present enough problems for the Ystad police Inspector Kurt Wallander, the dying woman’s last word is foreign, leaving the police the one tangible clue they have–and in the process, the match that could inflame Sweden’s already smoldering anti-immigrant sentiments. Unlike the situation with his ex-wife, his estranged daughter, or the beautiful but married young prosecuter who has peaked his interest, in this case, Wallander finds a problem he can handle. He quickly becomes obsessed with solving the crime before the already tense situation explodes, but soon comes to realize that it will require all his reserves of energy and dedication to solve.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Vintage Crime/Black Lizard",
        "Price Starting With ($)": "12.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Who Let the Dogs In?: Incredible Political Animals I Have Known",
        "Authors": "By Ivins, Molly",
        "Description": "The dazzling, inimitable Molly Ivins is back, with her own personal Hall of Fame of America’s most amazing and outlandish politicians–the wicked, the wise, the witty, and the witless–drawn from more than twenty years of reporting on the folks who attempt to run our government (in some cases, into the ground).Who Let the Dogs In? takes us on a wild ride through two decades of political life, from Ronald Reagan, through Big George and Bill Clinton, to our current top dog, known to Ivins readers simply as Dubya. But those are just a few of the political animals who are honored and skewered for our amusement. Ivins also writes hilariously, perceptively, and at times witheringly of John Ashcroft, Dick Cheney, Donald Rumsfeld, H. Ross Perot, Tom DeLay, Ann Richards, Al Gore, Jimmy Carter, and the current governor of Texas, who is known as Rick “Goodhair” Perry.Following close on the heels of her phenomenally successful Bushwhacked and containing an up-to-the-minute Introduction for the campaign season, Who Let the Dogs In? is political writing at its best.From the Hardcover edition.",
        "Category": " Political Science , Essays",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Russian Enamels : Kievan Rus to Faberge",
        "Authors": "By Odom, Anne",
        "Description": "",
        "Category": "",
        "Publisher": "Walters Art Gallery",
        "Price Starting With ($)": "8.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Saints and Villains",
        "Authors": "By Giardina, Denise",
        "Description": "In the charnel house that was Europe in the Second World War, there were few instances of shining moral courage, let along secular sainthood. Dietrich Bonhoeffer, the German theologian and Nazi resister was the exception. This emblematic figure risked his life--and finally lost it--through his participation in a failed plot to assassinate Hitler and topple his regime. Saints and Villains gives us this exemplary life in a sweeping narrative that is bold in conception and utterly convincing in its power of imaginative reconstruction.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "12.96",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Clementi Sonatinas for Piano Op. 36, 37, 38 (Schirmer's Library of Musical Classics)",
        "Authors": "By Muzio Clementi",
        "Description": "",
        "Category": "",
        "Publisher": "G. Schirmer",
        "Price Starting With ($)": "11.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "And on the Eighth Day",
        "Authors": "By queen, ellery",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Washington's Second Blair House: 1607 New Hampshire Avenue: An Illustrated History",
        "Authors": "By Burns, Malve Slocum",
        "Description": "",
        "Category": "",
        "Publisher": "German Historical Institute",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Inside Out: Two First-Person Accounts of What It Means To Be Labeled \"Mentally Retarded\"",
        "Authors": "By Bogdan, Robert and Taylor, Steven J.",
        "Description": "Two mentally retarded people describe their lives and experiences in institutions and community homes",
        "Category": " Social Science , General",
        "Publisher": "University of Toronto Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "Mickey Mouse and The Missing Mouseketeers",
        "Authors": "By Bedford, Annie North",
        "Description": "",
        "Category": "",
        "Publisher": "Western Publishing Company",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "70 Favorite Stories for Young Readers",
        "Authors": "By Various",
        "Description": "",
        "Category": "",
        "Publisher": "The Reader's Digest Association, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Good Rat: A True Story",
        "Authors": "By Breslin, Jimmy",
        "Description": "Of course Pulitzer Prize winner Jimmy Breslin recognized Burton Kaplan right away as the Mafia witness of the ages. Breslin comes from the same Queens streets as mob bosses John Gotti and Vito Genovese. But even they couldn't match Kaplan in crime—and neither could anybody else. In his inimitable New York voice, Breslin, \"the city's steadiest and most accurate chronicler\" (Tom Robbins, Village Voice), gives us a look through the keyhole at the people and places that define the mafia—characters like Sammy \"The Bull\" Gravano, Gaspipe Casso (named for his weapon of choice), Thomas \"Three-Finger Brown\" Lucchese, and Jimmy \"The Clam\" Eppolito, interwoven with the good rat himself, Burt Kaplan of Bensonhurst, the star witness in the recent trial of two New York City detectives indicted for acting as hit men in eight gangland executions. Breslin takes us to the old-time hangouts like Pep McGuire's, the legendary watering hole where reporters and gangsters (all hailing from the same working-class neighborhoods) rubbed elbows and traded stories; the dog-fight circles and body dumps at Ozone Park; and the back room at Midnight Rose's candy store, where Murder, Inc., hired and fired. Most compelling of all, Breslin captures the moments in which the Mafia was made and broken—Breslin was there the night John Gotti celebrated his acquittal at his Ravenite Social Club on Mulberry, having bribed his way to inno­cence only to incite the wrath of the FBI, who would later crush Gotti and others with the full force of the RICO laws.As in his unforgettable novel The Gang That Couldn't Shoot Straight, Breslin brings together these real-life and long-forgotten Mafia stories to brilliantly create a sharp-eyed portrait of the mob as it lived and breathed, as it sounded and survived.",
        "Category": " True Crime , Organized Crime",
        "Publisher": "Ecco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Book of Giant Stories",
        "Authors": "By Harrison, David L.",
        "Description": "Includes \"The Little Boy's Secret,\" \"The Giant Who Was Afraid of Butterflies,\" and \"The Giant Who Threw Tantrums.\"",
        "Category": "",
        "Publisher": "Carson-Dellosa Pub Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1972"
        }
    },
    {
        "Title": "Princess Furball",
        "Authors": "By Lobel, Anita (ILT) and Huck, Charlotte S.",
        "Description": "A princess in a coat of a thousand furs hides her identity from a king who falls in love with her",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Greenwillow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Minds Unleashed (Original Title: Giants Unleashed) (#5361)",
        "Authors": "By Conklin, Groff (Editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Boots Loses a Tooth (A Lift the Flap Book)",
        "Authors": "By Sara James",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Mistaken Identity: Two Families, One Survivor, Unwavering Hope",
        "Authors": "By Van Ryn, Don, Van Ryn, Susie, Cerak, Newell, Cerak, Colleen, Cerak, Whitney, and Tabb, Mark (CON)",
        "Description": "Meet Laura Van Ryn and Whitney Cerak: one buried under the wrong name, one in a coma and being cared for by the wrong family.This shocking case of mistaken identity stunned the country and made national news. Would it destroy a family? Shatter their faith? Push two families into bitterness, resentment, and guilt?Read this unprecedented story of two traumatized families who describe their ordeal and explore the bond sustaining and uniting them as they deal with their bizarre reversal of life lost and life found.And join Whitney Cerak, the sole surviving student, as she comes to terms with her new identity, forever altered, yet on the brink of new beginnings.Mistaken Identity weaves a complex tale of honesty, vulnerability, loss, hope, faith, and love in the face of one of the strangest twists of circumstances imaginable.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Mastering Digital Printing (Miscellaneous)",
        "Authors": "By Johnson, Harald",
        "Description": "\"Mastering Digital Printing: The Photographer's and Artist's Guide to High-Quality Digital Output\" is the first in-depth reference to the new world of digital printing for photography and fine art. This authoritative guide provides a thorough introduction to this exploding medium, instruction in the latest digital printing techniques, and an inspiring Gallery Showcase of the best digitally imaged and printed art and photography. Whether you are a photographer, digital or traditional artist, printmaker, art educator, or art marketer, this book will help you master digital printing!",
        "Category": " Computers , Hardware , Peripherals",
        "Publisher": "Cengage Learning PTR",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Why Jesus Died (Facets)",
        "Authors": "By Sloyan, Gerard S.",
        "Description": "",
        "Category": " Religion , History",
        "Publisher": "Augsburg Fortress Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Brothers' War: Civil War Letters to Their Loved Ones from the Blue and Gray",
        "Authors": "By Tapert, Annette (EDT)",
        "Description": "Written in an era without military censorship, these ninety letters cover the war from its beginning through the assassination of Lincoln",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "The City of Man: Prophecies of a World Civilization in Twentieth-Century Thought",
        "Authors": "By Wagar, W. Warren",
        "Description": "",
        "Category": "",
        "Publisher": "PENGUIN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "That's Life, Snoopy (Selected Cartoons From Thompson Is In Trouble, Charlie Brown, Volume 2)",
        "Authors": "By Charles M. Schulz",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Crest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1973"
        }
    },
    {
        "Title": "Prayers to Sophia",
        "Authors": "By Rupp, Joyce",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Innisfree Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Naval Leadership: Voices of Experience",
        "Authors": "By Montor, Karel",
        "Description": "Essays discuss mission accomplishment, morale, integrity, self-discipline, judgement, pressure, motivation, and professionalism",
        "Category": "",
        "Publisher": "-",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "The Writer's Guide to Self-Promotion and Publicity (WRITER'S MARKET BUSINESS SERIES)",
        "Authors": "By Feldman, Elane",
        "Description": "Explores ways to publicize and promote yourself as a writer--how to be taken seriously by an agent, and how to keep your name in the minds of newspaper or magazine editors",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Ferns: Wild Things Make a Comeback in the Garden (21st Century Gardening Series)",
        "Authors": "By Brooklyn Botanic Garden (COR) and Burrell, C. Colston (EDT)",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Brooklyn Botanic Garden",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Taking Sides: Clashing Views on Controversial Environmental Issues",
        "Authors": "By Goldfarb, Theodore D.",
        "Description": "",
        "Category": "",
        "Publisher": "Dushkin Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "A Tale of Two Sons: The Inside the Story of a Father, His Sons, and a Shocking Murder",
        "Authors": "By MacArthur, John",
        "Description": "Previously published as A Tale of Two SonsCharles Dickens. William Shakespeare. Garrison Keillor. They’re all part of the chorus of literary geniuses who expressed admiration for The Parable of the Prodigal Son as outstanding literature. After all, it is a powerful drama, rich in detail, powerfully succinct, and intensely personal. But beyond the literary critiques—besides being one of the most celebrated written works of all time—the message of this parable is one we can’t afford to ignore.In The Prodigal Son, John MacArthur takes the story back to its roots, when Jesus’ words were absolutely revolutionary. As one of America’s most beloved Bible teachers, MacArthur leads us through the minefields of interpretation and restores the simple yet profound brilliance of this passage. Giving engrossing historical background,The Prodigal Son will reveal Christ’s original message as intended for the Pharisees, the disciples, and the world today.Gain an enlightening perspective into the prodigal son’s story and embrace God’s love anew withThe Prodigal Son.",
        "Category": " Religion , Christian Life , Spiritual Growth",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "First Among Equals",
        "Authors": "By Jeffery Archer",
        "Description": "Four members of Britain's Parliament vie, over a thirty-year period, for success, power, and the office of Prime Minister, and only time will reveal the winner",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Herbs for Sale: Growing and Marketing Herbs, Herbal Products, and Herbal Know-How (Bootstrap Guide)",
        "Authors": "By Sturdivant, Lee and McRae, Peggy Sue (ILT)",
        "Description": "",
        "Category": " Gardening , Herbs",
        "Publisher": "San Juan Naturals",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Creative Solutions For Unusual Projects: Includes Templates . . .",
        "Authors": "By Boylston, Scott",
        "Description": "This reference provides resources and design expertise for bringing projects through a graphic crisis with professionalism and style. Along with the text, Boylston (graphic design, Savannah College of Art) includes sketches, illustrations, and instructions for 26 projects from start to finish. He also offers advice for working with printers, photographers, illustrators, and tips for preventing emergencies. Topics include brochures, packaging, publications, direct mail, large- scale and miscellaneous projects, and general design considerations. Extensively illustrated in color. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Design , Graphic Arts , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Fist of God: A Novel",
        "Authors": "By Forsyth, Frederick",
        "Description": "From the bestselling author of The Day of the Jackal, international  master of intrigue Frederick Forsyth, comes a thriller that brilliantly  blends fact with fiction for one of this summer’s—or any season’s—most  explosive reads!From the behind-the-scenes decision-making of the Allies to the secret meetings of Saddam Hussein’s war cabinet, from the brave American fliers running their dangerous missions over Iraq to the heroic young spy planted deep in the heart of Baghdad, Forsyth’s incomparable storytelling skill keeps the suspense at a breakneck pace.  Somewhere in Baghdad is the mysterious “Jericho,” the traitor who is willing—for a price—to reveal what is going on in the high councils of the Iraqi dictator.  But Saddam’s ultimate weapon has been kept secret even from his most trusted advisers, and the nightmare scenario that haunts General Schwarzkopf and his colleagues is suddenly imminent, unless somehow, the spy can locate that weapon—The Fist of God—in time.Peopled with vivid characters, brilliantly displaying Forsyth’s incomparable, knowledge of intelligence operations and tradecraft, moving back and forthbetween Washington and London, Baghdad and Kuwait, desert vastnesses and city bazaars, this breathtaking novel is an utterly convincing story of what mayactually have happened behind the headlines.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "12.74",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Self-Scoring IQ Tests for Children",
        "Authors": "By Victor Serebriakoff",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Man Who Liked Slow Tomatoes",
        "Authors": "By Constantine, K. C.",
        "Description": "The fiercely unpretentious Mario Balzic, always in absolute command, discovers that tomatoes curiously ripe out of season are the key to the mysterious death of Jimmy Romanelli",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "A Century in The Sun: Photographs of Maryland",
        "Authors": "By Book, Edited",
        "Description": "",
        "Category": " Travel , Pictorials",
        "Publisher": "Baltimore Sun",
        "Price Starting With ($)": "12.48",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Road to Paradise Island",
        "Authors": "By Holt, Victoria, Carr, Philippa, Plaidy, Jean, and Hibbert, Eleanor (CON)",
        "Description": "In the late nineteenth century, Annalice Mallory discovers a journal written one hundred years earlier by her namesake and enters a past of illicit love, treasure hidden on an Australian island, and murder",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Ballantine",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Core Concepts in Health",
        "Authors": "By Insel, Paul M., Roth, Walton T., Insel, Paul M. (EDT), and Roth, Walton T. (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Mayfield Pub Co",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Landower Legacy",
        "Authors": "By Holt, Victoria, Carr, Philippa, and Plaidy, Jean",
        "Description": "Caroline Tressidor's innocent discovery of the identity of her real father leads to her disinheritance and blocks her possible marriage to Paul Landower, who must find a wealthy wife in order to save the family estate",
        "Category": " Fiction , General",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Hannah Senesh, Her Life and Her Diary",
        "Authors": "By Hannah Senesh",
        "Description": "",
        "Category": "",
        "Publisher": "Sphere Books",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The Book of Dead Days (Book of Dead Days Series)",
        "Authors": "By Sedgwick, Marcus",
        "Description": "THE DAYS BETWEEN Christmas and New Year’s Eve are dead days, when spirits roam and magic shifts restlessly just beneath the surface of our lives. A magician called Valerian must save his own life within those few days or pay the price for the pact he made with evil so many years ago. But alchemy and sorcery are no match against the demonic power pursuing him. Helping him is his servant, Boy, a child with no name and no past. The quick-witted orphan girl, Willow, is with them as they dig in death fields at midnight, and as they are swept into the sprawling blackness of a subterranean city on a journey from which there is no escape.Praise for The Book of Dead Days:“Beautifully paced and sometimes blood-soaked. . . . A very tangible sense of evil.”—The Guardian“Subtle menace and power.”—The Independent“Packed with drama, mystery, and intrigue.”—The Bookseller",
        "Category": " Young Adult Fiction , Fantasy , Dark Fantasy",
        "Publisher": "Wendy Lamb Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Maelstrom (The Twins of Petaybee, Book 2)",
        "Authors": "By McCaffrey, Anne and Scarborough, Elizabeth Ann",
        "Description": "In Changelings, bestselling authors Anne McCaffrey and Elizabeth Ann Scarborough returned to the sentient planet Petaybee with a story of growth and transformation in the face of deadly new threats. The telepathic, shapeshifting twins Murel and Ronan found that Petaybee had plans for them as well. Now those plans begin to bear fruit with fresh possibilities . . . and dangers.MAELSTROMNow that Petaybee is forming a new equatorial island, the planet has agreed to harbor a group of new refugees, workers indentured to the powerful InterGal Corporation. But the mission to collect the immigrants becomes a rescue operation when it is revealed that InterGal is doing nothing to help these survivors of a world devastated by a meteor shower. Murel and Ronan set out to persuade the frightened refugees to come out of hiding, leave their world, and bring along their sacred totem animals, the gifted sea turtles called the Honus. But the twins discover that they’ve taken on more than they expected: The Honus are not the only animals sacred to the refugees. There are also the Manos, intelligent sharks who have lost none of their predatory habits–and who cannot be left behind to die.When the Manos are released into Petaybee’s waters, a tragic misunderstanding endangers the whole resettlement operation. At the same time, the mysterious sea otters who once rescued the twins’ father are suddenly revealed to be much more than they appear to be.Now it is up to Ronan and Murel, with the intrepid assistance of their river otter friend Sky, to smooth the waters before a maelstrom of revenge destroys Petaybee’s harmonious way of life.But even as the twins uncover startling new facts about Petaybee’s past that will change everything they thought they knew about the planet, the forces of InterGal are gathering, preparing to strike. . . .",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Total Memory Workout: 8 Easy Steps to Maximum Memory Fitness",
        "Authors": "By Green, Cynthia R., Ph.D.",
        "Description": "How to remember what you don't want to forget.Frustrated by your forgetfulness? Don't be. Memory lapses aren't necessarily a sign of age -- more often they are a sign of the times, as we're all inundated with important information to remember, from PINs and cell phone numbers to children's schedules and crucial business facts. Dr. Cynthia Green, founding director of The Memory Enhancement Program at Mount Sinai School of Medicine, shows you how to make the most of your memory, sharing her powerful yet practical eight-step program for improving your recall. Do you sometimes enter a room and forget what you went there for?-- page 29 Do you find yourself struggling to remember details from an important meeting?-- page 110Are you constantly misplacing your keys or glasses?-- page 113Do you find it impossible to remember directions, phone numbers, or computer passwords without writing them down?- - page 136Do the names of people you've just been introduced to slip your mind?- - page 193",
        "Category": " Self-help , Personal Growth , Memory Improvement",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Daring to Be Yourself",
        "Authors": "By Stoddard, Alexandra",
        "Description": "Explains how to define and develop a personal style in all aspects of one's life--from fashion and home decorating to career, travel, entertaining, and more",
        "Category": " Self-help , Affirmations",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "The King of the Rainy Country",
        "Authors": "By Freeling, Nicolas",
        "Description": "Inspector Van der Valk's search for a missing millionaire leads him to a remote village in the Austrian Alps",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "August",
            "Year": "1975"
        }
    },
    {
        "Title": "A Step by Step Guide to Houseplant Care",
        "Authors": "By Squire, David & David Gibbon & Neil Sutherland",
        "Description": "",
        "Category": "",
        "Publisher": "CLB PUBLISHING",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Garden Design: History, Principles, Elements and Practice",
        "Authors": "By Douglas, William Lake",
        "Description": "Traces the history of gardens, discusses style, paving, steps, walls, fences, gates, benches, ornaments, and light, and shows a variety of gardens",
        "Category": " Gardening , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "The World Almanac of the U.S.A.",
        "Authors": "By Carpenter, Allan, Provorse, Carl, and World Almanac",
        "Description": "Offering up-to-date information about the United States, a comprehensive reference almanac contains exhaustive portraits of each state, with rankings in different areas, such as income and education, and includes statistical data. Simultaneous. 100,000 first printing. $100,000 ad/promo.",
        "Category": " History , General",
        "Publisher": "Pharos Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "In the Name of Rome: The Men Who Won the Roman Empire (Phoenix Press)",
        "Authors": "By Goldsworthy, Adrian",
        "Description": "The complete and definitive history of how Roman generals carved out the greatest and longest-lasting empire the world has ever seen.The Roman army was one of the most effective fighting forces in history. The legions and their commanders carved out an empire which eventually included the greater part of the known world. This was thanks largely to the generals who led the Roman army to victory after victory, and whose strategic and tactical decisions shaped the course of several centuries of warfare.This book, by the author of THE PUNIC WARS, concentrates on those Roman generals who displayed exceptional gifts of leadership and who won the greatest victories. With 26 chapters covering the entire span of the Roman Empire, it is a complete history of Roman warfare.",
        "Category": " History , Military , General",
        "Publisher": "phoenix",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The World Turned Upside Down",
        "Authors": "By Flint, Eric (EDT), Drake, David (EDT), and Baen, Jim (EDT)",
        "Description": "When  readers first encounter science fiction, they find adventures on other planets and in future worlds, explorations of future technology and its implications, and extrapolations of social trends and warnings of where they may lead-but they also encounter concepts heretofore undreamed of, and the impact on the readers' thinking does nothing less than turn their world upside down. Now, David Drake, Jim Baen and Eric Flint gather together some of the greatest science fiction ever written in one volume, with each story chosen for a startling breakthrough concept which left readers stunned and changed the course of science fiction. In the Golden Age of science fiction, the SF magazines weren't given titles such as Astounding, Amazing, Startling, etc., for nothing! Pick up this generous serving of the very best of science fiction and prepared to be astounded, amazed, startled-and entertained.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "6.23",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "What Really Counts",
        "Authors": "By Thomas Nelson",
        "Description": "Meaning. Purpose. Calling. Vision. Whatever you name it, we are all searching for something that matters. Something that counts. We want to know that we're concentrating on the right things and that we're not missing the point.What Really Counts tackles twenty-two areas of significance-including God, Love, Wisdom, Purpose, Health-and explores what matters most in each of them, answering questions likeWhat are the basic truths? and What is most important?With introductions, meditations, and directed journaling sections on each topic, readers will embark on an interactive journey to discover not only what really counts, but also what doesn't, further drawing focus to their purposes within the context of God's call for them.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Philosophy of Humanism",
        "Authors": "By Lamont, Corliss",
        "Description": "",
        "Category": " Philosophy , General",
        "Publisher": "The Continuum Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Legacy Of The Prophet: Despots, Democrats, And The New Politics Of Islam",
        "Authors": "By Shadid, Anthony",
        "Description": "Now available in paperback, Legacy of the Prophetis a sweeping, first-person account of the transformation in the style and message of Islamic politics at the beginning of the twenty-first century. As terrorism floods our headlines, this book offers a rare but much-needed counterpoint: it shows that Islamic activists have increasingly renounced violence in order to form political parties, engage in grass-roots work, and enter into civil society to bring about peaceful reform in their authoritarian societies. Drawing on his years of reporting in more than a dozen countries of the Muslim world, Anthony Shadid charts the way in which the adolescence of yesterday&#39;s Islamic militants is yielding to the maturity of today&#39;s activists. Through personal interviews and extensive travel, he chronicles that new generation, which is finding a more realistic and potentially more successful future through democratic politics. Complete with a new introduction, Legacy of the Prophetpromises to redefine the debate over the future of political Islam.",
        "Category": " History , Middle East , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Rocket Boys (The Coalwood Series #1)",
        "Authors": "By Hickam, Homer H.",
        "Description": "The #1 New York Times bestselling memoir that inspired the film October Sky, Rocket Boys is a uniquely American memoir—a powerful, luminous story of coming of age at the dawn of the 1960s, of a mother's love and a father's fears, of a group of young men who dreamed of launching rockets into outer space . . . and who made those dreams come true.With the grace of a natural storyteller, NASA engineer Homer Hickam paints a warm, vivid portrait of the harsh West Virginia mining town of his youth, evoking a time of innocence and promise, when anything was possible, even in a company town that swallowed its men alive. A story of romance and loss, of growing up and getting out, Homer Hickam's lush, lyrical memoir is a chronicle of triumph—at once exquisitely written and marvelously entertaining.Now with 8 pages of photographs.A number-one New York Times bestseller in mass market, brought to the screen in the acclaimed film October Sky, Homer Hickam's memoir, nominated for the National Book Critics Circle Award, comes to trade paperback with an all-new photo insert.One of the most beloved bestsellers in recent years, Rocket Boys is a uniquely American memoir. A powerful, luminous story of coming of age at the end of the 1950s, it is the story of a mother's love and a father's fears, of growing up and getting out. With the grace of a natural storyteller, Homer Hickam looks back after a distinguished NASA career to tell his own true story of growing up in a dying coal town and of how, against the odds, he made his dreams of launching rockets into outer space come true.A story of romance and loss and a keen portrait of life at an extraordinary point in American history, Rocket Boys is a chronicle of triumph.",
        "Category": " Technology & Engineering , Aeronautics & Astronautics",
        "Publisher": "Delta",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Getting Things Done: The Art of Stress-Free Productivity",
        "Authors": "By Allen, David",
        "Description": "In today's world, yesterday's methods just don't work. In Getting Things Done, veteran coach and management consultant David Allen shares the breakthrough methods for stress-free performance that he has introduced to tens of thousands of people across the country. Allen's premise is simple: our productivity is directly proportional to our ability to relax. Only when our minds are clear and our thoughts are organized can we achieve effective productivity and unleash our creative potential. InGetting Things Done Allen shows how to:Apply the \"do it, delegate it, defer it, drop it\" rule to get your in-box to emptyReassess goals and stay focused in changing situations Plan projects as well as get them unstuck Overcome feelings of confusion, anxiety, and being overwhelmed Feel fine about what you're not doing From core principles to proven tricks, Getting Things Done can transform the way you work, showing you how to pick up the pace without wearing yourself down.",
        "Category": " Self-help , Personal Growth , Self-Esteem",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Lethally Blond (Bailey Weggins Mysteries, No. 5)",
        "Authors": "By White, Kate",
        "Description": "New York Times bestselling author and Cosmopolitan editor in chief Kate White delivers a sensational mystery that sends her gutsy, single, thirty-something sleuth Bailey Weggins behind the scenes of a hot new TV show--now available in trade paperback.  Do old flames burn brightest? Now that the TV show Morgue is shooting in Manhattan, the crime journalist for Buzz is remembering her fling with its gorgeous star, Chris Wickersham. But when Chris does contact Bailey Weggins, his intentions are all too honorable: It's to tell her that an actor from the show has gone missing.Delving deep into the glamorous yet crazy world of TV, Bailey soon finds herself in the middle of a killer story--literally. And as the case gets hotter, so does the action under the covers--especially the moment Bailey's crush Beau Regan comes back to town. With a dead body on the scene, ominous phone calls, and a stalker targeting her, it's clear that this reporter must unearth the truth now--beforeshe becomes the inspiration for Morgue's next episode.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Cuba and the Night: A Novel",
        "Authors": "By Iyer, Pico",
        "Description": "Richard, the jaded photojournalist who is Iyer's narrator, thinks he believes in nothing. He knows that the most beautiful women cruising the Calle 21 aren't women at all. And he strongly suspects that the ravishing cubana named Lourdes is only looking for a ticket to America - just as Lourdes fears that she may be nothing more than Richard's Caribbean souvenir. Yet, almost against their will, these two people fall in love. And what ensues is a story of passion and regret that is moving, arousing, and voluptuously atmospheric. A story that could only be told by the noted travel writer Pico Iyer, it is an ironic paean to a place where everyone has two fatherlands: \"Cuba and the night.\"",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Nancy Drew Ghost Stories",
        "Authors": "By Keene, Carolyn",
        "Description": "WHEN NIGHT FALLS AND THE HORRORS RISE -- WILL NANCY STAND A GHOST OF A CHANCE?  What strange dark secrets can a college professor reveal -- after she has risen from the grave?  Do dogs howl at the moon . . .do their eyes glow in the night -- one hundred years after their death?  What evil power lurks in the fortune-teller's den -- embodied in the sinister form of a terrifying froglike creature?  Prepare to lock your doors and dim your lights. The sound you hear is the beating of your own heart. Nancy Drew is about to face some of her most challenging cases ever -- six frightening and unforgettable encounters with the unknown. . . .",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Galapagos : Islands Lost in Time",
        "Authors": "By De Roy Moore, Tui",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "The Week-End Book",
        "Authors": "By Meynell, Francis (EDT) and Norwich, John Julius (INT)",
        "Description": "Updated from its original 1924 publication, a portable collection of leisure-time activity suggestions includes such options as weather forecasting, building campfires, making paper cups, and a variety of outdoor games, in a resource that is complemented by a selection of poetic works to be read on quiet country days.",
        "Category": " Reference , Curiosities & Wonders",
        "Publisher": "Abrams Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Chatsworth: The Home of the Duke and Duchess of Devonshire",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Derbyshire Countryside Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Houseplants (Practical Gardening)",
        "Authors": "By Squire, David",
        "Description": "",
        "Category": "",
        "Publisher": "JG Press",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Wwjd?: Think About It",
        "Authors": "By Courrege, Beverly",
        "Description": "Like millions of Christians, you may find yourself wondering, what would He do? But finding the answer is easier than you think. WWJD? Think About It challenges you by asking tough questions you face every day, showing you how Christians a hundred years ago answered the question -- based on excerpts from Charles Sheldon's best-selling classic, \"In His Steps\" -- and giving you Jesus' answers in select Scripture verses. By realizing what Jesus would do, or have us do, in everyday situations -- you will be empowered to make wise and lasting decisions.",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Real Estate Loans (Barron's Financial Tables)",
        "Authors": "By Solomon, Stephen S., Marshall, Clifford W., and Pepper, Martin",
        "Description": "Like Mortgage Payments, this updated guide shows monthly payments needed to amortize loans on amounts up to $600,000 with repayment periods from one to 40 years. Added tables cover valuation of assumable mortgages and points discount.",
        "Category": " Business & Economics , Finance , General",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    }
]