[
    {
        "Title": "Rebellion (The Macgregors)",
        "Authors": "By Roberts, Nora",
        "Description": "Despite the enmity between their two countries, Brigham Langston, a handsome English lord, finds himself drawn to the beautiful Serena MacGregor, a hot-tempered Scottish hoyden, in a historical romance that serves as a prequel to Roberts's best-selling MacGregor series. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Grandissimo Pavarotti",
        "Authors": "By Mayer, Martin and Fitzgerald, Gerald (PHT)",
        "Description": "This illustrated volume documents Luciano Pavarotti's place in history as one of the opera's legendary tenors, tracing his rise from a promising young artist to a superstar of the operatic and concert stages",
        "Category": " Music , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "8.04",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "Treasure Island (Tor Classics)",
        "Authors": "By Stevenson, Robert Louis",
        "Description": "Tor Classics are affordably-priced editions designed to attract the young reader. Original dynamic cover art enthusiastically represents the excitement of each story. Appropriate \"reader friendly\" type sizes have been chosen for each title—offering clear, accurate, and readable text. All editions are complete and unabridged, and feature Introductions and Afterwords.This edition of Treasure Island includes a Foreword, Biographical Note, and Afterword by Jane Yolen.A mysterious seaman hides at a country inn; cut-throats raid a sleepy English village; suddenly, young Jim Hawkins becomes the owner of a map leading to a lost tropical island and a fortune in stolen gold. Three adventures--Jim, Squire Trelawney, and Dr. Livesey--set out to find the treasure.But they trust the one they should most fear, Long John Silver. Charming, brave ruthless, murderous, Silver fills the squire's ship with pirates. And on the desolate, fever-infested island, the quest for gold becomes a deadly war of hide and seek. Desperate defenders against merciless killers battling over a cursed treasure won with blood, buried with blood, sought with blood. Incredible wealth that Jim and his friends can only claim...If they survive!",
        "Category": "",
        "Publisher": "Aerie",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Why Christian Kids Rebel: Trading Heartache for Hope",
        "Authors": "By Kimmel, Tim",
        "Description": "Author of Grace-Based Parenting and the best-selling Little House on the Freeway, Dr. Tim Kimmel helps Christian parents avoid the potential problems their well-meaning parenting styles could create. This book offers a new way to look at the \"ideal\" Christian home and shows why \"cocoon-style\" Christian homes don't always work.Many parents have \"done it all\" when it comes to the checklist of good Christian parenting, only to see their son or daughter step away from their belief system and embrace other lifestyle choices.Dr. Kimmel helps to increase the chances that your children will develop a vibrant faith early in life and stick with it on into adulthood. It will also provide help and hope for those already dealing with a rebellious teen and teach them how to lead the child back into a walk of faith.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Mary Engelbreit's Queen of the Kitchen Cookbook",
        "Authors": "By Engelbreit, Mary",
        "Description": "Provides useful tips and helpful instructions on the art of entertaining, from setting the table to arranging a menu, and features more than one hundred simple recipes and side dish suggestions.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Olivia Saves the Circus",
        "Authors": "By Falconer, Ian",
        "Description": "Step into the ring with Olivia, where the lights are dim, the color soft, and a little girl's imagination is the main attraction.Olivia remembers her trip to the circus very well. The performers were out sick, so she had to do everything. She... -rode on a unicycle -jumped on a trampoline -juggled five balls! -tamed lions -and flew through the air.",
        "Category": " Juvenile Fiction , Animals , Pigs",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Scarlet Letter (Wordsworth Classics)",
        "Authors": "By Hawthorne, Nathaniel",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Teaching Young Children",
        "Authors": "By Evan Moor",
        "Description": "This book is a National Parenting Center Holiday 2002 Seal of Approval Winner!     The 300+ activities in Teaching Young Children are designed to actively involve young learners. The directions are adult-friendly. First you are told “What You Need” and then “What You Do” step by step. Most activities require only materials usually found around the home or classroom.    This book is organized to help you find activities that are appropriate for your situation.         Indoor Playtime—54 activities       Art Time—26 activities    Mealtime—53 activities       Story Time—26 activities    Outdoor Playtime—66 activities       While-You-Wait Time—24 activities       Travel Time—54 activities     Each activity states which of six important skill areas are developed by the activity:         large-motor development       coordination & dexterity    language development       creativity       problem solving       memory & concentration       The book also presents information on common developmental traits of children ages 1–6.      This resource contains teacher support pages, reproducible student pages, and an answer key.",
        "Category": " Education , Parent Participation",
        "Publisher": "Evan-Moor Educational Publishers",
        "Price Starting With ($)": "8.78",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Lizzie The Elephant (IT'S A WILDLIFE BUDDY)",
        "Authors": "By De Luca, Daniela",
        "Description": "Get up-close and personal with an elephant family from Africa that has a new calf named Lizzie. Kids will follow Lizzie's wandering adventure that leads her a little too far from home and along the journey, will learn real-life facts about elephant families. \"What do elephants eat? Why do birds follow elephants?\" These are natural questions that would pop up in a story about elephants, and now, there is a picture book that answers them. Realistic habitats are paired with endearing characters to create a factual and entertaining story that parents, teachers, and children all will enjoy. Clear, acetate pages enhance these realistic illustrations, adding an element of surprise, and the story literally unfolds with the gatefold spread included in this concealed-spiral-bound book.",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "An Ice Cold Grave (Harper Connelly Mysteries, No. 3)",
        "Authors": "By Harris, Charlaine",
        "Description": "The voices of the dead become inescapable clues for lightning-struck sleuth Harper Connelly in this “winning series” (Booklist) of murder—and beyond—from #1 New York Times bestselling author Charlaine Harris…Harper Connelly heads to Doraville, North Carolina to find a missing boy—one of several teenage boys who have disappeared over the last five years. And all of them are calling for Harper. She finds them, buried in the frozen ground. All she wants is to get out of town before she’s caught in the media storm—until she herself is attacked and becomes part of the investigation. Soon Harper will learn more than she cared to about the dark mysteries and long-hidden secrets of Doraville—knowledge of the dead that makes her next in line to end up in an ice-cold grave...",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Murder In The Chateau: An Eleanor Roosevelt Mystery (Eleanor Roosevelt Mysteries)",
        "Authors": "By Roosevelt, Elliott",
        "Description": "Eleanor Roosevelt finds herself staying in a chateau in France, where a resistance group of anti-Nazi leaders is planning to kill Hitler, but the real mystery begins when SS Colonel Artur Brandt is found shot in the head. Reprint.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Upstairs Downstairs",
        "Authors": "By John Hawkesworth",
        "Description": "",
        "Category": "",
        "Publisher": "Dell Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Warrior's Honor: Ethnic War and the Modern Conscience",
        "Authors": "By Ignatieff, Michael",
        "Description": "Since the early 1990s, Michael Ignatieff has traveled the world's war zones, from Bosnia to the West Bank, from Afghanistan to central Africa. The Warrior's Honor is a report and a reflection on what he has seen in the places where ethnic war has become a way of life. Ignatieff charts the rise of the new moral interventionists--the relief workers, reporters, delegates, and diplomats who believe that other people's misery is of concern to us all. And he brings us face-to-face with the new ethnic warriors--the warlords, gunmen, and paramilitaries--who have escalated postmodern war to an unprecedented level of savagery. Hard-hitting and passionate, The Warrior's Honor is a profound and searching exploration of the perils and obligations of moral citizenship in a world scarred by war and genocide.",
        "Category": " Social Science , Ethnic Studies , General",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Cross Bones (8) (A Temperance Brennan Novel)",
        "Authors": "By Reichs, Kathy",
        "Description": "The key to a modern murder lies in the sands of history.   Examining a badly decomposed corpse is de rigueur for forensic anthropologist Temperance Brennan. But puzzling damage on the body of a shooting victim, an Orthodox Jewish man, suggests this is no ordinary Montreal murder. When a stranger slips Tempe a photograph of a skeleton unearthed at an archaeological site, Tempe uncovers chilling ties between the dead man and secrets long buried in the dust of Israel. Traveling there with Detective Andrew Ryan, Tempe plunges into an international mystery as old as Jesus, and centered on the controversial discovery of Christ's tomb. Has a mastermind lured her into an elaborate hoax? If not, Tempe may be on the brink of rewriting two thousand years of history -- if she can survive the foes dead set on burying her.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Mars",
        "Authors": "By Bova, Ben",
        "Description": "Epic in scope, unparalleled in execution, Mars is an unforgettable portrait of space, politics, science, and humanity that captures for all time the mystery and wonder of an alien frontierIt is a world shrouded in mystery—a planet pocked by meteors, baked by ultraviolet light, and covered by endless deserts the color of dried blood. To this harsh and unforgiving planet travel the twenty-give astronauts of the international Mars mission. Now, as the landers touch down and the base dome is inflated and the robotic explorers are sent aloft, they must somehow come together in a struggle of discovery and survival.Battling deadly meteor showers, subzero temperatures, and a mysterious “Mars virus,” these intrepid explorers are on their way to the most incredible and shocking discovery of all.Praise for Mars“A sweeping Michener-style saga of the first expedition to our neighboring planet . . . the ultimate summer escape.”—People“In Mars, Ben Bova re-creates for us much of that first excitement we felt in reading about the possibilities of space flight or, later, witnessing the earliest manned exploration.”—Los Angeles Times Book Review“The definitive novel about our fascinating neighbor.”—Arthur C. Clarke“An intelligent, entertaining story that may also serve as a rallying cry.”—Omni“Mars is an exemplary summer read . . . [with] adventurous, brilliant, over-the-edge characters [and] a convincing imaginative core in Bova's carefully imagined, striking, and spooky portrait of the planet.”—Voice Literary Supplement",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Executive Privilege (Dana Cutler Series, 1)",
        "Authors": "By Margolin, Phillip",
        "Description": "When private detective Dana Cutler is hired to follow college student Charlotte Walsh, she never imagines the trail will lead to the White House. But the morning after Walsh's clandestine meeting with Christopher Farrington, President of the United States, the pretty young coed is dead—the latest victim, apparently, of a fiend dubbed \"the D.C. Ripper.\"A junior associate in an Oregon law firm, Brad Miller is stunned by the death row revelations of convicted serial killer Clarence Little. Though Little accepts responsibility for a string of gruesome murders, he swears he was framed for one of them: the death of a teenaged babysitter who worked for then-governor Farrington.Suddenly nowhere in America is safe for a small-time private eye and a fledgling lawyer who possess terrifying evidence that suggests the unthinkable: that someone at the very highest level of government, perhaps the president himself, is a cold and brutal killer.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Follow the Wind",
        "Authors": "By Taylor, Janelle",
        "Description": "Determined to save her family and their Texas ranch from a greedy neighbor, beautiful Jessica Lane hires an outlaw named Navarro for protection and soon finds herself drawn to the passionate gunslinger, unaware that her foreman, Matthew Cordell, also loves her",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Pacific Vortex (Dirk Pitt Adventure)",
        "Authors": "By Cussler, Clive",
        "Description": "Dirk Pitt’s first, most terrific adventure! Dirk Pitt, death-defying adventurer and deep-sea expert, is out to the ultimate test as he plunges into the perilous waters of the Pacific Vortex—a fog-shrouded sea zone where dozens of ships have vanished without a trace. The latest victim is the awesome superb Starbuck, America’s deep-diving nuclear arsenal. Its loss poses an unthinkable threat to national defense. Pitt’s job is to find it, salvage it, before the sea explodes. In a furious race against time, Pitt’s mission swirls him into a battle with underwater assassins—and traps him in the arms of Summer Moran, the most stunningly exotic and dangerous toward disaster, Clive Cussler plummets his hero onto an ancient sunken island—the astonishing setting for the explosive climax of Pacific Vortex!",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Little White Lies: A Novel of Love and Good Intentions",
        "Authors": "By Townley, Gemma",
        "Description": "WHAT’S ONE LITTLE WHITE LIE?Okay, so it isn’t that little. It’s kind of a whopper. It’s just that when Natalie Raglan ups and quits her job at a Bath advertising firm, breaks up with her loser-ish boyfriend, and moves–to London! Things don’t quite turn out the way she planned. Having made the brave move to the Big City, the lifelong country mouse finds that living chic is still a long way off. Even Cressida, the girl who used to rent her tiny flat, still gets more phone calls and mail there than Nat does. Come to think of it, Cressida Langdon’s life looks pretty appealing–especially when an invitation to the posh, exclusive Soho House club arrives, addressed to Cressida. Before she really knows what she’s done, Nat has opened Cressida’s mail . . . and taken up her life. Soon Nat’s dating a gorgeous investment banker named Simon, giving “reiki healing sessions,” wearing wonderful clothes, and partying with the A-list at Soho House. But the best part really is Simon. He’s everything Nat has ever wanted. The problem is he thinks she’s someone else. And as her life and her lies begin to spiral out of control, Nat can’t help but wonder: Will she be exposed as a liar and a fake–or be saved from ruin by simply claiming good intentions. . . .",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Dinosaurs! (Know-It-Alls)",
        "Authors": "By Harris, Greg (ILT) and Johnson, Jay",
        "Description": "Introduces various kinds of dinosaurs, and discusses what is known about their habitat, groups, food, communications, defenses, and life cycles",
        "Category": " Juvenile Nonfiction , Animals , Dinosaurs & Prehistoric Creatures",
        "Publisher": "McClanahan Book Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Knight Life (Revised & Expanded Edition)",
        "Authors": "By David, Peter",
        "Description": "The legendary debut novel from New York Times bestselling author Peter David has been expanded and updated into a brand new edition.  King Arthur, the once and future King, has been called forth by the wizard Merlin to lead a land in turmoil-the United States of America. But with no throne to sit upon, Arthur must run for elective office-starting with the Mayorship of New York City...",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Ace",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Madness Season (Daw Book Collectors)",
        "Authors": "By Friedman, C. S.",
        "Description": "Three hundred years had passed since the Tyr conquered the people of Earth as they had previously overcome numerous races throughout the galaxy.  In their victory they had taken the very heart out of the human race, isolating the true individualists, the geniuses, all the people who represented the hopes, dreams, and discoveries of the future, and imprisoning them in dome colonies on planets hostile to human life.  There the Tyr, a race which itself shared a unified gestalt mind, had left these gifted individuals to work on projects which would, the conquerers hoped, reveal all of human kind's secrets to them.Yet Daetrin's secret as one no scientist had ever uncovered, for down through the years he had succeeded in burying it so well that he had even hidden his real nature from himself. But, taken into custody by the Tyr, there was no longer any place left for Daetrin to run, no new name and life for him to assume. Now he would at last be forced to confront the truth about himself—and if he failed, not just Daetrin but all humans would pay the price...",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "DAW",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Santa Claus is Coming to Town (Classic Holliday Collection)",
        "Authors": "By Dandi Daley Mackall",
        "Description": "",
        "Category": "",
        "Publisher": "Landoll",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Little Drummer Boy",
        "Authors": "By Quattrocki, Carolyn /cover illust.by Linda Graves & inside illust.by Susan Spellman",
        "Description": "",
        "Category": "",
        "Publisher": "pub. int/candy cane book 1995",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "'Twas the Night Before Christmas (Candy Cane Books)",
        "Authors": "By Clement Moore",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Total Nutrition: The Only Guide You'll Ever Need - From The Mount Sinai School of Medicine",
        "Authors": "By Herbert, Victor (EDT) and Subak-Sharpe, Genell J. (EDT)",
        "Description": "Facts are healthier than fads. New myths and theories about nutrition splash across the headlines every day. Americans spend over $12 billion a year on worthless-even dangerous-nutrtion products. Total Nutrition replaces fads and ignorance with scientific fact.\"A feast of information,\" says USA Today. What's the best way to give a baby a healthy start? What is the right diet for someone with diabetes or heart disease or arthritis? Do sugar and food additives make children hyperactive? Can foods and vitamins protect against disease? How do foods and medicines interact? What weight-loss diet is both safe and effective? What should an athlete eat  for top performance?The thinking person's guide to nutrition: With forty-one chapters packed with expert medical advice and over two hundred tables, illustrations, and sample menus, this book gives the clear, authoritative answers to all of these questions and more. As fitness broadcaster and columnist Gabe Mirkin, M.D., says, \"It is so full of solid scientific information about food that everyone should own a copy.\"",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "The 24 Hour Turn-Around: Discovering the Power to Change",
        "Authors": "By Hartness, Jim and Eskelin, Neil",
        "Description": "The greatest hurdle to change is the first step--the actual decision to do it. After that, anything is possible. The 24-Hour Turnaround challenges people to spend 1 hour reading and contemplating each of the book's 24 short chapters and to make a heartfelt decision to change in the area each chapter addresses. The premise is that decisions made in those 24 hours will transform the reader's career, health, relationships, and overall attitude.The authors provide specific, doable advice, biblical affirmation, and motivating examples to help readers turn their lives around. Topics include improving self-worth, setting achievable goals, controlling anxiety, winning by quitting, making the most of money, discovering excellence, and more.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2012"
        }
    },
    {
        "Title": "The Janissary Tree: A Novel (Investigator Yashim, 1)",
        "Authors": "By Goodwin, Jason",
        "Description": "WINNER OF THE EDGAR AWARD FOR BEST NOVELThis first book in the Investigator Yashim series is a richly entertaining tale, full of exotic history and intrigue, introduces Investigator Yashim: In 1830s Istanbul, an extra-ordinary hero tackles an extraordinary plot that threatens to topple the Ottoman EmpireIt is 1836. Europe is modernizing, and the Ottoman Empire must follow suit. But just before the Sultan announces sweeping changes, a wave of murders threatens the fragile balance of power in his court. Who is behind them? Only one intelligence agent can be trusted to find out: Yashim Lastname, a man both brilliant and near-invisible in this world. You see, Yashim is a eunuch. He leads us into the palace's luxurious seraglios and Istanbul's teeming streets, and leans on the wisdom of a dyspeptic Polish ambassador, a transsexual dancer, and a Creole-born queen mother. And he introduces us to the Janissaries. For 400 years, they were the empire's elite soldiers, but they grew too powerful, and ten years ago, the Sultan had them crushed. Are the Janissaries staging a brutal comeback?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Emergency Medical Treatment: Infants, Children, and Adults : A Handbook on What to Do in an Emergency to Keep Someone Alive Until Help Arrives",
        "Authors": "By Vogel, Stephen N. and Manhoff, David H.",
        "Description": "Tells what to do in cases of choking, seizures, drowning, high fever, burns, bleeding, vomiting, and injuries",
        "Category": " Health & Fitness , First Aid",
        "Publisher": "Beechwood Healthbooks Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Ten Thousand: A Novel of Ancient Greece",
        "Authors": "By Ford, Michael Curtis",
        "Description": "In 401 B.C., a thundering army of mercenaries, camp followers, dreamers, and glory seekers set off to help a rebellious foreign general named Cyrus. In the months that followed, ten thousand men--trained and hardened in three decades of war in Greece--would engage in pitched battles, witness untold horrors, and begin a desperate march across he desert, over raging rivers, and into the jaws of hell itself. By the time it was over, some would be alive, others dead, and one among them would emerge and the greatest hero of all...In a novel of high adventure and riveting historical drama, Michael Curtis Ford brings to life an amazing true story from Greek antiquity--Xenophon's march of the ten Thousand. A tale of war and peace, of loyalties and betrayals, and of a soldier's love for a mysterious and dangerous woman, The Ten Thousand captures the eternal spirit of courage--in the face of impossible odds.",
        "Category": " Fiction , Historical , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Day Before Midnight: A Novel",
        "Authors": "By Hunter, Stephen",
        "Description": "“A breathtaking, fascinating look at what could happen—given the possibility of an atomic ‘given.’ A wrap-up you'll never forget.”—Robert LudlumThe countdown begins when welder Jack Hummel is abducted from his suburban Maryland home ans whisked to the South Mountain MX missile site—a top-secret nuclear complex now taken over by paramilitary terrorists.All that stands between the Uzi-armed commandos and the launch button is a half-ton titanium block. They want Jack Hummel to cut through it—so they can unleash a devastatingly brilliant plot that threatens global disaster.Now a Delta Force veteran and a think-tank defense wizard must get inside South Mountain—by defeating their own super-security systems and a darkly ingenious enemy leader . . . . . . while Jack Hummel's torch burns closer and closer to the launch key . . . while the clock ticks closer to midnight—and Armageddon.Praise for The Day Before Midnight“Rockets toward a shattering climax like an incoming missile.”—Stephen Coonts, author of Flight of the Intruder and Final Flight“Nonstop action and mounting tension.”—The New York Times Book Review“Slam-bang action and relentless suspense.”—The Washington Post“The novel crackles and jolts.”—Chicago Tribune“The one to beat this year in the nail-biter class . . . an edge-of-the-seat doomsday countdown thriller.”—Daily News, New York",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "The Last Patriot: A Thriller (7) (The Scot Harvath Series)",
        "Authors": "By Thor, Brad",
        "Description": "Brad Thor, master of suspense and #1 New York Times bestselling author is back with his highest-voltage thriller to date in which Navy SEAL turned covert Homeland Security operative Scot Harvath must race to locate an ancient secret that has the power to stop militant Islam dead in its tracks.June 632 A.D.: Deep within the Uranah Valley of Mount Arafat in Mecca, the Prophet Mohammed shares with his closest companions a final and startling revelation. Within days, he is assassinated. September 1789: U.S. Minister to France Thomas Jefferson, who is charged with forging a truce with the violent Muslim pirates of the Barbary Coast, makes a shocking discovery—one that could forever impact the world’s relationship with Islam. Present day: When a car bomb explodes outside a Parisian café, Scot Harvath is thrust back into the life he has tried so desperately to leave behind. Saving the intended victim of the attack, Harvath becomes party to a perilous race to uncover a secret so powerful that militant Islam could be defeated once and for all. But as desperate as the American government is to have the information brought to light, there are powerful forces determined that Mohammed’s mysterious final revelation continue to remain hidden forever. What Jason Bourne was to the Cold War, Scot Harvath is to the War on Terror. In The Last Patriot, readers will be engrossed as Harvath once again takes them on a whirlwind tour through international cities and nail-biting suspense where the stakes are higher than they have ever been before.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "A Game for Heroes",
        "Authors": "By Higgins, Jack",
        "Description": "",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1978"
        }
    },
    {
        "Title": "Sailing (Penguin Handbooks)",
        "Authors": "By Heaton, Peter",
        "Description": "",
        "Category": " Sports & Recreation , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1959"
        }
    },
    {
        "Title": "The Inferno (Signet Classics)",
        "Authors": "By Dante Alighieri and Ciardi, John (TRN)",
        "Description": "In the first part of Dante's epic poem about the three realms of the Christian afterlife, a spiritual pilgrim is led by Virgil through the nine circles of Hell. Reprint.",
        "Category": " Fiction , Classics",
        "Publisher": "Signet Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Creepy Beetles! (Hello Science Reader! Level 2)",
        "Authors": "By Robinson, Fay and Cassels, Jean (ILT)",
        "Description": "Filled with an abundance of fascinating facts about beetles of all shapes, sizes, and patterns including where they live and what they eat, a guide for young readers contains a vibrant appendix that labels every beetle featured in the book. Original.",
        "Category": " Juvenile Nonfiction , Animals , Insects, Spiders, etc.",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Armchair Reader: The Amazing Book of History: Extraordinary Facts and Stories",
        "Authors": "By J.K. Kelley, Jonathan W. Jordan, William David, Robert Bullington, William Martin, William Sasser",
        "Description": "",
        "Category": "",
        "Publisher": "West Side Publishing",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "You and Your Child",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": "",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Star Wars: Galactic Crisis!",
        "Authors": "By Windham, Ryder",
        "Description": "Recounts how the Sith Lord, Darth Sidious, disguised as Senator Palpatine of Naboo, plotted to make himself emperor, while the Jedi Knights and their allies did everything in their power to maintain order and freedom in a galaxy far, far away.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Brothers Bulger: How They Terrorized and Corrupted Boston for a Quarter Century",
        "Authors": "By Carr, Howie",
        "Description": "The riveting New York Times bestseller by award-winning columnist Howie Carr--now with a stunning new afterword detailing Whitey Bulger's capture.For years their familiar story was of two siblings who took different paths out of South Boston: William \"Billy\" Bulger, former president of the Massachusetts State Senate; and his brother James \"Whitey\" Bulger, a vicious criminal who became the FBI's second most-wanted man after Osama Bin Laden. While Billy cavorted with the state's blue bloods to become a powerful political force, Whitey blazed a murderous trail to the top rung of organized crime. Now, in this compelling narrative, Carr uncovers a sinister world of FBI turncoats, alliances between various branches of organized crime, St. Patrick's Day shenanigans, political infighting, and the complex relationship between two brothers who were at one time kings.As the film Black Mass, starring Johnny Depp as Whitey Bulger, hits theaters, take a deeper dive into the story of the Bulgers, and their fifty-year reign over Boston with Howie Carr's THE BROTHERS BULGER.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The Complete Idiot's Guide To Personal Finance in Your 20s and 30s (2nd Edition)",
        "Authors": "By Fisher, Sarah Young and Shelly, Susan",
        "Description": "Provides information on credit histories, budgeting, borrowing, banking, investing, and avoiding common financial mistakes.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Protecting Your Financial Future",
        "Authors": "By Lee & Kristy Phillips, Theodore Provenza (Foreword)",
        "Description": "",
        "Category": "",
        "Publisher": "LegaLees Corporation",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "What Little Boys Are Made Of: Loving Who They Are and Who They Will Become",
        "Authors": "By Daly, Jim",
        "Description": "Mischief dons blue jeans and totes a fishing pole in Jim Daly's Americana artwork featured throughout this unforgettable exploration of boyhood. Sweet writings express virtues gathered like treasures along a boy's journey to becoming a man in this gift for sons, fathers, and anyone in love with a boy, little or big, who dreams of lazy days with bullfrogs and buddies.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "For Better or For Best",
        "Authors": "By Smalley, Gary and Scott, Steve",
        "Description": "",
        "Category": "",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Daily Blessings for My Husband",
        "Authors": "By Carlson, Melody",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The English Governess and the Siamese Court: The True Story Behind 'The King and I'",
        "Authors": "By Leonowens, Anna Harriette",
        "Description": "Anna Leonownes' memoir of her six year as a governess in the Royal Palace of Bangkok was the inspiration for the beloved Broadway musical The king and I, as well as two award-winning films. First published in 1870, Leonowens' memoir is the true story of a proper English governess who is hired by the King of Siam to tutor his many children. A delightful portrait of an unlikely friendship between two headstrong personalities, it is also a revealing peak at two very different cultures.",
        "Category": " Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Marriage and the Family in the Middle Ages",
        "Authors": "By Gies, Joseph and Gies, Frances",
        "Description": "From bestselling historians Frances and Joseph Gies, authors of the classic “Medieval Life” series, comes this compelling, lucid, and highly readable account of the family unit as it evolved throughout the Medieval period—reissued for the first time in decades.“Some particular books that I found useful for Game of Thrones and its sequels deserve mention. Life in a Medieval Castle and Life in a Medieval City, both by Joseph and Frances Gies.” —George R. R. Martin, author of Game of ThronesThroughout history, the significance of the family—the basic social unit—has been vital. In Marriage and the Family in the Middle Ages, acclaimed historians Frances and Joseph Gies trace the development of marriage and the family from the medieval era to early modern times. It describes how the Roman and barbarian cultural streams merged under the influence of the Christian church to forge new concepts, customs, laws, and practices. Century by century, the Gies follow the development—sometimes gradual, at other times revolutionary—of significant components in the history of the family including:The basic functions of the family as a production unit, as well as its religious, social, judicial, and educational roles.The shift of marriage from private arrangement between families to public ceremony between individuals, and the adjustments in dowry, bride-price, and counter-dowry.The development of consanguinity rules and incest taboos in church law and lay custom.The peasant family in its varying condition of being free or unfree, poor, middling, or rich.The aristocratic estate, the problem of the younger son, and the disinheritance of daughters.The Black Death and its long-term effects on the family.Sex attitudes and customs: the effects of variations in age of men and women at marriage.The changing physical environment of noble, peasant, and urban families.Arrangements by families for old age and retirement.Expertly researched, master historians Frances and Joseph Gies—whose books were used by George R.R. Martin in his research for Game of Thrones—paint a compelling, detailed portrait of family life and social customs in one of the most riveting eras in history.",
        "Category": " History , Europe , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Belle Grove Plantation Cookbook: Recipes from the Shenandoah Valley",
        "Authors": "By Belle Grove",
        "Description": "",
        "Category": "",
        "Publisher": "Wimmer Cookbooks",
        "Price Starting With ($)": "8.08",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "What The Lady Wants",
        "Authors": "By Crusie, Jennifer",
        "Description": "A hilarious modern romance follows disillusioned private investigator Mitch Peabody as he finds himself falling head over heels in love with his sexy new employer, Mae Sullivan, who has hired him to find the men who murdered her uncle. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Light in Shadow (A Whispering Springs Novel)",
        "Authors": "By Krentz, Jayne Ann",
        "Description": "Zoe Luce is a successful interior designer in the Arizona town of Whispering Springs who's developed an unusual career specialty-helping recently divorced clients redesign their homes, to help them forget the past and start anew. But Zoe knows that some things can't be covered up with a coat of paint. And when she senses that one of her clients may be hiding a dark secret, she enlists P.I. Ethan Truax to find the truth.Working together, they solve the mystery . . . and barely escape with their lives. But Ethan's exquisite detection skills are starting to backfire on Zoe: she never wanted to let him find out about her former life; she never wanted to reveal her powerful, inexplicable gift for sensing the history hidden within a house's walls; she never wanted him to know that \"Zoe Luce\" doesn't really exist. She never wanted to fall in love with him.Now, no matter how much she resists, Ethan may be her only hope-because the people she's been running from have found her. And just when Zoe dares to dream of a normal life and a future with the man she loves, her own past starts to shadow her every step-and threatens to take her back into a nightmare.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Manhunt",
        "Authors": "By Evanovich, Janet",
        "Description": "A woman with a talent for numbers, Alexandra Scott wanted to escape the rat race and go someplace where the men outnumber the women. Trading in her Wall Street job and fancy condo for a rundown cabin in the woods. She's now Alaskan Wilderness Woman. It isn't long before she finds exactly what she's looking for: one sexy pilot named Michael Casey. But this confirmed bachelor has no intentions of getting caught in any woman's crosshairs—especially a hunter as appealing as Alex. It'll take skill, determination, and a little romantic persuasion for this big-game hunter to bag her prey.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Freedom's Own Island: The British Expansion (History of Britain and the British People)",
        "Authors": "By Bryant, Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow & Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Way of the Wild Heart: A Map for the Masculine Journey",
        "Authors": "By Eldredge, John",
        "Description": "This is a book about how a boy?and a man?becomes a man.It's a guide to the process of masculine initiation, that ancient path every boy and man must take if they would become the man they long to be. The path whereby they come toknow they are a man, and are able to live and love from a deep, centered strength.We live in a time where most men (and boys) are essentially fatherless. Whatever their circumstance, they have no man actually taking themthrough the many adventures, trials, battles and experiences they need to shape a masculine heart within them. They find themselves on their own to figure life out, and that is a lonely place to be. Their fears, anger, boredom, and their many addictions all come out of this fatherless place within them, a fundamental uncertainty in the core of their being.But there is a way.\"We aren't meant to figure life out on our own,\" says John Eldredge. \"God wants to father us.\" InThe Way of the Wild Heart, Eldredge reveals how God comes to a man and takes him on the masculine journey, how nearly all the events of a man's life can come togther to provide the initiation he never received. And how parents can offer that initiation to their sons. Whatever your age may be, your Father is ready to take up your journey. For youare his son.",
        "Category": " Religion , Spirituality",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "United We Stand: The Unprecedented Story of the GM-UAW Quality Partnership",
        "Authors": "By Weekley, Thomas L., Wilber, Jay C., and Creedon, Betsy Reid (EDT)",
        "Description": "",
        "Category": " Business & Economics , Quality Control",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Encouraging the Heart: A Leader's Guide to Rewarding and Recognizing Others (J-B Leadership Challenge: Kouzes/Posner)",
        "Authors": "By Kouzes, James M., Posner, Barry Z., and Posner, Kouzes",
        "Description": "All too often, simple acts of human kindness are often overlooked and under utilized by people in leadership roles. Advising mutual respect and recognition of accomplishments, Encouraging the Heart shows us how true leaders encourage and motivate those they work with by helping them find their voice and making them feel like heroes. Recognized experts in the field of leadership, authors James Kouzes and Barry Posner show us that, through love, leaders can encourage, and indeed allow those around them to be their very best. Both practical and inspirational, Encouraging the Heart gives readers a thoughtful approach to motivating individuals within an organizational structure.Read Chapter 3 or Chapter 12, or see The Encouragement Index.",
        "Category": " Business & Economics , Management",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Alpine Icon: An Emma Lord Mystery",
        "Authors": "By Daheim, Mary",
        "Description": "ALL THE MURDER FIT TO PRINT                       Editor-publisher Emma Lord and her Alpine Advocate staff suspect excitement when glamorous Ursula O'Toole Randall returns to Alpine to marry her third husband. But hers is a lethal homecoming. . . .Ursula, clad in satin pajamas, is found dead in the shallow waters of the Skyhomish River. Sheriff Dodge suspects foul play. Yet as Emma hunts for a stop-press story, a snake-in-the-grass killer, unappeased by one murder, slithers unnoticed through the shadows. . . .",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Men in Blue (Badge Of Honor)",
        "Authors": "By Griffin, W. E. B.",
        "Description": "W.E.B. Griffin's bestselling series, THE CORPS and BROTHERHOOD OF WAR, have captured the pride and glory of the military community. Now he reveals a city police force with the same unique blend of realism, drama, and action. Here are the brave men and women behind the badge as you've never seen them before--their hopes and fears, their courage and heroism, sparked by a single, shocking event: the killing of a cop in the line of duty.",
        "Category": " Fiction , War & Military",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Starplex",
        "Authors": "By Sawyer, Robert J.",
        "Description": "Twenty years after the discovery of artificial wormholes launches Earth space exploration to unforeseeable heights, Starplex Director Keith Lansing investigates a mysterious vessel that soon threatens the station with intergalactic war. Original.",
        "Category": " Fiction , Science Fiction , High Tech",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Definitely Dead (Sookie Stackhouse/True Blood, Book 6)",
        "Authors": "By Harris, Charlaine",
        "Description": "As a person with so few living relatives, Louisiana cocktail waitress Sookie Stackhouse really hated to lose one. But she never guessed that it would be her cousin Hadley—a consort of the Vampire Queen of New Orleans. After all, technically speaking, Hadley was already dead. And now, as unexpected heir to Hadley’s estate, Sookie discovers the inheritance definitely comes with a risk.   Someone doesn’t want Sookie looking too deeply into Hadley’s past—or for that matter, Hadley’s possessions. And they’re prepared to do anything in their power to stop her. But who? The range of suspects runs from the Rogue Weres who reject Sookie as a friend of the Pack to the Vampire Queen herself, who could be working through a particularly vulnerable subject—Sookie’s first love, Bill.   Whoever it is, they’re definitely dangerous—and Sookie’s life is definitely on the line…   With HBO's launching of an all-new show, True Blood, based on the Southern Vampire novels, the demand for Charlaine Harris and Sookie Stackhouse is bigger than ever.Watch a QuickTime trailer for the HBO original series True Blood.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "The destroyer: murder's shield (The Destroyer series #9)",
        "Authors": "By Sapir, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Murder Ward: The Destroyer #15",
        "Authors": "By Richard Sapir, Warren Murphy",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1974"
        }
    },
    {
        "Title": "As Nature Made Him: The Boy Who Was Raised as a Girl",
        "Authors": "By Colapinto, John",
        "Description": "In  1967, after a twin baby boy suffered a botched circumcision, his family agreed to a radical treatment that would alter his gender.  The case would become one of the most famous in modern medicine -- and a total failure.  As Nature Made Him tells the extraordinary story of David Reimer, who, when finally informed of his medical history, made the decision to live as a male.  A macabre tale of medical arrogance, it is first and foremost a human drama of one man's -- and one family's -- amazing survival in the face of terrible odds.",
        "Category": " Medical , Anatomy",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Summer Breeze (Coulter Family Historical)",
        "Authors": "By Anderson, Catherine",
        "Description": "New York Times bestselling author Catherine Anderson explores the history of the beloved Coulter Family with this timeless tale that will make you believe in the power of love…   The year is 1889, and Rachel Hollister hasn’t set foot outside her house in five years. Ever since a savage attack left her family dead, she’s cordoned herself off from the outside world, afraid to let anyone into her home—or into her heart. But now trouble has appeared on her doorstep—and suddenly she has no choice but to let a handsome rancher invade her well-guarded existence...   Confirmed bachelor Joseph Paxton grudgingly offers to take up temporary residence at the Hollister ranch—even though it’s obvious that Rachel doesn’t want his protection. But once he catches a glimpse of his beautiful young ward and her remarkable spirit, he’ll do anything to make her see the refuge he’s offering in his embrace—and the splendor that exists beyond her front door. Otherwise he’ll just have to build a safe haven big enough for the both of them.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "DK Readers: Feeding Time (Level 1: Beginning to Read) (DK Readers Level 1)",
        "Authors": "By Davis, Lee",
        "Description": "This Level 1 book is appropriate for children who are just beginning to read. Which animal enjoys breakfast in bed? Which ones eat all the time? Discover how African animals find their food. For children who are just beginning to read and who have a limited vocabulary, these 32-page Level 1 books-about everything from tadpoles to puppies-use word repetition and simple sentences to convey meaning. Picture dictionary boxes with word labels \"show\" the meanings of words. These books contain between 400 and 450 words each, and they are 80 percent pictures and 20 percent text. The Dorling Kindersley Readers combine an enticing visual layout with high-interest, easy-to-read stories to captivate and delight young bookworms who are just getting started. Written by leading children's authors and compiled in consultation with literacy experts, these engaging books build reader confidence along with a lifelong appreciation for nonfiction, classic stories, and biographies. There is a DK Reader to interest every child at every level, from preschool to grade 4.",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Far from the Madding Crowd",
        "Authors": "By Thomas Hardy",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "How to Be Your Husband's Best Friend: 365 Ways to Express Your Love",
        "Authors": "By Bolin, Cay, Cindy, Trent, Cay, Bolin, and Trent, Cindy",
        "Description": "",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Pinon Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Rites and Religions of the Anglo-Saxons",
        "Authors": "By Owen, Gale R.",
        "Description": "",
        "Category": "",
        "Publisher": "Dorset Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Pride Of The Sea",
        "Authors": "By Waldron, Tom",
        "Description": "",
        "Category": " History , World",
        "Publisher": "Citadel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "My Name Isn't Martha but I Can Decorate My Home: The Real Person's Guide to Creating a Beautiful Home Easily and Affordably",
        "Authors": "By Hanby-Robie, Sharon",
        "Description": "An inexpensive home decorating guide reveals industry secrets in the tradition of Martha Stewart and is presented in an A-to-Z format that outlines economical home decoration, from window treatments, to buying a couch, to painting an apartment. Original.",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Last of the Amazons: A Novel",
        "Authors": "By Pressfield, Steven",
        "Description": "The author of the international bestsellers Gates of Fire and Tides of War delivers his most gripping and imaginative novel of the ancient world–a stunning epic of love and war that breathes life into the grand myth of the ferocious female warrior culture of the Amazons.Steven Pressfield has gained a passionate worldwide following for his magnificent novels of ancient Greece, Gates of Fire and Tides of War.  In Last of the Amazons, Pressfield has surpassed himself, re-creating a vanished world in a brilliant novel that will delight his loyal readers and bring legions more to his singular and powerful restoration of the past.  In the time before Homer, the legendary Theseus, King of Athens (an actual historical figure), set sail on a journey that brought him into the land of tal Kyrte, the “free people,” a nation of proud female warriors whom the Greeks called “Amazons.”  The Amazons, bound to each other as lovers as well as fighters, distrusted the Greeks, with their boastful talk of “civilization.” So when the great war queen Antiope fell in love with Theseus and fled with the Greeks, the mighty Amazon nation rose up in rage.    Last of the Amazons is not merely a masterful tale of war and revenge.  Pressfield has created a cast of extraordinarily vivid characters, from the unforgettable Selene, whose surrender to the Greeks does nothing to tame her; to her lover, Damon, an Athenian warrior who grows to cherish the wild Amazon ways; to the narrator, Bones, a young girl from a noble family who was nursed by Selene from birth and secretly taught the Amazon way; to the great Theseus, the tragic king; and to Antiope, the noble queen who betrayed tal Kyrte for the love of Theseus.  With astounding immediacy and extraordinary attention to military detail, Pressfield transports readers into the heat and terror of war.  Equally impressive is his creation of the Amazon nation, its people, its rituals and myths, its greatness and savagery.  Last of the Amazons is thrilling on every page, an epic tale of the clash between wildness and civilization, patriotism and love, man and woman.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "The Painted Veil",
        "Authors": "By Maugham, W. Somerset",
        "Description": "Set in England and Hong Kong in the 1920s, The Painted Veil is the story of the beautiful but love-starved Kitty Fane. When her husband discovers her adulterous affair, he forces her to accompany him to the heart of a cholera epidemic. Stripped of the British society of her youth and the small but effective society she fought so hard to attain in Hong Kong, she is compelled by her awakening conscience to reassess her life and learn how to love.The Painted Veil is a beautifully written affirmation of the human capacity to grow, to change, and to forgive.",
        "Category": " Fiction , Classics",
        "Publisher": "Vintage",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Game for a Lifetime: More Lessons and Teachings",
        "Authors": "By Penick, Harvey, Shrake, Bud, and Shrake, Edwin",
        "Description": "His gentle demeanor and timeless wisdom made Harvey Penick America's best-loved teacher of the game of golf. From his lesson tee at the Austin Country Club, he taught several generations of champions and high-handicappers, pros and amateurs alike. All who came in contact with him came away with their grips improved, their souls refreshed, and their hearts gladdened by his love of teaching and his eagerness to serve.  At the time of his death in April 1995, Harvey was well along in the work on this, his fourth book of golf instruction. Like his classic Little Red Book, The Game for a Lifetime is filled not so much with swing tips and stance aids but with a timeless philosophy that seeks to improve your play by improving how you feel about your game. The secret of Harvey's teaching lies not in any techniques he prescribes but in how the stories and advice and parables he shares point the way for anyone to play better golf by being a better golfer.  In The Game for a Lifetime, Harvey tells us about the different methods he used to help his pupils find twenty more yards off the tee; about the incredible swing of Leaping Lucifer who did everything wrong when he stood over the ball, but whom Harvey helped to find contentment and joy both on and off the course; and about the sweet-swinging pupils whose swings he could remember and recognize without having seen them for thirty-odd years. He spends much of the book advising \"the seasoned player\" -- whose seasoning is measured not in years but in experience on the links and at the practice tee. His highest praise goes not to any of the champions he trained or Hall of Famers he worked with but to his wife, Helen, who stood by him in thick and thin during his seven decades of service to the game he loved. And the book concludes with the tribute his son, Tinsley, paid him at a gathering of the world's best golf teachers during the week of the 1995 Ryder Cup.  Harvey always said he knew that the teachings in his books have stood the test of time. His was truly a lifetime spent pursuing the best the game has to offer us: physically, emotionally, spiritually. The Game for a Lifetime is a fitting testament from this remarkable man.",
        "Category": " Sports & Recreation , Reference",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Belle Ruin: A Novel (Emma Graham Mysteries)",
        "Authors": "By Grimes, Martha",
        "Description": "When twelve-year-old Emma Graham, a waitress at her mother's decaying resort hotel and now the youngest cub reporter in the history of La Porte's Conservative newspaper, discovers the crumbling shell of a fabulous hotel hidden in the woods near her small town of Spirit Lake, she never imagines that the mysteries it holds will bring her one step closer to solving a forty-year-old crime - and force a new transgression to light. The sumptuous Belle Rouen, with its ornate public rooms, two golf courses, and grand ballroom, was the place to be each Saturday night until it burned to the ground before Emma's birth. With a collection of singular characters helping her along, Emma is determined to discover the buried family secrets that lie just beyond the tree line in Cold Flat Junction, \"where all mysteries,\" says Emma, \"begin and end.\"",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Kill for Me",
        "Authors": "By Rose, Karen",
        "Description": "Five teenage girls have been viciously attacked. One survived. Only she can reveal the secrets of a disturbing ring of people who kidnap and sell teenage girls on the black market. But those responsible for the crimes will do whatever it takes to maintain her silence. Susannah Vartanian and Luke Papadopoulos have both sworn to stop the murderers for their own personal reasons. The investigation leads them to the shady realm of Internet chat rooms, where anyone can mask his or her identity. They soon discover a chain of deception so intricate they don't know whom to trust. Finding comfort in each other's arms, they begin to unravel the intricately knotted threads, but the killers are ruthless and determined, and won't hesitate to take extreme measures to insure their anonymity and keep their business intact. When Susannah proves to be inexplicably linked to the crimes, her life is soon in danger, and Luke will do everything he can to save the woman he loves.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Innocence: A Novel",
        "Authors": "By Tessaro, Kathleen",
        "Description": "From New York Times bestselling author Kathleen Tessaro comes a poignant, funny, and unforgettable story of real life, real love, and fantasy—and the changes they put you through. 1986. Starry-eyed and ready to take the world by storm, Evie Garlick leaves her small town of Eden, Ohio, to study drama in London, intent on becoming a star of the classical stage. But when she arrives in England, it quickly becomes clear she’s way out of her element—and completely unprepared for what fate has in store for her.Luckily, her new flatmate, the larger-than-life Robbie, immediately takes the bewildered Evie under her wing. Glamorous and bohemian, Robbie’s unorthodox Greenwich Village upbringing and reckless lust for life both dazzle and astonish Evie. Soon the drama offstage in their small student flat is more exciting than any Broadway play. And when Evie meets Jake, a defiantly self-assured young musician bent on two things—success and her—she finds herself suddenly in far too deep, painfully in love, out of control, and yet thrillingly alive, questioning everything about herself—and her dreams.2001. Robbie has been dead for five years, and Evie, now a single mother, is still living in London. Resigned to earning a living by teaching drama to night students, her life bears little resemblance to the one she’d imagined for herself fifteen years ago. Her carefully ordered routine and beloved son help to keep the memories and regrets at bay—most of the time. But when the past pays Evie a visit, she’s forced to confront the ambitious young woman she used to be and re-examine the choices she made…and those she couldn’t—in order to claim a new future.",
        "Category": " Fiction , Ghost",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2017"
        }
    },
    {
        "Title": "Heart of the World (Carlotta Carlyle Mysteries)",
        "Authors": "By Barnes, Linda",
        "Description": "When private investigator Carlotta Carlyle is wakened by a late-night phone call, she discovers that her “little sister,” Paolina, the child with whom she was paired years ago by a local mentoring program, is missing. Carlotta combs the Boston streets looking for Paolina, torn between anger at the thoughtless teenage runaway and anxiety that something has really happened to her. Paolina is more than a sister to Carlotta. She’s the daughter she never had, or never owned up to having. She’s the one constant in Carlotta’s life, more reliable than Sam Gianelli, her mob boss lover, a man whose always unpredictable behavior has become increasingly mysterious.  Heart of the World, Linda Barnes’s most intense, personal, and suspenseful Carlotta Carlyle novel yet, follows Carlotta’s trail from New England to Miami to Bogotá and beyond as she probes the connection between Paolina’s disappearance and the corresponding disappearance of the Colombian drug lord father Paolina has never met.  A breathless and shocking read, Heart of the World is perhaps Barnes’s best.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Food Processor Bible",
        "Authors": "By Gilletz, Norene",
        "Description": "Over 250,000 copies sold! That dusty old food processor in the back of the pantry is an extra pair of hands, the fastest sous-chef you'll ever find, and an adventure in cooking. With over 500 revised and updated recipes and hundreds of practical tips and techniques, this book will transform your food processor into your most cherished kitchen tool!",
        "Category": " Cooking , Methods , Special Appliances",
        "Publisher": "Whitecap Books",
        "Price Starting With ($)": "12.96",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Unarmed and unafraid",
        "Authors": "By Infield, Glenn B.",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Beyond Rational Management: Mastering the Paradoxes and Competing Demands of High Performance (Jossey Bass Business & Management Series)",
        "Authors": "By Quinn, Robert E.",
        "Description": "Draws together extensive research on leadership, change, and organizational performance to help leaders make sense of the complexities and contradictions of organizational life. Explains how managers can come to see new possibilities for structuring organizations, designing jobs, and solving daily problems by learning to embrace and transcend paradoxes.",
        "Category": " Business & Economics , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Get Out of My Life, but First Could You Drive Me & Cheryl to the Mall: A Parent's Guide to the New Teenager, Revised and Updated",
        "Authors": "By Wolf, Anthony E.",
        "Description": "Beleaguered parents will breath sighs of relief and gratitude over this bestselling guide to raising teenagersIn this revised edition, Dr. Anthony E.  Wolf tackles the changes in recent years with the same wit and compassion as the original edition. Dr. Wolf points out that while the basic issues of adolescence and the relationships between parents and their children remain much the same, today's teenagers navigate a faster, less clearly anchored world. Wolf's revisions include a new chapter on the Internet, a significantly modified section on drugs and drinking, and an added piece on gay teenagers. Although the rocky and ever-changing terrain of contemporary adolescence may bewilder parents, Get Out of My Life gives them a great road map.",
        "Category": " Family & Relationships , Life Stages , Teenagers",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Damaged Goods (Hannibal Jones Mystery Series)",
        "Authors": "By Camacho, Austin S.",
        "Description": "Anita Cooper was three times a victim. Her father's death crushed her dreams of college and a better life. Then her purity was drowned in powerless anxiety and her gentle fantasies displaced by unspeakable humiliation, all because of a hard man who knew the way of the world. Rod Mantooth stole both her innocence and her father's legacy, a secret that could have rebuilt her life. Anita was lost until she encountered another hard man who knew the way of the world—the urban paladin and professional troubleshooter named Hannibal Jones. Like a rolling mass of icy fury, Hannibal followed the trail of corrupted human debris that would lead to Rod Mantooth and a final showdown in the icy waters of the Atlantic.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Intrigue Publishing LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Collateral Damage (Hannibal Jones Mystery Series)",
        "Authors": "By Camacho, Austin S.",
        "Description": "Bea Collins is desperate. Her fiancé, Dean has disappeared and Bea is sure that he didn’t just walk out on her. In comes the troubleshooter, Hannibal Jones who is skeptical until he finds the missing man who is dazed, confused, and accused of a coworker’s bloody murder. Suddenly, Hannibal has a new mission: to prove Dean’s innocence. All evidence points to Dean but he can’t seem to remember what happened. To find the truth, Hannibal travels through Dean’s past where he stumbles on evidence linking him to yet another murder. These deaths have destroyed the lives connected to them, and it soon becomes clear that Hannibal will have to solve all three cases in order to save Dean from the death penalty and to prevent further bloodshed.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Intrigue Publishing LLC",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Dead for the Winter: A Mystery",
        "Authors": "By Thornton, Betsy",
        "Description": "After a lonely spell, where only her work as a victims advocate in the small desert town of Old Dudley, Arizona, keeps her busy, Chloe Newcombe meets Terry Barnett. He is the most attractive man she has known since she and her lover mutually parted, and she is enjoying his company. Terry tells her she's easy to talk to and that he needs to confide in someone. But when she finds out he is married, she writes him off and decides to forget about him. Then she goes out one night on assignment and wishes she had listened. Terry has been murdered.  Unbeknownst to her, there has been a witness to each of her encounters with the dead man, and the bulldog sheriff would very much like to hold her as a suspect. Eventually, her involvement with Terry and a problem with one of her cases affects her work, and her boss encourages (in reality, orders) her to take a vacation. With her job and reputation in danger, Chloe plunges herself into finding Terry's killer in order to prove her innocence.She seeks out the people he has left behind: his widow, who has gone into hiding; his estranged brother, who commissions Chloe's help; and an intimidating therapist with an ax to grind. But most intriguing of these is a \"phantom\" from Terry's past whom he mentioned just before his murder. Chloe's investigation leads her on a search for this woman who disappeared twenty years ago---a woman no one missed until now. As the details of Terry's life reveal his family drama and the unspoken fears leading up to his death, Chloe finds herself entangled in a story of obsession and betrayal.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Adam Runaway: A Novel",
        "Authors": "By Prince, Peter",
        "Description": "It is 1721 and young Adam Hanaway, devastated by his father's sudden death, leaves England to seek his fortune in Lisbon, where his uncle is a successful merchant. But almost nothing turns out as Adam planned. His family's welcome is cool, and Adam's rise is thwarted by his uncle's treacherous clerk and also by a certain personal trait. He's not a coward exactly, but he is inclined to boldly put himself in dangerous situations and then at the last minute run away -- hence the nickname.   Adam certainly has a lot to learn. The Inquisition grips Portugal, and those who befriend Adam may not be well intentioned. His mother and sisters wait for him to rescue them from poverty, but he is distracted by a number of local beauties. Then he commits a social faux pas so severe he forever ruins his chances for making a good match. Swept up in a struggle that will require him to come into his manhood -- the struggle between wickedness and humanity -- it seems Adam will never find his way to success, to love, or to peace with the life fate has given him.",
        "Category": " Fiction , Literary",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Fatally Flaky: A Novel (Goldy Schulz Culinary Mysteries, No. 15)",
        "Authors": "By Davidson, Diane Mott",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Lonely Planet Paris Condensed (Condensed Guides)",
        "Authors": "By Flynn, Rob",
        "Description": "",
        "Category": " Travel , Africa , General",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "I Love a Cop: What Police Families Need to Know",
        "Authors": "By Kirschman, Ellen",
        "Description": "Will police work change the person you love? Are police marriages destined to fail? What are the chances of your loved one being killed in the line of duty? Separating fact from myth, Dr. Ellen Kirschman answers these and other critical questions in the first comprehensive self-help book created specifically for today's police families. In information-filled chapters, readers will go behind the scenes with other police families as they discuss the benefits and pitfalls of police work; learn how to manage the effects of organizational stress and the pressures of unpredictable schedules, long hours and loneliness; gain awareness of the emotional, physical, and behavioral warning signs which can lead to such extreme situations as posttraumatic stress, alcoholism, suicide and domestic violence; find out where families can go for help and counseling; and get an inside look at cop couples and the special challenges facing women, minorities, and gays and lesbians on the force.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "On the Crest of the Wave: Becoming a World Christian",
        "Authors": "By Wagner, C. Peter",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Ultimate Sexual Touch",
        "Authors": "By Hooper, Anne",
        "Description": "Reveals how sensual touch can be applied for a variety of benefits including enhanced sexuality, pregnancy relief, and reduced stress, and explains how the sensual massage can contribute to more satisfatory relationships.",
        "Category": " Self-help , Sexual Instruction",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "6.28",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "How to Restore Your Collector Car",
        "Authors": "By Brownell, Tom",
        "Description": "Tells how to find collector cars, offers advice on research, shop setup, and repair and restoration techniques, and explains how to prepare a car for a show",
        "Category": " Transportation , Automotive , Repair & Maintenance",
        "Publisher": "Motorbooks Intl",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "LIES OF SILENCE",
        "Authors": "By Moore, Brian",
        "Description": "IRA terrorists force Michael Dillon, who has just decided to leave his wife for another woman, to participate in a plot that will kill hundreds, threatening that if he alerts the police his wife will be killed",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Avenged",
        "Authors": "By Chandler, A. R.",
        "Description": "",
        "Category": " Fiction , Religious",
        "Publisher": "Riveroak Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Facts of Life: And Other Lessons My Father Taught Me",
        "Authors": "By Whelchel, Lisa",
        "Description": "America grew up learning The Facts of Life on this popular television sit-com of the 1980s. As Blair Warner -- rich, pampered boarding school student, Lisa Whelchel matured from a snobby prep schooler to a responsible adult. Now the actress recounts the real facts of life she's learned as a child of God making the journey -- from a shy girl out of a small town in Texas, to the glamorous life of fame and fortune in Hollywood, to suburban life as a pastor's wife and homeschooling mother of three. Readers will relish this inside glimpse into the life of a child star who looks to her Heavenly Father. Touching autobiographical stories reveal the developing trust in God that has enabled Lisa to grow in grace through seasons of pressure, pain, and prosperity.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Classic Jewish Humor in America",
        "Authors": "By Spalding, Henry D. (EDT)",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Jonathan David Pub",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Alexander Cipher",
        "Authors": "By Adams, Will",
        "Description": "Workers in Alexandria are excavating for a new building when they discover the ruins of an old tomb, and all work crashes to a halt. According to federal law in Egypt, all discoveries must be properly catalogued by archeologists and this tomb has unusual relics and representations, apparently contemporary with Alexander the Great.  Daniel Knox's first love is history and archeology, specifically on Alexander the Great. When he pisses off a local mobster on the coast of Egypt, he heads to Alexandria to an archaeology colleague's apartment to hide out for a while. He learns his friend is getting to participate on the dig for this newly discovered tomb. Sneaking in with his friend, Daniel sees signs that the find is far bigger than anyone realizes and might hold clues to finally unravelling one of the world's greatest mysteries: Where is Alexander the Great buried?  In his lifetime, Alexander was beloved as a god, and across the Mediterranean, everyone wanted to be close to him. Upon his death, there was a mad scrabbling among his former allies to secure his empire for themselves. Even now, nearly 2500 years later, Alexander is still being fought over. With the discovery of this tomb and the revelation of its relics, the race is on to find Alexander. Rival archeologists, Egyptian officials, and Macedonian nationalists all scurry and scramble, attacking each other along the way as they hunt for a glorious prize--the body of Alexander the Great.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "The Complete Guide to Country Cooking: A Year Full of Recipes for Every Occasion-from Holiday Feasts to Family Reunions",
        "Authors": "By Reiman Publications (COR), Jung, Mary Beth (EDT), and Taste of Home Magazine (COR)",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "6.9",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Uncertain passage: China's transition to the post-Mao era",
        "Authors": "By Barnett, Arthur Doak",
        "Description": "",
        "Category": "",
        "Publisher": "Brookings Institution",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Gates to Asia: A diary from a long journey",
        "Authors": "By Myrdal, Jan",
        "Description": "",
        "Category": "",
        "Publisher": "Pantheon Books",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Satisfaction: The Art of the Female Orgasm",
        "Authors": "By Cattrall, Kim, Levinson, Mark, and Drury, Fritz",
        "Description": "Kim Cattrall, \"Sex and the City\"'s Samantha, slides between the sheets and shares her secrets on reaching the heights of pleasure. She teams up with her husband in this how-to-sex book, based on viewer feedback from the show and designed to help couples focus on achieving the female orgasm. 75 illustrations.",
        "Category": " Self-help , Sexual Instruction",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Tiling 1-2-3",
        "Authors": "By The Home Depot",
        "Description": "Filled with projects, advice, illustrations, and photographs, a handy do-it-yourself guide encompasses every aspect of tiling, from planning and designing to installing and repairing, and covers standard tiling projects including floors, walls, counters, showers, patios, and more. 150,000 first printing.",
        "Category": " House & Home , Do-It-Yourself , Masonry",
        "Publisher": "Home Depot",
        "Price Starting With ($)": "5.97",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    }
]