[
    {
        "Title": "How to Care for Your Car",
        "Authors": "By Gawain, Shakti",
        "Description": "A new edition of the best-selling guide explains how to use the power of imagination to obtain desired goals from breaking negative habits, improving self-esteem, and developing creativity to obtaining successful careers and establishing inner peace. Original. 60,000 first printing. IP.",
        "Category": "",
        "Publisher": "Longmeadow/see Publisher Resou",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Desperate Duchesses",
        "Authors": "By James, Eloisa",
        "Description": "Welcome to a world of reckless sensuality and glittering sophistication . . . of dangerously handsome gentlemen and young ladies longing to gain a title . . . of games played for high stakes, including—on occasion—a lady's virtue.A marquess's sheltered only daughter, Lady Roberta St. Giles falls in love with a man she glimpses across a crowded ballroom: a duke, a game player of consummate skill, a notorious rakehell who shows no interest in marriage—until he lays eyes on Roberta.Yet the Earl of Gryffyn knows too well that the price required to gain a coronet is often too high. Damon Reeve, the earl, is determined to protect the exquisite Roberta from chasing after the wrong destiny.Can Damon entice her into a high-stakes game of his own, even if his heart is likely to be lost in the venture?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Susannah's Garden (A Blossom Street Novel, 3)",
        "Authors": "By Macomber, Debbie",
        "Description": "When Susannah Nelson turned eighteen, she said goodbyeto her boyfriend, Jake&#151;and never saw him again. She neversaw her brother, Doug, again, either. He died unexpectedlythat same year.Now, at fifty, Susannah finds herself regretting the paths nottaken. Long married, a mother and a teacher, she should behappy. But she feels there's something missing in her life.Not only that, she's balancing the demands of an agingmother and a temperamental twenty-year-old daughter.Her mother, Vivian, a recent widow, is having difficultycoping and living alone, so Susannah goes home toColville, Washington. In returning to her parents' house, hergirlhood friends and the garden she's always loved, she alsoreturns to the past&#151;and the choices she made back then.What she discovers is that things are not always as theyonce seemed. Some paths are dead ends. But some gardensremain beautiful&#133;.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Mira",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Captive of My Desires: A Malory Novel (8) (Malory-Anderson Family)",
        "Authors": "By Lindsey, Johanna",
        "Description": "THE MALORYS RETURN!   Johanna Lindsey sweeps readers into the dazzlingly passionate world of the incomparable Malorys, an aristocratic family of rakehell adventurers and spirited ladies -- which turns ever more tempestuous when James Malory introduces the daughter of a pirate to London society.   Gabrielle Brooks sets sail from England to a Caribbean island in search of her estranged father and encounters a life-altering surprise -- her father is a pirate! After spending three wonderful years hunting treasure with him, Gabrielle is dismayed when he decides she must return to London to find a proper husband. His old friend James Malory will sponsor her in polite society. Gabrielle is escorted to balls and parties by James's wife, Georgina, and her brother, Drew Anderson, a dashing American sea captain and fun-loving rogue. When Drew embroils Gabrielle in a scandal the night before he's to sail home, the pirate's daughter vows revenge by commandeering Drew's ship and taking him prisoner. But as passion runs high on their sea voyage, it becomes difficult to tell who is truly the captor and who is the captive.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Because You're Mine",
        "Authors": "By Kleypas, Lisa",
        "Description": "A classic historical romance novel from New York Times bestseller Lisa Kleypas (“One of today’s leading lights in romantic fiction” —Seattle Times), Because You’re Mine is a breathtaking tale of romantic intrigues and uncontained passions that showcases this acclaimed author at her very best. “I don’t care about your conscience. All I want is for you to kiss me again.”Lady Madeline Matthews would rather shame herself than sacrifice her freedom. To avoid marrying an aging, lecherous lord, she seeks out the company of Logan Scott, for a torrid affair with the notorious womanizer would surely condemn her in the eyes of good society.In truth, Logan is an intensely private man tormentedby past betrayals. Now a forward little minx, completely at sea in London’s sophisticated whirl, is disruptinghis life with her vibrant charm and unspoiled beauty. But when what begins with a kiss threatens to blossom into something more rapturous and real, will Logan and Madeline have the courage to drop the masks they hide behind in the name of love?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2011"
        }
    },
    {
        "Title": "Bitsy's Bait & BBQ",
        "Authors": "By Morsi, Pamela",
        "Description": "While Emma Collins wonders who in their right mind would use herhard-won divorce settlement to purchase a bed-and-breakfast down inthe Ozarks, her free-spirited sister Katy fantasizes dreamily about how thismove to a small town will be just the thing for her six-year-old son, Josh. And, as usual, Emma is right. But it is not until they drive to Warbler Lake,Missouri, to take over Bitsy's B & B that they realize just how right she'sbeen. In this part of the country, B & B stands for Bait and BBQ! The girlsknow little enough about running a bed-and-breakfast, but a bait-and-BBQ? With their money and futures sunk into a run-down, roadside rattletrap,the girls have no choice but to roll up their sleeves and get to work.But as they settle in and get to know the difference between fatheads,night crawlers, mealworms and shiners, no one is more surprised thanthey are when they actually get the place up and running. But trouble is brewing. Katy's ex-husband is having second thoughts aboutthe custody arrangements for Josh, and he fully intends to get him back.With the prospect of losing the little boy, the sisters face another challenge,only this time it's Katy who proves that she, too, can solve a problem.",
        "Category": " Fiction , General",
        "Publisher": "Mira",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Demon Rumm: A Novel",
        "Authors": "By Brown, Sandra",
        "Description": "It was the publicity stunt from hell as far as Kirsten Rumm was concerned. She may have been writing the book about her late husband, aeronautical daredevil Demon Rumm, but she didn’t see the need to play host to the arrogant bad-boy actor starring in the film version’s title role. Still, for the good of the project, Kirsten agreed to share her beachfront home with the impossibly sexy screen idol. Any other woman would do anything to be in her sandals, but Kirsten wasn’t falling for Rylan North, even if he did play his role of male lead to perfection. His down-home charm, his gentleness and virile charisma, might be seducing her in every sense of the word, but he was an actor, after all. Seducing an audience was his job. Rylan could have any woman he wanted. So why was he so desperately pretending to want her?From the moment he saw her, Rylan North knew that Kirsten Rumm was the woman he’d been waiting all his life to cast as the star in his real-life love story. What did it matter if he was every woman’s fantasy if he couldn’t get Kirsten to so much as glance his way? He’d caught the look of past hurt behind her sky-blue eyes–a dark secret that shadowed the sparkle. Rylan was determined to find out what tragedy held this passionate woman back from a second chance at love even if it cost him his reputation, his career, and his life. But first he’d have to get Kirsten to act on her instincts . . . and to trust the flesh-and-blood man behind the fantasy.From the Hardcover edition.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Sword of Darkness (Lords of Avalon, Book 1)",
        "Authors": "By MacGregor, Kinley",
        "Description": "The new king of Camelot wears no shining armor: Arthur and his knights have fallen and a new king rules.In the darkest forest...A scared, forsaken youth has become the most powerful—and feared—man in the world. Ruthless and unrestrained, Kerrigan has long ceased to be human.In the heart of London...A spirited peasant mired in drudgery, Seren dreams of becoming her own woman, but never expects that by fleeing her fate, she will meet her destiny.Their worlds are forever changed...Kerrigan's goal is simple: barter or kill Seren to claim Arthur's Round Table. Yet she is the one person who holds no fear of him. More than that, her nobility sparks something foreign inside him. In his nether realm, kindness is weakness and a king who harbors any sort of compassion loses his throne.For countless centuries, Kerrigan has lived alone in the shadows. Now Seren's courage has forced him into the light  that will bring either salvation to both of them...or death.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Knight of Darkness (Lords of Avalon, Book 2)",
        "Authors": "By MacGregor, Kinley",
        "Description": "For countless centuries, I've been the assassin for the infamous Merlin, even though the woman who birthed me sits at the right hand of our enemy, Morgen le Fey. Now both my mother and Morgen have decided that it's time I take my place on their side of this conflict.Normally, telling them no wouldn't be a problem, except for the fact that the good guys I protect think that I'm an even worse demon than the ones we fight. Hmm, maybe they're right. I have to say that I do enjoy maiming anyone who gets in my way.At least until my mother gives me a simple choice: join Morgen's Circle of the Damned or see an innocent woman die. I'm all for saving the innocent, but Merewyn isn't as innocent as she seems. And she's none too fond of the fact that her fate is in my dubious hands. Personally I'm all for taking the easy way out, but leaving her to Morgen is rough, even for me. Now the only way to save both our lives is to face the evilest forces ever known—my mother and Morgen. And two people who know nothing of trust must learn to rely on each other or die: provided we don't kill each other first.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Nightmare in 3-D (Ghosts of Fear Street #4)",
        "Authors": "By Stine, R. L.",
        "Description": "The ghosts of Fear Street -- they'll haunt you forever!  Do you believe in ghosts?  Don't say no until you take a walk down Fear Street.  Past the woods -- where no birds sing.  Past the lake -- where something lurks beneath the water.  Past the cemetery -- where everyone is dying to meet you.  And take a peek in Sal's Five and Ten.  He sells great stuff.  Wes Parker bought a 3-D poster there.  He spent hours trying to see the hidden picture.  Then he wished he hadn't.  Because the thing inside the poster saw Wes too.  Now it wants out and it wants Wes.",
        "Category": " Juvenile Fiction , Horror",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Ethan Frome (Twentieth-Century Classics)",
        "Authors": "By Wharton, Edith",
        "Description": "A New England farmer must choose between his duty to care for his invalid wife and his love for her cousin",
        "Category": " Fiction , Classics",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "On Mystic Lake: A Novel (Ballantine Reader's Circle)",
        "Authors": "By Hannah, Kristin",
        "Description": "A poignant and tender story of love, loss, passion, and the fragile threads that bind families together.Annie Colwater's only child has just left home for school abroad. On that same day, her husband of twenty years confesses that he's in love with a younger woman. Alone in the house that is no longer a home, Annie comes to the painful realization that for years she has been slowly disappearing. Lonely and afraid, she retreats to Mystic, the small Washington town where she grew up, hoping that there she can reclaim the woman she once was—the woman she is now desperate to become again.In Mystic, she is reunited with her first love, Nick Delacroix, a recent widower unable to cope with his grieving, too-silent six-year-old daughter, Izzie. Together, the three of them begin to heal, and, at last, Annie learns that she can love without losing herself. But just when she has found a second chance at happiness, her life is turned upside down again, and Annie must make a choice no woman should have to make. . . .Praise for On Mystic Lake“A beautifully simple, deeply compassionate story.”—Diana Gabaldon“Superb . . . I’ll heartily recommend On Mystic Lake to any woman . . . who demands that a story leave her in a satisfied glow.”—The Washington Post Book World“A luminescent story . . . Kristin Hannah touches the deepest, most tender corners of our hearts.”—Tami Hoag“Marvelous . . . a touching love story . . . You know a book is a winner when you devour it in one evening and hope there’s a sequel.”—USA Today “Excellent . . . On Mystic Lake is an emotional experience you won’t soon forget.”—Rocky Mountain News “Propels readers forward to the final chapter.”—The Seattle Times",
        "Category": " Fiction , Romance , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Poems & Sketches of E. B. White",
        "Authors": "By White, E. B.",
        "Description": "Offers a collection of approximately fifty poems and thirty-five sketches, stories, parodies, and commentary, selected by the author from a lifetime of writing",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "April Fools' Rules (Two of a Kind, No. 22)",
        "Authors": "By Katschke, Judy and Stine, Megan",
        "Description": "It's April Fools' Day, and Mary-Kate and Ashley plan to go down in White Oak history as the best pranksters ever. But when they take a joke too far, they put the headmistress's job on the line. And this time, it's no laughing matter!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "HarperEntertainment",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Creative Cakes",
        "Authors": "By Crookston, Stephanie",
        "Description": "This personalized approach to cake art demonstrates how to sculpt regular sheet or round cakes into wonderfully imaginative forms to fit any personality or occasion, including tips on icing, lettering, and pattern-making",
        "Category": "",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "Family Baggage: A Novel",
        "Authors": "By McInerney, Monica",
        "Description": "“An endearing and humane story about a family and its sticky web of secrets and misunderstandings . . . one of those rare books you could recommend to anyone and know that they’ll love it.”–The Australian Women’s WeeklyHarriet Turner knows all about journeys. She’s arranged hundreds of them for her family’s travel agency. Now Harriet is joining her adopted sister, Lara, to lead a group through the Cornish countryside. But when Lara fails to appear at the airport as planned, Harriet finds herself in uncharted territory and suddenly alone with a busload of eccentric seniors. As the tour wends its way through the picturesque landscape, Harriet must uncover her sister’s whereabouts and confront long-held family secrets involving Lara’s arrival twenty-five years ago . . . not to mention keeping track of more baggage–real and emotional–than she ever expected.“With every book, Monica McInerney becomes more skilled at juggling plot complexities and giving depth to her characters. . . . Perfect [for] weekend reading.”–Marie Claire (Australia)“A book to treasure that is clever, amusing and heart-warmingly touching.”–Woman’s Day (Australia)",
        "Category": " Fiction , Women",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Beginning Your New Life in Christ",
        "Authors": "By Green, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Perl 5 Pocket Reference, 3rd Edition: Programming Tools (O'Reilly Perl)",
        "Authors": "By Vromans, Johan",
        "Description": "Revised to cover Perl Version 5.6, this quick reference provides a complete overview of the Perl programming language, all packed into  a convenient, carry-around booklet.This third edition covers:A summary of Perl syntax rulesA complete list of operators, built-in functions, and standard library  modules, all with brief descriptionsThe newest Perl features, such as enhanced regular expressions,  multithreading, the Perl compiler, and unicode supportThe Perl 5 Pocket Reference, 3rd Edition, is the perfect companion  to the authoritative books on Perl published by O'Reilly & Associates:Programming Perl, Learning Perl, and the Perl Cookbook.",
        "Category": " Computers , Programming Languages , JavaScript",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "My Little Pony: Pinkie Pie's Secret Place",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Bendom Publishing International, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Silver's Bane (Through the Shadowlands)",
        "Authors": "By Kelleher, Anne",
        "Description": "In the sequel to Silver's Edge, with the first battles over, both the Sidhe Otherworld and the human Shadowlands struggle to recover from the devastation, as Nessa, the daughter of a blacksmith, crosses between worlds to promote understanding between peoples, while widowed queen Cecily fights for her throne, and Delphinea, becomes caught between her Sidhe duty and her destiny. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Luna",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Thoughts to Share With a Wonderful Daughter: A Blue Mountain Arts Collection (\"Language of ... \" Series)",
        "Authors": "By Blue Mountain Arts Collection (EDT) and Wayant, Patricia (EDT)",
        "Description": "",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Hoax",
        "Authors": "By Robert Tannebaum",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Who Calls Me Beautiful?: Finding One True Image in the Mirror of God",
        "Authors": "By Franklin, Regina",
        "Description": "This book skillfully chips away at the facade of femininity—the belief that a woman’s body is more important than her character. Patiently pointing to Scripture, author Regina Franklin convincingly argues true beauty starts inside and radiates outward.",
        "Category": " Religion , Christian Life , Women's Issues",
        "Publisher": "Discovery House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Beach Road",
        "Authors": "By Patterson, James and De Jonge, Peter",
        "Description": "Dark mysteries come to East Hampton while a struggling lawyer fights to save his friend from being framed for a triple murder.Montauk lawyer Tom Dunleavy's client list is woefully small-occasional real estate closings barely keep him in paper clips. So when he is hired to defend a local man accused in a triple murder in East Hampton, he knows that he has found the case of his lifetime. The crime turns the glittering playground for the super-rich into a blazing inferno. Dunleavy's client is a local hero, but he knows the case rests on money, deception, and forbidden desires. His client will be framed-unless he can find the key to the case.When Dunleavy is joined by his former flame, the savvy and well-connected attorney, Kate Costello, he believes he has a chance. But payback is a bitch, especially from the rich. The violent retaliations of billionaires threatened by his investigation exceed anything Dunleavy has ever seen. With the entire nation's eyes on him in a new Trial of the Century, Dunleavy orchestrates a series of revelations that lead to a stunning outcome-and the truth is wilder than anything he ever imagined.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Mary, Mary (Alex Cross Novels)",
        "Authors": "By Patterson, James",
        "Description": "Someone is murdering Hollywood's A-list, and Alex Cross's family vacation is cut short as he navigates a mysterious world of luxury, gossip, and hidden secrets.FBI Agent Alex Cross is on vacation with his family in Disneyland when he gets a call: a well-known actress was shot outside her home in Beverly Hills. Shortly afterward, an editor for the Los Angeles Times receives an email describing the murder in vivid details. Alex quickly learns that this is not an isolated incident. The killer, known as Mary Smith, has done this before and plans to kill again.Right from the beginning, this case is like nothing Alex has ever been confronted with before. Is this the plan of an obsessed fan or a spurned actor, or is it part of something much more frightening? Now members of Hollywood's A-list fear they're next on Mary's list, and the case grows by blockbuster proportions as the LAPD and FBI scramble to find a pattern before Mary can send one more chilling update.",
        "Category": " Fiction , Thrillers",
        "Publisher": "Vision",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The 5th Horseman (Women's Murder Club, 5)",
        "Authors": "By Patterson, James and Paetro, Maxine",
        "Description": "Dare to face the most terrifying heights of suspense. From hospital murders to explosive court battles, the Women's Murder Club takes on their most harrowing challenge yet. It is a wild race against time as Lieutenant Lindsay Boxer and the newest member of the Women's Murder Club, attorney Yuki Castellano, lead an investigation into a string of mysterious patient deaths-and reveal a hospital administration determined to shield its reputation at all costs. And while the hospital wages an explosive court battle that grips the entire nation, the Women's Murder Club hunts for a merciless killer among its esteemed medical staff. With high-speed thrills and page-turning twists, The 5th Horseman proves once again that James Patterson \"has mastered the art of writing\" (Chicago Sun-Times).",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Vision",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Fire Sale (A V.I. Warshawski Novel)",
        "Authors": "By Paretsky, Sara",
        "Description": "THE NEW YORK TIMES BESTSELLER“Takes off with a bang—literally...V. I. remains a paragon among PIs, and Fire Sale is one of Paretsky’s best books yet.”—St. Louis Post-Dispatch A conscience can weigh a PI down more than the heaviest firearm—and get her into more trouble too. It’s that nagging conscience that makes V. I. Warshawski agree to fill in as coach for the girls’ basketball team at her South Chicago alma mater—which in turn leads her to the headquarters of By-Smart, the global retail empire where V. I. hopes to get some desperately needed funds for the struggling squad. But conscience seems to be in short supply at By-Smart...with the exception of Billy Bysen, the earnest teenage grandson of the chain’s gruff, tightfisted founder. And when Billy disappears—along with a mysterious document much desired by By-Smart’s management team—V. I. is hurled onto a twisted, body-strewn path that runs through Chicago’s dirtiest places and reveals some of its dirtiest secrets...",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "The Skating Gander",
        "Authors": "By Bailey Alice Cooper",
        "Description": "",
        "Category": "",
        "Publisher": "The Wise-Parslow Company",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1927"
        }
    },
    {
        "Title": "Closed Chambers: The Rise, Fall, and Future of the Modern Supreme Court",
        "Authors": "By Lazarus, Edward",
        "Description": "Operating within a Network of Byzantine Secrecy, The United States Supreme Court is the most powerful judicial institution in the world. Nine unelected justices are charged with protecting our most cherished rights and shaping our fundamental laws.In this account, Edward Lazarus, who served as a clerk to Justice Harry Blackmun, provides an insider's guided tour of a court at war with itself and often in neglect of its constitutional duties. Combining memoir, history, and legal analysis, Lazarus weaves together past and present to reveal how law, politics, and personality collide in the Court's inner sanctum.",
        "Category": " Law , Legal History",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "How to Close Every Sale",
        "Authors": "By Shook, Robert L. and Girard, Joe",
        "Description": "The best-selling author of How to Sell Anything to Anybody offers practical, timeless advice on overcoming sales resistance, projecting a positive image, understanding the customer, handling objections, and overcoming procrastination, in a new edition of the acclaimed handbook. Reissue.",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "Business Plus",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Chocolate Lover's Collection",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "My Name Is Red",
        "Authors": "By Pamuk, Orhan and Goknar, Erdag M. (TRN)",
        "Description": "At once a fiendishly devious mystery, a beguiling love story, and a brilliant symposium on the power of art, My Name Is Red is a transporting tale set amid the splendor and religious intrigue of sixteenth-century Istanbul, from one of the most prominent contemporary Turkish writers.  The Sultan has commissioned a cadre of the most acclaimed artists in the land to create a great book celebrating the glories of his realm. Their task: to illuminate the work in the European style. But because figurative art can be deemed an affront to Islam, this commission is a dangerous proposition indeed. The ruling elite therefore mustn’t know the full scope or nature of the project, and panic erupts when one of the chosen miniaturists disappears. The only clue to the mystery–or crime? –lies in the half-finished illuminations themselves. Part fantasy and part philosophical puzzle, My Name is Red is a kaleidoscopic journey to the intersection of art, religion, love, sex and power. Translated from the Turkish by Erda M Göknar",
        "Category": " Fiction , Classics",
        "Publisher": "Vintage",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "JACK AND JILL",
        "Authors": "By SIN AUTOR",
        "Description": "",
        "Category": "",
        "Publisher": "Playmore Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Quozl",
        "Authors": "By Foster, Alan Dean",
        "Description": "Arriving in sleek, wood-panelled space ships, the amazingly dapper and terrifyingly cute Quozl have invaded, and the planet Earth will never be the same",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Dances with Wolves: A Novel",
        "Authors": "By Blake, Michael",
        "Description": "Ordered to hold an abandoned army post, John Dunbar found himself alone, beyond the edge of civilization. Thievery and survival soon forced him into the Indian camp, where he began a dangerous adventure that changed his life forever. Relive the adventure and beauty of the incredible movie, DANCES WITH WOLVES.",
        "Category": " Fiction , Media Tie-In",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "A Is for Alibi (A Kinsey Millhone Mystery)",
        "Authors": "By Grafton, Sue",
        "Description": "Laurence Fife was a slick divorce lawyer and  slippery ladies' man. Until someone killed him. The  jury believed that it was his pretty young wife  Nikki, so they sent her to prison for eight years.  Now, Nikki's out on parole and Kinsey Miihone's in  for trouble. Nikki hires Kinsey to discover who  really killed her husband. But the trail is eight  years cold, and at the end is a chilling twist even  Kinsey doesn't suspect -- a second eight-year-old  murder and a brand new corpse.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Crimeline",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "Noah's Ark (Little Golden Book)",
        "Authors": "By Packard, Mary and Hine, Eileen (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Great Jobs Ahead: Your Comprehensive Guide to Personal Business Profit in the New Era of Prosperity",
        "Authors": "By Dent, Harry S. and Abkemeier, Laurie (EDT)",
        "Description": "A successful consultant shares how to claim a place in his vision of the corporate future, which due to advanced technology will no longer require repetitive tasks, freeing workers to think creatively. Reprint. Tour.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Toes Are to Tickle",
        "Authors": "By Roddie, Shen and Denton, Kady MacDonald (ILT)",
        "Description": "A preschooler and her baby brother happily demonstrate what they do with the things they encounter every day",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Tricycle Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Dog Intelligence Test",
        "Authors": "By Coon, Kathy",
        "Description": "",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Apple Garnishing",
        "Authors": "By Rosen, Harvey",
        "Description": "",
        "Category": " Cooking , Methods , Garnishing & Food Presentation",
        "Publisher": "International Culinary Consultants",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "A Cross-Stitch Christmas: Gifts to Cherish (Better Homes and Gardens)",
        "Authors": "By Better Homes and Gardens Books (EDT) and Dahlstrom, Carol Field (EDT)",
        "Description": "Provides cross-stitch patterns for Christmas samplers, decorations, stockings, and gifts",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Christmas Candy",
        "Authors": "By Hale, Gloria (EDT)",
        "Description": "Presents recipes for a variety of candies including rocky road, divinity kisses, and sugar and spice nuts",
        "Category": " Cooking , Courses & Dishes , Confectionery",
        "Publisher": "Avenel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "J.K. Lasser's Guide to Buying Your First Home",
        "Authors": "By Catalano, Joe",
        "Description": "Advises would-be home-buyers on realistically selecting and financing a house, and on the process of making the purchase",
        "Category": "",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Scottish Highlanders",
        "Authors": "By MacKinnon, Charles",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Life's a Bitch and Then You Change Careers: 9 Steps to Get You Out of Your Funk & on to Your Future",
        "Authors": "By Kay, Andrea",
        "Description": "Most people agree there are few things worse than being stuck in a career you hate. It's not just the daily drudgery of work that has become tedious; it's also the hopeless feeling of life moving in the wrong direction and not knowing how to turn it around. Renowned career consultant Andrea Kay knows it's possible for people in such predicaments to make a change, and in this book she offers her time-tested, nine-step program to show you how.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Perfect Husband: An FBI Profiler Novel",
        "Authors": "By Gardner, Lisa",
        "Description": "What would you do if the man of your dreams hides the soul of a killer? Jim Beckett  was everything she'd ever dreamed of...But two years after Tess married the decorated  cop and bore his child, she helped put him behind bars for savagely murdering ten  women. Even locked up in a maximum security prison, he vowed he would come after  her and make her pay. Now the cunning killer has escaped—and the most dangerous game  of all begins.... After a lifetime of fear, Tess will do something she's never done  before. She's going to learn to protect her daughter and fight back, with the help  of a burned-out ex-marine. As the largest manhunt four states have ever seen mobilizes  to catch Beckett, the clock winds down to the terrifying reunion between husband  and wife. And Tess knows that this time, her only choices are to kill—or be killed.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Natural Capitalism: Creating the Next Industrial Revolution",
        "Authors": "By Time-Life Books",
        "Description": "Three leading innovators explain how companies can increase profits, production, and employment while restoring the earth, offering ideas ranging from self-heating and self-cooling buildings to 200-miles-per-gallon cars, and much more. Reprint. 20,000 first printing.",
        "Category": "",
        "Publisher": "US Green Building Council",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "How to Complete and Survive a Doctoral Dissertation",
        "Authors": "By Sternberg, David",
        "Description": "Mastering these skills spells the difference between \"A.B.D.\" and \"Ph.D.\"-refuting the magnum opus myth-coping with the dissertation as obsession (magnificent or otherwise)-the fine art of selecting a topic-writing the dissertation with publication in mind-when to stand your ground and when to prudently retreat if the committee's conception of your thesis differs substantially from your own-dealing with obstructive committee members, and keeping the fences mended-how to reconsider \"negative\" findings as useful data-reviewing your progress, and getting out of the \"dissertation dumps\"-defending your paper successfully-distinguishing between mere formalities and a serious substantive challenge-exploiting the career potential of your dissertation-and much, much more",
        "Category": " Education , Testing & Measurement",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "Wuthering Heights (The World's Classics)",
        "Authors": "By Bronte, Emily and Jack, Ian Robert James",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "How to Become a Marketing Superstar: Unexpected Rules That Ring the Cash Register",
        "Authors": "By Fox, Jeffrey J.",
        "Description": "With more than 600,000 books in print, nationally bestselling author Jeffrey Fox is back to 'outfox the competition'--this time with counterintuitive advice on how to become a marketing genius n his four previous bestselling business books, Jeffrey Fox has helped readers land great jobs and rise to the top of their professions. Now he turns his contrarian eye to marketing through brand building and innovation. Fox's advice is delivered in snappy, to-the-point chapters that zero in on his creative--and often counterintuitive--advice and features such unforgettable fundamentals as:  Make a big splash, instead of a lot of little ripples  Always have a pipeline to the president  Own a market, not a mill  The long and short definitions of marketingThere are also provocative 'Instant Marketing Superstar' challenges throughout the book, offering the reader a chance to solve real business problems. In a time of corporate budget cuts, it's more important than ever for all employees to be creative marketers. How to Become a Marketing Superstar is certain to find a place on the shelves of anyone who wants to increase sales in a competitive marketplace.",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Crucified Love",
        "Authors": "By Maas, Robin",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Clutter Control: Useful Tips for Getting Rid of the Mess",
        "Authors": "By Wright, Susan",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Nobles, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The People's Act of Love: A Novel",
        "Authors": "By Meek, James",
        "Description": "In a remote Siberian village, amid a lawless, unforgiving landscape, lives Anna Petrovna, a beautiful, willfully self-reliant widowed mother. A mystical, separatist Christian sect, a stranded regiment of restless Czech soldiers, and an eerie local shaman live nearby, all struggling against the elements and great social upheaval to maintain a fragile coexistence.Out of the woods trudges Samarin, an escapee from Russia’s northernmost prison camp, with a terrifyingly outlandish story to tell about his journey. Immediately apprehended, he is brought before the Czech regiment’s megalomaniac, Captain Matula. But the stranger’s appearance has caught the attention of others, including Anna Petrovna’s.This stranger, his bizarre story—if it is to be believed—and the apparent murder of the local shaman quickly become a flashpoint for this village: temperatures rise, alliances shift, and betrayals emerge. Written with a commanding historical authority and remarkable grace, The People’s Act of Love is an epic of desire and sacrifice that leaves the reader utterly mesmerized through to the final heart-pounding pages.",
        "Category": " Fiction , Literary",
        "Publisher": "Canongate U.S.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "So Long and Thanks for all the Fish",
        "Authors": "By Douglas Adams",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "How to Talk So Kids Will Listen & Listen So Kids Will Talk",
        "Authors": "By Faber, Adele, Mazlish, Elaine, and Coe, Kimberly A. (ILT)",
        "Description": "You Can Stop Fighting With Your Chidren! Here is the bestselling book that will give you the know–how you need to be more effective with your children and more supportive of yourself. Enthusiastically praised by parents and professionals around the world, the down–to–earth, respectful approach of Faber and Mazlish makes relationships with children of all ages less stressful and more rewarding.  Their methods of communication, illustrated with delightful cartoons showing the skills in action, offer innovative ways to solve common problems.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Honeymoon (Honeymoon, 1)",
        "Authors": "By Patterson, James and Roughan, Howard",
        "Description": "How does it feel to be desired by every man and envied by every woman? Wonderful. This is the life Nora Sinclair has dreamed about, the life she's worked hard for, the life she will never give up. Meet Nora Sinclair.When FBI agent John O'Hara first sees her, she seems perfect. She has the looks. The career. The clothes. The wit. The sophistication. The tantalizing sex appeal. The whole extraordinary package - and men fall in line to court her. She doesn't just attract men, she enthralls them. If you dare.So why is the FBI so interested in Nora Sinclair? Mysterious things keep happening to people around her, especially the men. And there is something dangerous about Nora when Agent O'Hara looks closer - something that lures him at the same time that it fills him with fear. Is there something dark hidden among the unexplained gaps in her past? And as he spends more and more time getting to know her, is he pursuing justice? Or his own fatal obsession?With the irresistible attraction of the greatest Hitchcock thrillers, Honeymoon is a sizzling, twisting tale of a woman with a deadly appetite and the men who dare to fall for her. In his sexiest, scariest novel yet, James Patterson deftly confirms that he always \"takes thrills to the next level\" (Pittsburgh Tribune-Review).",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Buying and Selling a Home, 4th Ed",
        "Authors": "By O'Hara, Shelley and Lewis, Nancy D.",
        "Description": "Goodbye, old house-hello, good buy!  From looking to sell to finding a dream home, this all-in-one guide features new, updated, and vital information and tips on getting the best deal...no matter which side of the deal you're on.  ? Unlike other books, this covers both buying and selling-which usually go hand-in-hand ? Revised edition includes more information on buying a second home, researching locations, saving on costs, and more ? Existing-home sales are setting new records every year ? Very low mortgage rates are making this a great time to buy",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Alpha Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Wilderness journey: A true love story (Vienna Brooks saga)",
        "Authors": "By Holyer, Erna M",
        "Description": "",
        "Category": "",
        "Publisher": "Review and Herald Pub. Association",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Grandmothers Are Like Snowflakes...No Two Are Alike: Words of Wisdom, Gentle Advice, & Hilarious Observations",
        "Authors": "By Lanese, Janet (EDT)",
        "Description": "When a child is born, a miracle happens—someone becomes a grandmother!For first-time grandmas, beloved veterans, or grandmas-in-waiting, this warm, wonderful book captures all the joy and humor of one of a woman's most  life-altering experiences. Heartwarming observations from such famous names as Margaret Mead, Jane Russell, and Margaret Thatcher; poems to copy and stick on the refrigerator; words of advice to \"accidentally\" leave on a daughter-in-law's kitchen table, suggestions to smooth the rough times or increase the joy, it's all here to read and treasure.Don't miss . . . • Special things only a grandmother can do• Family history a grandmother can pass on• A precious gift every child needs from a grandmother• Secret satisfactions a grandmother feels• How a grandmother can act even wiser than she isAnd more!",
        "Category": " Humor , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Rick Steves' French Phrase Book and Dictionary",
        "Authors": "By Steves, Rick",
        "Description": "Bonjour! From ordering a cafe au lait in Paris to making new friends in the Loire Valley, it helps to speak some of the native tongue. Rick Steves, bestselling author of travel guides to Europe, offers well-tested phrases and key words to cover every situation a traveler is likely to encounter. This handy guide provides key phrases for use in everyday circumstances, complete with phonetic spelling; an English-French and French-English dictionary; the latest information on European currency and rail transportation, and even a tear-out cheat sheet for continued language practice as you wait in line at the Louvre. Informative, concise, and practical, Rick Steves' French Phrase Book and Dictionary is an essential item for any traveler's sac a dos.",
        "Category": " Travel , Europe , Germany",
        "Publisher": "Rick Steves",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The Best School Year Ever",
        "Authors": "By Robinson, Barbara",
        "Description": "Buckle up for a wild ride involving a missing gerbil, a crazy cat, and a tattooed baby that will have readers of all ages laughing! This hilarious novel stars the Herdmans, the worst kids in the world, who made their first appearance in author Barbara Robinson's classic The Best Christmas Pageant Ever.In The Best School Year Ever, Imogene, Claude, Ralph, Leroy, Ollie, and Gladys Herdman haven’t changed a bit. They still set things on fire and knock the other kids black and blue.One day the teachers ask all the students to think of compliments for their classmates, and Beth Bradley picks Imogene Herdman’s name. At first, Beth can’t think of anything good, but soon she begins to see Imogene in a new light.Maybe behind all of the outrageous pranks, there is something good about the Herdmans?",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Good-Bye Pony (Pony Pals #8)",
        "Authors": "By Betancourt, Jeanne and Bachem, Paul (ILT)",
        "Description": "Caring for Ms. Wiggin's beloved pony, Winston, Anna is devastated when she realizes how old and sick Winston has become and calls upon her Pony Pal friends for support when she is forced to say goodbye. Original.",
        "Category": "",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "9.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Dream Makers: UntamedLess Of A Stranger",
        "Authors": "By Roberts, Nora",
        "Description": "UntamedJo Wilder had the heart of a lion and the temper of a wildcat. And when Keane Prescott crossed her path, she bared her claws. Jo was certain her charming new boss imperiled everything she cared for, but she couldn't deny the attraction between them. Though Keane's kisses left her breathless, it was his tenderness that threatened to tame her heart.Less of a StrangerConfident and colossally arrogant, David Katcherton swept into Megan Miller's life and awakened feelings that had long been lying dormant. But she wasn't about to fall for this irresistible stranger who was after her grandfather's business. As Katch challenged her to fulfill her dreams, he also aroused passions she'd never known before&#133;.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Married to the Brand: Why Consumers Bond with Some Brands for Life",
        "Authors": "By McEwen, William J.",
        "Description": "Packed with stories and compelling discoveries from an impressive worldwide consumer database, Married to the Brand reveals why consumers bond with some brands — but not others. Looking through the all-important eyes of the consumer, it shows what companies must do to build enduring and profitable brand relationships.Companies spend millions of dollars every year trying to court consumers. They invest in flashy advertising, celebrity endorsements, loyalty programs, Web sites . . . you name it. And they spend millions more trying to build their businesses through elaborate “relationship management” software. The result? Most marketers still aren’t emotionally connecting with consumers. Sure, their strategies may draw raves, and their ads may win impressive awards at Cannes. They may even raise their brand awareness. But they too often fail to build enduring brand relationships. Put another way: Many marketers are great at wooing a “first date” with consumers — yet lousy at creating a lasting marriage between buyer and brand. Married to the Brand tells the story of what makes profitable brand relationships work — through the eyes of the consumer, not the marketer. Packed with stories and compelling discoveries from a worldwide consumer database, this book explores why people bond with some brands and not others. Emotions aren’t simply warm, fluffy concepts. According to Married to the Brand, which draws on 60 years of Gallup Organization research into consumer psychology, emotional connections can be measured and managed. Married to the Brand shows you how. This is a must-read for profit-obsessed marketers everywhere — from the boardroom, where strategies are formulated, to the front lines, where employees “live” the brand every day.",
        "Category": " Business & Economics , Consumer Behavior",
        "Publisher": "Gallup Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Winter Lodge (Lakeshore Chronicles, Book 2)",
        "Authors": "By Wiggs, Susan",
        "Description": "On the longest night of the year, Jenny Majesky loseseverything in a devastating house fire. But among theashes she finds an unusual treasure hidden amid hergrandfather's belongings, one that starts her on a searchfor the truth, and on a path toward a life that she neverimagined. The Winter Lodge, a remote cabin owned byher half sister on the shores of Willow Lake, becomesa safe refuge for Jenny, where she and local police chiefRourke McKnight try to sort out the mysteries revealedby the fire. But when a blizzard traps them together, Jenny,accustomed to the safe predictability of running thefamily bakery, suddenly doesn't feel so secure. For evenas Rourke shelters her from the storm outside, she knowsher heart is at risk. Now, following her dreams mightmean walking away from her one chance at love.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Mira",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "If You Could See What I See: The Tenets of Novus Spiritus",
        "Authors": "By Browne, Sylvia",
        "Description": "This enlightening work by renowned psychic Sylvia Browne contains the Gnostic tenets of her church, the Society of Novus Spiritus, and is a map of our charts regardless of what spiritual path we follow.It has taken many years of research to put together what at first seems simple tenets to follow, but in going deeper, this book carries within it the very heart of humankind&#8217s search for our own spirituality.  Sylvia has also included many details from her own personal journey, which she feels is comparable to the quest that each of us follows to find our own God-center. As we travel this road, we can realize that long-forgotten, yet simple and truthful goal of viewing our life on Earth as our path to God.",
        "Category": " Religion , Spirituality",
        "Publisher": "Hay House Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The 15-Minute Vegetarian Gourmet",
        "Authors": "By Mitchell, Paulette",
        "Description": "Provides vegetarian recipes for appetizers, soups, salads, main dishes, and desserts, and explains how to plan a vegetarian meal",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Knit Baby Blankets!",
        "Authors": "By Steege, Gwen (EDT)",
        "Description": "A baby's on the way, and you want to give something personal, something truly of yourself. The solution: Sit down and knit a cozy crib blanket. New parents will treasure any of the adorable projects in KNIT BABY BLANKETS!. This attractive, die-cut, how-to book contains 15 patterns for baby blankets.KNIT BABY BLANKETS! is written with the beginning or occasional knitter in mind. All instructions are in plain English - abbreviations are kept to a minimum, and all terms are thoroughly explained. Plus, the unique color-coded column format makes it easy for knitters to follow the instructions for the size of their knitted item.KNIT BABY BLANKETS! features patterns from a wide range of knitting designers in the United States and Canada, and is packed with practical information, including advice on which yarns are most suitable for baby knits - soft cottons, chenilles, and warm, machine-washable wools.  The book also includes a felted knitting project; felting is a hot technique that produces soft, cozy, unusual items that knitters everywhere are enjoying.  The styles range from traditional to hip, from whimsical to bold, and all are adorable!",
        "Category": " Crafts & Hobbies , Needlework , Knitting",
        "Publisher": "Storey Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Advertising procedure",
        "Authors": "By Kleppner, Otto",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "6.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Love Poems",
        "Authors": "By Burr,David Stanford",
        "Description": "",
        "Category": "",
        "Publisher": "BArnes and Noble",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Watch the Colors Grow",
        "Authors": "By allison bonaguro",
        "Description": "",
        "Category": "",
        "Publisher": "Gerber",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Empty Chair",
        "Authors": "By Deaver, Jeffery",
        "Description": "Lincoln Rhyme is back...  From the bestselling author of The Bone Collector and The Devil's Teardrop comes this spine-chilling new thriller that pits renowned criminalist Lincoln Rhyme against the ultimate opponent -- Amelia Sachs, his own brilliant protégée.  A quadriplegic since a beam crushed his spinal cord years ago, Rhyme is desperate to improve his condition and goes to the University of North Carolina Medical Center for high-risk experimental surgery. But he and Sachs have hardly settled in when the local authorities come calling. In a twenty-four-hour period, the sleepy Southern outpost of Tanner's Corner has seen a local teen murdered and two young women abducted. And Rhyme and Sachs are the best chance to find the girls alive.  The prime suspect is a strange teenaged truant known as the Insect Boy, so nicknamed for his disturbing obsession with bugs. Rhyme agrees to find the boy while awaiting his operation. Rhyme's unsurpassed analytical skills and stellar forensic experience, combined with Sachs's exceptional detective legwork, soon snare the perp. But even Rhyme can't anticipate that Sachs will disagree with his crime analysis and that her vehemence will put her in the swampland, harboring the very suspect whom Rhyme considers a ruthless killer. So ensues Rhyme's greatest challenge -- facing the criminalist whom he has taught everything he knows in a battle of wits, forensics, and intuition. And in this adversary, Rhyme also faces his best friend and soul mate.  With the intricate forensic detail, breathtaking speed, and masterful plot twists that are signature Deaver, The Empty Chair is page-turning suspense of the highest order, destined to continue Jeffery Deaver's bestselling track record and thrill his legions of fans worldwide.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Shape of the World: The Mapping and Discovery of the Earth",
        "Authors": "By Berthon, Simon and Robinson, Andrew",
        "Description": "The companion book to a six-part PBS television series beginning April 1, 1991. The series depicts how scientists and explorers throughout the centuries disproved prevailing myths regarding the Earth's shape and geography. Contains some 150 color maps, photographs and illustrations, including a color photograph taken from Apollo 8, which proved that (at least for the time being) the Earth is a sphere traveling in space. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Science , Earth Sciences , Geography",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Touch and Feel: Puppy",
        "Authors": "By Dorling Kindersley, Inc. (COR)",
        "Description": "Furry puppies describe themselves and their likes and dislikes in simple sentences. On board pages.",
        "Category": " Juvenile Nonfiction , Animals , Dogs",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "When I Get Bigger",
        "Authors": "By Mayer, Mercer",
        "Description": "Spend some time with Little Critter’s little sister as she imagines all the things she can be when she grows up in Mercer Mayer’s classic, funny, and heartwarming book. Whether she’s dreaming of becoming a lion tamer, a famous doctor, or a brave pilot, both parents and children alike will relate to this beloved story. A perfect way to teach children to reach for the sky!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Idea Wise: Bathrooms",
        "Authors": "By Farris, Jerri",
        "Description": "Today's bathroom is more than a functional, utilitarian space-it is also a sanctuary and private retreat. The bathroom receives more remodeling dollars than any other room in the house (except the kitchen). Today's bathroom is a center for both physical and mental relaxation, and IdeaWise: Bathrooms will show you how to get the most personal satisfaction from this all-important room. There are also good economic reasons for remodeling or adding a bathroom-a major bathroom project returns virtually its entire investment by adding value to your home.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Cool Springs Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Complete Guide to Yard & Garden Features (Black & Decker Complete Guide)",
        "Authors": "By Creative Publishing International (EDT)",
        "Description": "After major construction is completed on a landscape, adding personal finishing touches is what turns the yard into a genuine extension of the home, allowing it to reflect the personality and tastes of the owner. In established landscapes, adding finishing touches is an easy way to 'remodel' the outdoor home and make it new again.The Complete Guide to Yards & Garden Features presents more than 60 complete projects to create practical and decorative finishing features for the outdoor home. It features a wide assortment of building materials, including wood, masonry, and metals, with complete directions for working with these materials. The book includes projects for the living garden, such as installing decorative edging, constructing a rock garden, and building planters and window boxes. It also includes projects for the general landscape, such as building decorative gates, ornamental fountains, and benches.  Each project includes detailed plans and comprehensive how-to directions accompanied by color photos and illustrations.",
        "Category": " Gardening , Garden Furnishings",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Whole Numbers & Integers BASIC/Not Boring 6-8+: Inventive Exercises to Sharpen Skills and Raise Achievement",
        "Authors": "By Forte, Imogene",
        "Description": "This set of standards-based reproducible activity pages is basic, not boring. In WholeNumbers and Integers, students practice high interest math exercises built around sporting events. They will score a bowling contest and decide whether a racing pigeon moves faster than a guy on a skateboard. As your students take on the challenges of these adventures, their math skills will be strengthened. An assessment and a glossary of math terms are included.",
        "Category": " Young Adult Nonfiction , Mathematics , General",
        "Publisher": "Incentive Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Rodale's Ultimate Encyclopedia of Organic Gardening: The Indispensable Green Resource for Every Gardener",
        "Authors": "By Ellis, Barbara W. (EDT) and Bradley, Fern Marshall (EDT)",
        "Description": "Over 400 entries of the most practical, up-to-date gardening information ever, collected from garden experts and writers nationwide!\"Gardens are places to renew yourself in mind and body, to reawaken to the truth and beauty of the natural world, and to feel the life force inside and around you. And the organic way to garden is safer, cheaper, and more satisfying. Organic gardeners have shown that it's possible to have pleasant and productive gardens in every part of this country without using toxic chemicals. They make their home grounds an island of purity.\"Robert Rodale",
        "Category": " Gardening , Organic",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Sesame Street People in your neighborhood",
        "Authors": "By Moss, Jeffrey",
        "Description": "",
        "Category": "",
        "Publisher": "Western Pub. in conjunction with Children's Television Workshop",
        "Price Starting With ($)": "13.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Guji Guji",
        "Authors": "By Chen, Chih Y.",
        "Description": "When a crocodile egg rolls down the hill and into the nest with the rest of her eggs, Mother Duck pays no mind and raises the little crocodile as if he were a duck.",
        "Category": " Juvenile Fiction , Animals , Alligators & Crocodiles",
        "Publisher": "Kane/Miller Book Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "50 Ways to Paint a Wall: Easy Techniques, Decorative Finishes, and New Looks",
        "Authors": "By McCauley, Gail",
        "Description": "All the popular and new decorative paint looks made simple.50 Ways to Paint a Wall is a straightforward guide to creating the stylish paint effects constantly featured on home shows and in shelter magazines. The paint techniques-four dozen plus two-include special applications, geometric designs, faux finishes, and wall embellishments. The techniques and color choices are always on trend, including the contemporary approaches to perennial favorites like sponging and stencils. With fifty choices, which technique is best for the room? Decorator tips will help make the big decision. For each technique, there is a big color swatch of the finished wall, then the best method is explained and photographed step-by-step. With this bargain-priced guide and a can of paint, anyone can transform a room fifty ways.",
        "Category": " House & Home , Decorating & Furnishings",
        "Publisher": "Quarry Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Handcrafted Weddings: Over 100 projects & ideas for personalizing your wedding",
        "Authors": "By Editors of Creative Publishing, international, The Editors of Creative Publishing",
        "Description": "This beautiful book will help personalize any wedding. Filled with inspirational ideas that will help create lasting memories of this special day, Handcrafted Weddings demonstrates how to plan and stylize all of the romantic elements and custom details for a fabulous, yet affordable, wedding. Inspirational ideas for stationery, flowers, accessories, church decorations, reception decorations and memorabilia. All project details are beautifully photographed and explained with clear step-by-step directions.This invaluable guide is filled with hundreds of suggestions for all styles of weddings. It includes dozens of imaginative ideas for adding a personal touch to any wedding, as well as original ideas that can also save money, such as patterns and instructions for sewing your own wedding veil.Highlights:Includes a multitude of ideas for making wedding accessories and finishing touches for a variety of wedding styles.Makes a great shower gift.More color photos than any competing title.Instructions for making bridal veils in a variety of styles.Information on wedding stationary that includes embossing and die-cutting.Do-it-yourself instructions for making many wedding accessories.There are lots of wedding planner books on the market, but not many in the do-it-yourself category.Ideas shown in the book require only basic sewing skills, if any.",
        "Category": " Reference , Weddings",
        "Publisher": "Quarry Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "PCs All-in-One Desk Reference For Dummies",
        "Authors": "By Chambers, Mark L.",
        "Description": "Your one-stop guide to a long and happy relationship with your PCMark Chambers doesn't believe computers are supposed to be complicated, and this book proves it. Here you'll find the straightforward scoop on using and enjoying your PC, whether it's your first one or your fifth. From using Microsoft Works and getting online to digital multimedia, problem-solving, and network security, it's all at your fingertips!Discover how to:Use the different ports on your PCTroubleshoot Windows XPListen to Internet radioUse Microsoft Works and Office 2003Make movies and DVDsSet up and secure a network",
        "Category": " Computers , Hardware , Personal Computers , PCs",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Parenting in the Home Stretch: 12 Ways to Prepare Your Kids for Life on Their Own",
        "Authors": "By Neumann, Connie",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "A Family Is Your Most Precious Possession (Disney's Family Storybook Library, Book One)",
        "Authors": "By Disney Press",
        "Description": "",
        "Category": "",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "More Little Ways to Praise: More Bible Praises from the Psalms",
        "Authors": "By Arbuckle, Kathy",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Forbes Book of Great Business Letters",
        "Authors": "By Bruun, Erik",
        "Description": "",
        "Category": "",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Painting and Wallpapering",
        "Authors": "By Yeager, Robert C., Olson, Rik (ILT), and Marley, Stephen (PHT)",
        "Description": "",
        "Category": " House & Home , Decorating",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1983"
        }
    },
    {
        "Title": "Container Gardening (Burpee American Gardening Series)",
        "Authors": "By Bales, Suzanne Frutig",
        "Description": "Gives a detailed description of plants suitable for containers, including fruits and grasses, and presents advice on soil preparation, design, color, and selection of plants",
        "Category": " Gardening , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Skating Superstars",
        "Authors": "By Gertridge, Allison and Getridge, Allison",
        "Description": "Presents posters and biographical information about figure skaters Kristi Yamaguchi, Elvis Stojko, Oksana Baiul, and others",
        "Category": " Juvenile Nonfiction , Sports & Recreation , Ice Skating",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Plays for the Theatre",
        "Authors": "By Brockett, Oscar Gross (EDT) and Ball, Robert J.",
        "Description": "PLAYS FOR THE THEATRE, Seventh Edition, continues its rich tradition of providing insightful and absorbing plays for the contemporary stage. The plays selected typify a wide range of cultural diversity and dramatic power. PLAYS FOR THE THEATRE, edited by Oscar G. Brockett with Robert Ball, is a companion to THE ESSENTIAL THEATRE, Seventh Edition, which places selections from Plays within historical and cultural context, providing a richer and more rewarding exploration of the people and the ideas that have shaped today's theatre.",
        "Category": " Literary Criticism , Reference",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Unofficial Guide to Washington, D.C. (Unofficial Guides)",
        "Authors": "By Surkiewicz, Joe",
        "Description": "* Guides travelers to Washington's best cultural and historic sights-and offers helpful hints on how to beat the crowds and avoid long waits* More than 75 in-depth restaurant reviews explain where to find a good meal* Incisive hotel ratings show how to find the best lodgings at the best prices* Shows how to get around, how to see the government work, and where to find parks and outdoor activities",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Gardening in Containers",
        "Authors": "By Ortho Books (COR), Horton, Alvin (EDT), and Hildebrand, Ron (EDT)",
        "Description": "Explains how to grow flowers, trees, fruits, and vegetables in containers, force bulbs, and make planters and trellises",
        "Category": " Gardening , Container",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "House Plants: How to choose, grow, display",
        "Authors": "By Sunset",
        "Description": "Information on the cultivation and display of house plants accompanies a plant selection guide",
        "Category": " Gardening , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "WP211 - Bastien Piano Basics - Performance Level 1",
        "Authors": "By Jane Bastien",
        "Description": "",
        "Category": "",
        "Publisher": "Kjos Music Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Bicycling Magazine's New Cyclist Handbook: Ride with Confidence and Avoid Common Pitfalls",
        "Authors": "By Pavelka, Ed (EDT)",
        "Description": "Experienced road cyclists and mountain bikers share the knowledge and tips they wish they had when they started out. They'll help you avoid the common mistakes that can cause frustration and setbacks, and they'll teach you what every new rider should know with skills you can put to use-- starting with your very first ride!Discover how to:* Choose the right bike by answering three basic questions.* Ride safely with traffic.* Prevent and treat ailments like saddle sores and stiff knees.* Avoid the most common mistakes of new cyclists.* Fit riding into the busiest of schedules.* Train for a century.* Fix flats fast and perform basic maintenance.* Become a better cyclist-- in one afternoon!",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Butlerian Jihad (Legends of Dune #1)",
        "Authors": "By Herbert, Brian and Anderson, Kevin J.",
        "Description": "Frank Herbert's Dune series is one of the grandest epics in the annals of imaginative literature. Selling millions of copies worldwide, it is science fiction's answer to The Lord of the Rings, a brilliantly imaginative epic of high adventure, unforgettable characters, and immense scope. Decades after Herbert's original novels, the Dune saga was continued by Frank Herbert's son, Brian Herbert, an acclaimed SF novelist in his own right, in collaboration with Kevin J. Anderson. Their New York Times bestselling trilogy, Dune: House Atreides, Dune: House Harkonnen, and Dune: House Corrino, formed a prequel to the classic Herbert series that was acclaimed by reviewers and readers alike. Now Herbert and Anderson, working from Frank Herbert's own notes, reveal a pivotal epoch in the history of the Dune universe, the chapter of the saga most eagerly anticipated by readers: The Butlerian Jihad.Throughout the Dune novels, Frank Herbert frequently referred to the long-ago war in which humans wrested their freedom from \"thinking machines.\" Now, in Dune: Butlerian Jihad, Brian Herbert and Kevin J. Anderson bring to life the story of that war, a tale previously seen only in tantalizing hints and clues. Finally, we see how Serena Butler's passionate grief ignites the war that will liberate humans from their machine masters. We learn the circumstances of the betrayal that made mortal enemies of House Atreides and House Harkonnen; and we experience the Battle of Corrin that created a galactic empire that lasted until the reign of Emperor Shaddam IV.Herein are the foundations of the Bene Gesserit Sisterhood, the Suk Doctors, the Order of Mentats, and the mysteriously altered Navigators of the Spacing Guild. Here is the amazing tale of the Zensunni Wanderers, who escape bondage to flee to the desert world where they will declare themselves the Free Men of Dune. And here is the backward, nearly forgotten planet of Arrakis, where traders have discovered the remarkable properties of the spice melange . . . . Ten thousand years before the events of Dune, humans have managed to battle the remorseless Machines to a standstill . . . but victory may be short-lived. Yet amid shortsighted squabbling between nobles, new leaders have begun to emerge. Among them are Xavier Harkonnen, military leader of the Planet of Salusa Secundus; Xavier's fiancée, Serena Butler, an activist who will become the unwilling leader of millions; and Tio Holtzman, the scientist struggling to devise a weapon that will help the human cause. Against the brute efficiency of their adversaries, these leaders and the human race have only imagination, compassion, and the capacity for love. It will have to be enough.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Great American Cookouts",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corporation",
        "Price Starting With ($)": "6.05",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    }
]