[
    {
        "Title": "Fodor's Exploring Italy, 6th Edition (Exploring Guides)",
        "Authors": "By Fodor's Travel Publications, Inc. and Jepson, Tim",
        "Description": "Describes the country's history and culture, suggests tourist attractions, and presents information about travel and accommodations.",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Canada (Eyewitness Travel Guides)",
        "Authors": "By DK Publishing",
        "Description": "DK Eyewitness Travel's full-color guidebooks to hundreds of destinations around the world truly show you what others only tell you. They have become renowned for their visual excellence, which includes unparalleled photography, 3-D mapping, and specially commissioned cutaway illustrations. DK Eyewitness Travel Guides are the only guides that work equally well for inspiration, as a planning tool, a practical resource while traveling, and a keepsake following any trip.Each guide is packed with the up-to-date, reliable destination information every traveler needs, including extensive hotel and restaurant listings, themed itineraries, lush photography, and numerous maps.",
        "Category": " Travel , Canada , General",
        "Publisher": "DK Publishing, Inc.",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Fodor's Exploring France, 6th Edition (Exploring Guides)",
        "Authors": "By Fodor's Travel Publications, Inc. and Ruck, Adam",
        "Description": "",
        "Category": " Travel , Europe , France",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Ordeal of Richard Feverel; a History of Father and Son",
        "Authors": "By Meredith, George",
        "Description": "",
        "Category": "",
        "Publisher": "Modern Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "Poppleton In Winter",
        "Authors": "By Rylant, Cynthia and Teague, Mark (ILT)",
        "Description": "Poppleton the pig makes a new friend after an icicle accident, creates a bust of his neighbor Cherry Sue, and gets a wintry birthday surprise from his pals. Simultaneous.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Blue Sky Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "First Words (BABY TOUCH & FEEL)",
        "Authors": "By Dorling Kindersley, Inc. (COR)",
        "Description": "This top-selling board book encourages tiny fingers to explore and helps babies develop fine motor skills and increase their senses while building an early language foundation. Babies will feel different textures from soft and smooth to bumpy and rubbery in Baby Touch and Feel: First Words. With clearly-labeled pictures on pages that are embellished with foil or novelty textures that expand children’s senses and promote early language skills, this book will create an experience babies will want to repeat over and over again. Its padded cover can withstand biting and throwing while its thick sturdy board pages won’t tear. Your baby can practice early words and object recognition with Baby Touch and Feel: First Words. About the series: Baby Touch and Feel books are the perfect series for the very youngest readers. These small, padded books excite babies and toddlers with their foil and touch-and-feel covers. Each book in this affordable series contains twelve vibrant interior pages with bold, engaging images. Containing large word labels, each page has foil or glitter to behold or a tantalizing texture to touch. These safe novelty textures immediately intrigue babies and are perfect for little fingers to feel. The Baby Touch and Feel series encourages sensory development, language skills, and early reading skills while teaching colors, shapes, patterns, and opposites.",
        "Category": " Juvenile Nonfiction , Concepts , General",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Cooking Healthy with Splenda (R)",
        "Authors": "By Lund, JoAnna M. and Alpert, Barbara",
        "Description": "",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Presidents Fact Book: A Comprehensive Handbook to the Achievements, Events, People, Triumphs, and Tragedies of Every President from George Washington to George W. Bush",
        "Authors": "By Matuz, Roger and Harris, Bill (EDT)",
        "Description": "Completely updated with all the presidents, including Barack Obama, The Presidents Fact Book is a definitive guide to the political and personal lives of every U.S. president. Fully illustrated with 1,000 compelling photographs and illustrations, the book also features selections of the most significant primary documents of each administration, as well as thousands of little-known presidential facts, making it the ideal resource?whether for comprehensive research or compulsive browsing.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "7.72",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Eensy Weensy Spider",
        "Authors": "By Hoberman, Mary Ann and Westcott, Nadine Bernard (ILT)",
        "Description": "This charming board book retelling of the popular children's song is perfect for reading aloud together-and now is reissued with a modern cover and larger trim size.  This favorite nursery rhyme illustrated with bright, irresistible pictures will delight babies and toddlers. The board book format is perfect for little hands to hold and young children will enjoy seeing all the imaginative adventures the spider has after sliding down the waterspout--including hugging a baby bug, meeting a frog in a pond, joining a bug parade, and buying shoes--before settling down to sleep with mama in a cozy spiderweb hammock. With its playful rhythm, rhyme, and repetition, this is a perfect read-aloud for little ones and ideal for tucking into a stroller.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "LB Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Heavy-Duty Trucks (Step-Into-Reading, Step 3)",
        "Authors": "By Milton, Joyce and Courtney, Richard (ILT)",
        "Description": "Did you know that monster dump trucks are so tall that drivers have to use ladders just to get to their seats? Or that cherry picker trucks don't pick cherries? Through easy-to-read text and realistic art, young truck enthusiasts will discover everything they ever wanted to know about their favorite mode of transportation.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The House of Mirth (Modern Library 100 Best Novels)",
        "Authors": "By Wharton, Edith",
        "Description": "",
        "Category": "",
        "Publisher": "Modern Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Dot: The Littlest Princess",
        "Authors": "By M. L. Dunham",
        "Description": "",
        "Category": "",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Michael Foreman's Mother Goose (Reading together at home)",
        "Authors": "By Foreman, Michael.",
        "Description": "",
        "Category": "",
        "Publisher": "candlewick press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Scholastic Reader Level 2: Rainbow Magic: Rainbow Fairies: The Rainbow Fairies",
        "Authors": "By Meadows, Daisy",
        "Description": "Come see the Rainbow Fairies in their early reader debut!Meet the Rainbow Fairies in their early reader debut! These seven colorful sisters call Fairyland their home, and they would love to show you around.  See the toadstool houses gleaming red and white, the river bright and blue, and the pink shining fairy palace, floating on the highest hill. Come for a visit and you'll never want to leave!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "3 Books in 1: Rival Crock Pot (Slow Cooker Favorites; Winning Slow Cooker Recipes; Slow Cooker Recipes for All Occasions)",
        "Authors": "By Publications International (COR)",
        "Description": "",
        "Category": " Cooking , Methods , Special Appliances",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Bridges (Newbridge Discovery Links)",
        "Authors": "By Ring, Susan",
        "Description": "",
        "Category": "",
        "Publisher": "Newbridge Educational Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Harcourt School Publishers Trophies: Below Level Individual Reader Grade 3 Pony Express to the Rescue",
        "Authors": "By Hsp (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "HARCOURT SCHOOL PUBLISHERS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Simply Sarasota - Creatively Casual Cuisine - Sarasota Junior League",
        "Authors": "By Junior League of Sarasota",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Junior League of Sarasota",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Lady In Peril",
        "Authors": "By Williams, Ben Ames",
        "Description": "",
        "Category": "",
        "Publisher": "Popular",
        "Price Starting With ($)": "10.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "If Anything Happens to Hester",
        "Authors": "By John Creasey",
        "Description": "",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Church Chuckles",
        "Authors": "By paul-seaburn-ellen-p-blooming",
        "Description": "",
        "Category": "",
        "Publisher": "New Seasons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "THE MORE THE MERRIER: OLIVER & COMPANY",
        "Authors": "By Dwight Jon Zimmerman",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Peter Piper And Other Busy-Time Rhymes - Little Classics - Publications International, Ltd.",
        "Authors": "By Little Classics",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Take Your Diploma and Run!: Speaking to the Next Generation",
        "Authors": "By Byron, William J.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "How to Keep Your Faith In an Upside Down World",
        "Authors": "By Bowling, Sarah",
        "Description": "We live in a crazy and upside down world. Bad is good, sick is  excellent, the bomb is something terrific and the list goes on. Sarah  Bowling knows what it means to have a cause and be concerned,  confronted, compelled, corrupted, and consumed by it! Shortly before she  was married, Sarah had a confrontation with God. Not only did it turn  her world upside down, but it had a radical ripple effect on everyone  she encountered from that day forward. In Upside Down, Sarah gives  readers the fire and passion to seek their own life-changing encounter  with the living God and the will to live in a way that sets them apart  from the ordinary to embrace the extraordinary living God intends for  them to have.",
        "Category": " Religion , Christian Life , Spiritual Growth",
        "Publisher": "Destiny Image Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Laughter for a Woman's Soul FCS",
        "Authors": "By Zondervan Publishing House",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Inspirio",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "My Late Wives",
        "Authors": "By Dickson, Carter",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "34.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Give Thanks with a Grateful Heart: Songs4Worship Devotional (Songs 4 Worship Devotional)",
        "Authors": "By Asimakoupoulos, Greg (EDT)",
        "Description": "Daily Devotionals from the greatest praise and worship songs of all time. These are the songs that usher worshipers into the throne room of heaven. now listeners can bring each song's message into their personal quiet time with God. Each two-page devotional includes song lyrics, inspirational thoughts, and selected passages of Scripture.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Integrity Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Annie and Snowball and the Dress-up Birthday",
        "Authors": "By Rylant, Cynthia and Stevenson, Sutie (ILT)",
        "Description": "Annie is having a birthday party in this Level 2 Ready-to-Read by the Theodor Seuss Geisel Award–winning creators of Henry and Mudge. Annie and her pet bunny, Snowball, love living next door to Annie’s favorite cousin, Henry and his dog, Mudge. Whether it’s playing Frisbee or watching old movies, there’s no shortage of fun to be had when these four are together. Annie’s birthday is coming up, and she can’t wait to invite Henry and Mudge over for a dress-up party. But when the guests arrive, it’s Annie who gets the big surprise!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Ellery Queen's The Golden 13",
        "Authors": "By queen, ellery",
        "Description": "",
        "Category": "",
        "Publisher": "Popular Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Animal Antics: A Photo Expose",
        "Authors": "By Lund, John",
        "Description": "Ever wonder what really goes on among our four-legged friends after we leave the room? In Animal Antics, the secret is finally out. The animals are having a ball-and reading this book, you will too. Cats ride scooters, ducks dance the cancan, beagles lounge at the spa, and, yes, dogs do play poker! Behind this shocking expos‚ is veteran photographer (and digital-manipulation wizard) John Lund. Lund uses amazing digital sleight of hand to endow a menagerie of animals with eerily and uncannily human qualities. The text of the book is equally playful with tasty morsels of advice like \"Learn to pamper your soul,\" \"Sharpen your survival skills,\" and \"Chill out as needed.\" Many of the images in Animal Antics have been featured in a best-selling greeting card line of the same name. Ever wonder what really goes on among our four-legged friends after we leave the room? In Animal Antics, the secret is finally out. The animals are having a ball-and reading this book, you will too. Cats ride scooters, ducks dance the cancan, beagles lounge at the spa, and, yes, dogs do play poker! Behind this shocking expos‚ is veteran photographer (and digital-manipulation wizard) John Lund. Lund uses amazing digital sleight of hand to endow a menagerie of animals with eerily and uncannily human qualities. The text of the book is equally playful with tasty morsels of advice like \"Learn to pamper your soul,\" \"Sharpen your survival skills,\" and \"Chill out as needed.\" Many of the images in Animal Antics have been featured in a best-selling greeting card line of the same name.",
        "Category": " Humor , Topic , Animals",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Medical Cover-Ups in the White House",
        "Authors": "By Macmahon, Edward B., M.D. and Curry, Leonard",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Farragut Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "World War II Memorial Washington DC",
        "Authors": "By Grooms, Thomas B.",
        "Description": "",
        "Category": "",
        "Publisher": "American Battle Monuments Commssion",
        "Price Starting With ($)": "17.97",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Eyewitness: World War II (Eyewitness Books)",
        "Authors": "By Adams, Simon and Crawford, Andy (PHT)",
        "Description": "Now in Paperback!Discover the war that shaped the modern world in Eyewitness: World War II. From the pre-war rise of Nazi Germany to the start of the war with the invasion of Poland in 1939 to Japan singing the surrender agreement in 1945, all aspects of the deadliest conflict in human history are covered in great detail with content that is accessible and appropriate for young readers.For over 25 years, DK's Eyewitness books have been the most trusted nonfiction series in classrooms, libraries, and homes around the world. In summer 2014 this award-winning series will get a fresh new look both inside and out. The introduction of paperback editions, eye-catching jackets, and updated interiors ensure that the Eyewitness series will continue to be relevant in the ever-changing world of education and remain the go-to source for homework help, research projects, reluctant readers, ESL students, and, as always, to satisfy the minds of curious kids.Supports the Common Core State Standards.",
        "Category": " Juvenile Nonfiction , History , Military & Wars",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Who Were the Beatles? (Who Was--?)",
        "Authors": "By Edgers, Geoff and Tugeau, Jeremy (ILT)",
        "Description": "Almost everyone can sing along with the Beatles, but how many young readers know their whole story?  Geoff Edgers, a Boston Globe reporter and hard-core Beatles fan, brings the Fab Four to life in this Who Was...? book.  Readers will learn about their childhoods in Liverpool, their first forays into rock music, what Beatlemania was like, and why they broke up.  It's all here in an easy-to-read narrative with plenty of black-and-white illustrations!",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Music",
        "Publisher": "Penguin Workshop",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Standing with Courage: Confronting Tough Decisions about Sex",
        "Authors": "By Kurey, Mary-Louise",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Our Sunday Visitor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Treatise On The Science Of Muscular Action",
        "Authors": "By John PUGH",
        "Description": "",
        "Category": "",
        "Publisher": "Editions Medicina Rara",
        "Price Starting With ($)": "31.32",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Pontiac: They Built Excitement",
        "Authors": "By Bonsall, Thomas E.",
        "Description": "",
        "Category": "",
        "Publisher": "Stony Run Press",
        "Price Starting With ($)": "16.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "American Heritage History of World War I",
        "Authors": "By Editors of American Heritage, S. L. A. Marshall, Alvin M. Josephy, Joseph L. Gardner",
        "Description": "",
        "Category": "",
        "Publisher": "Easton Press",
        "Price Starting With ($)": "89.08",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Doomsday Book",
        "Authors": "By Connie Willis",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "63.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Parenting a Child with Asperger Syndrome: 200 Tips and Strategies",
        "Authors": "By Boyd, Brenda",
        "Description": "For parents of children with Asperger Syndrome ordinary parenting just doesn't always do it - AS kids need a different approach. Brenda is mother to thirteen-year-old Kenneth, author of Asperger Syndrome, the Universe and Everything, and since his diagnosis at the age of eight she has gathered together the parenting ideas and tips that have had a positive effect on Kenneth's life. Brenda discusses parents' reaction to their child's AS and gives advice on how better to understand 'Planet Asperger'. This book helps parents to respond positively to the challenge of AS and find the 'treasure' in their child's way of being.",
        "Category": " Education , Special Education , General",
        "Publisher": "Jessica Kingsley Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "FLASH GORDON AND THE TYRANT OF MONGO.",
        "Authors": "By Alex Raymond",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman",
        "Price Starting With ($)": "64.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1936"
        }
    },
    {
        "Title": "Terrania or the Feminization of the World",
        "Authors": "By Columbus Bradford",
        "Description": "",
        "Category": "",
        "Publisher": "Christopher Publishing House",
        "Price Starting With ($)": "82.43",
        "Publish Date": {
            "Month": "January",
            "Year": "1930"
        }
    },
    {
        "Title": "Soup And Appetizer Cookbook",
        "Authors": "By Golden Apple",
        "Description": "",
        "Category": "",
        "Publisher": "Ottenheimer Publisher, Inc.",
        "Price Starting With ($)": "5.46",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Meat Cookbook",
        "Authors": "By PUBLISHER",
        "Description": "",
        "Category": "",
        "Publisher": "Ottenheimer Publisher, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "The Magical Math Book",
        "Authors": "By Longe, Bob",
        "Description": "Fool your friends; baffle your buddies; and perplex your parents with dozens of amazing tricks. Each of these fascinating feats appears to be the work of magical forces, but their true secret lies in mathematical manipulations. Correctly guess the age of any volunteer. Startle a stranger with knowledge about his or her life. Read minds, make accurate predictions, perform lightning-quick calculations, and demonstrate seemingly mystical powers of memory. Perform extraordinary effects with cards, dice, pencil and paper (and occasionally a calculator). In all of these tricks, the mathematical principle is well-concealed, and in many of them the use of numbers isn't even suspected. For each trick, an explanation of why it works is included in order to help you better understand the principle behind it, as well as to enable you to make your own variations on the trick or to develop other tricks on your own. Suggestions are given for what to say when introducing a trick so as to heighten suspense, increase sur prise, and keep your audience as confounded as possible. No sleight of hand is used, but with your brain power as your \"magic wand,\" you'll have fun entertaining, amazing, and confusing people for hours.  96 pages, 51 b/w illus., 5 3/8 x 8 1/4. NEW IN PAPERBACK",
        "Category": " Juvenile Nonfiction , Mathematics , General",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Tiny Tim and the Mechanical Men. Based on the Famous Newspaper Strip.",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman Publishing Co",
        "Price Starting With ($)": "24.73",
        "Publish Date": {
            "Month": "January",
            "Year": "1937"
        }
    },
    {
        "Title": "Boys And Girls of Bookland",
        "Authors": "By Nora Archibald Smith",
        "Description": "",
        "Category": "",
        "Publisher": "David McKay",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1923"
        }
    },
    {
        "Title": "Dandelion Wine ",
        "Authors": "By Ray Bradbury",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "48.36",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Bird-hunting through wild Europe",
        "Authors": "By Lodge, R. B",
        "Description": "",
        "Category": "",
        "Publisher": "D. Appleton",
        "Price Starting With ($)": "44.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1909"
        }
    },
    {
        "Title": "Vanya of the streets",
        "Authors": "By Kennell, Ruth Epperson",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Brothers",
        "Price Starting With ($)": "16.45",
        "Publish Date": {
            "Month": "January",
            "Year": "1931"
        }
    },
    {
        "Title": "The spinning and twisting of long vegetable fibres (flax, hemp, jute, tow, & ramie): A practical manual of the most modern methods as applied to the ... of the long vegetable fibres of commerce",
        "Authors": "By Carter, H. R",
        "Description": "",
        "Category": "",
        "Publisher": "J.B. Lippincott Company",
        "Price Starting With ($)": "37.93",
        "Publish Date": {
            "Month": "January",
            "Year": "1904"
        }
    },
    {
        "Title": "Hey Cabbie",
        "Authors": "By Logan, Thaddeus",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Logam Enterprises Pub Co",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Gone Before: Being a Manual of Consolation for the Bereaved and a Well of Sympathy for the Sorrowing Filled from Many Sources",
        "Authors": "By Henry Southgate",
        "Description": "",
        "Category": "",
        "Publisher": "J. B. Lippincott Company",
        "Price Starting With ($)": "18.15",
        "Publish Date": {
            "Month": "January",
            "Year": "1873"
        }
    },
    {
        "Title": "365 Great Cakes and Pies",
        "Authors": "By Prager, Carol",
        "Description": "An eighteenth contribution to the popular series features a ring-binder format and such recipes as Chocolate Turtle Cheesecake, Raspberry Princess Cake, Iced Cappucino Cupcakes, and Caramel Ginger Walnut Tarts with Chocolate Cognac Glaze. National ad/promo.",
        "Category": " Cooking , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Quick Fixes from Brand Name Mixes",
        "Authors": "By Editor",
        "Description": "",
        "Category": "",
        "Publisher": "International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Backpack Books: 1,001 Facts about Rocks & Minerals (Backpack Books)",
        "Authors": "By Maynard, Christopher and Fuller, Sue",
        "Description": "A world of knowledge at your child's fingertips! Small enough to carry in your bag, but big enough to provide all the answers you'll ever need, Backpack Books are jam-packed with thousands of fascinating facts that have been researched and written by experts. More than 550 illustrations and photographs in each book help bring knowledge-on kids' favorite subjects-to life!",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , Rocks & Minerals",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Worst-Case Scenario Survival Handbook: Middle School (Worst Case Scenario Junior Editions)",
        "Authors": "By Borgenicht, David, Winters, Ben H., and Epstein, Robin",
        "Description": "Homework, hormones, heartache...middle school has no shortage of perils. Never fear, the authors of the best-selling Worst-Case Scenario series return with a survival guide for those who are facingor just about to facethis big transitional time in school and life. The handbook is packed with funny-but-useful tips for the trickiest situations that crop up in middle school, like taking charge of a too-busy homework schedule, dealing with a cold shoulder from a friend who has suddenly become just too cool, avoiding common e-mail and cell phone disasters, and more.",
        "Category": " Juvenile Nonfiction , Humor , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Cake Mix Miracles",
        "Authors": "By Oxmoor House",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Not Just a Pretty Face: The Ugly Side of the Beauty Industry",
        "Authors": "By Malkan, Stacy",
        "Description": "The girls' guide to giving the cosmetics industry a makeover.  Lead in lipstick? 1,4 dioxane in baby soap? Coal tar in shampoo? How is this possible?  Simple. The $35 billion cosmetics industry is so powerful that they've kept themselves unregulated for decades.  Not one cosmetic product has to be approved by the US Food and Drug Administration before hitting the market.  Incredible? Consider this:  The European Union has banned more than 1,100 chemicals from cosmetics. The United States has banned just 10.  Only 11% of chemicals used in cosmetics in the US have been assessed for health and safety – leaving a staggering 89% with unknown or undisclosed effects.  More than 70% of all personal care products may contain phthalates, which are linked to birth defects and infertility.  Many baby soaps are contaminated with the cancer-causing chemical 1,4 dioxane.  It's not just women who are affected by this chemists' brew. Shampoo, deodorant, face lotion and other products used daily by men, women and children contain hazardous chemicals that the industry claims are \"within acceptable limits.\" But there's nothing acceptable about daily multiple exposures to carcinogenic chemicals-from products that are supposed to make us feel healthy and beautiful.  Not Just a Pretty Face  delves deeply into the dark side of the beauty industry, and looks to hopeful solutions for a healthier future. This scathing investigation peels away less-than-lovely layers to expose an industry in dire need of an extreme makeover.  15 percent of the purchase price of each book sold benefits the national Campaign for Safe Cosmetics, administered by the Breast Cancer Fund, through December 31, 2012.",
        "Category": " History , United States , 20th Century",
        "Publisher": "New Society Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Public Choice II: A Revised Edition of Public Choice (Cambridge Surveys of Economic Literature)",
        "Authors": "By Mueller, Dennis C.",
        "Description": "Detailing normative issues in public choice, this book discusses the main topics of the literature of the past forty years.  Separate chapters examine various applied public choice questions such as rent seeking, the growth of government, the rise and decline of nations, political business cycles, why people vote, and the nature and extent of redistribution. Also included are the Bergson-Samuelson social welfare functions, the Arrow and Sen impossibility theorems, and the work of John Rawls, John Harsanyi, James Buchanan, and Gordon Tullock.    This book is a major revision of Public Choice, published in 1979.  It contains eleven new chapters in addition to substantial revision and expansion, and separate sections containing proofs of the most important theorems.",
        "Category": " Business & Economics , Economic History",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "When War Is Unjust: Being Honest in Just-War Thinking",
        "Authors": "By Yoder, John Howard",
        "Description": "",
        "Category": " Religion , Ethics",
        "Publisher": "Augsburg Fortress Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "A Cross Cultural Look at Death, Dying and Religion",
        "Authors": "By Parry, Joan and Ryan, Angela",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Wadsworth Pub. Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Holt Biology Visualizing Life",
        "Authors": "By Johnson, George B.",
        "Description": "",
        "Category": " Young Adult Nonfiction , Science & Nature , Biology",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "8.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "70 Common Cacti of the Southwest",
        "Authors": "By Fischer, Pierre C.",
        "Description": "With their strange and contorted shapes, fascinating spines, and showy flowers, members of the cactus family attract the attention and ardor of plant lovers and botanists alike. From Big Bend country of Texas through the Sonoran and Mojave deserts you'll find cacti growing, their succulent and spiny forms defining the arid southwestern landscape.70 Common Cacti of the Southwest is an indispensable guide to the names, characteristics, and range of the cacti you are most likely to encounter in this extraordinary region.More than 75 close-up photographsIncludes the species you are most likely to encounter in southwestern deserts and foothillsHandy information on how to identify each speciesBrief description of habitat and range",
        "Category": " Nature , Plants , Cacti & Succulents",
        "Publisher": "Western National Parks Association",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Sams Teach Yourself the Internet in 10 Minutes (2nd Edition)",
        "Authors": "By Grimes, Galen",
        "Description": "",
        "Category": " Computers , Internet , General",
        "Publisher": "Pearson Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Easy Origami",
        "Authors": "By Fumiaki Shingu",
        "Description": "",
        "Category": "",
        "Publisher": "Mud Puddle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Daily We Follow Him: Learning Discipleship from Peter",
        "Authors": "By Pennington, Basil",
        "Description": "The call of every Christian is a call to discipleship. But Christians through the ages have puzzled over this call. \"How do I become a good follower of Christ as He intended?\"  M. Basil Pennington, the well-known spiritual writer, addresses this question by using Peter, the first of the Apostles, as the prime example of the maturing follower of Christ. Through Peter, he demonstrates, the Gospel takes on an immediacy and relevance that is unique -- and from which the contemporary Christian can learn a valuable lesson. Peter's spiritual awakening and growth points the way for us to live out our call, with its inevitable challenges, frustrations, and occasional failures. Jesus calls us, as He did the first Apostles, into a special filial relationship with Him. \"It is our life's work,\" Pennington writes, \"to learn to think and act in accord with who we are by creation and by the recreation of baptism.\"  DAILY WE FOLLOW HIM will be of great help to anyone struggling with the demands of faith, built on the premise that we are all called to be disciples, called to give Christian witness in our everyday life. Pennington's spiritual reflections enable us to respond to that call in the only way possible.",
        "Category": " Religion , Biblical Biography , New Testament",
        "Publisher": "Galilee Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Ministry of Communion (Ministry Series)",
        "Authors": "By Kwatera, Michael",
        "Description": "",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Spring Arbor Distributors",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "NIV Compact Dictionary of the Bible",
        "Authors": "By Tenney, Merrill C. and Douglas, J. D.",
        "Description": "Who were the Pharisees? What did Samson and John the Baptist have in common? Does an altar really have \"horns\"? Turn to the NIV Compact Dictionary of the Bible and find out. It has the answers to these and hundreds of other questions you're likely to wonder about as you read the Bible. Condensed from the New International Bible Dictionary, this unique volume offers much more than its convenient, take anywhere size. It's actually three books in one: - A Dictionary -- for easy-to-find, practical information on thousands of topics - A Topical Index -- for detailed study of nearly 150 larger topics, listing all articles in the dictionary that relate to a given topic - A Survey -- providing an introductory overview of the Bible, biblical history, and biblical culture -- Concise, readable, and informative, the NIV Compact Dictionary of the Bible is ideal for use at home, in study groups, and in schools. It will help you clear up the who, what, where, why, and how of the Bible so you can better appreciate the depth of its wisdom and its relevance for you today.",
        "Category": " Religion , Christian Education , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Chain of Custody: A Novel",
        "Authors": "By Levy, Harry",
        "Description": "When his estranged wife, a highly respected deputy district attorney in charge of the sex crimes unit, is found murdered in their apartment, Malone falls, inevitably, under the suspicious eye of the police. After all, he's on the verge of a nasty divorce. His unusual medical-legal background gives him the kind of inside knowledge - how to disguise the victim's time of death or prevent evidence from being deemed admissible in court - that can keep a guilty man out of jail. At least until the DNA tests reveal that blood at the crime scene can only be Malone's.Did Malone do it? Or is he being railroaded by the D.A. and the police - a payback for the wrongful-death action he's pursuing for the family of a prisoner who died in police custody?",
        "Category": " Fiction , Thrillers",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Black Dog Of Fate: A Memoir",
        "Authors": "By Balakian, Peter",
        "Description": "“His visions are burning…his poetry heartbreaking,” wrote Elie Wiesel of American poet Peter Balakian. Now, in elegant prose, the prize-winning poet who James Dickey called “an extraordinary talent” has written a compelling memoir about growing up American in a family that was haunted by a past too fraught with terror to be spoken of openly.Black Dog of Fate is set in the affluent New Jersey suburbs where Balakian—the firstborn son of his generation—grew up in a close, extended family. At the center of what was a quintessential American baby boom childhood lay the dark specter of a trauma his forebears had experienced—the Ottoman Turkish government’s extermination of more than a million Armenians in 1915, the century’s first genocide. In a story that climaxes to powerful personal and moral revelations, Balakian traces the complex process of discovering the facts of his people’s history and the horrifying aftermath of the Turkish government’s campaign to cover up one of the worst crimes ever committed against humanity.In describing his awakening to the facts of history, Balakian introduces us to a remarkable family of matriarchs and merchants, physicians, a bishop, and his aunts, two well-known figures in the world of literature. The unforgettable central figure of the story is Balakian’s grandmother, a survivor and widow of the Genocide who speaks in fragments of metaphor and myth as she cooks up Armenian delicacies, plays the stock market, and keeps track of the baseball stats of her beloved Yankees. The book is infused with the intense and often comic collision between this family’s ancient Near Eastern traditions and the American pop culture of the ’50s and ’60s.Balakian moves with ease from childhood memory, to history, to his ancestors’ lives, to the story of a poet’s coming of age. Written with power and grace, Black Dog of Fate unfolds like a tapestry its tale of survival against enormous odds. Through the eyes of a poet, here is the arresting story of a family’s journey from its haunted past to a new life in a new world.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "The Anglo Files: A Field Guide to the British",
        "Authors": "By Lyall, Sarah",
        "Description": "Sarah Lyall moved to London in the mid-1990s and soon became known for amusing and sharp dispatches on her adopted country. Confronted by the eccentricities of these island people (the English husband who never turned on the lights, the legislators who behaved like drunken frat boys, the hedgehog lovers), she set about trying to figure out the British. Part anthropological field study and part memoir, The Anglo Files has already received great acclaim and recognition for the astuteness, humor, and sensitivity with which the author wields her pen.",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "A Good Death (Felony & Mayhem Mysteries)",
        "Authors": "By Ironside, Elizabeth",
        "Description": "It?s 1944 and Theo Cazalle is returning to the family he left in Bonnemort, an estate deep in the French countryside, when he went off to fight with the Free French. Memories of Bonnemort have sustained him through four years of war, but when at last he comes home, he finds his world in tatters. The house has been abandoned, a family servant has been shot, Theo?s wife has been accused of collaborating, and a Nazi officer has been found dead in front of Bonnemort?s front gate. To save his sanity, Theo must restore order to Bonnemort, but first he must understand the disorder into which it has fallen. Is his wife a whore? A murderer? Or could there be another alternative?",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Felony & Mayhem Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Unlocking Potential: College and Other Choices for Learning Disabled People, a Step-By-Step Guide",
        "Authors": "By Scheiber, Barbara and Talpers, Jeanne",
        "Description": "Offers learning disabled students advice on selecting a college, overcoming academic challenges, and making personal and social adjustments",
        "Category": "",
        "Publisher": "Adler & Adler Pub",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Age of Reason",
        "Authors": "By Paine, Thomas and Conway, Moncure Daniel (EDT)",
        "Description": "\"Of all the tyrannies that affect mankind, tyranny in religion is the worst,\" declared Thomas Paine, adding, \"every other species of tyranny is limited to the world we live in; but this attempts to stride beyond the grave, and seeks to pursue us into eternity.\" Paine's years of study and reflection on the role of religion in society culminated with his final work, The Age of Reason. This coolly reasoned polemic influenced religious thinking throughout the world at the dawn of the nineteenth century, and its resonance remains undiminished by time. The selfsame humanist and egalitarian views that made Paine a popular figure of the American Revolution brought him into frequent conflict with political authorities. Parts of The Age of Reason were written in a French jail, where Paine was confined for his opposition to the execution of Louis XVI. An atack on revealed religion from the deist point of view — embodied by Paine's credo, \"I believe in one God, and no more\" — this work undertakes a hitherto unheard-of approach to Bible study. Its critical and objective examination of Old and New Testatments cites nemerous contradictions as evidence against literal interpretations of the text. Well articulated and eminently readable, The Age of Reason is a classic of free thought.",
        "Category": " History , United States , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "My Christmas Craft Book",
        "Authors": "By Murray, Anna and Watts, Lynda",
        "Description": "Provides instructions for making felt ornaments, a pop-up Santa, potpourri sachets, wreaths, decorations, stenciled glitter cards, a Santa puppet, a reindeer hat, tote bags, and gingerbread men",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Braxtons of Miracle Springs",
        "Authors": "By Phillips, Michael R.",
        "Description": "Christopher and Corrie Braxton make their first little home in the bunkhouse connected to her father's barn, but danger from the past comes stalking Pa Hollister and threatens the happy family. Original. IP.",
        "Category": " Fiction , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Exercise Ball",
        "Authors": "By Rose, Sara",
        "Description": "",
        "Category": " Health & Fitness , Exercise , General",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Candyfloss",
        "Authors": "By Wilson, Jacqueline and Sharratt, Nick (ILT)",
        "Description": "CHOOSING BETWEEN PARENTS AND FRIENDS Candyfloss is the perfect introduction to jacqueline Wilson.  When Floss's mother and stepfather announce they are moving to Australia for six months, Floss has to decide whether to go with them or stay home with Dad--inept, but loving and always lots of fun.  And how will her choice affect her friendship with her popular but not-so-loyal best friend, Rhiannon? About girls everywhere, for girls everywhere, Candyfloss speaks in universals: it's about friendship, family, and growing up in a complicated world.  Like all Wilson's novels, it has an honesty and cheerful integrity that offers a real alternative to the materialistic values of so much fiction aimed at girls.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Roaring Brook Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Matt & Shari Great Weekend Projects",
        "Authors": "By Hiller, Shari",
        "Description": "",
        "Category": " House & Home , Reference",
        "Publisher": "DRG Publishing",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Spirit of an Age: Nineteenth-Century Paintings From the National Galerie, Berlin",
        "Authors": "By Forster-Hahn, Françoise et al",
        "Description": "",
        "Category": "",
        "Publisher": "National Gallery Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Knopf Guide: Singapore and Malaysia",
        "Authors": "By Knopf Guides",
        "Description": "",
        "Category": " Travel , Asia , Far East",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Route of the Mayas (Knopf Guides)",
        "Authors": "By Antochiw, Michel",
        "Description": "Journey through the mysterious Mayan ruins of the Yucatan and Central America and learn about the fascinating Mayan civilization through this lavishly illustrated and information-packed book, with more than 1,000 drawings, photos and maps. Colorful cross sections and plans of city-states illustrate the Route of the Mayas. National ads/media.",
        "Category": " Travel , Reference",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Talking Dirt",
        "Authors": "By Campbell, Jeff",
        "Description": "The bestselling author of Speed Cleaning, Clutter Control, and Spring Cleaning--with combined sales of over one million copies--returns with his Clean Team to answer all your cleaning questions in the ultimate cleaning bible.Everything you ever wanted to know about cleaning but were afraid to ask is expertly answered for you in Talking Dirt, a compilation of the 157 most frequently asked cleaning questions. Get the dirt on:How to remove stains from graniteHow to clean a leather couchHow to get rid of the mildew that builds up in the grout around shower tilesHow to dust a dried flower arrangementAnd 153 other cleaning quandaries!In an easy-to-read Q&A format, organized by room, and based on his years of experience cleaning houses, cleaning guru Jeff Campbell offers no-nonsense advice designed to save you time, energy, and money--and to take the dirty work out of your toughest cleaning problems.",
        "Category": " House & Home , Cleaning & Caretaking",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Heaven at Home: Establishing and Enjoying a Peaceful Home",
        "Authors": "By Plowman, Ginger",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Shepherd Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Cat Blessings",
        "Authors": "By Lovka, Bob and Broderick, Setsu",
        "Description": "",
        "Category": " Pets , Cats , General",
        "Publisher": "Lumina Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Smart Organizing: Simple Strategies for Bringing Order to Your Home",
        "Authors": "By Felton, Sandra",
        "Description": "For busy moms, organizing is something that is always on the to-do list but never gets scratched off.  In this new book from a trusted organizing expert, readers discover the key to turning a chaotic house into a clutter-free home in no time at all. In order to do this she teaches three simple concepts: consolidate, condense, containerize.  Then, once a house is in its prime, just identify and maintain the most important 20% of household tasks and the house will never be a mess again.  From chore charts to making cleaning a fun family task, Smart Organizing is packed full of commonsense tips from other moms, websites and books that will inspire the reader to start today, one closet at a time.",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "InterCourses: An Aphrodisiac Cookbook",
        "Authors": "By Fink, Ben (PHT), Hopkins, Martha, and Lockridge, Randall",
        "Description": "Suggests recipes featuring ingredients considered aphrodisiacs, including chocolate, asparagus, chiles, oysters, strawberries, honey, rosemary, pine nuts, avocados, and figs",
        "Category": " Cooking , General",
        "Publisher": "Terrace Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Enough: Discovering Joy through Simplicity and Generosity",
        "Authors": "By Hamilton, Adam",
        "Description": "Money has great power in our lives. Used wisely, it is one key to accomplishing our goals, providing for our needs, and fulfilling our life purpose. In recent years, many of us ignored the wisdom of the past when it came to managing and spending our money. Credit card debt soared, savings rates plummeted, and our home equity became something to be tapped into and spent rather than a source of security in retirement. We felt an insatiable desire for more. And we found ourselves spending tomorrow’s money today in order to have what we hoped would satisfy. The result of all of this was not greater happiness and satisfaction, but greater stress and anxiety.Enough is an invitation to rediscover the Bible’s wisdom when it comes to prudent financial practices. In these pages are found the keys to experiencing contentment, overcoming fear, and discovering joy through simplicity and generosity. This book could change your life, by changing your relationship with money.“We Americans love our stuff. We’re living in a fast-paced, me-first, instant-gratification world, and it’s finally catching up to us. Debt is out of control, homes are in foreclosure ... even banks are going out of business. What the world needs today is the message of contentment and simplicity, and that’s exactly what Pastor Adam Hamilton delivers in Enough.”Dave Ramsey, New York Times Best-Selling Author and Nationally Syndicated Radio Talk Show Host“Once again, Adam Hamilton is leading the church; ‘Enough is enough’ was once a Wesleyan watchword. Adam breathes new life into the Wesleyan commitment to simplicity. Amid a culture of greed and conspicuous consumption Adam calls us to a biblically based, evangelical joy of having the faith to say ‘enough is enough.’”Bishop Will WillimonUnited Methodist Church, Birmingham Area“I pay close attention to whatever Adam Hamilton writes. His books are marked by extraordinary pastoral insight, biblical and theological depth, courage to speak the truth, and down-to-earth practicality. Enough comes like an antidote in the middle of a pandemic. I hope that classes, groups, couples, and individuals will use this book—and the economic crisis it addresses—as a challenge to get healthy again by deepening our discipleship in the vital area of money and possessions.”Brian McLaren, Author/Networker (brianmclaren.net)",
        "Category": " Religion , Christian Living , Social Issues",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The Babe with the Twistable Arm (#12)",
        "Authors": "By Stone, Hampton",
        "Description": "",
        "Category": "",
        "Publisher": "Paperback library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Rough Guide: Classical Music on CD",
        "Authors": "By Boyden, Matthew, Rye, Matthew, Broughton, Simon, and Staines, Joe (CON)",
        "Description": "Lists more than 400 composers, providing a biographical profile, a discussion of selected works, and a recommendation of recordings",
        "Category": " Music , Genres & Styles , Classical",
        "Publisher": "Rough Guides",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Celebrating the Spirit of Christmas",
        "Authors": "By Coffey, Tim (ILT)",
        "Description": "",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "A Pocket Catechism for Kids",
        "Authors": "By Aquilina, Mike and Stubna, Kris D.",
        "Description": "",
        "Category": " Religion , Education",
        "Publisher": "Our Sunday Visitor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Grandma's Dead: Breaking Bad News with Baby Animals",
        "Authors": "By McCall, Amanda and Schwartz, Ben",
        "Description": "Avoid the messy confrontations that accompany delivering bad news personally and let one of these cute baby animal postcards deliver the devastating message for you.Are you afraid to tell your girlfriend that her ass looks fat? Do you need to explain to your nephew that dreams don't come true? Why not let a cute, fuzzy bunny do it for you! We understand how hard it is to tell someone that you're sleeping with his wife, so let a photograph of a duckling sleeping on a teddy bear soften the blow. These perforated postcards answer all of your cowardly prayers—you'll finally be able to tell the truth without ever conquering your fear of confrontation. Let these adorable baby animals supply a silver lining to any bad situation and avoid, a long, tearful afternoon explaining why daddy's never coming home.",
        "Category": " Humor , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Amazing History Facts",
        "Authors": "By Harrison, Paul (EDT), Wright, Nicola (EDT), Matthews, Rupert, Tames, Richard, Linclon, Margarette, Corbridge, Fiona, Turner, Dee (EDT), and Mitchell, Fiona (EDT)",
        "Description": "Ancient civilizations, the warriors of old, explorers who faced incredible danger, and the remarkable human-made and natural wonders of the world are among the hundreds of fascinating topics included in this beautifully illustrated volume on world history.",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Entertaining with Appetizers",
        "Authors": "By HP Books",
        "Description": "Provides recipes for buffets, canapes, hors d'oeuvres, beverages, and candies, and includes suggestions for sandwiches, spreads, dips, and pates",
        "Category": " Cooking , General",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Reduce Me to Love: Unlocking the Secret to Lasting Joy",
        "Authors": "By Meyer, Joyce",
        "Description": "",
        "Category": " Fiction , Romance , General",
        "Publisher": "Harrison House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Ellery Queen's Crimes and Consequences",
        "Authors": "By Ellery Queen",
        "Description": "",
        "Category": "",
        "Publisher": "Davis Publications, Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Chester's Way (Viking Kestrel picture books)",
        "Authors": "By Henkes, Kevin",
        "Description": "Chester and Wilson share the same exact way of doing things, until Lilly moves into the neighborhood and shows them that new ways can be just as good.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    }
]