[
    {
        "Title": "That's So Raven: What You See is What You Get",
        "Authors": "By unknown",
        "Description": "",
        "Category": " Young Adult Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Bolt",
        "Authors": "By Francis, Dick",
        "Description": "After a number of horses are shot by someone using a weapon called a \"humane killer\" steeplechase jockey Kit Fielding vows to stop the killing",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Nights of Rain and Stars",
        "Authors": "By Binchy, Maeve",
        "Description": "Four strangers, with nothing in common but a need to escape, meet in a Greek taverna high above the small village of Aghia Anna. From Ireland, America, Germany and England, they have each left their homes and old lives, when a shocking tragedy throws them unexpectedly together.Fiona is a young nurse, trying to make her family understand her need to follow her own path. Thomas desperately misses his young son and fears that his ex-wife will come between them. Elsa abruptly left her career as a television presenter, but someone from her past refuses to let her go. And shy, quiet David is determined to make a stand against his overbearing father. With these four is Andreas, the taverna owner, who badly misses the son who left home nine years ago and has never returned.Nights of Rain and Stars is the story of one summer and four people, each with a life in turmoil. With the help of Vonni, a middle-aged Irish woman who lives in the village and is now a near-native, they find solutions - though not necessarily the ones they anticipated.",
        "Category": " Fiction , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Sanctuary",
        "Authors": "By Roberts, Nora",
        "Description": "Sanctuary. Successful photographer Jo Ellen Hathaway thought she had escaped that house long ago. It was where she spent her loneliest years, after her family was shattered by the sudden and unexplained disappearance of her mother. Yet the sprawling southern resort off the coast of Georgia continues to haunt her dreams.Even more haunting are the pictures that someone is sending her - strange close-ups, candid shots, and finally, the most shocking and heartbreaking portrait of all a photograph of her long-lost mother...naked, beautiful, and dead.Now Jo realizes that it is time to return to Sanctuary. The island inn, run by her bitterly estranged family, brings back painful memories as she is enmeshed once again in the troubled relationships she has struggled so long and hard to forget. With the help of one man, she must learn the truth about who is stalking her - and about the tragic past that torments her family still. But the menace that drove Jo back to Sanctuary has followed her there. And those on the island will learn that Sanctuary may be the most dangerous place of all....",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Kitchen Decorating Ideas and Projects",
        "Authors": "By Better Homes and Gardens Books (EDT) and Hallam, Linda (EDT)",
        "Description": "Complemented by more than one hundred full-color photographs, this helpful decorating guide presents a host of  ideas on how to create a stylish but effective kitchen to suit any taste or budget, offering a variety of decorative and space-saving solutions for storage, display, and work surfaces and including detailed instructions for eighteen how-to decroating projects. Original. 40,000 first printing.",
        "Category": " House & Home , Decorating",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Thank you, Jackie Robinson",
        "Authors": "By Barbara Cohen",
        "Description": "A fatherless white boy, who shares with an old black man an enthusiasm for the Brooklyn Dodgers and first baseman, Jackie Robinson, takes a ball autographed by Jackie to his elderly friend's death bed.",
        "Category": "",
        "Publisher": "Lothrop, Lee and Shepard Books",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Making of a Continent",
        "Authors": "By Redfern, Ron",
        "Description": "Illustrates and explains the geological history of North America and traces its impact on the continent's natural and human history",
        "Category": " Science , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "What Would You Do? (American Girl)",
        "Authors": "By Bendell, Norm (ILT) and Criswell, Patti Kelley",
        "Description": "A companion to The Care & Keeping of You is filled with quizzes that ask real-life questions and give answers that help girls understand their own problem-solving skills. Original.",
        "Category": " Juvenile Nonfiction , Social Topics , General",
        "Publisher": "American Girl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Berenstain Bears and the Truth",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "This classic Berenstain Bears story is a perfect way to teach children about the importance of honesty!Come for a visit in Bear Country with this classic First Time Book® from Stan and Jan Berenstain. When Mama goes to the market, Brother and Sister play soccer in the house . . . and end up breaking a lamp! When Mama asks them what happened, they tell her a series of whoppers that just get bigger and bigger. Will they ever tell her the truth?",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Dinosaurs Of Jurassic Park (All Aboard Reading)",
        "Authors": "By Larson, Wendy",
        "Description": "Provides a close-up look at the dinosaurs--created by means of advanced biotechnology--that are the main attraction at a prehistoric theme park. Original. Movie tie-in. All ages.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "The Horizon Concise History of Germany",
        "Authors": "By Russell, Francis",
        "Description": "",
        "Category": "",
        "Publisher": "American Heritage Pub. Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Balloons: and Other Poems",
        "Authors": "By Chandra, Deborah and Bowman, Leslie (ILT)",
        "Description": "A rich and diverse collection of twenty-four poems invites children to delight in the physical world around them.  A rich and diverse collection of twenty-four poems invites children to delight in the physical world around them.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Farrar, Straus and Giroux (BYR)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The food processor cookbook: New ideas for easy and elegant food preparation, 250 tested recipes",
        "Authors": "By Sunbeam Corporation",
        "Description": "",
        "Category": "",
        "Publisher": "Dorison House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Junie B. Jones and Her Big Fat Mouth (Junie B. Jones, No. 3)",
        "Authors": "By Brunkus, Denise (ILT) and Park, Barbara",
        "Description": "“Hilarious. Barbara Park makes reading fun.” —Dav Pilkey, author of Dog Man Barbara Park’s #1 New York Times bestselling chapter book series, Junie B. Jones, has been keeping kids laughing—and reading—for more than twenty-five years. Over 65 million copies sold!   Meet the World’s Funniest Kindergartner—Junie B. Jones! Junie B.’s having a rough week. First she got punishment for shooting off her mouth in kindergarten. And now she’s in big trouble again! ’Cause Monday is Job Day, and Junie B. told her class that she’s got the bestest job of all. Only, what the heck is it?   USA Today: “Junie B. is the darling of the young-reader set.”   Publishers Weekly: “Park convinces beginning readers that Junie B.—and reading—are lots of fun.”    Kirkus Reviews: “Junie’s swarms of young fans will continue to delight in her unique take on the world. . . . A hilarious, first-rate read-aloud.”    Time: “Junie B. Jones is a feisty six-year-old with an endearing penchant for honesty.”",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Scoop Saves the Day (Bob the Builder)",
        "Authors": "By Redmond, Diane (EDT) and Hot Animation (ILT)",
        "Description": "CAN THEY RESCUE? YES, THEY CAN!  Oh, no! Pilchard's in trouble when she climbs a tree and ends up dangling over a duck pond. Bob must come to her rescue, but no one knows where he is. Now it's up to Bird and Scoop to save the day!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Good News Travels Fast",
        "Authors": "By Flinn, Lisa and Younger, Barbara",
        "Description": "Good new does travel fast as Sarah learns that Jesus is alive! She tells her friend, who tells another, who tells another.  And each time, the news bearer shares a lesson learned from Jesus' life. Imagine Sarah's surprise when someone tells her the good news she has already shared! Soon everyone in Jerusalem knows the good news of the Resurrection.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Mr. Radagast Makes an Unexpected Journey (Weekly reader books)",
        "Authors": "By Nastick, Sharon",
        "Description": "",
        "Category": "",
        "Publisher": "Crowell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Just Grandpa and Me (Little Critter) (Look-Look)",
        "Authors": "By Mayer, Mercer and Mayer, Mercer (ILT)",
        "Description": "Join Little Critter and his grandpa in this big-city adventure!Family fun and love are in abundance when Little Critter and his grandfather head to the big city! Little Critter sure is little, but he’s a big help to his grandfather. Little Critter holds his hand so his grandfather doesn’t get lost, demonstrates how to go up and down the store’s escalator, and even shows grandpa how to use chopsticks for the first time! This sweet and charming picture book is perfect for children ages 3 to 7.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Tom Sawyer Detective",
        "Authors": "By Twain, Mark",
        "Description": "When Tom and Huck are invited to stay on Tom's uncle's farm in Arkansas, they jump at the opportunity to escape the tedium of a long winter at home. But before they can get there, a chance encounter on a steamboat downriver leads to a complex plot of diamond heists, mistaken identity and murder.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Masterpieces of World Literature",
        "Authors": "By Magill, Frank M.",
        "Description": "Based on the familiar  Masterplots , contains three to four critical summaries and descriptions of 270 major works from ancient epics to modern plays. Includes dates of authorship, settings, themes, plots, and principal characters (with pronunciations). Magill is well respected by librarians as an anthologist. The articles are by literature professors. No bibliography. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "8.04",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Nelson and the Hamiltons",
        "Authors": "By Russell, Jack",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Sunset Midwestern Landscaping Book",
        "Authors": "By Bergmann, Craig (EDT)",
        "Description": "",
        "Category": " Gardening , Landscape",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Earthquake",
        "Authors": "By Christopher, Matt and Lewin, Ted",
        "Description": "Criticized beyond endurance by his camp coach, slow learner Jeff Belno determines to prove himself by travelling home with his horse Red through the Adirondacks",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Little, Brown & Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1975"
        }
    },
    {
        "Title": "Coyote Waits",
        "Authors": "By Hillerman, Tony",
        "Description": "The car fire didn't kill Navajo Tribal Policeman Delbert Nez—a bullet did. And the old man in possession of the murder weapon is a whiskey-soaked shaman named Ashie Pinto. Officer Jim Chee is devastated by the slaying of his good friend Del, and confounded by the prime suspect's refusal to utter a single word of confession or denial.Lieutenant Joe Leaphorn believes there is much more to this outrage than what appears on the surface, as he and Jim Chee set out to unravel a complex weave of greed and death that involves a historical find and a lost fortune. But the hungry and mythical trickster Coyote is waiting, as always, in the shadows to add a strange and deadly new twist.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.85",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Painting Techniques & Faux Finishes",
        "Authors": "By Hennigs, Louise and Niven, Marina",
        "Description": "Use paint to create a personal decorating statement. This book teaches not only the basics of paint use and color, but walks readers through the techniques (such as dragging, ragging, sponging, stippling and splattering) needed for a wide range of room altering finishes.",
        "Category": " House & Home , Decorating & Furnishings",
        "Publisher": "Creative Publishing International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Yoga For Your Life: A Practice Manual of Breath and Movement for Every Body",
        "Authors": "By Pierce, Margaret D. and Pierce, Martin G.",
        "Description": "\"Yoga is the most powerful system of stress management, but it is also...a system for transforming our awareness and quieting down our mind and body to experience inner sources of peace, joy, and well-being. I highly recommend Yoga For Your Life as a practical and clear guide...\"--Dean Ornish, M.D. Over 400 beautiful color photographs present the spirit of yoga adapted to fit the American lifestyle. Along with eight progressive, easy-to-follow lessons are innovative methods for making yoga work for you every day--to wake up, calm anxiety, focus the mind, and prevent insomnia. Even if you're a beginner, you can pick up this book and start practicing right now! 160 pages (all in color), 8 1/2 x 11.",
        "Category": " Health & Fitness , Yoga",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Mastering the Art of Drawing by Ian Sidaway (2005-05-03)",
        "Authors": "By Ian Sidaway",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "It began with Jenny;: A history of air transportation",
        "Authors": "By Everds, John",
        "Description": "Traces the history of air travel and the airlines from Jenny, the first airplane to carry mail, to the huge 747's of today.",
        "Category": "",
        "Publisher": "Hubbard Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "McNally's Risk",
        "Authors": "By Sanders, Lawrence",
        "Description": "The unbeatable master of suspense returns, in a wickedly wayward case of artists, models, and murder.If larceny is good for the soul, Palm Beach must be confidence heaven - so discovers Lawrence Sanders's sleuth-about-town Archy McNally in his third boffo baffler, McNally's Risk. Hired by a formidable matron to investigate the shadowy bona fides of her bubble-headed son's beloved, Archy is wowed by the enigmatic innamorata's purity and pulchritude. But when the artist for whom she posed is killed, McNally's job takes on a decidedly dangerous turn, and he begins to suspect the demure damsel might be both a poser and a poseur.Fighting his way through copious deaths and fiendish scams, Archy pieces together elements of a strange and grisly puzzle, including: a sealed letter containing a horrifying secret; a nude dancer who knows more than she reveals; a missing portrait someone would kill for; and a butterfly tattoo in a very private place, which could be the key to the murder spree.Lawrence Sanders's latest Palm Beach thriller fairly sizzles with greed, glitz, gals, and gore. And it proves, once again, that Archy McNally is, as Cosmopolitan described him, \"as amusing and rich as Dorothy Sayers' great creation, Lord Peter Wimsey.\"",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Official Guide to Colonial Williamsburg",
        "Authors": "By Olmert, Michael",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Colonial Williamsburg Foundation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Windows with Style: Do-it-yourself window treatments",
        "Authors": "By The Editors of Creative Publishing international, The Home Decorating Institute",
        "Description": "Set the style for every room in your house with fabulous, easy-to-make window treatments. Beautiful do-it-yourself ideas to help you create a custom-made look for a fraction of the cost!Step-by-step directions and full color photos guide you through the entire process of design, sewing and installation. Features a wide range of styles and solutions for standard or unique windows.",
        "Category": " House & Home , Reference",
        "Publisher": "Quarry Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Structures: The way things are built",
        "Authors": "By Hawkes, Nigel",
        "Description": "Science writer Hawkes provides informative, non-technical accounts of the origin, design, and construction of 43 of the most ambitious structures ever built the oldest being by the Egyptians and the newest the huge scientific instruments in Chile and Switzerland designed to study the infinities of space and the infinitesimal structure of the atom. Even the illustrations are awesome some 500 photographs, diagrams, drawings and etchings, all in color. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "MacMillan",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Bulbs",
        "Authors": "By Sunset Books (COR), Edinger, Philip, and Lang, Susan",
        "Description": "",
        "Category": " Gardening , Flowers , Bulbs",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Missing Pieces",
        "Authors": "By Fielding, Joy",
        "Description": "Keenly observed psychological detail and breathtaking suspense combine to make this Joy Fielding's best novel yet, sure to appeal to fans and win new readers for the bestselling author of See Jane Run and Don't Cry Now.Family therapist Kate Sinclair repairs other people's troubled lives, all the while reveling in her stable marriage and handsome home.  But there are demons in her past that will not stay buried forever, and the carefully constructed edifice of her life comes tumbling down when her half-sister JoLynn announces her plans to marry Colin Friendly, a man on trial for the brutal murders of thirteen Palm Beach women.Kate soon finds herself embroiled in a desperate struggle to protect her family from Colin's increasingly sinister advances.  To make matters worse, her aging mother is losing her tenuous grip on reality and her rebellious daughter Sara is falling under JoLynn's wayward influence--a development that would worry Kate in the best of times, but which in this case might well prove deadly.  As the strain begins to tear Kate's marriage apart, into the fray comes the smooth-talking Robert, her high-school crush, who soon displays an unhealthy interest in the results of Colin Friendly's trial.As Kate Sinclair slowly slips across the razor-thin line separating ordinary life from unspeakable terror she realizes that there is no one she can trust, nowhere she can run...and no way she can deny that she and her loved ones may be the next targets of a demented serial killer.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Secret on Ararat (Babylon Rising, Book 2) (Lahaye, Tim F.)",
        "Authors": "By LaHaye, Tim F. and Phillips, Bob",
        "Description": "Tim LaHaye, creator of the phenomenally successful Left Behind® books, continues his newest top-ten New York Times bestselling series: Babylon Rising. The heroic Michael Murphy—“cool, brainy, sexy, and valiant”—hurtles into his second whirlwind adventure in pursuit of Biblical artifacts.In Babylon Rising Tim LaHaye began an adventure series that he calls even more exciting than his 50-million-plus-copy bestselling Left Behind series. Readers agreed, as the novel debuted as a top-ten New York Times bestseller.         Now, in the second Babylon Rising novel, Biblical scholar, archaeologist, professor, and hero for our times Michael Murphy is in pursuit of one of the most mysterious and sought-after of all Biblical artifacts, Noah’s Ark. As Murphy undertakes his death-defying quest to ascend Mount Ararat, he will discover dramatic revelations of Biblical prophecies and be drawn even closer to the most terrifying evil about to be unleashed on all mankind.With The Secret on Ararat following close on the heels of Glorious Appearing, the fastest-selling Left Behind novel ever, Tim LaHaye will further prove to be one of the most fascinating and popular storytellers of our time.",
        "Category": " Fiction , Religious",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Rummies",
        "Authors": "By Benchley, Peter",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Peace Out, Dawg! Tales from Ground Zero",
        "Authors": "By Trudeau, G. B.",
        "Description": "As 9-11 shakes the Doonesbury world, many of its denizens are drawn inexorably toward Ground Zero--Mike to attend a memorial service for a former employer; B.D., reactivated for crowd control and celebrity tourism; Marcia Feinbloom to hit on firefighters; and Zonker to deliver potent fruitcakes to weary rescue workers. Those on the home front are no less affected by events: \"I no longer care what Madonna had for breakfast,\" laments Boopsie, proof positive that Everything Has Changed.Half a world away, in Al-Qaeda Qountry, a burka-clad Roland Hedley is captured by a freelance warlord, then wounded by a can of Spam during a massive friendly food drop. Feyzabad Station Chief Havoc's effort to rescue the downed journalist speaks well for the new, improved CIA, which has somehow managed to parlay its \"massive\" intelligence failures into cult status on the nation's campuses. How else to explain Jeff Redfern's new internship with \"Acme Imports\"--and his sudden affinity for shaken-not-stirred libations?Meanwhile, former inside trader Phil Slackmeyer watches from his deathbed as the effort to smoke out evildoers expands to include the entire management team of Enron. Prominent among them is \"Jimmy Jack Jumbo\" Andrews, head of over 400 Caymans-based businesses, who calls his old friend to ask the question on many an ex-exec's mind: \"What's prison like?\" And back at the White House pressroom, NPR attack-dog Mark has questions of his own, like, \"What time will you be launching the cover-up?\" and \"Will there be a lunch?\" Yes, excavating Enron's smoking crater will be a long and dirty job--even if the president barely knows \"Mr. Lay,\" the disgraced CEO with whom he exchanged 350 letters. As Dubya assures us, \"I did not have political relations with that man.\"",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "There's No Place Like (a Mobile) Home For The Holidays",
        "Authors": "By Foxworthy, Jeff",
        "Description": "You might be a redneck if…You've ever left Santa Claus a PBR and a Slim Jim.You've ever done your Christmas shopping at a truck stop.The neighbors started a petition over your Christmas lights.Your nativity scene has people wearing camouflage.Your outdoor Christmas decoration has a misspelled word.You ever gift wrapped a tire.Foxworthy's version of this Christmas classic is one of the most played, and best-selling Christmas records every season. This book will be a wonderful holiday gift for the redneck in all of us.",
        "Category": " Humor , General",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Boston Red Sox Fan Book",
        "Authors": "By Cohen, Richard M., Neft, Michael L., Carroll, Bob, and Neft, David S. (EDT)",
        "Description": "Little-known facts, statistics, stories, quotes, nicknames, all-time leaders, rosters, puzzles, and more from over one hundred years of Red Sox historyThe Boston Red Sox were originally named the Pilgrims—but for over one hundred years they have always been Beantown's favorite team, with a history that has been celebrated and mourned by generations of fans.If you love the Red Sox, you'll find hours of challenging trivia in this book. Packed with text and information, it includes: *A history of the Red Sox from their origins to the present * Trvia questions designed to test your baseball memory * Corssword puzzles, word games, unusual quotes, funny nicknames, and anecdotes about the Sox *Complete all-time Red Sox roster of players, with stats * Comprehensive leader tables for batters and pitchers *Award winners, Hall of Famers, and other honors *And much more!Do You Know...- Who was the first pitcher to throw a perfect game in the twentieth century?- Who decided to turn Babe Ruth into an outfielder?- What was Ted Williams's batting average with one day left in the 1941 season: .406, .399, .3996, or .4001? What happened on that day?- How many batting titles did Carl Yastrzemski win in his career?- Which team Roger Clemens's had 20 strikeouts against in a 1986 game?Bring this book to Fenway, or keep it next to your favorite armchair at home, to liven up commercial breaks and rain delays. In no time you'll be an expert on Red Sox trivia!",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Town & Country Social Graces: Words of Wisdom on Civility in a Changing Society",
        "Authors": "By Brosseau, Jim (EDT)",
        "Description": "For more than 150 years, Town & Countryhas stood for quality and refinement. So who better to offer sound guidance on leading a civilized life in a world of eroding social graces? Here, 50 of the keenest and wittiest observers of our changing culture put forward their incisive—and thoroughly modern—views on sidestepping today’s most prevalent, perilous social landmines. From such topics as cell phone and E-mail etiquette to guilt-free apologies, these 64 timely essays offer astuteness without stuffiness. Relish the humor and insights of such writers as Jonathan Alter, Anthony Bourdain, Jay McInerney, Sue Miller, Peggy Noonan, Cokie Roberts, Jane Smiley, Wendy Wasserstein, and many others. The 10 new contributions include: “Polite or Passé,” by William Zinsser; “To Make a Long Story Short,” by Patricia Marx; and “Thanks for the Compliments,” by Jeanne Wolf.",
        "Category": " Reference , Etiquette",
        "Publisher": "Hearst",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Big Ideas For Small Spaces: Featuring JoJo's Notebook from JoAnn Liebeler",
        "Authors": "By Lansing, David and Liebeler, JoAnne",
        "Description": "Explains how to get the most out of limited square footage by utilizing easy-to-follow design principles to create the illusion of additional space, to enhance functionality, and to offer ingenious solutions for a variety of storage and design problems. Original. 30,000 first printing.",
        "Category": " House & Home , Decorating",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Multiple Choice",
        "Authors": "By Cook, Claire",
        "Description": "March Monroe endures her daughter's animosity when they wind up sharing a radio station internship, a situation that is complicated by her tired marriage, her angry adolescent son, and a mid-life crush. By the author of Must Love Dogs. 60,000 first printing.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Canvas Decor",
        "Authors": "By Delorie, Bunny",
        "Description": "Great innovations in do-it-yourself home decor are here! Canvas is versatile, easy to work with, and most importantly, inexpensive. Authors Bunny Delorie and Janet Newell, both experts in the craft and home decor industries, team up to offer Canvas Décor, with 25 plus fun and original projects for use in the home. Crafters will learn to sew, stencil, paint, and embellish canvas for an amazing result.In this book, readers will find step-by-step instructions and photos for completing inventive projects that will add a touch of flair to their home decor. Bamboo and palm tree projects include a tri-folding screen with faux bamboo legs, a realistic-looking canvas plant, canvas pillows faux finished to look like leather, and a tropical leaf wall hanging. There are also faux fur and animal projects, such as an animal print foot stool; \"Italian garden\" kitchen projects, such as vegetable canvas panels and faux tile; outdoor living projects like a patio floorcloth and directors chairs; children's projects like bean bags, a rolled canvas checker board, and more!",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Krause Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "The Complete Guide to Home Storage (Black & Decker Home Improvement Library)",
        "Authors": "By Gorton, Paul (EDT)",
        "Description": "At any given moment, your home probably contains thousands of moveable items, some large but most small: dishes and drain cleaners, blankets and baby books, socks and sleeping bags, hammers and hotdog buns, candles and can-openers and cribbage boards. In a perfect world, most of these items have homes–places where they’re stored outside daily view but where you can find them at a moments notice. In our imperfect world, though, there are probably hundreds of items that are nomads, transients. They have temporary, exposed residences in jumbled drawers, on top of cabinets, across desktops, on window ledges. How often have you looked long and hard for an item in every logical storage place, only to find that it’s been hiding in plain view, in the last place you’d expect? The goal of this book is to help you bring order to this jumble, to tame and civilize the hoards of small and large household items begging for permanent, logical storage. To do this, we’ll give you dozens of easy-to-build storage projects. Each is designed for adaptability and versatility, so you can use it for a variety of different purposes in various rooms. Some projects may require small alterations, but others can be built exactly as directed. Before getting to the projects, we give you a section on planning and assessing, and a section on general building techniques that will be useful in many different projects. After that, it’s off to the storage races, with more than 50 projects, ranging from basic wall cabinets to innovative racks for storing CDs and home electronics. While many projects use standard lumber and other building pipe and electrical conduit. Have fun with these projects. Take the time to plan them out, and take pride in them when you’re finished. Remember: When you increase the efficiency of your storage space, you create a more comfortable living environment for yourself and your family.       Innovative, attractive projects that can provide efficient storage throughout your home     Easy to follow, step-by-step instructions for projects at all skill levels     Shows how to frame, finish and organize a brand-new closet     Variations and ideas sections to help you adapt projects to your needs     Detailed techniques section for working with power and hand tools",
        "Category": " House & Home , Reference",
        "Publisher": "Creative Publishing International",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Farmer's Market Cookbook (Making the most of fresh and seasonal produce with over 140 recipes)",
        "Authors": "By Ysanne Spevack",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The summer stargazer: Astronomy for absolute beginners",
        "Authors": "By Claiborne, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Coward, McCann & Geoghegan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Barbara Delinsky, Three Complete Novels: A Woman Betrayed / Within Reach / Finger Prints",
        "Authors": "By Delinsky, Barbara",
        "Description": "An anthology of three novels by the best-selling, award-winning novelist features A Woman Betrayed, Within Reach, and Finger Prints.",
        "Category": " Fiction , General",
        "Publisher": "Wings",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "What Shall I Make (What Shall I Do Today Series)",
        "Authors": "By Watt, Fiona, Allman, Howard (PHT), Gibson, Ray, Allman, Howard (ILT), Chaisty, Chris (ILT), and Watt, Flona (EDT)",
        "Description": "Presents instructions for pipecleaner bangles, paper fish, lacy cards, vegetable people, furry snakes, paper flowers, and other crafts",
        "Category": " Juvenile Nonfiction , Art , Techniques",
        "Publisher": "Edc Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "The Last Days (Political Thrillers Series #2)",
        "Authors": "By Rosenberg, Joel",
        "Description": "Osama bin Laden is dead. Saddam Hussein is buried. Baghdad lies in ruins.Now the eyes of the world are on Jerusalem as Jon Bennett--a Wall Street strategist turned senior White House advisor--his beautiful CIA partner Erin McCoy and the U.S. Secretary of State arrive in the Middle East to meet with Palestinian leader Yasser Arafat.On the table: a dramatic and potentially historic Arab-Israeli peace plan, of which Bennett is the chief architect. At the heart of the proposed treaty is the discovery of black gold deep underneath the Mediterranean-a vast and spectacular tract of oil and natural gas that could offer unprecedented riches for every Muslim, Christian, and Jew in Israel and Palestine.With the international media closely tracking the story, the American message is as daring as it is direct: Both sides must put behind them centuries of bitter, violent hostilities to sign a peace treaty. Both sides must truly cooperate on drilling, pumping, refining, and shipping the newly found petroleum. Both sides must work together to develop a dynamic, new, integrated economy to take advantage of the stunning opportunity. Then--and only then--the United States will help underwrite the billions of dollars of venture capital needed to turn the dream into reality.But in the shadows lie men whose hearts are filled with evil--men who do not relish a post-Saddam era, men for whom the prospect of a Palestinian peace accord with Israel goes against everything for which their fathers have fought and died. Such men--and the countries that finance them--are ready to do anything necessary to slaughter those who stand in their way. The clock is ticking. Can Bennett, McCoy, and the American President make peace before the Middle East once again erupts in war?",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Dixie Rising: How the South Is Shaping American Values, Politics, and Culture",
        "Authors": "By Applebome, Peter",
        "Description": "In “one of the best portrayals of the South in years” (Washington Post), the Atlanta bureau chief of the New York Times travels from catfish farms and neo-Confederate gatherings to casinos and country music festivals and examines the reasons behind the region’s growing influence. Index.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Decorating Kids' Rooms: Nurseries to Teen Retreats (Better Homes & Gardens)",
        "Authors": "By Hallam, Linda",
        "Description": "A decorating handbook for the parents of babies through teenagers with an emphasis on safety and planning and designing rooms that grow up with a child.130 full-color photos to inspire and teach how-to techniques.30 projects with detailed instructions as well as decorating projects for teens.Addresses health concerns with information boxes and a special section on rooms for children with asthma or allergies.Features the latest in nursery and furniture safety.An expanded techniques chapter provides information on painting and wallpapering basics, including specialty finishes.",
        "Category": "",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Military Errors of World War Two (Cassell Military Paperbacks)",
        "Authors": "By Macksey, Kenneth",
        "Description": "Delay, failure, and, ultimately, defeat: those were the results of these 16 crucial mistakes by military and political leaders. From Hitler's postponement of the invasion of Britain, to ineptitude in the Western desert, from errors in the Battle of the Atlantic to the Japanese mistakes in the Pacific, see how an entire army's downfall can hinge on one momentous decision. A telling account of poor judgment--and of greed, arrogance, complacency, and misused manpower, even by those who tasted victory elsewhere.",
        "Category": " History , Military , World War II",
        "Publisher": "Cassell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Cassell Military Classics: Military Mavericks: Extraordinary Men of Battle",
        "Authors": "By Rooney, David",
        "Description": "They are the unforgettable leaders who inspired their troops, the tacticians who devised the wiliest strategies, the military mavericks who won the wars. Although more than 2000 years separate Alexander the Great from Giap, the single-minded commander of the North Vietnamese forces that defeated the U.S., each of these outstanding characters has something to teach us about military history. They include Shaka Zulu, Stonewall Jackson, Garibaldi, Lawrence of Arabia, and Patton--12 in all.",
        "Category": " History , Military , General",
        "Publisher": "Cassell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Explore america: historic places",
        "Authors": "By Reader's Digest Association",
        "Description": "Thirtyfive historical places are covered in this colorful, compelling travel guide, including colonial settlements, pioneer outposts, war sites, and goldrush locales in the West. Original.",
        "Category": " Travel , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Dambusters Raid (Cassell Military Paperbacks)",
        "Authors": "By Sweetman, John",
        "Description": "Operation Chastise - the Dambusters Raid, as it became known - undertaken by 19 Lancasters of 617 Squadron on the night of May 16 1943, was the most audacious bombing raid of the Second World War. For the loss of 11 aircraft, the Mohne and Eder dams in Germany's industrial heartland were breached, and a famous if controversial victory won. John Sweetman's book is the most comprehensive account of this legendary mission, from the development of Barnes Wallis' 'bouncing bomb' (in reality a revolving depth-charge) to every moment of the raid itself, under the charismatic command of Guy Gibson, VC.",
        "Category": " History , Military , Aviation",
        "Publisher": "Cassell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Captain's Command",
        "Authors": "By Myers, Anna",
        "Description": "Gail finds it difficult to relate to Uncle Ned since he is bitter about the war injury that made him blind and has given up hope that her father is still alive, but Gail persists in being positive and looks to her golden retriever to improve Uncle Ned's state of mind. Reprint.",
        "Category": " Juvenile Fiction , Historical , United States , 20th Century",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Maximum City: Bombay Lost and Found",
        "Authors": "By Mehta, Suketu",
        "Description": "A brilliantly illuminating portrait of Bombay and its people–a book as vast, diverse, and rich in experience, incident, and sensation as the city itself–from an award-winning Indian-American fiction writer and journalist.A native of Bombay, Suketu Mehta gives us a true insider’s view of this stunning city, bringing to his account a rare level of insight, detail, and intimacy. He approaches the city from unexpected angles–taking us into the criminal underworld of rival Muslim and Hindu gangs who wrest control of the city’s byzantine political and commercial systems . . . following the life of a bar dancer who chose the only life available to her after a childhood of poverty and abuse . . . opening the doors onto the fantastic, hierarchical inner sanctums of Bollywood . . . delving into the stories of the countless people who come from the villages in search of a better life and end up living on the sidewalks–the essential saga of a great city endlessly played out.Through it all–as each individual story unfolds–we hear Mehta’s own story: of the mixture of love, frustration, fascination, and intense identification he feels for and with Bombay, as he tries to find home again after twenty-one years abroad. And he makes clear that Bombay–the world’s largest city–is a harbinger of the vast megalopolises that will redefine the very idea of “the city” in the near future.Candid, impassioned, funny, and heartrending, Maximum City is a revelation of an ancient and ever-changing world.",
        "Category": " History , Civilization",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Proverbs: Learning to Live Wisely (A Life Guide Bible Study)",
        "Authors": "By Mouser, William E.",
        "Description": "",
        "Category": " Religion , Biblical Studies , Old Testament",
        "Publisher": "Intervarsity Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "The Gourmet Potluck: Show-Stopping Recipes for the Buffet Table",
        "Authors": "By Hensperger, Beth and Peterson, Scott (PHT)",
        "Description": "Yet another potluck invitation in the mailbox? This one-stop collection is the antidote to the what-should-I-bring woes. Organized seasonally and focusing on fresh ingredients (with lots of veggie options), THE GOURMET POTLUCK gives cooking for groups style, panache, and inspiration. From Super Bowl parties and summer barbecues to birthdays and bridal showers, catering vet Beth Hensperger dishes up ideas aplenty for every potluck occasion.The definitive guide to being the star of every potluck, with straightforward, sophisticated recipes scaled to serve 10 to 16 people.Features more than 50 main and side dish recipes and 20 full-color photographs.Each recipe includes prep timeline, serving dishes and utensils needed, transportation notes, and reheating requirements.Reviews\"The definitive guide to being the star chef at the next meal cooked by committee.\"-Cookbook Digest",
        "Category": " Cooking , Methods , Special Appliances",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "The Book of Gambling Games",
        "Authors": "By Diagram Group (EDT)",
        "Description": "This fat, pocket-sized guide explains the rules and strategies of more games of chance than any other book. Three basic forms of gambling receive close analysis: those like horse racing, which rely on knowledge, judgment, and skill; games such as roulette that demand a knowledge of the rules of pure chance; and diversions that combine luck and skill, including poker. Dice, tile games, and dominoes are covered, too.",
        "Category": " Games , Gambling , General",
        "Publisher": "Main Street",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Pocahontas (Junior Novelization)",
        "Authors": "By Ingoglia, Gina",
        "Description": "Narrates a story of romance and adventure, set against cultural conflict, as English settlers in the New World come into contact with the Indian people who live in what is now Virginia. Original.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Martin Sloane: A Novel",
        "Authors": "By Redhill, Michael",
        "Description": "A debut novel explores the mysteries of human love, the complexities of friendship, and the extraordinary power of art as it follows the evolving relationship between talented, Irish-born artist Martin Sloan and Jolene Iolas, a young American woman drawn first to his art and then to the man, from their first meeting to his mysterious disappearance and her search for him. Original. 25,000 first printing.",
        "Category": " Fiction , Literary",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Bicycling Magazine's Mountain Biking Skills: Skills and Techniques to Master Any Terrain",
        "Authors": "By Hewitt, Ben (EDT)",
        "Description": "Bicycling Magazine's Mountain Biking Skills by Ben Hewitt has been fully revised and updated to provide enthusiasts with all the tactics, tips, and techniques they need to master any type of terrain.Ride like a pro with help from the editors of Bicycling and Mountain Bike magazines. Learn the most effective ways to handle tough terrain, steer clear of hazardous obstacles, and even crash properly to avoid injury. Bursting with the latest strategies for riding faster and training better, this book will give mountain bikers the tools they need to be their best.",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Bringing Heaven Into Hell",
        "Authors": "By Carothers, Merlin R.",
        "Description": "",
        "Category": "",
        "Publisher": "Fleming H. Revell Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Squanto: A Warrior's Tale (Novelization)",
        "Authors": "By Fontes, Ron and Korman, Justine",
        "Description": "Squanto is kidnapped to England and put on display",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Pirates of the Caribbean: The Curse of the Black Pearl (The Junior Novelization)",
        "Authors": "By Trimble, Irene, Marks, Elliott (PHT), and Bramley, John (PHT)",
        "Description": "Readers can set sail for adventure with this full-length retelling of the latest live-action Disney film. They’ll follow every swashbuckling step as a brave young man teams up with a high-seas scoundrel to rescue the woman he loves from the clutches of a band of cursed pirates. This Junior Novelization features eight pages of full-color movie stills straight from the big screen!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Stuart Little: George & Stuart",
        "Authors": "By Fontes, Justine (ADP) and Fontes, Ron (ADP)",
        "Description": "Offers beginning readers an illustrated tale about the adventures of these two very different brothers and includes photographs from the new feature film from Columbia Pictures. Original. Movie tie-in.",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Just Me and My Little Brother (Little Critter) (Pictureback(R))",
        "Authors": "By Mayer, Mercer and Mayer, Mercer (ILT)",
        "Description": "Mercer Mayer’s Little Critter is thinking about all the things he and his new little brother will do together in this classic, funny, and heartwarming book. Whether the brothers go trick-or-treating, build a snowman, or ride bikes together, both parents and children alike will relate to this beloved story. A perfect way to celebrate the special bond between brothers!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Turn Your Passion Into Profits: How To Start The Business of Your Dreams",
        "Authors": "By Allon, Janet",
        "Description": "The how-to companion book to The Business of Bliss, this book explains the basics of starting your own small business, from writing a business plan to finding financial help, hiring staff, and more.",
        "Category": " Business & Economics , Entrepreneurship",
        "Publisher": "Hearst",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "America's Spectacular Northwest",
        "Authors": "By Rowe Findley, Robert W. Madden, Mark Miller, Cynthia Russ Ramsay, Bill Richards",
        "Description": "",
        "Category": "",
        "Publisher": "The National Geographic Society",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "From the Corner of His Eye",
        "Authors": "By Koontz, Dean R.",
        "Description": "Dean Koontz has been called \"America's most popular suspense novelist,\"* but that only begins to describe the rich variety and endless invention that characterize his work. Critics hail his impeccable craft and the artistry that has inspired the devotion of millions of fans around the world. He is unique among contemporary writers, venturing far beyond traditional boundaries to explore our deepest fears and most transcendent aspirations. Now, in From the Corner of His Eye, Koontz brings together his most powerful themes to draw readers into a spellbinding world made by a master at the top of his form -- a story rich in triumph and tragedy, joy and terror, love, hate, and profound meaning, played out by perhaps the most unforgettable cast of characters he has yet created.Bartholomew Lampion is born in Bright Beach, California, on a day of tragedy and terror, when the lives of everyone in his family are changed forever. Remarkable events accompany his birth, and everyone agrees that his unusual eyes are the most beautiful they have ever seen. On this same day, a thousand miles away, a ruthless man learns that he has a mortal enemy named Bartholomew. He doesn't know who Bartholomew is, but he embarks on a search that will become the purpose of his life. If ever he finds the right Bartholomew, he will deal mercilessly with him.And in San Francisco, a girl is born, the result of a violent rape. Her survival is miraculous, and her destiny is mysteriously linked to the fates of Barty and the man who stalks him.At the age of three, Barty Lampion is blinded when surgeons reluctantly remove his eyes to save him from a fast-spreading cancer.  As the growing boy copes with his blindness and proves to be a prodigy, his mother, an exceptional woman, counsels him that all things happen for a reason, that there is meaning even in his suffering, and that he will affect the lives of people yet unknown to him in ways startling and profound.At thirteen, Bartholomew regains his sight. How he regains it, why he regains it, and what happens as his amazing life unfolds results in a breathtaking journey of courage, heart-stopping suspense, and high adventure. His mother once told him that every person's life has an effect on every other person's, in often unknowable ways, and Barty's eventful life indeed entwines with others in ways that will astonish and move everyone who reads his story. People magazine has said that Dean Koontz has the \"power to scare the daylights out of us.\" In this, perhaps the most thrilling, suspenseful, and emotionally powerful work of his critically acclaimed career, Koontz does that and far more. He has created a compulsive page-turner that will have you at the edge of your seat, a narrative tour de force that will change the way you yourself look at the world.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Winner of the National Book Award: A Novel of Fame, Honor, and Really Bad Weather",
        "Authors": "By Willett, Jincy",
        "Description": "Winner of the National Book Award, the long-awaited novel from the author of the acclaimed collection, Jenny and the Jaws of Life, is an unusual and wonderful novel that is somehow able to be at once bleak and hilarious, light-hearted and profound.It's the story of two sisters. Abigail Mather is a woman of enormous appetites, sexual and otherwise. Her fraternal twin Dorcas couldn't be more different: she gave up on sex without once trying it, and she lives a controlled, dignified life of the mind. Though Abigail exasperates Dorcas, the two love each other; in fact, they complete each other. They are an odd pair, set down in an odd Rhode Island town, where everyone has a story to tell, and writers, both published and unpublished, carom off each other like billiard balls. What is it that makes the two women targets for the new man in town, the charming schlockmeister Conrad Lowe, tall, whippet-thin and predatory? In Abigail and Dorcas he sees a new and tantalizing challenge. Not the mere conquest of Abigail, with her easy reputation, but a longer and more sinister game. A game that will lead to betrayal, shame and, ultimately, murder.In her darkly comic and unsettling first novel, Jincy Willett proves that she is a true find: that rare writer who can explore the shadowy side of human nature with the lightest of touches.",
        "Category": " Fiction , Humorous",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "How to Draw Aircraft",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Human physiology: The mechanisms of body function",
        "Authors": "By Vander, Arthur J",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Indian in the Cupboard",
        "Authors": "By Banks, Lynne Reid",
        "Description": "It all starts with a birthday present Omri doesn't even want -- a small plastic Indian of no use to him at all. But when an old wooden cupboard and a special key bring the unusual toy to life, Omri's Indian becomes his most important secret: precious, dangerous, wonderful, and above all, magical.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "So Far from the Bamboo Grove",
        "Authors": "By Watkins, Yoko Kawashima",
        "Description": "In the final days of World War II, Koreans were determined to take back control of their country from the Japanese and end the suffering caused by the Japanese occupation. As an eleven-year-old girl living with her Japanese family in northern Korea, Yoko is suddenly fleeing for her life with her mother and older sister, Ko, trying to escape to Japan, a country Yoko hardly knows.Their journey is terrifying—and remarkable. It's a true story of courage and survival that highlights the plight of individual people in wartime. In the midst of suffering, acts of kindness, as exemplified by a family of Koreans who risk their own lives to help Yoko's brother, are inspiring reminders of the strength and resilience of the human spirit.",
        "Category": " Juvenile Fiction , People & Places , Asia",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Dragon Tears",
        "Authors": "By Koontz, Dean R.",
        "Description": "A startlingly original masterpiece of suspense from a number-one New York Times best-selling author.Tuesday was a fine California day, full of sunshine and promise, until Harry Lyon had to shoot someone at lunch. From that first sentence, Dragon Tears explodes across the page with the excitement, chilling suspense, emotion, and deeply drawn characters that have earned Dean Koontz enormous worldwide popularity.Police detective Harry Lyon is a perfectionist who likes his condo immaculate, his suits well tailored, and his homicide files typed error-free. To Harry's dismay, his partner, Connie Gulliver, embraces chaos, urging him to \"get in touch with the rhythms of destruction.\" But when Harry and Connie have to kill in the line of duty, the ensuing surreal nightmare makes Connie's cynical world view seem all too accurate.That same afternoon, a hulking street person prophesies that Harry will be dead by dawn, then self-destructs before his eyes. As twilight falls, Harry glimpses strange creatures in the shadows, and finds his rational world transformed into a place of bizarre surprises and unimaginable dangers. As dawn ticks closer, Harry is caught in a whirlwind of terror that threatens to sweep away not only him but Connie and everyone he loves. The San Diego Union has called Dean Koontz \"a master storyteller... sometimes humorous, sometimes shocking, but always riveting.\" Never before has that judgment been truer than in the vastly entertaining, enormously satisfying Dragon Tears.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Mother's Memories To Her Child",
        "Authors": "By Kinkade, Thomas and Kinkade, Thomas (ILT)",
        "Description": "Featuring the art of \"Painter of Light™,\" Thomas Kinkade, this keepsake journal has now been given a makeover with a newly-designed cover that features a different Thomas Kinkade painting. In this beautiful journal just for mothers, there is ample room for moms to record their thoughts, wisdom, and memories--all complemented by selections from Kinkade's warm, colorful paintings. A wonderful gift for mothers to share with their children, this journal will serve as a precious keepsake for many generations.",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Welcome To Junior High! (Girl Talk)",
        "Authors": "By Blair, L. E.",
        "Description": "Sabrina Wells and her friends, Allison, Katie, and Randy, must agree on a theme for the Homecoming dance",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "The Fate of Africa: From the Hopes of Freedom to the Heart of Despair",
        "Authors": "By Meredith, Martin",
        "Description": "Fifty years ago, as Europe's colonial powers withdrew, Africa moved with enormous hope and fervor toward democracy and economic independence. Dozens of new states were launched amid much jubilation and the world's applause. African leaders, popularly elected, stepped forward to tackle the problems of development and nation-building. In the Cold War era, the new states excited the attention of the superpowers. Africa was considered too valuable a prize to lose.  Today, Africa is a continent rife with disease, death, and devastation. Most African countries are effectively bankrupt, prone to civil strife, subject to dictatorial rule, and dependent on Western assistance for survival. The  sum of Africa's misfortunes ? its wars, its despotisms, its corruption, its droughts ? is truly daunting.  What went wrong? What happened to this vast  continent, so rich in resources, culture and history, to bring it so close to destitution and despair in the space of two generations?  Focusing on the key personalities, events and themes of the independence era, Martin Meredith's riveting narrative history seeks to explore and explain the myriad problems that Africa has faced in the past half-century, and faces still. From the giddy enthusiasm of the 1960s to the \"coming of tyrants\" and rapid decline, The Fate of Africa is essential reading for anyone seeking to understand how it came to this ? and what, if anything, is to be done.",
        "Category": " History , Africa , General",
        "Publisher": "Public Affairs",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Anastasia",
        "Authors": "By Blackwell, Maggie and Young, Eddie (ILT)",
        "Description": "Anya, an eighteen-year-old Russian orphan with no memory of her past, sets out for Paris where she hopes to find her family.",
        "Category": "",
        "Publisher": "Harpercollins Childrens Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Prince and the Pauper",
        "Authors": "By Walt Disney Company",
        "Description": "",
        "Category": "",
        "Publisher": "Mouse Works",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "CHILDREN'S DICTIONARY",
        "Authors": "By",
        "Description": "",
        "Category": " Juvenile Nonfiction , Reference , Dictionaries",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "7.67",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "The New York Times Book of Women's Health : The Latest on Feeling Fit, Eating Right, and Staying Well",
        "Authors": "By Brody, Jane E. (EDT) and Grady, Denise (EDT)",
        "Description": "An informative collection of writings about women's health issues covers the gamut, from issues of domestic violence to rhinoplasty, from heart disease to body image.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Dorland Illustrated Medical Dictionary. (Dorland's Illustrated Medical Dictionary)",
        "Authors": "By Dorland, Newman W.",
        "Description": "",
        "Category": "",
        "Publisher": "W.B Saunders Co, Division of Harcourt Brace",
        "Price Starting With ($)": "9.45",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Sluggers",
        "Authors": "By Holway, John",
        "Description": "",
        "Category": "",
        "Publisher": "A Redefinition Book",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Killer Smile",
        "Authors": "By Scottoline, Lisa",
        "Description": "Everybody around lawyer Mary DiNunzio has decided she isn't allowed to be a Young Widow anymore, even though she didn't know there was an official cutoff. They're all trying to fix her up -- her South Philly Italian parents, her best friend Judy Carrier, even the office security guard.     All Mary wants to do is immerse herself in a case  everybody else calls \"The History Channel\", a pro bono representation of the Brandolini estate. The roots of the matter sink deep into the past, when Amadeo Brandolini emigrated to Philadelphia, started a family, and built up a small fishing business. At the outbreak of World War II, Brandolini was arrested by the FBI as part of a mass internment of Italian-Americans and was sent to a camp in Montana, where he eventually committed suicide. Now, more than sixty years later, his son's estate hires Mary to sue for reparations.    Mary vows to vindicate Amadeo even though it won't be easy. With only a lock of hair, an old wallet, and a sheet of paper filled with odd doodles to go on, the tenacious lawyer begins to research the case but finds instead puzzling new questions. Someone doesn't want Mary to find the truth, and before long, her life is threatened. Suddenly, the quiet, squeaky-clean good girl who never left Mercer Street is risking life and limb to finger a killer and lay a beloved ghost to rest.     New York Times bestselling author Lisa Scottoline delivers a stunning new tale filled with witty dialogue, vibrant characters, and breakneck pacing, in which true-life history reinforces her hallmark themes of justice and family. As entertaining as it is poignant, Killer Smile is a surefire bestseller from a writer at the peak of her talents.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Pillsbury's Creative Cooking In Minutes",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Pillsbury Publications 1971",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "How to Draw Super Heroes",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Weekend Entrepreneur: 101 Great Ways to Earn Extra Cash",
        "Authors": "By Anton, Michelle, Sander, Jennifer, and Schlessinger, Laura (FRW)",
        "Description": "Live the Lifestyle of Your Dreams!Are you hoping to build a better life for you and your family? Can you see yourself here? I could use some extra money to take a cool vacation or buy my kids something they really want. I dream of taking a chance on one of my own ideas and turning it into reality. I'm bored and have extra time on my hands. I'm looking for a way my whole family can work together. Imagine earning thousands more each year--all in your free time. Thousands of people have found a way to live the lifestyle of their dreams--and now you can, too. Over a hundred weekend entrepreneurs share their secrets. It's all the information you need to forge your own path to the life you deserve.",
        "Category": " Business & Economics , Small Business",
        "Publisher": "Entrepreneur Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Bush Oops: Presidential Photo Ops Gone Awry",
        "Authors": "By Kelly, Sean, Buell, Hal, and Kelly, Chris",
        "Description": "This revised and updated edition of the hilarious Bush Oops is a new collection of missteps, faux pas, compromising positions and embarrassing moments in 110 laugh-out loud photographs our leader and his sidekicks wish had not been taken.",
        "Category": " Humor , Topic , Adult",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "The Anxiety Cure: An Eight-Step Program for Getting Well",
        "Authors": "By Dupont, Robert L., Spencer, Elizabeth Dupont, and Dupont, Caroline M., M.D.",
        "Description": "An Eight-Step Program for Overcoming Anxiet Anxiety disorders cause untold suffering, and they affect one in four people. This book offers an eight-step practical program for fast and long-lasting relief of anxiety symptoms. The Anxiety Cure is written by a father and his two daughters, now in clinical practice together, who tell the inspiring story of how they overcame anxiety in their family. The authors share their step-by-step methods for dealing with the six main types of anxiety, including panic disorder, agoraphobia, generalized anxiety disorder, specific phobias, and obsessive-compulsive disorder. Grounded in the authors' own treatment of thousands of clinically anxious people, The Anxiety Cure: Tells how to manage anxiety at home and at work Gives action plans for friends, family, and support people Provides easy relaxation techniques Outlines lifesaving strategies for anxious people with alcohol or drug problems Includes dramatic stories, as well as boxes, tools, and forms to chart your personal progress. \"The Anxiety Cure is a warm, wise, and thoroughly wonderful book for people with anxiety disorders and for everyone who cares about them.\" —from the foreword by Jerilyn Ross, MA., L.I.C.S.W., President, Anxiety Disorders Association of America, and author of Triumph Over Fear \"The Anxiety Cure will be a big hit with the public and with anxious people.\" —Willard Scott \"The Anxiety Cure is sure to enjoy substantial popularity and will be used widely by anxious people, their families, and therapists.\" —R. Reid Wilson, Ph.D., author of Don't Panic",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Story Of The Supreme Court (Cornerstones of Freedom)",
        "Authors": "By Richards, Kenneth G",
        "Description": "",
        "Category": "",
        "Publisher": "Children's Press",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The Story of the Alamo: Cornerstones of Freedom Library",
        "Authors": "By Norman Richards",
        "Description": "",
        "Category": "",
        "Publisher": "Children's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1970"
        }
    },
    {
        "Title": "The Year's Best Science Fiction: Twenty-First Annual Collection",
        "Authors": "By Dozois, Gardner R. (EDT)",
        "Description": "The stories in this collection imaginatively take readers far across the universe, into the very core of their beings, to the realm of the Gods, and to the moment just after now.  Included are the works of masters of the form and the bright new talents of tomorrow.  This book is a valuable resource in addition to serving as the single best place in the universe to find stories that stir the imagination and the heart.",
        "Category": " Fiction , Science Fiction , Collections & Anthologies",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Looking For Peyton Place",
        "Authors": "By barbara-delinsky",
        "Description": "",
        "Category": "",
        "Publisher": "Thorndike Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "A Travel Guide to Heaven (Random House Large Print)",
        "Authors": "By DeStefano, Anthony",
        "Description": "A biblically-based profile of heaven likens it to a \"luxury resort\" more sumptuous than any place on Earth, where residents exist in a physically, emotionally, and spiritually perfect state of abiding joy.",
        "Category": " Religion , Spirituality",
        "Publisher": "Random House Large Print",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The New Strategic Selling: The Unique Sales System Proven Successful by the World's Best Companies, Revised and Updated for the 21st Century",
        "Authors": "By Tuleja, Tad, Heiman, Stephen E., Sanchez, Diane, and Miller, Robert B.",
        "Description": "The Book that Sparked A Selling Revolution In 1985 one book changed sales and marketing forever. Rejecting manipulative tactics and emphasizing \"process,\" Strategic Selling presented the idea of selling as a joint venture and introduced the decade's most influential concept, Win-Win. The response to Win-Win was immediate. And it helped turn the small company that created Strategic Selling, Miller Heiman, into a global leader in sales development with the most prestigious client list and sought-after workshops in the industry. Now Strategic Selling has been updated and revised for a new century of sales success. The New Strategic Selling This new edition of the business classic confronts the rapidly evolving world of business-to-business sales with new real-world examples, new strategies for confronting competition, and a special section featuring the most commonly asked questions from the Miller Heiman workshops. Learn: * How to identify the four real decision makers in every corporate labyrinth * How to prevent sabotage by an internal deal-killer * How to make a senior executive eager to see you * How to avoid closing business that you'll later regret * How to manage a territory to provide steady, not \"boom and bust,\" revenue * How to avoid the single most common error when dealing with the competition.",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "Business Plus",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "A Writer's Reference",
        "Authors": "By Hacker, Diana",
        "Description": "",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Really Important Stuff My Kids Have Taught Me",
        "Authors": "By Lewis, Cynthia Copeland",
        "Description": "With 354,000 copies in print, Really Important Stuff My Kids Have Taught Me is the really successful book of sandbox wisdom. Now it is reissued with three fresh, appealing covers. Collected and edited by Cynthia L. Copeland, author of The Diaper Diaries and Fun on the Run, together with 170,000 copies in print, Really Important Stuff is filled with clear-eyed common sense that can make us start with surprise and delight. Here are children saying things that are smart, funny, innocent, completely sensible in a way adults just aren’t. Things like: “Bees shouldn’t be so nice and fuzzy.” “You can either keep pedaling, get off the bike, or fall over.” “Pants with pockets are better.” Things like: “It’s more fun to color outside the lines.” “Lick your ice-cream cone before it gets a chance to melt.” “You’re only little until someone littler comes along.” And, “Milk tastes better through a straw.”",
        "Category": " Religion , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    }
]