[
    {
        "Title": "Infamous",
        "Authors": "By Collins, Joan",
        "Description": "Katherine Bennet, a Hollywood icon and the toast of America, has never been more satisfied with her career, as the television drama in which she stars surges to number one in the ratings. If only her personal life were as successful. Still reeling from a bitter divorce and enduring daily battles with her rebellious teenage son, Katherine realizes that although she has one of the most famous faces in the world, her heart is one of the loneliest.That's when the very handsome Jean-Claude Valmer enters her life, sweeping the vulnerable Katherine off her feet and into his bed. What begins as a storybook romance, bursting with passion, soon turns dark and sinister. For lurking beneath his innocent veneer is a Jean-Claude no one would recognize - especially the woman who has grown to trust him implicitly.",
        "Category": " Fiction , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Our Father",
        "Authors": "By French, Marilyn",
        "Description": "Marilyn French has written an extraordinary novel about four sisters who come to terms with the haunting past they share - opening up, discovering themselves and one another for the first time.Their father, the rich and powerful Stephen Upton, lies in the hospital following a stroke. His four daughters - each born of a different mother and ranging widely in age - are estranged from one another. Gathered in Upton's country mansion, awaiting his recovery - or death - they eye one another suspiciously. The eldest, Elizabeth, cold, acerbic, a government economist, takes charge of running the household, just as her father would have expected. Mary, beautiful, charming, a social jet-setter, secretly agonizes about money and finding another wealthy husband. Alex desperately wants to be close to her sisters, but they mock her warmth, kindness, and lack of sophistication. And Ronnie, born of Upton's affair with his Mexican housekeeper, sleeps in the maid's room, feeling her sisters' contempt.Buried within each of them lies their father's legacy - the anger, resentment, and disillusionment they share but have borne silently all these years. At first it is their feelings of pain, rage, and fear that bind them, that continue to cast shadows over their lives. But slowly the walls between them begin to crumble and they come to accept, understand, even love one another. In the novel's powerful and cathartic climax, they are at last able to confront the father they share with what he has done to them. Marilyn French has created a profoundly moving novel in which four women discover sisterhood, and sisterhood sets them free.",
        "Category": " Fiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Kirlian Quest (Cluster, Book 3)",
        "Authors": "By Anthony, Piers",
        "Description": "",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "July",
            "Year": "1978"
        }
    },
    {
        "Title": "The Handy History Answer Book",
        "Authors": "By Rebecca Nelson",
        "Description": "",
        "Category": "",
        "Publisher": "Visible Ink Press",
        "Price Starting With ($)": "5.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Quilting manual; new: Designer's boutique",
        "Authors": "By Hinson, Dolores A.",
        "Description": "",
        "Category": "",
        "Publisher": "Hearthside Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Essential Managers: Writing Your Resume",
        "Authors": "By Simon, Howard and Howard, Simon",
        "Description": "Provides a guide to creating an effective, well-organized resume, and includes tips on conducting a job search",
        "Category": " Business & Economics , Careers , Resumes",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Hiking Maryland and Delaware (State Hiking Series)",
        "Authors": "By Lillard, David and Reiter, Chris",
        "Description": "Incudes 62 hikes that cover Maryland and Delaware's best-kept secrets.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Falcon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Inside the British Museum: a Children's Guide",
        "Authors": "By Richardson, Joy",
        "Description": "",
        "Category": "",
        "Publisher": "British Museum Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Writer's Guide to Metropolitan Washington: Where to Sell What You Write",
        "Authors": "By Defrancis, Beth",
        "Description": "",
        "Category": "",
        "Publisher": "Woodbine House",
        "Price Starting With ($)": "6.59",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Tip",
        "Authors": "By Clancy, Paul and Elder, Shirley",
        "Description": "An account of the life and career of the Irish Catholic congressman from Massachusetts, one of the few remaining old-time politicians and one of the most influential men in American politics",
        "Category": " Political Science , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1980"
        }
    },
    {
        "Title": "The Prince and the Pauper (Puffin Classics)",
        "Authors": "By Twain, Mark",
        "Description": "Tom Canty and Edward Tudor could have been identical twins. Their birthdays and their faces match, but there the likeness stops. For Edward is prince, heir to King Henry VIII of England, whilst Tom is a miserable pauper. But fate intervenes, and their identities become confused. Soon the prince is thrown out of the palace in rags, leaving ignorant Tom to play the part of a royal prince.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Angels: A Novel",
        "Authors": "By Keyes, Marian",
        "Description": "After catching her husband having an affair and being fired from her job, Maggie Walsh suddenly finds her perfectly organized existence has become a perfect mess. She decides, for the first time in her life, to do something daring -- and flees to her best friend, Emily, in the faraway wonderland of Los Angeles. In this mecca of tanned, beautiful bodies, unsvelte, uncool Maggie is decidedly a fish out of water. Yet, overnight, she's mixing with film folk, pitching scripts, even experimenting with sex -- and discovering that the end of a marriage is not the end of the world.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Dinner at Homesick Restaurant",
        "Authors": "By Tyler, Anne",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Don't Sweat the Small Stuff at Work",
        "Authors": "By Carlson, Richard",
        "Description": "In this classic roadmap to managing your high-tension job, Richard Carlson shows how to stop worrying about the aspects of your work beyond your control and interact more fruitfully and joyfully with colleagues, clients, and bosses. His key insights reveal how to:How to manage rush deadlines with rushingHow to transform your outlook and prepare for the day aheadHow to enjoy corporate travelHow to have a really bad day . . . and get over it",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Gardens and landscapes of the National Trust for Historic Preservation",
        "Authors": "By Reyburn, Susan",
        "Description": "",
        "Category": "",
        "Publisher": "National Trust for Historic Preservation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Hidden patterns; studies in psychoanalytic literary criticism",
        "Authors": "By Leonard Falk Manheim",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Never Met a Man I Didn't Like: The Life and Writings of Will Rogers",
        "Authors": "By Rogers, Will and Carter, Joseph H.",
        "Description": "Will Rogers was America. Part Cherokee Indian and former cowboy, he captivated audiences around the world with sparkling gems of wisdom cloaked in gentle and uproarious country wit and astonishing rope tricks. His colorful life recently inspired a commercially successful and critically acclaimed Broadway musical -- winner of 6 Tony Awards. His words are as entertaining, inspiring and revelant today as they ever were. A simple, plain-spoken man, he was the voice of a nation during the '20s and '30s. Movie star, vaudeville headliner, radio commentator, his views and observations were syndicated daily and weekly in over 600 newspapers across the country.Here is the essential Will Rogers -- the story of his remarkable career, from Oklahoma \"cowpuncher\" to international star . . . and the warm, knowing and hilarious philosophies of the man embodied the heart and soul of the nation.",
        "Category": " Humor , Form , Essays",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Dream Big: Finding the Courage to Follow Your Dreams and Laugh at Your Nightmares",
        "Authors": "By Hammond, Lisa",
        "Description": "When author Lisa Hammond followed her passion, she founded her own company, Femail Creations  a womanoriented catalog company that grew into a huge success. Lisa loved shopping, thus the mailorder catalog. Because she's passionate about women making their way in the world, Femail Creations features only items crafted by women artisans. In Dream Big Hammond details how she and her sister entrepreneurs followed their dreams and managed their fears to become happy and successful. Lisa shares the lessons they learned, the mistakes they made, and the fulfillment they attained. Dream Big reflects Lisa's inspirational personality and drive, as well as her belief in the power of women connecting with women  from the artists whose products appear in Femail Creations to the women who buy those products. Dream Big is a virtual meeting place for women who want to live  and work  their dreams. By sharing parts of their stories and tips, the women who've done it lend a hand to those who still dream that \"maybe someday...\" Readers will find inspiration, as well as hardnosed advice, about how to pursue their passion  whether for business, creativity, family, or anything else  in spite of fear and inevitable missteps. Chapters include: \"Permission to Dream,\" \"Facing Fears,\" \"Attempting the Impossible,\" \"Owning Our Power,\" \"Trusting Our Guts,\" \"Persistence is Omnipotent,\" and \"Never Too Late.\" Dream Big shows women that the first step isn't writing a business plan  it's listening to yourself and taking your turn/ it's managing your life from the heart with a \"femail\" touch. Hammond, who's known to her thousands of customers, friends, and family as the Barefoot CEO, didn't do things conventionally. That makes for hilarious stories, heartstopping inspiration, and rollupyour sleeves tips  a blueprint in action for their dreams.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Conari Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Cookout USA: Grilling Favorites Coast to Coast",
        "Authors": "By Orcutt, Georgia and Margolies, John",
        "Description": "For those in the United States, when the sun is out, the grill is on because everyone loves to get outdoors and eat. Whether it's a picnic, backyard barbecue, party by the pool, tailgate, clam bake, or wienie roast, people will find any excuse they can to chow down on summer favorites with friends and family. From South Carolina's BBQ Pork with Mustard Sauce to Spicy Grilled Chili-Lime Halibut from Alaska to Utah's sweet Cherry Cobbler cooked outside in a Dutch oven over the campfire, Cookout USA offers a classic recipe from each state of the union. Serve them with great sides like Mom's Potato Salad, New England Baked Beans, Perfect Picnic Cupcakes, and Citrus Iced Tea for the ultimate cross-country culinary adventure. Whether folks are grilling from the mountains to the prairies to the oceans, white with foam, this wholly enjoyable cookbookillustrated with vintage travel brochures and nostalgic postcardshas covered all the territory. Grilling away across the good ol' USA has never tasted so good.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "National Geographic United States Atlas for Young Explorers (New Millennium)",
        "Authors": "By National Geographic Society (U. S.) (COR)",
        "Description": "A high-quality atlas includes maps of each of the fifty states, the District of Columbia, and U.S. territories and commonwealths, highlighting interstate highways, state and national parks, historic sites, population, endangered species, and more. Children's BOMC. 75,000 first printing.",
        "Category": " Juvenile Nonfiction , Reference , Atlases",
        "Publisher": "National Geographic Children's Books",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Talking With Adventurers : Conversations With Christina Allen, Robert Ballard, Michael Blakey, Ann Bowles, David Doubilet, Jane Goodall, Dereck & Beverly Joubert",
        "Authors": "By Cummings, Pat (EDT), Cummings, Linda, Ph.D. (EDT), and Allen, Christina G. (EDT)",
        "Description": "A companion book to Talking with Artists presents interviews with twelve present-day adventurers, including scientists Jane Goodall and Robert Ballard, about their lives and work, encouraging children to pursue their interests.",
        "Category": " Young Adult Nonfiction , Science & Nature , Experiments & Projects",
        "Publisher": "National Geographic Children's Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Elegantly Easy Creme Brulee : & Other Custard Desserts",
        "Authors": "By Puente, Debbie",
        "Description": "At last, creme brulee has been demystified. Debbie Puente has taken the complexity out of making this delicious delicacy, and has compiled 70 irresistible recipes that include a wide variety of silken and sinfully rich desserts, as well as some unexpected savory recipes guaranteed to surprise and delight the palate.",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "Renaissance Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Essentials of Human Communication",
        "Authors": "By DeVito, Joseph A.",
        "Description": "An introductory level text covering, in the first section, the communication process, the self, perception, listening, and verbal and non-verbal messages.  The second part addresses interpersonal communication (including interviewing), small group communication, and public speaking. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Harpercollins College Div",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "I Never Called It Rape: The Ms. Report on Recognizing, Fighting, and Surviving Date and Acquaintance Rape",
        "Authors": "By Warshaw, Robin",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Exploring the Sky by Day: The Equinox Guide to Weather and the Atmosphere",
        "Authors": "By Dickinson, Terence",
        "Description": "Winner of the Children's Roundtable Literature Information Book Award.  Ideal for children, Exploring the Sky by Day offers fascinating insight into such phenomena as lightning, the 10 types of clouds, storms, solar haloes, sundogs, and sunsets. Brought to life with dozens of photographs and the color illustrations of John Bianchi the book provides an excellent introduction to weather and the atmosphere.",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , Weather",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Weather",
        "Authors": "By Farrand, John",
        "Description": "Covers rain, snow, lightning, tornadoes, floods, hurricanes, and clouds, discusses weather forecasting, and includes photographs of various weather effects",
        "Category": " Science , General",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Checklist for Life for Women: Timeless Wisdom & Foolproof Strategies for Making the Most of Life's Challenges & Opportunities",
        "Authors": "By Thomas Nelson Publishers",
        "Description": "Checklist for Life is the ultimate handbook for living a successful, joy-filled life. Now,Checklist for Life for Women offers insight into topics and issues that are specific to women's interests. In addition to a brief narrative, each chapter of this interactive handbook contains:An \"I Will\" checklist of heart and attitude reinforcements.A \"Things to Do\" checklist of action points.A \"Things to Remember\" section of Scripture verses and applicable quotes from famous and not-so-famous people.Topics addressed include everyday miracles,style, and relationships.In all, there are insightful narratives, scriptures, quotations, and checklists on 66 important topics. The practical, inspirational content plus the attractive two-color text design and unique cover make this a book women will want to own and give as a gift.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Sermons: Biblical Wisdom For Daily Living",
        "Authors": "By Gomes, Peter J.",
        "Description": "The man Time magazine hailed as one of America's finest preachers presents a collection of forty timeless addresses to guide us through the year. With his characteristic eloquence and compassion, quoting from scripture as well as from T.S. Eliot and Woody Allen, Gomes offers us the tools we need to understand the wisdom of the Bible and the joy and inspiration it can bring to everyday life.",
        "Category": " Religion , Christianity , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Source of the Spring: Mothers Through the Eyes of Women Writers",
        "Authors": "By Shapiro, Judith R. (COM)",
        "Description": "Leading women writers--including Ntozake Shange, Anna Quindlen, Rosellen Brown, Mary Gordon, Delia Ephron, Margaret Mead, and many others--reflect on the diverse roles of mothers in today's society, in poetry, essays, and short stories. IP.",
        "Category": " Literary Criticism , Women Authors",
        "Publisher": "Red Wheel",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "WORLD WEAVER, THE",
        "Authors": "By Etchison, Craig",
        "Description": "Larkin, a world Weaver from a different dimension, enlists the aid of three high school students to try to save the world from a powerful, evil \"weaver\" who plans to destroy Earth and its universe.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Daniel & Daniel Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2015"
        }
    },
    {
        "Title": "A Peanuts Valentine",
        "Authors": "By Schulz, Charles M.",
        "Description": "Fifty years of Valentine's Day comic strips featuring the Peanuts gang include Charlie Brown's devotion to the little red-haired girl, Lucy's attempts to get Schroeder's attention, Sally's efforts to woo Linus out from under his blanket, and other delightful episodes.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Prokofiev",
        "Authors": "By Samuel, Claude",
        "Description": "",
        "Category": " Performing Arts , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1971"
        }
    },
    {
        "Title": "The Hot Flash Cookbook: Delicious Recipes for Health and Well-Being through Menopause",
        "Authors": "By Luchetti, Cathy and Kagan, Risa (FRW)",
        "Description": "While the jury is out on chemical estrogen, a growing number of women are seeking natural remedies for the symptoms of menopause. Rich in estrogen as well as the vitamins and calcium that fight off osteoporosis and heart disease, the delicious recipes in The Hot Flash Cookbook are a balm for the symptoms that mark the change of life, including insomnia, depression, dizziness, fatigue, and the infamous hot flashes. The Hot Flash Cookbook, now featuring a new introduction by the author that reflects the HRT controversy, as well as an attractive new cover, serves up dishes made from wholesome ingredients such as soy, fresh herbs, root vegetables, nuts, and fish. Inspired by a variety of delectable ethnic flavors, dishes such as Smoky Yam Cilantro Soup and Green Tofu Bruschetta are sure to please everyone at the table. With a foreword by women's health expert Risa Kagan, MD, The Hot Flahs Cookbook helps women enjoy good health and good food.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Hairstyles - Braiding & Haircare",
        "Authors": "By Jacki Wadeson~Alistair Hughes",
        "Description": "",
        "Category": "",
        "Publisher": "Anness Publishing; Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "If I'm Jewish and You're Christian, What Are the Kids?: A Parenting Guide for Interfaith Families",
        "Authors": "By King, Andrea",
        "Description": "",
        "Category": " Religion , Judaism , General",
        "Publisher": "Behrman House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2015"
        }
    },
    {
        "Title": "Straightforward",
        "Authors": "By Tomczak, Larry",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Logos Associates",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "August",
            "Year": "1978"
        }
    },
    {
        "Title": "The Best of Robert Service",
        "Authors": "By Service, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1963"
        }
    },
    {
        "Title": "Further Five-minute Mysteries: 36 New Cases Of Murder And Mayhem For You To Solve",
        "Authors": "By Weber, Kenneth J.",
        "Description": "Thirty-six cases of murder and mayhem you can solve in under five minutes!",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Roosevelt: The Soldier of Freedom (1940-1945)",
        "Authors": "By James MacGregor.Burns",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Life Makeovers: 52 Practical & Inspiring Ways To Improve Your Life One Week At A Time",
        "Authors": "By Richardson, Cheryl",
        "Description": "Author of the #1 New York Times bestselling Take Time for Your Life now shows you how to reclaim your life one week at a timeCheryl Richardson, bestselling author and one of the most sought-after lecturers in the country, knows firsthand how tough it can be to juggle the daily demands of living in a fast-paced world, and how easily you can become disconnected from your true self and what makes you happy. In Life Makeovers, Cheryl has taken all the know-how and insight she has gleaned from her years as a personal coach and distilled it into a simple, year-long program that shows how making small changes, over time, can have a huge impact on the quality of your life. In fifty-two simple yet profound essays, Richardson provides a plan for both reflecting and taking action, along with specific, practical advice and exercises to help readers gradually and permanently remodel their lives, week by week. Easy to use and fun to read, this workbook is the perfect companion to Take Time for Your Life. Topics include:The Gift of Time: It's Self-Management, Not Time ManagementAre We Having Fun Yet: When Life Gets Too Serious, Here's What to DoGive Your Brain a Vacation: For Finding the Best Ideas, Try ThisStanding in the Shadow: Whose Talent Are You Hiding Behind?Stop Juggling and Start Living: Here Are Some of the Balls to DropClose Encounters: How to Make a Deeper Connection with OthersHer brief, personal essays will inspire you to make changes, and her Take Action Challenges, which appear with comprehensive resource sections at the end of every essay, will guide you through small steps that will slowly teach you to think, act, love, work, and even laugh in a whole new way. Written in Cheryl's signature, heartwarming style, Life Makeovers is the ideal book for anyone looking for a balanced way to reclaim their life one step at a time. How often do you daydream about living a better life—a life that reflects more of you, your values and deepest desires? How many times have you come to the end of a busy week and toyed with the fantasy of packing abag and leaving it all behind?The \"Life Makeover\" program is a powerful year-long program for change. It is designed to support you in changing your life one week at a time. Each chapter consists of a topic of the week and contains a Take Action Challenge and a Resources section to support you in taking action quickly and easily.Be prepared for your life to unfold in wonderful ways. As you clean up the clutter, reconnect with your inner wisdom, strengthen your character, and take on the challenges of high-quality living, you'll find that the lost parts of yourself start to come together to form a pretty amazing life!",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "North Americas Great Railroads",
        "Authors": "By Thomas York",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "6.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Our Times: The Washington Times 1982-2002",
        "Authors": "By Edwards, Lee (EDT)",
        "Description": "Presents five essays discussing the past two decades of political affairs, written by contributors to the Right-wing  Washington Times  newspaper, founded in 1982 by the Reverend Sun Myung Moon. Themes addressed include the ill effects of feminism and \"political correctness\" and the political triumphs of the triumvirate of Thatcher, Reagan, and Pope John Paul II. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Literary Collections , Essays",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Yes, You Can: 1,200 Inspiring Ideas for Work, Home, and Happiness",
        "Authors": "By Deep, Sam and Sussman, Lyle",
        "Description": "Yes, You Can! gives you good advice, and it gives you more: it tells how you can make that advice part of your daily life. Whether your goal is to speak eloquently, discover hidden talents, or find fulfillment at work, this book can help. It covers more than 125 personal goals with the clear, practical advice for which Deep and Sussman are known. The result is an inspiring guide to improving yourself and improving your relationships, balancing work and home, and building lasting success. Many books will tell you that you can achieve your goals. Yes, You Can! gives you the tools to make that happen.",
        "Category": " Psychology , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Corporate Internet Planning Guide: Aligning Internet Strategy With Business Goals",
        "Authors": "By Gascoyne, Richard J. and Ozcubukcu, Koray",
        "Description": "This timely book breaks down the complicated process into simplified problem-solving steps that will help you confidently plan, develop, implement, and manage a corporate-wide Internet or Intranet strategy.You'll find all the tools you need here in a format you can put to work right away. Planning questions, checklists, and examples help you analyze your company's capabilities, strengths, and weaknesses, enabling you to create a customized plan for maximum impact - or if you're already online - to evaluate, enhance, and redefine your current Internet/Intranet strategy.",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "A Fireside Christmas",
        "Authors": "By Cusick, Dawn and Larose-Weaver, Diane",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "CliffsStudySolver Algebra II",
        "Authors": "By Sterling, Mary Jane",
        "Description": "The CliffsStudySolver workbooks combine 20 percent review material with 80 percent practice problems (and the answers!) to help make your lessons stick.CliffsStudySolver Algebra II is for students who want to reinforce their knowledge with a learn-by-doing approach. Inside, you’ll get the practice you need to factor and solve equations with handy tools such asStraightforward, concise reviews of every topicPractice problems in every chapter — with explanations and solutionsA diagnostic pretest to assess your current skillsA full-length exam that adapts to your skill levelBeginning with the rules for exponents and operations involving polynomials, this workbook ventures into quadratic equations, function transformations, rational root theorem, and more. You'll explore factoring by grouping, graphing, complex numbers, and hyperbola, plus details aboutSolving exponential and logarithmic equationsUsing a graphing calculator to graph lines and polynomialsDealing with story problems using systems of equationsPerforming scalar and matrix multiplicationFactoring binomials, trinomials, and other polynomialsPractice makes perfect — and whether you're taking lessons or teaching yourself, CliffsStudySolver guides can help you make the grade.",
        "Category": " Mathematics , Algebra , General",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The Terrible Truth About Lawyers: How Lawyers Really Work and How to Deal With Them Successfully",
        "Authors": "By McCormack, Mark H.",
        "Description": "",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Beech Tree Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Unstoppable: 45 Powerful Stories of Perseverance and Triumph from People Just Like You",
        "Authors": "By Kersey, Cynthia",
        "Description": "Do you crave more out of life, but are unsure about how to get it? Do you secretly fear you don't have what it takes to achieve your true heart's desire? Or if you think you do, is everyone telling you to forget about it and be realistic?Unstoppable is the first step to creating the life you've always wanted to live. This ultimate personal motivator introduces you to 45 people from all walks of life who will not only inspire you but show you how to overcome any obstacle between you and your goals. These current, real-life role models will show you possibilities for your life and give you the courage and inspiration to triumph!Along with its heartwarming and inspiring stories, Unstoppable gives you a seven-step action plan that features the tools you'll need to create the life you deserve.You'll learn:--How to discover your own unique calling and purpose in life--The biggest lies that may be stopping you from getting what you want--The best strategies for turning self-doubt into unstoppable self-confidence--Seven proven steps to becoming unstoppable in every area of life",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Sourcebooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Designing With Letters (Lettering Workbooks)",
        "Authors": "By Robertson, Bruce",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Watson-Guptill Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Green Shingles: At the Edge of Chesapeake Bay",
        "Authors": "By Svenson, Peter",
        "Description": "",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Winged Shield, Winged Sword: A History of the United States Air Force (2 Volume Set) 1907-1997",
        "Authors": "By Nalty, Bernard C., S/N 008-070-00717-7",
        "Description": "",
        "Category": "",
        "Publisher": "For sale by the U.S. G.P.O., Supt. of Docs",
        "Price Starting With ($)": "19.38",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Quilt Designs in Cross-Stitch (An American Sampler 1989)",
        "Authors": "By Collection, Vanessa-Ann",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "No More Mr. Nice Guy: A Love Story (Strivers Row)",
        "Authors": "By Robinson, C. Kelly",
        "Description": "Mitchell Stone has had it!  No more Mr. Nice Guy. Sick and tired of dates that end with a pat on the back, he’s decided it’s time to even his odds with the ladies and become the type of man they really seem to want: a mysterious, mischievous, deceitful Dog! With the help of his “Player” instructors, Tony and Trey, he’s dipping his toe into a stream of booty calls, baby-mamas, and sexual spin, winning over every woman who crosses his path!Nikki Coleman has had it, too! The men in her life have been good for one thing: disappointment. There’s her high school sweetheart, Barry, a successful attorney who got someone else pregnant and derailed Nikki’s early hopes of marriage. Then there’s Jomo, a guitarist who’s great in bed—except Nikki’s not the only one he’s great in bed with. There’s Mitchell Stone, an old friend and fellow executive at her record company, who’s handsome but just a little too nice. Last but not least, there’s her father, Gene Coleman, who took a few years to acknowledge that, yeah, she’s his. Now that a case of sexual harassment has Nikki on the verge of losing her job and with it her entire career in the music industry, the lack of a strong man in her life is even more painful. She can survive on her own, but in her heart she wants a Mr. Right to stand by her side and help her ride out the storm.Meanwhile, Mitchell is well on his way to becoming a real Player. With his handbook of “Dog rules” and a new, swaggering style, he’s attracting women left and right. He’s even got Nikki reconsidering their just-friends status. But has this Dog bitten off more than he can chew? And will Mitchell’s newfound womanizing ways come back to bite him before he and Nikki find true love?",
        "Category": " Fiction , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The International Traveller's Guide to Doing Business in the European Union (International Business Traveller's Series)",
        "Authors": "By Morrison, Terri and Conaway, Wayne A.",
        "Description": "The International Traveler's Guide to Doing Business in the European Union has the information you need to succeed. Arranged in an easy-to-use who/what/when/where/why format, it provides vital data on each country in the European Union. Concise enough to be read en route on an airplane trip, it offers the background information every visitor should know before arriving. Each chapter includes notes on the economy, history, legal environment, customs and business styles of a single EU country. It also provides cultural tips (including literature and movies) so that you can discuss the often-intimidating cultural heritage of each country. And if you think you know this information already, try the Cultural IQ Quiz at the beginning of each chapter!",
        "Category": "",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "15.41",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Clever Crafts to Decorate Your Home",
        "Authors": "By Todman, Tonia (EDT)",
        "Description": "This compendium of traditional home crafts features step-by-step instructions, accompanied by full-color illustrations, showing how to make lovely creations from fabric, needlepoint, patchwork, and more.",
        "Category": "",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Potpourri & Scented Bouquets",
        "Authors": "By Effelsberg, Anne",
        "Description": "An illustrated step-by-step guide to creating and designing potpourri and scented bouquets features discussions of the thirty plant species from which to choose and precise instructions.",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Foil (Addison-Wesley series in sports techniques)",
        "Authors": "By Selberg, Charles A.",
        "Description": "",
        "Category": "",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "Fear and Loathing in George W. Bush's Washington",
        "Authors": "By Drew, Elizabeth and Baker, Russell (FRW)",
        "Description": "Many Democrats in the Senate are fearful of George W. Bush and \"his unscrupulous political strategist, Karl Rove,\" writes Elizabeth Drew. The House, meanwhile, is run by Republican Whip Tom DeLay, \"the mean-spirited partisan from Texas\" who has polarized the chamber along party lines.How did we get to this point under a president who ran on a promise to unite rather than divide, and how has our government been affected?Elizabeth Drew's answers to these questions begin by exposing the cynicism of the Bush presidential campaign, orchestrated by Rove. She also reveals the deep division between the neocons in the Defense Department and the realists in the State Department. The controversy between the two camps, she finds, has \"brought out bitterness and knife-wielding of a sort that Washington has seldom seen.\" The result, she concludes, is that \"the increasing unwillingness to compromise is not only blocking legislation but, it is not overdramatic to say, is subverting fundamental concepts of democracy.\"Russell Baker in his preface writes: \"In Washington an age of moral and philosophical sterility is deeply entrenched, and as Elizabeth Drew's reporting attests, the result is not pretty .... Since [the end of the cold war] government has seemed to be mostly about raising money to get elected, and then reelected repeatedly in order to service those who put up the money. There is no moral urgency in it, no philosophical imperative at work.\"",
        "Category": " Political Science , American Government , General",
        "Publisher": "New York Review Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Building Your Church",
        "Authors": "By Cousins, Don",
        "Description": "God wants you to play a vital role in his Kingdom. He’s prepared a custom-made position, perfectly suited to your interests and capacities—a position that allows you to be a key contributor. You can discover how God designed you and find great fulfillment serving him according to that design. This guide helps you discover your role in God’s plan, building on the foundation laid in the previous book in the Walking with God series, Discovering the Church. Whether or not you start with that book, these studies will assist you in finding your niche in the church so you can truly make a difference.",
        "Category": " Religion , Biblical Studies , Bible Study Guides",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Three Complete Novels: Children of the Thunder / The Tides of Time / The Crucible of Time",
        "Authors": "By Brunner, John",
        "Description": "Three works by an award-winning science fiction novelist include The Crucible of Time, Children of the Thunder, and The Tides of Time.",
        "Category": "",
        "Publisher": "Wings",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Arctic",
        "Authors": "By Wallace, Joseph E.",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "19.25",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "The Crow: Temple of Night",
        "Authors": "By Somtow, S. P.",
        "Description": "The Eternal OneAt our human limits, when we've gone as for as flesh and imagination can take us, we meet the Eternal One.The Crow.His alabaster delicate features tell of his ivory goddess ancestry.  Immemorially old, and inconsolable, he is there only for those who seek both revenge and  love, and are willing to go all the way-and beyond.Temple of NightTurn-of-the-century Bangkok is a glittering modern city where high-tech industry and ancient mystery meet.  It is a powerhouse of international finance by day ... and a playground of depravity by night.  The Klong Toey shantytowns are home to shadowy eroticemporiums, where millionaire celebrities act out their darkest sexual fantasies, protected by money, influence, and American diplomacy.Enter a young American journalist, assigned to expose the latest cover-up.  Stephen is about to break the two cardinal rules of journalism: Don't fall in love.  And don't get killed....",
        "Category": " Fiction , Media Tie-In",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "22.69",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "3rd Rock from the Sun: The Official Report on Earth by High Commander Dick Solomon",
        "Authors": "By Glouberman, Michael (EDT), Turner, Terry, and Turner, Bonnie",
        "Description": "The official companion book to the NBC-TV situation comedy about an alien reconnaissance team living as humans in an Ohio college town features an abundance of hilarious, original material not seen on the show. Original. TV tie-in. $100,000 ad/promo.",
        "Category": " Performing Arts , Television , General",
        "Publisher": "HarperPerennial - A division of HarperCollins Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Bistros of Paris",
        "Authors": "By Hamburger, Robert and Hamburger, Barbara",
        "Description": "Looking for an intimate bistro serving customary French fare? Searching for a fashionable wine bar where you can soak in the local color? From the traditional to the trendy -- and everything in between -- you'll find it in Bistros of Paris, the fully updated, classic guide to the best, most affordable restaurants and bars in the world's most romantic city.Classified by arrondissement (neighborhood), rated by quality, with listings of the unique characteristics of each bistro, this handy guide takes you through the city's finest eateries, while offering helpful information on details like where to find special dishes, superb wines, and particular places of interest in the vicinity. Like a trusted tour guide with the best insider tips in town, Bistros of Paris is your key to unlocking the culinary and cultural delights of a city like no other.",
        "Category": " Travel , Food, Lodging & Transportation , Restaurants",
        "Publisher": "Ecco",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Big Fish: A Novel of Mythic Proportions",
        "Authors": "By Wallace, Daniel",
        "Description": "Edward Bloom is dying, and his son William does not truly know him, until William arrives at Edward's deathbed, but since Edward shows no interest in talking to him, William makes up stories that recreate his father's life in heroic proportions. Reissue. (A Columbia Pictures film, written by John August, directed by Tim Burton, releasing Winter 2003, starring Billy Crudup, Ewan McGregor, Jessica Lange, & Albert Finney) (General Fiction)",
        "Category": " Fiction , Media Tie-In",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Girl Who Played Go",
        "Authors": "By Shan, Sa and Hunter, Adriana (NRT)",
        "Description": "In a remote Manchurian town in the 1930s, a sixteen-year-old girl is more concerned with intimations of her own womanhood than the escalating hostilities between her countrymen and their Japanese occupiers. While still a schoolgirl in braids, she takes her first lover, a dissident student. The more she understands of adult life, however, the more disdainful she is of its deceptions, and the more she loses herself in her one true passion: the ancient game of go.Incredibly for a teenager–and a girl at that–she dominates the games in her town. No opponent interests her until she is challenged by a stranger, who reveals himself to us as a Japanese soldier in disguise. They begin a game and continue it for days, rarely speaking but deeply moved by each other’s strategies. As the clash of their peoples becomes ever more desperate and inescapable, and as each one’s untold life begins to veer wildly off course, the girl and the soldier are absorbed by only one thing–the progress of their game, each move of which brings them closer to their shocking fate.In The Girl Who Played Go, Shan Sa has distilled the piercing emotions of adolescence into an engrossing, austerely beautiful story of love, cruelty and loss of innocence.",
        "Category": " Fiction , Literary",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Our Health Our Lives: A Revolutionary Approach to Total Health Care for Women",
        "Authors": "By Hoffman, Eileen",
        "Description": "The classic Our Bodies, Ourselves advised women to seek alternatives to the established medical system. Our Health, Our Lives demonstrates how medicine can function when it serves women's needs, and shows women how to help start that process in their own lives. All women can be empowered to use the health care system to full advantage, to understand female physiology and psychology, to know what questions to ask, and to receive primary care based on the differences that make women's health problems and solutions unique.Offering positive advice with a personal voice, Dr. Hoffman covers an impressive range of topics, including special chapters on heart disease, cancer, diabetes, osteoporosis, fatigue and the immune system, sexuality, menstrual periods, pregnancy, menopause, stress and depression, eating disorders, and addiction. She explains why female hormonal actions give women pathways to illness and health that are different from men's, and illustrates the remarkable effect of these hormonal actions on the cycles of women's lives. Women's bodies here are viewed as complete and complex entities; ovarian function is described as it relates to fertility and to healthy hearts and strong bones. Dr. Hoffman also discusses why male-centered models of psychological development and behavior fail to explain female patterns. With risk assessment, practical preventive measures, screening recommendations, and the latest, most comprehensive information, Our Health, Our Lives is an unparalleled compendium of women's health.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Life, Liberty, and the Pursuit of Happiness",
        "Authors": "By Noonan, Peggy",
        "Description": "\"When last we met, George Bush had just been inaugurated president, Ronald Reagan was waving goodbye to Washington in a helicopter flyby and I had just come back to New York, where I finished a book about being a speechwriter for both. Ultimately my son and I ensconced ourselves in the top of a house in one of Manhattan's old brownstone neighborhoods, where I set up shop as a writer.\"Because of...the facts of my life, I know and have dealings with many people, and am invited to visit their circles, their rings. It is a various world.\"This is in part about that world. It is not a book about big events, but about the day-to-day of thinking and living in a particular era. It is not so much about politics as about life viewed from an inescapably political perspective. And if there is any revolution in it, it is one that is happening within me.\"Life, Liberty and the Pursuit of Happiness begins with particulars. Life is in the details: rediscovering home after a five-year absence; learning where parenthood intersects - and sometimes clashes - with modern culture; measuring the distance between the old and the new America; deciding what one's values are and working out how to live by them within America's unruly cultural landscape. All aspects of our life in America are ennobled through Noonan's gift of observation, for grasping that the profound resides at the heart of the mundane.But as the details of Noonan's life accumulate, they begin to point outward, rippling beyond private interests, brushing against large questions. In \"Liberty,\" Noonan turns to our precarious political culture, and the people who populate it. Ironically, for Noonan, liberty means both freedom from an overtly political life and immersion in it. She takes a tough look at the 1992 Bush campaign, and a hard look at the victor in that election, Bill Clinton - whom she sees as a one-term president.Political culture is not, however, the farthest-flung colony in \"The Pursuit of Happiness.\" From her base in America's cultural capital, New York, Noonan's musings lead her beyond the issues that concern us in the world, to those about which the new America is considerably less confident. Noonan writes of her struggles with reclaiming her faith, with finding a place for God in a country replete with the temptations of Mammon.Throughout Life, Liberty and the Pursuit of Happiness, Peggy Noonan's warmth, wit and wisdom help us remember some of the things Americans know in their hearts, but often forget in their heads. Sharing in her struggles and her victories helps to put the shine back on life in America in the latter days of the twentieth century.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Essential Confucius",
        "Authors": "By Cleary, Thomas (TRN)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Castle",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Mirror, Mirror: Forty Folk Tales for Mothers and Daughters to Share",
        "Authors": "By Yolen, Jane (EDT) and Stemple, Heidi E. Y. (EDT)",
        "Description": "Celebrating the motherdaughter bond around the world, a storyteller teams up with her daughter to assemble this collection of forty folktales that span  the globe, from France's version of Cinderella to less well known stories from Sudan and China. 15,000 first printing.",
        "Category": " Literary Criticism , Feminist",
        "Publisher": "Viking",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "X-Engineering the Corporation: Reinventing Your Business in  the Digital Age",
        "Authors": "By Champy, James",
        "Description": "Argues that a solid strategy is a critical part of managing breakneck changes in information technology, outlining four foundations of the e-engineering process, including propositions, processes, participation, and preparedness. 75,000 first printing.",
        "Category": " Business & Economics , Management",
        "Publisher": "Warner Business Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Hit List",
        "Authors": "By Block, Lawrence",
        "Description": "Keller is a regular guy, a solid citizen. Call him for jury duty and he serves without complaint. He goes to the movies, watches the tube, browses the art galleries, and works diligently on his stamp collection. But every now and then a call from the breezily efficient Dot sends him off to kill a total stranger. He takes a plane, rents a car, finds a hotel room, and gets back before the body is cold.He's a real pro, cool and dispassionate and very good at what he does. Until one day when Dot breaks her own rule and books him for a hit in New York, his home base. She sends him to an art gallery opening, and the girl he gets lucky with steers him to an astrologer. He's a Gemini, his moon's in Taurus . . . and he's got a murderer's thumb.Then the jobs start to go wrong. Targets die before he can draw a bead on them. The realization is slow in coming, but there's no getting around it: Somebody out there is trying to hit the hit man. Keller, God help him, has found his way on to somebody else's hit list.Darker than Keller's conscience, and as riveting, surprising, and wickedly funny as his sensational New York Times bestselling debut, Hit Man, Lawrence Block's Hit List only serves to confirm the Wall Street Journal's estimation of the multiple-award-winning author as \"one of the very best writers now working the beat.\"",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "My Utmost for His Highest (Classic Edition)",
        "Authors": "By Chambers, Oswald",
        "Description": "For nearly eighty years, countless millions of Christians the world over have trusted the spiritual companionship of Oswald Chambers’s classic daily devotional, My Utmost for His Highest. These brief scripture-based readings—by turns comforting and challenging—will draw you into God’s presence and form you as a disciple of the Risen Lord. You’ll treasure their insight, still fresh and vital. And you’ll discover what it means to offer God your very best for His greatest purpose—to truly offer Him your utmost for His highest. This edition includes Chambers’s complete original text, along with helpful subject and scripture indexes.",
        "Category": " Religion , Biblical Meditations , General",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Diary of a Loving Heart",
        "Authors": "By Bacher, June Masters",
        "Description": "",
        "Category": "",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Visions of Nostradamus and Other Prophets",
        "Authors": "By Wigal, Donald",
        "Description": "Presents an evocative assortment of predictions, prophecies, and visions by Nostradamus, Leonardo da Vinci, Jules Verne, Edgar Cayce, Jeane Dixon, and other prophets concerning the forthcoming millennium, scientific discoveries, major political events, potential catastrophes, technological advances, and more.",
        "Category": " Body, Mind & Spirit , Prophecy",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Breakfast With Billy Graham: 120 Daily Readings",
        "Authors": "By Graham, Billy and Deckard, Bill (COM)",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Vine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Different and Wonderful: Raising Black Children in a Race-Conscious Society",
        "Authors": "By Hopson, Darlene Powell and Hopson, Derek S.",
        "Description": "Helps Black parents raise children with self-confidence and strong ethnic identities, and covers day care and school",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Oberst",
        "Authors": "By HARRINGTON, William",
        "Description": "Two British agents and a German double-agent must rescue Henri Mercier, a Parisian Jew whose knowledge of the whereabouts of a hidden cache of gold provides the key to the ultimate liberation of thousands of Jews",
        "Category": " Fiction , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "14.43",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "The Piltdown Confession: A Novel",
        "Authors": "By Schwartz, Irwin",
        "Description": "In 1911 an amateur archaeologist named Charles Dawson uncovered fossil fragments at Piltdown, Sussex, in a dig that appeared to present irrefutable proof that Man had descended from the apes. In 1953 the discovery was shown to have been a hoax.In an amazing blend of fine historical documentation and artful fiction, this book should set to rest all questions about the Piltdown hoax. The text of \"On the matter of Eoanthropus dawsoni,\" the reminiscences of Charles Dawson, is scrupulously annotated here and filled with maps, photos, and diagrams that demonstrate how this meek Edwardian anthropologist succeeded in making monkeys out of Darwin's most ardent advocates.From these annotated pages emerges a darker tale, as we learn what the staid, journalistic studies of the nearly century-old hoax have never told us: about a group of Evangelical extremists who would not stop at murder to suppress support for Darwin's heretical views...about the young priest Pierre Teilhard de Chardin, who enraged members of the Church with his belief that God had created beings that could evolve... about Sir Arthur Conan Doyle, whose real-life sleuthings and interest in spiritualism had led him to investigate the Piltdown affair on his own. The forces of progress and faith clash dramatically in a pastoral English Eden where discovery of the Origin of Man could lead to certain death.Was Dawson the true perpetrator of the Piltdown hoax? Only his modern-day annotator knows for sure, and his identity is perhaps the greatest hoax of all....",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Writing research papers across the curriculum",
        "Authors": "By Hubbuch, Susan M.",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Adventures of Stout Mama",
        "Authors": "By James, Sibyl",
        "Description": "Brief stories share the experiences and outlook of Stout Mama, a feminist teacher",
        "Category": " Fiction , General",
        "Publisher": "Papier Mache Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Disappearing Through the Skylight: Culture and Technology in the Twentieth Century",
        "Authors": "By Hardison, O. B.",
        "Description": "Highlights this century's technology explosion as a major contributor to the alarming dissolution of culture, in a scholarly but witty treatise on the present state, and future, of Western civilization",
        "Category": " Social Science , General",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Travellers in Space and Time",
        "Authors": "By Moore, Patrick",
        "Description": "Takes an imaginary voyage through the solar system to Bernard's Star, galaxies, and beyond, and describes the features of these celestial objects",
        "Category": " Science , General",
        "Publisher": "Dolphin Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Creating Love: The Next Great Stage of Growth",
        "Authors": "By Bradshaw, John",
        "Description": "In Creating Love, John Bradsgaw provides a new way to understand our most crucial relationships: with parents and children, with friends and co-workers, with ourselves, and with God.He shows us how we have been literally \"entranced\" by past experiences of counterfeit love, how we can break these destructive patterns, and how we can open ourselves to the soul-building work of real love.John Bradshaw has touched and changed millions of lives through his nationally televised PBS series and his best-selling books. His previous book, Homecoming, introduced the concept of the inner child to a vast new audience. Now he defines the \"next great stage of  growth\"—how we can work to create healthy, loving relationships in every part of our  lives.Written for everyone who has struggled with painful relationships and is seeking hope and a new direction, Creating Love is a life-changing book.From the Trade Paperback edition.",
        "Category": " Psychology , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "The Best of Times: America in the Clinton Years",
        "Authors": "By Johnson, Haynes",
        "Description": "The Best of Times--the '90s were indeed the best of times. Unprecedented wealth and the breathtaking progress of science and technology ushered in the Internet and the deciphering of the genome. Promises abounded, but a deepening sense of unease hovered over America as the worst of times seemed to be upon us as well-gossip, scandal, and a frenzied media like nothing ever seen before. Based on exclusive interviews with the decade's most influential players, here is a fascinating re-creation of the best and worst episodes of the decade. With sweeping force and cultural acumen, Johnson revives the '90s, the ups and downs, filled with all that we may have forgotten and, most importantly, all that we never knew. In four fascinating parts, Johnson delivers the stories behind the stories-revealing the personalities behind the media party of the '90s, the partisanship that didn't succeed in bringing down the president, the pervasive technology that stretched from Silicon Valley to Monsanto with the corresponding hopes and fears, and the equally extreme reactions on Wall Street to every last bit of it. A tremendous work from a major authority and writer, The Best of Times covers the entire wonderful yet woeful decade, gavel to gavel.Includes interviews with:Book One: TechnotimesNathan Myhrvold, chief technology guru (former), MicrosoftDavid Baltimore, president, Cal Tech University and Nobel Prize winnerBob Shapiro, chief executive officer, Monsanto Regis McKenna, entrepreneurBook Two: TeletimesTed Harbert, head of TV programming, DreamWorks SKGNorman Lear, creator of \"All in the Family\"David Geffen, partner, DreamWorks SKGMichael Bloomberg, head of Bloomberg NewsSteven Brill, founder of Brill's ContentBook Three: Scandal Times Sam Dash, law professor, GeorgetownSenator Alan K. Simpson (former)Senator Dale Bumpers (former)Book Four: Millennial TimesSenator Bob Kerrey (former)Senator John McCainDr. Ruth Faden, medical ethicistIn addition, Johnson interviewed leaders of Congress, top White House aides, cabinet members, and prominent political operatives of both parties in gathering material for this history.A JAMES H. SILBERMAN BOOK",
        "Category": " History , Modern , 20th Century",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Mafia is not an equal opportunity employer",
        "Authors": "By Gage, Nicholas",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Nativity Storytime (Look-Look)",
        "Authors": "By Bragg, Juliana",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "The Memory Prescription: Dr. Gary Small's 14-Day Plan to Keep Your Brain and Body Young",
        "Authors": "By Small, Gary W. and Vorgan, Gigi",
        "Description": "Now in paperback, the fastest proven memory improvement program from the doctor who pioneered the science What did you forget this week--Your car keys? Cell phone? A friend's birthday? Now help is here! New research, pioneered by Dr. Gary Small, shows that you can improve your memory in just two weeks--with a diet high in omega-3 fatty acids, combined with exercise, stress reduction, and a 15-minute-a-day program of memory aerobics. This simple yet effective program is based on years of medical research at one of the country's leading memory loss institutions, and now Dr. Small enables readers to put the results to work for them through his easy to implement, step-by-step regimen than can be customized for each person's specific needs.",
        "Category": " Psychology , Cognitive Psychology & Cognition",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Sleep, Pale Sister",
        "Authors": "By Harris, Joanne",
        "Description": "Before the sweet delight of Chocolat, before the heady concoction that is Blackberry Wine, and before the tart pleasures of Five Quarters of the Orange, bestselling author Joanne Harris wrote Sleep, Pale Sister -- a gothic tourde-force that recalls the powerfully dark sensibility of her novel Holy Fools.Originally published in 1994 -- and never before available in the United States -- Sleep, Pale Sister is a hypnotically atmospheric story set in nineteenth century London. When puritanical artist Henry Chester sees delicate child beauty Effie, he makes her his favorite model and, before long, his bride. But Henry, volatile and repressed, is in love with an ideal. Passive, docile, and asexual, the woman he projects onto Effie is far from the woman she really is. And when Effie begins to discover the murderous depths of Henry's hypocrisy, her latent passion will rise to the surface.Sleep, Pale Sister combines the ethereal beauty of a Pre-Raphaelite painting with a chilling high gothic tale and is a testament to Harris's brimming cornucopia of talents.This P.S. edition features an extra 16 pages of insights into the book, including author interviews, recommended reading, and more.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Little Star",
        "Authors": "By Louchard, Antonin",
        "Description": "This imaginative wordless picture book provides the perfect opportunity for children and adults to share time as they create their own story about a tiny starfish's grand adventure. Inspired by Hubert Michel's poem about a lone starfish that dreams of becoming a celestial star, illustrator Antonin Louchard has created a breathtaking adventure story. Readers of all ages will delight in creating their own interpretations of this allegorical journey.",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Disney Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Rome: A Picture Book To Remember Her By",
        "Authors": "By Smart, Ted and Gibbon, David",
        "Description": "A collection of photographs examines the cultural and historic attraction of the city of Rome, and includes views of such sights as Vatican City, the Forum, and the Colosseum",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "The Towers of Silence (Raj Quartet, Book 3)",
        "Authors": "By Scott, Paul",
        "Description": "A sweeping novel of Britain's last years of rule in India depicts the struggles of Barbara Batchelor, a retired superintendent of Protestant missionary schools",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "The Dinosaur Man: Tales of Madness and Enchantment from the Back Ward",
        "Authors": "By Baur, Susan",
        "Description": "Explores the world of delusional patients and offers an investigation into the ways in which isolated human beings in institutions find meaning in their lives",
        "Category": " Medical , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Robert the Bruce: King of Scots",
        "Authors": "By Scott, Ronald McNair and Scott, Robert McNair",
        "Description": "",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Carroll & Graf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Great Harry: The Extravagant Life of Henry VIII",
        "Authors": "By Erickson, Carolly",
        "Description": "Recreates the extravagant life and times of Henry VIII, following his progression from the radiant heroprince, to the harried ruler fearful of divine vengeance, to the fearsome, murderous king",
        "Category": " History , Europe , Great Britain , General",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Beyond Ritalin: Facts About Medication and Other Strategies for Helping Children, Adolescents, and Adults with Attention Deficit Disorders",
        "Authors": "By Spizman, Robyn Freedman, Garber, Stephen W., Ph.D., and Garber, Marianne Daniels, Ph.D.",
        "Description": "In the late 1980s, ADHD (Attention Deficit Hyperactivity Disorder) and its treatment with the drug Ritalin came to national attention and became one of the most hotly debated health issues. That debate continues to rage today. But for the millions of ADHD children, adolescents and adults, it still remains painfully difficult to get clear and authoritative answers to the many questions that this confusing disorder poses. Do I have a correct diagnosis of ADHD? What kind of medication might be helpful? What else can and should I do to help myself or my child deal with this problem? Now, at last, the authors of Beyond Ritalin, acknowledged experts on ADHD, provide a complete road map and guide for coping with this disorder. Including anecdotal case histories, as well as a complete checklist of ADHD symptoms, charts, work sheets and a comprehensive list of valuable resources and support groups.",
        "Category": " Psychology , Psychopathology , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "What Little Girls Are Made Of: Sugar, Spice, and Everything Nice",
        "Authors": "By Kuck, Sandra (ILT)",
        "Description": "Full of sugar, spice, and everything nice, this free-spirited collection of quotes and musings by beloved writers including Anne Frank and Louisa May Alcott, accompany Scriptures and adorable paintings by Sandra Kuck that masterfully reflect the age of innocence. This tribute to little girls will brighten the lives of parents, grandparents, aunts, and anyone else who has been touched by the sweet smile of a little girl.",
        "Category": " Juvenile Nonfiction , Poetry , General",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Knights and Armor Coloring Book (Dover Fashion Coloring Book)",
        "Authors": "By Smith, A. G.",
        "Description": "You can recapture the excitement of yesteryear's noblest battles with this remarkable pageant of dauntless knights and armor, in coloring book form. Defend the Empire with an authentic Roman legionary, or hold back the fierce Mongol hordes with a dashing Russian chieftain. Meet celebrated leaders such as Richard the Lion-Hearted and Henry VIII, meticulously costumed and detailed. More than 40 dramatic plates — specially designed for you to color — portray the wide range of protective armor in use in Europe from about A.D. 100 to 1640. The attire of Vikings, Crusaders, Italian condottieri, Spanish foot-soldiers and royal jousters all appear in precise, historically accurate line drawings that convey the splendor of chivalry and detail the accoutrements of war. Each plate is accompanied by clear explanatory captions; in addition, a useful glossary of unfamiliar terms and a thoroughly researched introduction offer historical background and more to bring each warrior to life. Twelve full-color illustrations on the covers enable you to reproduce each striking suit of armor in authentic hues.History buffs, military enthusiasts, children and colorists of all ages will revel in this stunning collection of valorous paladins.",
        "Category": " Juvenile Nonfiction , History , Medieval",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Calculus: Single Variable",
        "Authors": "By Hughes-Hallett, Deborah (EDT)",
        "Description": "A revision of the best selling innovative Calculus text on the market. Functions are presented graphically, numerically, algebraically, and verbally to give readers the benefit of alternate interpretations. The text is problem driven with exceptional exercises based on real world applications from engineering, physics, life sciences, and economics. Revised edition features new sections on limits and continuity, limits, l'Hopital's Rule, and relative growth rates, and hyperbolic functions.",
        "Category": " Mathematics , Calculus",
        "Publisher": "Wiley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "John F. Kennedy Jr.: A Life in the Spotlight",
        "Authors": "By Druitt, Michael",
        "Description": "Profiles Kennedy and his famous parents, discusses the problems of growing up in the public's eye, and speculates on his future",
        "Category": " Biography & Autobiography , Artists, Architects, Photographers",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    }
]