[
    {
        "Title": "A Prince of a Guy",
        "Authors": "By Rabe, Sheila",
        "Description": "Successful radio psychologist and single mother Kate Stonewall finds her life turned upside down when her colleague, macho sportscaster Jeff Hardin, moves in next door. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "How to Make and Fly Kites",
        "Authors": "By Eve Barwell, Conrad Bailey",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent Books",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Sir Edmund Hillary and the People of Everest",
        "Authors": "By Keiser, Anne B., Ramsay, Cynthia, and Keiser, Anne B. (PHT)",
        "Description": "When 33-year-old New Zealand beekeeper Edmund Hillary and his Sherpa climbing partner Tenzing Norgay reached the summit of Mt. Everest on May 29, 1953, they congratulated each other with a handshake and a hearty embrace. It was the beginning of a lifelong relationship between Hillary and the Sherpa people-a people whose courage, skill, and generosity of spirit made Himalayan exploration possible.Sir Edmund Hillary and the People of Everest is a story of giving back. The book begins with a vivid recounting of the conquest of Mt. Everest and goes on to beautifully chronicle Hillary's humanitarian and environmental efforts over the last half century. His work on behalf of the Sherpas includes raising funds, building schools, setting up two hospitals, and opening 12 medical clinics. His deep love, respect, and concern for the Sherpa people is unwavering, and his commitment shines through in whatever project is at hand.Using personal interviews and intimate photographs, photographer Anne B. Keiser and writer Cynthia Russ Ramsay paint an insightful portrait of an extraordinary man and his unmatched devotion to preserving the culture of the Sherpa people. When 33-year-old New Zealand beekeeper Edmund Hillary and his Sherpa climbing partner Tenzing Norgay reached the summit of Mt. Everest on May 29, 1953, they congratulated each other with a handshake and a hearty embrace. It was the beginning of a lifelong relationship between Hillary and the Sherpa people-a people whose courage, skill, and generosity of spirit made Himalayan exploration possible.Sir Edmund Hillary and the People of Everest is a story of giving back. The book begins with a vivid recounting of the conquest of Mt. Everest and goes on to beautifully chronicle Hillary's humanitarian and environmental efforts over the last half century. His work on behalf of the Sherpas includes raising funds, building schools, setting up two hospitals, and opening 12 medical clinics. His deep love, respect, and concern for the Sherpa people is unwavering, and his commitment shines through in whatever project is at hand.Using personal interviews and intimate photographs, photographer Anne B. Keiser and writer Cynthia Russ Ramsay paint an insightful portrait of an extraordinary man and his unmatched devotion to preserving the culture of the Sherpa people.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Phillips Collection Catalogue: a Museum of Modern Art and Its Sources",
        "Authors": "By Phillips, Duncan (Intro)",
        "Description": "",
        "Category": "",
        "Publisher": "Jarold And Sons",
        "Price Starting With ($)": "6.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "Hadrian's Wall  (Souvenir Guide)",
        "Authors": "By David J. Breeze",
        "Description": "",
        "Category": "",
        "Publisher": "The Stationery Office Books (Agencies)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "My Deepest Sympathies...: Meaningful Sentiments for Condolence Notes and Conversations, Plus a Guide to Eulogies",
        "Authors": "By Isaacs, Florence",
        "Description": "Never are we more concerned with getting it right than when writing to one who has suffered a loss. In My Deepest Sympathies--, letter-writing guru Florence Isaacs guides us through the ins and outs of offering comfort and support with short yet meaningful notes that will long be remembered by their recipients. She offers guidelines for diverse situations, with sample letters to draw on, so that it's easy to strike the appropriate tone every time.         Isaacs explains that the individual circumstances help determine what's appropriate to say in a sympathy note, and she provides specific techniques for a wide range of relationships, from the death of a coworker's spouse to the loss of a friend's elderly parent from Alzheimer's. She also addresses complex situations like the death of an ex-wife, an estranged sibling, or a longtime companion. She even includes thoughtful words for the death of a pet.Whether it's for a blank note or a few extra lines on a card, Isaacs's advice runs the gamut from personal to professional. And she explains how to provide real help to the bereaved by making phone calls, running errands, or simply lending an ear. Information on funerals, memorial services, and proper etiquette when someone of a different culture has died will help readers avoid missteps in potentially awkward situations. Isaacs closes with techniques for effective eulogies, plus a special appendix of actual eulogies that illustrate ways in which readers can memorialize a loved one for family and friends.         Filled with practical information, My Deepest Sympathies-- makes it simple to say and do the right thing at difficult times.",
        "Category": " Business & Economics , Reference",
        "Publisher": "Potter Style",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Note (Women of Faith Fiction)",
        "Authors": "By Hunt, Angela Elwell",
        "Description": "When the unthinkable happens . . . En route from New York's LaGuardia Airport to Tampa International, Flight 848 bursts into flames and crashes into Tampa Bay. All 261 passengers and crew are killed. For one week, newspaper columnist Peyton MacGruder and her fellow reporters cover one of the nation's worst air disasters in years with overwhelming and numbed emotions.Then a woman Peyton's never met gives her a plastic bag that has washed up behind her house. The bag contains a note, almost certainly from the doomed flight, with a simple yet wrenching message: T- I love you. All is forgiven. -DadCombing through the passenger list to find the victims whose children's names begin with T, Peyton is determined to deliver the note to its proper owner. A quest which will prove as important to Peyton's own life as to the mysterious T.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Westbow Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Practical Guide to Japanese Signs: Making Life Easier, Part 2 (English and Japanese Edition)",
        "Authors": "By Moriyama, Tae",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Kodansha USA Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Thank Heaven for Little Girls",
        "Authors": "By Nawracaj, Carol Ann, Kosann, Monica Rich (PHT), and Kosann, Monica Rich",
        "Description": "A photographic celebration of the joys, trials and adventures of what it means to be a little girl in a big world explains how to teach them how to arrive at adulthood armed with the learning and self-confidence that helps them to pursue their dreams.",
        "Category": " Reference , General",
        "Publisher": "Adams Media Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Healing Power of Garlic, Vinegar & Olive Oil",
        "Authors": "By Gayle Povis Alleman",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Everything Scrabble",
        "Authors": "By Edley, Joe and Williams, John D.",
        "Description": "For both the beginner and the seasoned pro, this how-to book from the National Scrabble Association offers all the keys to better play:Basic board strategies for surefire resultsTurn the enemy -- Q -- into your best friend: a winner's list of Q words with and without UMaster the terrific \"twos\" -- a complete list of two-letter words that can boost your scoring average by thirty to forty pointsMaximize your score with bonus squares and parallel play -- including triple triples, the pinnacle of SCRABBLE scoring successMake more seven-letter plays -- and earn a fifty-point bonusSecrets to getting better tilesHow to get your words' worth with high-point tiles J, X, and ZWords with no vowelsHow the world's greatest players win -- twenty-eight examples of outstanding SCRABBLE playFeaturing a rare interview with the SCRABBLE game inventor, the late Alfred Mosher Butts, this extensively illustrated guidebook covers all facets of the game and worldwide SCRABBLE culture, including the clubs, tournaments, champions and rules, and playing SCRABBLE with children, plus a complete history of the game.Visit the Naiton Scrabble Association Web site: www.scrabble-assoc.com",
        "Category": " Games & Activities , Board Games",
        "Publisher": "POCKET",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Romantic Days and Nights in Houston (Romantic Days and Nights Series)",
        "Authors": "By Briggs, Margaret",
        "Description": "",
        "Category": " Travel , United States , South , West South Central (AR, LA, OK, TX)",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Kaleidoscope: Seeing God's Wit and Wisdom in a Whole New Light",
        "Authors": "By Clairmont, Patsy",
        "Description": "Acclaimed author and Women of Faith speaker Patsy Clairmont causes womens' hearts to leap and their hopes to lift in this quirky, straight-to-the point look at the Proverbs.Understanding the Christian life and the Bible can be a daunting task. But maybe God didn't mean it to be so hard. InKaleidoscope of Proverbs, Patsy Clairmont pieces together some powerful messages from God and reveals new facets of beauty, inspiration, and instruction. Written for busy women, Patsy offers brief, powerful chapters that address the key aspects of their lives, hearts, and relationships.In the Proverbs, God gives us small gems of hope and truth, and in Kaleidoscope of Proverbs,Patsy Clairmont unveils them for readers with her trademark humor and insightful teaching.",
        "Category": " Religion , Biblical Meditations , Old Testament",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Core Curriculum for Neonatal Intensive Care Nursing",
        "Authors": "By Beachy, Patricia (EDT), Deacon, Jane (EDT), and Naacog (Organization) (COR)",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "W B Saunders Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Mac OS X Panther in a Nutshell",
        "Authors": "By Toporek, Chuck, McIntosh, Jason, Stone, Chris, Towns-vonstauber, Leon (CON), Lester, Andy (CON), Lee, Wei Meng (CON), Jepson, Brian (CON), and Rothman, Ernest E. (CON)",
        "Description": "An instant success among newcomers, longtime Apple® fans and serious Unix® users alike, the Mac OS® X operating system combines stability, simplicity and elegance, and a stunning user interface. What more could Mac users want or need? The answer, of course, is Mac OS X Panther--a sleek and powerful overhaul of Mac OS X that promises to revitalize your Mac with improved views of the system, significant improvements to favorite applications, and numerous added conveniences. As with its predecessor, Jaguar, Mac OS X Panther offers plenty of new territory to explore. To show the way, O'Reilly's latest Nutshell book, Mac OS X Panther in a Nutshell, 2nd Edition offers all audiences--both longtime Mac users and hardcore Unix users--the most complete guide to this remarkable operating system.The latest edition of this all-purpose reference leads power users through the newly changed landscape of Mac OS X. Mac OS X Panther in a Nutshell, 2nd Edition provides details about the user-interface elements, system and network administration, and scripting and development. If you want to probe more deeply into the BSD Unix side of Mac OS X, there's a section that delves \"under the hood.\" The book also includes the most complete Unix command reference found in print--with each command and option painstakingly tested and checked against Panther. Even the manpages that ship with the system can't compete in accuracy!Mac OS X Panther in a Nutshell, 2nd Edition offers a thorough treatment of Mac OS X Panther, from its BSD Unix foundation to the finer points of its user interface. It familiarizes readers with the Finder? and the Dock, file management, system configuration, network administration issues, and more, including a clear picture of what's newOther topics covered in the book include:Filesystem overviewRunning Java® applicationsSystem and Network AdministrationDirectory Services and NetInfoScripting on Mac OS X PantherUsing CVSUnix Command ReferenceAn overview of the Apple® X11 distributionMac OS X Panther in a Nutshell, 2nd Edition is the indispensable guide for anyone who wants to know Mac OS X Panther inside and out.",
        "Category": " Computers , Operating Systems , Macintosh",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "7.12",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Storage Made Easy",
        "Authors": "By Manroe, Candace Ord",
        "Description": "Providing innovative, easy-to-adapt suggestions for increasing home storage space, a lavishly illustrated resource covers shelving, furniture adaptation, closet customizing, children's rooms, and more. 25,000 first printing.",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Macmillan First Atlas",
        "Authors": "By Potter, Tony, Turner, Dee, Mitchell, Lyn (ILT), Wright, Nicola, and Wilson, C.",
        "Description": "Introduces children to the principles of map-reading, shows how local areas fit into the larger world, and provides information on the people, wildlife, places of interest, and flags of each area mapped",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Easy Does It Nature Crafts: 60 Seasonal Projects for Quick Gifts and Home Decor (Landauer) Winter, Spring, Summer, Autumn",
        "Authors": "By Landauer Publishing",
        "Description": "Choose from crafting techniques that include beading, decoupage, sponge painting, stamping, flower arranging and wreath making to create 60 projects inspired by nature's beauty. • Four seasons of easy-does-it craft projects • Full-color photos & step-by-step how-to • Materials used are readily available at your local craft store • Basics on materials, supplies and techniques",
        "Category": " Crafts & Hobbies , Nature Crafts",
        "Publisher": "Landauer Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Make Your Own Soft Toys: A Creative Step-by-step Guide",
        "Authors": "By Attwell, Gail",
        "Description": "",
        "Category": "",
        "Publisher": "New Holland Publishers (UK) Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "The Hypothyroid Sourcebook (Sourcebooks)",
        "Authors": "By Rosenthal, M. Sara",
        "Description": "Hypothyroidism is one of the most common forms of thyroid disease. Myriad symptoms are attributed to this disease, including extreme fatigue, depression, headaches, chest pain, constipation, muscle spasms, weight gain, and more. Written by an acclaimed health author afflicted with hypothyroidism, The Hypothyroid Sourcebook offers in-depth explanations of the thyroid and the disease. The book discusses the pros and cons of possible treatments and provides an extensive list of additional resources.",
        "Category": " Medical , Endocrinology & Metabolism",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "THE WORST WITCH (YOUNG PUFFIN STORY BOOKS) [Paperback]",
        "Authors": "By Murphy, Jill",
        "Description": "Loveable but accident-prone Mildred Hubble is possibly the worst witch ever to go to Miss Cackle's Academy for Witches... 'Oh no... You've done it now Mildred!' Mildred Hubble is a trainee at Miss Cackle's Academy for Witches, but she's making an awful mess of it. She keeps getting her spells wrong and crashing her broomstick.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "SQL Instant Reference (SYBEX INSTANT REFERENCE SERIES)",
        "Authors": "By Gruber, Martin",
        "Description": "",
        "Category": " Computers , Programming Languages , SQL",
        "Publisher": "Sybex Inc",
        "Price Starting With ($)": "6.05",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Enchanted Castle (Mini Book) (Disney Princess)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "5374930",
        "Price Starting With ($)": "11.84",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Religion from Tolstoy to Camus",
        "Authors": "By Kaufmann, Walter Ed.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row, Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Organizational Diagnosis: A Workbook Of Theory And Practice",
        "Authors": "By Weisbord, Marvin Ross",
        "Description": "Organizational Diagnosis suggest ways of looking at an organization to determine ”gaps” between ”what is” and ”what ought to be.”In workbook format, the author presents a vocabulary and concepts which quickly help the reader understand many things about an organization and decide what changes need to be made. To help in the diagnosis, a ”six-box model” using the categories if structure, purposes, relationships, rewards, helpful mechanisms, and leadership is provided in Part I. On left-hand pages are presented the vocabulary and concepts of this diagnostic process, the various factors affecting an organization&#39;s performance, and the key elements leading to improvement. The right-hand pages in Part I furnish brief pencil-and-paper exercises for trying out these theories and evaluating any organization the reader is familiar with. Part II consists of annotated readings from leading theory sources, offering opportunities for a more comprehensive study of the diagnostic concepts introduced in Part I of the book. Thus readers can proceed from brief theory, to personal experience, to in-depth study&#151;as they wish. The six-box framework provides a way of organizing experience that makes sense to managers.Weisbord&#39;s concepts have been applied successfully to work teams, industrial firms, government agencies, universities, medical centers, and small businesses. They can be used as a ”cognitive” framework for team development, management training, supervisory training courses, organizational behavior education, or diagnostic self-study.The two parts, theory and practice in the first section plus resource readings in the second, make this an ideal book around which to design introductory courses in organizational behavior, as part of undergraduate or graduate management training. The book may also be used in continuing education courses, whether oriented toward industry, the public sector, or health care.",
        "Category": " Business & Economics , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Jonathan's Wife",
        "Authors": "By Holmes, Dee",
        "Description": "When an accident shatters her husband's body and renders it impossible for them to have children, Sarah Brennan hires Lee Street to help her husband through physical therapy and is drawn into a shameful affair with Lee. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Airport",
        "Authors": "By Arthur Hailey",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "8.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Trial",
        "Authors": "By Robert Whitlow",
        "Description": "",
        "Category": "",
        "Publisher": "Word Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Can't Stand The Heat (Recipe for Love)",
        "Authors": "By Edwards, Louisa",
        "Description": "For sharp-tongued food critic Miranda Wake, the chance to spend a month in Adam Temple’s kitchen to write an exposé is a journalistic dream come true. Surely Miranda can find a way to cut the hotshot chef down to size once she learns what really goes on at his trendy Manhattan restaurant. But she never expected Adam to find out her most embarrassing secret: she has no idea how to cook.Adam’s not about to have his reputation burned by a critic who doesn’t even know the difference between poaching and paring.  He’ll just have to give the tempting redhead a few private lessons of his own—teaching her what it means to cook with passion…and doing more with his hands than simply preparing sumptuous food.",
        "Category": " Fiction , Romance , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "The Henry Holt Guide to Astronomy",
        "Authors": "By Baker, David and Hardy, David A. (ILT)",
        "Description": "Reviews what is known about the stars, planets, galaxies and comets, discusses telescopes and observation techniques, and includes maps of each constellation",
        "Category": " Science , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "How to Start and Run a Successful Consulting Business",
        "Authors": "By Kishel, Gregory F. and Kishel, Patricia Gunter",
        "Description": "How to Start and Run a Successful Consulting Busines Written for anyone with ideas, information, or skills to sell, this invaluable guide shows you how to make the most of your talents, putting them to work for yourself and your clients. Drawing on their own experiences as management consultants, Gregory and Patricia Kishel offer down-to-earth advice on what it takes to succeed as a consultant, where the opportunities are, and the types of situations you are likely to encounter. Step by step, you will learn all the aspects of becoming an independent consultant, including: How to choose a specific field and set up business How to determine fees and market your services How to get referrals and maintain good client relations What kinds of insurance you should have How to win government contracts, enter foreign markets, and much more Whatever your area of specialization, this indispensable book will give you the information you need to build and maintain a profitable consulting business",
        "Category": " Business & Economics , Consulting",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "No Strings Attached",
        "Authors": "By Criswell, Millie",
        "Description": "When Samantha Brady, plagued by writer's block and her never-ending search for Mr. Right, sleeps with her roommate and best friend, Jack Turner, after drinking too much wine, she discovers that the perfect man she has been searching for has been right in front of her all this time. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "HQN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Athens Ancient Byzantine Modern City Museums",
        "Authors": "By C GOUVOUSSIS",
        "Description": "",
        "Category": "",
        "Publisher": "Editions K. Gouvoussis Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "We the Children (1) (Benjamin Pratt and the Keepers of the School)",
        "Authors": "By Clements, Andrew and Stower, Adam (ILT)",
        "Description": "Benjamin Pratt’s school is about to become the site of a new amusement park. It sounds like a dream come true! But lately, Ben has been wonder if he’s going to like an amusement park in the middle of his town—with all the buses and traffic and eight dollar slices of pizza. It’s going to change everything. And, Ben is not so big on all the new changes in his life, like how his dad has moved out and started living in the marina on what used to be the \"family” sailboat. Maybe it would be nice if the school just stayed as it is. He likes the school. Loves it, actually. It’s over 200 years old and sits right on the harbor. The playground has ocean breezes and the classrooms have million dollar views…MILLION DOLLAR views. And after a chance—and final—run-in with the school janitor, Ben starts to discover that these MILLION DOLLAR views have a lot to do with the deal to sell the school property. But, as much as the town wants to believe it, the school does not belong to the local government. It belongs to the CHILDREN and these children have the right to defend it! Don’t think Ben, his friend Jill (and the tag-along Robert) can ruin a multimillion dollar real estate deal? Then you don’t know the history and the power of the Keepers of the School. A suspenseful six book series, book one, We the Children, starts the battle on land and on sea. It’s a race to keep the school from turning into a ticket booth and these kids are about to discover just how threatening a little knowledge can be.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Meg Mackintosh and the Case of the Curious Whale Watch - title #2: A Solve-It-Yourself Mystery (2) (Meg Mackintosh Mystery series)",
        "Authors": "By Landon, Lucinda",
        "Description": "Set aboard a whale-watch boat, this dual mystery involves Captain Quinn's hundred-year-old treasure map and the still-unfound treasure it leads to and the disappearance of the map midway through the voyage.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Secret Passage Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Origin of Species (Barnes & Noble Classics Series)",
        "Authors": "By Darwin, Charles and Levine, George (INT)",
        "Description": "&&LDIV&&R&&LDIV&&R&&LI&&RThe Origin of Species&&L/I&&R, by &&LB&&RCharles Darwin&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&ROn December 27, 1831, the young naturalist &&LB&&RCharles Darwin&&L/B&&R left Plymouth Harbor aboard the HMS Beagle. For the next five years, he conducted research on plants and animals from around the globe, amassing a body of evidence that would culminate in one of the greatest discoveries in the history of mankind—the theory of evolution. &&L/P&&R&&LP&&RDarwin presented his stunning insights in a landmark book that forever altered the way human beings view themselves and the world they live in. In &&LI&&RThe Origin of Species&&L/I&&R, he convincingly demonstrates the fact of evolution: that existing animals and plants cannot have appeared separately but must have slowly transformed from ancestral creatures. Most important, the book fully explains the mechanism that effects such a transformation: natural selection, the idea that made evolution scientifically intelligible for the first time. &&L/P&&R&&LP&&ROne of the few revolutionary works of science that is engrossingly readable, &&LI&&RThe Origin of Species&&L/I&&R not only launched the science of modern biology but also has influenced virtually all subsequent literary, philosophical, and religious thinking. &&L/P&&R&&LP&&R&&LB&&RGeorge Levine&&L/B&&R, Kenneth Burke Professor of English Literature at Rutgers University, has written extensively about Darwin and the relation of science and literature, particularly in&&LI&&R Darwin and the Novelists&&L/I&&R. He is the author of many related books, including &&LI&&RThe Realistic Imagination, Dying to Know&&L/I&&R, and his birdwatching memoirs, &&LI&&RLifebirds&&L/I&&R. &&L/P&&R&&L/DIV&&R",
        "Category": " Science , Life Sciences , Evolution",
        "Publisher": "Sterling Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "After Hours",
        "Authors": "By Erickson, Lynn",
        "Description": "NYPD Detective Nick Sinestra earns extra money moonlighting as a bodyguard--and selling celebrity secrets to a tabloid. But his conscience begins to sting when he shadows society wallflower Portia Carr Wells.  Continuing her late husband's work for the Nature Preservation Society, Portia has made some enemies. She just never thought Nick was one of them. And as threats against her are played out, her mind rails against trusting him. But desire has a mind of its own.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Miles to Go",
        "Authors": "By Cyrus, Miley and Liftin, Hilary",
        "Description": "“There are multiple sides to all of us. Who we are and who we might be if we follow our dreams.”                                   -Miley Cyrus  Three years ago, Miley Cyrus was a virtual unknown. Her life in rural Tennessee was filled with family, friends, school, cheerleading, and the daily tasks of living on a farm. And then came a little show called Hannah Montana.  Almost overnight, Miley would rocket to superstardom, becoming a television and singing phenomenon. Quiet days were replaced with sold-out concerts, television appearances, and magazine shoots. But through it all, Miley has remained close to her family and friends and has stayed connected to the Southern roots that made her so strong.  In Miles to Go, Miley offers an honest, humorous, and often touching story of one girl's coming-of-age--from private moments with her pappy to off-roading with her dad, Billy Ray, to her run-ins with mean girls. Miley talks about suffering through drama and heartbreak and coming out the other end unscathed (relatively). And now for the first time, she will discuss it all?the milestones still left to reach (driver’s license! voting!), dreams to live out (travel to Asia! find true love!), and the lessons to be learned (remembernig to enjoy every moment!).  This is a truly unique look inside the world of one of today’s biggest and brightest stars as she tackles looking back and moving forward.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Music",
        "Publisher": "Disney Hyperion",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "The Burning Wire: A Lincoln Rhyme Novel",
        "Authors": "By Deaver, Jeffery",
        "Description": "SOON TO BE A MAJOR TELEVISION EVENT FROM NBC, STARRING RUSSELL HORNSBY, ARIELLE KEBBEL, AND MICHAEL IMPERIOLI. From New York Times bestselling author Jeffery Deaver—Lincoln Rhyme is back, and on the trail of a killer whose weapon of choice cripples New York City with fear.The weapon is invisible and omnipresent. Without it, modern society grinds to a halt. It is electricity. The killer harnesses and steers huge arc flashes with voltage so high and heat so searing that steel melts and his victims are set afire. When the first explosion occurs in broad daylight, reducing a city bus to a pile of molten metal, officials fear terrorism. Rhyme, a world-class forensic criminologist known for his successful apprehension of the most devious criminals, is immediately tapped for the investigation. Long a quadriplegic, he assembles NYPD detective Amelia Sachs and officer Ron Pulaski as his eyes, ears and legs on crime sites, and FBI agent Fred Dellray as his undercover man on the street. As the attacks continue across the city at a sickening pace, and terrifying demand letters begin appearing, the team works desperately against time and with maddeningly little forensic evidence to try to find the killer. Or is it killers…? Meanwhile, Rhyme is consulting on another high-profile investigation in Mexico with a most coveted quarry in his crosshairs: the hired killer known as the Watchmaker, one of the few criminals to have eluded Rhyme’s net. Juggling two massive investigations against a cruel ticking clock takes a toll on Rhyme’s health. Soon Rhyme is fighting on yet another front—and his determination to work despite his physical limitations threatens to drive away his closest allies when he needs them most…",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "Side Show Piano, Vocal and Guitar Chords",
        "Authors": "By Kreiger, Henry (COP)",
        "Description": "(Vocal Selections). This collection features PVG arrangements of 16 songs from the recent Broadway run of this controversial, critically acclaimed new musical that will be opening next year in Europe. Songs include: Come Look at the Freaks * The Devil You Know * Feelings You've Got to Hide * I Will Never Leave You * Leave Me Alone * Like Everyone Else * One Plus One Equals Three * Private Conversation * Say Goodbye to the Freak Show * Tunnel of Love * We Share Everything * When I'm by Your Side * You Should Be Loved * and more. Includes color photos from the Broadway production.",
        "Category": " Music , Printed Music , General",
        "Publisher": "Hal Leonard",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Scarlet Nights: An Edilean Novel (Edilean Novels)",
        "Authors": "By Deveraux, Jude",
        "Description": "What if you learned that your fiancé was not who he claimed to be? Engaged to the charming and seductive Greg Anders, Sara Shaw is happily anticipating her wedding in Edilean, Virginia. The date has been set, the flowers ordered, even her heirloom dress is ready. But just three weeks before the wedding, Greg gets a telephone call during the night and leaves without explanation. Two days later, a man climbs up through a trapdoor in the floor of Sara’s apartment, claiming that he is the brother of her best friend and that he’s moving in. While Mike Newland is indeed telling the truth about his identity, his reason for being there reaches far deeper. He’s an undercover detective, and his assignment is to use Sara to track down a woman who is one of the most notorious criminals in the United States—and also happens to be the mother of the man Sara plans to marry. Mike thinks the job will be easy—if he can figure out how to make a “good” girl like Sara trust him, that is. But Mike has no idea what this mission has in store for him. He’s worked hard to keep private his connections to Edilean, which date back to his grandmother’s time there in 1941. But as Mike and Sara get to know each other, he can’t help but share secrets about himself that he’s told no one else. And in return, Sara opens up to Mike about things she could never reveal to Greg. As the pair work together to solve two mysteries, their growing love begins to heal each of them in ways they never could have imagined.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "The Rising, The new Kid: Book Two (The New Kid Series)",
        "Authors": "By Mathews, Temple",
        "Description": "",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Borders",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The Films Of Mel Gibson",
        "Authors": "By McCarty, John",
        "Description": "",
        "Category": " Performing Arts , Film , General",
        "Publisher": "Citadel",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Celebrate V: Jubilee Edition for Cake Decorators",
        "Authors": "By Sullivan, Eugene T. and Sullivan, Marilynn C.",
        "Description": "",
        "Category": "",
        "Publisher": "Wilton Enterprises",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Buggy Riddles: Level 3 (Easy-to-Read, Puffin)",
        "Authors": "By Taback, Simms (ILT), Hall, Katy, and Eisenberg, Lisa",
        "Description": "An illustrated collection of insect riddles including \"Why do bees hum?  They don't know the words!\" and \"What is the best year for grasshoppers?  Leap year!\"",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "5 Steps to a 5 on the AP: Statistics",
        "Authors": "By Hinders, Duane C.",
        "Description": "For the more than one million students taking the AP exams each year  Boxed quotes offering advice from students who have aced the exams and from AP teachers and college professors  Sample tests that closely simulate real exams  Review material based on the contents of the most recent tests  Icons highlighting important facts, vocabulary, and frequently asked questions  Websites and links to valuable online test resources, along with author e-mail addresses for students with follow-up questions  Authors who are either AP course instructors or exam developers",
        "Category": " Study Aids , Study & Test-Taking Skills",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Quotable Saints",
        "Authors": "By Chervin, Ronda De Sola (COM)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Servant Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Awesome Yo-Yo tricks",
        "Authors": "By shar-levine-bob-bowden",
        "Description": "",
        "Category": "",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Lost Queen (Faerie Path, No. 2)",
        "Authors": "By Jones, Frewin",
        "Description": "Tania is a princess of Faerie. And now she must return to the Mortal World.Once, Anita was an ordinary girl on the eve of her sixteenth birthday. Now she has assumed her true identity as Tania, the long-lost princess of the elegant Faerie court. She and her true love, Edric, must return to the Mortal World to seek her Faerie mother, Queen Titania, who disappeared hundreds of years ago searching for Tania. In London, Tania is torn between her mortal life and her new one. Dangers lurk, and Tania's two worlds soon collide in amazing and frightening ways she never could have anticipated . . .",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Seventh Daughter (The Faerie Path #3)",
        "Authors": "By Jones, Frewin",
        "Description": "Tania has brought the long-lost Queen Titania back to Faerie from the Mortal World of modern London. But when they cross between the worlds, they find only devastation. The Sorcerer King of Lyonesse—ancient enemy of the Faerie Court—has been released from his amber prison. As the wicked sorcerer regains his power, King Oberon, Tania's father, is imprisoned and the Faerie Court is being destroyed. Tania and her true love, Edric, must travel the Realm to try to find and rescue King Oberon, who is their only hope for defeating the evil Sorcerer King. And Tania must prepare for battle . . . and to fight a war that she may not survive.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Dreams of a Dark Warrior (Immortals After Dark Series, Book 9)",
        "Authors": "By Cole, Kresley",
        "Description": "HE VOWED HE’D COME FOR HER . . . Murdered before he could wed Regin the Radiant, warlord Aidan the Fierce seeks his beloved through eternity, reborn again and again into new identities, yet with no memory of his past lives. SHE AWAITS HIS RETURN . . . When Regin encounters Declan Chase, a brutal Celtic soldier, she recognizes her proud warlord reincarnated. But Declan takes her captive, intending retribution against all immortals—unaware that he belongs to their world. TO SATE A DESIRE MORE POWERFUL THAN DEATH . . . Yet every reincarnation comes with a price, for Aidan is doomed to die when he remembers his past. To save herself from Declan’s torments, will Regin rekindle memories of the passion they once shared—even if it means once again losing the only man she could ever love?",
        "Category": " Fiction , Romance , Paranormal",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "How to be the Lord's prayer",
        "Authors": "By Elliott, Norman",
        "Description": "",
        "Category": "",
        "Publisher": "Word Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The Encyclopedia of Animals : Mammals, Birds, Reptiles, Amphibians",
        "Authors": "By Cogger, Harold G., Gould, Edwin, and Forshaw",
        "Description": "",
        "Category": "",
        "Publisher": "Fog City Press",
        "Price Starting With ($)": "8.93",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Free at Last: Breaking the Cycle of Family Curses",
        "Authors": "By Huch, Larry",
        "Description": "",
        "Category": " Religion , Christian Rituals & Practice , General",
        "Publisher": "Albury Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Life Without Strife: How God Can Heal and Restore Broken Relationships",
        "Authors": "By Meyer, Joyce",
        "Description": "For Ingest Only - Data needs to be cleaned up for all products being loaded",
        "Category": "",
        "Publisher": "Creation House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Deeper Water (Tides of Truth Series, Book 1)",
        "Authors": "By Whitlow, Robert",
        "Description": "The Tides of Truth novels follow one lawyer's passionate pursuit of truth in matters of life and the law.In the murky waters of Savannah's shoreline, a young law student is under fire as she tries her first case at a prominent and established law firm. A complex mix of betrayal and deception quickly weaves its way through the case and her life, as she uncovers dark and confusing secrets about the man she's defending--and the senior partners of the firm. How deep will the conspiracy run? Will she have to abandon her true self to fulfill a higher calling? And how far will she have to go to discover the truth behind a tragic cold case?",
        "Category": " Fiction , Christian , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "A Pocket Guide to Hawai'i's Birds",
        "Authors": "By Pratt, H. Douglas and Jeffrey, Jack",
        "Description": "",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Mutual Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2013"
        }
    },
    {
        "Title": "Yard & Garden Owners Manual: Your complete guide to the care and upkeep of everything outdoors (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books (EDT)",
        "Description": "Fresh ideas on caring for all aspects of the outdoor areas around a home—from plants and the garden to the deck, patio, and driveway.Focused on what, when, and how to care for the yard.Extension-quality information in an easy to use step-by-step format.Highlights caring for the landscape to create comfortable and low-stress outdoor living.",
        "Category": " Gardening , General",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "5.75",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Most Beautiful Place in the World",
        "Authors": "By Allen, Thomas B. (ILT) and Cameron, Ann",
        "Description": "\"Seven-year-old Juan lives in Guatemala, a place of stunning beauty and grim economic reality. Abandoned by his mother, Juan lives with his grandmother and shines shoes. He passionately wants to attend school, but fears Grandmother will say no. Finally gathering his courage, he is surprised when she not only agrees to send him to school but also chides him about the importance of standing up for himself. Juan tells this bittersweet story, which reads smoothly and powerfully on several levels, with warmth and dignity.\"--Booklist.",
        "Category": " Juvenile Fiction , Social Themes , Values & Virtues",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The USA Pavilion Expo 2010 Shanghai: Rising to the Challenge",
        "Authors": "By Lavin, Frank (EDT) and Denison, Edward (PHT)",
        "Description": "This illustrated souvenir guidebook to the American Pavilion at the 2010 Shanghai World Expo will take readers through the process of developing this $60-million dollar exhibition, offering an insider's look at the high-tech 3-D entertainment, the cutting-edge architecture and the unique personalities (e.g. Secretary of State Hillary Clinton) involved in bringing the project to fruition.",
        "Category": " Architecture , Buildings , General",
        "Publisher": "Editions Didier Millet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "History of Mexico: From Pre-Hispanic Times to the Present Day",
        "Authors": "By Gonzalez, Stella M. & Blazquez, Carmen G.",
        "Description": "",
        "Category": "",
        "Publisher": "panorama",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Back on the Career Track: A Guide for Stay-at-Home Moms Who Want to Return to Work",
        "Authors": "By Cohen, Carol Fishman and Rabin, Vivian Steir",
        "Description": "If you're a stay-at-home mom considering going back to work, these are some of the questions that have likely come to mind. Returning to the workforce can be a daunting prospect. It requires reigniting old contacts (including those with coworkers once your junior), marketing yourself strategically, and building confidence-whether you've been out of the workforce for two, six, or fifteen years.  Carol Fishman Cohen and Vivian Steir Rabin understand, because they've been there. As Harvard MBAs who successfully relaunched their own careers after staying home full-time with their children, they know it can be done-with careful planning, strategizing, and creativity. Now, in BACK ON THE CAREER TRACK, they offer a prescriptive, seven-step program that includes: ·  Assessing career options and updating job skills ·  Networking and preparing for interviews ·  Getting the family on board. Packed with expert advice from career counselors and recruiters, and insightful stories from others who have been through the process, this book also offers an inside look at what employers and universities are doing to help relaunchers today-including how many businesses are recognizing them as valuable assets.   As frequent speakers to women's groups, professional schools, and corporations, Cohen and Rabin provide a thorough, unique program from two experts on the topic of career reentry. BACK ON THE CAREER TRACK is sure to become the classic guide in the field.",
        "Category": " Business & Economics , General",
        "Publisher": "Business Plus",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Our Incoming World Government:God's Kingdom",
        "Authors": "By Watch Tower Bible and Tract Society",
        "Description": "",
        "Category": "",
        "Publisher": "Brooklyn Watchtower Bible and Tract Society",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Duties of the Ruling Elder",
        "Authors": "By Paul S. Wright",
        "Description": "",
        "Category": "",
        "Publisher": "Westminster Press",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "A Charmed Life: Growing Up in Macbeth's Castle",
        "Authors": "By Campbell, Liza",
        "Description": "A Charmed Life tells the story of Liza Campbell, the last child to be born at the impressive and renowned Cawdor Castle, the same locale featured in Shakespeare's Macbeth. It was at the historical ancestral home that Liza's seemingly idyllic fairytale childhood began to resemble a nightmare.     Increasingly overwhelmed by his enormous responsibilities, Liza's father Hugh, the twenty-fifth Thane of Cawdor, tipped into madness fueled by drink, drugs, and extramarital affairs. Over the years, the castle was transformed into an arena of reckless extravagance and terrifying domestic violence, as Liza and her siblings watched their father destroy himself, his family, and their centuries-old legacy.      Painstakingly honest, thoroughly entertaining, and sharply written, Campbell's contemporary fairytale tells of growing up as a maiden in a castle where ancient curses and grisly events from centuries ago live on between its stone walls. \"[A] courageous memoir . . . a page turner set among moats, drawbridges, and portcullises both real and metaphorical.\" —Vogue\"Superbly written.\" —Harper's Bazaar\"Poignant . . . lovely.\" —Entertainment Weekly\"Edged with relentless wit . . . [A Charmed Life is a] nightmarish memoir that gives fiction a run for its money.\" —Kirkus Reviews\"Intriguing...[a] highly readable story...extraordinary.\" —Tucson Citizen",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Cocktails For Dummies Pocket edition (For Dummies pocket Edition)",
        "Authors": "By Ray Foley",
        "Description": "",
        "Category": "",
        "Publisher": "Wiley Publishing Co",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Trouble-Free Travel With Children: Helpful Hints for Parents on the Go",
        "Authors": "By Lansky, Vicki",
        "Description": "Gives practical advice on planning a trip, packing, selecting a car seat, backpack or stroller, making hotel reservations, and traveling by car, bus, train, or airplane",
        "Category": "",
        "Publisher": "Book Peddlers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Traveler's Little Book of Wisdom",
        "Authors": "By Scott, David L. and Forgey, William W.",
        "Description": "",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Ics Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Girl's Got Bite : Unofficial Guide to Buffy's World",
        "Authors": "By Tracy, Kathleen",
        "Description": "Discusses the motion picture and television series about Buffy the Vampire Slayer and includes cast biographies and summaries of each TV episode",
        "Category": " Performing Arts , Television , General",
        "Publisher": "Renaissance Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Celtic Borders & Decoration",
        "Authors": "By Davis, Courtney and Paterson, Helena",
        "Description": "",
        "Category": " Design , Decorative Arts",
        "Publisher": "England: Blandford, 1992",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Strongbow: The Story of Richard And Aoife",
        "Authors": "By Llywelyn, Morgan",
        "Description": "A story based on true events of twelfth-century Ireland follows the adventure of Richard de Clare, a great Norman knight, and Aoife, a free-spirited princess who is sworn to protect her people. Reprint.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Fantasy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Student Development in College: Theory, Research, and Practice (Jossey Bass Higher & Adult Education Series)",
        "Authors": "By Evans, Nancy J., Forney, Deanna S., Guido-Dibrito, Florence, and Florence, Guido-Dibrito",
        "Description": "This sweeping resource gathers together in one volume the diverse body of theory informing our understanding of students' intellectual, cognitive, social, moral, and identity development during the college years. It critically examines the recent body of theory that reflects the changes, complexity, and diversity of today's campuses with special emphasis on gender and cultural differences in student development.",
        "Category": " Education , Administration , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Mother's Day Ideals, 1993",
        "Authors": "By Ideals Publications Inc",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "King John, 1167-1216",
        "Authors": "By Warren, W. L.",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Japanese Have a Word for It: The Complete Guide to Japanese Thought and Culture",
        "Authors": "By De Mente, Boye",
        "Description": "",
        "Category": " Foreign Language Study , Japanese",
        "Publisher": "Passport Books",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Twilight Prophecy (Children of Twilight)",
        "Authors": "By Shayne, Maggie",
        "Description": "Book 14 in Maggie Shayne&#39;s Bestselling Wings in the Night SeriesTHE FINAL BATTLE BETWEEN HUMANS AND VAMPIRES IS AT HANDAccording to ancient prophecy, there&#39;s only one chance to avert the annihilation of the Undead. Twins James and Brigit Poe, part human, part vampire, believe that they are that chance. In fact, the key lies with the reclusive and mortal scholar Lucy Lanfair—and Lucy&#39;s heart lies with James.Against his own moral code, James draws Lucy into the war between vampires and humans, hoping to turn the tide, but the truth is it&#39;s a war no one can win. Lucy knows this, and she knows something else, as well: only by saving James from his own inner darkness can she save the world from being torn apart and, in the process, ensure herself a future with the man she loves.Don&#39;t miss a single title in Maggie Shayne&#39;s Wings in the Night series:Twilight PhantasiesTwilight MemoriesTwilight Illusions, with bonus novella Beyond TwilightBorn in Twilight, with bonus novella Twilight VowsTwilight HungerEmbrace the Twilight, with bonus novella Run from TwilightEdge of TwilightBlue Twilight, with bonus novella Before Blue TwilightPrince of TwilightDemon&#39;s KissLover&#39;s BiteAngel&#39;s PainBloodline, with bonus novella Vampires in ParadiseTwilight ProphecyTwilight Fulfilled",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "My First Book of Pilates",
        "Authors": "By Morgan, Miranda",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes and Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Rachael Ray 30-Minute Meals Get Togethers",
        "Authors": "By Ray, Rachael",
        "Description": "The popular host of The Food Network's 30-Minute Meals and $40 a Day shares the secret to making entertaining seem effortless by using readily available ingredients and provides readers with recipes and tips to preparing great food and drinks for company.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Lake Isle Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Webster's Beginning Book of Facts",
        "Authors": "By Springfiel",
        "Description": "A collection of articles for beginning readers provides information on science, technology, animals, ecology and geography, and the human body",
        "Category": "",
        "Publisher": "Merriam Webster",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "THE TERRITORIAL IMPERATIVE.",
        "Authors": "By Robert Ardrey",
        "Description": "",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "7.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Post Traumatic Stress Disorder: The Victim's Guide to Healing & Recovery",
        "Authors": "By Flannery, Raymond B., Jr.",
        "Description": "A basic introduction to PTSD.  Written for victims, it is a helpful source for understanding the responses a psychologically healthy person is likely to undergo after experiencing an acute tramatic episode.  --Journal of Tramatic Stress",
        "Category": " Psychology , Mental Health",
        "Publisher": "Crossroad",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The medieval foundations of England (Perpetua book)",
        "Authors": "By Sayles, G. O",
        "Description": "",
        "Category": "",
        "Publisher": "A.S. Barnes & Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Criminological Theories: Introduction, Evaluation, and Application",
        "Authors": "By Akers, Ronald L. and Sellers, Christine Sharon",
        "Description": "Now in a new edition, Criminological Theories: Introduction, Evaluation, and Application offers a concise yet comprehensive review and appraisal of the leading theories of crime and criminal justice. Based on the widespread success of the first four editions, this popular resource has been updated and revised to reflect changes in the development, testing, integration, and application of essential criminological theories.In clear, engaging language, authors Ronald L. Akers and Christine S. Sellers explore each principal criminological theory through the following in-depth analysis:* Introduction: Presents a succinct exposition of the theory's central concepts, assertions, and hypotheses--including recent modifications and revisions* Evaluation: Provides a detailed critique of the theory, with a focus on empirical validity* Application: Extends the evaluation to determine each theory's relevance, as well as its potential for controlling and preventing crime and delinquencyTo draw students into the material, the fifth edition incorporates a helpful new resource that provides an overview of every major theory of criminal and deviant behavior--Table 12.1. An invaluable pedagogical tool, this table directs students to the corresponding chapter for each theory; it also includes brief entries on each theory's major proponents, concepts, propositions, empirical validity, and policy implications. Encouraging students to carefully review--and thoughtfully compare--these theories, the table creates a dynamic connection between readers and the text.Ideal for courses on theories of crime, delinquency, and deviance, Criminological Theories, Fifth Edition, also serves as an excellent supplement for courses in criminology, juvenile delinquency, deviance, and criminal behavior.",
        "Category": " Social Science , Criminology",
        "Publisher": "Roxbury Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Eccentric and Bizarre Behaviors",
        "Authors": "By Franzini, Louis R. and Grossberg, John M., Ph.D.",
        "Description": "An engrossing look into the heart of twelve of the strangest psychological disorders known to scienceIn a book reminiscent of Oliver Sacks' The Man Who Mistook His Wife for a Hat, psychologists Louis Franzini and John Grossberg take us behind the tabloid headlines and media exposes to tell the real-life stories of emotionally damaged men and women driven to horrific extremes in their efforts to gratify their basic human needs for love and attention.Writing with compassion and offering many profound insights into the human condition, the authors provide rare, often wrenching, glimpses into the tortured worlds of necrophiliacs, who make love only to corpses, and \"werewolves\" who commit unthinkable acts of mutilation and cannibalism; of men paralyzed by the terrifying belief that their penises are disappearing into their bodies, and compulsive hair pullers, who pluck every last hair from their flesh; of paranoids who believe they are being stalked by their evil twins, and those convinced that everyone close to them is an imposter; and many others.All of the stories contained in Eccentric and Bizarre Behaviors are based on actual case studies. Throughout, Drs. Franzini and Grossberg discuss, in terms that general readers can understand, both the known and conjectural causes for the strange disorders they describe. And, in many cases, they recount the stirring details of how patients were ultimately rescued from the eccentric and bizarre patterns of behavior in which they had become imprisoned.",
        "Category": " Psychology , Psychopathology , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Rider's Handbook",
        "Authors": "By Gordon, Sally",
        "Description": "A guide for experts and beginners covering such topics as the purchase, care, feeding, grooming, exercising, and health of horses; equipment; competitions; and European, Western, and side-saddle styles of riding.",
        "Category": "",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "November",
            "Year": "1980"
        }
    },
    {
        "Title": "Core J2Ee Patterns: Best Practices and Design Strategies",
        "Authors": "By Malks, Dan, Crupi, John, and Alur, Deepak",
        "Description": "This guide presents the best practices for development using J2EE technologies and details 21 design patterns that produce applications notable for their performance, scalability, and robustness.  A multi-tier case study illustrates every stage of enterprise development, and sample code is provided.  Common mistakes are identified, so they can be avoided.  The authors are Java architects and engineers. Annotation (c) Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Computers , Programming Languages , Java",
        "Publisher": "Pearson P T R",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Script Alphabets Book 7",
        "Authors": "By Tew, Harriette",
        "Description": "",
        "Category": "",
        "Publisher": "Hutspot House, Thomasville, NC",
        "Price Starting With ($)": "5.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Spanish Texans",
        "Authors": "By Institute of Texan Cultures",
        "Description": "",
        "Category": "",
        "Publisher": "UT Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Yearbook: The Historical Society of Fairfax County, Virginia - Volume 26 1997-1998",
        "Authors": "By Dziobek, Linda, et. Al. (eds.)",
        "Description": "",
        "Category": "",
        "Publisher": "Historical Society of Fairfax County, Virginal",
        "Price Starting With ($)": "26.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "What Horses Teach Us: Life's Lessons Learned from Our Equine Friends",
        "Authors": "By Dromgoole, Glenn",
        "Description": "The author's insight and humor are paired with delightful photos of all kinds of majestic horses.",
        "Category": " Pets , Horses",
        "Publisher": "Willow Creek Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Baking Soda, Banana Peels, Baby Oil, and Beyond: 1,715 Tips for a Better Home, Garden, and Life",
        "Authors": "By Elissa (editor) Reader's Digest and Altman",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest Association",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "BALTIMORE TODAY a Guide to Its Pleasures, Treasures and Past",
        "Authors": "By Waesche, James F. Photography by A. Aubrey Bodine",
        "Description": "",
        "Category": "",
        "Publisher": "Bodine and Associates, Inc",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Arts of the Chesapeake: Directory for Arts & Crafts Events",
        "Authors": "By Primrose, Carol, senior editor",
        "Description": "",
        "Category": "",
        "Publisher": "Huntergreen Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Frommer's Ottawa",
        "Authors": "By Dearden, Louise",
        "Description": "Experience a place the way the locals do. Enjoy the best it has to offer. Frommer's. The best trips start here.Detailed waling tours to explore the best historical, cultural, and natural attractions that Canada's capital has to offer.Outspoke opinions on what's worth your time and what's not.Exact prices, soyou can plan the perfect trip whatever your budget.Off-th-beaten-path experiences and undiscovered gems, plus new takes on top attractions.Find great deals and book your trip at Frommers.com",
        "Category": " Travel , Canada , General",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Canada's Great Country Inns (Fodor's)",
        "Authors": "By Stewart, Anita",
        "Description": "Evaluates the facilities, ambience, and dining at eighty-nine inns in Alberta, British Columbia, Nova Scotia, New Brunswick, Ontario, Prince Edward Island, Quebec, and Saskatchewan",
        "Category": " Travel , Canada , General",
        "Publisher": "Fodor's Travel",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Around the Year",
        "Authors": "By Tasha Tudor",
        "Description": "",
        "Category": "",
        "Publisher": "Walck",
        "Price Starting With ($)": "22.9",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "When war passed this way",
        "Authors": "By W. P Conrad",
        "Description": "",
        "Category": "",
        "Publisher": "Lilian S. Besore Memorial Library",
        "Price Starting With ($)": "24.73",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "A Hare About the House",
        "Authors": "By Cecil S. Webb",
        "Description": "",
        "Category": "",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "24.73",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Pioneers of Old Monocacy The Early Settlement of Frederick County Maryland 1721-1743",
        "Authors": "By Tracey, Grace L., John P. Dern",
        "Description": "",
        "Category": "",
        "Publisher": "Genealogical Publishing",
        "Price Starting With ($)": "184.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "More names in stone;: Cemetery inscriptions from the peripheral areas of Frederick County, Maryland",
        "Authors": "By Holdcraft, Jacob Mehrling",
        "Description": "",
        "Category": "",
        "Publisher": "Self-published",
        "Price Starting With ($)": "29.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    }
]