[
    {
        "Title": "The 6 Most Important Decisions You'll Ever Make: A Guide for Teens",
        "Authors": "By Covey, Sean",
        "Description": "From Sean Covey, the author of the international bestseller The 7 Habits of Highly Effective Teens, this bestselling follow-up book builds upon the legacy of the 7 Habits and shows teens how to make smart choices about the six most crucial choices they’ll face during these turbulent years.The challenges teens face today are tougher than at any time in history: academic stress, parent communication, media bombardment, dating drama, abuse, bullying, addictions, depression, and peer pressure, just to name a few. And, like it or not, the choices teens make while navigating these challenges can make or break their futures.  In The 6 Most Important Decisions You’ll Ever Make, Sean Covey, author of the international bestseller The 7 Habits of Highly Effective Teens, gives teens the strong advice they need to make informed and wise decisions. Using real stories from teens around the world, Sean shows teens how to succeed in school, make good friends, get along with parents, wisely handle dating and sex issues, avoid or overcome addictions, build self-esteem, and much more. Jam-packed with original cartoons, inspiring quotes, and fun quizzes, this innovative book will help teens not only survive but thrive during their teen years and beyond.",
        "Category": " Young Adult Nonfiction , Social Topics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Not Without Courage (Shadowcreek Chronicles)",
        "Authors": "By Renich, T. Elizabeth",
        "Description": "",
        "Category": " Fiction , Historical",
        "Publisher": "Y W A M Pub",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Nora's Ribbon of Memories (Keepsake Legacies Series, Book 3)",
        "Authors": "By Whitson, Stephanie Grace",
        "Description": "Book Three in the Keepsake Legacies Series. Nora's memories of her first years on the prairie are as bright and colorful as the buttons she collected for her charm string.  Gentlemen bought unusual buttons to give to their young lady friends, and young women traded them.  Nora's collection weaves the story of a courageous young woman who learned lessons of faith, hope, and love on the American frontier.  In the spirit of Sarah's Patchwork and Karyn's Memory Box, best-selling author Stephanie Grace Whitson continues the Keepsake Legacies Series with a heartwarming story of a young woman who finds lasting happiness during pioneer days in Nebraska.",
        "Category": " Fiction , Religious",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Teach Me How to Love You: The Beginnings",
        "Authors": "By Weeks, Thomas and Weeks, Juanita Bynum",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Legacy Pub Intl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Hidden Arizona: Including Phoenix, Tucson, Sedona and the Grand Canyon",
        "Authors": "By Harris, Richard",
        "Description": "",
        "Category": " Travel , United States , West , Mountain (AZ, CO, ID, MT, NM, NV, UT, WY)",
        "Publisher": "Ulysses Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Eyewitness Travel Guide to New York",
        "Authors": "By Berman, Eleanor",
        "Description": "Another D-K gem. Strongly inclined to graphic communication (D-K's specialty) with fine photos, and drawings including several virtual reality bird's-eye views. Has the usual eating and sleeping places with such additions as grocery stores. Friendly to foreign visitors. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "DK Travel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Shark Tooth Tale (Ready, Freddy!, Book 9)",
        "Authors": "By Klein, Abby and McKinley, John (ILT)",
        "Description": "With four books out and terrific Book Club sales success, Ready, Freddy! is an enormously popular school series by an elementary school teacher who has seen it all.Get to know Freddy Thresher, the first grade shark expert with an uncanny knack for mischief. Join Freddy in this adventure as he schemes and scrimps, trying to earn enough money to buy an awesome fossilized shark tooth. Packed with humor, illustrations, and even factual information about sharks, the Ready, Freddy! series is perfect for the chapter book reader.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "The Blue Sky Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "For Time and All Eternity",
        "Authors": "By Bailey, Paul Dayton",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "The future of the Christian Church,",
        "Authors": "By Ramsey, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Morehouse-Barlow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Live the Life You Love: In Ten Easy Step-By Step Lessons",
        "Authors": "By Sher, Barbara",
        "Description": "No matter how long it's been since you've dreamed it...No matter how \"unrealistic\" it seems...Your impossible dream may not be impossible anymore.If you've been waiting for a job that rewards you with more than a  paycheck...or for the perfect moment to take that \"long-lost\" dream off  hold...it's time to stop waiting and start creating a life you can truly  love!In this life altering follow-up to the sensational New York Times Bestseller  I Could Do Anything If I Only Knew What It Was, Barbara Sher shows you how  to break free from a career that doesn't cut it...tailor-make a meaningful,  rewarding life to your personal specifications...and create a foundation for  a success that's strong enough to support your heart's desire.  With wisdom and warm reassurance, this step-by-step guide to personal and professional  fulfillment teaches you the practical strategies you need to make your  \"impossible\" dreams possible, reachable, and real.Discover:How to use \"outcome thinking\" to plot a positive path to your lifelong goalWhat your favorite childhood pastimes tell you about what it takes to be a happy adultHow to use your natural curiosity, talents, and resources to turn your thinking--and your luck--aroundWhy one-size careers do NOT fit allFoolproof techniques for leaping over the hurdles between you and your dreamHow to do what you love and love what you do for the rest of your life!1997).",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Catundra (Serendipity Books)",
        "Authors": "By Cosgrove, Stephen and James, Robin",
        "Description": "A friendly mole helps Catundra, a chubby cat, lose weight and regain her health and self-respect",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "Marley: A Dog Like No Other",
        "Authors": "By Grogan, John",
        "Description": "Make way for Marley!When the Grogan family is ready for a dog, they choose Marley, a yellow furball of a puppy who quickly grows into a large, rowdy Labrador retriever. Marley has a zest for life, and as he grows, so does his enthusiasm. He has an appetite for whatever he can get his paws on—from fine jewelry to underwear—and the one thing he always finds is trouble. Marley even gets kicked out of obedience school! Can this rambunctious pup ever learn how to be a good boy?",
        "Category": " Juvenile Nonfiction , Animals , Dogs",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The First Cut: A Novel of Suspense",
        "Authors": "By Robinson, Peter",
        "Description": "Published in the UK as Caedmon's Song, this is a gripping standalone thriller from New York Times bestselling author Peter Robinson.On a balmy June night, Kirsten, a young university student, is strolling home through a silent moonlit park when she is viciously attacked.When she awakens in the hospital, she has no recollection of that brutal night. But then slowly, painfully, details reveal themselves'dreams of two figures, one white and one black, hovering over her; snatches of a strange and haunting song; the unfamiliar texture of a rough and deadly hand . . .In another part of the country, Martha Browne arrives in a Yorkshire seaside town, posing as an author doing research for a book. But her research is of a particularly macabre variety. Who is she hunting with such deadly determination? And why?The First Cut is a vivid and compelling psychological thriller, from the author of the critically acclaimed Inspector Banks series.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2017"
        }
    },
    {
        "Title": "Arizona and the Grand Canyon (Eyewitness Travel Guides)",
        "Authors": "By Ghose, Aruna (EDT)",
        "Description": "Offers information on accommodations, restaurants, shopping, and activities in Arizona and the Grand Canyon.",
        "Category": " Travel , Parks & Campgrounds",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "International Financial Policy: Essays in Honor of Jacques J. Polak",
        "Authors": "By Goldstein, Morris (EDT) and Frenkel, Jacob A.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Intl Monetary Fund",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Best Recipes from the Cook Book Guild",
        "Authors": "By Fink, Patricia (editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday and Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Central and Eastern Europe: Roads to Growth : Papers Presented at a Seminar Held in Baden, Austria, April 15-18, 1991",
        "Authors": "By Winckler, George (EDT)",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Intl Monetary Fund",
        "Price Starting With ($)": "7.04",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "The International Student Bible for Catholics",
        "Authors": "By Bible",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "The Invisible Hand: Do All Things Really Work for Good?",
        "Authors": "By Sproul, R. C.",
        "Description": "Too often in today's age of secularism we fail to see God's hand in both the rewards and the trials of our lives. Because He is invisible to us, we erroneously think that many events happen by coincidence; we don't sense God's active presence in the course of human affairs. With these blinders in place, we look at the world's past, present, and future and speculate, \"What if...?\"But, as R. C. Sproul convincingly writes in The Invisible Hand, \"There is no 'what if?' in God.\" He doesn't roll dice! Nor does He have to wait to see which fork in the road we choose.... He knows the future precisely because He wills the future as He did the past. \"He is a God whose providence is in the details.\"Examining the perplexing question of God's providence, this talented author and teacher points to God's intimate involvement in every aspect of life on earth. R. C. Sproul writes, not just from a doctrinal viewpoint, but through the concrete experiences of flesh-and-blood people, including those whose lives and struggles are recorded in Scripture. In doing so, he proves the cardinal point of the doctrine of providence: God is for us. Then he follows with the apostle Paul's empowering question, \"If God is for us, who can be against us?\"When we know and accept God's providence we can face life with courage and perseverance, even when things occur that bring pain, sorrow and affliction into our lives. God's providence is our fortress, our shield, our eternal reward, because the God who moves the heavens is also the God who lovingly guides the most intimate details of our lives.",
        "Category": " Religion , Christian Ministry , Counseling & Recovery",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Simplify Your Time",
        "Authors": "By Ramsland, Marcia",
        "Description": "Gain control of your time in 30 days (or less!).Is your to-do list driving you crazy? Do you have more things to do than time to do them? Are you running in circles in spite of multi-tasking and staying up late?Organizing Pro Marcia Ramsland shows you how you can gain control of your schedule by learning to save time, spend time, capture time, and multiply your time. In 30 days (or less) learn practical skills that help you trade time-wasters for time-savers and will show you how to:streamline your daysimplify clutter pileschoose the right calendarcut down your to-do list and actually accomplish moreSimplify Your Time is your personal time management guide. With 101 Time-Saving Tips, you can relieve your daily stress, find time for yourself, and create a lifestyle that allows you to get more done in less time!",
        "Category": " Self-help , Self-Management , Time Management",
        "Publisher": "Thomas Nelson Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2012"
        }
    },
    {
        "Title": "In the Kennedy Style",
        "Authors": "By Verdon, Rene and Baldrige, Letitia (EDT)",
        "Description": "When Jacqueline Kennedy told her social secretary, Letitia Baldrige, that she planned to make some changes to White House entertaining, neither of them could have foreseen what would follow. Within a few short years, Jacqueline Kennedy's natural elegance and taste would completely transform how the White House - and America - entertained. With French cuisine in the State Dining Room and Pablo Casals playing in the East Room, Jackie created some of the most memorable occasions in White House history and set a standard for hospitality that the whole country would emulate.Now Letitia Baldrige and White House chef Rene Verdon have collaborated to recreate some of the most famous evenings of that storied era. Through Letitia Baldrige's intimate, behind-the-scenes recollections, complemented by seldom-seen photographs and memorabilia, these glittering parties are brought to life once again. And with five original menus and over thirty-five authentic recipes by Rene Verdon, carefully adapted and tested for modern kitchens, everyone can now experience some of the atmosphere of those magical evenings inspired by Jacqueline Kennedy.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Simply Irresistible",
        "Authors": "By Gibson, Rachel",
        "Description": "Platinum Anniversary Edition of New York Times bestselling and RITA® Award-winning author Rachel Gibson’sSimply Irresistible! Georgeanne Howard, charm school graduate and Southern belle extraordinaire, leaves her fiancé at the altar when she realizes she just can’t marry a man old enough to be her grandfather, no matter how rich he is. John Kowalsky unknowingly helps her escape, and only when it’s too late does he realize that he’s absconded with his boss’s bride. At the height of his hockey career, this bad boy isn’t looking to be anybody’s savior but his own, no matter how beautiful this angel may be. But a long night stretches ahead of them—a night too sultry to resist temptation.When Georgeanne and John meet again, she is on her way to becoming Seattle’s domestic darling and he is past his hellraising ways. But he is shocked to learn that their single unforgettable night in paradise produced a daughter, and he is determined to be a part of her life. Georgeanne has loved John since the moment she jumped into his little red Corvette seven years ago, but she doesn’t want to risk her heart again. Is he really a changed man? And will he risk the wrath of his boss, and one final chance at glory, to prove that this time his love will be everlasting?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2017"
        }
    },
    {
        "Title": "Bees, Wasps and Ants (A Golden Junior Guide)",
        "Authors": "By Kest, Kristin (ILT) and Fichter, George S.",
        "Description": "Introduces different kinds of bees, wasps, and ants, and tells how they live",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Mrs. Toggle & the Dinosaur",
        "Authors": "By Alley, R. W. (ILT) and Pulver, Robin",
        "Description": "Mrs. Toggle and her class prepare for the arrival of a new student whom they expect to be a dinosaur",
        "Category": "",
        "Publisher": "Simon & Schuster Children's Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Skinny",
        "Authors": "By Kaslik, Ibi",
        "Description": "Do you ever get hungry?  Too hungry to eat? Holly's older sister, Giselle, is self-destructing. Haunted by her love-deprived relationship with her late father, this once strong role model and medical student, is gripped by anorexia. Holly, a track star, struggles to keep her own life in balance while coping with the mental and physical deterioration of her beloved sister. Together, they can feel themselves slipping and are holding on for dear life.  This honest look at the special bond between sisters is told from the perspective of both girls, as they alternate narrating each chapter.  Gritty and often wryly funny, Skinny explores family relationships, love, pain, and the hunger for acceptance that drives all of us.",
        "Category": " Young Adult Fiction , Family , Siblings",
        "Publisher": "Bloomsbury USA Childrens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Run to Me: A Novel (Last Chance Rescue)",
        "Authors": "By Reece, Christy",
        "Description": "ONE LAST CHANCEDriven by grief and fury, Shea Monroe, an operative for Last Chance Rescue, goes deep undercover, vowing vengeance against the man who killed her husband. Instead, she ends up a captive and the unwilling weapon of a vicious human trafficker. But then she is rescued from her den of terror and shame by her husband’s best friend, Ethan Bishop, a man Shea feels irrevocably drawn to, despite her having lost all memory of her life before she was captured.Having saved Shea from a madman, Ethan will do anything to keep her safe, but he can’t allow the feelings he once had for her to resurface. While recovering from her ordeal and regaining her lost memory, Shea begins to fall for Ethan. But the treachery and tragedies of the past won’t leave either of them alone. And from Mexico, a monster has sent his foot soldiers to seize Shea–using a weapon beyond anyone’s worst nightmare.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Breakpoint: A High Risk Novel",
        "Authors": "By Ross, JoAnn",
        "Description": "Air Force Combat Controller Dallas O'Halloran is as tough as he is loyal. So he's not pleased when he's recruited into a new anti-terror unit and teamed up with Academy graduate Julianne Decatur-the icy blond JAG officer who nearly court-martialed his friends. Assigned to investigate a Navy flyer's apparent suicide, they discover the trail of a ruthless killer-and an attraction between them that can't be denied. And when their prey turns the tables on them, Julianne will have to depend on the one man daring and reckless enough to keep them both alive...",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Kiss of Death",
        "Authors": "By Sawyer, Meryl",
        "Description": "In the secluded guesthouse of a lavish California estate, Whitney Marshall has finally found a refuge&#133;a place to heal after the painful end of her marriage. Until her newfound peace is shattered by the arrival of the property's distractingly handsome heir, Adam Hunter—and she finds herself drawn into a deadly game of danger and desire.Adam Hunter needs Whitney's help to prove that his uncle—Hunter needs Whitney's help to prove that his uncle—the the estate's original owner—was murdered. But as the two estate's original owner—was murdered. But as the two begin begin to unearth the truth about Cal Hunter's shadowy past, to unearth the truth about Cal Hunter's shadowy past, it's it's Whitney's own life that is suddenly on the line. Because Whitney's own life that is suddenly on the line. Because someone someone nearby thinks she knows too much&#133;",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "HQN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Manassas To Appomattox",
        "Authors": "By Friends of Fort Ward, Warfield, Edgar",
        "Description": "",
        "Category": "",
        "Publisher": "EPM Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Wicked Fantasy: A Novel (Paradise)",
        "Authors": "By Jordan, Nicole",
        "Description": "Enter the sensual world of Nicole Jordan’s breathtaking Regency romances.He is her most wicked fantasy . . . and no proper suitor for a lady. Since the night Trey Deverill’s stunning kiss melted her senses, Antonia Maitland has harbored a fascination for the infamous adventurer. But Deverill is nothing Antonia needs in a husband, and when he abducts her–for her own protection–and then shockingly proposes marriage, a battle of wills ensues that proves dangerously irresistible.Antonia’s charming wit and vibrant beauty make her England’s most sought-after heiress. Yet it’s her fiery spirit and awakening sensuality that stir a need in Deverill so fierce he would challenge the devil himself to possess her.From the glittering ballrooms of London to the splendor of the Cornish coast, Deverill sweeps Antonia into unforgettable passion. But a treacherous plot threatens their lives and their chance for the grandest adventure of all: true love.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Official Scrabble Word-Finder",
        "Authors": "By Schachner, Robert W.",
        "Description": "This all-new second edition of The Official Scrabble?? Brand Word-Finder is unique in its organization of officially accepted words, allowing the player to find the highest-scoring word in the shortest time. It reflects additions and deletions from the last three editions of The Official Scrabble?? Dictionary, and includes a complete list of two-letter words and three-letter words formed from two-letter words, as well as an invaluable and completely new section, \"Ten Tips for a Better Game.\" There are even newly minted words, such as ab, yo, and ed, and a directory of prefixes, suffixes, and plurals. The Official Scrabble?? Brand Word-Finder is faster than a dictionary and will help you become a Scrabble champion. Scrabble?? is a trademark of Hasbro in the United States and Canada. 2001 Hasbro. All rights reserved.",
        "Category": " Games , Word & Word Search",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Authenticity",
        "Authors": "By Hybels, Bill and Harney, Sherry",
        "Description": "Discover the joys of authentic Christianity.  God wants you to enjoy close relationships with other believers and with Himself.  Relationships that are honest and open, where you can share your successes and failures and remain confidant of being loved. Deep, rich relationships based on an authentic Christian life.  Authenticity helps you identify the trappings of Christianity and trade them for a vibrant faith that integrates Christian values into your everyday life.  You&apos;ll learn how to identify the inconsistent areas of your life, discover proven ways to align them with the teachings of the Bible, and find a new joy that comes from growing closer to God.  Interactions--a powerful, challenging tool for building deep relationships between you and your group members, and you and God.  Interactions is far more than another group Bible study.  It&apos;s a cutting-edge series designed to help small group participants develop into fully devoted followers of Christ.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Deadly Intent",
        "Authors": "By Heggan, Christiane",
        "Description": "Renowned chef, Abbie DiAngelo finds her world shattered by the arrival of her stepbrother, who tries to blackmail her with evidence proving that her mother is guilty of murder, but when he is murdered and her son, Ben, is kidnapped, Abbie must team up with homicide detective John Ryan to find the truth. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Easy Upholstery",
        "Authors": "By Luke, Heather",
        "Description": "",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Krause Publications",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Modern principles of athletic training",
        "Authors": "By Arnheim, Daniel D.",
        "Description": "",
        "Category": "",
        "Publisher": "Times Mirror/Mosby College Pub",
        "Price Starting With ($)": "7.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "What Really Matters for Struggling Readers: Designing Research-Based Programs",
        "Authors": "By Allington, Richard L.",
        "Description": "What Really Matters for Struggling Readers offers a clear blend of research and practice that teachers can use to develop better methods for helping children with reading difficulties.   Includes clear, non-technical summaries of research on the subject of children as proficient readers.    Research section on reading fluency that provides instructional models and methods for fostering fluency, including pause-prompt-praise, partner reading, taped read -alongs, impress method, choral reading, and fluency charting.    Research section that studies the effects of enhancing access to appropriate books and offers suggestions for designing schools where all children have books that are appropriate.   In What Really Matters for Struggling Readers, nationally recognized scholar Dick Allington offers easy-to-understand interpretations of research that support three important principles: Children need to read a great deal to become proficient readers, offering summaries of research on the subject, the text shows how to monitor the amount of reading and create interventions that expand reading activity. Children need access to appropriate books, exploring the research on the subject, the text contains suggestions for designing schools where books are available and appropriate for all children. Children need to develop fluent reading to become proficient readers, reviewing the research on reading fluency, the text provides instructional models and methods for fostering fluency.    Richard L. Allington  is the Fien Distinguished Professor of Education at the University of Florida, Gainesville. He was a co-recipient of the Albert J. Harris Award from the International Reading Association for his \"contributions to the better understanding of reading and learning disabilities\". Dick is also a past president of the National Reading Conference and has been elected to membership in the Reading Hall of",
        "Category": " Education , Teaching Methods & Materials , Reading & Phonics",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Immortal Hunter: A Rogue Hunter Novel (Argeneau Vampire)",
        "Authors": "By Sands, Lynsay",
        "Description": "Even vampires need a vacation. But Decker Argeneau's ends abruptly when he's asked to help hunt the group of rogue vampires targeting mortals -- one that might include a defector in his own family. Before he can worry about that, though, he's got to rescue the latest victim. It's all part of the job, including taking a bullet for a beautiful doctor.Dr. Danielle McGill doesn't know if she can trust the man who just saved her life. There are too many questions, such as what is the secret organization he says he's part of, and why do his wounds hardly bleed? However, with her sister in the hands of some dangerous men, she doesn't have much choice but to trust him.Except now Decker's talking about life mates and awakening a passion that's taking Dani beyond anything she's ever known. Being undead may not be half-bad...especially if it means spending forever with a man who would love her with his mind, body, and immortal soul.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "My Wicked Marquess (Inferno Club, 1)",
        "Authors": "By Foley, Gaelen",
        "Description": "To restore family honor the Marquess of Rotherstone faces his most dangerous mission—finding the perfect bride . . .To London's aristocracy, the Inferno Club is a scandalous society of men no proper young lady would acknowledge. But though they are publicly notorious for pursuing all manner of debauchery, in private they are warriors who would do anything to protect king and country. The Marquess of Rotherstone has decided it's time to restore the family's good name. But as a member of the Inferno Club, he knows there is only one way to redeem himself in Society's eyes: marry a lady of impeccable beauty and breeding, whose reputation is, above all, spotless.Someone quite unlike Daphne Starling. True, she's temptingly lovely, but a jilted suitor has nearly ruined her reputation. Still, Max cannot resist her allure—or the challenge of proving London's gossips wrong. He would do anything to win her hand . . . and show that even a wicked marquess can make a perfect husband.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "The Thoughts of Chairman Miaow",
        "Authors": "By Davies, Andrew",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Mission Compromised",
        "Authors": "By North, Oliver and Musser, Joe",
        "Description": "The New York Times bestselling novel from controversial military legend Oliver North. Major Peter Newman, US Marines, was a highly decorated hero, content doing his job – leading his troops into harm's way. He was good at it. But the White House has other plans for him. When Newman is handpicked for a dangerous clandestine operation as the head of the White House Special Projects Office, his orders are clear – hunt down and eliminate terrorists before they attack the United States with weapons of mass destruction. From the corridors of power in Washington to the heart of the Middle East, Newman finds himself on an assignment so sensitive that it's known only to a handful of officials, as he becomes entangled in a nightmarish web of intrigue, revenge and betrayal.  When the mission is compromised, Newman embarks on a personal odyssey that threatens his career, his life and his loyalty to Corps and country.",
        "Category": " Fiction , General",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Where I'm Calling From: Selected Stories",
        "Authors": "By Carver, Raymond",
        "Description": "By the time of his early death in 1988, Raymond Carver had established himself as one of the great practitioners of the American short story, a writer who had not only found his own voice but imprinted it in the imaginations of thousands of readers. Where I’m Calling From, his last collection, encompasses classic stories from Cathedral, What We Talk About When We Talk About Love, and earlier Carver volumes, along with seven new works previously unpublished in book form. Together, these 37 stories give us a superb overview of Carver’s life work and show us why he was so widely imitated but never equaled.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Why Socks Disappear in the Wash and Over 250 Other Moments of Science",
        "Authors": "By Glass, Don",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Keeping the Moon",
        "Authors": "By Dessen, Sarah",
        "Description": "From the New York Times bestselling author of Once and for AllNever underestimate the power of friendship.   When Colie goes to spend the summer at the beach, she doesn’t expect much.   But Colie didn’t count on meeting Morgan and Isabel.   Through them, she learns what true friendship is all about, and finally starts to realize her potential.   And that just might open the door to her first chance at love. . . .   “A down-to-earth Cinderella story. . . captures that special feeling.” —The New York Post  Sarah Dessen is the winner of the Margaret A. Edwards Award for her contributions to YA literature, as well as the Romantic Times Career Achievement Award. Books by Sarah Dessen:That SummerSomeone Like YouKeeping the MoonDreamlandThis LullabyThe Truth About Forever Just ListenLock and KeyAlong for the RideWhat Happened to GoodbyeThe Moon and MoreSaint AnythingOnce and for All",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Speak",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Inferno (Mentor)",
        "Authors": "By Dante Alighieri",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1954"
        }
    },
    {
        "Title": "Natural Health Bible: From the Most Trusted Source in Health Information, Here is Your A-Z Guide to Over 200 Herbs, Vitamins, and Supplements",
        "Authors": "By Bratman, Steven (EDT), Kroll, David (EDT), Bratman, Steven, and Kroll, David",
        "Description": "Did you know that there are safe and effective natural treatments for many of today's most common health conditions? Recent scientific studies suggest that many herbs, vitamins, and supplements not only may promote better health but may also be powerful weapons in the battle against specific diseases. With The Natural Pharmacist: Natural Health Bible, you'll discover what the therapeutic wonders of natural medicine can do for you.Inside, you'll have at your fingertips the latest research on the effectiveness of the most popular herbs, vitamins, and supplements. Every claim has been rigorously reviewed for accuracy by a medical doctor and a professor of pharmacology. You'll learn what works—and what doesn't.Cross-referenced between illnesses and treatments, this book includes:•  An A–Z guide to health conditions•  An A–Z guide to herbs, vitamins, and supplements•  Important information on drug-herb and drug-supplement interactions•  A complete list of references to studies cited•  And much, much more!Responsible and accurate, The Natural Pharmacist: Natural Health Bible is the source for information you and your loved ones can trust.",
        "Category": " Medical , Pharmacy",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "The Touch of Twilight (Sign of the Zodiac, Book 3)",
        "Authors": "By Pettersson, Vicki",
        "Description": "On the surface she's a sexy, sophisticated socialite, at home among the beautiful people of the Las Vegas upper crust. But Joanna Archer inhabits another world: a place ordinary humans cannot see . . . a dangerous dimension where an eternal battle rages between the agents of Light and Shadow. And Joanna is both.Stalked by an enigmatic doppelganger from a preternatural realm, Joanna can feel the Light failing—which is propelling her toward a terrifying confrontation with the ultimate master of evil, the dark lord of Shadow: her father.Vegas is all about winning big . . . or losing everything. To save her friends, her future, her worlds, Joanna Archer must gamble it all by fully embracing the darkness inside her.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Smart Medicine for Healthier Living : Practical A-Z Reference to Natural and Conventional Treatments for Adults",
        "Authors": "By Zand, Janet, Spreen, Allan, and Lavalle, James B.",
        "Description": "Written by a medical doctor, a naturopath, and a registered pharmacist, Smart Medicine for Healthier Living is a complete A-to-Z guide to the most common disorders and their treatments, using both alternative care and conventional medicine. Comprehensive and easy-to-follow, Smart Medicine for Healthier Living is divided into three parts. Part one explains the full spectrum of approaches used to effectively treat common health problems. It provides an overview of the history, fundamentals, and uses of conventional medicine, herbal medicine, homeopathy, acupressure, aromatherapy, diet, and nutritional supplements. It also includes a helpful section on home and personal safety. Part two contains a comprehensive A-to-Z listing of various health problems. Each entry clearly explains the problem and offers specific advice using a variety of approaches.  Part three provides step-by-step guidance on using the many therapies and procedures suggested for each health problem. Smart Medicine for Healthier Living is a reliable source that you and your family can turn to time and time again, whenever the need arises.",
        "Category": " Medical , Holistic Medicine",
        "Publisher": "Avery",
        "Price Starting With ($)": "7.88",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Painting Acrylics (First Steps)",
        "Authors": "By Lord, Vicki",
        "Description": "So you want to try acrylics, but have little (or no) painting experience? No problem! Not with this book by your side!In this book, you'll find everything you need to get off to a strong start&#151;from what supplies to buy to how to make the most of acrylics bright colors. Easy-to-follow exercises show you how to paint flowers, trees, bricks, skies, fur and other simple subjects, while teaching you a variety of application techniques.Step-by-step demonstrations help you apply what you've learned to make your first paintings good ones. You'll get plenty of specific instructions&#151;color suggestions, what size brush to use, even which direction to make your strokes.",
        "Category": " Art , Techniques , Painting",
        "Publisher": "F&W Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "My Grandma and I (And I Series)",
        "Authors": "By Hallinan, P. K.",
        "Description": "In only about 200 words, author P.K. Hallinan conveys the loving relationship between grandmother and grandchild. The opening line, “My grandma and I are the greatest of friends” sets the tone of this love poem from child to grandparent, and the conclusion, “We’re best friends forever, my grandma and I!” reinforces the special bond that exists between the two.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "WorthyKids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Hallelujah Junction: Composing an American Life",
        "Authors": "By Adams, John",
        "Description": "John Adams is one of the most respected and loved of contemporary composers, and \"he has won his eminence fair and square: he has aimed high, he has addressed life as it is lived now, and he has found a language that makes sense to a wide audience\" (Alex Ross, The New Yorker). Now, in Hallelujah Junction, he incisively relates his life story, from his childhood to his early studies in classical composition amid the musical and social ferment of the 1960s, from his landmark minimalist innovations to his controversial \"docu-operas.\" Adams offers a no-holds-barred portrait of the rich musical scene of 1970s California, and of his contemporaries and colleagues, including John Cage, Steve Reich, and Philip Glass. He describes the process of writing, rehearsing, and performing his renowned works, as well as both the pleasures and the challenges of writing serious music in a country and a time largely preoccupied with pop culture.Hallelujah Junction is a thoughtful and original memoir that will appeal to both longtime Adams fans and newcomers to contemporary music. Not since Leonard Bernstein's Findings has an eminent composer so candidly and accessibly explored his life and work. This searching self-portrait offers not only a glimpse into the work and world of one of our leading artists, but also an intimate look at one of the most exciting chapters in contemporary culture.",
        "Category": " Music , Genres & Styles , Classical",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Polar Shift (The NUMA Files)",
        "Authors": "By Cussler, Clive and Kemprecos, Paul",
        "Description": "NUMA operative Kurt Austin takes on a madman fronting as an evironmentalist in this #1 New York Times-bestselling series.Sixty years ago, an eccentric Hungarian genius discovered how to artificially trigger such a shift in the polar ice caps, which could cause massive eruptions, earthquaks, and even climate changes. But then his work disappeared, or so it was thought. Now, the charismatic leader of an antiglobalization group plans to use it to give the world’s industrialized nations a small jolt, before reversing the shift back again. The only problem is, it cannot be reversed. Once it starts, there is nothing anyone can do.Austin, Zavala, and the rest of the NUMA Special Assignments Team must make strange alliances to protect this technology from being exploited by their new and power-hungry nemesis before the entire planet is made to pay. Rich with all the hair-raising action and endless imagination that have become Cussler’s hallmarks, Polar Shift is a wonderful thriller—indeed, “vintage Cussler.”",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Flower Children",
        "Authors": "By Swann, Maxine",
        "Description": "From an award-winning writer: an elegant, lively, moving novel that portrays the strangely celebrated and unsupervised childhood of four hippie offspring in the seventies and eighties.  When Flower Children's first chapter was published as a short story in 1997, it announced the arrival of a new literary voice: it won every literary prize applicable (the Ploughshares' Cohen Award, the O. Henry Award, and the Pushcart Prize) and was included in the 1998 Best American Short Stories. Now, Maxine Swann expands and continues that story, bringing its four sibling characters through to the other end of childhood, in a much-anticipated book that only Swann could write.  Based on the author's own family, Flower Children is the amusing, moving, beautifully painted story of four children growing up in rural Pennsylvania, the offspring of devoutly hippie parents. Impossibly at odds with their surroundings, the children find themselves both delighted and unnerved by a life without limits. A swing hangs in the middle of the living room. The children run free all day, dance naked in the rain, and go riding on ponies with the boys who live up the road. But as their childhood is celebrated, the freedoms their parents have given them have also compromised their innocence. In time, their world starts to collapse. The parents split. Puberty hits. The children are mortified by what they know and have seen. They long for structure, normalcy, restraint: the very things their parents have avoided.  Haunting and celebratory by turns, Flower Children is at once a portrait of childhood's unbridled joy and the story of a unique generation. Ann Patchett recently selected another excerpt of the novel to appear in the 2006 Best American Short Stories.",
        "Category": " Fiction , Sagas",
        "Publisher": "Riverhead Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Small quiltcrafts",
        "Authors": "By Geiger, Jennifer",
        "Description": "Tells how to select, quilt, and applique fabrics, provides instructions for making tablecloths, place mats, coasters, pillows, tea cozies, pot holders, bags, and cases, and demonstrates special sewing techniques",
        "Category": "",
        "Publisher": "Sedgewood Press",
        "Price Starting With ($)": "5.81",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Will You Take Care of Me?",
        "Authors": "By Sweet, Melissa (ILT) and Bridges, Margaret Park",
        "Description": "Will I always be little, Mama? Will you always take care of me? Little Kangaroo asks Mama. What if I became an apple tree? A teddy bear? A star? Here is a warm, imaginative story that gently reminds young ones of a parent's unwavering devotion. No matter how her child grows or changes, Mama will always be there. Sunny paintings and collages, genuinely evocative of child's world, make this a distinctive bedtime book.",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Ask The Coupon Queen",
        "Authors": "By Hayes, Mary Anne",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "Balloon to the Moon: A Guide to Vibrant Living",
        "Authors": "By Rhegina Sinozich",
        "Description": "",
        "Category": "",
        "Publisher": "Abrezia Press",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Full Scoop (Full Series)",
        "Authors": "By Evanovich, Janet and Hughes, Charlotte",
        "Description": "Dear Reader:There’s a whole lot of trouble going on in Beaumont, South Carolina. According to resident psychic-slash-astrologer, Destiny Moultrie, Mercury’s in retrograde; Venus is in the seventh house, and the combination has turned Cupid wacko! Chaos rules as tempers flare and lust runs rampant. Newlyweds Max Holt and Jamie Swift-Holt are trying to make a baby, but their recently purchased antebellum mansion is under renovation and filled with feuding contractors. Vera has a crush on her new mailman, and is bent on looking ten years younger. Destiny is marked for marriage by the changing planets, and she’s running for her life as the local redneck and bait shop owner is determined to make her his. Meanwhile, local pediatrician Maggie Davenport has considerably bigger problems now that her wild-girl past has caught up in the form of ex-boyfriend and jailbird who just flew the coop—and is determined to track her and her daughter down. If he doesn’t expose her secrets, there’s a good chance Jamie’s editor, intent on getting the Full Scoop, will. Fortunately, FBI agent Zack Madden is on hand for protection; but the new danger is the wild attraction he and Maggie share. Fleas the hound dog is experiencing his first crush on Maggie’s adorable and alluring…um…pygmy goat? Add to that an Elvis convention and a local root doctor and hoodoo practitioner who decides it’s time she take charge; only to have one of her spells backfire, and you’ve got a gut-busting, laugh-out-loud story we hope you won’t forget!It’s just another wild ride in the town we love to write about, and the character’s we can’t get enough of. So kick off your shoes, sit back, and enjoy a FULL SCOOP of fun, adventure, and romance.Janet and Charlotte",
        "Category": " Fiction , Romance , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Microsoft Windows Vista on Demand",
        "Authors": "By Johnson, Steve",
        "Description": "Created by the software trainers at Perspection, this guide uses color screenshots and real-world examples to introduce the Microsoft Windows Vista operating system. Short, self-contained units allow readers to quickly locate instructions for specific tasks. These include (for example) managing files and folders, customizing the desktop, exchanging email, working with pictures, maintaining security, and printing documents. Administrative tools are covered in the final chapter. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Computers , Operating Systems , Windows Desktop",
        "Publisher": "Que",
        "Price Starting With ($)": "8.34",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Dirty White Boys: A Novel",
        "Authors": "By Hunter, Stephen",
        "Description": "They busted out of McAlester State Penitentiary--three escaped convicts going to ground in a world unprepared for anything like them....Lamar Pye is prince of the Dirty White Boys.  With a lion in his soul, he roars--for he is the meanest, deadliest animal on the loose....Odell is Lamar's cousin, a hulking manchild with unfeeling eyes.  He lives for daddy Lamar.  Surely he will die for him....Richard's survival hangs on a sketch: a crude drawing of a lion and a half-naked woman.  For this Lamar has let Richard live...Armed to the teeth, Lamar and his boys have cut a path of terror across the Southwest, and pushed one good cop into a crisis of honor and conscience.  Trooper Bud Pewtie should have died once at Lamar's hands.  Now they're about to meet again.  And this time, only one of them will walk away....",
        "Category": " Fiction , Crime",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Bicycling Science, Second Edition",
        "Authors": "By Whitt, Frank Rowland and Wilson, David Gordon",
        "Description": "The second edition of Bicycling Science includes new information on recent achievements and experiments in human-powered transportation, from the \"ultimate human-powered vehicle\" (UHPV) in which supine riders can achieve speeds well over 60 mph, to human-powered aircraft, boats, and rail transportation. New chapters cover the history of bicycle and humanpower technology and science, and the speed-power relationships of various modes and vehicles including performance predictions for the UHPV and the \"commuter human-powered vehicle.\" The chapters on braking, steering, friction, air drag, rider cooling, and transmissions and gearing have all been enlarged and updated. James McCullagh, editor of Bicycling Magazine has written a Foreword for this edition which also includes many new illustrations.",
        "Category": " Science , General",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "Revelations from a 45-Pound Purse: A Cathy Collection",
        "Authors": "By Guisewite, Cathy",
        "Description": "Cathy is an American icon. She represents Everywoman for millions of women around the world. The noseless character has earned a place in the pantheon of America's most beloved cartoon characters. Of course, Cathy is oblivious to all that. Her relationship with Irving and her new diet are distracting her.Author Cathy Guisewite has tapped into he zeitgeist of a generation. This installment of America's most beloved calorie-counting, workaholic, sweetheart,Revelations From a 45-Pound Purse is not to be missed.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "CliffsAP English Literature and Composition Preparation Guide",
        "Authors": "By Casson, Allan",
        "Description": "",
        "Category": " Study Aids , SAT",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "The Crime of Galileo",
        "Authors": "By Giorgio de Santillana",
        "Description": "",
        "Category": "",
        "Publisher": "Time Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Zen and the Art of Vampires (Dark Ones, Book 6)",
        "Authors": "By MacAlister, Katie",
        "Description": "Is it possible to love two vampires at the same time?View our feature on Katie MacAlister’s Zen and the Art of Vampires.Pushing forty and alone, Pia Thomason heads to Europe on a singles tour, hoping to find romance. What she finds are two very handsome, very mysterious, and very undead men. And she learns that where vampires are concerned, love isn’t the only thing at stake.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "The Complete Guide to Creative Landscapes : Designing, Building, and Decorating Your Outdoor Home (Black & Decker Home Improvement Library)",
        "Authors": "By Creative Publishing International (COR), Farris, Jerri, Himsel, Tim, and Trandem, Bryan",
        "Description": "The Complete Guide to Creative Landscapes represents a new, innovative way to look at the yard and landscape. Up until now, landscapes have been considered mostly ornamental, and average homeowners were thought to be incapable of designing and creating a great landscape. This book will change all that. In refreshingly simple and practical language, The Complete Guide to Creative Landscapes teaches the seven secrets of good landscape design, shows how to plan a stylish landscape that meets practical family needs, and teaches readers how to build a functional, beautiful landscape. With this innovative method, readers will learn how to create a new or \"remodeled\" landscape consisting of outdoor \"rooms\" dedicated to various lifestyle activities. A landscape built using this method will be attractive and stylish-but more important, it will provide practical outdoor living space.In addition, readers will learn how to put the finishing touches on a new landscape, thanks to comprehensive plans and directions for more than 20 beautiful and ingenious garden ornaments-ranging from simple cedar planter boxes to elegant copper archways and trellises.Highlights:Includes more than 60 how-to projects that can be built with ordinary materials available at any home center. Each project includes complete directions and step-by-step photography.Includes a wide range of projects, from the very simple (creating a planting bed) to major hardscape features (building a retaining wall).Refreshingly simple and practical approach to the principles of landscape design-a book that is useful, not intimidating.The only \"big book\" of landscaping that includes a section on building garden ornaments.Innovative book design features an exciting blend of state-of-the-art color photography and elegant, hand-crafted illustrations.Contains a reference appendix, that includes helpful web sites, manufacturers, and an additional reading list. Also includes a complete index.",
        "Category": " Gardening , Landscape",
        "Publisher": "Creative Publishing International",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Dancing with a Rogue (Berkley Sensation)",
        "Authors": "By Potter, Patricia Ann",
        "Description": "When Gabriel Manning arrives in London to destroy the three powerful men, known as \"The Group,\" who are responsible for the death of his father, he unexpectedly joins forces with Merry Anders, a headstrong beauty who is also determined to exact revenge on \"The Group\" for ruining her beloved mother. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Unleash the Night (Dark-Hunter, Book 9)",
        "Authors": "By Kenyon, Sherrilyn",
        "Description": "It's a predator eat predator world for the Were-Hunters. Danger haunts any given day. There is no one to trust. No one to love. Not if they want to live…An orphan with no clan that will claim him, Wren Tigarian grew to adulthood under the close scrutiny and mistrust of those around him. A forbidden blend of two animals—snow leopard and white tiger—Wren has never listened to anyone when there was something he wanted. Now he wants Marguerite.Marguerite D'Aubert Goudeau is the daughter of a prominent U.S. Senator who hates the socialite life she's forced to live. Like her mother before her, she has strong Cajun roots that her father doesn't understand. Still, she has no choice but to try and conform to a world where she feels like an outsider. But the world of rich and powerful humans is never to meet the world of the Were-Hunters who exist side by side with them, unseen, unknown, undetected. To break this law is to call down a wrath of the highest order.In order to have Marguerite, Wren must fight not just the humans who will never accept his animal nature, but the Were-Hunters who want him dead for endangering their world. It's a race against time and magic without boundary that could cost Marguerite and Wren not just their lives, but their very souls…",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "The 6th Target (Women's Murder Club, 6)",
        "Authors": "By Patterson, James and Paetro, Maxine",
        "Description": "When a horrifying attack leaves one of the Women's Murder Club struggling for her life, the others fight to keep a madman behind bars before anyone else is hurt.Lindsay Boxer and her new partner in the San Francisco police department are racing to stop a series of kidnappings that has electrified the city: children are being plucked off the streets together with their nannies, but the kidnappers aren't demanding ransom. Amid uncertainty and rising panic, Lindsay juggles the possibility of a new love with an unsolvable investigation, and the knowledge that one member of the club could be on the brink of death. And just when everything appears momentarily under control, the case takes a terrifying turn, putting an entire city in lethal danger. Lindsay must make a choice she never dreamed she'd face-with no certainty that either outcome has more than a prayer of success.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Vision",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "20,001 Names For Baby: Revised and Updated",
        "Authors": "By Wallace, Carol",
        "Description": "Choosing your baby's name is one of your first and most delightful responsibilities. 20,001 NAMES FOR BABY will help you make that all–important choice from one of the most complete, up–to–date alphabetical listings available. Your decision will be guided by additional information, including:   Origins and meanings of names  Popular nicknames  Names made popular by famous people  Fascinating facts of historical interest",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Trap Line",
        "Authors": "By Hiaasen, Carl and Montalbano, William D.",
        "Description": "From the bestselling author of Bad Monkey and Razor Girl and Bill Montalbano comes this compelling thriller set in Key West on the southern most end of America.With its dozens of outlying islands and the native Conchs’ historically low regard for the law, Key West is a smuggler’s paradise. All that’s needed are the captains to run the contraband. Breeze Albury is one of the best fishing captains on the Rock, and he’s in no mood to become the Machine’s delivery boy. So the Machine sets out to persuade him. It starts out by taking away Albury’s livelihood. Then it robs him of his freedom. But when the Machine threatens Albury’s son, the washed-out wharf rat turns into a raging, sea-going vigilante.In Trap Line, Hiaasen and Montalbano pit a handful of scruffy Conchs against an armada of drug lords, crooked cops, and homicidal marine lowlife. The result is a crime novel of dizzying velocity, filled with wrenching plot twists, grimily authentic characters, and enough local color for a hundred tropical shirts. It’s the Key West the tourist brochures won’t tell you about: a place as crooked as Al Capone’s Chicago and as irredeemably violent as Wyatt Earp’s Tombstone.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Vintage Crime/Black Lizard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Building Floors, Walls and Stairs (Builder's Library)",
        "Authors": "By Fine Homebuilding Magazine (EDT)",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "6.22",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Monty: A Biography of Montgomery Clift",
        "Authors": "By Robert LaGuardia",
        "Description": "",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Parting the Veil",
        "Authors": "By Davis, Jay",
        "Description": "For most of his life, John Creed never gave much thought to an afterlife. That all changed the day he died.He'd been clinically dead for ten minutes. At least, that's what the doctors told him when he woke up in intensive care. It had been a freak accident, they said. A school bus suddenly turned in front of his red convertible, smashing it to bits. By all odds, that should have been it. John's injuries had been grave. His heart had stopped and been restarted. He'd flatlined. His brain showed no signs of activity. Only sheer stubbornness kept the doctors from pulling the plug. Then, days later, he suddenly, mysteriously woke up - confused, in pain, but very much alive.At first, he didn't remember much of what had happened. But then, the dreams began ...The accident itself, in vivid, second-by-second detail. The face of the woman who had been driving the bus - a face twisted with pure hatred. The long hours in the trauma center, as he hovered over his own shattered body, watching the doctors desperately laboring to bring him back.And the light - a faint but steadily growing glow at the end of a swirling vortex. A brilliant incandescence filled with joy, love, peace that beckoned him closer...But there were other dreams as well...A frightened, heartbroken boy from a desperately troubled family running for his life. A pretty, red-haired woman whose life was crashing around her, tempted to end it all. An embittered, broken man whose heart smoldered with despair, hatred, and murderous rage.These lives were somehow intertwined with his own, in a way he did not fully understand.With the visions, John Creed received a remarkable gift. He could share the pain of other souls, take their suffering and transform it into peace. But this same gift also opened him to darker forces. Forces which could shift the balance between good and evil for ages to come....Exciting, suspenseful, moving, and inspirational PARTING THE VEIL is a powerful testament to faith, hope, and the triumphant human spirit.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Memory Book",
        "Authors": "By Stokes, Penelope",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday Large Print Home Libary Edition",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Math and the Mona Lisa: The Art and Science of Leonardo da Vinci",
        "Authors": "By Atalay, Bulent",
        "Description": "Leonardo da Vinci was one of history's true geniuses, equally brilliant as an artist, scientist, and mathematician. Readers of The Da Vinci Code were given a glimpse of the mysterious connections between math, science, and Leonardo's art. Math and the Mona Lisa picks up where The Da Vinci Code left off, illuminating Leonardo's life and work to uncover connections that, until now, have been known only to scholars.   Bülent Atalay, a distinguished scientist and artist, examines the science and mathematics that underlie Leonardo's work, paying special attention to the proportions, patterns, shapes, and symmetries that scientists and mathematicians have also identified in nature. Following Leonardo's own unique model, Atalay searches for the internal dynamics of art and science, revealing to us the deep unity of the two cultures. He provides a broad overview of the development of science from the dawn of civilization to today's quantum mechanics. From this base of information, Atalay offers a fascinating view into Leonardo's restless intellect and modus operandi, allowing us to see the source of his ideas and to appreciate his art from a new perspective.",
        "Category": " Mathematics , General",
        "Publisher": "Smithsonian Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Tribulation Force: The Continuing Drama of Those Left Behind (Left Behind No. 2)",
        "Authors": "By LaHaye, Tim F. and Jenkins, Jerry B.",
        "Description": "Rayford Steele and Cameron (“Buck”) Williams find themselves pressed into service for the man they believe could be the Antichrist. Nicolae Carpathia takes over the United Nations, signs a peace treaty with Israel, and begins to lure the nations of earth together to form one global village. Meanwhile, the judgment of God begins to fall on the earth. Buck and Rayford, along with their pastor and Rayford's daughter, must fight to stay alive and battle the forces of evil in the strength of their fledgling, newfound faith.",
        "Category": " Fiction , Religious",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Bending the Rules",
        "Authors": "By Andersen, Susan",
        "Description": "Tall, dark and intense, Detective Jason de Sanges excites all kinds of fantasies in Poppy Calloway. But when she suggests the three teens caught spray-painting a Seattle neighborhood be given art-related community service and he just wants to see them pay&#151;all bets are off.With the men in his family always in and out of the slammer, Jase was raised in foster care. He knows what it takes to walk the line. And his number one self-imposed rule? Avoid his hunger for sexy, irresistible Poppy, who challenges him on everything. But it's a vow that's getting harder and harder to keep.&#133;",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Always a Scoundrel: The Notorious Gentlemen (The Notorious Gentlemen, 3)",
        "Authors": "By Enoch, Suzanne",
        "Description": "Never a gentleman . . . until now.Lord Bramwell Johns, the second son of a duke, is an unrepentant scoundrel. Now that his two closest friends are disgustingly ensconced in domestic bliss, Bram is feeling strangely restless. And not even relieving London's least deserving artistocrats of their ill-gotten jewels is enough—until the night he overhears an argument. It seems that Lady Rosamund Davies is about to be forced into marriage with a rogue even worse than himself.Rose is well aware of Bram's scandalous reputation, so any reason for his sudden interest in her is suspect; more so since he's close friends with the man about to ruin her family! She has her own plan though, and Bram may be just what she requires—as long as she remembers that he is only looking out for himself. As long as she remembers that his kisses and caresses don't mean anything. As long as she can keep from wondering whether she can trust a scoundrel . . . with her heart.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Rapture: The Shadowdwellers",
        "Authors": "By Frank, Jacquelyn",
        "Description": "The Shadowdwellers live in a realm of darkness and sensuality, where order is prized and sin must be punished. Yet for Magnus, the head priest of Sanctuary, salvation rests with the one woman who can entice him to break every rule.  .  .She Was The Ultimate Temptation  Magnus is a man of contradictions--a spiritual leader in a warrior's body. To him, laws are for enforcing and visions must be followed--even if that means freeing a beautiful slave and making her his reluctant handmaiden. Betrayed once before, Magnus can barely bring himself to trust another woman. Yet Daenaira's fiery innocence is drawing them both into a reckless inferno of desire.  Daenaira grew up hearing tales of a fearsome priest who seemed more myth than reality. But Magnus is very real--every inch of him--and so is the treachery surrounding them. Beneath Sanctuary's calm surface, an enemy is scheming to unleash havoc on the Shadowdwellers, unless Magnus trusts in a union ordained by fate, and sealed by unending bliss.  .  .",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Rules of Deception (Jonathon Ransom Series)",
        "Authors": "By Reich, Christopher",
        "Description": "New York Times Bestseller Dr. Jonathan Ransom, a surgeon for Doctors Without Borders,  is climbing in the Swiss Alps with his wife, Emma, when she falls into a hidden crevasse  and dies. Twenty-four hours later, Jonathan receives an envelope addressed to his  wife containing two baggage-claim tickets. Puzzled, he journeys to a railway station  only to find himself inexplicably attacked by the Swiss police. Suddenly forced on  the run, Jonathan's only chance at survival lies in uncovering the devastating truth  behind his wife's secret life. Follow the Rules: Don't miss the other thrillers in the series—Rules of Vengeance (in paperback) and Rules of Betrayal (in hardcover July 2010).",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Profiting from Uncertainty: Strategies for Succeeding No Matter What the Future Brings",
        "Authors": "By Gunther, Robert E. and Schoemaker, Paul J. H.",
        "Description": "What manager is not anxious about the future? We live in a white-knuckled age of rapid technological change and global instability. But uncertainty is not the enemy, says management expert Paul J. H. Schoemaker. It is where the greatest opportunities are. To unlock these opportunities, however, requires a very different approach to strategy and implementation. In this pioneering book, Dr. Schoemaker presents a systematic approach that combines concepts such as scenario planning, options thinking, and dynamic monitoring to create novel strategies for profiting from ambiguity. Building on his experience with more than one hundred consulting projects in fields ranging from health care to manufacturing, from utilities to financial services, Schoemaker shows how major corporations throughout the world have used his pathbreaking methodology to prepare for an uncertain future and profit from it. In this first comprehensive approach to the subject, Schoemaker shows the reader (1) how to develop and analyze multiple industry scenarios, (2) craft nimble strategies with just the right amount of flexibility, (3) implement them using an options approach, and (4) make real-time adjustments through dynamic monitoring. As a leading academic thinker and practitioner, the author draws on the frontiers of decision science, organization theory, strategy, and cognitive psychology to integrate the most practical contributions these various fields have made to navigating uncertainty. More than any other capability, skill in seizing initiatives in shifting, unpredictable circumstances is the key to success. Profiting from Uncertainty provides a road map to do just that. This book was first published in 2002, well ahead of the mega turmoil that befell the world in 2008 and beyond. The methods and tools described here have been used by many companies and are even more relevant today than when originally published. You can’t do without them.",
        "Category": " Business & Economics , Forecasting",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Gooseberry Patch Christmas Book 2",
        "Authors": "By",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Seafood",
        "Publisher": "Leisure Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Great Paintings of the Western World",
        "Authors": "By Alison Gallup, Gerhard Gruitrooy, Elizabeth M. Weisberg",
        "Description": "",
        "Category": "",
        "Publisher": "Beaux Arts Editions",
        "Price Starting With ($)": "9.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Complete Book of Low Carbohydrate Cooking",
        "Authors": "By Elaine  Gardner",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Unexplained: An Encyclopedia of Curious Phenomena, Strange Superstitions, and Ancient Mysteries",
        "Authors": "By Allen, Judy",
        "Description": "Unexplained is a comprehensive and compelling one-stop guide to weird nature, the paranormal, and strange superstitions. Even with today's high-tech science, many events and ancient mysteries remain unexplained and surrounded by theories that stir the imagination and challenge scientific fact. This book systematically explores all aspects of the human fascination with the unknowable, from hauntings and the power of the mind to physical mysteries such as lost civilizations, ancient superstitions and symbols, and the persistent ideas about life from other planets. Evocative illustrations and intriguing photographs, combined with spine-tingling text by an award-winning author, shed light on the world's greatest mysteries.",
        "Category": " Juvenile Nonfiction , Curiosities & Wonders",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "5.27",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Kingfisher Illustrated Children's Dictionary",
        "Authors": "By Grisewood, John (EDT), Bollard, John K. (EDT), and Grumet, Joanne (EDT)",
        "Description": "This wonderfuly comprehensive illustrated dictionary for children explains the basics of dictionary usage to the young novice. Features such as detail-packed entries, multiple definitions, cross-referencing, and encyclopedic entries will enable children using this dictionary to become better spellers, better writers, and better informed about the world around them.",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "8.88",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "501 Cross Stitch Designs",
        "Authors": "By Hawkins, Sam",
        "Description": "",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "My Big Science Book (My Big Step by Step)",
        "Authors": "By MUGFORD, SIMON",
        "Description": "-Ideal for early graders.-Over 40 experiments to try.-Step-by-step instructions that are easy to follow.-All projects use everyday materials.-Explains the relevance of the experiments to real life.-Results that will surprise children and adults alike.-Spiral bound so the book can lie flat, making it easy  to use. -Ideal for early graders.-Over 40 experiments to try.-Step-by-step instructions that are easy to follow.-All projects use everyday materials.-Explains the relevance of the experiments to real life.-Results that will surprise children and adults alike.-Spiral bound so the book can lie flat, making it easy  to use.",
        "Category": " Juvenile Nonfiction , Science & Nature , Experiments & Projects",
        "Publisher": "Priddy Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Brass Verdict (A Lincoln Lawyer Novel, 2)",
        "Authors": "By Connelly, Michael",
        "Description": "Things are finally looking up for defense attorney Mickey Haller. After two years of wrong turns, Haller is back in the courtroom. When Hollywood lawyer Jerry Vincent is murdered, Haller inherits his biggest case yet: the defense of Walter Elliott, a prominent studio executive accused of murdering his wife and her lover. But as Haller prepares for the case that could launch him into the big time, he learns that Vincent's killer may be coming for him next.Enter Harry Bosch. Determined to find Vincent's killer, he is not opposed to using Haller as bait. But as danger mounts and the stakes rise, these two loners realize their only choice is to work together.Bringing together Michael Connelly's two most popular characters, The Brass Verdict is sure to be his biggest book yet.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Simple Science Fun Hands-On Science Made Easy (Kidsworks)",
        "Authors": "By Forbes, Evan, Chang, Wendy (ILT), Hale, Janet A., and Christianson, Cindy",
        "Description": "",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Teacher Created Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Making Make-Believe: Fun Props, Costumes, and Creative Play Ideas",
        "Authors": "By Kohl, Maryann F.",
        "Description": "Explore the world of make-believe with fun and easy-to-make props and costumes. Create a life-size igloo out of milk jugs or put on a puppet show in your very own Lighted Box Stage! Making Make-Believe offers storybook play, games, cooking, mini-plays, dress-up costumes, puppet ideas, and more to enrich children's play. Unlock the imagination of young children, allowing them to create their own dramatic play experiences. With over 125 activities and projects, this book is packed with ideas for hours of creative fun!",
        "Category": " Family & Relationships , Life Stages , Infants & Toddlers",
        "Publisher": "Chicago Review Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "A Country Sampler of Simple Blessings",
        "Authors": "By Stouffer, Ellen, Short, Peg Carmack, and Stouffer, Ellen (ILT)",
        "Description": "A Country Sampler of Simple Blessings is a gift book that combines charming scenes of country living with inspirational stories about how God speaks to us through everyday miracles. Celebrating the everyday moments of life, each heartwarming story shares a lesson learned and a Scripture verse. The book features the art of Ellen Stouffer, a popular folk artist whose lovely and unusual paintings will stir your heart and reawaken memories of faith, love, peace, and days gone by.",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Iams Complete Dog Owner's Manual",
        "Authors": "By Marder, Amy and Horwitz, Debra",
        "Description": "Illustrated with more than four hundred full-color photographs and illustrations, a lively, comprehensive guide written by two dog-care experts covers every conceivable aspect of selecting, caring for, and training a dog.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Broadway",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The West: From Lewis and Clark to Wounded Knee",
        "Authors": "By William C. Davis, Joseph G. Rosa",
        "Description": "",
        "Category": "",
        "Publisher": "Salamander Books",
        "Price Starting With ($)": "8.04",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Bread Machine Collection: 3 Cookbooks in 1",
        "Authors": "By n/a",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "101 Things Every Kindergartner Should Know About Reading",
        "Authors": "By natalie-goldstein",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Lt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "VITTORIO, The Vampire",
        "Authors": "By Rice, Anne",
        "Description": "Educated in the Florence of Cosimo de' Medici, trained in knighthood at his father's mountaintop castle, Vittorio inhabits a world of courtly splendor and country pleasures - a world suddenly threatened when his entire family is confronted by an unholy power.In the midst of this upheaval, Vittorio is seduced by the vampire Ursula, the most beautiful of his supernatural enemies. As he sets out in pursuit of vengeance, entering the nightmarish Court of the Ruby Grail, increasingly more enchanted (and confused) by his love for the mysterious Ursula, he finds himself facing demonic adversaries, war and political intrigue.Against a backdrop of the wonders - both sacred and profane - and the beauty and ferocity of Renaissance Italy, Anne Rice creates a passionate and tragic legend of doomed young love and lost innocence.",
        "Category": "",
        "Publisher": "Knopf Canada",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Wedding Trap (The Trap Trilogy)",
        "Authors": "By Warren, Tracy Anne",
        "Description": "From ugly duckling to beautiful swanEliza Hammond has always been quiet and reserved–hardly the best qualities for finding the man of her dreams and living happily ever after. A new heiress, Eliza is financially secure, courtesy of her aunt’s fortune, but even great wealth has its drawbacks since every greedy, fortune-hunting bachelor suddenly finds Eliza irresistible.To help her best friend, Violet takes Eliza’s romantic dilemma into her own hands, enlisting the social skills of her brother-in-law, Lord Christopher “Kit” Winter. Kit helps transform Eliza into a stunning belle, certain to attract a worthy beau. There’s just one problem: Eliza has always been head over heels in love with Kit, the very man who is trying to find her a husband! But during Eliza’s sometimes-comic extreme makeover, and with a few secret love lessons from Kit on the side, sparks–and passionate kisses–begin to fly. Kit soon finds himself completely overcome by an all-consuming desire for Eliza. But if he fails to realize his true love for her, he may lose this fair lady forever.",
        "Category": " Fiction , Romance , Regency",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Splendor",
        "Authors": "By Joyce, Brenda",
        "Description": "She played a dangerous game. Carolyn Browne was a poor bookseller's daughter and an enlightened thinker, delighting London with her scathingly witty columns, written under the name Charles Copperville. Penetrating the town's gilded salons in male disguise, Carolyn soon throws her barbs at the wrong man-- the enigmatic Russian prince, Nicholas Sverayov.He was a dangerous target. His notoriety, extravagances, and indulgent disregard for social convention fuel Carolyn's outrage. Nicholas has moved through the balls and soirees of high society effortlessly, a natural target of gossip, envy, and desire. But Nicholas is furious to find himself lampooned by Copperville, and quickly discovers Carolyn's dearly held secret. Now, as the two spar, a new game begins-- a game of deception and pride, of longing and chance.And they played for the ultimate prize... As Nicholas sweeps Carolyn from the teeming streets and gala balls of Regency London to the splendor and majesty of St. Petersburg, against all odds the unlikely lovers embark upon a whirlwind of passion and peril until there is no turning back-- for the stakes have changed, demanding no less of them than the unwavering courage to claim the love of a lifetime.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "DRESS GRAY",
        "Authors": "By Truscott, Lucian K.",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1980"
        }
    }
]