[
    {
        "Title": "Most Likely to Die (Mystery)",
        "Authors": "By Girdner, Jaqueline",
        "Description": "While attending her class reunion, gag gift designer and amateur sleuth Kate Jasper witnesses the antics of prankster and former class clown Sid Semling, whose untimely electrocution by Kate's pinball machine makes Kate a murder suspect. Simultaneous.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Flaming Luau of Death: A Madeline Bean Novel (Madeline Bean Mysteries)",
        "Authors": "By Farmer, Jerrilyn",
        "Description": "The party never ends when event planner/sleuth Madeline Bean is throwing it! The delectable creation of award-winning, number one Los Angeles Times bestselling author Jerrilyn Farmer, the irrepressible Mad Bean is back for big laughs and big trouble on the Big Island. Madeline Bean has planned phenomenal parties for Hollywood heavyweights of every ego size, but now she's cooking up something very special for one of her own -- a hip, surprise-destination bachelorette weekend at a fabulous-doesn't-do-it-justice resort in Hawaii for cherished employee and bride-to-be Holly Nichols. This hysterical riff on a luau will have everything. Tiki lamps. Hula lessons. A dead body washing in on the warm island tides. Okay, that wasn't in the original party plan.The uninvited corpse isn't the only shocker throwing a monkey wrench in the proceedings. Holly is getting cold feet about the whole engagement thing -- due, in large part, to a slight indiscretion in her past that may have left her not exactly single. Hey, what happens in Vegas is supposed to stay in Vegas, isn't it?But Madeline's not going to let a few little glitches like a mysterious preexisting husband and an island murder spoil Holly's wedding shower extravaganza -- not while there are still passion-fruit martinis to quaff and buff surfer boys to ogle. All she has to do is hunt down the first \"Mr. Holly,\" who vanished the morning after, and get him to do the right thing. That, and keep a killer who's in their midst from leaving behind any more gruesome party favors. And then there's that freaking volcano that's making annoying ready-to-erupt noises ...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Curfew",
        "Authors": "By Rickman, Phil",
        "Description": "On the border between England and Wales lies the tiny town of Crybbe, not picturesque enough for the tourist trade, quietly sliding into decay.Max Goff means to change all that. Goff has made millions in the record business, but his heart is in New Age philosophy. He has learned that Crybbe was once a spiritual center of sorts, surrounded by ancient standing stones that were emblems of power. He means to replace the stones that have fallen - or been destroyed, as many of them were - and establish a thriving New Age community that will draw tourists and students from all over the world.What Max Goff doesn't know is that the standing stones of Crybbe were destroyed in the sixteenth century for a very good reason. Some of the endearing customs of the town - such as tolling the church bell for curfew each night - are actually deadly serious rituals. The people of Crybbe know that evil has been kept at bay here by the old ways, and that there's nothing quaint about them. And the power about to be unleashed by Max Goff is nothing like the soothing music and herbal remedies he associates with the New Age. This is the power of the old age, pent up for centuries and about to be released with deadly fury!",
        "Category": " Fiction , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Red Trance",
        "Authors": "By Zimmerman, R. D.",
        "Description": "They are odd. Maddy Phillips, sightless and paraplegic, is a distinguished psychologist specializing in forensic hypnosis. Her brother, Alex, probes the world beyond Maddy's island estate. And together they prove to be crime fiction's most unique and fascinating detective team: when Alex witnesses a crime, he retreats to Maddy's island where, under her powerful hypnotic trance, he retells in startling detail the horrible events.Their previous adventures have won widespread critical acclaim and numerous fans. Now, in this third very original appearance, Maddy dispatches Alex on a strange and ultimately life-threatening visit to St. Petersburg, Russia, where he encounters the mysterious hypnotist, Dr. Pavel Kamikov. The new Russia, Alex discovers, is layered with greed and lies, and Dr. Kamikov proves no different. Just how in Russia's difficult times has this man become so wealthy? Has he really made that much money from his popular TV show, Mesmerizing Moments, or is he involved in an illegal business? To muddy the scene even further, almost as soon as Alex arrives in St. Petersburg, an old friend of his is gunned down while changing dollars on the black market - an event that sweeps Alex into the new, ruthless Russia now dominated by the all-powerful Russian mafia.Filled with details of post-Soviet Russia, Red Trance charges through the dark alleys of St. Petersburg and pits Alex's life against a handful of thugs. In the very end, however, after a gruesome murder in a dark stairwell and Alex's own arrest by the Russian police, only one person is able to identify the awful truth: Maddy. Deep in hypnotic trance, the uniquely powerful and blind Maddy visualizes the scene of the crime, revealing the real course of events.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.45",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Chocolate: Cooking with the World's Best Ingredient",
        "Authors": "By Christine McFadden, Christine France",
        "Description": "",
        "Category": "",
        "Publisher": "Ultimate Editions",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "50 Hikes in Northern Virginia: Walks, Hikes, and Backpacks from the Allegheny Mountains to the Chesapeake Bay",
        "Authors": "By Adkins, Leonard M.",
        "Description": "",
        "Category": " Sports & Recreation , Hiking",
        "Publisher": "Backcountry Pubns",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Art of the State: Maryland",
        "Authors": "By Wanning, Esther",
        "Description": "An armchair tour through Maryland's rich cultural history includes a profile of the signers of the Declaration of Independence and America's premier family of painters, the Peales, and many other history-making Maryland residents.",
        "Category": " Art , American , General",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Seeds of Destruction: Joe Kennedy and His Sons",
        "Authors": "By Martin, Ralph G.",
        "Description": "Seeds of Destruction, by the bestselling biographer and social historian Ralph G. Martin, is the first book to probe the complex family dynamics and psychological forces that molded the Kennedy men.Seeds of Destruction chronicles the incredible triumphs and deep sorrows of the Kennedys. Martin delineates how the interdependence between Jack and Bobby molded their character, social conscience, and leadership ability, and how Teddy struggled within the triangle - and afterward, when it had become just a memory. Martin provides extraordinary behind-the-scenes details of the Kennedy Presidency and of an intimate family saga spanning four generations. Here is a disturbing story of how one man's driving ambition could pit his sons against one another, fostering an ultimately devastating spirit of competition that shaped their destinies - and that of the nation.",
        "Category": "",
        "Publisher": "G.P Putnam's Sons",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Children's Book of Virtues",
        "Authors": "By Hague, Michael (ILT) and Bennett, William J. (EDT)",
        "Description": "The perfect companion to William J. Bennett's number-one bestseller; The Book of Virtues, The Children's Book of Virtues is the ideal storybook for parents and children to enjoy together:  With selections from The Book of Virtues, from Aesop and Robert Frost to George Washington's life as well as Native American and African folklore, The Children's Book of Virtues brings together timeless stories and poems from around the world.  The stories have been chosen especially for a young audience to help parents introduce to their children the essentials of good character: Courage, Perseverance, Responsibility, Work, Self-discipline, Compassion, Faith, Honesty, Loyalty, and Friendship.  Lavishly illustrated by the well-known artist Michael Hague, these wonderful stories and the virtues they illustrate come to life on these pages.  The Children's Book of Virtues is an enduring treasury of literature and art that will help lead young minds toward what is noble and gentle and fine.",
        "Category": " Juvenile Nonfiction , Religious , Christian , Values & Virtues",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Victory in Europe: D-Day to V-E Day",
        "Authors": "By Hastings, Max",
        "Description": "Illustrated with two hundred color stills of film footage of the Allied Armies' advance through Europe",
        "Category": " History , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Complete Chevrolet book",
        "Authors": "By Petersen Publishing Company",
        "Description": "",
        "Category": "",
        "Publisher": "Petersen Pub. Co",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Belle Prater's Boy",
        "Authors": "By White, Ruth",
        "Description": "When Belle Prater disappears, Belle’s boy, Woodrow, comes to live with his grandparents in Coal Station, Virginia. Woodrow’s cousin Gypsy is the town beauty, but she has hidden sorrows and secrets of her own. She wonders how Woodrow can accept his mother’s disappearance when she’s never gotten over her father’s death. That’s when Woodrow tells Gypsy the secret about his mother.",
        "Category": " Fiction , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Living Language Spanish: Complete Course, Revised and Updated (Basic-Intermediate)",
        "Authors": "By Stern, Irwin",
        "Description": "Encompassing forty Spanish-language lessons, a common usage dictionary, and a conversational manual, this introductory course teaches the fundamentals of the Spanish language.",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "14.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Dark Harbor (Stone Barrington Novels)",
        "Authors": "By Woods, Stuart",
        "Description": "In Dark Harbor, Maine, Stone Barrington discovers a picturesque town where the shocking deaths of three people have cast a long shadow over this island haven - a locale as mysterious as it is exclusive.Stone Barrington hasn't heard from his cousin, Dick Stone, in years - though he has fond memories of a teenage summer spent at his house in Maine. But then the CIA's Lance Cabot interrupts an otherwise pleasant meal at Elaine's with news of Dick's death - apparently by his own hand. It seems that Dick Stone, a quiet family man who doubled as a CIA agent, methodically executed his wife, daughter, and then himself - or did he?With the help of his ex-partner, Dino, and his friend Holly Barker, Stone must piece together the elusive facts of his cousin's life and death as a CIA operative.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Wildflowers: A Collector's Album",
        "Authors": "By Beame, Rona and McElwain, Dianne (ILT)",
        "Description": "An exquisitely illustrated journal and nature guide, with a special section for mounting flowers, teaches children a simple system for collecting and preserving wildflowers, the basics of plant biology, and the importance of flowers to all life on earth.",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Motherhood 101: Inspiration and Wisdom to Help You Become a Great Mom",
        "Authors": "By Fuller, Cheri",
        "Description": "",
        "Category": "",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Children with Autism: A Parent's Guide",
        "Authors": "By Powers, Michael D. (EDT) and Grandin, Temple (FRW)",
        "Description": "",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "Woodbine House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Shellfish (English and German Edition)",
        "Authors": "By Mosimann, Anton, Hofmann, Holger, and Geubner, Christian",
        "Description": "Explains how to shop for, prepare, and serve different kinds of shellfish, including lobster, shrimp, langostino, crab, oysters, clams, and mussels",
        "Category": "",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Natural Wonders of Virginia: A Guide to Parks, Preserves & Wild Places",
        "Authors": "By Winegar, Garvey and Winegar, Deane",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Country Roads Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Computer Architecture: A Quantitative Approach, Second Edition",
        "Authors": "By Hennessy, John L. and Goldberg, David",
        "Description": "\"Once in a great while, a landmark computer-science book is published. Computer Architecture: A Quantitative Approach, Second Edition, is such a book. In an era of fluff computer books that are, quite properly, remaindered within weeks of publication, this book will stand the test of time, becoming lovingly dog-eared in the hands of anyone who designs computers or has concerns about the performance of computer programs. \"   - Robert Bernecky,  Dr. Dobb's Journal , April 1998  Computer Architecture: A Quantitative Approach  was the first book to focus on computer architecture as a modern science. Its publication in 1990 inspired a new approach to studying and understanding computer design. Now, the second edition explores the next generation of architectures and design techniques with view to the future.  A basis for modern computer architecture  As the authors explain in their preface to the Second Edition, computer architecture itself has undergone significant change since 1990. Concentrating on currently predominant and emerging commercial systems, the Hennessy and Patterson have prepared entirely new chapters covering additional advanced topics:*  Advanced Pipelining:  A new chapter emphasizes superscalar and multiple issues.*  Networks:  A new chapter examines in depth the design issues for small and large shared-memory multiprocessors.*  Storage Systems:  Expanded presentation includes coverage of I/O performance measures.*  Memory:  Expanded coverage of caches and memory-hierarchy design addresses contemporary design issues.*  Examples and Exercises:  Completely revised on current architectures such as MIPS R4000, Intel 80x86 and Pentium, PowerPC, and HP PA-RISC.  Distinctive presentation  This book continues the style of the first edition, with revised sections on Fallacies and Pitfalls, Putting It All Together and Historical Perspective, and contains entirely new sections on Crosscutting Issues. The focus on fundamental techniques for designing real machines and the attention to maximizing cost/performance are crucial to both students and working professionals. Anyone involved in building computers, from palmtops to supercomputers, will profit from the expertise offered by Hennessy and Patterson.",
        "Category": " Computers , Systems Architecture , General",
        "Publisher": "Morgan Kaufmann Publishers",
        "Price Starting With ($)": "8.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Island of the Blue Dolphins",
        "Authors": "By O'Dell, Scott",
        "Description": "In the Pacific, there is an island that looks like a big fish sunning itself in the sea. Around it blue dolphins swim, otters play, and sea birds abound. Karana is the Indian girl who lived alone for years on the Island of the Blue Dolphins. Hers is not only an unusual adventure of survival, but also a tale of natural beauty and personal discovery.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "One Hundred Graces",
        "Authors": "By Kelly, Jack and Kelly, Marcia",
        "Description": "",
        "Category": " Religion , Prayerbooks , General",
        "Publisher": "Bell Tower",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "God's Little Instruction Book for Mom (God's Little Instruction Books)",
        "Authors": "By Honor Books",
        "Description": "",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Happy Mother's Day!",
        "Authors": "By Honor Books and Hupp, Sarah (EDT)",
        "Description": "",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Great American Christmas Almanac",
        "Authors": "By Chalmers, Irena",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Studio",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Cooking for One",
        "Authors": "By Creech, Nancy",
        "Description": "Provides more than 180 recipes that encompass healthy, easy-to-fix meals for individuals, including Stuffed Eggplant, German Potato Pancakes, and Poached Red Snapper; and accompanying tips explain how to work with family-sized packaging.",
        "Category": " Cooking , General",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Favorite Greek Myths (Dover Children's Thrift Classics)",
        "Authors": "By Green, John (ILT) and Blaisdell, Bob",
        "Description": "The Greek myths have intrigued countless generations of readers with their exciting tales of adventure, calamity, and conquest. This entertaining collection — excellently retold for young audiences by Bob Blaisdell — invites children to relive the memorable experiences of familiar characters from Greek mythology.Taken directly from the writings of Homer, Hesiod, Sophocles, Aeschylus, Euripides, and other ancient storytellers, the myths recount the stirring and imaginative tales of Pandora's box, Prometheus, the dreaded Cyclops, the labors of the mighty Hercules, the captivating stories of Narcissus and Echo, Aphrodite and Eros, Daedalus and Icarus, Hades and Persephone, and many more.Set in large, easy-to-read type and enhanced by six full-page black-and-white illustrations, these enduring fables from the fountainhead of Western civilization will thrill and delight new generations of adventure-seekers.",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , Greek & Roman",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "The White Mountains",
        "Authors": "By John Christopher",
        "Description": "",
        "Category": "",
        "Publisher": "Collier Books, New York",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "International Connoisseur's Guide to Cigars: The Art of Selecting and Smoking",
        "Authors": "By Resnick, Jane and Weiser, George W. (PHT)",
        "Description": "Here is the most convenient, expert and well-priced guide you'll find to tell you what cigars are available, how and where you can get them, and what the qualities are of each brand and variety. Like fine wines, exquisite cheeses, or the best caviars, a good cigar is something to be savored and appreciated with unabashed self-indulgence. Learn everything you have to know about the size, texture, age, and taste of cigars produced in America, the Caribbean, South America, Europe, Africa, Asia, and Australia. 200 cigar brands are itemized, described, analyzed, and assayed; 80 of them are photographed. The history of cigars is included, and a special section of profiles of famous cigar smokers--from Winston Churchill to Fidel Castro, from Groucho Marx to Lauren Hutton, from Jack Kennedy to Arnold Schwartzenegger--reveals their likes and dislikes.",
        "Category": " Antiques & Collectibles , Tobacco-Related",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Heathcliff Banquet",
        "Authors": "By Gately, George",
        "Description": "",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1980"
        }
    },
    {
        "Title": "301 Great Management Ideas: From America's Most Innovative Small Companies",
        "Authors": "By Brokaw, Leslie (EDT) and Peters, Tom (INT)",
        "Description": "Culled from the pages of Inc. magazine, the ideas in this revised edition of 301 Great Management Ideas encapsulate inexpensive ways to be smarter in the marketplace. Included in this new edition are: 42 Tech Tips - smart ideas for using technology; 67 ways to market better; 61 strategies for managing people; 39 tactics for managing your money; and 24 suggestions for ways to keep your personal life as healthy as your business life.Over 100,000 copies of 301 Great Management Ideas have sold since the book debuted in 1991. Each item in this fully-updated edition made its first appearance in the pages of Inc. and Inc. Technology, the magazines for growing companies.",
        "Category": " Business & Economics , General",
        "Publisher": "Inc. Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "What Is Hanukkah? (A Lift-the-Flap Story)",
        "Authors": "By Brown, Rick and Brown, Rick (ILT)",
        "Description": "Why do we light candles?  Whatis a dreidel?  Josh learns the answers to these questions and the story of Hanukkah as he celebrates this special holiday with his family.Why do we light the menorah?  What do the letters on the dreidel mean?  Josh learns about the miracles that happened a long time ago, and how the traditions of Hanukkah are continued today.  The interactive format makes this introduction to a special holiday accessible to the very young.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Festival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Jewish Americans (Coming to America)",
        "Authors": "By Stein, Robert and Moreno, Barry",
        "Description": "They escaped from oppression and poverty in Russia, Poland, Germany, and many other parts of Europe, and settled mainly in America’s large cities. With Jewish immigration to America came their rich family and religious traditions, and their abiding respect for the arts and sciences, inspiring many among them to great achievement in these fields. Biographical sketches include Albert Einstein, the Guggenheim family, Isaac Stern, Saul Bellow, and others.This important new series documents and dramatizes the immigration experience of untold numbers of men, women, and children who arrived in America from the four corners of the world. As they assimilated into American society, they enriched the nation’s character and experience. Many of America’s immigrants passed through the Ellis Island Immigration Center in New York Harbor during the late nineteenth and early twentieth centuries. What were the initial hopes and fears of these new arrivals? Where did they first settle, and what kinds of work did they find? Which elements from their various cultures have since blended into the national scene and helped reshape what has become modern America?  The first titles in this dramatic series bring alive the experiences of four important ethnic groups, with contemporary photos and first-person accounts of their dramatic, life-changing experiences. Readers glimpse each group’s social customs, family life, traditional food and drink, festivals, and much more. There are also brief but vivid capsule biographies of famous individuals who rose to prominence from each ethnic group. Approximately 150 illustrations in each book.",
        "Category": " Young Adult Nonfiction , People & Places , United States , General",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Covering the Bases: Quotations on Baseball",
        "Authors": "By Compilation",
        "Description": "",
        "Category": "",
        "Publisher": "BARNES&NOBLE",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Animals in Winter (Let's-Read-and-Find-Out Science)",
        "Authors": "By Bancroft, Henrietta, Davie, Helen K. (ILT), and Van Gelder, Richard G.",
        "Description": "Have you ever seen a butterfly in the snow?Probably not. Butterflies can't survive cold weather, so when winter comes, many butterflies fly to warmer places. They migrate. Woodchucks don't like cold weather either but they don't migrate; they hibernate. Woodchucks sleep in their dens all winter long. Read and find out how other animals cope with winter's worst weather.",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Essential Buddhism",
        "Authors": "By Sach, Jacky",
        "Description": "",
        "Category": "",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Medea (Dover Thrift Editions: Plays)",
        "Authors": "By Euripides and Warner, Rex",
        "Description": "One of the most powerful and enduring of Greek tragedies, Medea centers on the myth of Jason, leader of the Argonauts, who has won the dragon-guarded treasure of the Golden Fleece with the help of the sorceress Medea. Having married Medea and fathered her two children, Jason abandons her for a more favorable match, never suspecting the terrible revenge she will take.Euripides' masterly portrayal of the motives fiercely driving Medea's pursuit of vengeance for her husband's insult and betrayal has held theater audiences spellbound for more than twenty centuries. Rex Warner's authoritative translation brings this great classic of world literature vividly to life.",
        "Category": " Drama , Ancient & Classical",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Book of 1,000 Poems",
        "Authors": "By Birch, Beverley",
        "Description": "A collection of poems by writers ranging from William Blake and Henry W. Longfellow to Emily Dickinson and Robert L. Stevenson, arranged by topics such as \"The Seasons,\" \"Nursery Rhymes,\" and \"Lullabies and Cradle Songs.",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Cathedral, Forge, and Waterwheel: Technology and Invention in the Middle Ages",
        "Authors": "By Gies, Joseph and Gies, Frances",
        "Description": "In this account of Europe's rise to world leadership in technology, Frances and Joseph Gies make use of recent scholarship to destroy two time-honored myths. Myth One: that Europe's leap forward occurred suddenly in the \"Renaissance,\" following centuries of medieval stagnation. Not so, say the Gieses: Early modern technology and experimental science were direct outgrowths of the decisive innovations of medieval Europe, in the tools and techniques of agriculture, craft industry, metallurgy, building construction, navigation, and war. Myth Two: that Europe achieved its primacy through \"Western\" superiority. On the contrary, the authors report, many of Europe's most important inventions - the horse harness, the stirrup, the magnetic compass, cotton and silk cultivation and manufacture, papermaking, firearms, \"Arabic\" numerals - had their origins outside Europe, in China, India, and Islam. The Gieses show how Europe synthesized its own innovations - the three-field system, water power in industry, the full-rigged ship, the putting-out system - into a powerful new combination of technology, economics, and politics.From the expansion of medieval man's capabilities, the voyage of Columbus with all its fateful consequences is seen as an inevitable product, while even the genius of Leonardo da Vinci emerges from the context of earlier and lesser-known dreamers and tinkerers.Cathedral, Forge, and Waterwheel is illustrated with more than 90 photographs and drawings. It is a Split Main Selection of the Book-of-the-Month Club.",
        "Category": " Science , History",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "An UNCOMMON SCOLD",
        "Authors": "By Adams, Abby",
        "Description": "Gathers nearly a thousand witty and acerbic sayings from such diverse women as Clare Boothe Luce and Bette Midler, arranged alphabetically by subject",
        "Category": " Reference , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "A Charlie Brown Christmas",
        "Authors": "By Fontes, Ron, Schulz, Charles M., Korman, Justine, Braddock, Paige (ILT), Mendelson, Lee, and Melendez, Bill",
        "Description": "It's Christmas!  Everyone is getting into the Christmas spirit -- except for Charlie Brown. It seems like everybody has forgotten what Christmas is truly about. But Lucy, Linus, and the whole Peanuts gang have some holiday surprises that will make even Charlie Brown feel merry!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Grand Tetons: 2 (A Studio book)",
        "Authors": "By Norton, Boyd",
        "Description": "",
        "Category": "",
        "Publisher": "Studio",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1974"
        }
    },
    {
        "Title": "Graduates Are Special",
        "Authors": "By Mead, Lucy (EDT)",
        "Description": "A Tribute to Those With Futures New and BrightGraduation is a special time.  Whether it's from elementary school, high school, technical school, college, or beyond, it is a time to celebrate personal achievement.  Graduation represents a very important life change.  Here are quotes and anecdotes from the famous and not-so-famous on education, success, and achievement.  Whether  the subject is handling a career, changing jobs, or just learning to get along in life, there are words from Greek philosophers to U.S. presidents to popular television personalities.  From serious outlooks on achievement to humorous quips on getting ahead, this collection is the perfect gift for the person embarking on a new future.Graduates are Special is a celebration of a unique group of people at a wonderful time of life.",
        "Category": " Family & Relationships , Education",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Star-Spangled Banner: Our Nation and Its Flag",
        "Authors": "By Sedeen, Margaret",
        "Description": "?Every wave of the flag is a pulse of history,? says author Margaret Sedeen. Her insightful book, filled with facts, anecdotes, and compelling images, highlights milestones in our nation?s history and documents the flag?s role in these events. Covering the evolution of the Stars and Stripes, the flag in war and diplomacy, the flag in exploration, and the flag in daily life, Sedeen?s informative text and vivid images trace the history of the United States from its dramatic birth to its rise as a superpower and leader in world diplomacy. Readers will witness the trials and triumphs of explorers who ventured across western frontiers, to the Poles, and beyond the pull of Earth?s gravity. Vivid accounts of everyday American life summon patriotic pride and stir the imagination. Through this unfolding story of our nation and its flag, Star-Spangled Banner evokes the full definition of patriotism and what it means to be an American: our love of country, our responsibilities as citizens, and our shared traditions and ideals.",
        "Category": " History , Historiography",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Freedom: A History of US",
        "Authors": "By Hakim, Joy",
        "Description": "Master storyteller Joy Hakim has excited millions of young minds with the great drama of American history in her award-winning series A History of US. Hailed by historians, educators, and parents for its exciting, thought-provoking narrative, the books have been recognized as a break-through tool in teaching history and critical reading skills to young people. And the kids themselves agree: Hakim has piles of fan letters as testimony.        Beginning in January, PBS, in association with Thirteen/WNET, General Electric and Kunhardt Productions, will present Freedom: A History of US, an innovative television mini-series based on Joy Hakim's award-winning books. Katie Couric will host the series, George and Laura Bush will introduce the first episode, and celebrated actors such as Paul Newman, Glenn Close, Robin Williams, Matthew Broderick, Angela Bassett, Jeremy Irons, John Lithgow, and Morgan Freeman will participate as narrators. The program will focus on the history of the United States through the inspiring story of our fight to uphold the ideal of freedom, beginning with the Declaration of Independence in 1776, culminating in the Civil Rights movement, and concluding with the challenges posed by the September 11th attacks. In 8 one-hour episodes appearing nationally on public television, the story of America will unfold through Joy Hakim's vision: her belief that freedom survives again and again, despite all the mistakes and tragic setbacks, and that in order to succeed in upholding this great ideal we must examine the past.      The Freedom: A History of US companion book to the PBS series will capture both the visual energy of the programs and Hakim's rare gift for telling history through the lives of its makers. The book will follow the thread of the programs and also expand on them, providing a more complete picture of the people and events that shaped a defiant band of thirteen colonies into a great nation of 50 states. More than 400 illustrations, sidebars, and historical documents enhance this stunning look at American history for families to share, discuss, and treasure. Freedom: A History of US is an essential book for every household in America, and reminds us that great storytelling and a passion for freedom will always have a place at the table.",
        "Category": " History , United States , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Christmas Story: Told Through Paintings",
        "Authors": "By Metropolitan Museum of Art (New York, N. Y.)",
        "Description": "Features medieval paintings from the Metropolitan Museum of Art accompanied by biblical passages from the King James Bible",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Anatomy of the Sacred: An Introduction to Religion",
        "Authors": "By Livingston, James C.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Mothers Day Ideals 2004 (Ideals Mother's Day)",
        "Authors": "By Hogan, Julie K.",
        "Description": "",
        "Category": " Religion , Holidays , General",
        "Publisher": "Ideals Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Roget's Thesaurus of the Bible",
        "Authors": "By Day, A. Colin (EDT)",
        "Description": "A thesaurus applied to the Bible features 43,751 Bible references sorted into accessible categories, synonyms that cover the entire spectrum of meaning, subject and Bible indexes, and more. $50,000 ad/promo.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Amos & Boris",
        "Authors": "By Steig, William",
        "Description": "Simple watercolor drawings and narration relate the way in which a tiny mouse named Amos and a huge whale named Boris become the best of friends",
        "Category": " Juvenile Fiction , Animals , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "24.94",
        "Publish Date": {
            "Month": "October",
            "Year": "1977"
        }
    },
    {
        "Title": "Can't You Sleep, Little Bear?",
        "Authors": "By Waddell, Martin and Firth, Barbara (ILT)",
        "Description": "\"I don't like the dark,\" said Little Bear.\"What dark?\" said Big Bear.\"The dark all around us,\" said Little Bear.In this tender account of a sleepless night in the bear cave, Big Bear sets out with all his patience and understanding to show Little Bear that the dark is nothing to be afraid of.  When all the lanterns in the cave aren't enough to quell Little Bear's troubled emotions, Big Bear offers—in a final loving gesture—nothing less than the bright yellow moon and the twinkling stars!  More comforting than even the best of lullabies, this bedtime story is destined to become a classic.",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Country Innkeepers' Cookbook: In which Vermont Innkeepers Wilf and Lois Copping Share Their Favorite Never-Miss Recipes for Foods With Flair",
        "Authors": "By Wilf Copping, Lois Copping",
        "Description": "",
        "Category": "",
        "Publisher": "Yankee",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Chesapeake Bay Crab Cookbook",
        "Authors": "By Shields, John and Kirschbaum, Jed (PHT)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Shy Little Bunny",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing Books",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Favorite North American Indian Legends (Dover Children's Thrift Classics)",
        "Authors": "By Kliros, Thea (ILT) and Smith, Philip (EDT)",
        "Description": "Here is a treasury of charming tales brimming with the humor, whimsy and imagination characteristic of Native American folklore. Specially chosen from children, the stories include an Algonquin tale of how Glooskap conquered the Great Bull-Frog, and how pollywogs, crabs, leeches, and other water creatures were created; \"The Meeting of the Wild Animals,\" a Tsimshian myth recounting how the four seasons came into being and why all animals are afraid of the porcupine; \"The Bear Man,\" a Cherokee legend about a hunter who lived with her prey; and \"The Man Who Married the Moon,\" a Pueblo tale of a great chief, his beautiful wife, and the treachery of two evil corn maidens.These and nine other authentic tales offer a wealth of reading entertainment as well as insight into American Indian life and culture. Six new full-page illustrations by Thea Kliros enhance the text, printed in large, easy-to-read type.",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "A Bug, a Bear, and a Boy (Scholastic Reader, Level 1)",
        "Authors": "By McPhail, David",
        "Description": "The illustrator of the best-selling If You Were My Bunny uses simple sentences and watercolor illustrations to tell the story of three fast friends who share the same book, in an easy-to-read story. Original.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Maya (Ancient peoples and places)",
        "Authors": "By COE, Michael D.",
        "Description": "",
        "Category": "",
        "Publisher": "Thames and Hudson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Who's in Rabbit's House? (Masai Tale)",
        "Authors": "By Dillon, Leo (ILT), Dillon, Diane (ILT), and Aardema, Verna",
        "Description": "A great bedtime story sure to keep children fascinated, Who’s in Rabbit’s House is a Masai tale told from the perspective of a play within a play. A monster has invaded Rabbit’s house, and the other animals must gather to help investigate . . . and scare the monster away. This story teaches children it is important to help each other in times of need.",
        "Category": " Juvenile Fiction , People & Places , Africa",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The First Strawberries (Picture Puffin Books)",
        "Authors": "By Bruchac, Joseph and Vojtech, Anna (ILT)",
        "Description": "From an award-winning Native American storyteller comes this captivating re-telling of a Cherokee legend, which explains how strawberries came to be. Long ago, the first man and woman quarrelled. The woman left in anger, but the Sun sent tempting berries to Earth to slow the wife's retreat. Luminous paintings perfectly complement this simple, lyrical text. \"Complete harmony of text and pictures: altogether lovely.\"-- Kirkus Reviews, pointer review",
        "Category": " Juvenile Fiction , People & Places , United States , Native American",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "A Turkey for Thanksgiving",
        "Authors": "By Bunting, Eve and De Groat, Diane (ILT)",
        "Description": "Mr. and Mrs. Moose invite all their animal friends for Thanksgiving dinner and the only one missing is Turkey. When they set out to find him, Turkey is quaking with fear because he doesn't realize that his hosts want him at their table, not on it.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Thanksgiving",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The First Americans (American Indians)",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "A history of the first Americans depicts their everyday life, food, shelter, culture, pottery, crafts, and clothing",
        "Category": " History , General",
        "Publisher": "Time Life",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "There's Treasure Everywhere--A Calvin and Hobbes Collection (Volume 15)",
        "Authors": "By Watterson, Bill",
        "Description": "In the world that Calvin and his tiger Hobbes share, treasures can be found in the most unlikely places, from the outer regions where Spaceman Spiff travels to the rocks in the backyard--this curious duo roams their world in search of fortunes (and misfortunes!) to be experienced. Whether Calvin and Hobbes are blasting off on another interplanetary adventure or approaching warp speed on a downhill wagon ride, their capers consistently charm and refresh their readers&#39; days. On his own, Calvin is prey to the insidious killer bicycle, is the arbiter of the Dad poll, is the creator of a legion of snowmen who provide an incisive social commentary, and Hobbes is always there as the perfect companion. Watterson&#39;s talent is evidenced by the range of thought-provoking emotions the strip encompasses in addition to the laughs it induces: the loyalty and friendship between Calvin and Hobbes, the challenge of being a patient parent, and the sardonic viewpoint of a cynical six-year-old (\"I&#39;m a 21st-century kid trapped in a 19th-century family,\" laments Calvin) combine to make this one of the best-loved strips in cartoon history.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Barkis",
        "Authors": "By Newberry, Clare Turlay",
        "Description": "Family strife results when James' cocker spaniel puppy does not make friends with Nell Jean's tabby kitten",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Famous Bears and Friends: One Hundred Years of Teddy Bear Stories, Poems",
        "Authors": "By Coleman, Janet Wyman (EDT)",
        "Description": "One hundred years ago, Teddy Roosevelt refused to shoot a helpless bear. A toy maker in Brooklyn honored the noble act by creating a plush, stuffed toy with movable arms and legs and a bright, bearish face. The teddy bear was born. A century later this bear has inspired beloved stories, a hit song, and numerous silly, sad, and loving poems, many of which are gathered here in a big, full-color treasury.  The collection includes a chapter each from Winnie-the-Pooh and A Bear Called Paddington; the full text of Corduroy; poems by Shel Silverstein, Judith Viorst, A. A. Milne, and others; a song; and a lively illustrated history of the world's favorite toy.",
        "Category": " Juvenile Nonfiction , History , United States , 20th Century",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "I Need an Easter Egg",
        "Authors": "By Ziefert, Harriet and Rader, Laura (ILT)",
        "Description": "Little Rabbit is looking for the perfect Easter egg for his grandma. But nobody seems to know where to find one. Lift the flaps to help Little Rabbit find the Easter egg that's just right!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Machiavelli's The Prince (Cliffs Notes)",
        "Authors": "By Vergani, Luisa",
        "Description": "Cliffs Test Preparation Guides help students prepare for and improve their performance on standardized tests ACT Preparation Guide CBEST Preparation Guide CLAST Preparation Guide ELM Review GMAT Preparation Guide GRE Preparation Guide LSAT Preparation Guide MAT Preparation Guide MATH Review for Standardized Tests MSAT Preparation Guide Memory Power for Exams Police Officer Examination Preparation Guide Police Sergeant Examination Preparation Guide Police Management Examinations Preparation Guide Postal Examinations Preparation Guide Praxis I: PPST Preparation Guide Praxis II: NTE Core Battery Preparation Guide SAT Preparation Guide SAT II Writing Preparation Guide TASP Preparation Guide TOEFL Preparation Guide with 2 cassettes Advanced Practice for the TOEFL with 2 cassettes Verbal Review for Standardized Tests Writing Proficiency Examinations You Can Pass the GED Cliffs Quick Reviews help students in introductory college courses or Advanced Placement classes Algebra I Algebra II Anatomy & Physiology Basic Math and Pre-Algebra Biology Calculus Chemistry Differential Equations Economics Geometry Linear Algebra Microbiology Physics Statistics Trigonometry Cliffs Advanced Placement Preparation Guides help high school students taking Advanced Placement courses to earn college credit AP Biology AP Calculus AB AP Chemistry AP English Language & Composition AP English Literature & Composition AP United States History Cliffs Complete Study Editions are comprehensive study guides with complete text, running commentary and glossary Chaucer's Prologue Chaucer's Wife of Bath Hamlet Julius Caesar King Henry IV, Part I King Lear Macbeth The Merchant of Venice Othello Romeo and Juliet The Tempest Twelfth Night See inside back cover for listing of Cliffs Notes titles Registered trademarks include: GRE, MSAT, the Praxis Series, and TOEFL (Educational Testing Service): AP, Advanced Placement Program, and SAT (College Entrance Examination Board); GMAT (Graduate Management Admission Council); and LSAT (Law School Admission Council.) The Prince",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1967"
        }
    },
    {
        "Title": "The Prince (Dover Thrift Editions) (Dover Thrift Editions: Philosophy)",
        "Authors": "By Machiavelli, Niccolo and Thompson, Norma H.",
        "Description": "As a young Florentine envoy to the courts of France and the Italian principalities, Niccolò Machiavelli (1469–1527) was able to observe firsthand the lives of people strongly united under one powerful ruler. His fascination with that political rarity and his intense desire to see the Medici family assume a similar role in Italy provided the foundation for his \"primer for princes.\" In this classic guide to acquiring and maintaining political power, Machiavelli used a rational approach to advise prospective rulers, developing logical arguments and alternatives for a number of potential problems, among them governing hereditary monarchies, dealing with colonies and the treatment of conquered peoples. Refreshing in its directness, yet often disturbing in its cold practicality, The Prince sets down a frighteningly pragmatic formula for political fortune. Starkly relevant to the political upheavals of the 20th century, this calculating prescription for power remains today, nearly 500 years after it was written, a timely and startling lesson in the practice of autocratic rule that continues to be much read and studied by students, scholars and general readers as well.",
        "Category": " Philosophy , Political",
        "Publisher": "Dover Publications, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2016"
        }
    },
    {
        "Title": "Garden Clippings",
        "Authors": "By Andrews McMeel Publishing, Smallwood & Stewart",
        "Description": "Features prose, verse, and quotations on gardens and gardening by Robert Louis Stevenson, Nathaniel Hawthorne, Katherine Mansfield, Edmund Spenser, Lord Byron, Celia Thaxter, Gertrude Jekyll, and others",
        "Category": " Gardening , Flowers , General",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "All-Maine Cooking",
        "Authors": "By Wiggin, Ruth",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , New England",
        "Publisher": "Down East Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Johnny Appleseed: My Story (Step-Into-Reading, Step 3)",
        "Authors": "By Harrison, David L. and Wohnoutka, Mike (ILT)",
        "Description": "Johnny Appleseed was an important historical figure, well known for planting apple orchards across the new frontier. But he was also a master storyteller! In his own folksy voice, Johnny Appleseed tells his story to a couple of entranced children in this fictionalized Step 2 title. Readers learn how he started planting apple trees—and about some of the myths and true stories of his life.",
        "Category": " Juvenile Nonfiction , Readers , Intermediate",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Nefertiti and Cleopatra: Queen-Monarchs of Ancient Egypt",
        "Authors": "By Julia Samson",
        "Description": "",
        "Category": "",
        "Publisher": "BARNES & NOBLE BOOKS NY",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Newt Gingrich: Speaker to America",
        "Authors": "By Warner, Judith and Berley, Max",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Signet",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Scarlet Pimpernel (Dover Thrift Editions)",
        "Authors": "By Orczy, Emmuska Orczy, Baroness",
        "Description": "By 1792, the idealism of the French Revolution has degenerated into a Reign of Terror. Ruthless mobs rule the streets of Paris, and each day, hundreds of royalists are sacrificed to the guillotine, with hundreds more condemned to follow. Their only hope lies in rescue by the Scarlet Pimpernel, the daring leader of an English faction that spirits aristocrats across the Channel to safety. This historical adventure tale first appeared in 1905, but its irresistible blend of romance, intrigue, and suspense renders it timeless. Readers thrill to the gallantry of the Pimpernel, whose nom de guerre derives from the wildflower he employs as a calling card. A scourge to the French authorities, the Pimpernel is the darling of the people — particularly Marguerite Blakeney, who scorns her foppish husband, Sir Percy, as ardently as she admires the Pimpernel. The basis of a classic film, this ever-popular story has recently been adapted as a musical, to the delight of Broadway audiences.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Dear Friend: A Treasury Of Friendship",
        "Authors": "By Eisen, Armand (EDT) and Officer, Robyn (EDT)",
        "Description": "More than simply a collection of quotes on friendship, Dear Friend . . . is an imaginative illustrated personal tribute to the joy of friendship by beloved artist Robyn Officer. A top-seller in the Little Book format, Dear Friend . . . is now available for the first time as a 5\" x 5\" fully illustrated gift book. Beyond merely providing illustrations, Robyn Officer hand-lettered the text of the book and fully illustrated the borders and endpapers. Full of quotations and proverbs about friendship, this book will make a heartfelt gift for a cherished friend.",
        "Category": " Family & Relationships , Friendship",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Simple Foods for the Pack, Second Edition",
        "Authors": "By Axcell, Claudia, Cooke, Diana, Kinmont, Vikki, and Sierra Club (COR)",
        "Description": "Featuring more than 180 trail-tested recipes for portable, delicious, and easy-to-prepare meals, this updated edition of the original - and best - natural foods backpacking cookbook adds Cordon Bleu chef's expertise to delight the palates of backpackers and day-hikers. It stresses variety and tastiness, with special attention to nourishment, nutritional balance, low cost, and health.Mouth-watering recipes include Moroccan couscous, hot and sour soup, salmon in tomato-orange sauce, chocolate fudge pudding, and walnut spice cake. These foods are easily packed and use lightweight and long-lasting ingredients. The cookbook also provides menus; makes suggestions for foods prepared at home; and offers tips on packaging and carrying foods, selecting tools and utensils, medical information, use of fires, treating water, and where to buy ingredients.",
        "Category": " Cooking , Reference",
        "Publisher": "Sierra Club Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "A Week in Winter",
        "Authors": "By Willett, Marcia",
        "Description": "Any reader who has ever fallen in love with a house will understand the attraction of Moorgate, a light-and-fresh-air-filled old farmhouse on the edge of the moor in Cornwall.  The enchanting house now belongs to seventy-something Maudie Todhunter, the late Lord Todhunter's  free-spirited second wife. (The first wife, Hilda, was supposedly a  paragon of  virtue, and Maudie has always felt second-best.)  The light of Maudie's life is her vivacious stepgranddaughter, Posy, who begs Maudie to board a giant English mastiff whom Posy's mean-spirited mother has banned from the house. (The large and ungainly Polonius is an impossibly lovable canine who outshines Lassie by a mile and is destined  to become a favorite of readers worldwide.)When Maudie decides to sell Moorgate, all kinds of old family secrets come to light,  and so the saga begins.  Along the way, Rob, the contractor of Moorhouse, falls in love with a woman who has a sad secret.   Posy's father falls in love with someone kinder than his shrewish wife.  Maudie must reevaluate someone she'd fallen in love with years ago.  And as the connections intertwine between the past and the present, many unexpected alliances form.Vivid, lushly written, and entirely unforgettable, this all-absorbing novel provides the kind of abundant reading experience that will leave readers eagerly looking forward to more from this newly discovered and superbly talented author.",
        "Category": " Fiction , Literary",
        "Publisher": "Thomas Dunne Books / St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Where Are You, Blue Kangaroo",
        "Authors": "By Chichester Clark, Emma",
        "Description": "After being left on the school bus and in the park, Blue Kangaroo begins to wonder about his relationship with his best friend, Lily, and soon fears that he may be left behind for good one day if she doesn't make an effort to change her ways. By the author of I Love You, Blue Kangaroo. Reprint.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Dragonfly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Beyond the Battlefield: The Ordinary Life and Extraordinary Times of the Civil War Soldier",
        "Authors": "By Madden, David (EDT)",
        "Description": "Blackandwhite period photographs and excerpts from the memoirs, letters, and journals of soldiers on both sides of the Civil War conflict provide a firsthand look at the everyday lives of ordinary soldiers, from what they wore and what they ate to the leisure activities that they used to combat the boredom of military life. Original.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The Blind Men and the Elephant (Hello Reader!, Level 3, Grades 1&2)",
        "Authors": "By Backstein, Karen and Mitra, Annie (ILT)",
        "Description": "A retelling of the fable from India about six blind men who each get a limited understanding of what an elephant is by feeling only one part of it",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "For Grandma (Mini Book) (Petites)",
        "Authors": "By Charming Petites and Anello, Christina (EDT)",
        "Description": "",
        "Category": " Family & Relationships , Parenting , Grandparenting",
        "Publisher": "Peter Pauper Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Partners (Laws of the Blood, Book 2)",
        "Authors": "By Sizemore, Susan",
        "Description": "Vampire Enforcer Char McCairn and vampire hunter Jebel Haven are forced into an uneasy alliance as together they prowl the streets of Seattle in search of a young renegade vampire and stumble upon a bizarre, evil cult that could threaten the power of vampires and humans alike. Reissue.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Love and Other Four-Letter Words (Laurel-Leaf Books)",
        "Authors": "By Mackler, Carolyn",
        "Description": "With her parents splitting up, 16-year-old Sammie Davis may not want to feel a thing, but feelings happen. For starters, she’s plenty angry. Her dad’s leaving their upstate New York home and moving clear acrossthe country. Her mother—well, she’s packing up and relocating to New York City with Sammie, who has no say about any of it. Overnight Sammie is forced to deal with change. And one change spawns another: Roles get reversed, old and new friendships tested, and sexual feelings awakened. It’s a scary time. But as Sammie realizes that things can’t stay the same forever, that even the people she loves and trusts the most can disappoint her, she begins to accept that change isn’t always bad. It’s how you cope, jumbled feelings and all, that counts. And as she copes, Sammie’s sense of self emerges proud and strong.",
        "Category": " Young Adult Fiction , Social Themes , Dating & Sex",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Black Unicorn (Landover)",
        "Authors": "By Brooks, Terry",
        "Description": "A year had passed since Ben Holiday bought the Magic Kingdom from the wizard Meeks, who had set a series of pitfalls against him. Ben survived, by the aid of three loyal friends: Questor Thews, and ill-trained wizard; Abernathy, a talking dog, the Court Scribe; and the lovely Willow, who sometimes had to be a tree.Bu ben had been troubled by dreams of disaster to his former partner, Miles Bennett. Yet when he returned to Earth, Ben found Miles doing splendidly.Unknown to Ben, the dreams had been a trap by Meeks, who had returned to the Magic Kingdom as a tiny insect hidden in Ben's clothing. That first night back in Landover, Ben awoke to see Meeks gloating over him. claiming to have the medallion that could summon the mysterious knight-protector, the Paladin, and that he had cast a spell to witch appearances with Ben.Ben found himself outcast, no longer recognized by any friend, though all his powerful enemies seemed to know him. Without the medallion, he couldn't seek the help of the Paladin against Meeks. There was only the prism cat—whatever that might be!And where was Willow—and the mysterious black unicorn she'd set out to find?",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Basic Teachings of the Great Philosophers",
        "Authors": "By Frost, S. E.",
        "Description": "A complete summary of the views of the most important philosophers since the beginning of Western civilization. Each major field of philosophic inquiry is treated in a separate chapter, so that each chapter can be read as a complete unit, without reference to the others. Includes Plato, Descartes, Spinoza, Kant, Hegel, Dewey, Sartre, and many others.",
        "Category": "",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1962"
        }
    },
    {
        "Title": "Get a Grip on Philosophy",
        "Authors": "By Turnbull, Neil",
        "Description": "Provides an introduction to the discipline of philosophy, and includes information on the well-known figures in the field.",
        "Category": " Philosophy , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "On love",
        "Authors": "By Dickinson, Emily",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Joey the Jack-O-Lantern (Giant First-Start Reader)",
        "Authors": "By Palazzo-Craig, Janet and Miller, Susan (ILT)",
        "Description": "Joey the jack-o'-lantern longs to be scary for Halloween, but no one is frightened until Willie Witch lends her help to Joey",
        "Category": "",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Czars: Russia's rulers for over one thousand years",
        "Authors": "By James P. Duffy, Vincent L. Ricci",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Useful Pig: 150 Succulent Pork Recipes",
        "Authors": "By Smoler, Roberta Wolfe",
        "Description": "Offers a brief history of the pig, and shares international-style recipes for appetizers, terrines, pates, soups, barbecues, stir-fry dishes, and main dishes featuring pork, ham, or bacon",
        "Category": " Cooking , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "The New Yorker Book of Dog Cartoons",
        "Authors": "By The New Yorker (COR)",
        "Description": "A collection of the finest dog cartoons that have appeared in The New Yorker from 1925 to the preset features the work of such comic masters as Charles Addams, George Booth, James Thurber, Roz Chast, and Saul Steinberg. 75,000 first printing. $75,000 ad/promo.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Poisoned Ivy: How Egos, Ideology, and Power Politics Almost Ruined Harvard Law School",
        "Authors": "By Kerlow, Eleanor",
        "Description": "Harvard Law School - the very name echoes with power, influence, and prestige. The oldest law school in the United States, Harvard has long been considered the paragon of American legal education.But even an institution as steeped in tradition as Harvard Law was not immune to the changing academic and social climate of the 1970s and 1980s, when multiculturalism, political correctness, and gender politics became issues of increasing significance.Change came with the arrival of three liberal professors and an attack-from-within was launched against Harvard's conservatism. Their efforts were seen by some colleagues as an attempt to subvert the \"mission\" of the school - its very essence.When Harvard Law Review editors published a vulgar parody of an article by a sensationally murdered feminist legal scholar, the turmoil at Harvard Law made national headlines. Constitutional law expert Laurence Tribe railed against the Law Review while civil libertarian Alan Dershowitz aggressively defended it. This was one of the many scandals to rock the ivy-covered walls of Harvard Law.",
        "Category": " Law , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Thomas Jefferson the Man, His World, His Influence",
        "Authors": "By Weymouth",
        "Description": "",
        "Category": "",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Essays of E.B. White",
        "Authors": "By White, E. B.",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "All About Hanukkah",
        "Authors": "By Groner, Judyth Saypol",
        "Description": "Discusses the historical background for Hanukkah and examines its blessings, music, games, and modern observance",
        "Category": " Religion , Holidays , Jewish",
        "Publisher": "Kar-Ben Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Skywatching (Nature Company Guides)",
        "Authors": "By Levy, David H. and O'Byrne, John",
        "Description": "An accessible guide to the heavens for general readers of high school age and up, full of spectacular color photos and illustrations. Sections on skywatching through the ages, stars and galaxies, skywatching tools and techniques, and probing the universe feature bite-sized chunks of information on scientific and technical concepts, as well as human and historical aspects of astronomy. Includes sky charts and constellation maps, and an annotated resource directory. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Science , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Ancient China (Nature Company Discoveries Libraries)",
        "Authors": "By Simpson, Judith and Michaelson, Carol (EDT)",
        "Description": "An informative account of the more than 7,000-year-old civilization of China including insights into the individuals who helped shape this country",
        "Category": " Juvenile Nonfiction , History , Asia",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Hooway for Wodney Wat",
        "Authors": "By Munsinger, Lynn (ILT) and Lester, Helen",
        "Description": "Poor Rodney Rat can't pronounce his R's and the other rodents tease him mercilessly. But when Camilla Capybara joins Rodney's class and announces that she is bigger, meaner, and smarter than any of the other rodents, everyone is afraid. It seems she really is bigger, meaner, and smarter than all of the rest of them. Until our unwitting hero, Wodney Wat, catches Camilla out in a game of Simon Says. Read along with Wodney as he surprises himself and his classmates by single-handedly saving the whole class from the big bad bully. Children will delight as shy Rodney Rat triumphs over all and his tiny voice decides the day, R's or no R's.",
        "Category": " Juvenile Fiction , Social Themes , Self-Esteem & Self-Reliance",
        "Publisher": "Sandpiper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Native American Tales and Legends (Dover Children's Evergreen Classics)",
        "Authors": "By Macfarlan, Allan A.",
        "Description": "This exciting collection contains more than thirty richly imaginative stories from a variety of Native American sources — Cherokee to Zuñi, Pawnee to Midu — covering a broad spectrum of subjects, as well as tales of little people, giants, and monsters, and of magic, enchantment, sorcery, and the spirit world.Readers will find stories telling how the earth, people, and bison were created and how fire was discovered, while others introduce the hero Glooscap and the Maiden of the Yellow Rocks. Still other traditional tales tell of the troubles Rabbit's boastfulness got him into, and about the clever ways Little Blue Fox managed to escape from Coyote.Among the stories in this collection are \"The White Stone Canoe\" (Chippewa), \"Raven Pretends to Build a Canoe\" (Tsimshian), \"The Theft from the Sun\" (Blackfoot), \"The Loon's Necklace\" (Iroquois), \"The Rabbit Goes Duck Hunting\" (Cherokee), \"The Coyote\" (Pueblo), and \"The Origin of the Buffalo and of Corn\" (Cheyenne). Young people will delight in these tales, as will any reader interested in Native American stories or folklore in general.",
        "Category": " Social Science , Ethnic Studies , Native American Studies",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Native American Songs and Poems: An Anthology (Dover Thrift Editions)",
        "Authors": "By Swann, Brian (EDT)",
        "Description": "In this carefully chosen collection, encompassing traditional songs and contemporary Native American poetry, readers will find a treasury of lyrics verse composed by Seminole, Hopi, Navajo, Pima, Havasupai, Arapaho, Paiute, Nootka, and other Indian writers and poets.Selections range from the beautiful, traditional Seminole \"Song for Bringing a Child into the World\" to the cynical, knowing \"How to Write the Great American Indian Novel.\" Permeated by the Indian's deep awareness and appreciation of nature's beauty and rhythms, these poems deal with themes of tradition and continuity, the Indians' place in contemporary society, love, loss, memory, alienation, and many other topics.Taken together, these poems offer an intimate, revealing record of the Native American response to the world, from time-honored chants and songs to the musings of urban Indian poets coming to grips with twentieth-century America.",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Night before Christmas (All Aboard Books)",
        "Authors": "By Moore, Clement Clarke and Hirashima, Jean (ILT)",
        "Description": "St.   Nick and eight tiny reindeer descend through a brilliant night sky, and so the   famous Christmas poem begins. Jan Brett captures the spirit of Clement Moore's classic poem in   glorious illustrations. As St. Nick goes to work, he doesn't realize there are two stowaways from the North Pole exploring the sacks of gifts on the roof! A unique and beautiful edition, which all the family will cherish   for years to come.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    }
]