[
    {
        "Title": "13 Bankers: The Wall Street Takeover and the Next Financial Meltdown",
        "Authors": "By Johnson, Simon and Kwak, James",
        "Description": "Even after the ruinous financial crisis of 2008, America is still beset by the depredations of an oligarchy that is now bigger, more profitable, and more resistant to regulation than ever. Anchored by six megabanks—Bank of America, JPMorgan Chase, Citigroup, Wells Fargo, Goldman Sachs, and Morgan Stanley—which together control assets amounting, astonishingly, to more than 60 percent of the country’s gross domestic product, these financial institutions (now more emphatically “too big to fail”) continue to hold the global economy hostage, threatening yet another financial meltdown with their excessive risk-taking and toxic “business as usual” practices. How did this come to be—and what is to be done? These are the central concerns of13 Bankers, a brilliant, historically informed account of our troubled political economy.In 13 Bankers, Simon Johnson—one of the most prominent and frequently cited economists in America (former chief economist of the International Monetary Fund, Professor of Entrepreneurship at MIT, and author of the controversial “The Quiet Coup” inThe Atlantic)—and James Kwak give a wide-ranging, meticulous, and bracing account of recent U.S. financial history within the context of previous showdowns between American democracy and Big Finance: from Thomas Jefferson to Andrew Jackson, from Theodore Roosevelt to Franklin Delano Roosevelt. They convincingly show why our future is imperiled by the ideology of finance (finance is good, unregulated finance is better, unfettered finance run amok is best) and by Wall Street’s political control of government policy pertaining to it.As the authors insist, the choice that America faces is stark: whether Washington will accede to the vested interests of an unbridled financial sector that runs up profits in good years and dumps its losses on taxpayers in lean years, or reform through stringent regulation the banking system as first and foremost an engine of economic growth. To restore health and balance to our economy, Johnson and Kwak make a radical yet feasible and focused proposal: reconfigure the megabanks to be “small enough to fail.”Lucid, authoritative, crucial for its timeliness, 13 Bankers is certain to be one of the most discussed and debated books of 2010.",
        "Category": " Business & Economics , Banks & Banking",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Kaplan GRE Exam Math Workbook (Kaplan GRE Math Workbook)",
        "Authors": "By Kaplan (COR)",
        "Description": "NEW! Details and practice for the new question typeHundreds of test-like practice questionsDetailed answer explanationsProven score-raising strategiesTactics for solving all question typesReview of core math concepts",
        "Category": " Study Aids , GRE (Graduate Record Examination)",
        "Publisher": "Kaplan Publishing",
        "Price Starting With ($)": "5.85",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "So You Don't Want to Go to Church Anymore",
        "Authors": "By Jacobsen, Wayne and Coleman, Dave",
        "Description": "Jake Colsen, an overworked and disillusioned pastor, happens into a stranger who bears an uncanny resemblance (in manner) to the apostle John. A number of encounters with John as well as a family crisis lead Jake to a new understanding of what his life should be like: one filled with faith bolstered by a steady, close relationship with the God of the universe. Facing his own disappointment with Christianity, Jake must forsake the habits that have made his faith rote and rediscover the love that captured his heart when he first believed.Compelling and intensely personal, SO YOU DON'T WANT TO GO TO CHURCH ANYMORE relates a man's rebirth from performance-based Christianity to a loving friendship with Christ that affects all he does, thinks, and says. As John tells Jake, \"There is nothing the Father desires for you more than that you fall squarely in the lap of his love and never move from that place for the rest of your life.\"",
        "Category": " Religion , Christian Living , Spiritual Growth",
        "Publisher": "Windblown Media",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Pharmacology for Nursing Care, 7th Edition",
        "Authors": "By Lehne, Richard A.",
        "Description": "This text emphasizes understanding over memorization to effectively present the \"big picture? through the use of drug prototypes, large and small print, and special foundational chapters that cover principles related to each body system. At the end of each chapter, a summary of major nursing implications also helps you apply the material to real-world situations. The accompanying companion CD-ROM features audio and printable key points that you can download to a CD or MP3 player. The CD-ROM also features 700 NCLEX® examination-style multiple-choice review questions, animations depicting drug mechanisms and effects, flash cards, and numerous electronic calculators.UNIQUE! Summaries of Major Nursing Implications at the end of each chapter help you understand how to apply concepts to clinical practice in an easy-to-understand format. A prototype drug approach uses one drug within each drug family that characterizes all members of its group to give you the knowledge you need to learn not only about related drugs currently on the market, but also about those drugs that will be released once the student begins practice. Uses large print to identify essential \"need-to-know? information and small print to identify \"nice-to-know? informationConcise drug summary tables present quick reference to detailed information on individual drugs, including class, generic and trade names, dosages, routes, and indications. End-of-chapter Key Points are summarized in a bulleted format to facilitate your review of the most important concepts in each chapter. Patient and family teaching content is highlighted to emphasize this key content and provide you with critical information to include in teaching patients about drugs and effects and stresses points for educating family members when they will be helping to care for the patient. Provides Anatomy and Physiology and Pathophysiology reviews at the beginning of chapters to help you understand the relationships pharmacology and the biologic systems that drugs influence. A comprehensive collection of appendixes includes a concise overview of Canadian drug information, gender-related drugs, drug administration techniques, normal laboratory values, and much more. Companion CD-ROM features 700 NCLEX examination-style multiple-choice review questions, animations depicting drug mechanisms and effects, flash cards, key points, and numerous electronic calculators. Includes numerous new drugs and formulations recently approved by the FDA to keep you current with today's drug therapy practice.Special Interest Topic boxes address late-breaking issues in pharmacology that have recently emerged in the media so you can learn the current events that may affect them in practice. Extensive revision to the Cancer Chemotherapy unit provides you with up-to-date information on new drug therapy in this complex and rapidly changing area of practice. Companion CD-ROM features audio and printable key points that you can download to a CD or MP3 player to listen to and review at their leisure. Additional full-color graphics illustrate how drugs work in the body and depict key pharmacologic principles.",
        "Category": " Medical , Nursing , Pharmacology",
        "Publisher": "Saunders",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "The Promise: President Obama, Year One",
        "Authors": "By Alter, Jonathan",
        "Description": "Barack Obama’s inauguration as president on January 20, 2009, inspired the world. But the great promise of “Change We Can Believe In” was immediately tested by the threat of another Great Depression, a worsening war in Afghanistan, and an entrenched and deeply partisan system of business as usual in Washington. Despite all the coverage, the backstory of Obama’s historic first year in office has until now remained a mystery.In The Promise: President Obama, Year One, Jonathan Alter, one of the country’s most respected journalists and historians, uses his unique access to the White House to produce the first inside look at Obama’s difficult debut. What happened in 2009 inside the Oval Office? What worked and what failed? What is the president really like on the job and off-hours, using what his best friend called “a Rubik’s Cube in his brain?\" These questions are answered here for the first time. We see how a surprisingly cunning Obama took effective charge in Washington several weeks before his election, made trillion-dollar decisions on the stimulus and budget before he was inaugurated, engineered colossally unpopular bailouts of the banking and auto sectors, and escalated a treacherous war not long after settling into office. The Promise is a fast-paced and incisive narrative of a young risk-taking president carving his own path amid sky-high expectations and surging joblessness. Alter reveals that it was Obama alone—“feeling lucky”—who insisted on pushing major health care reform over the objections of his vice president and top advisors, including his chief of staff, Rahm Emanuel, who admitted that “I begged him not to do this.”Alter takes the reader inside the room as Obama prevents a fistfight involving a congressman, coldly reprimands the military brass for insubordination, crashes the key meeting at the Copenhagen Climate Change conference, and bounces back after a disastrous Massachusetts election to redeem a promise that had eluded presidents since FDR.In Alter’s telling, the real Obama is an authentic, demanding, unsentimental, and sometimes overconfident leader. He adapted to the presidency with ease and put more “points on the board” than he is given credit for, but neglected to use his leverage over the banks and failed to connect well with an angry public. We see the famously calm president cursing leaks, playfully trash-talking his advisors, and joking about even the most taboo subjects, still intent on redeeming more of his promise as the problems mount.This brilliant blend of journalism and history offers the freshest reporting and most acute perspective on the biggest story of our time. It will shape impressions of the Obama presidency and of the man himself for years to come.",
        "Category": " Political Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Somewhere Inside: One Sister's Captivity in North Korea and the Other's Fight to Bring Her Home",
        "Authors": "By Ling, Lisa and Ling, Laura",
        "Description": "Somewhere Inside is the electrifying, never-before-told story of Laura Ling’s capture by the North Koreans in March 2009, and the efforts of her sister, journalist Lisa Ling, to secure Laura’s release by former President Bill Clinton. This riveting true account of the first ever trial of an American citizen in North Korea’s highest court carries readers deep inside the world’s most secretive nation while it poignantly explores the powerful, inspiring bonds of sisterly love.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Principles of Marketing",
        "Authors": "By Kotler, Philip and Armstrong, Gary",
        "Description": "Today’s marketing challenge is creating vibrant, interactive communities of consumers who make products and brands a part of their daily lives. Learn how to create value and gain loyal customers. Kotler/Armstrong is a comprehensive, classic principles text organized around an innovative customer-value framework. Students learn how to create customer value, target the correct market, and build customer relationships. The changing nature of consumer expectations means that marketers must learn how to build communities in addition to brand loyalty. The thirteenth edition of Kotler/Armstrong has been fully updated and redesigned to make the book easier to use. Chapters now contain opening vignettes and accompanying outlines to help students study.Defining Marketing and the Marketing Process; Understanding the Marketplace and Consumers; Designing a Customer-Driven Marketing Strategy and Marketing Mix; Extending Marketing--global marketing, ethics, competitive advantage  Today’s marketers need to make use of all the latest technologies in order to find and capture their market. By creating customer value and building an interactive community, they can develop lasting and profitable relationships with consumers.",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "7.93",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Shades of Blue",
        "Authors": "By Kingsbury, Karen",
        "Description": "In between a checkered past and a fairytale future, a decision awaits. Brad Cutler, twenty-eight, is a rising star at his New York ad agency, about to marry the girl of his dreams. Anyone would agree he has it all—a great career, a beautiful and loving fiancée, and a fairy tale life ahead of him … when memories of a high school girlfriend begin to torment him. Lost innocence and one very difficult choice flood his conscience, and he is no longer sure what the future will bring except for this: He must go back to the shores of Holden Beach in search of his first love, and a forgiveness neither of them has ever known. Three people must work through the repercussions of a decision made long ago before any of them can look toward a new future.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Mayo Clinic Diet: Eat well, Enjoy Life, Lose Weight",
        "Authors": "By Mayo Foundation for Medical Education and Research (COR)",
        "Description": "From Mayo Clinic, a leading authority on health and nutrition, comes The Mayo Clinic Diet, designed to be the last diet you'll ever need. In two simple phases, you'll be on the road to a healthy weight for the rest of your life. Packed with lots of extra encouragement&#151;meal planners, recipes, tips for overcoming challenges, starting an exercise plan, and much more&#151;The Mayo Clinic Diet gives you everything you need in one book. Toss out the scales and calculators and pick up the foods you love. This is the diet you've been waiting for!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Good Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Hungry Girl 1-2-3: The Easiest, Most Delicious, Guilt-Free Recipes on the Planet",
        "Authors": "By Lillien, Lisa",
        "Description": "Are you HUNGRY? The number-one New York Times bestselling phenomenon is BACK---with even more yum-a-licious guilt-free recipes. This time, the EASIEST ones on the planet!Hungry Girl's recipes aren't just delicious, they're SUPER-SIMPLE, too. Hungry Girl 1-2-3 will help you make the world's most delicious guilt-free appetizers, meals, snacks, desserts, etc., with practically no effort whatsoever! There are loads of crock-pot recipes, microwavable meals, HG's famous \"foil packs,\" and more. Some are such a cinch, you won't even have to turn on the oven or stove! Really.With more than 200 recipes and two-ingredient \"couples\" to choose from, you'll never be hungry again! Get ready to chew on:Crazy Pineapple Salmon Teriyaki (347 calories)Mom-Style Creamy Chicken 'n Veggies (307 calories)Queen-of-the-Castle Sliders (254 calories)Caramel Swirl Cream Puffs (121 calories)Corndog Millionaire Muffins (160 calories)Chili Cheese Dog Nachos (218 calories)Turkey & Veggie Meatloaf Minis (142 calories)Planet Hungrywood Sweet & Cap'n Crunchy Chicken (234 calories)Shrimp & Grits . . . for Hungry Chicks! (380 calories)Cannoli-Stuffed French Toast Nuggets (228 calories)",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Infants, Children, and Adolescents (6th Edition)",
        "Authors": "By Berk, Laura E.",
        "Description": "NOTE: You are purchasing a standalone product; MyDevelopmentLab does not come packaged with this content. If you would like to purchaseboth the physical text and MyDevelopmentLab, search for ISBN-10: 0134130146 / ISBN-13: 9780134130149. That package includes ISBN-10: 0133936732 / ISBN-13: 9780133936735 and ISBN-10: 0205909744 / ISBN-13: 9780205909742.MyDevelopmentLab should only be purchased when required by an instructor.For courses in Child Development Visit the Preview Website to see sample chapters, get information on the supplements (including sample videos and on-line simulations), and much more.Click here.A best-selling, chronologically organized child development text, Berk and Meyers’Infants, Children, and Adolescents is relied on in classrooms worldwide for its clear, engaging writing style, exceptional multicultural and cross-cultural focus, rich examples, and long-standing commitment to presenting the most up-to-date scholarship while also offering students research-based, practical applications that they can relate to their personal and professional lives. The authors takes an integrated approach to presenting development in the physical, cognitive, emotional, and social domains; emphasize the complex interchanges between heredity and environment; and provide exceptional attention to culture.Renowned professor, researcher, and author Laura Berk is joined by new coauthorAdena Meyers. As faculty colleagues in the Department of Psychology at Illinois State University, they have collaborated on numerous projects, and their distinct areas of specialization and tremendous expertise make them a great team for coauthoring this new edition. Together, they present the latest theories and findings in the field to students in a manageable and relevant way. Berk and Meyers’ signature story-like, conversational style invites students to actively learn beside the text’s “characters,” who experience real issues in development, including physical, cognitive, and peer challenges, as well as parenting and educational concerns. Berk and Meyers also help students connect their learning to their personal and professional areas of interest, speaking directly about issues students will face in their future pursuits as parents, educators, heath care providers, social workers, and researchers. As members of a global and diverse human community, students are called on to intelligently approach the responsibility of understanding and responding to the needs and concerns of children. While carefully considering the complexities of child development, the authors present classic and emerging theories in an especially clear, engaging writing style, with a multitude of research-based, real-world, cross-cultural, and multicultural examples. Strengthening the connections among developmental domains and of theory and research with applications, this edition's extensive revision brings forth the most recent scholarship, representing the changing field of child development.This book is also available in an abridged paperbound version, Infants and Children: Prenatal Through Middle Childhood, comprising the complete Chapters 1—13.Infants, Children, and Adolescents, Eighth Edition is also available via REVEL™, an immersive learning experi",
        "Category": " Psychology , Developmental , General",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "8.17",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Medical-Surgical Nursing: Patient-Centered Collaborative Care, Single Volume",
        "Authors": "By Ignatavicius, Donna D. and Workman, M. Linda",
        "Description": "Written by two expert authors, this trend-setting textbook of medical-surgical nursing offers cutting-edge content that's easy to understand. The sixth edition includes a new emphasis on clinical decision-making for patient-centered collaborative care and more streamlined and balanced coverage of the core body of knowledge needed for safe clinical practice. There is also expanded coverage of emergency and disaster preparedness along with an enhanced \"Get Ready for the NCLEX Examination? feature that includes the addition of new NCLEX Challenge questions. UNIQUE! A collaborative approach that presents all medical, surgical, nursing, and other interventions through the lens of the nursing process. A reader-friendly, direct writing style makes this one of the most readable medical-surgical textbooks on the market. Chapter-opening Learning Outcomes are linked to Self-Assessment Questions for the NCLEX Examination on the companion CD and EVOLVE website. Unique chapter-ending Get Ready for the NCLEX Examination! sections include Key Points lists organized by NCLEX Client Needs Categories. Evidence-Based Practice boxes now include highlighted Levels of Evidence to teach you how to appraise the level of validity of research and provide synopses of recent nursing research articles and other scientific articles applicable to nursing. Considerations boxes highlight important nursing considerations to help you better understand how to care for older adults, women, and patients from various cultural and genetic backgrounds. Streamlined Concept Maps now emphasize information on what is critical for you to know for patient rescue by providing the links among pathophysiology, assessment, and intervention. UNIQUE! New Human Needs focus and features help you learn to think clinically and be prepared to make sound clinical decisions at the bedside.UNIQUE! Seven richly illustrated Human Needs Overviews relate concepts learned in Nursing Fundamentals to disorders that you will study in Medical-Surgical Nursing. UNIQUE! Chapter-ending Human Needs Assessment Reviews and Human Needs Nursing Care Reviews demonstrate application of these Fundamentals concepts to specific disorders. UNIQUE! New Decision-Making Challenges throughout the book teach you to apply concepts to true-to-life clinical situations. UNIQUE! NCLEX Examination Challenge questions throughout the chapters are now organized by NCLEX Client Needs Category and apply chapter content to the categories and subcategories of the NCLEX test plan. Increased emphasis on prioritization, delegation to equip you with these increasingly important skills, which continue to be a major focus of the NCLEX Examination. Expanded coverage of emergency and disaster preparedness prepares you to deal not only with common environmental emergencies but also with the consequences of bioterrorism and mass-casualty events. New Patient Safety icons highlight content reflecting The Joint Commission's National Patient Safety Goals initiative and the National Patient Safety Goals. Companion CD-ROM features more than 1,000 interactive questions, an audio glossary, 35 animations, more than 40 Health Assessment video clips, 20 audio clips of key heart and lung sounds, and 45 Health Assessment images of key health assessment findings.",
        "Category": " Medical , Nursing , Medical & Surgical",
        "Publisher": "Saunders",
        "Price Starting With ($)": "10.49",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Take Two (Above the Line Series #2)",
        "Authors": "By Kingsbury, Karen",
        "Description": "Filmmakers Chase Ryan and Keith Ellison have completed their first feature film, and Hollywood is buzzing with the news. In the wake of that excitement, the producers acquire rights to a novel that has all the ingredients they want for their next project. At the same time they cross paths with a well-connected player who introduces them to the right people, and suddenly every studio in town wants to talk to Chase and Keith. The producers’ dreams are on the verge of coming true, but Chase’s marriage is strained and Keith’s daughter — Andi Ellison — is making questionable choices in her quest for stardom. The producers are gaining respect and are on the verge of truly changing culture through the power of film — but is the change worth the cost?",
        "Category": " Fiction , Christian , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "What's Your Poo Telling You?: (Funny Bathroom Books, Health Books, Humor Books, Funny Gift Books)",
        "Authors": "By Sheth, Anish, Richman, Josh, and Arkle, Peter (ILT)",
        "Description": "Like a snowflake, each poo has a wondrous uniqueness. But what does it mean? What's Your Poo Telling You will help you figure it out.Find out just how much you can learn from studying what's in the bowl: With universal appeal (everyone poops, after all), this witty, illustrated description of over two dozen dookies (each with a medical explanation written by a doctor) details what one can learn about health and well-being through your poo. A floater? It's probably due to a buildup of gas. Now think back on last night's dinner, a burrito perhaps?•  All the greatest hits are here: The Log Jam, The Glass Shard, The Deja Poo, The Hanging Chard? the list goes on and on, so you'll learn about all of the variations and what they mean to your health•  Also includes sidebars, trivia, over 60 euphemisms for number 2, and unusual case histories that make this the ultimate bathroom reader•  With illustrations included, you'll get loads of facts about your health in a hilarious and entertaining book that finally gives poo the respect it deservesJosh Richman and Dr. Anish Sheth have written a tell-all tribute to poo that demystifies the inner working of the digestive tract and explains your health by what you see before you flush. •  Josh Richman has an MBA from Stanford University and lives in the San Francisco Bay Area•  Anish Sheth, M.D., is a gastroenterologist in Princeton, New Jersey, and is affiliated with the University Medical Center of Princeton at Plainsboro•  A must-have gift for any bowel-movement obsessed loved one",
        "Category": " Humor , Topic , Adult",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Pretty Little Liars (Pretty Little Liars, Book 1) (TV Tie-In)",
        "Authors": "By Shepard, Sara",
        "Description": "#1 New York Times bestselling seriesThis special paperback TV tie-in edition of the first book in Sara Shepard’s #1 New York Times bestselling series features cover artwork from the hit ABC Family TV show Pretty Little Liars, starring Troian Bellisario, Ashley Benson, Lucy Hale, and Shay Mitchell. Set in ultra-trendy Rosewood, Pennsylvania, Pretty Little Liars centers around four beautiful girls who are hiding some very ugly secrets, and the one person who knows them all…and is not afraid to spill. Fans of the Pretty Little Liars TV show will find the book packed with the same kind of juicy secrets, taut suspense, and jaw-dropping surprises that they know and love, all brought to life in New York Times bestselling author Sara Shepard’s compellingly gripping writing.",
        "Category": " Young Adult Fiction , Social Themes , Friendship",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "The Sneaky Chef to the Rescue: 101 All-New Recipes and \u0093Sneaky\u0094 Tricks for Creating Healthy Meals Kids Will Love",
        "Authors": "By Lapine, Missy Chase",
        "Description": "The New York Times bestselling author returns?this time responding directly to her readers' most pressing concerns. Legions of fans have written to her, asking for more recipes that focus on their specific family challenges. She's heard them loud and clear, and has crafted meals that are targeted to these special needs, including:? Sneaky Chef Light: Delicious recipes for kids struggling with their weight: with lower calories, lower fat?and all the taste!? Sneaky Chef for Food Allergies. For the millions of children who suffer from food allergies, here are recipes that are dairy-free, egg-free, and gluten-free.? Sneaky Chef for More Variety?More make-ahead purees and crafty, kid-friendly recipes the whole family will love.? Sneaky Chef Celebrates! Even special days can be healthy, as the Sneaky Chef unveils recipes for birthdays, Thanksgiving, Christmas, Chanukah, Valentine's Day, Passover, Easter, and more!Sneaky Chef to the Rescue shows that any family can ?sneak' good food into their diets, making everybody (both kids and adults) both happier and healthier.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Running Press Adult",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Quiet Hero: Secrets from My Father's Past",
        "Authors": "By Cosby, Rita",
        "Description": "When a father reveals his haunting past, a daughter takes an incredible journey of self-discovery . . . Emmy® award–winning journalist, TV host, and New York Times bestselling author Rita Cosby has always asked the tough questions in her interviews with the world’s top newsmakers. Now, in a compelling and powerful memoir, she reveals how she uncovered an amazing personal story of heroism and courage, the untold secrets of a man she has known all her life: her father. Years after her mother’s tragic death, Rita finally nerved herself to sort through her mother’s stored belongings, never dreaming what a dramatic story was waiting for her. Opening a battered tan suitcase, she discovered it belonged to her father—the enigmatic man who had divorced her mother and left when Rita was still a teenager. Rita knew little of her father’s past: just that he had left Poland after World War II, and that his many scars, visible and not, bore mute witness to some past tragedy. He had always refused to answer questions. Now, however, she held in her hand stark mementos from the youth of the man she knew only as Richard Cosby, proud American: a worn Polish Resistance armband; rusted tags bearing a prisoner number and the words Stalag IVB; and an identity card for an ex-POW bearing the name Ryszard Kossobudzki. Gazing at these profoundly telling relics, the well-known journalist realized that her father’s story was one she could not allow him to keep secret any longer. When she finally did persuade him to break his silence, she heard of a harrowing past that filled her with immense pride . . . and chilled her to the bone. At the age of thirteen, barely even adolescent, her father had seen his hometown decimated by bombs. By the time he was fifteen, he was covertly distributing anti-Nazi propaganda a few blocks from the Warsaw Ghetto. Before the Warsaw Uprising, he lied about his age to join the Resistance and actively fight the enemy to the last bullet. After being nearly fatally wounded, he was taken into captivity and sent to a German POW camp near Dresden, finally escaping in a daring plan and ultimately rescued by American forces. All this before he had left his teens. This is Richard Cosby’s story, but it is also Rita’s. It is the story of a daughter coming to understand a father whose past was too painful to share with those he loved the most, too terrible to share with a child . . . but one that he eventually revealed to the journalist. In turn, Rita convinced her father to join her in a dramatic return to his battered homeland for the first time in sixty-five years. As Rita drew these stories from her father and uncovered secrets and emotions long kept hidden, father and daughter forged a new and precious bond, deeper than either could have ever imagined.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Threshold Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Grandma Putt's Old-Time Vinegar, Garlic, Baking Soda, and 101 More Problem Solvers: 2,500 Super Solutions for Your Home, Health, and Garden",
        "Authors": "By Baker, Jerry",
        "Description": "",
        "Category": "",
        "Publisher": "American Master Products, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Eat-Clean Diet Recharged!: Lasting Fat Loss That's Better than Ever",
        "Authors": "By Reno, Tosca",
        "Description": "Revised and fully updated with more than 50 new and easy recipes  The world of weight loss changed forever when The Eat-Clean Diet burst on the scene. With help from author Tosca Reno, millions of people who had given up hope for permanent weight loss cleaned up their acts and rediscovered their true, leaner selves. The best part? They did it without starving, without counting calories, and without obsessing over the scale.   The Eat-Clean Diet Recharged! is the next generation of Eating Clean. Updated and revised, it’s got all the facts from The Eat-Clean Diet—plus much more. Look inside for in-depth information on   • how to get—and stay—motivated • living a longer, happier, more productive life • how to take the plunge into an exercise program • solutions for cellulite, saggy bits, and loose skin  • using food to raise your metabolism and burn fat Plus! • 50 new recipes • more menus, including vegan and gluten-free plans • how to Eat Clean anywhere, from parties to restaurants to on the road • more FAQs than ever before • the Eat-Clean Diet at a Glance quick reference section   “Getting strong and into peak health physically is essential to creating all excellence. This valuable book will help you.”—Robin Sharma, author of the #1 bestsellers The Greatness Guide and The Monk Who Sold His Ferrari  At age 40, Tosca Reno found herself miserable, overweight, trapped in an unhappy marriage and living an unfulfilled life. Her self-esteem at an all-time low, she barely recognized the woman she had become.   Realizing she was the architect of her own destiny, Tosca was reborn. She embraced health and accepted fitness challenges, transforming her life and her body in the process. Tosca reinvented herself—going from fat and frumpy to lean and purposeful.   Her past struggles served to inspire and motivate her in her career as a writer, motivational speaker, and fitness celebrity. Her work encourages others to embrace life, find their inner passions, and live the rest of their lives in the best shape possible.   Tosca writes monthly columns for Oxygen and Clean Eating magazines and has written many books, including the bestselling Eat-Clean Diet series.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "YOU: The Owner's Manual, Updated and Expanded Edition: An Insider's Guide to the Body that Will Make You Healthier and Younger",
        "Authors": "By Roizen, Michael F., M.D. and Oz, Mehmet, M.D.",
        "Description": "The #1 bestseller that gives YOU complete control over your body and your health.With new health studies and advice bombarding us every day, few people know much about what chugs, churns, and thumps throughout the miraculous system that is the human anatomy.YOU: The Owner's Manual challenges preconceived notions about how the human body works and ages, and takes you on a fascinating grand tour of all your blood-pumping, food-digesting, and numbers-remembering systems and organs—including the heart, brain, lungs, immune system, bones, and sensory organs.In this updated and expanded edition, America's favorite doctors, Michael Roizen and Mehmet Oz, discuss how YOU actually have control over your genes. Discover how diseases start and how they affect your body—as well as advice on how to prevent and beat conditions that threaten your quality of life.There are also 100 questions asked by you, and answered by the experts. For instance, do you know which of the following statements are true?As you increase the amount you exercise, the rewards you gain from it increase as well.If you're not a smoker, you have nothing to worry about when it comes to your lungs.Your immune system always knows the difference between your own cells and enemy invaders.The biggest threat to your arteries is cholesterol.Memory loss is a natural, inevitable part of aging.Stress is the greatest ager, and controlling it changes which of your genes is on.Did you answer \"true\" for any of the above? Then take a look inside. Complete with exercise tips, nutritional guidelines, simple lifestyle changes, and alternative approaches, YOU: The Owner's Manual debunks myths and gives you an easy, comprehensive, and life-changing How-To plan—as well as great-tasting and calorie-saving recipes—that can help you live a healthier, younger, and better life.Be the best expert on your body!",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Finger Lickin' Fifteen (Stephanie Plum Novels)",
        "Authors": "By Evanovich, Janet",
        "Description": "Recipe for disaster: Celebrity chef Stanley Chipotle comes to Trenton to participate in a barbecue cook-off and loses his head – literally.Throw in some spice: Bail bonds office worker Lula is witness to the crime, and the only one she'll talk to is Trenton cop, Joe Morelli.Pump up the heat: Chipotle's sponsor is offering a million-dollar reward to anyone who can provide information leading to the capture of the killers.Stir the pot: Lula recruits bounty hunter Stephanie Plum to help her find the killers and collect the moolah.Add a secret ingredient: Stephanie's Grandma Mazur. Enough said.Bring to a boil: Can Stephanie hunt down two killers, a traitor, five skips, keep her grandmother out of the sauce, solve Ranger's problems and not jump his bones?Warning: Janet Evanovich's Finger Lickin' Fifteen is habanero hot. So good you'll want seconds.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Some Girls: My Life in a Harem",
        "Authors": "By Lauren, Jillian",
        "Description": "A jaw-dropping story of how a girl from the suburbs ends up in a prince's harem, and emerges from the secret Xanadu both richer and wiser At eighteen, Jillian Lauren was an NYU theater school dropout with a tip about an upcoming audition. The \"casting director\" told her that a rich businessman in Singapore would pay pretty American girls $20,000 if they stayed for two weeks to spice up his parties. Soon, Jillian was on a plane to Borneo, where she would spend the next eighteen months in the harem of Prince Jefri Bolkiah, youngest brother of the Sultan of Brunei, leaving behind her gritty East Village apartment for a palace with rugs laced with gold and trading her band of artist friends for a coterie of backstabbing beauties.More than just a sexy read set in an exotic land, Some Girls is also the story of how a rebellious teen found herself-and the courage to meet her birth mother and eventually adopt a baby boy.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Conservative Victory: Defeating Obama's Radical Agenda",
        "Authors": "By Hannity, Sean",
        "Description": "Barack Obama and his radical team of self-professed socialists, fringe activists, and others are trying to remake the American way of life. They have used their new Democratic majority to launch an alarming assault on our capitalist system—while abandoning the war on terror, undermining our national security, and weakening our position in the eyes of our enemies. The \"candidate of change\" is threatening to change our country irreparably, and for the worse—if we don't act to stop him now.Sean Hannity has been sounding the alarms about Obama and his agenda from the start. Now—in his first new book in six years—he issues a stirring call to action. Hannity surveys all the major Obama players—from the president's affiliation with radical theology to his advisers' history of Marxist activism, repression of the media, support for leftist dictators, and worse. He exposes their resulting campaign to dismantle the American free-market system and forfeit our national sovereignty. But he draws on the examples of Ronald Reagan and the GOP's Contract with America to show how conservatives can unite behind this country's most cherished principles and act now to get America back on the right track—while we still can.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Leadership Roles and Management Functions in Nursing: Theory and Application (Marquis, Leadership Roles and Management Functions in Nursing)",
        "Authors": "By Huston, Carol J. and Marquis, Bessie L.",
        "Description": "\"Our second book, Retention and Productivity Strategies for Nurse Managers, focused on leadership skills necessary for managers to decrease attrition and increase productivity. This book was directed at the nurse-manager rather than the student. The experience of completing research for the second book, coupled with our clinical observations, compelled us to incorporate more leadership content in our teaching and to write this book. Leadership Roles and Management Functions in Nursing was also influencedby national events in business and finance that led many to believe that a lack of leadership in management was widespread. It became apparent that if managers are to function effectively in the rapidly changing health care industry, enhanced leadership and management skills are needed\"--Provided by publisher.",
        "Category": " Medical , Nursing , Management & Leadership",
        "Publisher": "Lippincott Williams & Wilkins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Calculate with Confidence (Morris, Calculate with Confidence)",
        "Authors": "By Morris, Deborah C. Gray",
        "Description": "Calculate with Confidence provides a clear consistent format with a step-by-step approach to the calculation and administration of drug dosages. It covers the ratio and proportion, formula, and dimensional analysis methods. This popular text focuses on enhancing the learning experience of students at all curricular levels by making content clinically applicable. Concepts relating to critical thinking, logical thinking, and nursing process are presented throughout. New practice problems have been added throughout this edition and rationales for the answers continue to be provided giving the students a better understanding of principles related to drug dosages. This fifth edition addresses the increasing responsibility of nurses in medication and administration; emphasizes the priority for client care, and presents material that reflects the current scope of the nursing practice. A clear and consistent, step-by-step approach to calculations and administration makes it easy to understand.Ratio and Proportion, Formula, and Dimensional Analysis content provides you with well-rounded coverage. Pretest and post-test help identify strengths and weaknesses in competency of basic math before and assess your comprehension after Unit One: Math Review. Points to Remember boxes highlighted in each chapter help you remember important concepts.Critical thinking information that should be applied in the clinical setting to help avoid drug calculation and administration errors is boxed throughout the text. Full-color illustrations, photographs, and drug labels familiarize you with what you'll encounter in the clinical setting. Current recommendations from The Joint Commission and Institute for Safe Medication Practices are followed throughout.Caution boxes identify issues that may lead to medication errors and strengthen actions that must be taken to avoid calculation errors.Tips for Clinical Practice calls attention to information critical to math calculation and patient safety as well as issues related to practice.Rule boxes familiarize students with information needed to accurately solve drug calculation problems.",
        "Category": " Medical , Nursing , Pharmacology",
        "Publisher": "Mosby",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Foreign Influence: A Thriller (Scot Harvath)",
        "Authors": "By Thor, Brad",
        "Description": "#1 New York Times Bestselling Author Navy SEAL turned covert operative Scot Harvath is called to action once again in Brad Thor’s hottest political thriller yet.   Buried within the black ops budgets of the Department of Defense, a new spy agency has been created.  Unfettered by the oversight of self-serving politicians, it reports only to a secret panel of military insiders.  Its job is to target America’s enemies - both foreign and domestic - under a charter of three simple words: Find, Fix, and Finish. Recruited as a field operative, Scot Harvath has just returned from his first assignment abroad when a bombing in Rome kills a group of American college students. The evidence points to a dangerous colleague from Harvath’s past and a plan for further attacks on an unimaginable scale.   Harvath is tasked with leveraging his relationship to lure the man out of hiding and kill him on the spot.  But what if it is the wrong man? Simultaneously, a young woman is struck by a taxi in a hit-and-run in Chicago.  With only two intoxicated witnesses and over five thousand cabs in the city, the Chicago Police have given up on their investigation.  But when the family’s attorney digs deeper, he will uncover a shocking connection to the bombing in Rome and the perpetrators’ plans for America. As the story rockets to its conclusion, the plots intersect in a race to prevent one of the most audacious and unthinkable acts of war in the history of mankind.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Beginning iPhone 3 Development: Exploring the iPhone SDK",
        "Authors": "By Mark, Dave and Lamarche, Jeff",
        "Description": "Are you a programmer looking for a new challenge? Does the thought of building your very own iPhone app make your heart race and your pulse quicken? If so, Beginning iPhone 3 Development: Exploring the iPhone SDK is just the book for you. Updated and revised for iPhone SDK 3, many of the discussions in the original book have been clarified to make some of the more complex topics easier to understand. In addition, all of the projects have been rebuilt from scratch using the SDK 3 templates.For the latest version of this book for Swift, see Beginning iPhone Development with Swift, ISBN 978-1-4842-0410-8. For the latest version of this book for Objective-C, see Beginning iPhone Development: Exploring the iOS SDK, ISBN 978-1-4842-0200-5.Assuming only a minimal working knowledge of Objective-C, and written in a friendly, easy-to-follow style, this book offers a complete soup-to-nuts course in iPhone and iPod touch programming. The book starts with the basics, walking you through the process of downloading and installing Apple's free iPhone SDK, and then stepping you though the creation of your first simple iPhone application. From there, you'll learn to integrate all the interface elements iPhone users have come to know and love, such as buttons, switches, pickers, toolbars, and sliders. You'll master a variety of design patterns, from the simplest single view to complex hierarchical drill-downs. The confusing art of table building will be demystified, and you'll see how to save your data using the iPhone file system. You'll also learn how to save and retrieve your data using SQLite, iPhone's built-in database management system. In addition, you'll also learn about Core Data, an important persistence mechanism that has just been added with SDK 3.And there's much more! You'll learn to draw using Quartz 2D and OpenGL ES, add multitouch gestural support (pinches and swipes) to your applications, and work with the camera, photo library, accelerometer, and built-in GPS. You'll discover the fine points of application preferences and learn how to localize your apps for multiple languages. You can discover more about this book, download source code, and find support forums at the book's companion site, at www.iphonedevbook.com.The iPhone 3 update to the best-selling and most recommended book for iPhone developers Packed full of tricks, techniques, and enthusiasm for the new SDK from a developer perspective The most complete, useful, and up-to-date guide to all things having to do with Apple's iPhone SDK",
        "Category": " Computers , Hardware , Mobile Devices",
        "Publisher": "Springer",
        "Price Starting With ($)": "6.49",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "The Introvert Advantage: How Quiet People Can Thrive in an Extrovert World",
        "Authors": "By Laney, Marti Olsen",
        "Description": "An insightful, empowering guide to making the most of your hidden strengths.   Are you energized by spending time alone? In meetings, do you need to be asked for your opinions and ideas? Do you tend to notice details that other people miss? Is your ideal celebration a small get-together rather than a big party? Do you often feel like a tortoise surrounded by hares? The good news is, you’re an introvert. The better news is that by celebrating the inner strengths and uniqueness of being introverted, The Introvert Advantage shows introverts how to work with instead of against their temperament to enjoy a well-lived life. Covering relationships, parenting—including parenting an introverted child—socializing, and the workplace, here are coping strategies, tactics for managing energy, and hundreds of valuable tips for not only surviving but truly thriving in an extrovert world.   “Filled with Aha! moments of recognition, Dr. Laney’s book will help millions of introverts understand why they are misunderstood, learn to appreciate who they are, and develop a just-right life in a world where extroverts once ruled.” —Paul D. Tieger, coauthor of Do What You Are “In a world of shock jocks, screaming rock stars, and sensational journalism, this book dispels the myth that only the loud and flamboyant get ahead. Its clear, step-by-step advice will help introverts recognize and capitalize on their unique strengths.” —Dr. Bernardo J. Carducci, author of Shyness: A Bold New Approach",
        "Category": " Self-help , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "This Is Why You're Fat (And How to Get Thin Forever): Eat More, Cheat More, Lose More--and Keep the Weight Off",
        "Authors": "By Warner, Jackie",
        "Description": "In this New York Times bestseller, Jackie Warner, America's favorite no-nonsense celebrity fitness trainer, shows you how to get hot, healthy, and thin forever.  \"Being fat isn't your fault; staying fat is.\" That's what Jackie Warner tells her own clients, and that's why no one delivers better results than Jackie. This groundbreaking program is filled empowering strategies help you drop pounds and inches fast, without grueling workouts or deprivation. Her two-tiered approach provides a complete nutritional makeover and a failure-proof condensed workout routine, PLUS all the emotional support and encouragement you need to get to the finish line and beyond. With Jackie's core principles, you'll be shocked to find what is actually making you fat, and how easy it is to get thin for a lifetime. Discover her surprising secrets:  CHEATING IS ALLOWED: Eat clean for 5 days, then indulge in whatever you want over the weekend! SKIP THE CRUNCHES: They just build muscle under the fat. Discover the fastest way to shrink your waist and spark your metabolism for rapid fat loss. THINK YOURSELF THIN: It's true! Jackie's own breakthrough mind-body techniques called Metaphysiques will help you create the body you want-by thinking it into reality. THIS IS WHY YOU'RE FAT (AND HOW TO GET THIN FOREVER) is your first and last stop on the way to a new fit and healthy you!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Grand Central Life & Style",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Nursing Diagnosis Handbook: An Evidence-Based Guide to Planning Care, Eighth Edition",
        "Authors": "By Ackley, Betty J. and Ladwig, Gail B.",
        "Description": "This innovative resource teaches you the critical thinking and assessment skills you need to build customized care plans based on each patient's unique needs. Its step-by-step approach guides you through the process, helping you formulate a nursing diagnosis based on known information and assessment findings; identify the appropriate nursing diagnosis; and create a care plan that includes desired outcomes, interventions, and evidence-based rationales. Nursing Diagnosis Handbook is an essential care planning resource you will turn to again and again throughout your nursing education and career.Provides care plans for every NANDA-I approved nursing diagnosis.Includes examples of and suggested NIC and NOC interventions and outcomes for each care plan.A convenient A-to-Z organization in Sections I and II helps you quickly locate key information.Evidence-based practice information is incorporated throughout.Includes complete coverage of pediatric, geriatric, and multicultural considerations, as well as home care and client/family teaching guidelines for each condition.A Care Plan Constructor on the Evolve website helps you create customized plans of care.Features the most up-to-date 2007-2008 NANDA-I approved nursing diagnoses, including approximately 15 new, 20 revised, and 5 replacement diagnoses.Provides a more detailed explanation of NIC and NOC taxonomies and their use in care planning.Explanations of assessment versus action interventions help guide you to the correct choice of intervention.Covers important information on concept mapping.Patient/Family Teaching sections offer expanded wellness and health promotion information.Clustered wellness nursing diagnoses are quick and easy to locate.Includes the latest evidence-based nursing rationales.",
        "Category": " Medical , Nursing , Assessment & Diagnosis",
        "Publisher": "Mosby Elsevier",
        "Price Starting With ($)": "7.87",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Return To Sender",
        "Authors": "By Michaels, Fern",
        "Description": "Lin Townsend becomes pregnant at 17 and her baby's father shirks his responsibility, with all her letters to him sent back marked \"Return to Sender,\" but she perseveres and raises the boy herself, until, 19 years later, she crosses paths with the father, now a millionaire, and soon plots her revenge. By the best-selling author of Mr. and Miss Anonymous. 150,000 first printing.",
        "Category": " Fiction , Women",
        "Publisher": "Kensington",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Merriam Webster 79 Merriam-webster's intermediate dictionary, hardcover, revised edition",
        "Authors": "By Merriam-Webster",
        "Description": "For middle and junior high school students, the latest edition of this reference text has been updated to reflect the Merriam-Webster's Collegiate Dictionary, Eleventh Edition. With 700,000- plus entries, the range of vocabulary covered is suited to the needs of older students, while the definitions are written in everyday language that will be clear to younger students. The text includes 1,000-plus pictorial illustrations, special sections on common abbreviations; names of figures from history, mythology, and the Bible; place names; and signs and symbols. Traditional etymological information is not included for all entries; some entries are followed by a \"word history\" paragraph and dictionary etymology to begin introducing students to the concept. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Young Adult Nonfiction , Reference",
        "Publisher": "Merriam Webster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Adobe Photoshop CS4 Classroom in a Book",
        "Authors": "By Adobe Systems (COR)",
        "Description": "The fastest, easiest, most comprehensive way to learn Adobe Photoshop CS4  Fourteen lessons in Adobe Photoshop CS4 Classroom in a Book cover basic and advanced techniques in Adobe Photoshop, the world’s best image-editing software. Learn how to retouch digital photos, work with layers and masks, navigate the workspace, prepare images print, and explore the latest features. Tips, extra-credit exercises, and step-by-step lessons help you become more productive using Photoshop.  Learn to correct and enhance digital photos, create image composites, transform images in perspective, and prepare images for print and the web. Combine images for extended depth of field, and try out the new 3D features in Adobe Photoshop CS4 Extended.  “The Classroom in a Book series is by far the best training material on the market. Everything you need to master the software is included: clear explanations of each lesson, step-by-step instructions, and the project files for the students.” —Barbara Binder, Adobe Certified Instructor, Rocky Mountain Training Classroom in a Book®, the best-selling series of hands-on software training workbooks, helps you learn the features of Adobe software quickly and easily. Classroom in a Book offers what no other book or training program does—an official training series from Adobe Systems Incorporated, developed with the support of Adobe product experts.",
        "Category": " Computers , Image Processing",
        "Publisher": "Adobe Pr",
        "Price Starting With ($)": "6.27",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Furious Love: Elizabeth Taylor, Richard Burton, and the Marriage of the Century",
        "Authors": "By Kashner, Sam and Schoenberger, Nancy",
        "Description": "From veteran entertainment reporter Sam Kashner and biographer Nancy Schoenberger comes the definitive account of the greatest Hollywood love story ever told—the romance of Elizabeth Taylor and Richard Burton. Kashner has interviewed Elizabeth Taylor numerous times and is the only journalist given access to her extensive collection of personal letters and journals, and he and Schoenberger have also interviewed the Burton family at length, including Burton’s actress daughter Kate. This is truly an authorized and singularly informed biography of these two larger-than-life stars, and of their glamorous, volatile, and audacious relationship.",
        "Category": " Biography & Autobiography , Rich & Famous",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.73",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "The New Rules of Marketing and PR: How to Use Social Media, Blogs, News Releases, Online Video, and Viral Marketing to Reach Buyers Directly",
        "Authors": "By Scott, David Meerman",
        "Description": "A completely revised and updated edition of the BusinessWeek bestseller on effective, modern marketing and PR best practicesThe New Rules of Marketing and PR shows you how to leverage the potential that Web-based communication offers your business. Finally, you can speak directly to customers and buyers, establishing a personal link with the people who make your business work.This new second edition paperback keeps you up-to-date on the latest trends.New case studies and current examples are included to illustrate the very latest in marketing and PR trends Completely updated to reflect the latest marketing and PR techniques using social media sites such as Twitter, Facebook, and YouTube Includes a step-by-step action plan for harnessing the power of the Internet to communicate directly with buyers, increase sales, and raise online visibility David Meerman Scott is a renowned online marketing strategist, keynote speaker and the author of World Wide Rave, from Wiley The New Rules of Marketing and PR, Second Edition gives you all the information you need to craft powerful and effective marketing messages and get them to the right people at the right moment-at a fraction of the price of a traditional marketing campaign.",
        "Category": " Computers , Electronic Commerce",
        "Publisher": "John Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Sidney Sheldon's After the Darkness",
        "Authors": "By Bagshawe, Tilly",
        "Description": "Author Tillie Bagshawe brilliantly recaptured the late superstar author’s magic with Sidney Sheldon’s Mistress of the Game—and now she does it again with Sidney Sheldon’s After the Darkness. A classic tale of love and betrayal, and a struggle for survival in the new world order, this is an enthralling novel with ripped-from-the-headlines immediacy, perfect for the post-Bernie Madoff era in America. A tribute to one of America’s most popular and bestselling authors, Sidney Sheldon’s After the Darkness is a novel that the master himself would have been proud to call his own.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Customer Satisfaction Is Worthless, Customer Loyalty Is Priceless: How to Make Customers Love You, Keep Them Coming Back and Tell Everyone They Know",
        "Authors": "By Gitomer, Jeffrey",
        "Description": "Proving that loyal customers are better than satisfied ones--since the latter will shop anywhere--a sales staff trainer shows readers how to produce customer loyalty through a fresh approach to customer service and how to turn customers into salespeople. Tour. IP.",
        "Category": " Business & Economics , Customer Relations",
        "Publisher": "Bard Press",
        "Price Starting With ($)": "5.08",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Management Information Systems: Managing the Digital Firm",
        "Authors": "By Laudon, Kenneth C. and Laudon, Jane P.",
        "Description": "Laudon and Laudon continue to define the MIS course with their latest comprehensive text.     Information Systems in Global Business Today; Information Technology Infrastructure; Key System Applications for the Digital Age; Building and Managing Systems  MARKET: Management Information Systems, provides comprehensive and integrative coverage of essential new technologies, information system applications, and their impact on business models and managerial decision making in an exciting and interactive manner.",
        "Category": " Business & Economics , Information Management",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "6.8",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Every Other Monday: Twenty Years of Life, Lunch, Faith, and Friendship",
        "Authors": "By Paisner, Daniel and Kasich, John",
        "Description": "Where do you go when the water rises?  For more than twenty years, John Kasich has sought the answer to this question and many of life’s most fundamental challenges in an unlikely place: his twice-a-month lunches with an irreverent, thoughtful, and spirited circle of guys who are members of a Bible study group. Every other Monday over lunch at an Italian restaurant in Columbus, Ohio, Kasich and half a dozen friends use the stories of the Good Book as a launching pad to ask questions running the gamut from “Does God exist?” to “What do you do if faith fails you?” This group, in reaching for life’s biggest mysteries while standing firmly rooted in the everyday, has become a cornerstone of Kasich’s life, one to which he consistently turns when the waters threaten to rise.  Every Other Monday is an honest look at how to build faith and find solace, even during the most heartbreaking circumstances, and offers a template for reconsidering how we make everyday choices as well as life-changing decisions. Along with rousing personal anecdotes and poignant memories, Kasich shares some of the group’s frank discussions on the major themes found in the Bible—and in our daily lives—such as:  • CHARITY—How do you determine whether you’re giving enough (i.e., “the fatted calf” vs. “the skinny calf”) and why does it matter? • JUSTICE—How do you deal with frustration when justice doesn’t always happen here on earth? • ENVY—How do you absorb the inevitable disappointment when someone else gets the good fortune that you know was meant for you? • FORGIVENESS—What do you do when you encounter hurtful behavior? • AMBITION—How do you balance the demands of work and the material world while still growing spiritually? Every Other Monday is a refreshing and forthright account of one group’s search for answers and meaning. From rebuilding trust to understanding why we sometimes fail in matters of morality even when we know better, it lays out a practical path for finding strength and resilience through faith and friendship.",
        "Category": " Religion , Christian Living , Personal Growth",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Infinity (Chronicles of Nick, 1)",
        "Authors": "By Kenyon, Sherrilyn",
        "Description": "At fourteen, Nick Gautier thinks he knows everything about the world around him. Streetwise, tough and savvy, his quick sarcasm is the stuff of legends. . .until the night when his best friends try to kill him. Saved by a mysterious warrior who has more fighting skills than Chuck Norris, Nick is sucked into the realm of the Dark-Hunters: immortal vampire slayers who risk everything to save humanity.Nick quickly learns that the human world is only a veil for a much larger and more dangerous one: a world where the captain of the football team is a werewolf and the girl he has a crush on goes out at night to stake the undead.But before he can even learn the rules of this new world, his fellow students are turning into flesh eating zombies. And he's next on the menu.As if starting high school isn't hard enough. . .now Nick has to hide his new friends from his mom, his chainsaw from the principal, and keep the zombies and the demon Simi from eating his brains, all without getting grounded or suspended. How in the world is he supposed to do that?",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Property Examples & Explanations",
        "Authors": "By Burke, Barlow and Snoe, Joseph",
        "Description": "",
        "Category": " Law , Property",
        "Publisher": "Aspen Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Lonely Polygamist: A Novel",
        "Authors": "By Udall, Brady",
        "Description": "Golden Richards, a polygamist with four wives and 28 children has a midlife-crisis affair that threatens to destroy his family's future, in this tale of a dysfunctional American family from the author of Letting Loose the Hounds.",
        "Category": " Fiction , Family Life",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Cook Yourself Thin: Skinny Meals You Can Make in Minutes",
        "Authors": "By Lifetime Television",
        "Description": "Lose weight without losing your mind!Cook Yourself Thin, a #1 New York Times bestseller, is a healthy, delicious way to drop a dress size without all the gimmicks. Eighty easy, accessible recipes teach readers how to cut calories without compromising taste.For some of us, losing weight has always been a struggle. The challenge: figuring out how to cook healthy, low-fat foods that won't leave you hungry, bored, or running for a gallon of ice cream! Cook Yourself Thin shows how to cut calories, change diets, and improve health without sacrificing the foods we love.Cook Yourself Thin is not a fad diet. It gives skinny alternatives to your cravings. You can't live without your chocolate cake or mac 'n' cheese? You don't have to! There's never enough time to cook Cook Yourself Thin keeps it simple with easy instructions and fun recipes you'll want to make again and again.What are you waiting for? Cook Yourself Thin!",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "Voice",
        "Price Starting With ($)": "5.24",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Portrait of an Addict as a Young Man: A Memoir",
        "Authors": "By Clegg, Bill",
        "Description": "Bill Clegg had a thriving business as a literary agent, a supportive partner, trusting colleagues, and loving friends when he walked away from his world and embarked on a two-month crack binge. He had been released from rehab nine months earlier, and his relapse would cost him his home, his money, his career, and very nearly his life.What is it that leads an exceptional young mind want to disappear?  Clegg makes stunningly clear the attraction of the drug that had him in its thrall, capturing in scene after scene the drama, tension, and paranoiac nightmare of a secret life--and the exhilarating bliss that came again and again until it was eclipsed almost entirely by doom. He also explores the shape of addiction, how its pattern--not its cause--can be traced to the past.Portrait of an Addict as a Young Man is an utterly compelling narrative--lyrical, irresistible, harsh, honest, and beautifully written--from which you simply cannot look away.",
        "Category": " Psychology , Psychopathology , Addiction",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Life-Span Human Development (Available Titles CengageNOW)",
        "Authors": "By Sigelman, Carol K. and Rider, Elizabeth A.",
        "Description": "Known for its clear, straightforward writing style, comprehensive coverage, strong and current research-based approach, and excellent visuals and tables, this life-span development text offers a topical organization at the chapter level and a consistent chronological presentation within each chapter. Each chapter focuses on a domain of development such as physical growth, cognition, or personality and traces developmental trends and influences in that domain from infancy to old age. Within each chapter, you will find sections on four life stages: Infancy, Childhood, Adolescence, and Adulthood. This unique organization enables students to comprehend the processes of transformation that occur in key areas of human development. This new edition includes a clear focus on the complex interactions of nature and nurture in development, more integrated coverage of culture and diversity, and an exciting new media package for both students and instructors.",
        "Category": " Psychology , Developmental , Lifespan Development",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "7.88",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "How to Never Look Fat Again: Over 1,000 Ways to Dress Thinner--Without Dieting!",
        "Authors": "By Krupp, Charla",
        "Description": "The new groundbreaking style-guide from bestseller author Charla Krupp on how to look 10 pounds lighter, 10 years younger and 10 times sexier every day, all year--in summer, winter, at the gym, even in a swimsuit!You'll never get dressed the same way again once you discover:*smart, easy ways to hide arm flap, a big bust, a muffin top, back fat, Buddha belly, a big booty, wide hips, thunder thighs, and heavy calves-and that's only half the book.*which fabrics, colors, and styles make women look fat*absolutely the best shades, shapes, and brilliant buys to make the pounds invisible*clever solutions for special fashion situations--workout gear, evening wear, and even swimsuits!*which products, fashions, and services you shouldn't waste your money on*the top ten tips that will make you look thinner by tonight! So, if you've ever put on a piece of clothing and asked \"Does this make me look fat?\" Finally, here is the book that will answer your question.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Grand Central Life & Style",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Vocabulary Workshop: Level H",
        "Authors": "By Shostak, Jerome",
        "Description": "",
        "Category": " Young Adult Nonfiction , Language Arts , General",
        "Publisher": "William H Sadlier",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Spark: The 28-Day Breakthrough Plan for Losing Weight, Getting Fit, and Transforming Your Life",
        "Authors": "By Downie, Chris",
        "Description": "From the experts who created SparkPeople.com, America’s #1 diet and fitness site, comes The Spark. This groundbreaking book outlines the best of what has worked for millions of members who have lost weight, kept it off, and reached other goals. Driven by positive energy and proven results, The Spark outlines a breakthrough formula that combines nutrition, exercise, goal setting, motivation, and community, which has helped people change their lives beyond the scale. •          Discover the 27 Secrets of Success—the best action steps, foods, and proven medical advice that have helped tens of thousands of members lose from 2 to 200 pounds. •          Special tips from people who lost 100 pounds or more—see what these people had in common and what they did and didn’t do to make huge transformations in their lives. •          A step-by-step 28-day program that brings together the most effective, medically accepted nutrition and fitness practices from SparkPeople experts in an easy-to-follow plan, including flexible mix-and-match meal plans, fully illustrated workout programs, full-color before-and-after success stories, and more! •          New to this edition! Breakthrough survey results have been used to create a Strong Start Guide to help you jumpstart your weight-loss efforts. Based on what tens of thousands of successful SparkPeople members did to lose weight and change their lives, this guide tells you what to do in the first two weeks to make you five times more likely to reach your ultimate weight-loss goal! Whether you want to fit into your \"skinny jeans,\" improve your health and fitness levels, change your outlook and mood, or reach all new goals, The Spark can help you transform your body and your life. What are you waiting for? Spark your life today!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Hay House Inc",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Wrong Mother: A Zailer and Waterhouse Mystery (A Zailer & Waterhouse Mystery)",
        "Authors": "By Hannah, Sophie",
        "Description": "A chilling, compulsively readable novel of psychological suspense from the author of Little Face and The CarrierSally Thorning is watching the news with her husband when she hears a name she never thought she'd hear again: Mark Bretherick.It's a name she shouldn't recognize. Last year, a work trip Sally had planned was canceled at the last minute. Desperate for a break from juggling her job and a young family, Sally didn't tell her husband that the trip had fallen through. Instead, she treated herself to a secret vacation in a remote hotel. While she was there, Sally met a man—Mark Bretherick. All the details are the same: where he lives, his job, his wife Geraldine and daughter Lucy. Except that the photograph on the news is of a man Sally has never seen before. And Geraldine and Lucy Bretherick are both dead...With the international bestseller Little Face, Sophie Hannah established herself as a striking new voice in psychological suspense. The Wrong Mother, a riveting exploration of a mother's unspeakable betrayal, confirms her reputation as a master of the form.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Brain Rules: 12 Principles for Surviving and Thriving at Work, Home, and School",
        "Authors": "By Medina, John",
        "Description": "Most of us have no idea what’s really going on inside our heads. Yet brain scientists have uncovered details every business leader, parent, and teacher should know&#151;like the need for physical activity to get your brain working its best.How do we learn? What exactly do sleep and stress do to our brains? Why is multi-tasking a myth? Why is it so easy to forget&#151;and so important to repeat new knowledge? Is it true that men and women have different brains?In Brain Rules, Dr. John Medina, a molecular biologist, shares his lifelong interest in how the brain sciences might influence the way we teach our children and the way we work. In each chapter, he describes a brain rule&#151;what scientists know for sure about how our brains work&#151;and then offers transformative ideas for our daily lives.Medina’s fascinating stories and infectious sense of humor breathe life into brain science. You’ll learn why Michael Jordan was no good at baseball. You’ll peer over a surgeon’s shoulder as he proves that most of us have a Jennifer Aniston neuron. You’ll meet a boy who has an amazing memory for music but can’t tie his own shoes.You will discover how:Every brain is wired differentlyExercise improves cognitionWe are designed to never stop learning and exploringMemories are volatileSleep is powerfully linked with the ability to learnVision trumps all of the other sensesStress changes the way we learnIn the end, you’ll understand how your brain really works&#151;and how to get the most out of it.",
        "Category": " Medical , Neuroscience",
        "Publisher": "Pear Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Keys for Writers, 5th Edition",
        "Authors": "By Raimes, Ann",
        "Description": "Keys for Writers is the most accessible, user-friendly handbook in the tabbed, comb-bound market. With a simple tabbing system (five red tabs for the writing process and research, and five gold tabs for sentence-level lessons), thorough and concise coverage of grammar, and an easy-to-read format, Keys for Writers is a valuable resource to students in all disciplines throughout their college careers.The Fifth Edition features enhanced discussion of plagiarism (and how to avoid it), expanded argument coverage, a full literature paper, two-page \"Source Shots\" that visually demonstrate to students where to find citation information in different kinds of publications, and even more discussion of evaluating online sources and writing in and for online environments.An emphasis on critical reading and critical thinking appears throughout discussions of the writing process, argument, and research. Superior coverage of style includes the popular \"5 C's of Style\"?Cut, Check for Action, Connect, Commit, and Choose the Best Words?which helps students submit their best work.Critical reading and critical thinking features help students through the writing process, argument, and research.Thoroughly updated research chapters include a major new section devoted to avoiding plagiarism and new Source Shots that demonstrate visually where to find citation information in different kinds of sources, such as online databases.Superior ESL coverage takes a \"difference, not deficit\" approach. The text integrates Language and Culture boxes, new Editing Guides to Multilingual Transfer Errors and Vernacular Englishes, and ESL Notes.New! A full student argument paper, and sample APA and Chicago Manual of Style papers serve as attainable models for student work.Key Points boxes; clear, two-part organization; laminated tabs; and color-coding make information accessible and easy to review.To support users of Keys for Writers, the content-rich WriteSpace online writing program offers a wealth of interactive teaching and learning aids, including a new assessment resource and peer/instructor review tools. Additional features promote visual literacy, collaboration, and plagiarism prevention.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Faith of America's First Ladies",
        "Authors": "By Cook, Jane Hampton",
        "Description": "Highlights include: * Abigail Adam's commitment to serving as the primary caretaker for her family during the Revolution shows the worth of working with eager hands. * Martha Washington's willingness to knit shirts and socks for soldiers during the Revolution shows the value of leading by example. * Harriet Lane's fashion flair uncovers the true source of beauty in a world of extreme makeovers. * Helen Taft's investment inklings blossom into a bouquet of benefits. * Laura Bush's heart of compassion shows the significance of extending hands to the poor and needy in times of crisis.  * Anna Harrison's words of wisdom and prayers for her children and grandchildren delivers a family legacy of faith and leadership.  * Louisa Adam's remarkable solo journey to Paris under siege by napoleon shows the value of steadfastness during a time of terror threats.            * Dolley Madison's wandering journey of faith reaches its final destination, showing the peace that comes through a commitment and reverence to God.  * Barbara Bush's wit and quips reveal the splendor of celebrating in life.                     * Nell Arthur's life shows that every woman is a first lady to God and her family.",
        "Category": " Religion , Faith",
        "Publisher": "Living Ink Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The Catholic Faith Handbook for Youth",
        "Authors": "By Singer-Towns, Brian, Claussen, Janet, and Vanbrandwijk, Clare",
        "Description": "Introduces teens to Catholic beliefs, art, culture, and history as expressed in the Catechism of the Catholic Church, discussing Church teachings on social issues of today and providing ideas for putting faith into action.",
        "Category": " Young Adult Nonfiction , Religion , Christianity",
        "Publisher": "St Marys Pr",
        "Price Starting With ($)": "4.97",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Quantum Wellness Cleanse: The 21-Day Essential Guide to Healing Your Mind, Body and Spirit",
        "Authors": "By Freston, Kathy",
        "Description": "Kathy Freston's appearance on The Oprah Winfrey Show prompted Oprah to commit to the \"21-day cleanse\" featured in Quantum Wellness, creating an instant bestseller and a national trend. During her 21-day cleanse, Oprah's daily blog provided updates on her progress, intriguing millions of readers and creating a media frenzy.Now, with The Quantum Wellness Cleanse, Kathy Freston gives readers the tools they need to fully harness the 21-day cleanse and stay motivated. This easy-to-follow guide lays out a comprehensive plan to turn our lives around in each of the areas of body, mind, and spirit. By following an essential day-by-day map of what to eat, how to deal with the complex feelings that arise as we detox, and how to fully redirect our energy so our lives take on a fresh momentum, this indispensable companion offers recipes that can be mixed and matched, and answers all the questions that may arise so that we can forever change the course of our lives.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Weinstein Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "The Honor of Spies (Honor Bound)",
        "Authors": "By Griffin, W. E. B. and Butterworth, William E., IV",
        "Description": "Griffin?s Honor Bound novels have been hailed as ?terrific? (Newark Star-Ledger) and ?immensely entertaining? (Kirkus Reviews), with ?enough derring-do, romance and action to satisfy Griffin?s legions of fans and bring him new ones? (Rocky Mountain News). The new book is his best yet. August 6, 1943: In his brief career in the Office of Strategic Services, twenty-four-year-old Cletus Frade has already been involved in a lot of unusual situations, but nothing like the one he?s in now, standing with a German lieutenant colonel named Wilhelm Frogger in a Mississippi prisoner-of-war detention facility. Frade?s job? To help Frogger escape. Frogger?s parents are in Frade?s custody in Argentina, because of their involvement in a secret German plan to establish safe havens for senior Nazi officials in South America, and the younger Frogger has agreed to help find out what they know. Even more important, however, is the secret within the secret. Before he was captured in Africa, Frogger was part of a conspiracy; its goal: to assassinate Adolf Hitler. If the OSS can use his knowledge and connections to nudge that plot along, even just a little bit? they may be able to end this war right now. But Frade is not the only one who knows about the Froggers. Even as he stands there in Mississippi, a troop of Germans and Argentinians, led by a Colonel Juan Perón, is on its way to kill the parents and, after them, Frade himself. His career in the OSS may have been brief?but it may just be about to be over. Filled with the special flair that Griffin?s fans have come to expect, The Honor of Spies is another rousing adventure from one of our finest storytellers.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Big Book of Parenting Solutions: 101 Answers to Your Everyday Challenges and Wildest Worries",
        "Authors": "By Borba, Michele",
        "Description": "Today show's Michele Borba's cures for difficult childhood behaviors In this down-to-earth guide, parenting expert Michele Borba offers advice for dealing with children's difficult behavior and hot button issues including biting, temper tantrums, cheating, bad friends, inappropriate clothing, sex, drugs, peer pressure, and much more. Written for parents of kids age 3-13, this book offers easy-to-implement advice for the most important challenges parents face with kids from toddlers to tweens.  Includes immediate solutions to the most common childhood problems and challenges Written by Today Show's resident parenting expert Michele Borba Offers clear step-by-step guidance for solving difficult childhood behaviors and family conflicts Contains a wealth of advice that is easy-to-follow and gets quick results Author has written outstanding parenting books including Building Moral Intelligence, No More Misbehavin', Don't Give Me that Attitude, and more  Each of the 101 issues includes clear questions, specific step-by-step solutions, and advice that is age appropriate.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Listen to the Wind: The Story of Dr. Greg & Three Cups of Tea (Rise and Shine)",
        "Authors": "By Mortenson, Greg and Roth, Susan L.",
        "Description": "Greg Mortenson stumbled, lost and delirious, into a remote Himalayan village after a failed climb up K2. The villagers saved his life, and he vowed to return and build them a school. The remarkable story of his promise kept is now perfect for reading aloud. Told in the voice of Korphe’s children, this story illuminates the humanity and culture of a relevant and distant part of the world in gorgeous collage, while sharing a riveting example of how one person can change thousands of lives.",
        "Category": " Juvenile Nonfiction , People & Places , Middle East",
        "Publisher": "Dial Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Wanted (Pretty Little Liars, Book 8)",
        "Authors": "By Shepard, Sara",
        "Description": "#1 New York Times bestselling seriesThe eighth book in the #1 New York Times bestselling series that inspired the hit ABC Family TV show Pretty Little Liars.Hanna, Aria, Spencer, and Emily have been through a lot together—childhood pranks gone horribly wrong, not one, but two stalkers—blackmailers who know all their dirty secrets, not to mention their best friend’s murder investigation. Now these pretty little liars are finally going to uncover all the answers they’ve been searching for, and they can finally put this awful chapter of their lives behind them. Or so they think. Full of unexpected twists and shocking revelations, Wanted is the eighth book in New York Times bestselling author Sara Shepard’s compelling Pretty Little Liars series.",
        "Category": " Young Adult Fiction , Social Themes , Friendship",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "On Folly Beach",
        "Authors": "By White, Karen",
        "Description": "From the New York Times bestselling author of the Tradd Street novels comes a story of old wounds and second chances, set in the small South Carolina town of Folly Beach.   To most people, Folly Beach is simply the last barrier island before reaching the great Atlantic. To some, it’s a sanctuary for lost souls...   When Emmy Hamilton’s mother encourages her to buy the local book store, Folly’s Finds, she hopes it will distract her daughter from the loss of her husband. But the seller has one condition that changes everything: Emmy must allow Lulu, the late owner’s difficult elderly sister, to continue selling her bottle trees from its back yard.    For the most part Emmy ignores Lulu as she sifts through the love letters she finds in a box of used books. But the more she discovers about the letters, the more she understands Lulu. As details of a possible murder and a mysterious disappearance during WWII are revealed, the two women discover that circumstances beyond their control have brought them together, here on Folly Beach. And it is here that their war-ravaged hearts can find hope again…",
        "Category": " Fiction , Women",
        "Publisher": "New American Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "DSM-IV Made Easy: The Clinician's Guide to Diagnosis",
        "Authors": "By Morrison, James R.",
        "Description": "Accessibly written and easy to use, this comprehensive book covers everything professionals and students need to know about DSM-IV. Following the same format as DSM-IV, the text presents every diagnosis. For each it includes case examples, a detailed analysis of each case, and a clear explanation of how to arrive at the diagnosis and how to rule out other possibilities. Essential for all mental health practitioners studying for their licensing exams, this hands-on resource will be valued by psychiatrists, residents, psychologists, marriage and family counselors, social workers, and anyone who needs to know about DSM-IV.",
        "Category": " Psychology , Clinical Psychology",
        "Publisher": "Guilford Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Beach Money; Creating Your Dream Life Through Network Marketing",
        "Authors": "By Jordan Adler",
        "Description": "",
        "Category": "",
        "Publisher": "Accelerator Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Official Guide for GMAT Quantitative Review, 2nd Edition",
        "Authors": "By John Wiley & Sons (COR)",
        "Description": "The only official quantitative review for the GMAT from the creators of the testAnyone preparing for the Graduate Management Admission Test (GMAT) knows it's important to study with the experts. With The Official Guide for the GMAT Quantitative Review, Second Edition, you'll get questions, answers, and explanations straight from the source. The only official quantitative review for the GMAT Exam, this book targets your study and helps you improve your quantitative skills by focusing on your ability to solve equations, interpret data, coordinate geometry, and determine probability with assurance and ease. Inside, you'll find300 actual questions from past GMAT tests, including 75 questions new to this editionSections on Arithmetic, Algebra, Geometry, Problem Solving, and Data SufficiencyQuestions organized in order of difficulty to save study timeThe Graduate Management Admission Council certifies all content so you can trust that you're getting expert guidance as you prepare for the GMAT Exam.The Graduate Management Admission Council (GMAC) is the association of leading graduate business schools around the world. GMAC's mission is to meet the needs of business schools and students through a wide array of products, services, and programs. It is the owner and administrator of the Graduate Management Admissions Test (GMAT), the first and only standardized test specifically designed for graduate business and management programs. Available in nearly 100 countries, it is the global standard for entry to the MBA degree course.",
        "Category": " Study Aids , GMAT (Graduate Management Admission Test)",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Cold Calling Techniques: That Really Work",
        "Authors": "By Schiffman, Stephan",
        "Description": "Follow the advice of Stephan Schiffman&#151;America's #1 Corproate Sales Trainer&#151;and take your career to the next level. This special anniversary edition of his perennial bestseller, Cold Calling Techniques (That Really Work!), provides you with all of the right tools for turning prospects into meetings, and meetings into big sales.This easy-to-follow guide helps you beat today's cold calling obstacles, such as voice mail, cell phones, and e-mail. Schiffman's professional experience and corporate wisdom guarantee your future success. The anniversary edition of Cold Calling Techniques packs in plenty of potential leads to help you hunt down more business.Give yourself the edge. Cold Calling Techniques is the one book you need to make your sales opportunities better, pitches stronger, and commissions greater.",
        "Category": " Business & Economics , Marketing , Telemarketing",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Midnight Alley",
        "Authors": "By Caine, Rachel",
        "Description": "Claire Danvers's college town may be run by vampires but a truce between the living and the dead made things relatively safe. For a while. Now people are turning up dead, a psycho is stalking her, and an ancient bloodsucker has proposed private mentoring. To what end, Claire will find out. And it's giving night school a whole new meaning.Watch a Windows Media trailer for this book.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "NAL",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "The Eat-Clean Diet Cookbook: Great-Tasting Recipes that Keep You Lean! (Eat Clean Diet Cookbooks)",
        "Authors": "By Reno, Tosca and Hark, Lisa, Dr., Ph.D. (FRW)",
        "Description": "With the success of the Eat-Clean Diet came the demand for more recipes, and author Tosca Reno is not only a health and fitness expert, she's also an excellent cook. She's always loved cooking for friends and family, and her Clean-Eating lifestyle inspired her to create fabulous meals that everyone would love. Who better to write a cookbook that would make the whole family happy . . . both at the table and when they shop for clothes a few sizes smaller!Get:  •150 beautiful food photographs • Delectable low-fat beef, pork, chicken and fish dinners • Protein-rich meat-free recipes • Gluten-free meals • Tips on eating clean in difficult situations • Timesaving one-dish meals for busy moms • Great recipes on the go • How to prepare an elegant clean-eating event.",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Icarus Syndrome: A History of American Hubris",
        "Authors": "By Beinart, Peter",
        "Description": "“Why do we succumb to hubris? Peter Beinart has written a highly intelligent and wonderfully readable book that answers the question by looking at a century of American foreign policy. As with everything Beinart writes, it is lucid, thoughtful and strikingly honest.” — Fareed Zakaria, author of The Post-American World “Peter Beinart has written a vivid, empathetic, and convincing history of the men and ideas that have shaped the ambitions of American foreign policy during the last century—a story in which human fallibility and idealism flow together. The story continues, of course, and so his book is not only timely; it is indispensible.” — Steve Coll, author of Ghost Wars Peter Beinart, one of the nation’s leading political writers, offers a provocative and strikingly original account of American hubris throughout history—and how we learn from the tragedies that result.",
        "Category": " History , Military , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Hunted: A House of Night Novel (House of Night Novels, 5)",
        "Authors": "By Cast, P. C. and Cast, Kristin",
        "Description": "What if the hottest guy in the world was hiding a nameless evil, and all he wanted was you?At the start of this heart-pounding new installment of the bestselling House of Night series, Zoey and her gang must discover a way to deal with an unexpected danger that might bring them all down.  Neferet guards her powerful new consort, Kalona, who looks gorgeous and has the House of Night under his spell. A past life holds the key to breaking his rapidly spreading power, but what if it shows Zoey truths she can't face?  Meanwhile, the red fledglings have cleaned up well, but are they really as friendly as they seem?  On the boyfriend front, Zoey has a chance to fix things with super-hot ex-, Erik, but she can't stop thinking about Stark, the archer who died in her arms, and she is driven to save him from Neferet's sinister influence.  Will anyone believe the power evil has to hide among us?",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Learning Web Design: A Beginner's Guide to (X)HTML, StyleSheets, and Web Graphics",
        "Authors": "By Robbins, Jennifer Niederst",
        "Description": "Everything you need to know to create professional web sites is right here. Learning Web Design starts from the beginning -- defining how the Web and web pages work -- and builds from there. By the end of the book, you'll have the skills to create multi-column CSS layouts with optimized graphic files, and you'll know how to get your pages up on the Web.This thoroughly revised edition teaches you how to build web sites according to modern design practices and professional standards. Learning Web Design explains:How to create a simple (X)HTML page, how to add links and imagesEverything you need to know about web standards -- (X)HTML, DTDs, and moreCascading Style Sheets -- formatting text, colors and backgrounds, using the box model, page layout, and moreAll about web graphics, and how to make them lean and mean through optimizationThe site development process, from start to finishGetting your pages on the Web -- hosting, domain names, and FTPThe book includes exercises to help you to learn various techniques, and short quizzes to make sure you're up to speed with key concepts. If you're interested in web design, Learning Web Design is the place to start.",
        "Category": " Computers , Desktop Applications , Desktop Publishing",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Angelology: A Novel (Angelology Series)",
        "Authors": "By Trussoni, Danielle",
        "Description": "A thrilling epic about an ancient clash reignited in our time- between a hidden society and heaven's darkest creatures  There were giants in the earth in those days; and also after that, when the sons of God came in unto the daughters of men, and they bore children to them. Genesis 6:5 Sister Evangeline was just a girl when her father entrusted her to the Franciscan Sisters of Perpetual Adoration in upstate New York. Now, at twenty-three, her discovery of a 1943 letter from the famous philanthropist Abigail Rockefeller to the late mother superior of Saint Rose Convent plunges Evangeline into a secret history that stretches back a thousand years: an ancient conflict between the Society of Angelologists and the monstrously beautiful descendants of angels and humans, the Nephilim. For the secrets these letters guard are desperately coveted by the once-powerful Nephilim, who aim to perpetuate war, subvert the good in humanity, and dominate mankind. Generations of angelologists have devoted their lives to stopping them, and their shared mission, which Evangeline has long been destined to join, reaches from her bucolic abbey on the Hudson to the apex of insular wealth in New York, to the Montparnasse cemetery in Paris and the mountains of Bulgaria. Rich in history, full of mesmerizing characters, and wondrously conceived, Angelology blends biblical lore, the myth of Orpheus and the Miltonic visions of Paradise Lost into a riveting tale of ordinary people engaged in a battle that will determine the fate of the world.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Viking",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Black & Decker The Complete Photo Guide to Home Repair: with 350 Projects and 2000 Photos (Black & Decker Complete Photo Guide)",
        "Authors": "By Creative Publishing (COR)",
        "Description": "Bigger and better than ever       The two previous editions of the book known by home improvement retailers as “Big Red” sold nearly 600,000 copies. This new edition features a larger portrait format for better visual clarity, and incorporates a new page layout style. But all the features that made the original America’s best-selling “bible” of home repair are still present here—thousands of color photographs and detailed step-by-step directions. The third edition also includes more than 30 projects not found in the original edition, as well as more than 300 new photos.",
        "Category": " House & Home , Reference",
        "Publisher": "Cool Springs Press",
        "Price Starting With ($)": "8.6",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Tarzan And The Leopard Men (Ballantine 21912, #18)",
        "Authors": "By Edgar Rice Burroughs",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Results Now: How We Can Achieve Unprecedented Improvements in Teaching and Learning",
        "Authors": "By Schmoker, Michael J.",
        "Description": "Consultant Schmoker maintains that despite the best efforts of teachers and administrators, buffers still exist in US schools that keep outsiders from looking in and insiders from looking around. He believes the only realistic ways to improve teaching and learning are to eliminate the factors that isolate schools from the community and educators from each other and their students, particularly in the field of literacy education. He advocates turning to authentic literacy and intellectual development, starting with assessing the real results of students and working into a teamwork system that integrates critical and argumentative literacy into every aspect of schooling. As part of the teamwork he supports professional learning community and developing leadership at all stages, including the central office and state levels. An appendix includes a sample agreement for departments. Annotation ©2006 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Administration , Facility Management",
        "Publisher": "Association for Supervision & Curriculum Development",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "SOC",
        "Authors": "By Witt, Jon",
        "Description": "For your classes in Introductory Sociology McGraw-Hill introduces the latest in its acclaimed M Series. The M Series started with your students. McGraw-Hill conducted extensive market research with over 4,000 students to gain insight into their studying and buying behavior.  Students told us they wanted more portable texts with innovative visual appeal and content that is designed according to the way they learn. We also surveyed instructors, and they told us they wanted a way to engage their students without compromising on high quality content.  ..SOC offers instructors scholarly content and unmatched currency in a succinct magazine format that engages students.  SOC consistently encourages students to foster their sociological imagination and encourages them to get involved and make a difference in the world around them..   ..More current, more portable, more captivating, plus a rigorous and innovative research foundation adds up to: more learning. When you meet students where they are, you can take them where you want them to be. ..",
        "Category": " Social Science , Sociology , General",
        "Publisher": "McGraw-Hill Humanities/Social Sciences/Languages",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Breaking Dawn Special Edition (The Twilight Saga)",
        "Authors": "By Meyer, Stephenie",
        "Description": "This Special Edition of the #1 New York Times bestseller includes:  An exclusive Breaking Dawn Concert Series DVD featuring a performance by Blue October's Justin Furstenfeld and a conversation with Stephenie Meyer and Justin Furstenfeld.  A reproduction of the personal, handwritten lyrics for My Never from Justin Furstenfeld.  A limited-edition, full-color Bella & Edward poster (on reverse side of book jacket).  And more! The astonishing, breathlessly anticipated conclusion to The Twilight Saga, Breaking Dawn illuminates the secrets and mysteries of this spellbinding romantic epic that has entranced millions.",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "The Media of Mass Communication",
        "Authors": "By Vivian, John",
        "Description": "Rich with contemporary issues and trends, Vivian’s The Media of Mass Communication 9e balances the principles and foundations of media literacy with lively examples, streamlined coverage, and a robust media package.  Widely praised for its dynamic writing style, this ninth edition engages the reader with up-to-date and relatable examples, a vibrant new design and photo program, and an abundance of multimedia resources.",
        "Category": " Language Arts & Disciplines , Communication Studies",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Primal Blueprint: Reprogram your genes for effortless weight loss, vibrant health, and boundless energy (Primal Blueprint Series)",
        "Authors": "By Sisson, Mark",
        "Description": "Being healthy and fit has gone mainstream--millions sweat the calories away on the roads or in health clubs and scrutinize labels and menus trying to do the right thing to control weight, delay aging, and feel healthy, fit, and energetic. And it's simply not working. Rates of obesity, diabetes, arthritis, heart disease, and cancer continue to climb, and even the most committed fitness enthusiasts often carry 10 or 20 extra pounds of body fat.In this updated and expanded edition of the 2009 hardcover release from Mark Sisson, MarksDailyApple.com publisher and de-facto leader of the burgeoning primal/paleo/evolutionary health movement presents the compelling premise that you can reprogram your genes in the direction of weight loss, health, and longevity by following 10 immutable Primal laws validated by two million years of human evolution.This 2012 paperback release contains extensive, never-before-published bonus material, including an incredible full-color, 16-page insert of seven Primal Blueprint reader success stories and their stunning before/after photos, pictorials, detailed descriptions and workout log pages for the Primal Essential Movements and Primal sprint workouts, hacks for each of the 10 Primal Blueprint lifestyle laws (to promote quick results in body composition, fitness, athletic performance, daily energy levels, and reduce disease risk factors and reliance on medication, solutions to common questions and stumbling blocks)-- pulled from Primal Blueprint reader submissions, and commentary on diets and dieting, including compare/contrast of Primal Blueprint with other popular programs.",
        "Category": " Health & Fitness , Exercise , General",
        "Publisher": "Primal Nutrition, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "The Biggest Loser: 6 Weeks to a Healthier You: Lose Weight and Get Healthy For Life!",
        "Authors": "By Wheeler, Lisa, Forberg, Cheryl, and Roberson, Melissa",
        "Description": "BASED ON THE HIT SHOW AND NEW YORK TIMES BEST-SELLING BOOKS Each season on The Biggest Loser, America watches the contestants transform their bodies at the Ranch. But what you can't see on television is the even more incredible physical transformation that takes place on the inside, as Biggest Losers radically change their health and quality of life through diet, exercise, and lifestyle changes.The Biggest Loser: 6 Weeks to a Healthier You - by Cheryl Forberg, RD, Melissa Robertson, Lisa Wheeler - brings the Ranch into your home and gives you the same tools, medical advice, nutrition tips, and exercise instruction that the contestants receive there. In just 6 weeks, you can change your future and make strides toward preventing and reversing conditions such as diabetes, heart disease, and high blood pressure. You'll also learn how to:• Boost your mood and brainpower with simple yoga poses and omega-3 rich foods like the Veggie Cheese Omelet and Mexican Turkey Burger.• Protect yourself from colds and flus by enhancing immunity with the power of vitamins A and C, found in the Southern Start breakfast and Fire-Roasted Tomato Soup.• Cut your cancer risk with strength training and the power antioxidants, like those in the Bye-Bye Blues Smoothie and Berrylicious Oatmeal.• Help prevent heart disease by getting plenty of aerobic exercise and trimming saturated fat from your diet with lean protein dishes like the Sweet Pepper Chicken Sandwich and Egg White Bites.With delicious recipes, easy-to-follow meal plans, and 6 weeks of exercises to get you moving, The Biggest Loser: 6 Weeks to a Healthier You helps you lose pounds—and gain a lifetime of good health.",
        "Category": " Health & Fitness , Diet & Nutrition , Weight Loss",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "The DASH Diet Action Plan: Based on the National Institutes of Health Research: Dietary Approaches to Stop Hypertension",
        "Authors": "By Marla Heller",
        "Description": "",
        "Category": "",
        "Publisher": "Amidon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Adobe Illustrator CS4",
        "Authors": "By Adobe Creative Team",
        "Description": "The fastest, easiest, most comprehensive way to learn Adobe Illustrator CS4Adobe Illustrator CS4 Classroom in a Book contains 15 lessons. The book covers the basics of learning Illustrator and provides countless tips and techniques to help you become more productive with the program. You can follow the book from start to finish or choose only those lessons that interest you. Learn how to create artwork for illustrations, logos, stationery, page layouts, posters, and integrate with Adobe Flash® movies, Adobe InDesign® layouts, and more!“The Classroom in a Book series is by far the best training material on the market. Everything you need to master the software is included: clear explanations of each lesson, step-by-step instructions, and the project files for the students.” —Barbara Binder, Adobe Certified Instructor, Rocky Mountain TrainingClassroom in a Book®, the best-selling series of hands-on software training workbooks, helps you learn the features of Adobe software quickly and easily. Classroom in a Book offers what no other book or training program does—an official training series from Adobe Systems Incorporated, developed with the support of Adobe product experts.",
        "Category": " Computers , Computer Graphics",
        "Publisher": "Adobe Press",
        "Price Starting With ($)": "6.34",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "The Eat-Clean Diet for Family and Kids: Simple Strategies for Lasting Health and Fitness",
        "Authors": "By Reno, Tosca and Brown, Bobbi (FRW)",
        "Description": "We have been hearing for years now about the obesity epidemic and other health issues facing children. In fact, the longevity trend is reversing with this generation - children born today are not expected to live as long as their parents. In The Eat-Clean Diet for Family and Kids, author Tosca Reno handles this issue with typical aplomb.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Clean: The Revolutionary Program to Restore the Body's Natural Ability to Heal Itself",
        "Authors": "By Junger, Alejandro and Greeven, Amely (CON)",
        "Description": "“The Clean program works….The wisdom and information contained in this book is deeply helpful and life changing.” —Gwyneth PaltrowAs featured on Goop.com!From Alejandro Junger, Eastern medicine specialist, cardiologist, and head of the Integrative Medicine program at Lenox Hill Hospital (as well as a doctor at New York City’s renowned Eleven Eleven Wellness Center), comes the New York Times bestseller, Clean—a medically-proven program that teaches how to remove toxins, rejuvenate our bodies, and restore our natural health.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Beat Sugar Addiction Now!: The Cutting-Edge Program That Cures Your Type of Sugar Addiction and Puts You on the Road to Feeling Great - and Losing Weight!",
        "Authors": "By Teitelbaum, Jacob and Fiedler, Chrystle (CON)",
        "Description": "Normal0MicrosoftInternetExplorer4The No-Fail Plan to Beating Sugar Addiction!With one-third of our calories coming from sugar and white flour added to processed foods, sugar addiction is a rapidly growing epidemic. However, unlike other addictions, going “cold turkey” won’t fix it. In this groundbreaking book, nationally recognized physician Dr. Jacob Teitelbaum uncovers four types of sugar addiction and gives a step-by-step plan for resolving their underlying causes, breaking sugar cravings forever, and achieving dramatically improved health and energy levels—while also making it easier to lose weight!",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Fair Winds Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "I Am Nujood, Age 10 and Divorced",
        "Authors": "By Ali, Nujood and Minoui, Delphine",
        "Description": "“I’m a simple village girl who has always obeyed the orders of my father and brothers. Since forever, I have learned to say yes to everything. Today I have decided to say no.” Nujood Ali's childhood came to an abrupt end in 2008 when her father arranged for her to be married to a man three times her age. With harrowing directness, Nujood tells of abuse at her husband's hands and of her daring escape. With the help of local advocates and the press, Nujood obtained her freedom—an extraordinary achievement in Yemen, where almost half of all girls are married under the legal age. Nujood's courageous defiance of both Yemeni customs and her own family has inspired other young girls in the Middle East to challenge their marriages. Hers is an unforgettable story of tragedy, triumph, and courage.",
        "Category": " Social Science , Sociology , Marriage & Family",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Wrecked (Regan Reilly Mysteries)",
        "Authors": "By Clark, Carol Higgins",
        "Description": "Private Investigator Regan Reilly and her husband, Jack \"no relation\" Reilly, head of the NYPD Major Case Squad, are about to celebrate their first wedding anniversary. They are looking forward to a quiet romantic weekend out of town. Wouldn’t you know their choice of destination provides them with anything but! Regan and Jack had considered going to Bermuda, but instead they decide to spend four days at his parents’ beautiful beachfront home on Cape Cod, a wonderful spot where they’d never been alone. During the summer the house overflowed with Jack’s family, bubbling with activity from morning until night. But to be up there for a weekend in April, just the two of them, sounded like a perfect escape. Arriving at the Cape late at night, Regan and Jack are just in time to experience the beginning of a major storm. The next morning, Cape Cod Bay is quite a sight, churning with whitecaps. The wind is howling ferociously. Sheets of rain are pelting the house. Regan is looking forward to settling in the den with Jack and watching the storm. However, the best laid plans . . . In the bedroom, Regan opens the curtains to find Skip, the Reillys’ young caretaker, pressing his nose against the glass, supposedly checking for leaks. A moment later, Jack arrives home from the market, two gossipy older women who live up the street in tow. A branch crashed through their living room window, and they need a place to stay. When Regan thought things couldn’t get any worse, Skip comes running into the house, distraught that he’d just discovered Adele Hopkins, the woman renting the house next door, in a heap at the bottom of her staircase to the beach. Regan and Jack run back down with him, but huge waves are crashing on the shore. Hopkins is gone, presumably swept out to sea. Who was Adele Hopkins? No one knows. The sixty-ish loner, who moved in five months ago, shunned her neighbors. Even her landlords, friends of the Reillys, have no idea how to locate her next of kin. Discovered in her dining room are stacks of apology cards she’d not yet sent and bags of decorative pillows that are embroidered with the saying grudge me, grudge me not. Regan and Jack begin an investigation to help their friends track down Hopkins’s family. They start by interviewing two young women who own the shop where Adele had bought the pillows. Pippy and Ellen opened Pillow Talk after they both lost their jobs. When a newspaper article revealing the terrible way the women had been treated by their former employers was posted on the Internet, business took off, they started to become well-known, and the Pillow Talk website became a place for people who had had similar experiences to vent their feelings. Pippy and Ellen just received an anonymous e-mail from someone who spews venom about her former rowing coach—Adele Hopkins. Could she be the same Adele Hopkins? Regan and Jack’s search for clues to this mysterious woman’s identity makes for an anniversary weekend they’ll never forget!",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Chains (The Seeds of America Trilogy)",
        "Authors": "By Anderson, Laurie Halse",
        "Description": "If an entire nation could seek its freedom, why not a girl?    As the Revolutionary War begins, thirteen-year-old Isabel wages her own fight...for freedom. Promised freedom upon the death of their owner, she and her sister, Ruth, in a cruel twist of fate become the property of a malicious New York City couple, the Locktons, who have no sympathy for the American Revolution and even less for Ruth and Isabel. When Isabel meets Curzon, a slave with ties to the Patriots, he encourages her to spy on her owners, who know details of British plans for invasion. She is reluctant at first, but when the unthinkable happens to Ruth, Isabel realizes her loyalty is available to the bidder who can provide her with freedom.   From acclaimed author Laurie Halse Anderson comes this compelling, impeccably researched novel that shows the lengths we can go to cast off our chains, both physical and spiritual.",
        "Category": " Juvenile Fiction , Historical , United States , Colonial & Revolutionary Periods",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Supreme Justice: A Novel of Suspense",
        "Authors": "By Margolin, Phillip",
        "Description": "“A master of plot and pacing—and one of those rare authors who can create a genuinely surprising ending.” — Lisa Scottoline  “It takes a really crafty storyteller to put people on the edge of their seats and keep them there. Phillip Margolin does just that.” — Chicago Tribune The crew from the New York Times bestseller Executive Privilege is back in another pulse-racing thriller from Phillip Margolin. Fans of John Grisham, David Baldacci, James Patterson, and Scott Turow—as well as Margolin’s own immensely popular Amanda and Frank Jaffe books like Fugitive, Wild Justice, and Proof Positive—won’t be able to put down Supreme Justice until the last spellbinding page.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "48 Days to the Work You Love",
        "Authors": "By Miller, Dan",
        "Description": "48 Days to the Work You Love is not about finding a new job. It is about finding out what you are going to “be.” According to Dan Miller, failing to make that fundamental discovery is why so many people find themselves in jobs they hate. But the great news is this book will lead you to the vocation you will love.Dan Miller will help you see clear patterns form from which you can make successful career and job decisions by understanding your God-given skills and abilities, personality traits, values, dreams, and passions. These patterns create a compass for you. Finding the work you love is finding the fulfillment of your calling.",
        "Category": " Religion , Christian Living , Professional Growth",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Neatest Little Guide to Stock Market Investing, 2010 Edition",
        "Authors": "By Kelly, Jason",
        "Description": "Read Jason Kelly's posts on the Penguin Blog    The essential stock market guide updated with timely strategies for investing after the crash   Now in its fourth edition, Jason Kelly's The Neatest Little Guide to Stock Market Investing has established itself   as a clear, concise, and highly effective guide for investing in stocks. This comprehensively updated edition contains   tried-and-true investment principles to teach investors how to create and refine a profitable investment program. New   strategies and content include: •Basic tips on when to invest and how to reduce the amount of risk in this   turbulent market •A new core portfolio technique that shows readers a way to achieve 3 percent quarterly   performance with the IJR exchange-traded fund •An exclusive interview with legendary Legg Mason investment   counselor, Bill Miller, including his thoughts on the financial crash of 2008 Accessible and intelligent,   The Neatest Little Guide to Stock Market Investing is what every investor needs to keep pace in the current   market.",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "You May Ask Yourself: An Introduction to Thinking Like a Sociologist",
        "Authors": "By Conley, Dalton",
        "Description": "Dalton Conley’s groundbreaking “non-textbook” teaches students how to think like sociologists. Students learn how to use their sociological imaginations to debunk conventional wisdom. With a strong emphasis on concepts, You May Ask Yourself challenges students to use sociological methods to evaluate facts about their social worlds by “making the familiar strange.”",
        "Category": " Social Science , Sociology , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Emotions Revealed, Second Edition: Recognizing Faces and Feelings to Improve Communication and Emotional Life",
        "Authors": "By Ekman, Paul",
        "Description": "\"A tour de force. If you read this book, you'll never look at other people in quite the same way again.\"—Malcolm GladwellRenowned psychologist Paul Ekman explains the roots of our emotions—anger, fear, disgust, sadness, and happiness—and shows how they cascade across our faces, providing clear signals to those who can identify the clues. As featured in Malcolm Gladwell's bestseller Blink, Ekman's Facial Action Coding System offers intense training in recognizing feelings in spouses, children, colleagues, even strangers on the street. In Emotions Revealed, Ekman distills decades of research into a practical, mind-opening, and life-changing guide to reading the emotions of those around us. He answers such questions as: How does our body signal to others whether we are slightly sad or anguished, peeved or enraged? Can we learn to distinguish between a polite smile and the genuine thing? Can we ever truly control our emotions? Packed with unique exercises and photographs, and a new chapter on emotions and lying that encompasses security and terrorism as well as gut decisions, Emotions Revealed is an indispensable resource for navigating our emotional world.",
        "Category": " Psychology , Emotions",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "The Bride Collector",
        "Authors": "By Dekker, Ted",
        "Description": "FBI Special agent Brad Raines is facing his toughest case yet. A Denver serial killer has killed four beautiful young women, leaving a bridal veil at each crime scene, and he's picking up his pace. Unable to crack the case, Raines appeals for help from a most unusual source: residents of the Center for Wellness and Intelligence, a private psychiatric institution for mentally ill individuals whose are extraordinarily gifted.  It's there that he meets Paradise, a young woman who witnessed her father murder her family and barely escaped his hand. Diagnosed with schizophrenia, Paradise may also have an extrasensory gift: the ability to experience the final moments of a person's life when she touches the dead body.  In a desperate attempt to find the killer, Raines enlists Paradise's help. In an effort to win her trust, he  befriends this strange young woman and begins to see in her qualities that most 'sane people' sorely lack.  Gradually, he starts to question whether sanity resides outside the hospital walls...or inside.As the Bride Collector picks up the pace-and volume-of his gruesome crucifixions, the case becomes even more personal to Raines when his friend and colleague, a beautiful young forensic psychologist, becomes the Bride Collector's next target. The FBI believes that the killer plans to murder seven women. Can Paradise help before it's too late?",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Center Street",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Wintergirls",
        "Authors": "By Anderson, Laurie Halse",
        "Description": "The New York Times bestselling story of a friendship frozen between life and death   Lia and Cassie are best friends, wintergirls frozen in fragile bodies, competitors in a deadly contest to see who can be the thinnest. But then Cassie suffers the ultimate loss—her life—and Lia is left behind, haunted by her friend's memory and racked with guilt for not being able to help save her. In her most powerfully moving novel since Speak, award-winning author Laurie Halse Anderson explores Lia's struggle, her painful path to recovery, and her desperate attempts to hold on to the most important thing of all: hope.",
        "Category": " Young Adult Fiction , Social Themes , Friendship",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Kaplan NCLEX-RN: Medications You Need to Know for the Exam",
        "Authors": "By Kaplan (COR)",
        "Description": "This targeted guide provides nursing students with 280 frequently tested NCLEX-RN exam terms, including medications plus their common names, drug family, and side effects, as well as an appendix of medical abbreviations. Kaplan NCLEX-RN: Medications You Need to Know for the Exam is the perfect companion guide for students on-the-go who are already preparing for the NCLEX-RN exam. The new format features two terms on one side of each page, with the explanations on the other. The book is grouped by medicine category.",
        "Category": " Medical , Nursing , General",
        "Publisher": "Kaplan Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Divine Misdemeanors: A Novel (Meredith Gentry, Book 8)",
        "Authors": "By Hamilton, Laurell K.",
        "Description": "You may know me best as Meredith Nic Essus, princess of faerie. Or perhaps as Merry Gentry, Los Angeles private eye. In the fey and mortal realms alike, my life is the stuff of royal intrigue and celebrity drama. Among my own, I have confronted horrendous enemies, endured my noble kin’s treachery and malevolence, and honored my duty to conceive a royal heir—all for the right to claim the throne. But I turned my back on court and crown, choosing exile in the human world—and in the arms of my beloved Frost and Darkness. While I may have rejected the monarchy, I cannot abandon my people. Someone is killing the fey, which has left the LAPD baffled and my guardsmen and me deeply disturbed. My kind are not easily captured or killed. At least not by mortals. I must get to the bottom of these horrendous murders, even if that means going up against Gilda, the Fairy Godmother, my rival for fey loyalties in Los Angeles.But even stranger things are happening. Mortals I once healed with magic are suddenly performing miracles, a shocking phenomenon wreaking havoc on human/faerie relations. Though I am innocent, dark suspicions of banned magical activities swirl around me.I thought I’d left the blood and politics behind in my own turbulent realm. I had dreamed of an idyllic life in sunny L.A. with my beloved ones beside me. But it becomes time to wake up and realize that evil knows no borders, and that nobody lives forever—even if they’re magical.",
        "Category": " Fiction , Romance , Paranormal",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Organic Chemistry: Structure and Function",
        "Authors": "By Schore, Neil E. and Vollhardt, K. Peter C.",
        "Description": "With authors who are both accomplished researchers and educators, Vollhardt and Schore’s Organic Chemistry is proven effective for making contemporary organic chemistry accessible, introducing cutting-edge research in a fresh, student-friendly way. A wealth of unique study tools help students organize and understand the substantial information presented in this course. And this new edition incorporates the most current chemical research and new synthesis and green chemistry applications.  New!ChemPortal for Organic Chemistry, Fifth EditionChemPortal provides all necessary multimedia resources in one location, including the eBook, step-by-step tutorials to illustrate problem-solving skills, and enhanced animations and video lectures. Click here for a guided tour.",
        "Category": " Science , Chemistry , Organic",
        "Publisher": "W. H. Freeman",
        "Price Starting With ($)": "8.89",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Green Smoothie Revolution: The Radical Leap Towards Natural Health",
        "Authors": "By Boutenko, Victoria",
        "Description": "Thanks to processed and fast foods, being overworked, and feeling stressed while eating on the fly, it is increasingly difficult for most of us to eat anywhere near a balanced diet. We may not be obviously sick, but may suffer from lack of focus, insomnia, sluggishness, or any host of symptoms caused by nutritional deficiency. Green Smoothie Revolution takes aim at this silent epidemic by restoring balance to our diets. Combining nutrition and know-how with recipes that pack a powerhouse punch, Victoria Boutenko reintroduces long neglected fruits, vegetables, and greens in the most persuasive style for our busy lives: with fast prep and delicious results. Featuring 200 recipes, Green Smoothie Revolution offers both simplicity (4 ripe pears, 1 bunch parsley, 2 cups water; blend well) and enough variety to keep taste buds happy and nutrients coming from a wealth of options.",
        "Category": " Cooking , Specific Ingredients , Natural Foods",
        "Publisher": "North Atlantic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Imagine Your Life Without Fear",
        "Authors": "By Lucado, Max",
        "Description": "Each sunrise seems to bring fresh reasons for fear.They're talking layoffs at work, slowdowns in the economy, flare-ups in the Middle East, turnovers at headquarters, downturns in the housing market, upswings in global warming. The plague of our day, terrorism, begins with the word terror. Fear, it seems, has taken up a hundred-year lease on the building next door and set up shop. Oversized and rude, fear herds us into a prison and slams the doors. Wouldn't it be great to walk out?Imagine your life, wholly untouched by angst. What if faith, not fear, was your default reaction to threats? If you could hover a fear magnet over your heart and extract every last shaving of dread, insecurity, and doubt, what would remain? Envision a day, just one day, when you could trustmore and fear less. Can you imagine your life without fear?The booklet contains Chapter 1 of Fearless with additional content.",
        "Category": " Religion , Christian Living , Spiritual Warfare",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "International Business",
        "Authors": "By Hill, Charles W. L.",
        "Description": "Market-defining since it was first introduced, International Business 8e by Charles W. L. Hill, continues to set the standard for international business textbooks.  In writing the book, Charles Hill draws on his experience in teaching, writing, and global consulting to create the most thorough, up-to-date, and thought-provoking text on the market. Because many issues in international business are complex, the text explores the pros and cons of economic theories, government policies, business strategies, organizational structures, etc. Hill’s: International Business is known for its strong emphasis on strategy, and for maintaining a tight integrated flow between chapters. Hill’s book is practical in nature, focusing on the managerial implications of each topic on the actual practice of international business. The author’s passion and enthusiasm for the international business arena is apparent on every page as he strives to make important theories interesting, informative, and accessible to all students.",
        "Category": " Business & Economics , International , General",
        "Publisher": "McGraw-Hill/Irwin",
        "Price Starting With ($)": "7.31",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Kiss of Death (Morganville Vampires, Book 8)",
        "Authors": "By Caine, Rachel",
        "Description": "A new chapter in the New York Times bestselling Morganville Vampires saga.   Vampire musician Michael Glass has attracted the attention of a big- time producer who wants to cut a demo and play some gigs-which means Michael will have to enter the human world. For this, he's been assigned escorts that include both a dangerous immortal as well as Michael's all-too-human friends. And with that mix of personalities, this is going to be a road trip from hell...",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Ethan Frome (Penguin Classics)",
        "Authors": "By Wharton, Edith and Ammons, Elizabeth (CON)",
        "Description": "Set against the frozen waste of a harsh New England winter, Edith Wharton's Ethan Frome is a tale of despair, forbidden emotions, and sexual tensions, published with an introduction and notes by Elizabeth Ammons in Penguin Classics.   Ethan Frome works his unproductive farm and struggles to maintain a bearable existence with his difficult, suspicious, and hypochondriac wife, Zeenie. But when Zeenie's vivacious cousin enters their household as a 'hired girl', Ethan finds himself obsessed with her and with the possibilities for happiness she comes to represent. In one of American fiction's finest and most intense narratives, Edith Wharton moves this ill-starred trio toward their tragic destinies. Different in both tone and theme from Wharton's other works, Ethan Frome has become perhaps her most enduring and most widely read novel.For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " Fiction , Classics",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    }
]