[
    {
        "Title": "Mississippi Memories: Classic American Cooking from the Heartland to the Mississippi Bayou",
        "Authors": "By Rodgers, Rick and Delta Queen Steamboat Co.",
        "Description": "Providing an array of sumptuous recipes from the historical cuisine of the Mississippi riverboats, a cookbook that travels the great river offers original American dishes, such as Savory Corn Fritters, Jambalaya Pasta, Peanut Butter Cake, and Apple Orchard Cole Slaw.",
        "Category": " Cooking , General",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Pioneering Ascents",
        "Authors": "By Mazel, David (EDT)",
        "Description": "An anthology of 36 accounts of notable first ascents from 1642 (Darby on Mt. Washington, N.H.) to the 1870s (John Muir). Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Sports & Recreation , Mountaineering",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Feed a Cold, Starve a Fever: A Dictionary of Medical Folklore",
        "Authors": "By Rinzler, Carol Ann",
        "Description": "New edition of  The dictionary of medical folklore  (Thomas Y. Crowell, 1979). A compendium of trues and falses with brief explanations, arranged alphabetically by symptom, condition, substance, or procedure (e.g. choking, circumcision, coffee,  colds). Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Social Science , General",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Chiangs of China",
        "Authors": "By Elmer T. Clark",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon-Cokesbury",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1943"
        }
    },
    {
        "Title": "Antaeus: No. 69, Fall, 1992",
        "Authors": "By Halpern, Daniel (EDT)",
        "Description": "",
        "Category": " Poetry , American , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The International Encyclopedia of Aviation",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Crown Publishers",
        "Price Starting With ($)": "9.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "A companion guide to the Royal Castle in Warsaw",
        "Authors": "By Jerzy Lileyko",
        "Description": "",
        "Category": "",
        "Publisher": "Interpress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Dance of Anger: A Woman's Guide to Changing the Patterns of Intimate Relationships",
        "Authors": "By Lerner, Harriet Goldhor",
        "Description": "\"Anger is a signal and one worth listening to,\" writes Dr. Harriet Lerner, in her renowned classic that has transformed the lives of millions of readers. While anger deserves our attention and respect, women still learn to silence our anger, to deny it entirely, or to vent it in a way that leaves us feeling helpless and powerless. In this engaging and eminently wise book, Dr. Lerner teaches women to identify the true sources of our anger and to use anger as a powerful vehicle for creating lasting change.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Kasparov Vs. Karpov, 1990 (Cadogan Chess Books)",
        "Authors": "By Kasparov, Garry K.",
        "Description": "",
        "Category": " Games , Chess",
        "Publisher": "Pergamon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Wits and Sages",
        "Authors": "By Grauer, Neil A.",
        "Description": "Profiles of twelve popular and influential syndicated newspaper columnists, ranging from Jack Anderson and Erma Bombeck to William F. Buckley, Jr. and Mike Royko, accompany incisive assessments of their work",
        "Category": "",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Training the Perfect Puppy: A New Owner's Guide",
        "Authors": "By Prisco, Andrew De and De Prisco, Andrew",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Bubbles Ablaze",
        "Authors": "By Strohmeyer, Sarah",
        "Description": "The irrepressible heroine of Sarah Strohmeyer's Agatha Award-winning series makes her usual headline-grabbing entrance just in time to heat up Pennsylvania's coal country-in another rip-roaring tale of murder and mayhem.  Bubbles Ablaze finds the redoubtable Ms. Bubbles Yablonsky heeding a call from her boss at the News-Times and racing her Camaro toward a potentially big news story. But when she arrives at an abandoned coal mine, she finds the love of her life, Steve Stiletto, knocked unconscious . . . and the body of another man with a sizeable hole in his chest. Moments later, Bubbles and Stiletto are trapped by an explosion. Convinced that someone wants them dead, they search for their intended assassin in coal country, where they uncover a conspiracy at the Main Mane hairdressing salon, a cadre of women known as the Sirens of Slagville, and a hot spot called Limbo that's been burning underground for forty years.  With a cast of characters headed by the usual suspects-Bubbles's brainy teenage daughter Jane; Jane's clueless boyfriend G; and that dynamite duo, her mother LuLu and paranoid sidekick Genevieve- and led by the singular Bubbles herself, this is another fast and furious tale that will keep readers in Limbo-and in stitches.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Third Sister: A Continuation of Jane Austen's Sense and Sensibility",
        "Authors": "By Barrett, Julia",
        "Description": "In Sense and Sensibility Jane Austen, that so long mistaken avatar of Victorian propriety while actually its wittiest and subtlest critic, wrote of Margaret Dashwood, the third sister: \"Margaret, the other sister, was a good-humored, well-disposed girl; but as she had already imbibed a good deal of Marianne's romance, without having much of her sense, she did not, at thirteen, bid fair to equal her sisters at a more advanced period of life.\"At the same time that she so faithfully, with love and respect, evokes Jane Austen's style and characters and ambience, Julia Barrett bids fair to show Margaret's creator happily wrong in her estimation of Margaret's at first vulnerable, then shrewd and winning potential, the exercise of which makes for the substance of this remarkable novel on its own.But of course, Jane Austen couldn't know of Margaret's metamorphosis. Or perhaps she did, and meant one day to say so herself. Whatever, The Third Sister is an imaginative, creative continuation of Sense and Sensibility, featuring a Margaret Dashwood, the third sister, once so underestimated, who turns out to fool even her creator.",
        "Category": " Fiction , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Sociology: A Down-To-Earth Approach",
        "Authors": "By Henslin, James M.",
        "Description": "",
        "Category": " Social Science , Research",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "7.69",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Breads: Step-by-Step Techniques",
        "Authors": "By Ed, Sunset",
        "Description": "Offers more than 150 recipes for yeast breads, sourdough, croissants, quick breads, bagels, and other favorites",
        "Category": "",
        "Publisher": "Lane Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Death Benefit: A Lawyer Uncovers a 20-year Pattern of Seduction, Arson and Murder",
        "Authors": "By Heilbroner, David and Keeney, Steven",
        "Description": "For Steve Keeney, it began with a simple favor. A woman from Keeney's Louisville church, Bobbie Roberts, confided that her twenty-year-old daughter Deana had recently died in a cliff fall at Big Sur, California. Bobbie was now having trouble collecting burial insurance. Keeney, a successful corporate lawyer, agreed to help her cut through the red tape.The coroner's report stated that a couple named B.J. and Virginia McGinnis had driven Deana to a four-hundred-foot Big Sur cliff. The McGinnises said that when their backs had been turned, the girl had fallen \"without a sound.\" Days after reading this report, Keeney was stunned to learn that Virginia had paid for a life insurance policy on Deana one day before the accident.Keeney suspected foul play, but Big Sur authorities quietly dropped the case: There were no witnesses other than the McGinnises. Undeterred, Keeney promised his client that he would try to find out the truth. A chilling portrait emerged.Virginia called herself a practical nurse, but people had dark memories of her \"care.\" They recalled her three-year-old daughter, her husband, and her mother - all of whom died while alone with Virginia. A series of fires, thefts, poisonings, and insurance policies ran through her past. Keeney also discovered that both of Virginia's sons had been charged with murder.As Keeney was piecing the facts together, he realized he had uncovered a remorseless killer, one who beat the system for twenty years, collecting insurance along the way.Former prosecutor David Heilbroner, author of the highly acclaimed book Rough Justice, spent two-and-a-half years retracing Keeney's investigation, preserving accounts of many witnesses whose voices were never heard at Virginia's extraordinary two-month murder trial - a trial that literally took the jury to the edge of the Big Sur cliff. In Death Benefit, he crafts a meticulous account of both a killer's life and a Kentucky lawyer's dedication to decency and courage triumphant over evil. Death Benefit belongs to that rare breed of books - a powerful human drama and a true-life courtroom thriller.",
        "Category": " Social Science , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Making War",
        "Authors": "By Lehman, John",
        "Description": "Former Secretary of the Navy John Lehman here confronts one of the momentous issues of American history and the American present--the contending prerogatives of the president and Congress in making war.Lehman, a lively controversialist and scholar, examines the history of American military decision making from the Revolutionary period to the Gulf War. Whose power is it to declare war, to carry it out, and to sustain its course and bring it to an end? In addressing these major constitutional questions, Lehman is vibrantly contemporary, too, writing as a government insider to offer a exceptionally vivid perspective on Operation Desert Storm and recent military actions in Grenada, Libya, Lebanon, and Panama. Arguing vehemently for the primacy of presidential over congressional power, Lehman adds crucial new details to our understanding of the post-Vietnam era of American politics.Characteristically, Lehman pulls no punches. He sheds provocative new light on congressional investigations into Watergate and Iran-Contra, authoritatively demonstrating the ways in which Congress has created crippling impediments to presidential power. Yet he provides a fresh understanding of the essential role Congress must play in committing the nation to war, and he enumerates how presidents from Jefferson to Bush have interpreted--and misinterpreted--the powers grated them as commander in chief.John Lehman's enlightening new book makes a invaluable contribution as to whether responsible judgments will be made if and when the nation must again confront the crucial decision of making war.",
        "Category": " Law , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Beyond Survival: New Directions for the Disarmament Movement",
        "Authors": "By Albert, Michael (EDT) and Dellinger, Dave (EDT)",
        "Description": "Nine political activists and journalists examine the connections between militarism, the economy and foreign policy, and the common roots of militarism, racism, sexism, and class oppression.",
        "Category": " Political Science , International Relations , Arms Control",
        "Publisher": "South End Press",
        "Price Starting With ($)": "5.03",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "The Grand Tradition: British Art from Amherst College",
        "Authors": "By Trapp, Frank",
        "Description": "",
        "Category": "",
        "Publisher": "American Federation of Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Surprise Party",
        "Authors": "By Katz, William",
        "Description": "As she plans a birthday party for her husband, Samantha Shaw gradually learns that he is the deadly calendar murderer",
        "Category": " Fiction , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "The Family Contract: A Blueprint for Successful Parenting",
        "Authors": "By Leftin, Howard I.",
        "Description": "",
        "Category": "",
        "Publisher": "Pia Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Real World Illustrator 8 (2nd Edition)",
        "Authors": "By McClelland, Deke and McClelland, Daniel",
        "Description": "A thorough reference to design and production techniques using the popular graphics software. Organized in four parts--starting, creating, changing, and coloring--it covers the simple to the complex in extensive detail. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Computers , Computer Graphics",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "8.93",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Machine Embroidery (The Potter Needlework Library)",
        "Authors": "By Burgess, Linda (PHT), Carter, Clare, and Clare, Carter",
        "Description": "With Machine Embroidery; anyone can learn to use a simple zigzag sewing machine to create beautiful decorative stitching. Step-by-step instructions demonstrate the many effects possible with machine embroidery, from basic straight stitches to exciting free-motion embroidery. Detailed projects include a lovely quilted bedspread, a silk lampshade, and a charming fairy doll, with helpful illustrations and gorgeous color photographs to guide and inspire even novice embroiderers.",
        "Category": " Crafts & Hobbies , Needlework , Embroidery",
        "Publisher": "Potter Craft",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Dressed to Grill: Savvy Recipes for Girls Who Play with Fire",
        "Authors": "By Morgan, Diane, Brooks, Karen, Darmon, Reed, and Adams, Beth (ILT)",
        "Description": "Women take back the light! Finally, a grilling cookbook that puts gals in charge of the coals. Dressed to Grill is certain to appeal to the way women cook today: fast and furious, with, of course, a healthy nod to low-fat ingredients. Heres every aspect of modern grilling girl-dom-from Animal Magnetism Steak for that hot date to How Could I Be Sarong if the romance goes sour. Toss in some wild drinks and a chapter with tips on how to light a grill, what charcoal to buy, as well as what types of wood work best for smoking, and girls everywhere will be declaring their grilling independence.",
        "Category": " Cooking , Methods , Outdoor",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Motherhood: The Second Oldest Profession",
        "Authors": "By Bombeck, Erma",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Shadow Money",
        "Authors": "By Effinger, George Alec",
        "Description": "While attending college in Michigan, van Eyck concocts a plan to get rich quick by stealing computer tapes containing the payrolls of the three major auto companies and ransoming them back during labor negotiations",
        "Category": " Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "32.95",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "The Book of the Month: Sixty Years of Books in American Life",
        "Authors": "By Silverman, Al (EDT)",
        "Description": "Includes the best reviews, essays, and articles of the Club's \"News,\" including pieces by Heywood Brown, Maxwell Perkins, John Gunther, Robert Penn Warren, and Barbara Tuchman",
        "Category": " Literary Criticism , General",
        "Publisher": "Little Brown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "The New Grove Second Viennese School: Schoenberg, Webern, Berg",
        "Authors": "By Griffiths, Paul, Neighbour, Oliver, and Perle, George",
        "Description": "",
        "Category": " Music , Genres & Styles , Classical",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "F. Scott Fitzgerald (Literary Lives)",
        "Authors": "By Mizener, Arthur",
        "Description": "The unending fascination of F. Scott Fitzgerald lies partly in the fact that his tragic life was like the plots of his own novels. Many famous and brilliant writers have led withdrawn, prosaic, uneventful lives; but Fitzgerald and his wife, Zelda, existed almost wholly in the real, external world--active, social, sadly typical of that frantic time in which he experienced instant success and fame, followed by a long decline and failure. Arthur Mizener is well known as the author of the first full-scale biography of Fitzgerald. In this book, Professor Mizener looks at the facts of Fitzgerald's short life, offering insights into the subtle way in which actual events were transformed and woven into the novels. With the aid of contemporary photographs from all stages of Fitzgerald's career he tells the human story and provides an important assessment of Fitzgerald's achievement.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "The Research Universities and Their Patrons",
        "Authors": "By Rosenzweig, Robert M.",
        "Description": "America's research universities--some fifty leading intellectual centers--have assumed a unique set of responsibilities. In addition to educating undergraduates, they house most of the nation's basic research and train virtually all new scientists and scholars. The health of these institutions is critical to the nation's intellectual life as well as to its economic well-being, military posture, and foreign policy. Robert Rosenzweig, reporting on a project sponsored by the Association of American Universities, examines the core functions of the research universities and explores how they might best relate to their powerful patrons: the national government, foundations, business, and industry.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "Sams' Teach Yourself Upgrading and Fixing PCs in 24 Hours (Teach Yourself in 24 Hours Series)",
        "Authors": "By Grimes, Galen",
        "Description": "Presenting a quick, easy, and effective approach to PC care, this basic handbook discusses the various system components and how they work, the art of troubleshooting, replacing versus upgrading, sound system components, communications devices, and more. Original. (Beginner).",
        "Category": " Computers , Hardware , Personal Computers , PCs",
        "Publisher": "Sams",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "8-Color Country Cross-Stitch",
        "Authors": "By Stevenson, Sarah",
        "Description": "",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Living With Cannibals And Other Womens Adventures",
        "Authors": "By Slung, Michele and Lindbergh, Reeve (INT)",
        "Description": "The spirit of adventure sweeps through the chapters of this exciting volume as we encounter the inspiring, sometimes tragic, often humorous tales of adventurous women -- from the 18th century to the 21st century.  Selected from National Geographic's rich archives, this colorful group portrait pairs female adventurers of the past with their contemporary counterparts -- in a \"then and now\" approach.  You'll meet Arctic explorers -- an American heiress who crisscrossed ice fields seven decades ago, along with a celebrated New Zealander who skied alone to both North and South Poles in the 1990s. You'll also join in the atmospheric exploits of Shannon Lucid and Amelia Earhart as they take off on those daring flights that wrote a new pages in the annals of aviation.  Tour the world with women who defied Victorian convention to venture alone among the headhunters of Borneo or to see first hand the hidden corners of Africa, India, and Japan. Witness world record-breaking moments by such latterday legends as Sylvia Earle, whose explorations of the ocean floor earned her the nickname, \"Her Royal Deepness,\" and Catherine Destivelle, the beautiful French superstar of modern mountaineering.  Featuring photographs, art, and period illustrations, as well as an introduction by Reeve Lindbergh and a 1,500-year time line of women's adventuring, Living With Cannibals offers vivid testimony to the wanderlust, daring, and determination of these intrepid journeyers.  Whether kayaking remote Tibetan rivers or bottle-feeding baby orangutans, bicycling to India or battling icebergs off the coast of Greenland, each woman profiled here demonstrates her unswerving devotion to a dream.",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "A Time of Our Choosing: America's War in Iraq",
        "Authors": "By Purdum, Todd S.",
        "Description": "The authoritative account of America’s most controversial war since Vietnam, a conflict in which “shock and awe” were not confined to the battlefield It was a war like no other the United States had ever fought. It began with the bombing of Saddam Hussein’s bunker and ended with statues of the Iraqi dictator being toppled in downtown Baghdad, and it marked a turning point in America’s relations with its enemies, its allies, and its sense of itself. Yet most Americans experienced the war as impressionistic and often confusing—the story of one battle here, one unit there, a report from one city, then another, without the larger context we so urgently needed. Each reporter had his “slice” of the war, it seemed, but no one had the whole story or the broad view.A Time of Our Choosing fills that gap brilliantly, drawing on the unparalleled resources and reportage of The New York Times. Todd S. Purdum, one of the paper’s most gifted storytellers, traces the war in Iraq from the first rumblings after 9/11, to the diplomatic recriminations at the United Nations, to the battles themselves and their aftermath. He deftly rolls out the whole canvas before our eyes, showing how the individual “slices” fit together into a single, gripping drama.Purdum also explores the complex legacy of America’s near-unilateral action. Since the 9/11 attacks, President George W. Bush has vowed that the United States would confront its enemies “at a time of our choosing,” and Purdum shows in vivid terms what this choice has meant for our now transformed world.",
        "Category": " History , Military , Iraq War (2003-2011)",
        "Publisher": "Times Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Rewriting History",
        "Authors": "By Morris, Dick and McGann, Eileen",
        "Description": "Now, for the first time, Fox News political analyst and former Clinton adviser Dick Morris turns his sharp-eyed gaze on Hillary, the longtime First Lady, current New York senator, and bestselling author. For, as he argues, no politician in America today is better aligned to become president in 2008—and none would bring more baggage to the White House—than Mrs. Clinton. In Rewriting History, Morris draws on his own long working relationship with the Clintons, as well as his trademark deep research and candid, nonpartisan analysis, to create a rebuttal to Hillary's bestselling autobiography, Living History. Morris documents how Hillary hides her true self behind a \"Hillary\" brand that is chatty, charming, giggly, and warm—but is far from her true personality.In Rewriting History, Morris pierces the mask to get at the truth behind the distortions and omissions of Hillary's memoir. Here we meet the real Hillary, both good and bad: the manager who makes the trains run on time, but also the paranoid who sees all those who disagree with her as personal enemies; the idealist, but also the \"advice addict\" easily misled by the guru of the moment. Morris describes Hillary's sense of entitlement, and warns that it may lead deep into financial scandal. And he demonstrates how Hillary dodges criticism by pretending that every attack is directed not just at her, but at every working woman in America. Ultimately, Morris argues, the Hillary Clinton of today is marketing a false front, obscuring both her wants and her assets behind the phony facade of a domestic Everywoman. But as she pursues higher office, she also faces a choice. Will she, like Bobby Kennedy, see the error of her ruthless ways, and embrace the sincere idealism she professes? Or, like Richard Nixon, will she allow the darker angels of her nature to overcome her, jeopardizing herself and the country in the process?As Rewriting History suggests, we can only hope that Hillary Clinton's past performance is no guarantee of future results.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "10.75",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "A journey through Oz: The business leaders road map to tracking information technology assets",
        "Authors": "By Jesse, Chris",
        "Description": "",
        "Category": "",
        "Publisher": "Research Triangle Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Girls! Girls! Girls!:  Essays on Women and Music",
        "Authors": "By Cooper, Sarah (EDT)",
        "Description": "In recent years, much attention has been lavished on the New Women of rap and rock. From rap stars such as Queen Latifah to bands such as Velocity Girls, popular music has been aggressively redefined by a new generation of women, with a startling range of musical styles. Yet, women's role in contemporary music, and in music history, extends far beyond MTV or the latest riot grrrl troupe. In Girls! Girls! Girls!, Sarah Cooper has assembled a broad- ranging collection of essays to provide an entertaining and impressionistic portrait of women and music. Whether in the form of Helen Kolawole's discussion of the bitch- bashing misogyny of gangsta rap or Caroline Sullivan's exuberant assessment of women rock critics, the volume raises, and addresses, some of the most provocative and challenging issues concerning women's active involvement in and relationship to music. From indie labels to opera queens, from symphony orchestra to salsa queen, from swing to women's music in South Asia to the confessions of a British country music fan, Girls! Girls! Girls! has something for everyone, music critics, feminists, and fans alike.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "NYU Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Soul of Golf",
        "Authors": "By Hallberg, William",
        "Description": "One hot summer morning, William Hallberg, author of The Rub of the Green, set off on an odyssey across the United States to penetrate - and illuminate - the soul of golf. No course was too grand, no driving range too humble for a stop on Hallberg's unpredictable tour of America's verdant and not-so-verdant golf venues. He tackled Kiawah Island's diabolical and breathtaking Ocean Course with a party of well-heeled Southern gents. He tromped through sagebrush roughs and kikuyu bunkers in the Nevada outback. He encountered the ghost of a cherished golfing buddy during a memorable round in the Smokies. And between games he nursed his wounds, pondered his constantly mutating handicap, and commiserated with fellow golfers in dusky sports bars, greasy spoons, and rain-soaked motel parking lots.The Soul of Golf will make you laugh out loud, swallow hard in the face of painful truths, and ultimately head yet again for your favorite golf course, where fate lies in ambush.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Surviving Schizophrenia: A Family Manual",
        "Authors": "By Torrey, E. Fuller",
        "Description": "",
        "Category": "",
        "Publisher": "Perennial (HarperCollins)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Restoring Hope: Conversations on the Future of Black America",
        "Authors": "By West, Cornel and Sealey, Kelvin Shawn",
        "Description": "Nine of America's most influential artists, scholars, and public figures Harry Belafonte, Bill Bradley, Charlayne Hunter-Gault, The Reverend Dr. James A Forbes, Jr., and the Reverend Dr. James M. Washington, Wynton Marsalis, Patricia Williams, Haki Madhubuti, and Maya Angelou discuss the sources of hope among African Americans with scholar, theologian, and activist West. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Beacon Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Sidelines: Behind the Scenes of America's Favorite Sport",
        "Authors": "By Higgs, Ben",
        "Description": "",
        "Category": "",
        "Publisher": "Cadmus Fine Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Love Awaits: African-American Women Talk about Sex, Love, and Life",
        "Authors": "By Long, Courtney",
        "Description": "Love. Sex. Respect. Race. Politics. Unity. Spirituality. Cultural pride. These are some of the concerns expressed by twenty-six African American women in interviews with filmmaker-writer Courtney Long about what they wish for in African American men. And these issues are only part of the main concern shared by these women: that the gap between black men and women is widening into a chasm. The straight-talking sisters in Love Awaits discuss their brothers in the hope that they are taking the first step toward building a bridge of mutual understanding, unity, and peace - and creating a common ground for love and relationship.Arranged by topic, these interviews on love, sex, and growing up in the African American culture examine with honesty and raw energy the positive and negative aspects of relations between black women and men. They explore sources of pain and of healing between the sexes, obstacles to relating and new ways of being together. Candidly expressing her needs, desires, and expectations, each woman brings her own unique experiences, viewpoint, and personality to the discussion, weaving her own strand into the vibrant tapestry of the African American experience.",
        "Category": " Social Science , LGBT Studies , Lesbian Studies",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Italian Days",
        "Authors": "By Harrison, Barbara Grizzuti",
        "Description": "This book is a journey down the Italian peninsula that will make even the most experienced traveler relive its splendor anew. Harrison offers a fascinating mixture of Italian history, politics, folklore, food, architecture, art, and literature.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Ticknor & Fields",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "A Romance of the Equator: The Best Fantasy Stories of Brian W. Aldiss",
        "Authors": "By Aldiss, Brian Wilson",
        "Description": "A collection of fantasy stories, including \"Old Hundredth,\" \"The Girl Who Sang,\" \"The Source,\" \"Bill Carter Takes Over,\" and more",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "China After Mao (Princeton Legacy Library)",
        "Authors": "By Barnett, A. Doak (EDT)",
        "Description": "One of America's leading authorities on China outlines and assesses the implications of the inevitable passing of Mao Tse-tung and the older generation of revolutionary leaders from their position of command in China. Describing the mid-1960’s as \"a transitional period of great historic significance,\" the author outlines the basic unsolved problems and unresolved issues that face Peking’s leaders, speculates on future changes in Chinese Communist leadership and policies. Part Il of the book presents documents pertinent to the developing crisis in China, including “Khrushchev’s Phoney Communism,” Lin Piao’s “Long Live the Victory of the People’s War,” and “Great Cultural Revolution.” China After Mao is based on the Walter E. Edge lectures given at Princeton University in October 1966.Originally published in 1967.The Princeton Legacy Library uses the latest print-on-demand technology to again make available previously out-of-print books from the distinguished backlist of Princeton University Press. These editions preserve the original texts of these important books while presenting them in durable paperback and hardcover editions. The goal of the Princeton Legacy Library is to vastly increase access to the rich scholarly heritage found in the thousands of books published by Princeton University Press since its founding in 1905.",
        "Category": " History , General",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1967"
        }
    },
    {
        "Title": "Universal Foam: From Cappuccino to the Cosmos",
        "Authors": "By Perkowitz, Sidney",
        "Description": "Perkowitz (physics, Emory U.) provides a breezy but strangely captivating discussion of the many kinds of naturally-occurring and artificial foams that play important roles in our lives, from the delicious  crema  on top of a fine espresso to the aerogel foam used by NASA to retrieve bits of comets. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Science , Physics",
        "Publisher": "Walker & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Leading Edge",
        "Authors": "By Boyne, Walter J.",
        "Description": "Charts the evolutionary course of aviation history by highlighting in detail the most important inventions and pivotal developments along with their creators",
        "Category": " Transportation , Aviation , History",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "John Clancy's Christmas Cookbook",
        "Authors": "By Clancy, John",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Classics of Jewish Literature",
        "Authors": "By Lieberman, Leo and Beringause, Arthur F.",
        "Description": "",
        "Category": " Language Arts & Disciplines , Rhetoric",
        "Publisher": "Castle",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Star Attraction Bulletin Boards (Troll Teacher Ideas)",
        "Authors": "By Rutmand, Shereen Gertel",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Vocabulary Development: Grade 6 (Basics First)",
        "Authors": "By Vicky Shiotsu",
        "Description": "",
        "Category": "",
        "Publisher": "Frank Schaffer Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "West With The Night",
        "Authors": "By Markham, Beryl",
        "Description": "Describes growing up in an Africa that no longer exists, training and breeding race horses, flying mail to Sudan, and being the first woman to fly the Atlantic, east to west",
        "Category": " Technology & Engineering , Aeronautics & Astronautics",
        "Publisher": "North Point Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Student Success Secrets (Barron's Educational Series)",
        "Authors": "By Jensen, Eric and McPherson, Charles (ILT)",
        "Description": "Offers practical suggestions for developing good study habits, reading more quickly and efficiently, taking useful notes, improving one's vocabulary, writing successful papers, and preparing for tests",
        "Category": "",
        "Publisher": "Barron's Educational Series, inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Dragons Teeth",
        "Authors": "By Young, John Robert",
        "Description": "Briefly looks at the history of China and its army, describes the people, facilities and equipment of China's modern army, and discusses the training and daily life of Chinese soldiers",
        "Category": " Political Science , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "I Feel Great and You Will Too!: An Inspiring Journey of Success with Practical Tips on How to Score Big in Life",
        "Authors": "By Cosby, Bill (FRW), Croce, Pat, and Lyon, Bill",
        "Description": "Let the irrepressible president of the Philadelphia 76ers show you how to succeed in this invaluable blueprint for business and life.  A pioneer in the sports physical therapy industry, Pat Croce went from the training room to the boardroom in one of the most unlikely stories in sports history -- a classic rags-to-riches tale made possible by his indestructible positive attitude. With the same unstoppable character that has made him a favorite motivational speaker of Fortune 500 executives, Croce recounts the moments that taught him to strive for and achieve greatness.  But I Feel Great and You Will Too! is more than just the story of one man's remarkable journey. Throughout this moving, often hilarious, and always brutally honest book, Croce hits you with pointers on goal setting, communication, creative thinking, desire, dedication, and much more. Croce also includes his \"Ten Commandments of Customer Service,\" the same guidelines he used to become one of the most successful entrepreneurs in the sports industry.",
        "Category": " Business & Economics , Motivational",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "How Is My Second Grader Doing In School? What to Expect and How to Help",
        "Authors": "By Raymer, Dottie, Jacobson, Jennifer, and Parent-Teacher Advisory Board (COR)",
        "Description": "As the parent of a second grader, you may be asking yourself:  When will my child learn to spell? Why isn't my child bringing home math papers? What can I do to make sure my child knows everything he should?  Perhaps you've been told by your child's teacher that your second grader is doing fine. But what does \"fine\" really mean, and how can you be sure that your child's academic growth will continue?  Be your child's best teacher. Find out what your child knows, what your child needs to know, and how to work with your child to ensure success in school.  Inside, there is a wealth of fun, easy-to-do activities designed to teach your child important skills. The time you spend together will foster a love of learning that will remain with your child in the years to come.",
        "Category": " Education , Testing & Measurement",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "How to Get a Business Loan",
        "Authors": "By Mancuso, Joseph R.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Why Me?: Coping With Grief, Loss and Change",
        "Authors": "By Krauss, Pesach",
        "Description": "The authors discuss life's times of sadness, grief, fear, anger and how even in the most difficult of times people can call upon inner strength, dignity, and the love of others to find meaning",
        "Category": " Religion , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "The Snake-stone",
        "Authors": "By Doherty, Berlie",
        "Description": "",
        "Category": "",
        "Publisher": "Hamish Hamilton Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Empowering Technology: Implementing a U.S. Strategy",
        "Authors": "By Branscomb, Lewis M. (EDT)",
        "Description": "Technology policy - whether we should have one and what form such a policy should take - was a core issue of the 1992 presidential campaign, and in February 1993 the Clinton administration confirmed that fostering new technologies will be a critical part of its agenda for redirecting the American economy. To help orient the inevitable debates on this agenda, experts from Harvard's Center for Science and International Affairs here examine a set of key issues and problems that, taken together, define the scope and limits of such a policy.Among the topics discussed are the new relationship between federal and state governments implied by the administration's proposals, the usefulness of the concept of \"critical technologies\" for setting priorities, the creation of new missions for the national laboratories (particularly the three weapons laboratories), the changing nature of the social contract between the government and research universities, the problems that will confront the creation of a national information infrastruc­ture, the best ways to promote small- ­and medium-sized \"driver\" companies as well as civilian research and development generally, and the relationship between education and the requirements for work in the twenty-first century.Lewis M. Branscomb is Albert Pratt Public Service Professor and Director of the Science, Technology, and Public Policy Program at the Center for Science and International Affairs, Harvard University.",
        "Category": " Technology & Engineering , Social Aspects",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "The Runaway: A Novel",
        "Authors": "By Kay, Terry",
        "Description": "Tom and Son Jesus spend their days dreaming, fishing , and trying to escape work.  But their fun comes to an abrupt halt when they discover a human bone, which later turns out to be part of the skeletal remains of Son Jesus' long missing father.  As sheriff Frank Rucker, a World War II hero, begins an investigation into remains, he unmasks the racially motivated killer known only as Pegleg.  The sheriff's findings divide the people of Overton County, forcing a surprising conclusion --or beginning of justice.Set in the 1940's and using the relationships of two boys -- one black and the other white -- as a  springboard for the begining of desegregation in the South, The Runaway examines the joys, sorrows, conflicts, and racial disharmony of their historical biased environment.",
        "Category": " Fiction , African American , Historical",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Remediating Reading Disabilities: Simple Things That Work",
        "Authors": "By Cook, Jimmie",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Aspen Pub",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "The White-Flower-Farm garden book",
        "Authors": "By Pettingill, Amos",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Sky Woman Falling",
        "Authors": "By Mitchell, Kirk",
        "Description": "FBI Special Agent Anna Turnipseed, a Modoc Indian from California, and Bureau of Indian Affairs Investigator Emmett Parker, a Comanche from Oklahoma, are a team, sent by the feds wherever there are problems in tribal territory.Their latest assignment takes them to the Oneida lands in upstate New York where Brenda Two Kettles, an elder of the Oneida Tribe, has been found dead in a cornfield, every major bone in her body shattered. She seems to have fallen from the sky, like Sky Woman of the Oneida creation myth. When Anna and Emmett discover that Brenda was at the center of a bitter land dispute between Indians and white settlers who have lived on the land for many generations, they are sure she was murdered. Their investigation takes them to the edge of a simmering cauldron. Flag-waving whites are picketing the Turning Stone Casino and other Oneida-owned businesses. Indians are cruising with guns in their cars. Added to the dangers of race war is the presence of all the money-grubbing interests drawn to a lucrative casino. As their pool of suspects - of all colors - grows, Anna and Emmett's own lives depend on Anna's instincts, and her ability to see the line where myth and reality come together.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Art of the Gold Rush",
        "Authors": "By National Museum of American Art (U. S.) (COR), Driesbach, Janice Tolhurst, Jones, Harvey, Holland, Katherine Church, Oakland Museum (COR), and Crocker Art Museum (COR)",
        "Description": "The California Gold Rush captured the get-rich dreams of people around the world more completely than almost any event in American history. This catalog, published in celebration of the sesquicentennial of the 1848 discovery of gold at Sutter's Mill, shows the vitality of the arts in the Golden State during the latter nineteenth century and documents the dramatic impact of the Gold Rush on the American imagination.Among the throngs of gold-seekers in California were artists, many self-taught, others formally trained, and their arrival produced an outpouring of artistic works that provide insights into Gold Rush events, personages, and attitudes. The best-known painting of the Gold Rush era, C.C. Nahl's Sunday Morning in the Mines (1872), was created nearly two decades after gold fever had subsided. By then the Gold Rush's mythic qualities were well established, and new allegories—particularly the American belief in the rewards of hard work and enterprise—can be seen on Nahl's canvas. Other works added to the image of California as a destination for ambitious dreamers, an image that prevails to this day. In bringing together a range of art and archival material such as artists' diaries and contemporary newspaper articles, The Art of the Gold Rush broadens our understanding of American culture during a memorable period in the nation's history.",
        "Category": " Art , Folk & Outsider Art",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The Birdcage Book: Antique Birdcages for Contemporary Collector",
        "Authors": "By Garisto, Leslie",
        "Description": "Describes and illustrates birdcages made from wood, wire, wicker, and other materials, in a variety of styles ranging from simple to ornate",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The Argument Culture: Moving from Debate to Dialogue",
        "Authors": "By Tannen, Deborah",
        "Description": "The author of You Just Don't Understand decries the state of public discourse in America, showing how it operates as a debate between false extremes rather than a dialogue in pursuit of complex truths. 75,000 first printing. Tour.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Lincoln and Slavery",
        "Authors": "By Burchard, Peter",
        "Description": "Why did Abraham Lincoln approve of compromises over slavery?  How could he have thought that most black Americans would accept voluntary segregation as the way to freedom?  Why, in spite of Lincoln's shortcomings, did the black leader Frederick Douglass think that the president's accomplishments were more remarkable than those of the founding fathers?  In providing at least partial answers to these questions, Lincoln and Slavery gives us a fresh look at a subject often shadowed by misinformation.  Here, we follow the young Lincoln as he takes an interest in the law and becomes a legislator. In a series of debates with his political opponent Stephen Douglas, we hear Lincoln argue forcefully that slavery, if allowed to spread, would destroy democracy.  As Lincoln and Slavery focuses on Lincoln's years as president, we see him work on the Emancipation Proclamation -- which changed the purpose of the Civil War and welcomed black men into military service. We go with him to Gettysburg, where he reaffirms \"the proposition that all men are created equal.\" We listen to him, only weeks before his death, as he proclaims that the Union armies will keep fighting \"until every drop of blood drawn with the lash, shall be paid for by another drawn with the sword.\"  This is the story of a great American, a man who hated slavery and believed, above all else, that democracy was the best hope for humankind -- in his time and in all the years to come.",
        "Category": " Young Adult Fiction , Historical , United States , General",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Biology: Evolution, Diversity...",
        "Authors": "By Mader",
        "Description": "",
        "Category": "",
        "Publisher": "BROWN, W.C., COMPANY",
        "Price Starting With ($)": "8.77",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "William Faulkner: First Encounters",
        "Authors": "By Brooks, Cleanth",
        "Description": "In this clear-sighted and enjoyable book, Cleanth Brooks, acknowledged to be \"the best critic of our best novelist,\" introduces the general reader to Faulkner&#39;s most important novels and stories: The Sound and the Fury; As I lay Dying; The Hamlet; Go Down, Moses; Light in August; and Absalom, Absalom!  Brooks focuses on theme, character, and plot as well as on Faulkner&#39;s world—the fictional Yoknapatawpha County that provides a unique setting for Faulkner&#39;s tragicomic vision.",
        "Category": " Literary Criticism , American , General",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Feminism and Psychoanalytic Theory",
        "Authors": "By Chodorow, Nancy J.",
        "Description": "In this long-awaited book, a leading psychoanalytic feminist traces the development of her views on the psychodynamics, sociology, and culture of gender. Expanding upon her pathbreaking work in The Reproduction of Mothering and combining significant new writings with previously published essays, Nancy J. Chodorow elucidates how the unconscious awareness of self and gender we develop from earliest infancy continues to shape both our experience as men and women and the patterns of inequality and difference that exist throughout our society and culture. \"Chodorow is an exceptionally intelligent and serious writer, and her contribution to the debate on gender and sexual identity is substantial. . . . Through her deepening reflections on gender issues and her study of the reality of women's lives, Ms. Chodorow puts both Freud and feminism to the test.\"—Stuart Schneiderman, New York Times Book Review \"In [a book] teeming with ideas, Chodorow . . . explores issues such as the influence of maternal care on the emerging self, social oppression of women on the basis of presumed gender differences, Oedipal conglict, heterosexual identification, and women analysts.\"—Publishers Weekly \"These essays are as good a statement of the issues in feminist psychoanalysis or psychoanalytic feminism as I have seen, reflecting the knowledge and questions of an 'insider' in both areas. One is impressed by the richness of the implications drawn from observed constellations or relationships. This is book that should be of interest to a wide audience.\"—Malkah T. Notman, M.D., Journal of the American Psychoanalytic Association \"All readers will profit from reading all of the articles in historical sequence. Her own changes reflect some general trends in feminist and social science thought.\"—Miriam M. Johnson, Contemporary Sociology",
        "Category": " Social Science , Feminism & Feminist Theory",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Moral Freedom: The Search for Virtue in a World of Choice",
        "Authors": "By Wolfe, Alan",
        "Description": "How Americans describe their guiding principles in an exhilarating and unnerving new era of moral freedom. What is the difference between right and wrong? What does it mean to lead a good life? How binding is the marriage vow? What are your obligations to an employer? To your friends? To yourself? Is it always immoral to tell a lie? Eminent sociologist and public intellectual Alan Wolfe asked Americans around the country such questions in order to determine how we really think about morality today. Wolfe discovered that while values have changed, they are far from absent. Americans of all stripesfrom the most radical to the most traditionalwant to lead a good life, but in almost every case they are determined to decide for themselves what a good life means. Focusing on traditional virtues of loyalty, honesty, self-restraint, and forgiveness, Moral Freedom reveals the complexities of living in a society where rather than simply accepting strict conventions, each individual struggles to forge a moral life.",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Western Junior League Cookbook",
        "Authors": "By Seranne, Ann",
        "Description": "Thirty-three Junior Leagues in the western United States, Canada, and Mexico share traditional and original recipes in a unique blend of many cuisines--including Mexican, Spanish, Oriental, Italian, German, English, Portuguese, French, and Basque",
        "Category": " Cooking , Regional & Ethnic , American , Western States",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.08",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Charles: The untold story",
        "Authors": "By Benson, Ross",
        "Description": "",
        "Category": "",
        "Publisher": "V. Gollancz",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Better Homes and Gardens Household Hints and Tips",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "Recommends ways to prepare and serve food, tend the house and its contents, care for children and pets, and secure health and safety",
        "Category": " House & Home , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Some Times in America",
        "Authors": "By Chancellor, Alexander",
        "Description": "Brimming with gossip and humor, with minor tempests and huge embarrassments, this charming memoir of a modest Englishman's encounters with stateside culture in the fast lanes of Washington, D.C. and New York City wittily casts contemporary America in a revelatory, fresh, amusing light.While Chancellor's experiences with power and peril among the politically and socially elite in the American capital have provided him with an abundance of lively anecdotes, they did not prepare him for life at the New Yorker, where at the unanticipated bidding of Tina Brown he assumed the monocle of the magazine's famous top-halted mascot, Eustance Tilly, and edited \"The Talk of the Town\" - not always to flattering consequences. Under no other circumstances, however, could he have so intimately witnessed, or shared, the often exciting and frequently astonishing drama of Tina Brown's high-profile command at one of America's most august institutions.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Carroll & Graf Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Christmas Treasures: Christmas Cookies",
        "Authors": "By Hale, Gloria (EDT)",
        "Description": "Presents recipes for a variety of cookies including Christmas wreathes, gingerbread people and things, and miniature fruitcakes",
        "Category": " Cooking , Courses & Dishes , Cookies",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "The Perfect Christmas",
        "Authors": "By Magruder, Anne (EDT)",
        "Description": "With this book in hand anyone who wishes to create a storybook holiday season with the least fuss and expense will find it easy to deck the halls with energy and skill.",
        "Category": " Cooking , Holiday",
        "Publisher": "Anness",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Making Cents: Every Kid's Guide to Money : How to Make It, What to Do With It",
        "Authors": "By Wilkinson, Elizabeth",
        "Description": "Filled with interesting facts about money and includes a number of money-making ideas for young would-be entrepreneurs",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Phonics 2: Sound Patterns : Preschool and K (Brighter Child)",
        "Authors": "By American Education Publishing, American",
        "Description": "",
        "Category": "",
        "Publisher": "Amer Education Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "A Woman's Worth",
        "Authors": "By Williamson, Marianne",
        "Description": "Cutting across class, race, religion, and gender, A Woman's Worth speaks powerfully and persuasively to a generation in need of healing, and in search of harmony.With A Woman's Worth, Marianne Williamson turns her charismatic voice—and the same empowering, spiritually enlightening wisdom that energized her landmark work, A Return to Love— to exploring the crucial role of women in the world today. Drawing deeply and candidly on her own experiences, the author illuminates her thought-provoking positions on such issues as beauty and age, relationships and sex, children and careers, and the reassurance and reassertion of the feminine in a patriarchal society.",
        "Category": " Self-help , Personal Growth , Self-Esteem",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "100 Greatest Pitchers",
        "Authors": "By Kelley, Brent",
        "Description": "Lists the best pitchers of all time, briefly sketches each player's career, and summarizes their most notable accomplishments",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "WHAT YOUR 3RD GRADER NEEDS TO KNOW (Core Knowledge Series)",
        "Authors": "By Hirsch, E. D. (EDT)",
        "Description": "The author of the controversial Cultural Literacy presents the opinions of educators on what every third-grade child should know, offering information on such subjects as history, fine arts, geography, math, science, and technology.",
        "Category": " Education , Home Schooling",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Zucchini Pumpkins and Squash OP (Artful Kitchen)",
        "Authors": "By Stang, Kathleen Desmond",
        "Description": "",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Mac OS X Hacks: 100 Industrial-Strength Tips & Tricks",
        "Authors": "By Dornfest, Rael and Hemenway, Kevin",
        "Description": "Mac OS X is a marvelous confluence of the user-friendly and highly customizable Macintosh of yesteryear and the power and flexibility of Unix under the hood.  Those coming to Mac OS X from previous incarnations of the operating system recognize much of the friendly face of the Macintosh but they are also plunged into a whole new world. Unix converts to Mac OS X find a familiar FreeBSD-like operating system at the core and many of the command-line applications that they're familiar with.This presents a unique opportunity for combining traditional Unix hacking and Mac OS know-how.  Mac OS X Hacks goes beyond the peculiar mix of man pages and not-particularly-helpful Help Center, pulling the best tips, tricks, and tools from the Mac power users and Unix hackers themselves.The collection reflects the real-world know how and experience of those well steeped in Unix history and expertise, sharing their no-nonsense, sometimes quick-and-dirty solutions to administering and taking full advantage of everything a Unix desktop has to offer: Web, Mail, and FTP serving, security services, SSH, Perl and shell scripting, compiling, configuring, scheduling, networking, and hacking.  Add to that the experience of die-hard Macintosh users, customizing and modifying their hardware and software to meet their needs: System Preferences, GUI mods and tweaks, hardware tips, vital shareware and freeware, AppleScript, AppleTalk and equivalents, keyboard modifiers, and general Macintosh-style tomfoolery.Each Hack can be read easily in a few minutes, saving countless hours of searching for the right answer.  Mac OS X Hacks provides direct, hands-on solutions that can be applied to the challenges facing both those meeting the Mac for the first time and long-time users delving into Mac OS X and its Unix underpinnings.Mac OS X Hacks is the third in O'Reilly's new Hacks Serier which aims to begin reclaiming the term \"hacking\" for the good guys.  In recent years, the term has come to be associated with those nefarious black hats who break into computers to snoop, steal information or disrupt Internet traffic.  But the term originally had a more benign meaning, and you'll still hear it used this way whenever developers get together.  Our new Hacks books are written in the spirit of the true hackers -- the people who drive innovation.",
        "Category": " Computers , Security , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Blast from the Past: A Novel (Kinky Friedman Novels)",
        "Authors": "By Friedman, Kinky",
        "Description": "Now, at last, it can be revealed! The TRUTH behind the legend!  That Kinky Friedman... Where did he come from? How did he get that way? Shouldn't someone have called 911 long ago?   Now, in Blast from the Past, nationally bestselling author Kinky Friedman has searched his failing memory and has come up with a novel about his early days in New York City and how Kinky Friedman, the down-and-out star-crossed country music performer, became Kinky Friedman, the down-and-out star-crossed ace detective.  In this prequel to his earlier novels, one which gives new meaning to the term \"retro,\" Kinkster fans are given the definitive answer to two of literature's great burning questions: Where the hell did those weird characters come from anyway? And what about that puppet head?  Of course, it's not just Kinky himself who gets retroed, but all the Village Irregulars as well -- Ratso, Rambam, and McGovern -- who are glimpsed in the nascent stage, as is the ever-luscious Stephanie DuPont, who blasts upon the scene as a five-year-old nymphet in patent-leather spikes.   Imagine it's the '70s. Imagine the Lone Star Cafe is still alive and well. Imagine that it's still okay to do drugs, still okay to have unprotected sex, still okay to paddle a brat and spank a monkey. And imagine you are there, in the '70s, at the Lone Star, sipping a brew with the Kinkster, a much younger, even kinkier Kinky -- uncouth, unshaped, unrepentant, and frequently unconscious.  But lest you think that Blast from the Past is all nostalgia, be assured that Kinky has supplied a bang-up plot as well, much of which revolves around the mystery of who this guy Tim is who Judy exclaims about while being hosed by Kinky, and the question of whether or not the Feds have found Abbie Hoffman, who has been playing hide-and-seek in Ratso's apartment. Or something like that.  As always, it's great, unpredictable fun from a true original, whose \"Irreverent, bawdy and often outrageous adventures are like no others,\" as says The San Diego Union-Tribune. In Blast from the Past, you'll find the Kinkster in top form and at his most outrageous.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Gymnastics Balancing Acts",
        "Authors": "By Lessa, Christina",
        "Description": "Thirty of history's greatest gymnastics champions are featured here, including such celebrated gold medal winners as Kerri Strug, Dominique Moceanu, Vitaly Scherbo, Jaycie Phelps, Amanda Borden, Bart Conner, Svetlana Boginskaya, Amy Chow, and Mary Lou Retton.\"Everyone sees a gymnast's public moments-- the victories and defeats-- but no one, until now, has managed to bring out such an individually tailored, true portrait of these fine people as artists. Through their stories and photographs, we see a side of these great people which they only show to their closest friends.\"--Bela Karolyi",
        "Category": " Sports & Recreation , Gymnastics",
        "Publisher": "Universe",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Castaways of the Flying Dutchman",
        "Authors": "By Jacques, Brian and Schoenherr, Ian (ILT)",
        "Description": "The Flying Dutchman! The legend of the wind-tattered ghost ship and its mad sea Captain, cursed to sail the seas forever, has been passed down throughout the centuries.  But what of the young boy and his dog who were trapped aboard that ship? What became of them?  In this, one of Brian Jacques's most original adventures, the castaway boy and dog set off on an eternal journey of their own, braving icy wind and waves to arrive at strange shores, and explore new places and times.  The unlikely Chapelvale village is their first destination, a Victorian town under siege.  If Ben and his dog, Ned, can help the townspeople figure out the clues and riddles hidden beneath floorboards and deep inside wells--perhaps they can save Chapelvale and its people as well.  Brian Jacques as you have never seen him before!",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Philomel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Beast",
        "Authors": "By Benchley, Peter",
        "Description": "\"Makes the shark from \"Jaws\" look like a pet goldfish . . .\" USA Weekend Straight from the cutting edge of science and the logs of ancient mariners comes an immense horror -- a creature that rises up from the well of an ocean gone mad with an insatiable hunger and an endless lust to kill. One man leads a harrowing struggle to defeat the beast amid a threatened Bermuda paradise. His name is Whip Darling, a down-and-out sea dog who doesn't know where he'll get his next meal -- or whether it will get him first. From the Paperback edition.",
        "Category": " Fiction , Horror",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Star Bright: A Christmas Story",
        "Authors": "By Greeley, Andrew M.",
        "Description": "It's beginning to look a lot like an American Christmas: irritable, unpleasant relatives; horrible weather, miserable travel; a slobbering dog - and one Jack Flanigan, \"a harmless American of Irish origins,\" who is reluctantly but totally falling in love - with one Odessa Tatiana Alekseevna Shuskulya, a young woman from Russia who's studying at Harvard. (Jack, of course, is attending Boston College, the Jesuits' hangout in Chestnut Hill.)He makes a big mistake: he invites her home to Chicago for the holiday, though it isn't even Christmas in the Russian Orthodox calendar, and gorgeous Odessa is never alone except when she wants to be. So? So she accepts! And what happens when she gets to Chicago, caught in the American maelstrom of commercialized Yuletide? Ah, now, that would be telling, wouldn't it? Enough to say, there's a tree, and a feast, and midnight Mass, and a gaggle of contentious Flanigans of all ages - who have the merriest Christmas ever - and nothing will ever again be quite the same for any of them. Especially lucky Jack Flanigan.",
        "Category": " Fiction , General",
        "Publisher": "Forge",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Phonics Short Vowels",
        "Authors": "By Gregorich, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "School Zone Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "Creating Space without Adding on",
        "Authors": "By Jones, Jack P.",
        "Description": "",
        "Category": "",
        "Publisher": "M-H SCH EDUC GRP",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Mapping the Next Millennium: The Discovery of New Geographies",
        "Authors": "By Hall, Stephen S.",
        "Description": "Discusses the use of innovative new technologies to map diverse areas of the universe, from the mathmatical constant pi, to human chromosomes, to the ocean floor",
        "Category": " Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Baby Science: How Babies Really Work!",
        "Authors": "By Douglas, Ann",
        "Description": "Why do babies cry? How do you hold a baby? Why do babies suck their toes? You don't have to have a new baby at home to want to know the answers to these intriguing questions. Discover the science behind baby's first exciting year of development. The clear, straight-forward information, candid photos, and nifty hands-on activities in this book will turn any reader into a baby expert!",
        "Category": " Juvenile Nonfiction , Science & Nature , Anatomy & Physiology",
        "Publisher": "Maple Tree Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Instant Decor (Decorating Made Easy)",
        "Authors": "By Sheridan, Judy",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "How to Get Straight A's in School and Have Fun at the Same Time",
        "Authors": "By Green, Gordon W.",
        "Description": "You study hard. You memorize. You work at a problem over and over until it feels like your head is going to explode. You think, finally I'm ready for the big test. And you still don't make the grade. Relax.The truth is, Dr. Gordon Green knows exactly how you feel. He was a bright student. And he studied hard, too. But he struggled his freshman year at college anyway. What happened? He developed a unique ten-step program based on the simple principle that academic success is not so much a question of how hard you study, but how smart you study.Did it work?After college, Dr. Green went on to earn a Ph.D. in economics at a prestigious university--all the while maintaining straight A's!Thousands of student have benefited from his program. How he has adapted his study methods to apply to you. This is an easy, do-it-yourself guide to help you turn frustration into success. Topics include:How to get the most out of what you needHow to budget your timeHow to take a testKeys to developing effective study habitsIt's not enough to survive school. This guide will help you excel. And remember: There is no such thing as a mediocre student.Only mediocre results.",
        "Category": " Study Aids , Study & Test-Taking Skills",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "American Family Treasury",
        "Authors": "By Ideals Publications Inc",
        "Description": "The pleasures of family are enjoyed in poetry, fiction, at dinner, in history, while making crafts, and in song",
        "Category": " Family & Relationships , General",
        "Publisher": "Ideals Childrens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Breakthroughs (The Great War, Book 3)",
        "Authors": "By Turtledove, Harry",
        "Description": "Is it the war to end all wars - or war without end? What began as a conflict in Europe, when Germany unleashed a lightning assault on its enemies, soon spread to North America, as a long-simmering hatred between two independent nations explodes. Twice in fifty years the Confederate States of America has humiliated their northern neighbor. Now revenge may at last be at hand.Under the leadership of Teddy Roosevelt, and following a general named Custer - military genius or madman? - the United States are fighting a war on two fronts in 1917. In the north, from the Pacific to Quebec, U.S. forces in the air and on land are locked in battle against Canada and Great Britain. To the south, at the heart of a line that stretches from the Gulf of California to the Atlantic, Custer intends to do what none of his predecessors had ever managed: to smash through the Confederate barbwire entrenchments in Tennessee.Here are leather-jacketed daredevil pilots flying unproved fighters into anti-aircraft fire. Here is a melee on the sea, as U.S. sailors duel Confederate submariners, while the English, French, and Japanese surface navies vie for control of the shipping lanes. In Harry Turtledove's incredibly imagined alternate history, the Great War is played out over a cast of vivid characters. Amid the sound and fury of battle, as nonaligned nation-states choose sides and politicians spew bombast far from the front lines, The Great War: Breakthroughs captures a world war at an apocalyptic turning point. Victory is at hand - but at a price that may be worse than war itself.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Widow of Larkspur Inn (The Gresham Chronicles, Book 1)",
        "Authors": "By Blackwell, Lawana",
        "Description": "Julia Hollis learns to depend on God for the daily challenges involved in turning an abandoned coaching inn into a lodging house for affluent people wishing to escape city life",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Lincoln's Little War: How His Carefully Crafted Plans Went Astray",
        "Authors": "By Garrison, Webb B.",
        "Description": "The level of President Abraham Lincoln's involvement in the Civil War has long been debated. This intriguing book by historian Webb Garrison explores how Lincoln's plans for a small police action soon escalated into the bloodiest war in American history, and how Lincoln sought to absolve himself of any responsibility. Illustrated and indexed.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    }
]