[
    {
        "Title": "Thieves' Paradise: A Novel",
        "Authors": "By Dickey, Eric Jerome",
        "Description": "Twenty-five-year-old Dante Brown is down and out in L.A. After doing a stretch of hard time in juvenile jail, he cleaned up his act as a computer techie-only to be laid off when the economy went south. Now he's facing a mountain of unpaid bills, a car on its last legs, imminent eviction, and a snowball's chance in hell with Pam, a sexy waitress/actress on the hunt for a man with means.  Enter Scamz, a slick brother from Dante's checkered past whose successful, illegal business associations keep him in custom-tailored suits, a Benz CL600, and a lavish Hollywood mansion with his pick of gorgeous women. Dante is determined to stay straight...after one last con that could put him back on top. But he gets pulled in deeper when his old friend Jackson, who's $16,000 behind in child support, becomes part of the sting. The icing on the cake is Pam who, seduced by the easy money, suddenly finds Dante irresistible...until everything goes wrong.  A provocative and seductive story of contemporary men and women on the move and on the make, living large-and small-in L.A., Thieves' Paradise is this phenomenally gifted author \"at the top of his game\" (Chicago Defender).",
        "Category": " Fiction , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Stuffings: 45 International Recipes to Enhance Fish, Poultry, Meat, Vegetables, and Fruit",
        "Authors": "By Lalli, Carole",
        "Description": "There's something about stuffed foods that pleases the child in all of us, as if each dish is the wrapping for a treasure trove inside. What better example than the Thanksgiving turkey, where the stuffing often outshines the bird?Aware of the subtle pleasures that come from within, Carole Lalli, former editor in chief of Food & Wine, has created a marvelous array of flavorful stuffings for everything from poultry and meat dishes to fish and shellfish, vegetables and desserts.Lavishly illustrated, Lalli's easy-to-follow recipes and imaginative combinations, with an eye on healthful ingredients, make Stuffings a delight.",
        "Category": " Cooking , Holiday",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Politics of Global Governance: International Organizations in an Interdependent World",
        "Authors": "By Diehl, Paul F. (EDT)",
        "Description": "",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Lynne Rienner Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Cooking One on One",
        "Authors": "By Barnhurst, Noel (PHT), Ash, John, and Mintzer, Amy",
        "Description": "You love good food. You prefer fresh ingredients, you appreciate lively flavors, you try to eat healthy. So what's keeping you out of the kitchen? Fear? Boredom with making the same old things? In this book, renowned cooking teacher and innovative California chef John Ash says, \"Let's get back in there.\"Those lucky enough to have learned in the classroom alongside John Ash know that he is an extraordinarily gifted teacher who empowers beginning cooks and kitchen veterans alike to reach new culinary heights. In his celebrated classes, Ash takes the fear out of creative cooking by demonstrating the basics, then encouraging students to dive right in and experiment with the endless possibilities. Now, home cooks can reap the benefits of a private course with John Ash in this enlightening guide to cooking essentials and beyond.John Ash: Cooking One on One features lessons that focus on specific techniques, ingredients, or flavor-makers--vinaigrettes, pestos, and other building blocks that turn ordinary dishes into something special. With each lesson, Ash presents a handful of recipes--variations on a theme that start simply, then progress to reveal more complex combinations. With clear-cut instructions and a dash of charm, Ash helps cooks build confidence in the kitchen and proves that any dish, no matter how intricate, is based on a handful of simple techniques and troubleshooting know-how.This unique new collection of recipes--his first since the IACP Cookbook of the Year From the Earth to the Table--offers savory soups, satisfying main course salads, comforting vegetarian and nonvegetarian entrées, and delectable desserts for every occasion. Pan-Seared Sea Bass with Pineapple Melon Salsa. Mojo-Marinated Skewered Beef. Warm Spinach Salad with Bacon, Apple Cider Dressing, and Oven-Dried Grapes. Mushroom-Ginger Soup with Roasted Garlic Custards. Orange Ricotta Cake with Strawberries. Discover an irresistible assortment of extraordinary recipes prepared with global accents and a light touch. As one of the guiding forces behind California cuisine, Ash uses fats judiciously and encourages cooking with seasonal produce. His final lesson, an introduction to wine, rounds out this groundbreaking cookbook.An unprecedented blend of instruction and inspiration, John Ash: Cooking One on One swings open the kitchen door, stocks the pantry, and invites cooks of all skill levels to dish up fresh, flavorful food at home.",
        "Category": " Cooking , Specific Ingredients , Natural Foods",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Delia Smith's Summer Collection",
        "Authors": "By Smith, Delia and Knab, Peter (PHT)",
        "Description": "",
        "Category": " Cooking , Seasonal",
        "Publisher": "Bbc Pubns",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Wine Spectator's Ultimate Guide to Buying Wine (7th Edition)",
        "Authors": "By \"Wine Spectator\" Magazine",
        "Description": "Rates, describes, and prices nearly 40,000 wines; features Wine spectator's top one hundred wines from 1988 through 1999; and lists the fifty best red and white wine values.",
        "Category": " Cooking , Beverages , Wine & Spirits",
        "Publisher": "Running Press Adult",
        "Price Starting With ($)": "7.75",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Playboy's book of wine",
        "Authors": "By Gillette, Peter A",
        "Description": "",
        "Category": "",
        "Publisher": "Playboy Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Connoisseurs Book Of Spirit",
        "Authors": "By Broom, Dave",
        "Description": "This is an information-packed celebration of the world's most sophisticated aperitifs, most pleasurable digestifs and jazziest party drinks.",
        "Category": " Cooking , Beverages , Wine & Spirits",
        "Publisher": "Carlton Publishing Group",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Ferrets: Everything About Purchase, Care, Nutrition, Diseases, Behavior, and Breeding (Pet Care Series)",
        "Authors": "By Morton, Chuck and Morton, Fox",
        "Description": "",
        "Category": "",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Chameleons as Pets",
        "Authors": "By Roberts, Mervin F.",
        "Description": "",
        "Category": "",
        "Publisher": "T.f.m. Publications, 1977",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "February",
            "Year": "1977"
        }
    },
    {
        "Title": "Of Kinkajous, Capybaras, Horned Beetles, Seladangs: And the Oddest and Most Wonderful Mammals, Insects, Birds, and Plants of Our World",
        "Authors": "By Hanson, Jeanne K. and Morrison, Deane",
        "Description": "Describes 150 of the world's most unusual plants and animals",
        "Category": " Science , General",
        "Publisher": "Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Story of the Battle of the Bulge (Cornerstones of Freedom Series)",
        "Authors": "By Stein, R. Conrad",
        "Description": "Details the Germans' final attempt to reverse the course of the apparent Allied victory in World War II through a surprise attack on the American front",
        "Category": "",
        "Publisher": "Childrens Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1977"
        }
    },
    {
        "Title": "Untie The Ribbons",
        "Authors": "By Hoffman, Sharon",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Whitaker House",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Graham Kerr's Best",
        "Authors": "By Kerr, Graham",
        "Description": "On average, Americans now consume 34% of their daily calories from fat. But for anyone with even modest health risk factors, the 34% should be reduced to about 20%. And for people at high risk or those who have already experienced health problems, the ideal target is 10% of calories from fat.However, if you want to eat better, you don't have to sacrifice good taste and variety in your cooking to achieve the level of fat that you want or need.The 250 recipes in this unique collection have been carefully selected and organized to give you the widest and easiest choice of ingredients and cooking techniques to help meet your individual health requirements and satisfy your taste preferences.Divided into three main sections, representing 10%, 20% or 30% of calories from fat, respectively, the recipes include hearty soups and sauces, inventive main dishes and vegetables, and inspired desserts. Every recipe features the hallmarks we have come to expect from Graham Kerr: innovative flavors, imaginative cooking techniques, intriguing ingredients, helpful hints and tips, friendly and encouraging advice - geared to help you discover ways to prepare your favorite foods in a perfect balance of good taste and good health.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Kovels' Bid, Buy, and Sell Online: Basic Auction Information and Tricks of the Trade",
        "Authors": "By Kovel, Ralph M and Kovel, Terry",
        "Description": "Become an expert in Bidding, buying, and selling online with the ultimate guide to Internet collecting.From the basic information you need to sell your items in an online auction to making online buys at great prices, experts Ralph and Terry Kovel are right on top of the hottest trends.Kovels' Bid, Buy, and Sell Online offers all the expertise you need for buying or selling anything in this worldwide virtual bazaar. This guide covers it all!* How to register on a variety of online sites* How to search for what you want* How to write an ad to attract the most attention* How to use photographs* How to avoid fakes and forgeries* And much more . . .Complete with a chart comparing the fees, rules, and practices of the three major auction sites, as well as diaries of both a buyer and a seller, the book also provides the Kovels' list of sites (constantly updated at www.kovels.com) to guide you through the fast-growing auction opportunities on the Web.",
        "Category": " Antiques & Collectibles , Reference",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Special Forces: A Guided Tour of U.S. Army Special Forces (Tom Clancy's Military Referenc)",
        "Authors": "By Clancy, Tom and Gresham, John",
        "Description": "They are sent to the world's hot spots-on covert missions fraught with danger. They are called on to perform at the peak of their physical and mental capabilities, primed for combat and surveillance, yet ready to pitch in with disaster relief operations. They are the Army's Special Forces Groups. Now follow Tom Clancy as he delves into the training and tools, missions and mindset of these elite operatives.Special Forces includes:The making of Special Forces personnel: recruitment and trainingA rare look at actual Special Forces Group deployment ExercisesTools of the trade: weapons, communications and sensor equipment, survival gearRoles and missions: a mini-novel illustrates a probable scenario of Special Forces interventionExclusive photographs, illustrations and diagramsPlus: an interview with General Hugh Shelton, USA, Chairman of the Joint Chiefs of Staff (and the former Commander-in-Chief of the U.S. Special Operations Command-USSOCOM)",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Berkley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "All That We Can Be: Black Leadership And Racial Integration The Army Way",
        "Authors": "By Moskos, Charles C. and Butler, John Sibley",
        "Description": "When one thinks of those institutions in America that have been at the vanguard of social change, the U.S. Army does not spring readily to mind. And yet, over the past two decades, the Army has become the most successfully integrated institution in America - from the ranks of the lowliest privates to the highest level of command. What has made the Army's experience so striking is that this success was achieved without resort to numerical quotas or manipulation of test scores, nor has the promotion of black officers engendered the racial resentment that has become all too common in business, government, and higher education.All That We Can Be reveals how the Army created such a smoothly functioning system, how it works, and how this military model can be adapted to fit the needs of civilian society. The authors, Charles C. Moskos and John Sibley Butler, are the nation's foremost authorities on race relations in the armed forces, and together they bring more than a half-century's experience observing and analyzing how the Army gets things done. Moskos and Butler point out that what makes the Army unique is that it is the only place in America where blacks routinely boss around whites, and in this book they lay out the path by which the Army has promoted excellence across racial lines. Colin Powell is the most visible symbol of the Army's success, for his career has exemplified the guiding tenets of the Army system of merit-based recruitment, training, and promotion.There are many surprising findings in this book, especially for those who may think of the Army as a hidebound and rigidly hierarchical organization. Moskos and Butler reveal how the Army has created a transracial \"Afro-Anglo\" culture that fosters organizational effectiveness, and they make the point that black advancement does not depend upon the absence of racists in an organization so long as opportunity channels exist for minorities. Moskos and Butler also describe in detail the success of the Army's educational programs in developing the academic skills of underprivileged recruits - blacks and whites alikeand which could serve the needs of civilian youth as well.",
        "Category": " Social Science , Discrimination & Race Relations",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The Making of a Chef: Mastering Heat at the Culinary Institute",
        "Authors": "By Ruhlman, Michael",
        "Description": "Now in paperback, the eye-opening book that was nominated for a 1998 James Beard Foundation award in the Writing on Food category.In the winter of 1996, Michael Ruhlman donned hounds-tooth-check pants and a chef's jacket and entered the Culinary Institute of America in Hyde Park, New York, to learn the art of cooking. His vivid and energetic record of that experience, The Making of a Chef, takes us to the heart of this food-knowledge mecca.  Here we meet a coterie of talented chefs, an astonishing and driven breed. Ruhlman learns fundamental skills and information about the behavior of food that make cooking anything possible. Ultimately, he propels himself and his readers through a score of kitchens and classrooms, from Asian and American regional cuisines to lunch cookery and even table waiting, in search of the elusive, unnameable elements of great cooking.",
        "Category": " Cooking , Methods , Professional",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "VENGEANCE IS MINE.",
        "Authors": "By Spillane, Mickey",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "Gifts of Age: Portraits and Essays of 32 Remarkable Women",
        "Authors": "By Painter, Charlotte and Valois, Pamela",
        "Description": "Writer Charlotte Painter and artist/photographer Pamela Valois have combined their impressive talents to present these intimate glimpses into the lives of thirty-two remarkable women, each of whom has discovered in maturity the opportunity of exploring new and exciting challenges. These are the Gifts of Age: the time, the freedom, and hopefully the wisdom to develop creative new images of oneself and one's place in the complexities of a long life. All of the women in this book are more than sixty-five years of age, and included are such well-known personalities as Julia Child, M.F.K. Fisher, Joan Baez Senior, and Louise M. Davies. No two have followed the same path, but each has been successful in achieving some new, frequently unanticipated distinction in her latter years. Gifts of Age is a fascinating insight into just how productive one's extended life can be, and inspiration for anyone who believes that the creative talent for living need not diminish with the passage of years.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Unforgettable Women of the Century",
        "Authors": "By People Magazine (New York, N. Y.) (EDT)",
        "Description": "Celebrates the lives of such notable women as Marlene Dietrich, Georgia O'Keefe, Ann Frank, Marie Curie, Margaret Sanger, and Sally Ride",
        "Category": " Performing Arts , Television , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Very Funny, Charlie Brown",
        "Authors": "By Schulz, Charles",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Crest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "What Next, Charlie Brown? Selected Cartoons from \"You're Out of Your Mind, Charlie Brown! Vol II\"",
        "Authors": "By Charles Schulz",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Crest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Longitudes and Attitudes: The World in the Age of Terrorism",
        "Authors": "By Friedman, Thomas L.",
        "Description": "From the Pulitzer Prize–winning New York Times columnist and bestselling author of From Beirut to Jerusalem and The Lexus and the Olive Tree comes this smart, penetrating, brilliantly informed book that is indispensable for understanding today’s radically new world and America’s complex place in it.Thomas L. Freidman received his third Pulitzer Prize in 2002 “for his clarity of vision, based on extensive reporting, in commenting on the worldwide impact of the terrorist threat.” In Longitudes and Attitudes he gives us all of the columns he has published about the most momentous news story of our time, as well as a diary of his private experiences and reflections during his post–September 11 travels. Updated for this new paperback edition, with over two years’ worth of Friedman’s columns and an expanded version of his diary, Longitudes and Attitudes is a broadly influential work from our most trusted observer of the international scene.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Fifty Years of Communism: Theory and Practice 1917-1967",
        "Authors": "By Hudson, G.Francis",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Julie of the Wolves",
        "Authors": "By Jean Craighead George",
        "Description": "",
        "Category": "",
        "Publisher": "Trumpet Club",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Dr. Carlton Fredericks' new & complete nutrition handbook",
        "Authors": "By Fredericks, Carlton",
        "Description": "",
        "Category": "",
        "Publisher": "Major",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Judge Me Not",
        "Authors": "By MacDonald, John D.",
        "Description": "",
        "Category": "",
        "Publisher": "Gold Medal",
        "Price Starting With ($)": "17.15",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "Journey to the Other Side: Life After Death",
        "Authors": "By Wheeler",
        "Description": "",
        "Category": "",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "The Tiger on Your Couch: What the Big Cats Can Teach You About Living in Harmony With Your House Cat",
        "Authors": "By Fleming, Bill and Petersen-Fleming, Judy",
        "Description": "The ultimate cat care guide applies information about the big cats--lions and tigers and such--to the average feline house pet, offering tips on choosing a kitten, making cat toys, bathing, and much more.  35,000 first printing. $30,000 ad/promo.",
        "Category": " Technology & Engineering , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The Cat Lover's Companion: A Book of Cat Days and Cat Ways",
        "Authors": "By Joan Moore",
        "Description": "",
        "Category": "",
        "Publisher": "Joshua Morris Pub",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Marxism & the Megalopolis",
        "Authors": "By Tabb, William K., Sawers, Larry",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "God's Passion for You",
        "Authors": "By Graham, Billy",
        "Description": "A combination of some of the best and most beloved Christian leaders of our time come together to reach the lost. Billy Graham, Max Lucado, Charles Swindoll, Anne Graham Lotz and John MacArthur reach out to reveal God's passion for every human being. The reality of war and a world in pain is unveiled then captivatingly the truth of God's love is revealed in Jesus Christ reaching out to the reader to exchange all their bad choices for a solitary good one.",
        "Category": " Religion , Spirituality",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Extreme Answers To Extreme Questions God's Answers To Life's Challenges",
        "Authors": "By Smith, Carol, Washington, Linda, Hudson, Christopher D., Gieser, Katie E., Gieser, Katie E. (EDT), Drygas, Paige, Taylor, Ashley, and Watson, C. J.",
        "Description": "Built around 500 questions that teens frequently ask about faith, life, and love, Extreme Answers to Extreme Questions provides biblically-based answers written just for them, using their language and cultural references.  In addition, there will be 30 stories about teens facing difficult questions, cartoons for a bit of comic relief, and suggestions for using the XT4J website for more interaction with experts and their peers.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Nelson Reference & Electronic Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Presbyterians: Their History and Beliefs",
        "Authors": "By Lingle, Walter Lee",
        "Description": "",
        "Category": " Religion , Christianity , Protestant",
        "Publisher": "Westminster John Knox Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1944"
        }
    },
    {
        "Title": "The Secret: Unlocking the Source of Joy & Fulfillment",
        "Authors": "By Berg, Michael",
        "Description": "",
        "Category": " Religion , Judaism , General",
        "Publisher": "The Kabbalah Center",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Big Book of Big Secrets - the Uncensored Truth About All Sorts of Stuff You are Never Supposed to Know",
        "Authors": "By William Poundstone",
        "Description": "",
        "Category": "",
        "Publisher": "BArnes and Noble",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Body Project: An Intimate History of American Girls",
        "Authors": "By Brumberg, Joan Jacobs",
        "Description": "Based on candid journal entries and photographs, the author of Fasting Girls explains how growing up female has changed over the past century and argues that American girls have come to define themselves more and more through their bodies. 30,000 first printing. Tour.",
        "Category": " Social Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Escape Routes",
        "Authors": "By Roberts, David",
        "Description": "A collection of the author's favorite twenty adventure stories from the last eleven years",
        "Category": " Sports & Recreation , Mountaineering",
        "Publisher": "Mountaineers Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Othello;: A novel,",
        "Authors": "By Ludwig, Emil",
        "Description": "",
        "Category": "",
        "Publisher": "Putnam",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "I Came To Love You Late",
        "Authors": "By Joyce Landorf",
        "Description": "",
        "Category": "",
        "Publisher": "Fleming H. Revell Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Domesday: A Search for the Roots of England",
        "Authors": "By Wood, Michael",
        "Description": "Drawing on William the Conqueror's eleventh-century survey of England the author traces the roots of English culture and history, from first-century Roman occupation to the beginning of the English Renaissance in the fifteenth century",
        "Category": " History , Europe , Great Britain , General",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "A guide for the powerless and those who don't know their own power: A primer on the American political process",
        "Authors": "By Halperin, Samuel",
        "Description": "",
        "Category": "",
        "Publisher": "American Youth Policy Forum",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Baking Soda: Over 500 Fabulous, Fun, and Frugal Uses You've Probably Never Thought of",
        "Authors": "By Lansky, Vicki and Campbell, Martha (ILT)",
        "Description": "Noting a frequently overlooked product's many uses and environmental friendliness, a well-recognized parenting expert reveals the benefits of baking soda for cooking, gardening, cleaning, health care, and hobbies. Original. 20,000 first printing. IP.",
        "Category": " House & Home , General",
        "Publisher": "Book Peddlers",
        "Price Starting With ($)": "24.95",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Why Do Cats Do That?: Real Answers to the Curious Things Cats Do",
        "Authors": "By Thornton, Kim Campbell and Thornton, Kathleen",
        "Description": "Award-winning author Kim Campbell Thornton offers ?Real Answers to the Curious Things Cats Do” in this fun-fact book that all cat lovers will adore.  Why Do Cats Do That? discusses twenty peculiar feline habits that have puzzled cat owners since the first semi-domesticated cat plopped a dead baby dodo on a caveman’s doorstep! Why do cats bring us mangled mice as gifts? How and why does a cat purr? Why do cats land on their feet? (Do they always land on their feet?) These questions and others are explored and sometimes resolved in an entertaining and instructive format. More than good fun, owners will discover the reasons behind common behavioral problems, including litter box accidents, furniture scratching, spraying, and more. Feline facts and training ideas plus lots of funny cat photos complete this Simple Solutions book.",
        "Category": " Pets , Cats , General",
        "Publisher": "Lumina Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "The March Up: Taking Baghdad with the 1st Marine Division",
        "Authors": "By West, Bing, Smith, Ray L., and West, Francis J.",
        "Description": "Chronicles the actions and efforts of the 1st Marine Division on their 22-day march into Baghdad, reporting firsthand accounts of strategic plans, failures, and ultimately, victory.",
        "Category": " Political Science , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Christian Mysteries (Sacred Symbols Series)",
        "Authors": "By Thames & Hudson",
        "Description": "The Sacred Symbols Series: An inspirational and innovative series that explores the signs and symbols of different cultures and civilizations. Accessible and informative, these books are the perfect introduction to the ancient, universal wisdoms of mankind. The overwhelming influence of Christianity as a religion replete with significant dates and symbols is nowhere better demonstrated than in the approaching celebrations for the millennium. People the world over, of every creed, will partake in events that draw their meaning from Christian belief and symbolism. This exquisitely illustrated introductory volume illuminates many of the mysteries of the Christian church, from the symbols of Christmas to the Holy Grail, from the Stigmata to the origin of the Black Madonnas, to bring home the richness and complexity of a body of belief that has substantially shaped our daily lives.",
        "Category": " Religion , General",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Alphabet Soup",
        "Authors": "By Sis, Peter (ILT) and Banks, Kate",
        "Description": "Illus. in full color. \"A fantasy-adventure takes place at the lunch table when a disgruntled boy refuses to eat his soup and daydreams instead. His reverie is shaped by the letters he pulls out of his soup, forming words that come alive: bear, sword, and so on. Imaginative and fresh.\"--Booklist.",
        "Category": " Juvenile Fiction , Concepts , Alphabet",
        "Publisher": "Dragonfly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "The Houdini Box",
        "Authors": "By Selznick, Brian",
        "Description": "Victor is forever trying to escape from locked trunks, walk through walls, and perform any number of Houdini's astonishing magic tricks...without success. Then -- amazingly -- he actually meets his idol, and begs Houdini to explain himself. A mysterious locked box is the magician's only answer, and Victor is left to wonder: Does the box contain the secrets to the most famous magic tricks ever performed?",
        "Category": " Juvenile Fiction , Biographical , United States",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Fiery Foods That I Love",
        "Authors": "By Prudhomme, Paul",
        "Description": "Put on your apron, sharpen your knives, and get fired up to go cooking! Paul Prudhomme, America's favorite chef, invites you to try some of the greatest flavors the world has to offer. You'll find them in unusual and exciting combinations in Chef Paul Prudhomme's Fiery Foods That I Love.From dark and savory tamari to the crisp brightness of ginger, from peanuts to plantains, every bite explodes with Chef Paul's own particular magic.\"Food is my passion, and my mission in life is to make your dinner better. To be exciting, food has to have several levels of taste and carry you away with flavor and delight.\" And boy, does he succeed in tempting your every taste bud in each and every course. He cooks up great bean breads and fried stuffed bread pockets; soups that soar; fritters; sauces and relishes; superlative chicken, fish, and meat entrees; beans and rice with spice; vivacious vegetables; and, of course, Chef Paul leaves room for dessert, including some seasoned pie crusts, a first for him. Here is food that makes your day. Here's where the addition of a paste of ground pecans and coffee makes magic of sautéed chicken; where wonderful dark, rich black beans find their way into a loaf of bread; and plantains make sweet and tender a perfect pork roast, What about chiles? Chef Paul will be glad you asked. He feels so strongly about chiles that he has added a special\"Notes from the Test Kitchen\" to introduce you to some of the many varieties. Chile peppers add awesome underlying flavor, and Chef Paul promises to make ground chile peppers as permanent a part of the way you cook as salt and pepper.Chef Paul has traveled around the globe, brought back its flavors, and dreamed them into such mouthwatering, soul-satisfying recipes as Fire-Roasted Garlic Bread; Fennel and Split Pea Soup; Fried Eggplant coated in sesame seeds; Pepper Tomato Shrimp; Sweet Beef and Fresh Chiles; Smothered Potatoes, Cabbage, and Andouille; and much, much more. And he's even added his \"Too Hot for Mrs. Podunk\" recipes for those of you hungry for five-alarm flavor. Those in search of Chef Paul's favorites, just look for his trademark cap.With Chef Paul Prudhomme's Fiery Foods That I Love, you'll cook meals that are so flavorful they'll lift your spirits. And you'll find yourself going back to them time and time again.",
        "Category": " Cooking , Specific Ingredients , Herbs, Spices, Condiments",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Twin to Twin",
        "Authors": "By Courtin, Thierry (ILT) and O'Hair, Margaret",
        "Description": "Double born. Twice the blessing.  Double kids. Twice the messing.  Twins mean double the kisses and double the fun. It's double the joy for everyone!",
        "Category": " Juvenile Fiction , Family , Siblings",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "How I Write",
        "Authors": "By Evanovich, Janet and Evanovich, Alex",
        "Description": "How many people would kill to be a bestselling novelist? Especially one like Janet Evanovich.Writers want to know how a bestselling author thinks, writes, plans, and dreams her books. And they are primed for a book from Janet Evanovich that tells, in a witty Q&A format:- How she comes up with such remarkable characters- How she nails the perfect name every time- How she finds out insider details- Just how she sets up those masterful plots- What the life of a full-time writer is really like- What she'd tell an aspiring author about the publishing industry- And much, much more!How I Write details the elements of writing and publishing a novel, and addresses all categories of fiction-from mystery/thriller/action titles to romance; from stand-alone narratives to series. It offers practical and inspiring advice on such subjects as structuring a plot and handling rejection. And it combines one of today's most successful fiction writers with Ina Yalof, a published non-fiction writer who teaches creative fiction. HOW I WRITE is the perfect reference for anyone looking to improve their writing, and for those fans who are hungry to find out more about just how Janet Evanovich ticks.",
        "Category": " Language Arts & Disciplines , Writing , Authorship",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Captain Cat: Story and Pictures (An I Can Read Book)",
        "Authors": "By Hoff, Syd",
        "Description": "A cat makes friends with a soldier and learns about military life when he joins the army",
        "Category": " Juvenile Fiction , Historical , Military & Wars",
        "Publisher": "Harpercollins Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Bloodline of the Holy Grail: the Hidden Lineage of Jesus Revealed",
        "Authors": "By Gardner, Laurence",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes and Noble Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Diary of a Wimpy Kid Rodrick Rules",
        "Authors": "By Kinney, Jeff",
        "Description": "The highly anticipated sequel to the #1 NEW YORK TIMES bestselling book! Secrets have a way of getting out, especially when a diary is involved. Whatever you do, don’t ask Greg Heffley how he spent his summer vacation, because he definitely doesn’t want to talk about it. As Greg enters the new school year, he’s eager to put the past three months behind him . . . and one event in particular. Unfortunately for Greg, his older brother, Rodrick, knows all about the incident Greg wants to keep under wraps. But secrets have a way of getting out . . . especially when a diary is involved. Diary of a Wimpy Kid: Rodrick Rules chronicles Greg’s attempts to navigate the hazards of middle school, impress the girls, steer clear of the school talent show, and most important, keep his secret safe. F&P level: T",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Amulet Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "O Congress",
        "Authors": "By Riegle, Donald",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Strategies That Work: Teaching Comprehension for Understanding and Engagement",
        "Authors": "By Harvey, Stephanie and Goudvis, Anne",
        "Description": "Since its publication in 2000, Strategies That Work has become an indispensable resource for teachers who want to explicitly teach thinking strategies so that students become engaged, thoughtful, independent readers.  In this revised and expanded edition, Stephanie and Anne have added twenty completely new comprehension lessons, extending the scope of the book and exploring the central role that activating background knowledge plays in understanding. Another major addition is the inclusion of a section on content literacy which describes how to apply comprehension strategies flexibly across the curriculum. The new edition is organized around four sections:Part I highlights what comprehension is and how to teach it, including the principles that guide practice, a review of recent research, and a new section on assessment. A new chapter, Tools for Active Literacy: The Nuts and Bolts of Comprehension Instruction, describes ways to engage students in purposeful talk through interactive read alouds,  guided discussion and written response.Part II contains lessons and practices for teaching comprehension. A new first chapter emphasizes the importance of teaching students to monitor their understanding before focusing on specific strategies. Five lessons on monitoring provide a sound basis for launching comprehension instruction. At the end of each strategy chapter, the authors outline learning goals and ways to assess students' thinking, sharing examples of student work, and offering suggestions for differentiating instruction.Part III, Comprehension Across the Curriculum is new. Comprehension strategies are essential for content-area reading, where information can be challenging, and presented in unfamiliar formats. This section includes chapters on social studies and science reading, topic study research, textbook reading and the genre of test reading.Part IV shows that kids need books they can sink their teeth into and the updated appendix section recommends a rich diet of fiction and nonfiction, short text, kid's magazines, websites and journals that will assist teachers as they plan and design comprehension instructionThrough its focus on instruction that is responsive to kids' interests and learning needs, the first edition of Strategies That Work helped transform comprehension instruction for teachers across the country. For them, this new edition will be a welcome extension of that work. Those coming to it for the first time will find a current and essential resource. When readers use these strategies, they enjoy a more complete, thoughtful reading experience. Engagement is the goal. When kids are engaged in their reading they enhance their understanding, acquire knowledge, and learn from and remember what they read. And best yet, they will want to read more!",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Pearson Prof. Growth",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Profiting from Real Estate Rehab",
        "Authors": "By Brassfield, Sandra M.",
        "Description": "Now, from Sandra M. Brassfield and the experts at the Real Estate Rehab Group, Ltd.? Profiting from Real Estate Rehab The first complete guide to finding, financing, fixing, and selling rehab property for big profits? Whether you?re interested in rehabilitating properties for quick profit, increasing the value of your primary residence, or rehabilitating for long-term real estate income, Profiting from Real Estate Rehab is one investment opportunity you simply can?t afford to pass up. This is the first and only step-by-step guide to finding, financing, rehabilitating, and reselling \"fixer\" properties, and it will significantly improve your chances of success by offering detailed information on:Neighborhood, project analysis, and red flags to avoidHow to calculate your \"top offer\" formula and how to get an offer accepted quicklyProven strategies for controlling your rehab budget and your contractorHow to assemble your team of experts when building a rehab businessHow to interview a realtor, a contractor, and a lender",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Funny Walks",
        "Authors": "By Ayliffe, Alex (ILT) and Hindley, Judy",
        "Description": "Explores the different ways humans and animals walk and move along",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Immigrant Voices: New Lives in America, 1773-1986",
        "Authors": "By Dublin, Thomas (EDT)",
        "Description": "A classroom staple, Immigrant Voices: New Lives in America, 1773-2000 has been updated with writings that reflect trends in immigration to the United States through the turn of the twenty-first century. New chapters include a selection of letters from Irish immigrants fleeing the famine of the 1840s, writings from an immigrant who escaped the civil war in Liberia during the 1980s, and letters that crossed the U.S.-Mexico border during the late 1980s and early '90s. With each addition editor Thomas Dublin has kept to his original goals, which was to show the commonalities of the U.S. immigrant experience across lines of gender, nation of origin, race, and even time.",
        "Category": " Social Science , Emigration & Immigration",
        "Publisher": "University of Illinois Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Somewhere In the World Right Now (Rise and Shine)",
        "Authors": "By Schuett, Stacey",
        "Description": "School Library Journal called Stacey Schuett's stunning authorial debut \"a book that is perfect for sparking an interest in geography, emphasizing the amazing concept that at the same moment we are getting ready to sleep, other people are starting a new day.\" And in a starred review, Publishers Weekly added, \"Schuett proves as nimble with words as with a paintbrush.\"  It's a good-night wish that circles the globe.",
        "Category": " Juvenile Fiction , People & Places , General",
        "Publisher": "Dragonfly Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Whoever You Are (Reading Rainbow Books)",
        "Authors": "By Fox, Mem and Staub, Leslie (ILT)",
        "Description": "Every day all over the world, children are laughing and crying, playing and learning, eating and sleeping. They may not look the same. They may not speak the same language. Their lives may be quite different. But inside, they are all alike. Stirring words and bold paintings weave their way around our earth, across cultures and generations. At a time when, unfortunately, the lessons of tolerance still need to be learned, Whoever You Are urges us to accept our differences, to recognize our similarities, and-most importantly-to rejoice in both.",
        "Category": " Juvenile Fiction , People & Places , General",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Last Climb: The Legendary Everest Expeditions of George Mallory",
        "Authors": "By Breashears, David and Salkeld, Audrey",
        "Description": "Describes Mallory's final expedition to Mount Everest in 1924, the mystery surrounding his disappearance, and the discovery of his remains in 1999",
        "Category": " Sports & Recreation , Mountaineering",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The side of the angels,",
        "Authors": "By McLaughlin, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "A.A. Knopf",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "What's It Like to Be a Ballet Dancer",
        "Authors": "By Craig, Janet",
        "Description": "Follows a ballerina as she rehearses for an upcoming ballet, teaches a class of young dancers, and dances in an evening performance.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Charting Your Goals: Personal Life-Goals Planner",
        "Authors": "By Dahl, Dan and Sykes, Randolph",
        "Description": "Points the way toward identifying patterns of success and failure and ideas about money, power, and time",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Jumpstart 1st Gr Early Reader: Wild Weather Day",
        "Authors": "By Duendes del Sur (ILT) and Stamper, Judith Bauer",
        "Description": "The JumpStart gang learn all about a variety of weather topics, including rain, hail, thunder, and sunshine, during a storm.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Tonka: Building The New Road",
        "Authors": "By Petruccio, Steven James (ILT), Korman, Justine, and Tonka Corporation (COR)",
        "Description": "A new story in a best-selling series follows the action of construction workers and their machines as they build a new road by setting the road route, breaking the ground, and smoothing the surface. Original.",
        "Category": " Juvenile Fiction , Transportation , Cars & Trucks",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Guide to Military Installations: 3rd Edition",
        "Authors": "By Cragg, Dan",
        "Description": "Describes the facilities at the American Army, Navy, Air Force, and Marine installations in the United States and foreign countries",
        "Category": "",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Impulse (Contemporary Romantic Thriller)",
        "Authors": "By Coulter, Catherine",
        "Description": "A journalist's quest for revenge takes her to a private Caribbean island in this contemporary suspense novel from #1 New York Times bestselling author Catherine Coulter.When Pulitzer Prize winning journalist Rafaella Holland discovers that her “real” father is powerful arms dealer Dominick Giovanni, all she can think about is vengeance. Vengeance for what he did to her now comatose mother. To gather enough proof to send him to prison for the rest of his miserable life, Rafaella will have to travel to the private island compound in the Caribbean where he runs his operations.  Marcus Devlin manages the resort on Giovanni’s Island, a private playground for the wealthy and powerful. He’s very good at what he does, but Rafaella wonders if he’s really what he seems. As Rafaella and Marcus grow closer, events threaten to spin out of control when their small world on Giovanni’s Island starts to implode...",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Organization Development: A Process of Learning and Changing, 2nd Edition",
        "Authors": "By Burke, W. Warner",
        "Description": "",
        "Category": " Business & Economics , Skills",
        "Publisher": "Financal Times Management",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "An Introduction to Human Communication: Understanding and Sharing",
        "Authors": "By Pearson, Judy C. and Nelson, Paul E.",
        "Description": "",
        "Category": " Language Arts & Disciplines , Communication",
        "Publisher": "McGraw-Hill College",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "A general systems philosophy for the social and behavioral sciences (The International library of systems theory and philosophy)",
        "Authors": "By Sutherland, John W",
        "Description": "",
        "Category": "",
        "Publisher": "Braziller",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Mastering Church Management",
        "Authors": "By Anderson, Leith, Cousins, Don, and Dekruyter, Arthur",
        "Description": "The Mastering Ministry Series covers the various challenges of a ministry encounters and teaches how to deal with them-one subject at a time. Mastering Ministry is a perfect \"survival guide\" for today's pastor addressing relevant topics such as worship, preaching, controversies, evangelism, church management, pastoral care, fundraising and personal growth.",
        "Category": " Religion , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "The World That Shaped the New Testament",
        "Authors": "By Roetzel, Calvin J.",
        "Description": "",
        "Category": " Religion , Philosophy",
        "Publisher": "John Knox Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Bipolar Disorder: A Guide for Patients and Families",
        "Authors": "By Mondimore, Francis Mark",
        "Description": "Discusses the symptoms and diagnosis of bipolar disorder; explains the advantages, disadvantages, and side effects of various treatments; and explains how lifestyle changes can contribute to a better quality of life",
        "Category": " Psychology , Psychopathology , General",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Understanding the Bible (Layman's theological library)",
        "Authors": "By Fred J Denbeaux",
        "Description": "",
        "Category": "",
        "Publisher": "Westminster Press",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "The Family Way",
        "Authors": "By Krentz, Jayne Ann",
        "Description": "Unwilling to force her live-in love Case McCord into a proposal of marriage, a pregnant Pru Kenyon decides to walk away from the man she loves, not telling him that she is expecting his baby, but she never bargained on how much Case is willing to do for love. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Mira",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "My Detachment: A Memoir",
        "Authors": "By Kidder, Tracy",
        "Description": "My Detachment is a war story like none you have ever read before, an unromanticized portrait of a young man coming of age in the controversial war that defined a generation. In an astonishingly honest, comic, and moving account of his tour of duty in Vietnam, master storyteller Tracy Kidder writes for the first time about himself. This extraordinary memoir is destined to become a classic.Kidder was an ROTC intelligence officer, just months out of college and expecting a stateside assignment, when his orders arrived for Vietnam. There, lovesick, anxious, and melancholic, he tried to assume command of his detachment, a ragtag band of eight more-or-less ungovernable men charged with reporting on enemy radio locations. He eventually learned not only to lead them but to laugh and drink with them as they shared the boredom, pointlessness, and fear of war. Together, they sought a ghostly enemy, homing in on radio transmissions and funneling intelligence gathered by others. Kidder realized that he would spend his time in Vietnam listening in on battle but never actually experiencing it. With remarkable clarity and with great detachment, Kidder looks back at himself from across three and a half decades, confessing how, as a young lieutenant, he sought to borrow from the tragedy around him and to imagine himself a romantic hero. Unrelentingly honest, rueful, and revealing, My Detachment gives us war without heroism, while preserving those rare moments of redeeming grace in the midst of lunacy and danger. The officers and men of My Detachment are not the sort of people who appear in war movies–they are the ones who appear only in war, and they are unforgettable.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Random House",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "September 11, 2001: A Time for Heroes: A Tribute to American Faith, Guts, and Patriotism",
        "Authors": "By Wubbels, Lance",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Destiny Image Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "On Strategy : The Vietnam War in Context",
        "Authors": "By Summers, Harry G.",
        "Description": "",
        "Category": "",
        "Publisher": "US Army War College, 1981.",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Fly in the Buttermilk: The Life Story of Cecil Reed (Singular Lives)",
        "Authors": "By Donovan, Priscilla and Reed, Cecil A.",
        "Description": "",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "University Of Iowa Press",
        "Price Starting With ($)": "13.63",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "You are Never Alone",
        "Authors": "By Charles L. Allen",
        "Description": "",
        "Category": "",
        "Publisher": "F.H. Revell Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Decorating with Architectural Details",
        "Authors": "By Schmidt, Philip and Walker, Jessie (PHT)",
        "Description": "Decorating with Architectural Details offers the latest inspirational ideas for the most popular design trend in today's market. Incorporating classic design elements such as mantels, window seats, shelving, and more, homeowners learn how to turn a humdrum room into a distinctive living space. Readers can create a custom look for any room using the numerous style concepts. Hundreds of lavish photographs by renowned photographer Jessie Walker capture the inspiration and excitement of details and design elements in real-world settings.",
        "Category": " House & Home , Decorating",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "The New Smart Approach to Kitchen Design (New Smart Approach Series)",
        "Authors": "By Maney, Susan",
        "Description": "The New Smart Approach® to Kitchen Design explains everything a homeowner needs to know to design and decorate a kitchen.  The book helps the reader to think like a professional and includes advice for hiring design and construction professionals, shopping for materials and appliances, space planning, lighting, choosing cabinets and planning storage, and decorating with style.",
        "Category": " House & Home , Design & Construction",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "202 Science Investigations: Exciting Adventures In Earth, Life, And Physical Sciences (Kids' Stuff)",
        "Authors": "By Frank, Marjorie",
        "Description": "Here are 202 easy-to-do investigations in life, physical, earth, and space science. Each individual or group activity provides a complete list of the everyday materials needed, as well as comprehensive, step-by-step directions.",
        "Category": " Science , Experiments & Projects",
        "Publisher": "Incentive Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "How To Make Money As A Mystery Shopper",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Alpha Publishing",
        "Price Starting With ($)": "5.46",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Spelling Secrets!",
        "Authors": "By Kellaher, Karen",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "40 Reproducible Forms for the Writing Traits Classroom (Scholastic Teaching Strategies, Grades 3 and Up)",
        "Authors": "By Culham, Ruth and Wheeler, Amanda",
        "Description": "From the author of 6+1 Traits of Writing: The Complete Guide comes this collection of essential forms for assessing students, planning instruction, communicating with parents, and teaching forms of writing. From handy rubrics to weekly planning sheets to letters for encouraging writing at home, all the tools teachers need to make the most of the model are here, with clear guidelines for using them.  For use with Grades 3 and Up.",
        "Category": " Education , Teaching Methods & Materials , Language Arts",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Literature Circles: Voice and Choice in the Student-Centered Classroom",
        "Authors": "By Daniels, Harvey",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Stenhouse Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "MATH AND LITERATURE (K-3): BOOK ONE",
        "Authors": "By Burns, Marilyn",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , Mathematics",
        "Publisher": "Math Solutions Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Mountain Passages",
        "Authors": "By Bernstein, Jeremy",
        "Description": "Emotional, physical, aesthetic and historical aspects of mountain living as perceived by a reporter/climber with profiles of adventures and dangers encountered by skiers and climbers in France's Chamonix Valley",
        "Category": " Travel , General",
        "Publisher": "Touchstone Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Action Research: A Guide for the Teacher Researcher",
        "Authors": "By Mills, Geoffrey E.",
        "Description": "Note: This is the bound book only and does not include access to the Enhanced Pearson eText. To order the Enhanced Pearson eText packaged with a bound book, use ISBN 0133387445.Born of the author's own experience working with teachers and principals,Action Research, 5/e, provides a research-based step-by-step outline of how to do action research. The author guides teachers and administrators through the action research process via numerous concrete illustrations; positioning it as a fundamental component of teaching. The Enhanced Pearson eText features embedded video.From reviews of the book: “Mills’ writing style is informative, direct, and personalized and his expertise as a researcher is evident throughout the textbook. He fully understands the uniqueness of teacher-centered research. . . . The language and the illustration cater to the classroom research contexts and it is easy to understand and apply.”—Adel Al-Bataineh, Illinois State University “The book emphasizes the importance of reflection and creating an action plan. . . . Examples of action research papers are included. There are study sites, videos, slides and other supplemental materials available for the students to consult for ancillary learning. The writing style is clear, interesting and engaging. Throughout the text, Mills offers the reader a research scenario that helps to position him or her around the theme of the chapter and context of the research phase. This helps to alleviate some of the anxiety students of action research may experience as they begin each aspect of the action research process.”—Beverly Melenyzer, California University of Pennsylvania“[T]he survey examples, SurveyMonkey, and direct observation examples are very good, as well as the informal interview, making records, [and] data collection techniques. . . . [T]he section on re-aligning the focus and action research plan is very good. I find my students doing this as they are doing their literature review and understanding that they need to narrow the scope of their research. I like the example of doing AR in Ch. 6. . . . I like the inclusion of the data analysis, sample interview and other models of how to analyze data. . . . The key strengths of the project are the authentic examples of AR.”—Mary Frances Agnello, Texas Tech UniversityFeatures Balanced coverage of data collection and analysis techniques for qualitative, quantitative and mixed methodsChapter 4, Data Collection Techniques, covers collection techniques for the most frequently used qualitative and quantitative data, including observations, interviews, teacher-made tests, and standardized test data.Chapter 6, Data Analysis and Interpretation, guides students through data analysis and provides techniques, coding guidelines, and examples for analyzing both quantitative and qualitative data.Inclusion throughout the text of digital research tools that can be used by action researchers through each phase of the a",
        "Category": " Education , Research",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Country House Garden: A Grand Tour",
        "Authors": "By Jackson-Stops, Gervase and Pipkin, James (PHT)",
        "Description": "Offers a historical appraisal of the English gardener's search for Arcadia and examines various aspects of the country house garden, including parterres, conservatories, gates, mazes, terraces, vases and urns, and cascades and fountains",
        "Category": " Gardening , General",
        "Publisher": "New York Graphic Society",
        "Price Starting With ($)": "7.1",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Living on the Ragged Edge (Insight for Living Bible Study Guides)",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": "",
        "Publisher": "W Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "American Creation: Triumphs and Tragedies at the Founding of the Republic",
        "Authors": "By Ellis, Joseph J.",
        "Description": "From the prizewinning author of the best-selling Founding Brothers and American Sphinx, a masterly and highly ironic examination of the founding years of our country. The last quarter of the eighteenth century remains the most politically creative era in American history, when a dedicated and determined group of men undertook a bold experiment in political ideals. It was a time of triumphs; yet, as Joseph J. Ellis makes clear, it was also a time of tragedies—all of which contributed to the shaping of our burgeoning nation.From the first shots fired at Lexington to the signing of the Declaration of Independence to the negotiations for the Louisiana Purchase, Ellis guides us through the decisive issues of the nation’s founding, and illuminates the emerging philosophies, shifting alliances, and personal and political foibles of our now iconic leaders—Washington, Jefferson, Madison, Hamilton, and Adams. He casts an incisive eye on the founders’ achievements, arguing that the American Revolution was, paradoxically, an evolution—and that part of what made it so extraordinary was the gradual pace at which it occurred. He shows us why the fact that it was brought about by a group, rather than by a single individual, distinguished it from the bloodier revolutions of other countries, and ultimately played a key role in determining its success. He explains how the idea of a strong federal government, championed by Washington, was eventually embraced by the American people, the majority of whom had to be won over, as they feared an absolute power reminiscent of the British Empire. And he details the emergence of the two-party system—then a political novelty—which today stands as the founders’ most enduring legacy.But Ellis is equally incisive about their failures, and he makes clear how their inability to abolish slavery and to reach a just settlement with the Native Americans has played an equally important role in shaping our national character. He demonstrates how these misjudgments, now so abundantly evident, were not necessarily inevitable. We learn of the negotiations between Henry Knox and Alexander McGillivray, the most talented Indian statesman of his time, which began in good faith and ended in disaster. And we come to understand how a political solution to slavery required the kind of robust federal power that the Jeffersonians viewed as a betrayal of their most deeply held principles.With eloquence and insight, Ellis strips the mythic veneer of the revolutionary generation to reveal men both human and inspired, possessed of both brilliance and blindness. American Creation is a book that delineates an era of flawed greatness, at a time when understanding our origins is more important than ever.",
        "Category": " History , United States , Revolutionary Period (1775-1800)",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Lost Explorer: Finding Mallory on Mt. Everest",
        "Authors": "By Roberts, David and Anker, Conrad",
        "Description": "On June 8, 1924, George Leigh Mallory and Andrew Irvine disappeared somewhere near the summit of Mount Everest, leaving open the tantalizing question of whether they had reached the summit of Everest twenty-nine years before Edmund Hillary and Tenzing Norgay. In 1999, climber Conrad Anker discovered Mallory's body on Everest and helped solve one of the greatest mysteries in the history of adventure and exploration. In The Lost Explorer,  Anker and historian David Roberts craft a dramatic account of the expeditions of 1924 and 1999, and ultimately capture the passion and spirit of two men driven to test themselves against nature at its most brutal.",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Making Folk Toys and Weather Vanes",
        "Authors": "By Pierce, Sharon",
        "Description": "",
        "Category": "",
        "Publisher": "Sterling*+ Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Hungarian for travellers",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "distributed by Macmillan Pub. Co.]",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Six Fundamentals of Success: The Rules for Getting It Right for Yourself and Your Organization",
        "Authors": "By Levine, Stuart R.",
        "Description": "“The business environment is so uncertain that no can afford to miss a step.  Some forces are out of out control–recessions, cutbacks, layoffs.  But being the best we can be at our job is not.  We have total control over that.”--From the Introduction of The Six Fundamentals of SuccessEveryone has his or her own style at work.  But if you look at the people who are successful, you’ll see similarities.  They always do the most important things first--they know how to prioritize.   They can sum up how their company stands out from the pack in only a few minutes.  They work with a sense of urgency, every day.  These are the kinds of qualities and habits that never go out of style.  Moreover, they are crucial to any successful career and life.  By pursuing them regularly, you and your company are more likely to get ahead.In The Six Fundamentals of Success, CEO and business consultant Stuart Levine spells out exactly how to practice the constants of business success--whether it’s satisfying customers, developing strong relationships, or communicating clearly--through six fundamental principles, gained from decades of experience working with top executives.  But it’s the way Levine zeroes in on these fundamentals--add value, communicate well, deliver results, act with integrity, invest in relationships, and gain perspective--and brings them to life through dozens of pithy, to-the-point rules that makes the book so practical and useful.  With no-nonsense lessons like “Face time counts,” “Do breakfast,” and “Share the good news--and the bad,” Levine offers concrete examples of how to behave, respond, and motivate others. Aimed at business people and entrepreneurs at all levels, whether they work in  companies large or small, The Six Fundamentals of Success provides the smart, action-oriented guidance people need in today’s challenging climate.",
        "Category": " Business & Economics , Reference",
        "Publisher": "Doubleday Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    }
]