[
    {
        "Title": "Zoya",
        "Authors": "By Steel, Danielle",
        "Description": "Against the backdrop of the Russian Revolution and World War I Europe, Zoya, young cousin to the Tsar, flees St. Petersburg to Paris to find safety. Her entire world forever changed, she faces hard times and joins the Ballet Russe in Paris. And then, when life is kind to her,  Zoya moves on to a new and glittering life in New York. The  days of ease are all too brief as the Depression strikes, and she loses everything yet again. It is her career, and the man she meets in the course of it, which ultimately save her, as she rebuilds her life through the war years and beyond. And it is  her family that comes to mean everything to her. From the roaring twenties to  the 1980's, Zoya remains a rare and spirited  woman whose legacy will live on.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "The Red Badge of Courage (Bantam Classics)",
        "Authors": "By Crane, Stephen",
        "Description": "First published in 1895, America's greatest novel  of the Civil War was written before 21-year-old  Stephen Crane had \"smelled even the powder of a  sham battle.\" But this powerful psychological  study of a young soldier's struggle with the  horrors, both within and without, that war strikes the  reader with its undeniable realism and with its  masterful descriptions of the moment-by-moment riot  of emotions felt by me under fire. Ernest  Hemingway called the novel an American classic, and  Crane's genius is as much apparent in his sharp,  colorful prose as in his ironic portrayal of an episode  of war so intense, so immediate, so real that the  terror of battle becomes our own ... in a  masterpiece so unique that many believe modern American  fiction began with Stephen Crane.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "The Seagull Reader: Poems",
        "Authors": "By Kelly, Joseph (EDT)",
        "Description": "",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "My Ántonia (Dover Thrift Editions)",
        "Authors": "By Cather, Willa",
        "Description": "My Ántonia evokes the Nebraska prairie life of Willa Cather's childhood, and commemorates the spirit and courage of immigrant pioneers in America. One of Cather's earliest novels, written in 1918, it is the story of Ántonia Shimerda, who arrives on the Nebraska frontier as part of a family of Bohemian emigrants. Her story is told through the eyes of Jim Burden, a neighbor who will befriend Ántonia, teach her English, and follow the remarkable story of her life.Working in the fields of waving grass and tall corn that dot the Great Plains, Ántonia forges the durable spirit that will carry her through the challenges she faces when she moves to the city. But only when she returns to the prairie does she recover her strength and regain a sense of purpose in life. In the quiet, probing depth of Willa Cather's art, Ántonia's story becomes a mobbing elegy to those whose persistence and strength helped build the American frontier.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Abraham Lincoln (Pocket Biographies)",
        "Authors": "By Pitt, H. G.",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Sutton Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Dictionary of Computers, The Penguin (Penguin reference books)",
        "Authors": "By Graham, John, Williamson, Robin",
        "Description": "",
        "Category": "",
        "Publisher": "Puffin",
        "Price Starting With ($)": "13.46",
        "Publish Date": {
            "Month": "May",
            "Year": "1970"
        }
    },
    {
        "Title": "While the Candles Burn",
        "Authors": "By Goldin, Barbara Diamond and Greenstein, Elaine (ILT)",
        "Description": "Reflecting the key themes of the Festival of Lights, a selection of eight original and retold stories reflects on such timeless ideas as commitment, courage, miracles, religious freedom, faith, and peace. Reprint.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Hanukkah",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Reasonable Affliction: 1001 Love Poems to Read to Each Other",
        "Authors": "By Berk, Sally Ann (EDT) and Wakeman, James Gordon (EDT)",
        "Description": "This beautifully produced volume offers an illustrated and diverse collection of poems for people in love to read to each other. Reflections on matters of the heart from Shakespeare to Jagger, Raymond Carver and Emily Bronte, from Sappho to e. e. cummings, Elizabeth Bishop and Charles Bukowski, and two hundred other poets. Both classic and contemporary poems are reprinted in their entirety. A delightful keepsake for times of romance, longing, heartbreak, weddings, engagements, and crushes.",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Batbaby Finds a Home (Step-Into-Reading, Step 3)",
        "Authors": "By Quackenbush, Robert M. and Quackenbush, Robert M. (ILT)",
        "Description": "When their home is demolished, Batbaby and his family take to the skies to find another place to settle, but after having no luck night after night, Batbaby is thrilled when he locates a house that was made just for them. Simultaneous.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Angel & the Donkey",
        "Authors": "By Paterson, Katherine and Koshkin, Alexander (ILT)",
        "Description": "Near the Euphrates River, as Moses leads the Israelites in search of their homeland, a stubborn donkey delivers a message from an angel and helps her master save the Israelites from the King of Moab, in a richly illustrated tale from the Hebrew Bible. Reprint.",
        "Category": " Juvenile Fiction , Religious , General",
        "Publisher": "Sandpiper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Embers",
        "Authors": "By Marai, Sandor and Janeway, Carol Brown (TRN)",
        "Description": "Originally published in 1942 and now rediscovered to international acclaim, this taut and exquisitely structured novel by the Hungarian master Sandor Marai conjures the melancholy glamour of a decaying empire and the disillusioned wisdom of its last heirs.  In a secluded woodland castle an old General prepares to receive a rare visitor, a man who was once his closest friend but who he has not seen in forty-one years.  Over the ensuing hours host and guest will fight a duel of words and silences, accusations and evasions. They will exhume the memory of their friendship and that of the General’s beautiful, long-dead wife. And they will return to the time the three of them last sat together following a hunt in the nearby forest--a hunt in which no game was taken but during which something was lost forever. Embers is a classic of modern European literature, a work whose poignant evocation of the past also seems like a prophetic glimpse into the moral abyss of the present",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Blizzards and Snowstorms of Washington, D.C: A Photographic History of Washington's Most Memorable Winter Storms",
        "Authors": "By Ambrose, Kevin",
        "Description": "",
        "Category": "",
        "Publisher": "Historical Enterprises",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "No Anchovies on the Moon: Three Score and Ten Washington Pictures and Poems",
        "Authors": "By Boswell, Paul",
        "Description": "A million people visit or use the Library of Congress each year. Over 5,000 people work there. For most of the employees, it is more than a job. It is a joy to spend their days in the most exceptional library in the world, home to a precious and priceless Gutenberg Bible as well as yesterday's newspapers - 100 million items in all, including nearly 16 million books, 4 million maps, 41 million manuscript pages, 13 million photographs.For Paul Boswell, from 1936 when he was 23 years old until his retirement in 1984, it was his only place of employment (except for wartime military service) and the continuing inspiration for his poetry and his art. His poetry celebrates the life of a mind nurtured by the books and wisdom of Western civilization. His drawings capture the architecture, fountains, and courtyards of the Library, and other parts of Washington as well. Altogether, Boswell's work represents a unique view of a special place and the pursuit of learning.By the early 1950s, his drawings of the Library of Congress attracted attention from his colleagues and began, as a result, to appear in various library publications. About ten of them hang in the Government Publications Reading Room, one has appeared on the cover of Library Journal, and many of his annual Christmas cards featuring his drawings appear taped to walls and pinned on bulletin boards. The Columbia Historical Society of Washington, D.C., included a chapter of 18 Boswell pictures, \"A Portfolio of Washington Drawings,\" in its 1971-2 Record.The drawings and poetry that appear in this book were created over many years, frequently produced and changed during the creative day Paul Boswell began at three o'clock each morning, long before his regular workday began.",
        "Category": " Poetry , General",
        "Publisher": "Seven Locks Pr",
        "Price Starting With ($)": "25.62",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "national portrait gallery smithsonian institution  permanent collection illustrated checklist",
        "Authors": "By Compiler and Neumaier, Linda T.",
        "Description": "",
        "Category": "",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "19.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Mouse Soup",
        "Authors": "By Lobel, Arnold",
        "Description": "From Arnold Lobel, the beloved author and illustrator of the Newbery Honor and Caldecott Honor award-winning Frog and Toad books.Weasel is ready for his dinner, and poor Mouse is it. Can Mouse stop Weasel from serving up mouse soup for supper? The clever mouse tells the weasel four stories to make the soup tasty—then manages to trick the weasel and get home safely. This Level Two I Can Read is geared toward kids who read on their own but still need a little help.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Days with Frog and Toad (I Can Read, Level 2)",
        "Authors": "By Lobel, Arnold",
        "Description": "Frog and Toad enjoy spending their days together. They fly kites, celebrate Toad's birthday, and share the shivers when Frog tells a scary story. Most of all, they have fun together—every day of the year.Days with Frog and Toad is a Level Two I Can Read book, geared for kids who read on their own but still need a little help.The classic Frog and Toad stories by Arnold Lobel have won numerous awards and honors, including a Newbery Honor (Frog and Toad Together), a Caldecott Honor (Frog and Toad Are Friends), ALA Notable Children’s Book, Fanfare Honor List (The Horn Book), School Library Journal Best Children’s Book, and Library of Congress Children’s Book.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The Adventures of Reddy Fox (Dover Children's Thrift Classics)",
        "Authors": "By Burgess, Thornton W., Kliros, Thea (ILT), and Cady, Harrison (ILT)",
        "Description": "When little Reddy Fox gets too big for his breeches and steals a plump pet hen in broad daylight, the stage is set for an exciting tale as Farmer Brown's boy pursues Reddy with loaded gun and Bowser the Hound. Fortunately, Reddy has wise Granny Fox on his side and, with some timely help from other woodland friends, manages to avoid an unhappy ending.As this timeless fable unfolds, children will delight in Reddy's risky antics and the commotion his behavior causes among Johnny Chuck, Drummer the Woodpecker, Peter Rabbit, and the other inhabitants of the Green Forest. Thornton W. Burgess, author of Old Mother West Wind and many other children's classics, was a master at telling a good story that holds a child's attention while instilling an important lesson in the most painless and enjoyable fashion. First published in 1913, The Adventures of Reddy Fox was one of his finest efforts. In this inexpensive Dover edition, newly reset in large, easy-to-read type, it will delight children (and adults) today, just as it did their grandparents.",
        "Category": " Juvenile Fiction , Animals , Foxes",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Bad Hair Day (Penguin Young Readers, Level 2)",
        "Authors": "By Allen, Joy (ILT) and Hood, Susan",
        "Description": "After her mom gives her a disastrous home haircut, a little girl is convinced she'll have to wear a hat forever. But a trip to the beauty parlor reassures her that she's not the first person to feel this way, and with a few snips from a professional, she's hat-free and proudly showing off her brand-new do!",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Error of Judgment",
        "Authors": "By Dias, Dexter",
        "Description": "Behind a four-inch plate glass window in the hospital wing of an uncompleted prison, a man sits in silence, his hair burned off his skull, his eyes fluttering in a dream state. His lawyer, Nick Downes, waits for his client to speak, to explain why he showed up in a brothel carrying a claw hammer, confessing to a murder in a chalk quarry in Kent. But when the dreamer awakes, Nick Downes will not get the answers he seeks.The body in the quarry was decomposed beyond all recognition, except for the bizarre object found in its gut. While forensic scientists search for clues to the dead man's identity and a beautiful prison psychiatrist tries to unlock the mystery of the defendant's tortured unconscious, another player walks into the game, a woman of extraordinary sensuality who claims to be the defendant's wife. She is Liz Turner, and Nick Downes cannot resist her.As the case of the demented killer goes to trial, Nick begins to realize that both the man he has been sworn to defend and the woman he is obsessed with have dangerous, secret identities. A web of betrayal is being spun around the barrister - and it will leave him fighting for his career, his freedom, and his life.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Pr",
        "Price Starting With ($)": "7.33",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Dead As a Dodo: A Homer Kelly Mystery",
        "Authors": "By Langton, Jane",
        "Description": "Homer Kelly is thrilled to be at Oxford University as a visiting lecturer. He's especially excited about exploring the Oxford University Museum, which is home to many marvels of natural history, including the remains of one of the last dodos.The tranquillity of the ancient university is shattered, however, when a night watchman plunges to his death from the museum's glass roof. No sooner has Homer begun enjoying his professorial adventure abroad than he must once again play part-time detective.As he sets off on his search for answers to this most real and inauspicious death, he also begins a philosophical journey far more challenging than any begun in a classroom, and discovers a crime much more sinister and troubling: God Himself seems dead as a dodo. Who committed murder sublime?Things get even more puzzling when the handsome young local priest commits suicide, leaving a note saying simply, \"The answer is no.\" Apparently Homer's not the only one struggling with the great questions of life.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "13.17",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Countdown (An Eve Duncan Forensics Thriller)",
        "Authors": "By Johansen, Iris",
        "Description": "When it reaches zero, you die.#1 New York Times bestselling author Iris Johansen sets her readers’ pulses racing once again in this relentless psychological thriller of a young woman caught in a maze of secrets and stalked by a merciless killer. The countdown begins the moment you open this riveting novel that only grows more electrifying as the pages turn, more exciting as time runs out. . . .“Don’t kill her. She’s no good to us dead.” These words haunt Jane MacGuire after a shocking attack shatters her world in an instant. Was it a random kidnapping attempt–or the countdown to something far more sinister?Who is after her–and what do they want so badly they’ll kill anyone in their way?  That’s what Jane is determined to find out, without the help of the police, the FBI, or her adoptive parents, forensic sculptor Eve Duncan and her husband, Joe Quinn, of the Atlanta PD–because whoever is after her won’t hesitate to hurt those she loves the most. Now Jane will go on the run with the only man who may be more dangerous than those who are pursuing her. A smuggler, a con man, and who knew what else, Mark Trevor had his own mysterious reasons for wanting to keep Jane safe and out of the hands of a killer obsessed with a two-thousand-year-old mystery that could rock the modern-day world. Orphaned at an early age, Jane grew up the hard way, but she was given a new life, a loving family, and a chance to pursue her interest in one of the greatest archaeological finds ever unearthed. Now someone was trying to destroy that new life before it could even get started. The past is returning with the kind of vengeance that knows no mercy. The countdown has already begun, and it’s approaching zero faster than anyone thinks.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Delivering Quality Service",
        "Authors": "By Zeithaml, Valarie A., Parasuraman, A., and Berry, Leonard L.",
        "Description": "Excellence in customer service is the hallmark of success in service industries and among manufacturers of products that require reliable service. But what exactly is excellent service? It is the ability to deliver what you promise, say the authors, but first you must determine what you can promise. Building on seven years of research on service quality, they construct a model that, by balancing a customer's perceptions of the value of a particular service with the customer's need for that service, provides brilliant theoretical insight into customer expectations and service delivery.For example, Florida Power & Light has developed a sophisticated, computer-based lightening tracking system to anticipate where weather-related service interruptions might occur and strategically position crews at these locations to quicken recovery response time. Offering a service that customers expect to be available at all times and that they will miss only when the lights go out, FPL focuses its energies on matching customer perceptions with potential need. Deluxe Corporation, America's highly successful check printer, regularly exceeds its customers' expectations by shipping nearly 95% of all orders by the day after the orders were received. Deluxe even put U.S. Postal Service stations inside its plants to speed up delivery time.Customer expectations change over time. To anticipate these changes, Metropolitan Life Insurance Company regularly monitors the expectations and perceptions of their customers, using focus group interviews and the authors' 22-item generic SERVQUAL questionnaire, which is customized by adding questions covering specific aspects of service they wish to track.The authors' groundbreaking model, which tracks the five attributes of quality service -- reliability, empathy, assurance, responsiveness, and tangibles -- goes right to the heart of the tendency to overpromise. By comparing customer perceptions with expectations, the model provides marketing managers with a two-part measure of perceived quality that, for the first time, enables them to segment a market into groups with different service expectations.",
        "Category": " Business & Economics , Customer Relations",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Mission Critical: Realizing the Promise of Enterprise Systems",
        "Authors": "By Davenport, Thomas H.",
        "Description": "This is a no-nonsense guide to the benefits and pitfalls of enterprise-wide information systems. How many organizations would doubt the promise of an integrated enterprise system (ES)? Not many, judging by a $15 billion industry. The combination of an ES as a platform for organizational information and Internet technology for gaining access to it adds up to the ideal solution for company-wide data sharing in real time. Not surprisingly, small and large companies worldwide are either considering an ES, in the process of implementing one, or living with the results. Yet, says Tom Davenport, unless managers view ES adoption and implementation as a business decision rather than a technology decision, they may be risking disappointment Mission Critical presents an authoritative and no-nonsense view of the ES opportunities and challenges. Suggesting ESs are not the right choice for every company, the author provides a set of guidelines to help managers evaluate the benefits and risks for their organizations. To be successful, argues Davenport, an organization must make simultaneous changes in its information systems, its business processes, and its business strategy. Such changes are described in detail with extensive examples from real organizations. Bolstering his contention that ESs should be viewed as business vs. technology projects, Davenport spells out the specific business change objectives that should be formulated in advance of ES adoption and monitored throughout its implementation. The first strategic guide to the ES decision, Mission Critical will be indispensable to general managers and information technology specialists at all stages of the implementation process.",
        "Category": " Business & Economics , Information Management",
        "Publisher": "Harvard Business Review Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Crying Heart",
        "Authors": "By Miller, Clara Bernice",
        "Description": "",
        "Category": "",
        "Publisher": "Moody Press",
        "Price Starting With ($)": "7.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "The Goblin Mirror",
        "Authors": "By Cherryh, C. J.",
        "Description": "To the princes of Maggiar, over-mountain was a land they knew only from gran's stories; few people in their little kingdom had ever ventured so far from their valley. But now the wizard Karoly announced that he must make the journey there to seek advice from his witch-sister. For things hadn't been right in Maggiar this last season, not right at all...The princes Tamas and Bogdan were to go with Karoly, along with the huntsman Nikolai. Yuri, the youngest prince, chafed at being left behind. So when Tamas' dog chased after his master, Yuri followed. Soon the young prince had traveled far enough into the woods to wonder if he might not catch up with his brothers after all.His brothers had worries of their own. No sooner were they over-mountain, than their party was ambushed and scattered. The kingdoms they had come to find had all been ravaged. The goblins had declared war.Tamas, separated from the rest, fell in with Ela, a witch's apprentice. He found himself caught up in a battle of magic. For Ela held a shard broken off the goblin queen's mirror, a mere fragment that could wield a magic so strong and unpredictable that no other witch dared touch it. With this single sliver of magic, Ela planned to challenge the goblin queen herself...",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Madwand (Changeling Saga, Bk. 2)",
        "Authors": "By Zelazny, Roger",
        "Description": "",
        "Category": "",
        "Publisher": "Ace",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Chaos and Order: The Gap Into Madness",
        "Authors": "By Donaldson, Stephen R.",
        "Description": "",
        "Category": "",
        "Publisher": "Spectra / Bantam Books",
        "Price Starting With ($)": "14.21",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Mother Earth, Father Sky (Native American Myth and Mankind)",
        "Authors": "By Lowenstein, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "On Liberty (Dover Thrift Editions: Philosophy)",
        "Authors": "By Mill, John Stuart",
        "Description": "Discussed and debated from time immemorial, the concept of personal liberty went without codification until the 1859 publication of On Liberty. John Stuart Mill's complete and resolute dedication to the cause of freedom inspired this treatise, an enduring work through which the concept remains well known and studied.The British economist, philosopher, and ethical theorist's argument does not focus on \"the so-called Liberty of the Will…but Civil, or Social Liberty: the nature and limits of the power which can be legitimately exercised by society over the individual.\" Mill asks and answers provocative questions relating to the boundaries of social authority and individual sovereignty. In powerful and persuasive prose, he declares that there is \"one very simple principle\" regarding the use of coercion in society — one may only coerce others either to defend oneself or to defend others from harm.The new edition offers students of political science and philosophy, in an inexpensive volume, one of the most influential studies on the nature of individual liberty and its role in a democratic society.",
        "Category": " Political Science , Political Ideologies , Democracy",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Prayers and Poems for Christmas",
        "Authors": "By Ideals Publications Inc",
        "Description": "Photographs, poems, and prayers convey the spirit and beauty of the Christmas season",
        "Category": " Religion , Prayerbooks , Christian",
        "Publisher": "Ideals Pubns",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "F.D.R., My Boss",
        "Authors": "By Grace Tully",
        "Description": "",
        "Category": "",
        "Publisher": "C. Scribner's sons",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1949"
        }
    },
    {
        "Title": "Anthropology and Society",
        "Authors": "By Maday, Bela",
        "Description": "",
        "Category": "",
        "Publisher": "The Anthropoligical Society",
        "Price Starting With ($)": "16.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Edge (An FBI Thriller)",
        "Authors": "By Coulter, Catherine",
        "Description": "FBI agent Ford \"Mac\" MacDougal is recovering from injuries he received in a terrorist car bombing when his sister, Jilly, a medical researcher, drives her Porsche off an Oregon cliff - on purpose, it seems. Curiously, even though he was in a hospital bed on the other side of the country, Mac feels as if he were in the car with her as she sails toward the sea.By the time Mac arrives in Portland, Jilly has come out of the coma she's been in for four days. But after only a few hours with her brother, she vanishes without a trace. In searching for her, Mac hears a different story from everyone he encounters. When the local sheriff enlists his aid in the puzzling murder of an elderly resident, Mac doesn't suspect that the case connects to his sister's disappearance.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Big Little Book of Jewish Wit & Wisdom",
        "Authors": "By Berk, Sally Ann (EDT) and Carluccio, Maria (ILT)",
        "Description": "This small, chunky volume presents the witty, wonderful, deadpan and droll insight of the Jewish culture. Chapters on Wisdom, Mitzvahs, Dybbuks, Proverbs, Jokes, Curses, Conventions, Mores (ethics), Love & Marriage, Men & Women, Children & Family provide reflections gleaned from a wealth of ancient, traditional and modern sources. The range of wise observations on the ways of the world, snappy one-liners, stories and expressions captures the spirit of the Jews throughout the centuries. Illustrated with sixty watercolor paintings, The Big Little Book of Jewish Wit & Wisdom will delight and engage even the toughest Jewish mother.Some examples:When we hear a baby laugh, it is the loveliest thing that can happen to us.--Sigmund FreudA child's wisdom is also wisdom.--Yiddish proverbI don't believe in the afterlife, although I am bringing a change of underwear.--Woody AllenMay you lose all your teeth but one, and may that one have a cavity.--Anonymous (Yiddish curse)",
        "Category": " Reference , Quotations",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Italian Neighbors: Or, A Lapsed Anglo-Saxon in Verona",
        "Authors": "By Parks, Tim",
        "Description": "An American expatriate describes life in Verona, the collision between invading surburbia and the die-hard peasant tradition, the architecture, wine bottling, and the Veronese",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "The Complete Book of Steam Cookery",
        "Authors": "By Castle, Coralie",
        "Description": "",
        "Category": "",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Caps for Sale: A Tale of a Peddler Some Monkeys and Their Monkey Business",
        "Authors": "By Slobodkina, Esphyr",
        "Description": "Caps for Sale is a timeless classic beloved by millions...one of the most popular picture books ever published!Children will delight in following the peddler’s efforts to outwit the monkeys and will ask to read it again and again. Caps for Sale is an excellent easy-to-read book that includes repetition, patterns, and colors, perfect for early readers.This tale of a peddler and a band of mischievous monkeys is filled with warmth, humor, and simplicity and also teaches children about problem and resolution.",
        "Category": " Juvenile Fiction , Concepts , Colors",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Audubon Society Book of Wild Animals",
        "Authors": "By Line, Les",
        "Description": "More than one hundred eighty photographs accompany informative essays on generic groups of mammals and on mammals occupying specific types of habitats or sharing particular behavior patterns or physical characteristics",
        "Category": " Science , General",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "8.93",
        "Publish Date": {
            "Month": "November",
            "Year": "1977"
        }
    },
    {
        "Title": "May I Bring a Friend?",
        "Authors": "By De Regniers, Beatrice Schenk and Montresor, Beni (ILT)",
        "Description": "An imaginative boy brings a surprising array of friends to dine at the palace in this Caldecott Medal–winning picture book.One day, a small boy receives a very special invitation—the King and the Queen have invited him to the castle for tea. He accepts, with one question: “May I bring a friend?” “Any friend of our friend is welcome here,” says the King. But their guest’s friend turns out to be someone they never expected! Beatrice Schenk de Regniers’s rhythmic text and the fantastical, jewellike artwork of Beni Montresor have made this book a favorite for more than twenty-five years.",
        "Category": " Juvenile Fiction , Royalty",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Petunia",
        "Authors": "By Duvoisin, Roger",
        "Description": "Petunia, a goose, learns that possessing knowledge doesn't mean carrying a book around constantly.Petunia, the goose, learns that possessing knowledge doesn't mean carrying a book around constantly",
        "Category": "",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Christ Is Born",
        "Authors": "By Nygren, Larissa",
        "Description": "",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Dandelion (Picture Puffin Books)",
        "Authors": "By Freeman, Don",
        "Description": "From the creator of the beloved Corduroy, here is a charming story about being yourselfWhen Dandelion gets an invitation to a party, he's excited. The invitation is extra fancy, so Dandelion decides to get himself all dressed up. But when he gets to the party, no one recognizes him! Fortunately, it all works out in the end, and Dandelion learns an important lesson about being true to who you are.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "The Family Under the Bridge",
        "Authors": "By Williams, Garth (ILT) and Carlson, Natalie Savage",
        "Description": "The heartwarming and memorable Newbery Honor-winning book about finding family in the unlikeliest places, featuring artwork by beloved illustrator Garth Williams. Armand, an old Parisian living on the streets of Paris, relished his solitary life. He begged and did odd jobs for money to keep himself warm and fed, and he liked his carefree life. Then one day just before Christmas, a struggling mother and her three children walked into his life. Though he tried to ignore their troubles, Armand soon found himself caring for the family and sharing his unusual home under the bridge with them. It did not take Armand very long to realize that he had gotten himself ready-made family; one that he loved with all his heart, and one for whom he would have to find a better home than the bridge. Children will treasure this warm and funny adventure of family, freedom, and Santa Claus. The book includes illustrations by Garth Williams, the acclaimed illustrator of E. B. White's Charlotte's Web and Laura Ingalls Wilder's Little House series, among many other books.",
        "Category": " Juvenile Fiction , Social Themes , Homelessness & Poverty",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2019"
        }
    },
    {
        "Title": "Organization and Pathology of Thought: Selected Sources",
        "Authors": "By Rapaport, David",
        "Description": "",
        "Category": "",
        "Publisher": "Columbia University Press",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "Case Studies in Schizophrenia",
        "Authors": "By Clarence G. Schulz, Rose K. Kilgalen",
        "Description": "",
        "Category": "",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "24.27",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Big Book of Jewish Humor",
        "Authors": "By Novak, William (EDT) and Waldoks, Moshe (EDT)",
        "Description": "Presents an amusing accumulation of Jewish jokes, wit, anecdotes, sight gags, satire, and cartoons as well as selections from the works of leading Jewish writers and comedians",
        "Category": " Humor , General",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1981"
        }
    },
    {
        "Title": "The Ultimate Spy Book",
        "Authors": "By Melton, H. Keith and Colby, William (COM)",
        "Description": "From the Civil War to both world wars and into the Cold War, The Ultimate Spy Book reveals what really happened in some of the most daring spying operations in history.Keith Melton has amassed a dazzling collection of spy devices, many never before seen by those outside the world's elite spying agencies. Cameras that look like a pack of cigarettes are just the beginning: this book reveals listening devices, suitcase radios, hidden messages, microdots, assassination devices, and concealed weapons - everything the well-equipped spy could ever need.Discover the combination of quick wits and nerves of steel that makes a good spy. Learn about how spies are chosen and recruited, the training they receive, and the tricks of the trade. All the risks are revealed - and all the rewards.",
        "Category": " True Crime , Espionage",
        "Publisher": "Dorling Kindersley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Country Auction Weekend Book: From Maine to Maryland--A Guide to the Most Popular Country Auction Houses and Barns, Plus Where to Stay, Where to Eat, What to See and Do--All You",
        "Authors": "By Miller, Stephen and Merwin, Janet",
        "Description": "Explains bidding procedures and describes the locations, usual types of merchandise, price levels, and styles of auctioneering of rural auction houses across the northeastern U.S",
        "Category": " Business & Economics , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "13.85",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "You Drive Me Crazy: Love Poems for Real Life",
        "Authors": "By Esselman, Mary D. (EDT) and Velez, Elizabeth Ash (EDT)",
        "Description": "The co-editors of The Hell With Love and Kiss Off apply their trademark wit and humor to a collection designed to help readers rekindle relationships, brush off the inertia of everyday life, or otherwise celebrate romantic love, in a volume that includes pieces by such writers as Louise Gluck and Pablo Neruda. Original.",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Book of Friendship",
        "Authors": "By Rodarte, Mary Grace (EDT) and Hobbing, Diane (ILT)",
        "Description": "Next to family-and often instead of them-friends are the people who keep the world turning round and the sun in the sky. The Book of Friendship is a tribute to these special individuals.The perfect gift for cherished friends, this book combines intimate quotes, favorite stories, and excerpts from poems and novels with classic, nostalgic artwork, capturing the magic of these special relationships. Letters, legends, anecdotes, and even friend-comforting recipes make this an especially appropriate gift book for women.",
        "Category": " Family & Relationships , Friendship",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Little Book of Campaign Etiquette: For Everyone with a Stake in Politicians and Journalists",
        "Authors": "By Hess, Stephen and Martin, Judith (INT)",
        "Description": "\"Some people think that etiquette is fine for tea parties, but there's no room for it when important political business has to be done,\" writes Miss Manners, otherwise known as Judith Martin. \"That's not true. The more controversy you have, the more etiquette you need. You need rules and order.\" The missing ingredient in efforts to improve campaign discourse is a set of agreed-upon norms and standards for behavior.     In this shrewd and amusing series of observations, Stephen Hess provides a political etiquette for campaign behavior on the part of both politicians and journalists. Organized alphabetically under such headings as Advertising, Bias, Cyberpolitics, Disclosure, Families, Lying, Money, Sex Scandals, and Talk Radio, forty-three brief essays examine common practices and places where the system breaks down, then recommend preventive or corrective action through a few clear rules. After discussing the paucity of local television reporting on local and state political campaigns, for example, Hess comments, \"the etiquette for local news directors is to ask, 'If we are not reporting local elections, who will?' Then act accordingly.\" With its broad coverage of campaign-related topics and its sensible suggestions, this book provides a useful corrective for practices that are dishonest, downright illegal, or sometimes just endlessly irksome.     The book features illustrations by some of America's foremost political cartoonists, including Herblock, Jim Borgman, Walt Handelsman, Mike Peters, Wayne Stayskal, and Garry Trudeau.",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Things Seen and Unseen: A Year Lived in Faith",
        "Authors": "By Gallagher, Nora",
        "Description": "\"Gracefully written and moving ... Things Seen and Unseen starts with Nora Gallagher entering the labyrinth of her life ... and ultimately it leads to the center of her being.\"--The Boston GlobeIt started with an occasional Sunday, a \"tourist's\" visit to a local church. Eventually Nora Gallagher entered into a yearlong journey to discover herfaith and a relationship with God, using the Christian calendar as her compass.Whether writing about her brother's battle against cancer, talking to homeless men about the World Series, or questioning the afterlife (\"One worldat a time\"), Gallagher draws us into a world of journeys and mysteries, yet grounded in a gritty reality. She braids together the symbols of theChristian calendar, the events of a year in one church, and her own spiritual journey, each strand combed out with harrowing intimacy. Thought provoking and profoundly perceptive, Things Seen and Unseen is a remarkable demonstration that \"the road to the sacred is paved with the ordinary.\"\"Like Kathleen Norris in Amazing Grace, Gallagher is renewing the language of ultimate concerns.\"--San Francisco Chronicle\"The deep serenity that suffuses Gallagher's work, the lyrical cadences in which she writes, do not blunt the sharp edges of what she discovered in her quest for meaning.\"--Los Angeles Times",
        "Category": " Religion , Faith",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Complete Idiot's Guide to British Royalty (The Complete Idiot's Guide)",
        "Authors": "By Buskin, Richard",
        "Description": "You're no idiot, of course. You know that Charles is the Prince of Wales, that Princes William and Harry are \"the heir and the spare,\" and that Queen Elizabeth is a ship.  But when it comes to knowing who's who in the British monarchy, you think that the Windsors are a family on a TV miniseries.  Don't change the channel yet!  The Complete Idiot's Guide to British Royalty helps you make sense of the world's longest-running soap opera--and illustrates how the behavior of current royal rulers pales in comparison to that of their colorful predecessors.  In this Complete Idiot's Guide, you get:",
        "Category": " History , Europe , Great Britain",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Conservatives Betrayed: How George W. Bush and Other Big Government Republicans Hijacked the Conservative Cause",
        "Authors": "By Viguerie, Richard A.",
        "Description": "A call to action by the Republican conservative who urged the GOP to implement a conservative agenda immediately after the November 2004 election argues that Republicans must adhere to conservative policies in order to meet such ends as the outlawing of abortion, tax reduction, and the protection of American interests overseas.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Taylor Trade Publishing",
        "Price Starting With ($)": "5.4",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Country of Origin: A Novel",
        "Authors": "By Lee, Don",
        "Description": "Lisa Countryman vanishes in Tokyo but no one seems to be in a particular hurry to find her. The American embassy official assigned to her case, Tom Hurley, can't be bothered, entangled as he is in an unsavory love affair with the wife of a CIA officer. The neurotic Japanese cop in charge of the investigation, Kenzo Ota, is equally preoccupied, ridiculed by his peers, demeaned by his superiors, his life a lonely shambles. Worse, it appears that Lisa has disappeared into the shadow world of Tokyo's sex trade, where a bewildering and often comical variety of clubs cater to every imaginable male fantasy.The mystery of her disappearance is intertwined with the mystery of her origins as an ainoko, or half-breed. For Lisa, who is half African American and half Asian, alienation and belonging, love and hate, are bound up with race. All the characters' loyalties are divided - between their countries of origin and their adoptive nationalities, between their society's traditions and their own sense of justice - as they yearn to find where they truly belong.Country of Origin is an exploration of the meaning of identity and belonging.",
        "Category": " Fiction , Literary",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Lighthousekeeping",
        "Authors": "By Winterson, Jeanette",
        "Description": "My mother called me Silver. I was born part precious metal, part pirate. Orphaned and anchorless, Silver is taken in by blind Mr. Pew, the mysterious and miraculously old keeper of the Cape Wrath lighthouse. Pew tells Silver ancient tales of longing and rootlessness, of journeys that move through place and time, of passion and betrayal. His stories center on Babel Dark, a local nineteenth-century clergyman who lived two lives: a public one mired in darkness and a private one  bathed in a beacon of light. Pew's stories are, for Silver, a map through her own particular darkness, into her own story and, finally, into love. With Lighthousekeeping, Winterson begins a new cycle and a return to the lyrical intimacy of her earliest work. One of the most original and extraordinary writers of her generation, Winterson has created a modern fable about the transformative power of storytelling.",
        "Category": " Fiction , Literary",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Hair-Raising Joys of Raising Boys, The",
        "Authors": "By Meurer, Dave",
        "Description": "\"God designed parenthood to be an enormous character-building exercise,\" says frazzled dad Dave Meurer. In The Hair-Raising Joys of Raising Boys, he explores the meaningful reflections (a.k.a. the laugh-out-loud occurrences and been-there-done-that moments) that only dads can truly understand. From the seemingly impossible task of imparting moral guidance to getting boys to take their cold medicine, this insightful book brings out the humor in the practical challenges of raising sons. Yes, bringing up boys is a monumental, multiyear battle--and that's just trying to get them to eat their vegetables! But with Dave Meurer's help, readers will learn to value each moment with a little style, humor, and grace.Previously Published as Boyhood Daze Bethany, 1-55661-209-5",
        "Category": " Humor , Topic , Marriage & Family",
        "Publisher": "Revell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Breaking Strain (Arthur C Clarkes Venus Prime)",
        "Authors": "By Preuss, Paul",
        "Description": "Sparta, a beautiful and mysterious agent whose superhuman ablities are the result of advanced biotechnology, investigates a tragic accident aboard the freighter \"Star Queen\" that leaves a lone survivor",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "The Basic Essentials of Mountain Biking",
        "Authors": "By Strassman, Michael A. and McMullen, John (ILT)",
        "Description": "",
        "Category": " Sports & Recreation , Mountaineering",
        "Publisher": "Ics Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Throwing the Elephant: Zen and the Art of Managing Up",
        "Authors": "By Bing, Stanley",
        "Description": "Sit down. Breathe deep. This is the last business book you will ever need. For in these pages, Stanley Bing solves the ultimate problem of your working life: How to manage the boss. The technique is simple . . . as simple as throwing an elephant. All it takes is the proper state of mind, a step-by-step plan, and a great leap of faith. This humble guide provides all these and more. It is Zen that enables one to take an object of enormous weight and size and mold it in one's grasp like a ball of Silly Putty. For senior management, in truth, is the silliest putty of them all.This comprehensive course walks budding business bodhisattvas through basic skills needed to provide the simple elephant handling that makes everyday life possible, including but not limited to the primary task of following along after the elephant with a little broom and dustpan.Serious students will then move to intermediate steps, from Polishing the Elephant's Tusks to Hiding from the Elephant When It Has Been Drinking and Feels Quite Nasty. Beyond this level lies the land of the practiced Zen masters, culminating in the ability to leverage and then throw the now-weightless elephant--and even play catch with it at corporate retreats.If What Would Machiavelli Would Do? was the meanest business book since the Renaissance, Throwing the Elephant provides the yang to that yin. Because sometimes you've got to be selfless, compassionate, and completely empty to get the job done.",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "Collins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Reinventing Medicine: Beyond Mind-Body to a New Era of Healing",
        "Authors": "By Dossey, Larry",
        "Description": "Larry Dossey forever changed our understanding of the healing process with his phenomenal New York Times bestseller, Healing Words. Now the man considered on of the pioneers of mind/body medicine provides the scientific and medical proof that the spiritual dimension works in therapeutic treatment, exploding the boundaries of the healing arts with his most powerful book yet.",
        "Category": " Health & Fitness , Healing",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Travels with a Medieval Queen",
        "Authors": "By Simeti, Mary Taylor",
        "Description": "Two Women Set Out Across Europe in Search of a Dead Queen  The medieval queen in question is Constance of Hauteville, daughter of the Norman King Roger II of Sicily, wife of the Holy Roman Emperor Henry VI, and mother to the Emperor Frederick II.  In 1194, at the age of forty, Constance journeyed from Germany south to reconquer her father's throne.  On the way she discovered that she was pregnant for the first time.  She decided to give birth in public so that the world would know the child was truly hers.  These intriguing facts, and very few others, are all we know directly of Constance's life. Seventeen years ago, Mary Taylor Simeti promised in  On Persephone's Island --her now-classic memoir of an American in Sicily--that she would someday tell the story of Constance (who was, like her, an expatriate and the mother of a bicultural family).  In  Travels with a Medieval Queen , Simeti keeps her promise: retracing Constance's route from Germany to Sicily, contrasting the exotic setting of Constance's childhood in Palermo with that of her married life in the north, and drawing on reading in contiguous fields to flesh out a spare legacy of historical facts. This is the beautifully illustrated chronicle of Simeti's twentieth-century travels, first in books, then on the road, as she searches the landscapes and the monuments that survive from the twelfth century for clues to the inner life of a mother who was also a monarch.",
        "Category": " History , Europe , Italy",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Blood Diamonds (Ben Kamal and Danielle Barnea Novels)",
        "Authors": "By Land, Jon",
        "Description": "The West African country of Sierra Leone has long been known as a diamond-rich area. With civil war ripping the heart out of the country, all aspects of life there are unstable. Worst of all, guerrilla rebels, in their lust for the resource-rich land, have sunk to depravity and terrorism to evict people from the country.It's into this maelstrom of political and emotional turmoil that Ben and Danielle must go. The leader of the rebels, a fanatical and charismatic woman known only as the Dragon, is not content with ravaging her own country. She plans a final coup that will perfect her power and topple Western governments-unless Ben and Danielle can stop her in time.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Blood Moon",
        "Authors": "By Lindsey, Hal",
        "Description": "",
        "Category": "",
        "Publisher": "Western Front Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The Human Equation: Building Profits by Putting People First",
        "Authors": "By Pfeffer, Jeffrey",
        "Description": "Why is common sense so uncommon when it comes to managing people? How is it that so many seemingly intelligent organizations implement harmful management practices and ideas? In his provocative new book, The Human Equation, bestselling author Jeffrey Pfeffer examines why much of the current conventional wisdom is wrong and asks us to re-think the way managers link people with organizational performance. Pfeffer masterfully builds a powerful business case for managing people effectively&#151;not just because it makes for good corporate policy, but because it results in outstanding performance and profits. Challenging current thinking and practice, Pfeffer: reveals the costs of downsizing and provides alternatives; identifies troubling trends in compensation, and suggests better practices; explains why even the smartest managers sometimes manage people unwisely; demonstrates how market-based forces can fail to create good people management practices, creating a need for positive public policy; and provides practical guidelines for implementing high-performance management practices. Filled with information and ideas, The Human Equation provides much-needed guidance for managing people more wisely and more profitably.",
        "Category": " Business & Economics , Management",
        "Publisher": "Harvard Business Review Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The United States and Africa: A Post-Cold War Perspective (American Assembly Books)",
        "Authors": "By American Assembly (COR), Gordon, David F., Miller, David C., and Wolpe, Howard",
        "Description": "This compact introduction to today's political and economic realities in Africa sets forth a foreign policy to fill the post-Cold War ideological void. From the stable rise of Ghana and Botswana to the violence and disintegration of Sudan and Nigeria, African nations present a wide range of opportunities and problems to which the United States has reacted with little consistency.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Humboldt Current: Nineteenth-Century Exploration and the Roots of American Environmentalism",
        "Authors": "By Sachs, Aaron",
        "Description": "An intellectual history of the contributions of the nineteenth-century explorer to American culture and science seeks to restore him from obscurity and reveals his pivotal role in the careers of J. N. Reynolds, Clarence King, George Wallace Melville, and John Muir. 25,000 first printing.",
        "Category": " Science , History",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Wife in the Fast Lane: A Novel",
        "Authors": "By Quinn, Karen",
        "Description": "Christy Hayes is a case study in successful living. She's won two Olympic gold medals, built a multimillion-dollar business, and landed a gorgeous and powerful CEO husband. But Christy's dream life begins to unravel when she inherits custody of an eleven-year-old girl named Renata. Suddenly she finds herself battling three formidable opponents: a treacherous business partner bent on ousting her from the company she founded, a ruthless stay-at-home mom who'll stop at nothing to maintain her PTA power base, and a stunning single woman scheming to steal her husband. Throw in the demands of one high-maintenance spouse and it's clear: something's got to give. But what? Her marriage? Her career? Her sanity?",
        "Category": " Fiction , Women",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "The Hidden Diary of Marie Antoinette",
        "Authors": "By Erickson, Carolly",
        "Description": "Imagine that, on the night before she is to die under the blade of the guillotine, Marie Antoinette leaves behind in her prison cell a diary telling the story of her life—from her privileged childhood as Austrian Archduchess to her years as glamorous mistress of Versailles to the heartbreak of imprisonment and humiliation during the French Revolution. Carolly Erickson takes the reader deep into the psyche of France's doomed queen: her love affair with handsome Swedish diplomat Count Axel Fersen, who risked his life to save her; her fears on the terrifying night the Parisian mob broke into her palace bedroom intent on murdering her and her family; her harrowing attempted flight from France in disguise; her recapture and the grim months of harsh captivity; her agony when her beloved husband was guillotined and her young son was torn from her arms, never to be seen again.Erickson brilliantly captures the queen's voice, her hopes, her dreads, and her suffering. We follow, mesmerized, as she reveals every detail of her remarkable, eventful life—from her teenage years when she began keeping a diary to her final days when she awaited her own bloody appointment with the guillotine.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Dave Barry's Bad Habits: A 100% Fact-Free Book",
        "Authors": "By Barry, Dave",
        "Description": "A collection of commentaries on the little insanities of everyday life and essays offering advice cover such topics as household perils, the government and taxation, culture, health habits, finance, and traveling",
        "Category": " Humor , General",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Martha Stewart's Quick Cook",
        "Authors": "By Stewart, Martha",
        "Description": "Provides fifty-two complete menus--with more than 200 illustrated recipes that use fresh ingredients--that can be prepared in one hour or less and includes the popular cooking columnist's hints on how to get organized",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Blue Belle",
        "Authors": "By Vachss, Andrew H.",
        "Description": "New York private eye Burke is certain of a connection between the nasty killers of teenage prostitutes and a martial-arts expert threatening his \"brother,\" Max",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "16.21",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Hamlet (Dover Thrift Editions)",
        "Authors": "By Shakespeare, William",
        "Description": "In this quintessential Shakespeare tragedy, a young prince's halting pursuit of revenge for the murder of his father unfolds in a series of highly charged confrontations that have held audiences spellbound for nearly four centuries. Those fateful exchanges, and the anguished soliloquies that precede and follow them, probe depths of human feeling rarely sounded in any art. The title role of Hamlet, perhaps the most demanding in all of Western drama, has provided generations of leading actors their greatest challenge. Yet all the roles in this towering drama are superbly delineated, and each of the key scenes offers actors a rare opportunity to create theatrical magic.As if further evidence of Shakespeare's genius were needed, Hamlet is a unique pleasure to read as well as to see and hear performed. The full text of this extraordinary drama is reprinted here from an authoritative British edition complete with illuminating footnotes.A selection of the Common Core State Standards Initiative.",
        "Category": " Drama , Shakespeare",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "5-HTP: The Natural Way to Boost Serotonin and Overcome Depression, Obesity, and Insomnia",
        "Authors": "By Murray, Michael T.",
        "Description": "The first guide to the dietary supplement 5-HTP provides the most detailed and clinically sound information available on the non-prescription medication, which boosts one's serotonin level, and its use in relieving common health problems.",
        "Category": " Psychology , Psychopathology , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Love and Love Sickness",
        "Authors": "By Money, John William",
        "Description": "Until recently, the study of sex roles, sexual behavior, and the differences between the sexes came under the aegis of such disciplines as psychiatry, sociology, or medicine. Love and Love Sickness lays the groundwork for an emerging, independent area of study, that of sexology. It is the newest, most provocative work yet from John Money, a medical psychologist whose distinguished contributions to sex research have gained him an international reputation.Money leads the reader through a fascinating array of topics relating to differences between the sexes, from, as he says, \"making a baby to learning mathematics.\" Among his subjects are the behavior of the sexes as seen throughout history; irreducible, derivative, and arbitrary sex roles; how men and women differ in aggression and dominance, parenting, and in mathematical, verbal, and praxic reasoning ; principles of erotic sexuality; the pathology of love; sexual taboos in Western culture; pornography; and, in an appendix, the treatment of sex offenders.Drawing upon history, ethnology, psychology, sociology, and law, as well as physiology, endocrinology, embryology, genetics, and host of other fields, Money proposes a new basis for understanding sexual behavior. He rejects the older analytic devices of motivation theory and the dichotomies of mind/body and nature/nurture to offer instead a theory that acknowledges a number of variables contributing to individual and collective behavior.Professionals and students in sex education, mental health, psychiatry, and clinical psychology, human biology, and counseling will find Love and Love Sickness, like all of John Money's work, necessary reading. It is also a book for the educated layperson, who will find it replete with insights into the realm of human sexuality.",
        "Category": " Psychology , General",
        "Publisher": "Johns Hopkins University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1980"
        }
    },
    {
        "Title": "Treasure Island (Puffin Classics)",
        "Authors": "By Stevenson, Robert Louis",
        "Description": "While going through the possessions of a deceased guest who owed them money, the mistress of the inn and her son find a treasure map that leads to a pirate fortune as well as great danger.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "More New Answers to Old Questions: The Free Radical Story",
        "Authors": "By Hersey, Harry W.",
        "Description": "",
        "Category": "",
        "Publisher": "LMHT Corporation",
        "Price Starting With ($)": "21.84",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Drop Dead, Gorgeous! (The Gorgeous Series, Book 2)",
        "Authors": "By Davidson, MaryJanice",
        "Description": "When someone tries to kill her best friend's husband-to-be during the wedding ceremony, assistant hairdresser and bridesmaid Jenny Branch is in pursuit of the prime suspect, Kevin Stone, a sexy undercover agent who takes her on a wild ride filled with super spies, danger, and passion. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "A Twist of Lemmon: A Tribute to My Father",
        "Authors": "By Lemmon, Chris",
        "Description": "Jack Lemmon was one of our most beloved movie stars. A two-time Academy Award winner, he appeared in dozens of memorable films, including such classics as Some Like It Hot, Mister Roberts, The Odd Couple, Grumpy Old Men, Missing, The Apartment, and The China Syndrome. On-screen, he came across as a kind of \"everyman\"—audiences loved him because they felt they knew him, because he was on of them. In A Twist of Lemmon, Chris Lemmon shares family tales, intimate father-son conversations, and anecdotes from and about his dad. The result is a vivid and enchanting portrait of a less-than-perfect father who in some ways assumed a greater reality for his fans than he did for his son. Chris writes about the difficulty of growing up in a broken home, the treasured time spent with his father, and the friendship that evolved as they came to share their passions for both music and golf. This very personal portrait provides new insight into a man who charmed millions with his rascal's smile and his very human vulnerability. When Jack Lemmon died in 2001, the world lost one of its favorite actors, but Chris Lemmon lost the man he had admired above all others. A Twist of Lemmon is his warm and moving and often very funny celebration of his larger-than-life father.  Joining Chris in his tribute are a number of the people who worked with Jack Lemmon over thy years, including actor Kevin Spacey. In his foreword, Spacey writes, \"He was a credit to his profession because he was a man whose humanity was bigger than his talent. And when you think for a moment about the size and depth of that talent, then you begin to understand how seriously he took his role as a human being.\" In this first book of its kind written about Jack Lemmon, that \"human being\" comes fully alive—as an actor, a father, and a best friend. It is a heartwarming and discerning  look at a true American legend.",
        "Category": " Biography & Autobiography , Rich & Famous",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Inside Narnia: A Guide to Exploring The Lion, the Witch and the Wardrobe",
        "Authors": "By Brown, Devin",
        "Description": "The Chronicles of Narnia series has sold over 85 million copies worldwide and single-handedly introduced people of all ages to the central doctrines of Christianity. Anticipating the December 2005 Walden Media/Walt Disney Pictures release of The Lion, the Witch and the Wardrobe, this book guides readers through the novel that started it all. Inside Narnia offers a close reading of The Lion, the Witch and the Wardrobe. Tracing through the book chapter by chapter, Devin Brown explores the features of C. S. Lewis's writing, supplies supplemental information on Lewis's life and other books, offers comments and opinions from other Lewis scholars, and shows the work's rich meanings. Insightful and thorough, Inside Narnia will dig deeper into Lewis's magical world to reveal biblical truths that often go uncovered. Fans of C. S. Lewis and those who will meet him through the upcoming film release will want to read this book.",
        "Category": " Religion , Christianity , Literature & the Arts",
        "Publisher": "Baker Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Assassins",
        "Authors": "By North, Oliver and Musser, Joe",
        "Description": "With this suspenseful, action-packed finale, Oliver North concludes the trilogy that has included his best-selling novels Mission Compromised and The Jericho Sanction. In 2005, the fourth anniversary of the September 11th attacks on America is met with the news that Jihadists have attacked multiple targets in Saudi Arabia, destroying oil pumping equipment, crippling pipelines, and assassinating most of the royal family. In the U.S. gas prices soar to over $6 a gallon along with hyper-inflation across the world financial markets. “Non-business travel” in the U.S. is limited to no more than 500 miles per week. The UN Security Council authorizes an international intervention force, and in a closed session of Congress the “Assassination Bill” is introduced. A “Termination or Neutralization Unit” is formed with Gen. Peter Newman as its head. He is given authority for up to 100 specialists, which he recruits and trains. It is discovered Iranians plan to detonate a nuke in Washington. Newman and a team are dispatched and a chase across Europe and international waters ensues. Newman hunts his illusive nemesis to Mexico and Cuba, but the Iranians have a backup plan in place and ready a plane repainted as a FedEx cargo jet and armed with a nuclear weapon—headed for Washington.",
        "Category": " Fiction , War & Military",
        "Publisher": "B&H Publishing Group",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Showdown: Why China Wants War With the United States",
        "Authors": "By Babbin, Jed L. and Timperlake, Edward",
        "Description": "Will the U.S. go to war with China over Taiwan or oil? Yes-bestselling authors Ed Timperlake and Jed Babbin say Chinese aggression is virtually inevitable and in their new book, \"Showdown\", they address the threat of mainland China and Bush's promise to defend Taiwan - at any cost. \"Showdown\" offers indispensable strategies and tactics for the U.S. to respond to the Chinese military threat in this ongoing battle for democracy and freedom.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Gift (Aladdin Picture Books)",
        "Authors": "By Brodmann, Aliana, Carnabuci, Anthony (ILT), and Carnubucci, Anthony (ILT)",
        "Description": "With her Hanukkah money in her pocket, a little girl eagerly sets out to find the perfect way to spend her treasure. Will she choose a fancy hat? A new doll? A soft, gray kitten? Nothing seems just right until she hears a lovely melody from a street musician's accordion. Suddenly she knows what to do with her gift -- and in giving from her heart she receives the best gift of all.",
        "Category": " Juvenile Fiction , People & Places , United States , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Mierda!: The Real Spanish You Were Never Taught in School",
        "Authors": "By Berger, Frances De Talavera and Heath, Michael (ILT)",
        "Description": "A collection of hard-core curses, colorful colloquialisms, and streetwise slang never taught in Spanish class includes sample conversations, painless quizzes, tips on body gestures, and discussions of Spanish history, culture, and cuisine&apos;complete with delightful cartoons.",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Little Witch Goes to School (Step-Into-Reading, Step 3)",
        "Authors": "By Hautzig, Deborah and Wickstrom, Sylvie (ILT)",
        "Description": "Little Witch wants to go to school just like her friends, but her mother thinks she should stay home and learn from her witchy aunts. Mother Witch finally agrees to let Little Witch go, but only if she promises to be very, very bad. It's a wild ride on a broomstick that kids won't soon forget! The third book in the popular Little Witch series, Little Witch Goes to School has all the mixed-up magic and quirky humor kids have come to love in the first two books.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Bondage Breaker: Overcoming Negative Thoughts, Irrational Feelings, Habitual Sins",
        "Authors": "By Anderson, Neil T.",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Facing the Lion: Growing Up Maasai on the African Savanna (National Geographic-memoirs)",
        "Authors": "By Viola, Herman J. and Lekuton, Joseph Lemasolai",
        "Description": "Offers young adults a true and informative look at growing up in a tribe of nomads in Kenya through one young man's tales of work, tradition, and survival as he encounters his first lion, helps his family with herding the cattle, and becomes initiated into manhood by the other tribesman.",
        "Category": " Young Adult Nonfiction , People & Places , Africa",
        "Publisher": "National Geographic Children's Books",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "I'll Be Home for Christmas",
        "Authors": "By Kinkade, Thomas and Buchanan, Anne Christian",
        "Description": "This inspiring collection of paintings by Thomas Kinkade evokes peaceful reflections of Christmas. Accompanied by tender quotations from the most memorable scenes involving the Christmas season, these paintings will transport you to a place of quiet beauty and cherished love.",
        "Category": " Religion , Inspirational",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Treasure House of Early American Rooms",
        "Authors": "By Sweeney, John A. H.",
        "Description": "The interiors of American rooms in the Winterthur Museum are photographed and organized by period, with information on the original rooms",
        "Category": " History , United States , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "America's Victories: Why the U.S. Wins Wars and Will Win the War on Terror",
        "Authors": "By Schweikart, Larry",
        "Description": "From the Revolutionary War to the present, the American military has consistently beaten the odds. It’s not luck. America’s armed services are under attack. From college campuses to the floor of the Senate, the Iraq war is portrayed as a quagmire, the army is described as \"broken,\" and our men and women in uniform are maligned as torturers. By seeing everything through the distorted lens of Vietnam?a war shrouded in harmful myths? critics have lost sight of our country’s real military record, and the factors that have enabled us to win with remarkable consistency, in situations even more dire than Iraq. In America’s Victories, Professor Larry Schweikart restores the truth about our amazing military heritage. Just as he did in his acclaimed previous book, A Patriot’s History of the United States, Professor Schweikart cuts through the distortions passed along by academia and the media. Far from being a cruel, bloodthirsty nation, eager to acquire other people’s resources, American troops value the sanctity of life more than any military culture in history. This fundamental trait has led, over the last two centuries, to more humane treatment of prisoners, more daring POW rescues, and more effective operations than any comparable power. America’s Victories explains how this culture of victory has endured through the darkest moments of World War II, the Korean and Vietnam wars, and how it has helped our troops prove their critics wrong over and over, from the Battle of New Orleans under Andrew Jackson to the war in Afghanistan under Tommy Franks.",
        "Category": " Political Science , Political Ideologies , Nationalism & Patriotism",
        "Publisher": "Sentinel HC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Life of David (Jewish Encounters)",
        "Authors": "By Pinsky, Robert",
        "Description": "Part of the Jewish Encounter seriesPoet, warrior, and king, David has loomed large in myth and legend through the centuries, and he continues to haunt our collective imagination, his flaws and inconsistencies making him the most approachable of biblical heroes. Robert Pinsky, former poet laureate of the United States, plumbs the depths of David’s life: his triumphs and his failures, his charm and his cruelty, his divine destiny and his human humiliations. Drawing on the biblical chronicle of David’s life as well as on the later commentaries and the Psalms—traditionally considered to be David’s own words—Pinsky teases apart the many strands of David’s story and reweaves them into a glorious narrative.Under the clarifying and captivating light of Pinsky’s erudition and imagination, and his mastery of image and expression, King David—both the man and the idea of the man—is brought brilliantly to life.",
        "Category": " Religion , Judaism , History",
        "Publisher": "Schocken",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Lady & Sons Just Desserts: More Than 120 Sweet Temptations from Savannah's Favorite Restaurant",
        "Authors": "By Richardson, Alan (PHT) and Deen, Paula H.",
        "Description": "As Paula Deen will tell y'all, there's just no satisfying way to finish a delicious meal without a scrumptious, mouthwatering dessert!In this beautiful hardcover edition of The Lady & Sons Just Desserts, Paula—author, restaurateur, and Food Network star—devotes her trademark southern charm to a tempting collection of more than 120 delightful recipes, guaranteed to indulge any sweet tooth. Whether you're baking for the holidays or an after-dinner treat, there are crowd-pleasers here for any occasion. These are the classic down-home recipes that have made Paula beloved to her fans everywhere, from her signature Gooey Butter Cake and Key Lime Grits Pie to Pecan Shortbread Bars, Hidden Mint Cookies, and Iron Skillet Brownies. Whether you're whipping up an Old South Jelly Roll Cake for a weekday treat or baking the Apple Butter Pumpkin Pie or Christmas Nut Pie for a holiday celebration, these treats are as easy to create as they are to enjoy. The Basic 1-2-3-4 Cake—in coconut (Jamie's favorite), caramel (Bobby's favorite), or chocolate—makes a wonderful birthday surprise, and the Tennessee Banana-Black Walnut Cake with Caramel Frosting is a southern favorite sure to become one of yours as well. There is also a wide array of cookies, bars, and candy, including Savannah Cheesecake Cookies, Orange Brownies, Chocolate Brickle, and Creamy Caramels. Even the most time-pressed cook will find it a snap to create these from-scratch recipes, using Paula's tips for reliable convenience ingredients and time-tested shortcuts that will impress and delight family and friends. Filled with warm baking memories and family stories, The Lady & Sons Just Desserts is already a kitchen classic. There are also helpful baking tips for measuring ingredients, storing leftovers, and even cutting a few calories, as well as tasty flavor variations and unique serving suggestions throughout. So bring the folks together to create your own memorable meals and occasions and remember to save room for dessert!",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Brother Jonathan",
        "Authors": "By Kilian, Crawford",
        "Description": "In hopes of ruling the world, the Intertel Corporation develops tiny computer implants that enhance intelligence and can provide telepathic links with animals",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Hide and Seek (Arthur C. Clarke's Venus Prime)",
        "Authors": "By Preuss, Paul",
        "Description": "Gifted by advanced biotechnology with extraordinary beauty and superhuman powers, Sparta risks her life and her secret identity to solve the case when the theft of an alien artifact, the Martian plague, leads to two murders in Labyrinth City",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Reengineering : Systems Integration Success, 1998",
        "Authors": "By Mische, Michael A.",
        "Description": "Integration is more than the melding of different technologies and application systems. Today it includes the integration of business processes, organizational structures, and the human element of the enterprise. Technology is both the catalyst and the enabler of the process. Reengineering: Systems Integration Success is a working \"blueprint\". It shows you how to develop, implement, and manage systems integration both cost and time-effectively to ensure your success and the success of your company. This book is a unique, hands-on approach to achieving systems integration. In this second edition, subject  matter experts share their secrets for success. You get their experience and insights in illustrative examples and case studies, plus a wealth of ready-to-use sample documents and graphic aids.Reengineering: Systems Integration Success, Second Edition is guaranteed to become one of your master reference books and a great source for leading edge ideas, as well as practical insights and information.",
        "Category": "",
        "Publisher": "Auerbach",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Beyond the Influence: Understanding and Defeating Alcoholism",
        "Authors": "By Ketcham, Katherine, Asbury, William F., Schulstad, Mel, and Ciaramicoli, Arthur P.",
        "Description": "\"This invaluable work will contribute much to the battle against our number one disease.\"—from the Foreword by George McGovern, former senator and author of Terry: My Daughter's Life-and-Death Struggle with AlcoholismAlcoholism is a disease. It's time we started treating it like one.Science has offered undisputed proof that alcoholism is a disease rather than a weakness of character, yet millions of alcoholics continue to suffer due to inappropriate treatment.  Now the co-author of the modern classic Under the Influence has teamed up with prominent alcoholism experts to provide new answers to this national epidemic.Based on the latest scientific research, Beyond the Influence clearly explains the neurological nature of the disease and reveals why some people drink addictively and others do not.  It also spells out what needs to be done to treat alcoholism, including: Steps to take for an intervention How to find the right treatment program Which psychological approaches work best Why spirituality is essential to recovery New insights into relapse prevention What you should know about diet, exercise, and nontraditional treatments such as acupunctureProvocative and eye-opening, compelling and compassionate, Beyond the Influence is not only a message of hope for alcoholics--it is a blueprint for saving lives.Beyond the Influence explains that alcoholism is a disease of the body, not a weakness of character. Drawing on the latest scientific studies, the authors present new research on the central role of genetics and neurotransmitters in addiction. Continuing where the prior book left off, it also includes: Steps for diagnosis and intervention, plus ways to prevent relapsesVarious treatment models, including inpatient and out-patient programs and a review of new drug treatmentsThe most effective types of psychological counselingThe critical role of nutritionNon-traditional healing methods for recoveryThe importance of a spiritual component to recoveryThe authors also critique our nation's alcoholism policies, including education and prevention programs, efforts to curtail college bingeing and underage drinking, and the advertising and marketing strategies of the alcohol industry.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Cary Grant",
        "Authors": "By McCann, Graham",
        "Description": "More than a biography, this is a savvy portrait of how Archie Leach, born to a poor working-class family in Bristol, England became Cary Grant, one of Hollywood's most irresistible and admired celebrities of all time.",
        "Category": " Performing Arts , Film , General",
        "Publisher": "Columbia University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Susie Coelhos Everyday Styling: Easy Tips for Home, Garden, and Entertaining",
        "Authors": "By Coelho, Susie, Cheung, Jennifer, and Nilsson, Steven",
        "Description": "Susie Coelho's down-to-earth personality and practical smarts about bringing beauty to life have won her millions of fans. Now, in Susie Coelho's Everyday Styling, she offers a liberating plan for infusing personal style into readers' home and gardens, often without spending a dime.  Susie's credo is that the most appealing spaces are usually not the most expensive or decorator-correct. Homes develop authentic personal styles the same way people do -- through creativity, change, and the process of living. But how do you develop your own sense of style? Susie will show you how to find it, define it, and put it to use. The secret is the Style File: She'll help you create a collection of looks you love (pictures, swatches of material, scribbled ideas), organized as a practical reference for every space in your home and garden. As you discover common threads and new possibilities, your own vision will start to take shape.  But do you have the time or the resources to bring this vision to life? As a wife and mother juggling the demands of family, career, social life, and community, Susie understands the obstacles -- and how to work around them. The aim is to start with what you already have, then rearrange, refresh, and add unexpected or missing elements to create a new look all your own. It's not formal decorating or landscaping according to someone else's rules; it's a personal process that Susie calls \"un-decorating\" -- or everyday styling.  Filled with gorgeous color photographs, styling how-to's and tips, and lots of inspiration, Everyday Styling helps readers on any budget wake up their homes and gardens while putting their unique thumbprint on everything they do. You'll be able to create a whole new look and mood -- using pillows or fabric to jazz up old furniture, displaying and highlighting favorite possessions, or redoing a living room in three different ways -- all in one day.  Moving outside, Susie offers tips on styling entrances according to the season, creating fantastic outdoor rooms for entertaining or play, and turning your yard into a garden of earthly delights. At every step, she helps you develop and draw on your most important resources -- your own imagination, creativity, and passion for living. Whether you're entertaining friends, hankering for a new perspective on that same old bedroom, or just hoping to perk up your patio with colorful plants, Susie Coelho's Everyday Styling shows how easy it is to keep you home and garden looking and feeling fresh and alive every day. Her message is simple but universal: Keep creating. That's the joy of life.",
        "Category": " House & Home , Decorating",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Book of Photography: How to see and take better pictures",
        "Authors": "By Hedgecoe, John",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1976"
        }
    },
    {
        "Title": "Single: The Art of Being Satisfied, Fulfilled and Independent",
        "Authors": "By Ford, Judy",
        "Description": "Single is......not a condition to be cured...it's just as natural as being part of a couple. Its wisdom is contagious. Its message is powerful....a one-of-a-kind book that speaks a universal language to single women everywhere....a sometimes funny, sometimes, touching, and always uplifing collection of true-life experiences and practical wisdom that helps you celebrate your single status.Single is about upholding the most enduring relationship of all: the one we have with ourselves.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    }
]