[
    {
        "Title": "In My Wildest Dreams (Governess Brides, Book 4)",
        "Authors": "By Dodd, Christina",
        "Description": "Since she was a little girl, Celeste has had one burning desire:to marry Ellery Throckmorton. But what chance does a gardener's daughter have of capturing the heart of one of England's wealthiest gentlemen? However, the education she receives at the Distinguished Academy of Governesses enables Celeste to return to Blythe Hall with a refinement that complements her ravishing beauty—and makes her bold romantic dream more attainable. But, alas, temptation gets in the way . . .For wherever Celeste turns, it is not Ellery she encounters, but his serious, yet undeniably intriguing, older brother Garrick. The elder Throckmorton will have no one interfere with the younger's impending nuptials, and his meddling infuriates Celeste to no end. Still, she cannot disregard the fluttering of her heart whenever Garrick deigns to smile at her. And the passion she senses smoldering beneath his formidable control is tempting her in a manner a lady must never allow . . .",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Transfer of Power",
        "Authors": "By Flynn, Vince",
        "Description": "What if America's most powerful leader was also its prime target?On a busy Washington morning, the stately calm of the White House is shattered as terrorists gain control of the executive mansion, slaughtering dozens of people. The president is evacuated to an underground bunker, but not before nearly one hundred hostages are taken. One man is sent in to take control of the crisis. Mitch Rapp, the CIA's top counterterrorism operative, determines that the president is not as safe as Washington's power elite had thought. Moving among the corridors of the White House, Rapp makes a chilling discovery that could rock Washington to its core: someone within his own government wants his rescue attempt to fail.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Cross Town Route",
        "Authors": "By Catalon, Katie B.",
        "Description": "",
        "Category": "",
        "Publisher": "Winston-Derek Pub",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Prince Caspian",
        "Authors": "By Lewis, C. S. and Baynes, Pauline (ILT)",
        "Description": "A mass-market paperback edition of Prince Caspian, book four in the classic fantasy series, The Chronicles of Narnia, featuring cover art by Cliff Nielsen and black-and-white interior illustrations by the original illustrator of Narnia, Pauline Baynes.The Pevensie siblings travel back to Narnia to help a prince denied his rightful throne as he gathers an army in a desperate attempt to rid his land of a false king. But in the end, it is a battle of honor between two men alone that will decide the fate of an entire world.Prince Caspian is the fourth book in C. S. Lewis&#39;s classic fantasy series, which has been drawing readers of all ages into a magical land where animals talk and trees walk for over sixty years. This is a stand-alone novel, but if you would like to read more of Lucy and Edmund&#39;s adventures, pick up The Voyage of the Dawn Treader, the fifth book in The Chronicles of Narnia.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Early Church",
        "Authors": "By Chadwick, Henry",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1968"
        }
    },
    {
        "Title": "First Day of Kindergarten",
        "Authors": "By Kim Jackson",
        "Description": "",
        "Category": "",
        "Publisher": "Unknown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "What The Dinosaurs Saw: Animals Living Then And Now (level 1) (Hello Reader)",
        "Authors": "By Schwartz, Carol (ILT), Schlein, Miriam, and Schwartz, Carol",
        "Description": "Through rhyming text and realistic illustrations an easy reader shows the world through a dinosaur's eyes, revealing what the world was like when dinosaurs roamed the earth and that many of the plants and animals that lived then still exist today. Original.",
        "Category": " Juvenile Nonfiction , Animals , Dinosaurs & Prehistoric Creatures",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Sword of Chaos (Darkover® anthology)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "DAW",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "S is for Silence (A Kinsey Millhone Mystery, Book 19)",
        "Authors": "By Grafton, Sue",
        "Description": "A Kinsey Millhone Mystery from the New York Times bestselling author ofW is for Wasted. Cases don’t get much colder than that of Violet Sullivan, who disappeared from her rural California town in 1953, leaving behind an abusive husband and a seven-year-old named Daisy. But P.I. Kinsey Millhone has promised Daisy she’ll try her best to locate Violet, dead or alive. All signs point to a runaway wifethe clothes that disappeared; the secret stash of money Violet bragged about; the brazen flirtations she indulged in with local men, including some married ones. Kinsey tries to pick up a trail by speaking to those who remember herand perhaps were more involved in her life than they let on.But the trail could lead her somewhere very dangerous. Because the case may have gone cold, but some peoples’ feelings about Violet Sullivan still run as hot as ever",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Double Duty : The Parents' Guide to Raising Twins, from Pregnancy Through the School Years",
        "Authors": "By Tinglof, Christina Baglivi",
        "Description": "What lies ahead for expectant parents of twins? Immeasurable joy, plus many sleepless nights. Parenting twins is unlike parenting siblings of different ages. From infancy through the teen years, twins require a bit more energy and diplomacy, plus lots of clever ideas.  Double Duty: The Parents' Guide to Raising Twins, from Pregnancy Through the School Years offers plenty of reassuring advice and practical strategies for coping with the challenges that lie ahead. Featuring a wealth of tips from couples with twins who've lived to tell about it, Double Duty covers everything from managing a multiple pregnancy to the first days of school. Whether you're concerned about bonding with two babies at once, getting them on the same schedule, or separating your inseparable duo for a day, Double Duty suggests many comforting solutions. It covers such twin-specific issues as:   How to increase the chances of a healthy pregnancy How to prepare home and family for the arrival of twins How to survive the critical first month How to breastfeed or bottle feed two infants at once The pros and cons of dressing twins alike How to encourage paternal involvement How to avoid speech difficulties in twins How to avoid unhealthy competition between the siblings   Christina Baglivi Tinglof has had travel features published in the Los Angeles Times, Chicago Tribune Boston Herald, and Westways Magazine. Now, as a full-time mother, she writes on parenting for LA Parent and Central California Parent magazines. She lives in Los Angeles with her husband, Kevin, and their fraternal twin boys, Joseph and Michael.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The Poison Oracle",
        "Authors": "By Dickinson, Peter",
        "Description": "A chimpanzee that is able to communicate with the use of plastic symbols is the sole witness to a murder in a medieval Arab kingdom",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "F Is for Fugitive (Kinsey Millhone Mysteries)",
        "Authors": "By Grafton, Sue",
        "Description": "Everyone knew the kind of girl Jean Timberlake was -- ask anybody in the sleepy surf town of Floral Beach and they'd say Jean was wild, looking for trouble. But she certainly wasn't looking for murder. She was found dead on the beach seventeen years ago, and a rowdy ex-boyfriend named Bailey Fowler was convicted of her murder and imprisoned -- and then Bailey escaped. Now private eye Kinsey Millhone steps into a case that should have never been closed, in a town where there's no such thing as a private investigation.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Crimeline",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "The Baron on Board",
        "Authors": "By CREASEY, John",
        "Description": "John Mannering, known as the Baron during his days as a jewel thief, must use his former skills to solve the murder of a courier who was bringing a group of priceless jewels to Mannering's antiques firm",
        "Category": " Fiction , General",
        "Publisher": "Walker & Co",
        "Price Starting With ($)": "5.28",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Life Form",
        "Authors": "By Foster, Alan Dean",
        "Description": "When nine scientists discover a faraway planet that is miraculously like Earth, they immediately move in for a closer look but discover that nothing is as it actually seems and that their survival will be challenged. Original.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Lord Of The Manor",
        "Authors": "By Anton, Shari",
        "Description": "Lord Of The Manor by Shari Anton released on Aug 25, 1998 is available now for purchase.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The secrets of the service: A story of Soviet subversion of Western intelligence",
        "Authors": "By Glees, Anthony",
        "Description": "Reveals the methods by which the Soviets are able to recruit nationals, turn them into traitors, and run them for decades without being detected",
        "Category": "",
        "Publisher": "Carroll & Graf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Southern living annuals & perennials",
        "Authors": "By Chaplin, Lois Trigg",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Reckoning",
        "Authors": "By Monteleone, Thomas F.",
        "Description": "At the international convocation that welcomes the new millennium, the Pope collapses and dies in the arms of Peter Carenza, a charismatic young priest who has drawn major media attention with his \"miracle tour\" of the United States. With the dying Pontiff's blessing of Carenza still ringing in their ears, the Cardinals unanimously elect Peter as the new Pope. Peter's announced plans to make \"a new Church for a new Millennium\" draw the faithful by the millions.Peter Carenza is no mere Roman Catholic miracle worker, raising the dead, healing the sick, and summoning lightning. Cloned from DNA obtained from the Shroud of Turin, his mother a virgin nun, Peter is the product of a secret Vatican conspiracy to bring about the Second Coming. But Carenza is someone far more dangerous and far more evil, not the Son of God at all, but the Son of Another.Only three people know the truth ahout the newest Pope: the woman Carenza once loved, who has seen his true nature; an Archbishop who begins to distrust Carenza despite his personal magnetism; and Peter's mother, a cloistered nun who truly hears the word of God.As Peter seeks to destroy the seven seals that hold back Armageddon, this new holy trinity searches for a way to kill the man who should have been mankind's Savior, but instead is its ultimate Damnation.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Onion Girl (Newford)",
        "Authors": "By De Lint, Charles",
        "Description": "2017 Aurora Awards Best of the Decade FinalistIn novel after novel, and story after story, Charles de Lint has brought an entire imaginary North American city to vivid life. Newford: where magic lights dark streets; where myths walk clothed in modern shapes; where a broad cast of extraordinary and affecting people work to keep the whole world turning. At the center of all the entwined lives in Newford stands a young artist named Jilly Coppercorn, with her tangled hair, her paint-splattered jeans, a smile perpetually on her lips--Jilly, whose paintings capture the hidden beings that dwell in the city's shadows. Now, at last, de Lint tells Jilly's own story...for behind the painter's fey charm lies a dark secret and a past she's labored to forget. And that past is coming to claim her now.\"I'm the onion girl,\" Jilly Coppercorn says. \"Pull back the layers of my life, and you won't find anything at the core. Just a broken child. A hollow girl.\" She's very, very good at running. But life has just forced Jilly to stop.",
        "Category": " Fiction , Magical Realism",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Science in the Creation Week: Content & \"Hands-On\" Science Skills Curriculum Grades 2-5",
        "Authors": "By Unfred, David",
        "Description": "",
        "Category": "",
        "Publisher": "Noble Pub Assoc/Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Memory of Earth (Homecoming)",
        "Authors": "By Card, Orson Scott",
        "Description": "The first volume in the Homecoming saga from bestselling author Orson Scott Card, The Memory of EarthHigh above the planet Harmony, the Oversoul watches. Its task, programmed so many millennia ago, is to guard the human settlement on this planet--to protect this fragile remnant of Earth from all threats. To protect them, most of all, from themselves.The Oversoul has done its job well. There is no war on Harmony. There are no weapons of mass destruction. There is no technology that could lead to weapons of war. By control of the data banks, and subtle interference in the very thoughts of the people, the artificial intelligence has fulfilled its mission.But now there is a problem. In orbit, the Oversoul realizes that it has lost access to some of its memory banks, and some of its power systems are failing. And on the planet, men are beginning to think about power, wealth, and conquest.Homecoming seriesThe Memory of EarthThe Call of EarthThe Ships of EarthEarthfallEarthborn",
        "Category": "",
        "Publisher": "Tor Science Fiction",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Rage of a Demon King: Book Three of the Serpentwar Saga (Serpentwar Saga, 3)",
        "Authors": "By Feist, Raymond E.",
        "Description": "“A massive, entertaining tale.”—Ft. Lauderdale Sun-Sentinel The Serpentwar rages on! In Rage of a Demon King—the spellbinding third installment in Raymond E. Feist’s masterful epic fantasy, The Serpentwar Saga—the imperiled realm of Midkemia confronts its most devastating horror, as a nightmare beyond imagining descends upon the war-torn land determined to devour and destroy. A terrible conflict reaches a breathtaking climax—a world-annihilating conflagration that pits serpent against man and magician against demon. Rage of a Demon King is Feist at his best, solidifying his standing along with Terry Goodkind, George R. R. Martin, and Terry Brooks, as the elite creators of epic sword and sorcery fantasy.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Writers Inc.: Write for College: Student Handbook, Grades 11-12",
        "Authors": "By Sebranek, Patrick, Meyer, Verne, and Kemper, Dave",
        "Description": "",
        "Category": " Young Adult Nonfiction , Language Arts , Composition & Creative Writing",
        "Publisher": "Great Source",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "Science: Level F",
        "Authors": "By",
        "Description": "",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "Modern Curriculum Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Handcrafted Doors and Windows",
        "Authors": "By Rowland, Amy Zaffarano",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Sylvester & Other Stories",
        "Authors": "By Adelaide, Et.al. Holl",
        "Description": "",
        "Category": "",
        "Publisher": "New York: Golden Press, 1962",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Jamie The Red",
        "Authors": "By Dickson, Gordon R.",
        "Description": "King Walter is forced to send his favorite son, Jamie the Red, into exile because he continues to pick fights with his dull-witted half brother",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Bodyguard",
        "Authors": "By Dietz, William C.",
        "Description": "In a futuristic world of fast-growing technology, corporate expansion in outer space, and plenty of violence, a carefully trained bodyguard whose human memories have been blocked by a metal plate offers perfect protection for a high price. Original.",
        "Category": " Fiction , Science Fiction , Adventure",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Of War And Honor (The Harriers , Book 1)",
        "Authors": "By Dickson, Gordon R.",
        "Description": "Class warfare rages on the Hub, an artificial world where the Petit Harriers--a motley band of adventurers created to do the planet's dirty work--rebel against the tyranny of the Grand Harriers",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "That Summer (Puffin Novel)",
        "Authors": "By Dessen, Sarah",
        "Description": "Attending two weddings during her fifteenth summer, the first her father's, the second her older sister's, Haven feels that nothing in her life is stable and fondly remembers time spent with a special person. Reprint.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Secrets of Star Trek: Insurrection (Star Trek: the Next Generation)",
        "Authors": "By Erdmann, Terry J.",
        "Description": "New Ships! New Aliens! New Worlds! New Adventures!This is the chronicle of how they come to be -- the story behind Paramount Pictures' newest cinematic epic, the third feature film starring the cast of Star Trek: The Next Generation®!Follow the making of the movie as told to Terry J. Erdmann by its actors and creators. Look behind the scenes at the creative process from inception to finished work, as seen through the eyes of Rick Berman, Patrick Stewart, Jonathan Frakes, Michael Piller, and many others. Learn about everything from the initial story concepts to designs, set construction, makeup, costuming, visual effects, and much, much more.Filled with hundreds of behind-the-scenes color photos and sketches, The Secrets of Star Trek: Insurrection is an intimate account of how the phenomenal ninth Star Trek feature film became a reality.",
        "Category": " Performing Arts , Film & Video , Reference",
        "Publisher": "Star Trek",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Nerve: Literate Smut",
        "Authors": "By Field, Genevieve (EDT) and Griscom, Rufus (EDT)",
        "Description": "New York magazine called Nerve \"the Web's most intelligent forum for erotica.\" Now, from the creators of Nerve.com comes an original collection of sexual fiction and nonfiction from some of today's best writers.Since its online debut in 1997, Nerve has been publishing brazen, titillating,  and intelligent prose and photography. Nerve: Literate Smut highlights some of the webzine's most acclaimed stories and essays by writers such as Norman Mailer, Sallie Tisdale, Rick Moody, Thom Jones, and Dr. Joycelyn Elders, as well as striking photographs by Andres Serrano, Richard Kern, Sylvia Plachy, and others. Nerve's founders frame the texts and photos with original and revealing essays on the many sides of sex--from shame and habits to taboos, debauchery, and, of course, love.  This volume demonstrates why Nerve is more than the latest web phenomenon--it's a bold new sexual sensibility and a precocious force in American culture.",
        "Category": " Fiction , Erotica , General",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Women Men Love, Women Men Leave: What Makes Men Want to Commit?",
        "Authors": "By Kinder, Melvyn and Cowan, Connell",
        "Description": "",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Starless Night: Legacy of the Drow, Book II",
        "Authors": "By Salvatore, R. A.",
        "Description": "Starless NightI can find no answers in Mithril Hall . . . The apparent serenity of Drizzt Do'Urden, the brooding quiet, will show me nothing of the future designs of the drow. Yet, for the sake of my friends, I must know those dark intentions. And so I fear that there remains only one place for me to look . . . .The Underdark. A place of brooding darkness, where no shadows exist, and where Drizzt Do'Urden does not wish to go. The noble dark elf must return there, though, must go back to find his friends in the gnome city of Blingdenstone, and on to Menzoberranzan, the city of drow. Only then can Drizzt discern what perils might reach out from that dark place to threaten his friends in Mithril Hall.He finds allies where he least expects them and enemies he thought long gone. His scimitars slash at monsters too evil to reside under the sunlight of the surface world, while his inner strength wrestles with the tumult of emotions assaulting the noble drow when he looks once more on his dreaded homeland. All the while Drizzt must fend off the weight of guilt he carries for a dear friend lost to him forever.",
        "Category": " Fiction , General",
        "Publisher": "Wizards of the Coast",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Preparing for Adolescence: Caution Changes Ahead",
        "Authors": "By Dobson, James",
        "Description": "",
        "Category": "",
        "Publisher": "Vision House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Legion of the Damned",
        "Authors": "By Dietz, William C.",
        "Description": "The first novel in William C. Dietz's acclaimed Legion of the Damned series...There is one final choice for the hopeless—the terminally ill, the condemned criminals, the victims who cannot be saved: becoming cyborg soldiers in the Legion. Their human bodies are destroyed and they are reborn as living weapons. But when aliens attack the Empire, the Legion must choose sides.",
        "Category": " Fiction , Science Fiction , Adventure",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Tyrannosaur",
        "Authors": "By Drake, David",
        "Description": "When humans find a way to travel back in time to prehistoric days, the greatest predator of one age, T-Rex, encounters the most efficient killer of another, future age:  man. Original.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tom Doherty Assoc Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Counterprobe",
        "Authors": "By Douglas, Carole Nelson",
        "Description": "Jane Doe, a probe sent by aliens to explore Earth, is under the watchful eye of Dr. Kevin Blake, government forces and others who would kill to get her secrets or to bury them",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "The Final Battle (Legion of the Damned)",
        "Authors": "By Dietz, William C.",
        "Description": "Human and machine. Elite and Expendable. They are the Legion of the Damned.The Hudathans are on a rampage. They have created their own corps of cyborgs using copycat technology and psychotic candidates. They have refitted their hardware. Reloaded their weapons. Refueled their insanity. And targeted the heart of the Confederacy, once and for all.The Legion will be there to greet them.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "The Canterbury Tales: A Selection",
        "Authors": "By Chaucer, Geoffrey",
        "Description": "",
        "Category": " Poetry , General",
        "Publisher": "Signet Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Summer of Roses: A Novel",
        "Authors": "By Rice, Luanne",
        "Description": "Few novelists touch our hearts, quicken our souls, and enrich our lives like Luanne Rice. Now she brings full circle one of her most compelling explorations of the heart . . . all the ways it can be broken . . . and the magic that makes it whole again.On the windswept coast of Nova Scotia, two friends and their young daughters have found refuge in the rugged community of Cape Hawk. Lily Malone and nine-year-old Rose are making a new home with a man who will do whatever it takes to protect them. Marisa Taylor and young Jessica are beginning to recapture the music that once filled their world with joy. But now a stranger from faraway New England has made his way to Cape Hawk, bearing secrets from the past and news of an uncertain future. And each woman will face choices that will irrevocably shape all the seasons to come—between lives left behind, mysteries unsolved, and loves that must be reclaimed or abandoned forever. . . . “Luanne Rice has enticed millions of readers by enveloping them in stories that are wrapped in the hot, sultry weather of summer . . . she does it so well.”—USA Today",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Good Earth (Enriched Classics)",
        "Authors": "By Buck, Pearl S.",
        "Description": "ENDURING LITERATURE ILLUMINATED BY PRACTICAL SCHOLARSHIP  A poignant tale about the life and labors of a Chinese farmer during the sweeping reign of the country¹s last emperor.  EACH ENRICHED CLASSIC EDITION INCLUDES:  ? A concise introduction that gives readers important background information  ? A chronology of the author's life and work  ? A timeline of significant events that provides the book's historical context  ? An outline of key themes and plot points to help readers form their own interpretations  ? Detailed explanatory notes  ? Critical analysis, including contemporary and modern perspectives on the work  ? Discussion questions to promote lively classroom and book group interaction  ? A list of recommended related books and films to broaden the reader's experience  Enriched Classics offer readers affordable editions of great works of literature enhanced by helpful notes and insightful commentary. The scholarship provided in Enriched Classics enables readers to appreciate, understand, and enjoy the world's finest books to their full potential.  SERIES EDITED BY CYNTHIA BRANTLEY JOHNSON",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Voltaire's Politics: The Poet as Realist",
        "Authors": "By Gay, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Endless Chain (A Shenandoah Album Novel)",
        "Authors": "By Richards, Emilie",
        "Description": "Sam Kinkade is finally feeling at home as a minister in rural Toms Brook, Virginia, content with his life and Shenandoah Valley congregation. But his plans to welcome the area's growing Hispanic community are being met with resistance. Fortunately, when the church-run community center is threatened, a stranger named Elisa Martinez walks through his door and Sam realizes he has found a woman capable of building bridges.Elisa isn't looking to make connections. She has come to Toms Brook to hide. But despite her fears of discovery she is enchanted by the beautiful work of — and the friendship offered by — the women who invite her to join their quilting circle. And even though she fears the consequences for both of them, she finds herself powerfully drawn to Sam, and to the generations-old love story rooted in the town's past.Will she and Sam repeat the past, or can they find the love and the freedom they seek at last?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "How the Other Half Lives: Studies Among the Tenements of New York",
        "Authors": "By Riis, Jacob A.",
        "Description": "Jacob Riis was one of the very few men who photographed the slums of New York at the turn of the twentieth century, when as many as 300,000 people per square mile were crowded into the tenements of New York's Lower East Side. The filth and degradation made the area a hell for the immigrants forced to live there. Riis was one of those immigrants, and, after years of abject poverty, when he became a police reporter for the New York Tribune, he exposed the shameful conditions of life with which he was all too familiar. Today, he is best remembered as a compassionate and effective reformer and as a pioneer photo-journalist.In How the Other Half Lives, New Yorkers read with horror that three-quarters of the residents of their city were housed in tenements and that in those tenements rents were substantially higher than in better sections of the city. In his book Riis gave a full and detailed picture of what life in those slums was like, how the slums were created, how and why they remained as they were, who was forced to live there, and offered suggestions for easing the lot of the poor. Riis originally documented all his studies with photographs. However, since the half-tone technique of photo reproduction had not been perfected, the original edition included mainly reductions in sketch-form of Riis' photographs. These could not begin to capture what Riis' sensitive camera caught on film. The anguish and the apathy, the toughness and the humiliation of the anonymous faces is all but obliterated in the sketches. This Dover edition includes fully 100 photographs, many famous, and many less familiar, from the Riis collection of the City Museum, and their inclusion here creates a closer conformity to Riis' intentions than did the original edition.",
        "Category": " Photography , History",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1971"
        }
    },
    {
        "Title": "Price Guide to American Country Antiques",
        "Authors": "By Don Raycraft, Carol Raycraft",
        "Description": "",
        "Category": "",
        "Publisher": "Wallace-Homestead Book Company",
        "Price Starting With ($)": "7.02",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Forbidden Sanctuary",
        "Authors": "By Bowker, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "Pride and Prejudice (The Penguin English Library)",
        "Authors": "By Austen, Jane and Tanner, Tony (EDT)",
        "Description": "Elizabeth Bennet's chances of happiness are endangered by the foibles of human nature in this classic nineteenth-century novel",
        "Category": " Fiction , General",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1972"
        }
    },
    {
        "Title": "The One Tree: The Second Chronicles of Thomas Covenant Book Two",
        "Authors": "By Donaldson, Stephen R.",
        "Description": "",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Jane Eyre (Bantam Classics)",
        "Authors": "By Bronte, Charlotte",
        "Description": "Introduction by Joyce Carol Oates ' Nominated as one of America's best-loved novels by PBS's The Great American ReadInitially published under the pseudonym Currer Bell in 1847, Charlotte Brontë's Jane Eyreerupted onto the English literary scene, immediately winning the devotion of many of the world's most renowned writers, including William Makepeace Thackeray, who declared it a work 'of great genius.' Widely regarded as a revolutionary novel, Brontë's masterpiece introduced the world to a radical new type of heroine, one whose defiant virtue and moral courage departed sharply from the more acquiescent and malleable female characters of the day. Passionate, dramatic, and surprisingly modern, Jane Eyre endures as one of the world's most beloved novels.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Wuthering Heights (Signet Classics)",
        "Authors": "By Bronte, Emily",
        "Description": "Heathcliff and Catherine Earnshaw, the daughter of Heathcliff's benefactor, find a backdrop for their love in the raw beauty of the moors and suffer the misery that results from their thwarted longing for each other. Reissue.",
        "Category": " Fiction , General",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Dr. Spock's Baby and Childcare: Seventh Edition",
        "Authors": "By Spock, Benjamin, M.D. and Parker, Steven",
        "Description": "Generations of parents have relied on Dr. Spock's timeless bestseller. It remains the source book, the most authoritative and reliable guide available. Collaborating with Dr. Steven J. Parker, Dr. Spock has now updated and expanded this reference to meet the changes and challenges of the next century. Organized for fast and easy reference, and including entirely new sections covering adolescence, this resource provides the latest advice and information on such topics as:   breast-feeding: the newest approaches, with proven techniques for working mothers immunization schedules, vitamins and dietary recommendations common medical questions and answers about whooping cough vaccine, diaper rash, infant diarrhea, scoliosis, and acne working and parenting talking to your child about sex, contraception, homosexuality, tobacco, alcohol and other drug abuse, AIDS school and learning problems children with disabilities dental care for children raising non-violent children gay and lesbian parents first aid and injury prevention-including sports and recreational safety.   All Dr. Spock's invaluable, time-tested advice is here including the most current medical practices and advances in child care, along with an all-new glossary of medical terms. More than ever before, this essential and classic work will help all parents face their many challenges and responsibilities with new confidence and joy. As Dr. Spock has always said: \"Trust yourself. You know more than you think you do.\"",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Dragon and the Jewel (Medieval Plantagenet Trilogy)",
        "Authors": "By Henley, Virginia",
        "Description": "With her sapphire eyes and silken dark hair, Princess Eleanor was a bewitching beauty made for a man's pleasure.  Once a child bride, but widowed at a tender age, she swore never to marry again and took a vow of eternal chastity...until Simon de Montfort marched into England and set his smoldering dark gaze upon her, King Henry's youngest sister, the royal family's most precious jewel.  Bold, arrogant, and invincible, the towering Norman knight inspired awe in the bravest of men...and a reckless desire in Eleanor's untried heart.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Ten Big Ones",
        "Authors": "By Evanovich, Janet",
        "Description": "Janet Evanovich is the hottest author in America, and her Stephanie Plum novels have taken the nation by storm!#1 New York Times#1 Wall Street Journal#1 Los Angeles Times#1 Entertainment Weekly#1 Publishers WeeklyShe's accidentally destroyed a dozen cars. She's a target for every psycho and miscreant this side of the Jersey Turnpike. Her mother's convinced she'll end up dead . . . or worse, without a man. She's Stephanie Plum, and she kicks butt for a living (well, she thinks it sounds good to put it that way. . . .).It begins as an innocent trip to the deli-mart, on a quest for nachos. But Stephanie Plum and her partner, Lula, are clearly in the wrong place at the wrong time. A robbery leads to an explosion, which leads to the destruction of yet another car. It would be just another day in the life of Stephanie Plum, except that she becomes the target of a gang---and of an even scarier, more dangerous force that comes to Trenton. With super bounty hunter Ranger acting more mysteriously than ever (and the tension with vice cop Joe Morelli getting hotter), she finds herself with a decision to make: how to protect herself and where to hide while on the hunt for a killer known as the Junkman. There's only one safe place, and it has Ranger's name all over it---if she can find it. And if the Junkman doesn't find her first. With Lula riding shotgun and Grandma Mazur on the loose, Stephanie Plum is racing against the clock in her most suspenseful novel yet. Ten Big Ones is page-turning entertainment, and Janet Evanovich is the best there is.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Secret Lives of Doctors' Wives",
        "Authors": "By Major, Ann",
        "Description": "Pierce Carver was one of Austin's richest, most successful surgeons. And he was going to marry trauma nurse Rose Marie Castle and put her aching feet into glass slippers. Unfortunately, the doctor had a weakness for the allure of youth and feminine perfection. He jilted Rose Marie three years ago, and she's still dreaming of revenge&#133;.And things are looking bad for Rose Marie. The night Pierce died she was inside his magnificent home, half naked and very willing to accept his apologies. Now she's the prime suspect. Worse, her high school sweetheart is the investigating detective. But if Rose Marie didn't kill the not-so-good doctor, who did? Between his ex-wives, his angry stepchildren and the deep, dirty secrets driving their lives, somebody resorted to murder. And it looks as if Dr. Carver kept the biggest, baddest secrets of all&#133;.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Hour Game (King & Maxwell Series, 2)",
        "Authors": "By Baldacci, David",
        "Description": "A man accused of burglary seems innocent . . . but in this #1 New York Times bestseller, two ex-Secret Service agents quickly learn that nothing is more dangerous than the truth.A woman is found murdered in the woods. It seems like a simple case but it soon escalates into a terrible nightmare. Someone is replicating the killing styles of the most infamous murderers of all time. No one knows this criminal's motives...or who will die next.Two ex-Secret Service agents, Sean King and Michelle Maxwell, have been hired to defend a man's innocence in a burglary involving an aristocratic family. Then a series of secrets leads the partners right into the frantic hunt that is confounding even the FBI. Now King and Maxwell are playing the Hour Game, uncovering one horrifying revelation after another and putting their lives in danger. For the closer they get to the truth, the closer they get to the most shocking surprise of all.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Warner Vision Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Aerial Interdiction: Air Power and the Land Battle in Three American Wars",
        "Authors": "By Arakaki, Leatrice R.",
        "Description": "Published by Superintendent of Documents, US Government Printing Office, Washington, DC 20402-9328 for the Pacific Air Forces Office of History, Hickam Air Force Base, Hawaii. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , Military , Aviation",
        "Publisher": "Center for Air Force History /\tUnited States Government Printing",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Sisters: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "Four sisters, a Manhattan brownstone, and a tumultuous year of loss and courage are  at the heart of Danielle Steel’s new novel about a remarkable family, a stunning  tragedy—and what happens when four very different young women come together under  one very lively roof.Twenty-one-year-old Candy is blazing her way through Paris, New York, and Tokyo as fashion’s latest international supermodel. Her sister Tammy, twenty-nine, has a job producing the most successful hit show on TV. In New York, oldest sister Sabrina, thirty-four, is an ambitious young lawyer, while Annie, at twenty-six, is an American in Florence, living for her art. One Fourth of July weekend, the four sisters come home to Connecticut for their family’s annual gathering. But before the holiday is over, tragedy strikes and their world is utterly changed. Suddenly, four sisters who have been fervently pursuing success and their own lives come together to share one New York brownstone, to support each other, and to pick up the pieces while one of them struggles to heal her shattered body and soul. A bustling house is soon filled with eccentric dogs, laughter, tears, friends, men . . . and the kind of honesty and unconditional love only sisters can provide. But as the four women settle in, they are forced to confront the direction of their respective lives.With unerring insight and compassion, Danielle Steel tells a compelling story of sisters who are irrevocably woven into the fabric of one another’s lives. Brilliantly blending humor and heartbreak, she delivers a powerful message about the fragility—and the wonder—of life.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Heart of the Night",
        "Authors": "By Delinsky, Barbara",
        "Description": "Capturing hearts across Rhode Island in his position as a late-night disc jockey, Jared Snow especially captivates Savannah Smith, a prominent lawyer who, despite her attraction, soon suspects that he plays a role in the kidnapping of her friend, while her twin sister Susan finds herself attracted to the rugged detective investigating the crime. Reprint.",
        "Category": "",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Blood Brothers (Sign of Seven)",
        "Authors": "By Roberts, Nora",
        "Description": "#1 New York Times bestselling author Nora Roberts presents the first novel in a compelling trilogy about three brothers bound by fate, blood, and a timeless enemy.In the town of Hawkins Hollow, it’s called The Seven. Every seven years, on the seventh day of the seventh month, strange things happen. It began when three young boys—Caleb, Fox, and Gage—went on a camping trip to The Pagan Stone...  It is only February, but Caleb Hawkins—descendant of the town founders—has already seen and felt the stirrings of evil. Though he can never forget the beginning of the terror in the woods twenty-one years ago, the signs have never been this strong before. Cal will need the help of his best friends Fox and Gage, but surprisingly he must rely on a stranger as well. Reporter Quinn Black came to Hawkins Hollow hoping to make its eerie happenings the subject of her new book. She too can see the evil the locals cannot, somehow connecting her to the town—and to Cal. As winter turns to spring, they will shed their inhibitions, surrendering to a desire that will grow and form the cornerstone of a group of men and women bound by the fight against what is to come from out of the darkness…Don't miss the other books in the Sign of Seven trilogyThe HollowThe Pagan Stone",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Battle Born: A Novel (Patrick McLanahan Series)",
        "Authors": "By Brown, Dale",
        "Description": "Patrick McLanahan is back — and this time he faces his most difficult challenge. He must pull together a team of aggressive, maverick young pilots to face a world on the brink of massive nuclear conflict. It begins with a joint U.S.-Japanese-South Korean mock bombing raid. But the South Korean fighter pilots don't stick to the script. Instead, they race across the border into North Korea to support a massive people's revolt against the Communists.Virtually overnight, the fledgling United Korea is the world's newest nuclear power, igniting a fuse that threatens to blow Asia apart and trigger World War III. Only McLanahan has the top-secret aviation technology and the brash young heroes to stop the coming inferno — if he can get them to stop fighting each other and start fighting as a team before the world is reduced to cinders!",
        "Category": " Fiction , Thrillers , Technological",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Sing with the Wind",
        "Authors": "By Winston O. Abbott",
        "Description": "",
        "Category": "",
        "Publisher": "Inspiration House",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "My Own Private Hero (The American Heiress Series)",
        "Authors": "By MacLean, Julianne",
        "Description": "In this delightful conclusion to the Heiress trilogy, Julianne MacLean brings us a fresh twist on classic historical romance—London society as seen through the eyes of a lovely, light-hearted young outsider.Adele Wilson firmly believes life should be calm and entirely without emotional drama. So the first landed gentleman her mother puts in front of her is the one she agrees to marry, and wedding preparations begin as neatly as she hoped. Until, on the way to seal the deal, her carriage is overtaken by ransomers. And then the ransomers are overtaken by someone handsomer, namely Damien Renshaw, Baron Alcester, cousin to her betrothed. Prim, stately Adele finds that she too is being overtaken, by the manliness of this heroic, albeit complicated man. And Damien is not totally unmoved by her challenging nature, which he believes hides a passion and recklessness never before explored. If only he can get her to explore it with him, there is no telling what kind of love—and excitement—the two of them might discover together.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Treasures: Secret Star / Treasures Lost, Treasures Found",
        "Authors": "By Roberts, Nora",
        "Description": "He was standing face-to-face with a dead woman&#133;and she was holding a gun. Lieutenant Seth Buchanan's homicide investigation was thrown into turmoil when Grace Fontaine turned up very much alive&#151;and in possession of one of the huge blue diamonds known as the Stars of Mithra. Seth never let his feelings get in the way of his job&#133;but it was becoming increasingly difficult with no mystery more compelling than that of Grace herself.Kate Hardesty had inherited a dream: a pile of mysterious charts and notebooks, mapping the way to sunken treasure. Determined to complete her late father's explorations, she returned to the island where she grew up and hired deep-sea diver Ky Silver&#151;the man she'd left behind four years ago. But working with Ky meant more than searching for gold&#133;it meant finding a priceless treasure Kate hadn't been looking for.",
        "Category": " Fiction , Romance , Collections & Anthologies",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "A Cold Heart (Alex Delaware)",
        "Authors": "By Kellerman, Jonathan",
        "Description": "Jonathan Kellerman is a master at creating psychologically nuanced novels of suspense—an author whose name is synonymous with unrelenting action, intriguing plot twists, and penetrating insight into the criminal mind. Now he ventures into bold, new territory with his biggest and best novel yet. A Cold Heart features Kellerman’s brilliant signature style—but in this tour-de-force he mines even deeper the emotional landscape of his characters: psychologist-sleuth Alex Delaware, LAPD homicide detective Milo Sturgis, Milo’s colleague Petra Connor, and Alex’s ex-lover, Robin Castagna—bringing them all vividly to life as never before.“I’ve got a weird one, so naturally I thought of you,” says Milo Sturgis, summoning his friend Alex to the trendy gallery where a promising young artist has been brutally garroted on the night of her first major showing. What makes it “a weird one” is the lack of any obvious motive, and the luridly careful staging of the murder scene—which immediately suggests to Alex not an impulsive crime of passion . . . but the meticulous and taunting modus operandi of a serial killer. Delaware’s suspicion is borne out when he compares notes with Milo’s associate, Petra Connor, and her new partner, a strange, taciturn detective with a past of his own named Eric Stahl. The Hollywood cops are investigating the vicious death of Baby Boy Lee, a noted blues guitarist, fatally stabbed after a late-night set at a local club. What links Baby Boy’s murder with that of painter Juliet Kipper is the shadowy presence of an abrasive fanzine writer. This alias-shrouded critic’s love-the-art/disdain-the-artist philosophy and his morbid fascination with the murders leads Alex and the detectives to suspect they’re facing a new breed of celebrity stalker: one with a fetish for snuffing out rising stars.Tracking down the killer proves to be maddening, with the twisting trail leading from halfway houses to palatial mansions and from a college campus to the last place Alex ever expected: the doorstep of his ex-lover Robin Castagna, whose business association with two of the victims casts her as an unavoidable player in the unfolding case. As more and more killings are discovered, unraveling the maddening puzzle assumes a chilling new importance—stopping a vicious psychopath who’s made cold-blood murder his chosen art form.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Taken (Blockbusters)",
        "Authors": "By Jordan, Chris",
        "Description": "No parent believes it can happen to them&#151;their childtaken from a suburban schoolyard in the gentle hoursof dusk. But as widowed mother Kate Bickford discovers,everything can change in the blink of an eye. One minuteher lanky, amazing, maddening Tommy is begging for icecream. Then in a terrible instant, he's gone. Opening the door to her Connecticut home, hoping to findher son, Kate comes face-to-face with her son's abductor.He wants money. All she has. And if she doesn't followsomething he calls The Method, the consequences willbe gruesome. Her comfortable life collapses as precious secondstick by, and Kate is horrified to uncover the terrible,world-shattering secret she and her son share witha killer who will stop at nothing.&#133;",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Red Sun of Darkover (Daw UE2330) (Darkover)",
        "Authors": "By Bradley, Marion Zimmer",
        "Description": "Spanning generations of Darkover history, this collection of stories journeys into the heart of Darkover power, from the ancient chieri, to the alliance of Ariada Aillard, to Regis Hastur's struggle to bridge the gap between Terrans and the people of Darkover",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Daw Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Prince of Wolves (Val Cache)",
        "Authors": "By Krinard, Susan",
        "Description": "Through with running from the past, Joelle Randall has come to the rugged Canadian Rockies determined to face her pain and begin anew. All she needs is a guide to lead her through the untamed mountain wilderness to the site where her parents’ plane crashed long ago. But the only guide Joelle can find is Luke Gévaudan, a magnetically attractive loner with the feral grace of a wolf and eyes that glitter with a savage intensity. She has no idea that Luke is the stuff of legends, one of the last survivors of an ancient race of werewolves, a man whose passion she will not be able to resist—no matter how terrible the price.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "The Heirs of Hammerfell (Darkover)",
        "Authors": "By Bradley, Marion Zimmer",
        "Description": "",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "DAW",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "The Secret Diaries of Miss Miranda Cheever",
        "Authors": "By Quinn, Julia",
        "Description": "2 March 1810 . . . Today, I fell in love.At the age of ten, Miranda Cheever showed no signs of Great Beauty. And even at ten, Miranda learned to accept the expectations society held for her—until the afternoon when Nigel Bevelstoke, the handsome and dashing Viscount Turner, solemnly kissed her hand and promised her that one day she would grow into herself, that one day she would be as beautiful as she already was smart. And even at ten, Miranda knew she would love him forever.But the years that followed were as cruel to Turner as they were kind to Miranda. She is as intriguing as the viscount boldly predicted on that memorable day—while he is a lonely, bitter man, crushed by a devastating loss. But Miranda has never forgotten the truth she set down on paper all those years earlier—and she will not allow the love that is her destiny to slip lightly through her fingers . . .",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Forever and Always (Forever Trilogy)",
        "Authors": "By Deveraux, Jude",
        "Description": "\"This is Jude Deveraux at her most pleasurable,\" hailed Booklist in praise of her powerful bestseller Forever....Now Deveraux brings back her gifted heroine, Darci Monroe, in a riveting new novel of endless love and shadowed secrets.  Forever and Always  Darci's psychic abilities have always guided her through hardship...and into a once-in-a-lifetime love with her rich, powerful husband, Adam Montgomery. When Adam vanishes in a mysterious accident, a grief-stricken Darci is left alone to raise their young daughter. But her instinct tells her the reports of Adam's death are untrue. When the FBI enlists her intuitive talents to solve a heinous crime, she agrees -- if they'll help to uncover the truth about Adam. It may be a tougher deal than Darci imagined: she must go head-to-head with Jack Rose, a criminal whose mind power matches Darci's at every turn. Now Darci must discover if those in the highest circles of authority have her best interests at heart -- or if someone intends to sever the everlasting bond she shares with her one true love.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Shadow Dance: A Novel (Buchanan-Renard)",
        "Authors": "By Garwood, Julie",
        "Description": "Jordan Buchanan is thrilled that her brother and best friend are tying the knot. The wedding is a lavish affair–for the marriage of Dylan Buchanan and Kate MacKenna is no ordinary occasion. It represents the joining of two family dynasties. The ceremony and reception proceed without a hitch–until a crasher appears claiming to be a MacKenna guest. The disheveled and eccentric professor of medieval history warns that there’s “bad blood” between the couple’s clans, stemming from an ancient feud that originated in Scotland, and involving the Buchanan theft of a coveted MacKenna treasure.Jordan has always led a cautious life and has used her intelligence and reason to become a successful businesswoman. So she is intrigued but skeptical of the professor’s claims that the feud has been kept alive by the grave injustices the Buchanans have perpetrated over the centuries. But when Noah Clayborne, a close family friend and a man who has never let a good time or a pretty girl pass him by, accuses Jordan of being trapped in her comfort zone, she determines to prove him wrong and sets out on a spontaneous adventure to the small, dusty town of Serenity, Texas, to judge the professor’s research for herself.Maneuvering through a close-knit community in which everyone knows everyone else’s business, Jordan never anticipates the danger and intrigue that lie in her path, nor the threat that will shadow her back to Boston, where even in familiar surroundings, her life is at risk.A powerful thug who rules by fear, a man who harbors a simmering secret, and an unexpected romance that pierces all defenses–beloved author Julie Garwood weaves these dazzling elements into a brilliant novel of romantic suspense. Shadow Dance is a searing tango of passion and peril.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "It Must Be Magic",
        "Authors": "By Skully, Jennifer",
        "Description": "Widower Tanner Rutland couldn't believe it when hefound himself tiptoeing through a redwood forestlooking for a dead body. How could he think, evenfor a second, that Fluffy had witnessed a murder?It was no use. One look into her gorgeous eyes—Lili's,not Fluffy'—and Tanner was a goner.And when he finally kissed her…pure magic.Now he had to decide if Lili's gift with animals reallydid exist—or if she just had a screw loose. But deepdown, his heart was telling him to find the real killerand prove his Dr. Dolittle was innocent.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Stars: An Anthology (The Stars of Mithra)",
        "Authors": "By Roberts, Nora",
        "Description": "Diamonds can be a girl's best friend&#133; or her worst enemy.Hidden StarShe couldn't remember a thing, not even who she was. But it was clear Bailey James was in trouble. Big trouble. And she desperately needed private eye Cade Parris to help her find out just what kind. Surely she wasn't a criminal&#151;but then what on earth was she doing with a bag full of cash and a stunning blue diamond as big as a baby's fist?Captive StarSomeone had set them both up. Now, handcuffed together, bounty hunter Jack Dakota and bail jumper M. J. O'Leary were on the run from a pair of hired killers. And M.J. wasn't talking&#151;not even when Jack found a gigantic blue diamond hidden in her purse. Everything told Jack the sexy skip he'd been hired to recover couldn't be trusted&#133;everything, that is, but his heart.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Brother Odd (Odd Thomas Novels)",
        "Authors": "By Koontz, Dean R.",
        "Description": "Loop me in, odd one. The words, spoken in the deep of night by a sleeping child, chill the young man watching over her. For this was a favorite phrase of Stormy Llewellyn, his lost love, and Stormy is dead, gone forever from this world. In the haunted halls of the isolated monastery where he had sought peace, Odd Thomas is stalking spirits of an infinitely darker natureThrough two New York Times bestselling novels Odd Thomas has established himself as one of the most beloved and unique fictional heroes of our time. Now, wielding all the power and magic of a master storyteller at the pinnacle of his craft, Dean Koontz follows Odd into a singular new world where he hopes to make a fresh beginning—but where he will meet an adversary as old and inexorable as time itself. St. Bartholomew’s Abbey sits in majestic solitude amid the wild peaks of California’s high Sierra, a haven for children otherwise abandoned, and a sanctuary for those seeking insight. Odd Thomas has come here to learn to live fully again, and among the eccentric monks, their other guests, and the nuns and young students of the attached convent school, he has begun to find his way. The silent spirits of the dead who visited him in his earlier life are mercifully absent, save for the bell-ringing Brother Constantine and Odd’s steady companion, the King of Rock 'n' Roll.But trouble has a way of finding Odd Thomas, and it slinks back onto his path in the form of the sinister bodachs he has met previously, the black shades who herald death and disaster, and who come late one December night to hover above the abbey’s most precious charges. For Odd is about to face an enemy who eclipses any he has yet encountered, as he embarks on a journey of mystery, wonder, and sheer suspense that surpasses all that has come before.From the Hardcover edition.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Over the Hill & on a Roll: Laugh Lines for the Better Half of Life",
        "Authors": "By Phillips, Bob",
        "Description": "After selling more than 300,000 copies, Over the Hill and On a Roll gets a well-deserved face lift. The jokes never get old, even if readers do! They'll enjoy laughing at insights, checking their recall ability, and taking the history quizzes created by bestselling jokester Bob Phillips. He teases and tests: You know you're over the hill when…Opportunity knocks but your hearing aid's turned off.Ninety percent of your dreams are reruns.You remember when \"hardware\" only referred to a store.Packed with wisdom and fascinating facts, Over the Hill and On a Roll celebrates the passing of time and pokes fun at what lies ahead. The perfect birthday, anniversary, retirement, or friendship gift.",
        "Category": " Humor , Form , Jokes & Riddles",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Three in Death",
        "Authors": "By Robb, J. D.",
        "Description": "#1 New York Times bestselling author J. D. Robb delivers a potent combination of futuristic suspense, thrills, and passion in these three favorite In Death stories—together in one volume for the first time.INTERLUDE IN DEATHLieutenant Eve Dallas is resigned to the fact that she’s been ordered to give a seminar at a police conference—and that she’ll have to leave Earth to do it. But her dedication to her job only goes so far. And when a legendary commander sets his sights on taking her husband, Roarke down, Eve will do everything in her power to stop him…   MIDNIGHT IN DEATH Eve’s name has made a Christmas list, but it’s not for being naughty or nice. It’s for putting a serial killer behind bars. Now the escaped madman is dogging her steps. With Roarke at her side, Eve must stop the man from exacting his bloody vengeance—or die trying…   HAUNTED IN DEATH At the scene of a murder, Eve uncovers the remains of beautiful singer who went missing eighty-five years earlier. Both victims were shot with the same gun, in a building rumored to be haunted by the singer’s ghost. But Eve focuses her attention on those in the here-and-now who had a bone to pick with the dead…",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Black Rose (In The Garden Trilogy)",
        "Authors": "By Roberts, Nora",
        "Description": "#1 New York Times bestselling author Nora Roberts presents the second novel of her In the Garden trilogy, as three women must discover the secrets from the past contained within their historic home… A Harper has always lived at Harper House, the centuries-old mansion just outside of Memphis. And for as long as anyone alive remembers, the ghostly Harper Bride has walked the halls, singing lullabies at night… At forty-seven, Rosalind Harper is a woman whose experiences have made her strong enough to bend without breaking—and to weather any storm. A widow with three grown sons, she survived a disastrous second marriage and built her In the Garden nursery from the ground up. Through the years, In the Garden has become more than just a thriving business—it is a symbol of hope and independence to Roz, and to the two women she shares it with. Newlywed Stella and new mother Hayley are the sisters of her heart, and together, the three of them are the future of In the Garden. Hired to investigate Roz’s Harper ancestors, Dr. Mitchell Carnegie finds himself just as intrigued by Roz herself. And as they begin to resurrect old secrets, Roz is shocked to find herself falling for the fascinating genealogist—even when he learns more about her than anyone has before… Don't miss the other books in the In the Garden trilogy Blue DahliaRed Lily",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Jet Fighter: The Harrier Av-8B (High Interest Books: High-Tech Military Weapons)",
        "Authors": "By Beyer, Julie",
        "Description": "Describes the features and capabilities of the Harrier, and explains how the United States armed forces use it in combat.",
        "Category": " Juvenile Nonfiction , Transportation , Aviation",
        "Publisher": "Childrens Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Boomer",
        "Authors": "By Taylor, Charles",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Valley of Silence (The Circle Trilogy, Book 3)",
        "Authors": "By Roberts, Nora",
        "Description": "#1 New York Times bestselling author Nora Roberts presents the electrifying conclusion to her powerful Circle Trilogy. Worlds have collided and centuries have elapsed as six people have brought their unique powers, their courage, and their hearts to a battle that could drown humanity in darkness…   Her face, so pale when she’d removed her cloak, had bloomed when her hand had taken the sword. Her eyes, so heavy, so somber, had gone as brilliant as the blade. And had simply sliced through him, keen as a sword, when they’d met his…        In the kingdom of Geall, the scholarly Moira has taken up the sword of her people. Now, as queen, she must prepare her subjects for the greatest battle they will ever fight—against an enemy more vicious than any they have seen. For Lilith, the most powerful vampire in the world, has followed the circle of six through time to Geall.   Moira also has a personal score to settle. Vampires killed her mother—and now, she is ready to exact her revenge. But there is one vampire to whom she would trust her soul…   Cian was changed by Lilith centuries ago. But now, he stands with the circle. Without hesitation, he will kill others of his kind—and has earned the respect of sorcerer, witch, warrior, and shape-shifter. But he wants more than respect from Moira—even though his desire for her makes him vulnerable. For how can a man with an eternity to live love a woman whose life is sure to end—if not by Lilith’s hand, then by the curse of time?Don’t miss the other books in the Circle Trilogy  Morrigan’s Cross Dance of the GodsFrom the Trade Paperback edition.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Metaphase",
        "Authors": "By McIntyre, Vonda N.",
        "Description": "The third installment in the Starfarers series finds J. D. Sauvage and the crew preparing to meet the reclusive alien \"squidmoth,\" who presents them with a dubious offer for which they must risk everything. Reissue.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "A Quiet of Stone",
        "Authors": "By Leigh, Stephen",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Murder on the QE2: Murder She Wrote",
        "Authors": "By Fletcher, Jessica and Bain, Donald",
        "Description": "Bestselling mystery writer and amateur sleuth Jessica Fletcher is invited to travel to London on the grand dame of ocean liners, the Queen Elizabeth II, as one of seven guest lecturers. The night they set sail, a fellow speaker is found brutally murdered. Now Jessica has just four days at sea to find the killer...before she finds more of her colleagues, or even herself, dead in the water!",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Dragon Weather (Obsidian Chronicles)",
        "Authors": "By Watt-Evans, Lawrence",
        "Description": "Arlian had never left his home village in the Obsidian Mountains. The green hills, white peaks, and black glass were all he had ever known of life, and though he dreamed of travel and adventure, he knew deep in his heart that he would probably never leave.Until the dragon weather came. Incredible heat, oppressive humidity, dark and angry clouds . . . and dragons. Dragons with no feelings, no empathy, no use for humans; dragons who destroyed his entire village and everyone in it. Everyone, that is, except Arlian.Orphaned and alone, Arlian the child is captured by looters and sold as a mining slave. Seven years later Arlian the man escapes, fueled by years of hatred for the dragons, bandits, and slavers that took his youth away--and a personal vow to exact retribution from those who have wronged him.As Arlian makes his way through life, he is obsessed with the concept of justice, and that obsession informs every task, every decision. Even Black, the man he befriends and grows to love as a brother, has little influence against Arlian's obsession. His entire life has one purpose, and one purpose only: to mete out justice. But can one righteous man change the entire world for the better? Or is he doomed by his own actions to become as unjust as those he seeks to destroy? Arlian had never left his home village in the Obsidian Mountains. The green hills, white peaks, and black glass were all he had ever known of life, and though he dreamed of travel and adventure, he knew deep in his heart that he would probably never leave.Until the dragon weather came. Incredible heat, oppressive humidity, dark and angry clouds . . . and dragons. Dragons with no feelings, no empathy, no use for humans; dragons who destroyed his entire village and everyone in it. Everyone, that is, except Arlian.Orphaned and alone, Arlian the child is captured by looters and sold as a mining slave. Seven years later Arlian the man escapes, fueled by years of hatred for the dragons, bandits, and slavers that took his youth away--and a personal vow to exact retribution from those who have wronged him.As Arlian makes his way through life, he is obsessed with the concept of justice, and that obsession informs every task, every decision. Even Black, the man he befriends and grows to love as a brother, has little influence against Arlian's obsession. His entire life has one purpose, and one purpose only: to mete out justice. But can one righteous man change the entire world for the better? Or is he doomed by his own actions to become as unjust as those he seeks to destroy?",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Fantasy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Night Whispers (3) (The Paradise series)",
        "Authors": "By McNaught, Judith",
        "Description": "Nine New York Times bestsellers and more than twenty million books in print have affirmed Judith McNaught's stature as the reigning monarch of superb storytelling. Now, she creates breathtaking suspense and harrowing plot twists in her most masterful, enthralling novel yet.A policewoman in a small Florida community, Sloan Reynolds knows that her modest upbringing was a long way from the social whirl of Palm Beach, the world inhabited by her father and her sister, Paris. Total strangers to Sloan, they have never tried to contact her—until a sudden invitation arrives, to meet them and indulge in the Palm Beach social season.  A woman who values her investigative work more than a Dior dress, Sloan is unmoved by the long-overdue parental gesture. But when FBI agent Paul Richardson informs her that her father and his associates are suspected of fraud, conspiracy, and murder, Sloan agrees to enter into her father's life—while hiding her true profession.  Sloan's on top of her game until she meets Noah Maitland, a multinational corporate player and one of the FBI's prime suspects—and finds herself powerfully attracted to him, against her deepest instincts. When a shocking murder shatters the seductive facade of the wealth and glamour surrounding her, Sloan must maneuver through a maze of deceit and passion, to find someone to trust—and to decipher the truth behind those terrifying whispers in the dark.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Thai Horse: A Novel",
        "Authors": "By Diehl, William",
        "Description": "\"It's enough to make Ludlum seem humdrum.\"ATLANTA JOURNAL & CONSTITUTIONChristian Hatcher, the licensed killer they call the Shadow Warrior, is out of jail and looking for the betrayer that got him there. With his body wasted and his spirit nearly crushed, Hatcher returns to Hong Kong and Bangkok--deadly stops on the heroine pipeline--and comes closer to a solution that he fears to discover . . . .\"Diehl knows how to tell a story, and his novel moves.\"THE NEW YORK TIMES BOOK REVIEW",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "A Sparrow Falls",
        "Authors": "By Collins, Marion Smith",
        "Description": "Four courageous young women living in Seattle, Washington, during the Second World War face love and sacrifice as they pull together with the rest of the nation to help support their men fighting overseas",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "A Quick Bite (Argeneau Vampires, Book 1)",
        "Authors": "By Sands, Lynsay",
        "Description": "That hot guy tied to Lissianna Argeneau’s bed? He’s not dessert—he’s the main course!Lissianna has been spending her centuries pining for Mr. Right, not just a quick snack, and this sexy guy she finds in her bed looks like he might be a candidate. But there’s another, more pressing issue: her tendency to faint at the sight of blood . . . an especially annoying quirk for a vampire. Of course, it doesn’t hurt that this man has a delicious-looking neck. What kind of cold-blooded vampire woman could resist a bite of that?Dr. Gregory Hewitt recovers from the shock of waking up in a stranger’s bedroom pretty quickly—once he sees a gorgeous woman about to treat him to a wild night of passion. But is it possible for the good doctor to find true love with a vampire vixen, or will he be just a good meal? That’s a question Dr. Greg might be willing to sink his teeth into . . . if he can just get Lissianna to bite.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2020"
        }
    },
    {
        "Title": "Elizabeth Bowen",
        "Authors": "By Glendinning, Victoria",
        "Description": "",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1979"
        }
    },
    {
        "Title": "Lone Eagle: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "Danielle Steel's fifty-first bestselling novel tells the story of an extraordinary man, the woman who loved him, and a bond so powerful it could never be broken. It is about finding the courage to let someone you love fly free....The phone call came on a snowy December afternoon. Kate was certain it was Joe, the brilliant, visionary man who had been her soulmate, her driving force since the night they met, almost thirty-four years before. What she got was the one call she had never wanted, and didn't expect. As the snow continued to fall, Kate's mind drifted back, to the moment when she and Joe first met. She had been just seventeen and he was young, powerful, dazzling, and different from any man she'd ever known.It was just days before Christmas, 1940. The war is raging in Europe when Kate Jamison makes her debut in New York City. In a room filled with the scions of East Coast society and the leading political figures of the day, it is Joe Allbright who catches Kate's eye. At twenty-nine, Joe is the brilliant protege of Charles Lindbergh, and already a legend in flying circles for his record-breaking speed and state-of-the-art airplane designs. All Kate sees is a tall, strikingly handsome man who seems at once awkward and larger-than-life, like a shining star -- just out of reach. Joe, too, is caught off balance by his response to Kate, seeing in this beautiful young woman vitality and youth, the lifelong soulmate he never expected to find. As the months pass, they will meet again, forging a bond that will set the course of both their lives. Kate will go off to study at Radcliffe. Joe will skyrocket to fame in modern aviation. Joe's planes are his life, his passion. But irresistibly drawn to her, like moth to flame, he always comes back to Kate. Even after the long, dark years of World War II, when Kate was sure she had finally lost him completely, Joe returns. Never willing to stay, always needing to fly away. As planes are for him, Joe is the passion in her life.When the war is over, at twenty-four Kate wants marriage and a family. Joe wants the world, his limitless horizons, and the unique aviation empire he is building. Unwilling to wait any longer, Kate moves on with her life. But when a chance encounter brings them together again, the time has finally come to make a choice, one that will have profound consequences for them both for the rest of their lives.Against a vivid backdrop of war and thrilling innovation, Danielle Steel breathes life into history, weaving an intensely human story that spans three decades, of two intensely different people who, in spite of themselves, are irrevocably woven into the fabric of each other's lives. With rare insight and emotional power, she brings to life a tale of unconditional love, sacrifice, and compromise--the joining of two remarkable halves into a single, far more powerful whole. It is a novel of extraordinary grace and compassion from a master storyteller, perhaps the best story she has told.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Frosty: A Raccoon to Remember",
        "Authors": "By Harriett E. Weaver",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The Only One",
        "Authors": "By Feehan, Christine, Squires, Susan, Grant, Susan, Feehan, Christine (EDT), Grant, Susan (EDT), and Squires, Susan (EDT)",
        "Description": "In three novellas, vampires and an underground warrior on a devastated planet struggle to find and win their one true loves--the only women who can match their passion and bring them salvation.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Dorchester Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "There Is No Darkness",
        "Authors": "By Joe Haldeman, Jack C. Haldeman II",
        "Description": "",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "One Wish",
        "Authors": "By Miller, Linda Lael",
        "Description": "New York Times bestselling author Linda Lael Miller gave readers \"a gift to treasure\" (Romantic Times) with her acclaimed Springwater Seasons novels. Now, once again capturing the spirit of early America, she delivers a marvelous tale of love, family loyalty, and passionate desire on the Western frontier -- where fairy tales sometimes do come true.  She was the only child of a rich and powerful rancher. He was the son of a drunken ne'er-do-well. But when eleven-year-old Luke Shardlow rescued eight-year-old Charity Barnham from drowning, she promised him one wish...any wish his heart might desire.  Fifteen years later, Charity and Luke meet once more, but the gulf between them seems as wide as ever. Charity is engaged to a neighboring rancher her father has chosen for her. Luke still seems to be a Shardlow to the core -- a drifter, maybe even an outlaw, on a road to nowhere. But things are not always what they appear, for Luke has a few secrets to hide. And as a sweet, sensual passion begins to grow between them, Luke and Charity discover that the only wish either of them long to fulfill is to spend a sweet eternity in each other's arms -- no matter the cost.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Between the Strokes of Night",
        "Authors": "By Sheffield, Charles",
        "Description": "By leaving their home planet after the final nuclear war, a group of young people live to see the spectacular series of scientific advances and human tribulations of the near and far future",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "The Lion Game (Telzey Amberdon Stories)",
        "Authors": "By James H. Schmitz -",
        "Description": "",
        "Category": "",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Spring Fancy",
        "Authors": "By Spencer, LaVyrle",
        "Description": "From New York Times bestselling author LaVyrle Spencer comes a novel that perfectly captures the tender and delicate beginnings of love in bloom.   Confident and practical, Winn never imagined anything—or anyone—could overturn her perfect world and perfect wedding plans. But in a single passing moment, her heart told her otherwise.   Joseph knew Winn’s love was promised to another man, that he must hide his heartfelt passions. But he also knew that the heart doesn’t lie: This was that love of a lifetime.   They met at a spring wedding, only months before Winn’s own. Were they carried away by the intoxicating spirit of the moment? Or was this the start of a love they would cherish forever?",
        "Category": " Fiction , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Equus: A Play",
        "Authors": "By Shaffer, Peter",
        "Description": "The Tony Award-winning drama deals with a psychiatrist's exploration of the psyche of a troubled seventeen-year-old boy who senselessly and systematically blinds six horses",
        "Category": " Drama , European , English, Irish, Scottish, Welsh",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1977"
        }
    },
    {
        "Title": "The Hollow (Sign of Seven Trilogy, Book 2)",
        "Authors": "By Roberts, Nora",
        "Description": "#1 New York Times bestselling author Nora Roberts continues the thrilling trilogy of a town plagued by evil—and the three men and three women brought together by fate to fight it.For Fox, Caleb, Gage and the other residents of Hawkins Hollow, the number seven portends doom—ever since, as boys, they freed a demon trapped for centuries when their blood spilled upon The Pagan Stone…   Now, as the dreaded seventh month looms before them, the men can feel the storm brewing. Already they are plagued by visions of death and destruction. But this year, they are better prepared, joined in their battle by three women who have come to The Hollow. Layla, Quinn, and Cybil are somehow connected to the demon, just as the men are connected to the force that trapped it.   Since that day at The Pagan Stone, town lawyer Fox has been able to see into others’ minds, a talent he shares with Layla. He must earn her trust, because their link will help fight the darkness that threatens to engulf the town. But Layla is having trouble coming to terms with her newfound ability—and this intimate connection to Fox. She knows that once she opens her mind, she’ll have no defenses against the desire that threatens to consume them both… Don't miss the other books in the Sign of Seven TrilogyBlood BrothersThe Pagan Stone",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    }
]