[
    {
        "Title": "WHEN YOU WERE A BABY (Learning Ladders)",
        "Authors": "By Dunn, Phoebe (ILT) and Ross, Katharine",
        "Description": "A parent describes for a child all the things experienced in babyhood, from the first perceptions of sight and sound to the beginning of crawling and walking.",
        "Category": "",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Big Dog . . . Little Dog (Bright & Early Board Books(TM))",
        "Authors": "By Eastman, P. D.",
        "Description": "Follows a day in the life of Ted and Fred, canine best friends who introduce young children to the concepts of size, color, and opposites. By the author of Go, Dog, Go! and Are You My Mother?",
        "Category": " Juvenile Fiction , Transportation , Railroads & Trains",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Bluebell (Petal Pixies)",
        "Authors": "By Michi Fujimoto",
        "Description": "",
        "Category": "",
        "Publisher": "Paradise Press, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Quick & Easy Sushi Cook Book",
        "Authors": "By Heihachiro Tohyama, Yukiko Moriyama",
        "Description": "",
        "Category": "",
        "Publisher": "JP Trading",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Libertine's Kiss (Hqn)",
        "Authors": "By James, Judith",
        "Description": "Abandoned by his cavalier father at a young age, William de Veres grew up knowing precious little happiness. But William has put the past firmly behind him and as a military hero and noted rake, he rises fast in the ranks of the hedonistic Restoration court. Though not before he is forced to seek shelter from a charming young Puritan woman…The civil wars have cost the once-high-spirited Elizabeth Walters her best friend and her father, leaving her unprotected and alone.  She  flees  an  unwanted  marriage,  seeking  safe  haven, but what she finds is something she never expected. When her kindness and her beauty bring her to the attention of William, and then the king, she will have a choice to make. After all, can a notorious libertine really be capable of love?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "HQN Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "His Christmas Pleasure (Scandals and Seductions, 4)",
        "Authors": "By Maxwell, Cathy",
        "Description": "New York Times bestselling author Cathy Maxwell gifts historical romance lovers with a steamy and sensational Christmas present: His Christmas Pleasure, the fourth book in her popular Scandals and Seductions series. The winter holidays have never been hotter than in this delicious tale of a marriage of convenience that becomes an unexpected gift of passionate love in a season of joy and giving.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Running For President",
        "Authors": "By Martin Schram",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1977"
        }
    },
    {
        "Title": "Teaching Adults: A Literacy Resource Book",
        "Authors": "By Laubach Literacy Action (COR)",
        "Description": "",
        "Category": " Education , Adult & Continuing Education",
        "Publisher": "New Readers Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "How to Take Charge of Your Life",
        "Authors": "By Mildred Newman",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Mental Health or Mental Illness",
        "Authors": "By Glasser, William",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "At Some Disputed Barricade: A Novel (World War I)",
        "Authors": "By Perry, Anne",
        "Description": "Anne Perry’s gift for illuminating the heart’s deepest secrets shines through in her bestselling series of World War I novels. With compelling immediacy, she depicts the struggles of men and women torn by their convictions and challenged by the perils of war.July 1917. Joseph Reavley, a chaplain, and his sister, Judith, an ambulance driver, are bone-weary as they approach the fourth year of the conflict; the peace of the English countryside seems a world away. On the Western Front, the Battle of Passchendaele has begun, and among the many fatalities from Joseph’s regiment is the trusted commanding officer, who is replaced by a young major whose pompous incompetence virtually guarantees that many good soldiers will die needlessly. But soon he, too, is dead–killed by his own men. Although Joseph would like to turn a blind eye, he knows that he must not. Judith, however, anguished at the prospect of courts-martial and executions for the twelve men arrested for the crime, has no such inhibitions and, risking of her own life, helps all but one of the prisoners to escape.Back in England, Joseph and Judith’s brother, Matthew, continues his desperate pursuit to unmask the sinister figure known as the Peacemaker–an obsessed genius who has committed murder and treason in an attempt to stop Britain from winning the war. As Matthew trails the Peacemaker, Joseph tracks his comrades through Switzerland and into enemy territory. His search will lead to a reckoning pitting courage and honor against the blind machinery of military justice.At Some Disputed Barricade is an Anne Perry masterpiece–brilliant, surprising, and unforgettable.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "American art nouveau glass",
        "Authors": "By Revi, Albert Christian",
        "Description": "",
        "Category": "",
        "Publisher": "Nelson",
        "Price Starting With ($)": "10.02",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Bambi's Children",
        "Authors": "By Salten, Felix",
        "Description": "",
        "Category": "",
        "Publisher": "Wonder Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "Genealogy Online for Dummies",
        "Authors": "By Helm, Matthew L. and Helm, April Leigh",
        "Description": "Tells how to get started in researching one's family, describes useful online sources of genealogical information, and discusses setting up one's own Web site",
        "Category": " Reference , Genealogy & Heraldry",
        "Publisher": "IDG Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Reconciliation (Sacrament Preparation Program): We Are Your People, the Sheep of Your Flock",
        "Authors": "By RCL",
        "Description": "",
        "Category": "",
        "Publisher": "Resources For Christian Living",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "4 Months to A 4 Hour Marathon: Everything a Runner Needs to Know About",
        "Authors": "By Kuehls, Dave",
        "Description": "Let Four Months to a Four-Hour Marathon be your personal trainer. Whether you’re a competitive veteran or a recreational beginner, this essential guide will tell you exactly what to eat, what to wear, what to expect, and how to train. When race day arrives, author Dave Kuehls, contributing editor at Runner’s World and a marathoner himself, will have you in the best shape of your life—physically and mentally. All you have to do is take the first step.Four Months to a Four-Hour Marathon includes:• Day-by-day training schedules for 4-hour and 5-hour marathoners• Detailed diet plans• The marathoner’s mind-set• Right and wrong things to wear• How to pick the right sneakers• Pain vs. performance—how far to go• Common pitfalls to avoid—in training and during the race• A list of the 36 marathons in North America where you can run the fastest times",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "Tarcherperigree",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Festive Dessert Cookery",
        "Authors": "By Loeb, Evelyn (COM)",
        "Description": "",
        "Category": "",
        "Publisher": "Olympic Marketing Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1967"
        }
    },
    {
        "Title": "Money to Burn: A Novel of Suspense",
        "Authors": "By Grippando, James",
        "Description": "“Money to Burn takes off like a rocket from page one and never slows down. Highly recommended.” — Christopher Reich, author of Rules of Vengeance In this timely stand-alone thriller ripped from the headlines, bestselling author James Grippando (Lying with Strangers, Intent to Kill, Born to Run) explores a world in which the destruction of financial institutions and the people who run them can occur in a matter of hours—even minutes. Fans of John Grisham’s The Firm and the thrillers of Lisa Scottoline and Phillip Margolin are sure to love Money to Burn: a “perfectly mixed cocktail of dry wit, sophisticated voice, believable characters, [and] non-stop suspense” (Joseph Finder, author of Vanished and Paranoia).",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Schott's Almanac 2007",
        "Authors": "By Schott, Ben",
        "Description": "Schott's Almanac redefines the traditional almanac to present a record of the year just past and is designed to be read, not merely consulted.  Practical and entertaining, it tells the real stories of 2006, from the winner of American Idol to the Supreme Court nominations (including how different justices have voted), from baseball and football statistics to the founder of amazon.com's new private rocketship factory. In an age when information is plentiful but selection is rare, Schott's Almanac offers both the essential facts and the lucid, provocative analysis. It is comprehensive, innovative, endlessly engaging – in short, indispensable.",
        "Category": " Reference , Almanacs",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Book of Confessions: The Constitution of the Presbyterian Church (USA) Part I",
        "Authors": "By Presbyterian Church Office of the General Assembly",
        "Description": "",
        "Category": "",
        "Publisher": "Office of the General Assembly",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "After America: Narratives for the Next Global Age",
        "Authors": "By Starobin, Paul",
        "Description": "Journalist Starobin mixes fresh reportage with rigorous historical analysis to envision a world in which the United States is no longer the dominant superpower. The American Century has passed, argues Starobin, due in large part to America's military overreach in the Middle East; resurgent nationalism and economic expansion in Russia, China, and India; the tarnished American model of free-market capitalism; and the growth of transnational institutions. Following an insightful analysis of America's globalascendancy, Starobin explores five possible scenarios: an age of chaos like the one following the collapse of the Roman Empire; a multipolar order of nations in which America would be one great power among others; China becoming the dominant superpower; an age of global city-states; or a form of world government. A concluding section explores how California--the eighth largest economy in the world and among the most sophisticated spots on the planet--is already starting to move beyond the American Century.--From publisher description.",
        "Category": " Political Science , Globalization",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "The Hidden Oasis",
        "Authors": "By Sussman, Paul",
        "Description": "Freya Hannan arrives in Egypt for the funeral of her elder sister Alex, a desert explorer who has lived in the Middle East for the past fifteen years. Recently diagnosed with a degenerative neurological condition, Alex has taken her own life. Freya is met at Luxor Airport by a colleague of her sister’s, who drives her the 515 kms to Dakhla Oasis where Alex lived. Only one other non-Egyptian is present at the funeral: Professor Flinders ?Flin’ Brodie, 45 - tall, rugged, handsome - a world authority on pre-dynastic Egypt. The funeral over, Freya spends the next few days sorting through her sister’s possessions and finding out more about her suicide. As she does so, she becomes increasingly uneasy.When a Bedouin turns up at Alex’s home with the objects they have found in the desert, explaining that she had promised to pay them for news of any unusual remains - especially Soviet remains - discovered out in the western wilderness, Freya realizes that it is not only her sister’s death that raises questions, but her life as well.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The KU Handbook for Writers - Second Edition",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "Insiders' Guide to Baltimore, 4th (Insiders' Guide Series)",
        "Authors": "By Evitts, Elizabeth A. and Jones-Bonbrest, Nancy",
        "Description": "This in-depth guide to the \"northernmost Southern city\" includes the inside scoop on Baltimore's arts community, hundreds of antiques shops, hometown teams, recreation on the Chesapeake Bay, and how to eat blue crabs.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "6.69",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Project Date (Zebra Contemporary Romance)",
        "Authors": "By Perry, Kate",
        "Description": "Philomena Donovan makes a mess of her romantic life when she uses her ex-boyfriend's best friend, Rio, in her crazy plan to get one up on her superior sister and actually falls in love with him. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Index of Leading Spiritual Indicators",
        "Authors": "By Barna, George",
        "Description": "George Barna provides an overview of the facts and trends indicating a radical change in the spiritual landscape of our country. A compact, yet comprehensive tool for church leaders who seek to be \"in touch\" with the growing non-Christian population.",
        "Category": "",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Perl and CGI for the World Wide Web, Second Edition",
        "Authors": "By Castro, Elizabeth",
        "Description": "Perl is one of the most popular scripting languages for adding powerful interactive features to Web pages. Perl lets you place forms on your site that collect and process user input such as comments and product orders; enables visitors to search for information; and can integrate a database into your site, among its many other capabilities. Perl and CGI for the World Wide Web, 2nd Edition: Visual QuickStart Guide fully revised and updated since its original 1998 release, gets users to the core of CGI scripting with Perl. Even first-time programmers will be able to create useful, workable scripts from scratch, or adapt and customize existing scripts to their own needs. Hundreds of screen shots and clear, easy-to-understand directions make this the perfect Perl book for beginners, as well as a handy reference for those with previous programming experience.",
        "Category": " Computers , Networking , Network Protocols",
        "Publisher": "Peachpit Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Judicial Process: An Introductory Analysis of the Courts of the United States, England and France",
        "Authors": "By Abraham, Henry J.",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1976"
        }
    },
    {
        "Title": "The Deerslayer (Bantam Classics)",
        "Authors": "By Cooper, James Fenimore",
        "Description": "The deadly crack of a long rifle and the piercing cries of Indians on the warpath shatter the serenity of beautiful Lake Glimmerglass. Danger has invaded the vast forests of upper New York State as Deerslayer and his loyal Mohican friend Chingachgook attempt the daring rescue of an Indian maiden imprisoned in a Huron camp. Soon they are caught in the cross fire between a cunning enemy and two white bounty hunters who mercilessly kill for profit.The last of the Leatherstocking Tales to be written, though first in the chronology of the hero’s life, The Deerslayer is James Fenimore Cooper’s masterpiece. A fine combination of romance, adventure, and morality, this classic novel of the frontier is an eloquent beginning for Cooper’s great wildernes saga—and an unforgettable introduction to the famous character who has been said to embody the conscience of America: the noble woodsman Deerslayer.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Michelin Red Guide 2006 New York City: Hotels & Restaurants (Michelin Red Guides)",
        "Authors": "By Michelin Travel Publications (EDT)",
        "Description": "",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Michelin Travel Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Middle Eastern Minorities: Between Integration and Conflict (Washington Institute for Near East Policy Papers, No. 50) (Policy Papers (Washington Institute for Near East Policy), No. 50.)",
        "Authors": "By Maoz, Moshe",
        "Description": "A broad survey of the historic and current role of religious and ethnic minorities in the Fertile Crescent, Egypt, and Sudan.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Washington Institute for Near East Policy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Adventures for Growing Families: 52 Weeks of Life-Related Devotions for Families With Grade-School Children",
        "Authors": "By Haystead, Wes and Haystead, Sheryl",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Black Beauty (Great Classics for Children series)",
        "Authors": "By Anna Sewell",
        "Description": "",
        "Category": "",
        "Publisher": "DALMATION PRESS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Quick Escapes Washington, D.C., 5th: Getaways from the Nation's Capital (Quick Escapes Series)",
        "Authors": "By Fitzpatrick, John and Burkhalter, Holly J.",
        "Description": "Go hiking in Shenandoah National Park in Virginia; visit Fallingwater in the Laurel Highlands of Pennsylvania; or stay at a Victorian cottage in Cape May, New Jersey--twenty-four minivacations take readers away from the hustle and bustle of our nation's capital.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Highest Tide",
        "Authors": "By Lynch, Jim",
        "Description": "",
        "Category": "",
        "Publisher": "Bloomsbury Publishing PLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Bessie Blue Killer: A Hobart Lindsey/Marvia Plum Mystery",
        "Authors": "By Lupoff, Richard A.",
        "Description": "While overseeing a movie about African-American World War II pilots, recently promoted claims adjuster Hobart Lindsey becomes involved in a tricky murder investigation when a body is found in one of the film's vintage airplanes.",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Dual Attraction: Understanding Bisexuality",
        "Authors": "By Weinberg, Martin S., Williams, Colin J., and Pryor, Douglas W.",
        "Description": "For the past two generations, extensive research has been conducted on the determinants of homosexuality. But, until now, scant attention has been paid to what is perhaps the most mysterious--and potentially illuminating--variation of human sexual expression, bisexuality. Today, as ignorance and fear of AIDS makes greater awareness of all forms of sexual behavior an urgent matter of private and public consequence, leading sex researchers Martin Weinberg, Colin Williams, and Douglas Pryor provide us with the first major study of bisexuality. Weinberg, Williams, and Pryor explore the riddle of dual attraction in their study of 800 residents of San Francisco. Fieldwork, intensive interviews, and surveys provided a wealth of data about the nature of bisexual attraction, the steps that lead people to become bisexual, and how sexual preference can change over time. They found that heterosexuals, more often than homosexuals, become bisexual; that bisexual men and women differ markedly in their sexual behavior and romantic feelings; that most bisexuals ultimately settle into long-term relationships while continuing sexual activity outside those relationships; and they also explain why transsexuals often become bisexual. Moreover, the authors discovered that as the AIDS crisis unfolded, many bisexual men entered into monogamous relationships with women, and bisexual women into more lesbian relationships. Recent media accounts attest that a growing number of researchers and writers are narrowing the fundamental cause of sexual preference to a single factor, biology. But if, as this study shows, learning plays a significant part in helping people traverse the boundaries of gender, if past and present intimate relationships influence their changing preferences, and if bisexual activity is inseparable from a social environment which provides distinctive sexual opportunities, then a mosaic of factors far more complex than those previously considered must be entertained in explaining the fuller spectrum of sexual preferences. Dual Attraction is one of the most significant contributions to our understanding of sexuality since the original Kinsey reports and Bell and Weinberg's 1978 international bestseller, Homosexualities. It is must reading for all those interested in the study of sexual behavior--especially now, since the onset of AIDS.",
        "Category": " Social Science , Gender Studies",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Caillou the Wolf (NORTH STAR (CAILLOU))",
        "Authors": "By Sanschagrin, Joceline",
        "Description": "When Caillou goes exploring in the attic, he is convinced that there is a wolf hiding in the shadows and goes running to his father.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Editions Chouette Inc",
        "Price Starting With ($)": "6.8",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "I Can Draw Creepy Crawlies",
        "Authors": "By Terry Longhurst",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Power Religion: The Selling Out of the Evangelical Church?",
        "Authors": "By Sproul, R. C., Colson, Charles W., Packer, J. I., McGrath, Alister E., and Horton, Michael Scott (EDT)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Moody Pub",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Mommy's Best Kisses",
        "Authors": "By Winter, Susan (ILT) and Anastas, Margaret",
        "Description": "There are many ways to say I love you to a child, and now way is sweeter than with a kiss. Every mother knows small hands, a plump tummy, tiny fingers, and wiggling toes all beg to be kissed time and time again.Margaret Anastas's loving rhyme and Susan Winter's gentle illustrations of animal mamas and their adorable babies will make this a family favorite.",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Dye Is Now Cast: The Road to American Independence, 1774-1776",
        "Authors": "By Miller, Lillian B.",
        "Description": "",
        "Category": "",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "36.61",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Wonderful World of Boys",
        "Authors": "By Dobson, James C., Russell, John (PHT), and Yarbrough, Carl (PHT)",
        "Description": "Spectacular photography celebrating the wonderful world of boys is featured in this book of sensible parenting advice, caring encouragement, and heartwarming stories from Dr. James Dobson. Packaged in a gift-book format, this book celebrates the next generation of men with over 80 extraordinary photographs of boys revering their fathers, loving their mothers, honoring God, and just plain being boys.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Reptile (Eyewitness)",
        "Authors": "By McCarthy, Colin",
        "Description": "With more than twenty million copies sold in forty languages in ninety countries worldwide, DKEyewitness been the most trusted young adult nonfiction book series for more than thirty years. Visually engaging, informative, and lively, the one-hundred-plus titles in theEyewitness series focus on subjects that complement students' personal interests and areas of study to make learning simple and fun.The most trusted nonfiction series for teachers, librarians, and parents Wall charts and clip art CDs are perfect for school projects and homework helpUnique integration of words and pictures make the series an ideal match for reluctant readers and ESL students",
        "Category": " Juvenile Nonfiction , Animals , Reptiles & Amphibians",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Nature Watch - Lizards",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Lorenz Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "World Class Contracting 4e",
        "Authors": "By Garrett, Gregory A",
        "Description": "",
        "Category": " Law , Public Contract",
        "Publisher": "CCH",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Better Golf by Newell, Steve (2004) Hardcover",
        "Authors": "By Newell, Steve",
        "Description": "",
        "Category": "",
        "Publisher": "Hunter Publishing+inc",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Jan Saunders' Wardrobe Quick-Fixes (Star Wear S)",
        "Authors": "By Saunders, Jan and Maresh, Janice Saunders",
        "Description": "",
        "Category": " Crafts & Hobbies , Fashion",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Spectacular Stone Soup (The New Kids of Polk Street School)",
        "Authors": "By Giff, Patricia Reilly and Sims, Blanche (ILT)",
        "Description": "\"You never help people,\" Jiwon says.Her friend is right. Stacy can't remember the last time she'd helped anyone! Now Mrs. Zachary wants her class to be people-helpers and prepare a Spectacular Stone Soup together.Stacy works hard to be helpful, but no one seems to notice. Can quick thinking and a bunch of onions turn her into a spectacular people-helper?",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Seneca Hearts: If You Please/Riches of the Heart/Safe in His Arms (Romancing America: New York)",
        "Authors": "By Davis, Tish",
        "Description": "Three modern women must put the past behind them. Natalia Gordeeva is consumed by guilt her bitter, yet self-sacrificing, aunt puts upon Natalia's choices. Can Natalia find her true identity through love? Glenna Mayfield has lived under the shadow of her father's criminal past. When she takes on an ex-convict employee, can she learn to give people a second chance? Janessa Richards has an extraordinary talent for restoring antique paintings that could get her into trouble. Can she learn to trust those who are willing to protect her? Will these women discover freedom from the past within faith and love?",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "A Treasury for Six Year Olds: A Collection of Stories, Fairy Tales, and Nursery Rhymes.",
        "Authors": "By",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Back Pack Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Trusted Leader: Building the Relationships that Make Government Work",
        "Authors": "By Newell, Terry (EDT), Reeher, Grant (EDT), and Ronayne, Peter (EDT)",
        "Description": "Government reform efforts usually focus on macro-level change heralded by new policies, programs, structures, and systems. Yet they tend to ignore that these reforms do not succeed without people. Public managers who form healthy working relationships built on trust are the micro-level change levers—the necessary pre-condition to improving government.Buttressed by their real-world experience on the frontlines of a range of cases, the authors demonstrate the importance of values-based leadership. Chapters then focus on tools; the concrete ways in which leaders can improve themselves, their organizations, those they coach; and the teams they establish to build effective relationships and the trust essential to success. Surveying agencies both horizontally and vertically, The Trusted Leader also addresses how public managers can collaborate with political appointees and the legislative branch, all the while engaging with citizens through modern technologies to build exceptional customer experiences.",
        "Category": " Political Science , American Government , General",
        "Publisher": "CQ Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Deeds of Valor: How America's Civil War Heroes Won the Congressional Medal of Honor",
        "Authors": "By Beyer, W. F. (EDT), Keydel, O. F. (EDT), and Keydel, Oscar F. (EDT)",
        "Description": "Personal reminiscences and records of Civil War soldiers who were awarded the Congressional Medal of Honor.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Longmeadow Pr",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "A Dog Among Diplomats",
        "Authors": "By j-f-englert",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Mainstream of Western Political Thought",
        "Authors": "By Best, Judith",
        "Description": "",
        "Category": " Philosophy , Political",
        "Publisher": "Human Sciences Pr",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "November",
            "Year": "1980"
        }
    },
    {
        "Title": "The Late Talker",
        "Authors": "By Nicholl, Malcolm J., Agin, Marilyn C., and Geng, Lisa F.",
        "Description": "Every parent eagerly awaits the day his or her child will speak for the first time. For millions of mothers and fathers, however, anticipation turns to anxiety when those initial, all-important words are a long time coming. Many worried parents are reassured that their child is \"just a late talker,\" but unfortunately, all too often that is not the case. Nineteen million children in the United States have serious speech disorders, such as apraxia of speech. For these toddlers, early and intensive speech therapy is crucial if they are to stand a chance of ever speaking normally. This book was written to help the worried parent cut through the confusion and stress to determine if their child needs help.The Late Talker is the first book of its kind, providing effective, practical answers to the questions every concerned parent asks. Written by Marilyn C. Agin, a highly respected developmental pediatrician, and Lisa F. Geng, a mother of two late talkers, it is a tremendously useful handbook that includes:- Ways to identify the warning signs of a speech disorder- Information on how to get the right kind of evaluations and therapy- Ways to obtain appropriate services through the school system and health insurance - Fun at-home activities that parents can do with their child to stimulate speech- Groundbreaking evidence of the promising and dramatic benefits of nutritional supplementation- Advice from experienced parents who've been there on what to expect and what you can do to be your child's best advocate",
        "Category": " Psychology , Developmental , Child",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Third Mile",
        "Authors": "By Omar K. Omland, M.D.",
        "Description": "",
        "Category": "",
        "Publisher": "F&FP",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Snapshots of God: A Daily Devotional",
        "Authors": "By Coffen, Richard W.",
        "Description": "",
        "Category": "",
        "Publisher": "Review & Herald Publishing",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "NIV True Images: The Bible for Teen Girls",
        "Authors": "By Livingstone Corp",
        "Description": "Reality Spoken HereThe Bible's timeless truths connect directly with life today. That's why you'll love True Images. It's for real teenage girls with real lives. God knows about your world and the issues you deal with. He knows all about you, and he cares about you a lot. He's incredibly encouraging, and no one is wiser about how to make your life, your dreams and your relationships work. True Images is packed with edgy graphics. You'll love its personal notes, cool quizzes, challenging insights, smart advice and open discussion about the realities of life today. But don't let the fun format fool you---this is a serious Bible that is as sincere about your walk with God as you are. Everything in these pages is designed to help you build a closer relationship with him and to help you discover his will for all areas of your life, including dating, family, friendships, work, sports and so much more. Following Jesus isn't stuffy or theoretical---it's as practical and down-to-earth as you can get. So whether you're reading the reality-based 'in focus' stories that deal with various issues girls face, or drawing encouragement from 'love notes from God,' or letting 'truth or dare' challenge you in practical ways, what you're going to value most is discovering how deeply God is involved in your life. Laughing when you laugh. Grieving over your tears. Listening when no one else seems to care. Smiling because he likes you. And loving you through thick and thin.  Features:* 120 'in focus' articles take you inside the thoughts and circumstances of other girls' lives to see how the Bible applies to the issues you face.* Over 500 quick 'truth or dare' call-outs dare you to discover God's truth about life and faith.* 52 'mirror images' profile the women of the Bible---the good girls and the bad girls and what we can learn from their lives.* Over 100 short 'love notes from God' tell the very personal message of how much God loves you and of your incredible value in his eyes.* Over 300 'genuine' notes focus on true inner beauty---genuine character, integrity, purity, faith, love, obedience and more.* 24 full-color tip-ins bring you fun quizzes on topics such as, 'Are You a Good Friend?', 'What's Your Confidence Factor?', 'The Perfect Date' and more. You'll learn a lot about yourself! * 'Reflections from the other side' reveal what guys think about topics tied to the quizzes.* 66 book introductions provide overviews for each book of the Bible to help you dive in and grasp what's going on.* An informative website with resources, topical verse finder, daily Bible reading plans, links to other sites and more. (www.TrueImagesBible.com) The New International Version (NIV) is today's most read and most trusted English Bible translation. The goal of the NIV translation team was to produce a contemporary translation whose accuracy, clarity and literary quality would make it ideal for public and private reading, teaching, preaching, memorizing, and liturgical use. Today the NIV is accepted by more denominations than any other translation and is supported by a library of reference resources unmatched by any other translation.",
        "Category": " Bibles , New International Version , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "When We Have Failed-What Next?",
        "Authors": "By Yohannan, K. P.",
        "Description": "",
        "Category": " Religion , Christian Life , Personal Growth",
        "Publisher": "GFA Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Creative Organization Theory: A Resourcebook",
        "Authors": "By Morgan, Gareth",
        "Description": "Gareth Morgan believes that examining organizations and management should be interesting, creative, practical, challenging and directly relevant to the needs of both the organization and the researcher. In an ingenious selection of organizational stories, Morgan presents unique insights drawn from actual corporate (as well as non-profit, public and institutional) experience. These examples illustrate both organizational successes and failures - because we can learn from both. They are interwoven with excerpts from many of the \"classics\" in organizational literature. His aptly-named \"Mindstretchers\" entice readers to expand their personal repertoires of approaches to the understanding of, and solutions to, organizational problems and challenges, followed by cases and exercises that challenge us to view organizations in new ways.",
        "Category": " Business & Economics , Organizational Behavior",
        "Publisher": "SAGE Publications, Inc",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Heaven's Whisper",
        "Authors": "By Dick (Edited By) Stenbakken Ardis",
        "Description": "",
        "Category": "",
        "Publisher": "Review and Herald Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Patterns in the Sand: A Seaside Knitters Mystery",
        "Authors": "By Goldenbaum, Sally",
        "Description": "Readers can't help but get entangled in this USA Today bestselling series.The follow-up to Death by Cashmere: next in the new mystery series set in a tight-knit seaside community. When young fiber artist Willow Adams visits Izzy Chambers's knitting studio, she's immediately embraced by the Seaside knitters, and they see the monthly arts event at Canary Cove as a perfect place to showcase Willow's work. But the idyllic summer in Sea Harbor turns somber when the body of Nick Peabody-owner of a popular gallery-is found in a community garden. Soon all Nick's secrets begin to surface, and the residents of Sea Harbor realize they didn't know him at all. And when Nick's will reveals that his entire estate has been left to Willow, the knitters find that Willow has some dark secrets of her own...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Osidian",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Room With a Boo (Bloodhounds, Inc. #12)",
        "Authors": "By Myers, Bill and Wimbish, David",
        "Description": "With the help of a new invention from Doc, Sean and Melissa win an all-expenses-paid trip to Washington, D.C., where they hope to solve the mystery of a missing helicopter--and of a haunted hotel.",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "A Homework Manual for Biblical Living: Family and Marital Problems (Homework Manual for Biblical Living, Volume 2)",
        "Authors": "By Mack, Wayne A.",
        "Description": "",
        "Category": " Religion , Christian Life , Love & Marriage",
        "Publisher": "P & R Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "Witch Season: Summer and Fall",
        "Authors": "By Jeff Mariotte",
        "Description": "",
        "Category": "",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Left Bank",
        "Authors": "By Muir, Kate",
        "Description": "Olivier and Madison Malin have what glossy magazines would call the perfect marriage. Olivier is a telegenic version of Sartre: philosopher, gourmet, and media personality - the darling of Paris's elite cafes, not to mention his many mistresses. Madison is a beautiful and talented American film star turned Parisian \"it\" girl who has buried her Texas upbringing - along with her true age - beneath an impeccable French accent and a collection of red-soled Christian Louboutin shoes.To the people who know them best, however, the Malins are an improbable pair. Only their precocious young daughter, Sabine, along with their sacrosanct public images, really binds them anymore. But when Sabine suddenly disappears at a European amusement park, Madison and Olivier are finally forced to deal with something other than their own reflections: fear. Frantically and uncharacteristically relying on each other for reassurance (Olivier's obsession with his new mistress notwithstanding), the two come together to search for their daughter and in the process confront the posturing realities of their marriage.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Know-It-All (Aladdin Angelwings, Book 11)",
        "Authors": "By Napoli, Donna Jo and Klementz-Harte, Lauren (ILT)",
        "Description": "Nick thinks he can figure out everything on his own. Why should he have to read books when he can make things up himself? It will take an important lesson from the Little Angel of Learning to change his mind.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.5",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The White Rock: An Exploration of the Inca Heartland",
        "Authors": "By Thomson, Hugh",
        "Description": "With the backdrop of the ever-intriguing Andes mountains, The White Rock, Hugh Thomson’s intoxicating history of the Inca people and their heartland, is a thrilling mix of information and adventure. The author, an acclaimed documentary filmmaker and explorer, expertly weaves accounts of his own discoveries and brushes with danger with the history of those who preceded him—including the explorer Hiram Bingham, who discovered Machu Picchu; the twentieth century South American photographer, Martín Chambi; the poet Pablo Neruda; and the Spanish conquistadores who destroyed the Inca civilization—and the eccentric characters he meets on his travels.",
        "Category": " History , United States , General",
        "Publisher": "Abrams Press",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Mastering the Dynamics of Innovation",
        "Authors": "By Utterback, James M.",
        "Description": "The author presents a compelling look at how innovation transforms industries, raising the fortunes of some firms while destroying others. The book draws on the rich history of innovation by inventors and entrepreneurs--ranging from the birth of typewriters to the emergence of personal computers, gas lamps to fluorescent lighting, George Eastman's amateur photography to electronic imaging--to develop a practical model for how innovation enters an industry, how mainstream firms typically respond, and how--over time--new and old players wrestle for dominance. Utterback asserts that existing organizations must consistently abandon past success and embrace innovation--even when it undermines their traditional strengths. He sets forth a strategy to do so, and identifies the responsibilities of managers to lead and focus that effort.   Mastering the Dynamics of Innovation offers a pioneering model for how innovation unsettles industries and firms, and features fascinating histories of new product developments and strategies for nurturing innovation. \"The most valuable book I've read in years. . . . The analysis is brilliant.\"--Tom Peters. Available August 1996.",
        "Category": " Business & Economics , Motivational",
        "Publisher": "Harvard Business Review Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Mount Vernon Love Story",
        "Authors": "By Mary Higgins Clark",
        "Description": "",
        "Category": "",
        "Publisher": "Mount Vernon Ladies' Association",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Run Fast: How to Beat Your Best Time -- Every Time",
        "Authors": "By Higdon, Hal",
        "Description": "Train for Speed...Feel Great! Are you looking for better race times, whether you run 5-Ks or marathons? Searching for that ultimate, exhilarating moment when you're running faster than ever before? Or do you just want to get healthy and have more fun when you run? You can run faster, and this book will show you how. Much more than a training guide, this classic volume-- completely revised and updated for runners of every caliber-- spells out a complete program to help you increase your speed, improve your times, and motivate yourself to achieve your running goals. You'll see how to: * Shave time off your Personal Record * Make speedwork count-- and avoid the risk of associated pain and injuries * Make the most of limited training time * Build more muscle to boost your speed * Achieve a smooth stride and an efficient, economical running form * Listen to yourself and be your own best coach You'll discover magic workouts that both improve your speed and make training fun. And, if you've taken an exercise break, you'll see how to get back in shape and back on track, with faster times than ever before. Packed with stories and tips from coaches, record holders, and average runners alike, Run Fast by Hal Higdon is brimming with inspiration. Experience the thrill of better race times, the satisfaction of running strong, and the sheer joy that comes from running faster than ever before.",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "If You Walked In My Shoes",
        "Authors": "By Forster, Gwynne",
        "Description": "Teenaged and pregnant, Coreen Holmes gives up her baby for adoption and goes on to a successful career as a social worker, but when she is called before an investigating committee, she will have to face her past. Original. 30,000 first printing.",
        "Category": " Fiction , Sagas",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Curious George's Opposites (Curious George Board Books)",
        "Authors": "By",
        "Description": "",
        "Category": " Juvenile Fiction , Concepts , Opposites",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "A Mini Magic Color Book: Halloween Party (Magic Color Books)",
        "Authors": "By Sacks, Janet and Rinaldo, Luana (ILT)",
        "Description": "All the Halloween creatures are having a ball--and what a party it is! Unleash a little holiday magic by pulling the tabs, and see an orange pumpkin, a black cat, and other Halloween favorites. It's frighteningly delightful!",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Halloween",
        "Publisher": "Sterling/Pinwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Curious George's 1 to 10 and Back Again (Curious George Board Books)",
        "Authors": "By",
        "Description": "Curious George is one of the most beloved of all children's book characters. Now, in these four board books, toddlers can learn about basic concepts—including the alphabet, opposites, emotions, and counting (forward and backward)—with the help of their favorite mischievous monkey. The set includesCurious George's OppositesRiding forward and backward on his bicycle and letting pigs in and out of their pen, George is up to his usual mischief in this simple book of opposites.Curious George's 1 to 10 and Back Again Help Curious George count ten of his favorite things, first forward and then backward.  Curious George's ABCsRead from A to Z along with George in a condensed version of the classic Curious George Learns the Alphabet.  Curious George's Are You Curious?Do you ever feel like George?  Are you curious?  Are you mischievous?  Curious kids can read along with their parents to see if they behave like the monkey best known for getting in and out of mischief.",
        "Category": " Juvenile Fiction , Concepts , Counting & Numbers",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Telling Others: a Practical Approach to Sharing the Christain Fa ith",
        "Authors": "By Nicky Gumbel",
        "Description": "",
        "Category": "",
        "Publisher": "Cook Ministry Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Plains Crazy (Mad Dog & Englishman Series)",
        "Authors": "By Hayes, J. M.",
        "Description": "Spring bursts into bloom-and a whole lot more-as murder-by-arrow rattles Benteen County, Kansas.Nothing ever happens in Benteen County, Kansas. Then, on a perfect spring morning, a member of the reality TV program filming in a local pasture dies with a Cheyenne arrow in his back. Sheriff English's brother, Mad Dog, the county oddball whose Amerind heritage has produced a born-again Cheyenne, is a prime suspect. Murder is a bad way to start the day. Explosive action follows. Notes left for authorities hint at a terrorist assault on the heartland.If the sheriff, known as Englishman, doesn't have enough to worry about, his wife has begun acting strangely. She insists he fly off on a Paris holiday with her before sunset - or else. As Mad Dog swings between suspect and target, he encounters his long-lost high school sweetheart, and a secret that just may explain the unlikely mix of arrows and bombs.It's Murphy's Law squared, as Mad Dog and his pet wolf, Hailey, test a shaman's powers, and Englishman struggles to balance his duties to family and community-enough to drive anyone Plains Crazy.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Poisoned Pen Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Interviewing: More Than a Gut Feeling (Ami One Hour Series)",
        "Authors": "By Deems, Richard S.",
        "Description": "",
        "Category": " Business & Economics , Management",
        "Publisher": "Amer Media Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "John Paul II: A Life Of Grace",
        "Authors": "By Allegri, Renzo and Diagle-Williamson, Marsha, Ph.D. (TRN)",
        "Description": "",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "St. Anthony Messenger Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Sleep No More",
        "Authors": "By Crandall, Susan",
        "Description": "The night was always Abby Whitman's enemy. As a young girl she walked in her sleep, and one night, she started a fire that scarred her sister for life and left Abby with unbearable guilt . . . and a loneliness that echoes within her. Now Abby has begun blacking out again--with apparently fatal results. A car accident has killed the son of a prominent family. Even though the evidence seems to exonerate her, Abby is plagued by doubts--and soon by mysterious threats. Psychiatrist Dr. Jason Coble is intrigued by Abby and offers to help her explore the dark recesses of her mind. Through this terrifying journey, Jason's interest turns to passion, and he yearns to give her the love she craves. But first, Abby must trust him--and shed light on secrets that will rock this Southern town and reveal a danger that threatens them both.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Forever",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "A Treasury of Bunny Stories by Beatrix Potter",
        "Authors": "By Potter, Beatrix",
        "Description": "A collection of bunny stories by Beatrix Potter includes \"The Tale of Peter Rabbit,\" \"The Tale of Benjamin Bunny,\" \"The Story of a Fierce Bad Rabbit,\" \"The Tale of the Flopsy Bunnies,\" and \"The Tale of Mr. Tod.\"",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "The questioning child and religion",
        "Authors": "By Edith F Hunter",
        "Description": "",
        "Category": "",
        "Publisher": "Starr King Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "Cookshelf: Chocolate",
        "Authors": "By Jacqueline Bellefontaine",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Meaning of Everything (The Meaning of Everything: The Story of the Oxford English Dictionary)",
        "Authors": "By Winchester, Simon",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford Univ Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "200% of Nothing: An Eye-Opening Tour through the Twists and Turns of Math Abuse and Innumeracy",
        "Authors": "By Dewdney, A. K",
        "Description": "Acclaim for \"In today's world, 'innumeracy' is an even greaterdanger than illiteracy, and is perhaps even more common.Advertisers and politicians exploit it; intellectuals (self-styled)even flaunt it. I hope that this wise and witty book will providecures where they are possible, and warnings where they arenecessary.  \"It's also a lot of fun. I can guarantee that 100%.\"--Arthur C.Clarke  \"Dewdney retells with charm and wit magnificent morsels ofmathematical mayhem discovered by his army of volunteer 'abusedetectives.' From 'sample trashing' to 'numerical terrorism,' from'percentage pumping' to 'dimensional dementia,' 200% of Nothingplumbs the depths of innumeracy in daily life and reveals whatordinary people can do about it.  A rich, readable, instructive, and persuasive book.\"--Lynn ArthurSteen, Professor of Mathematics, St. Olaf College",
        "Category": " Mathematics , Probability & Statistics , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Swimming",
        "Authors": "By Hershon, Joanna",
        "Description": "Twenty years ago, Vivian Silver abandoned her dreams of travel to marry the mysterious Jeb Wheeler, seduced both by his unnerving charm and his acres of untamed New Hampshire land. The hand-built house and swimming pond become the center of the universe for their entire family. Lila, their youngest, is consumed with love for her two older brothers, Aaron and Jack, and remains blind to the simmering tension between them. For beneath the surface of their idyllic setting lies a depth of explosive feeling that none of them can control. Into this heated atmosphere glides Aaron’s girlfriend, Suzanne, whose presence is threatening, exciting; Lila thrills to the ominous quality of Aaron’s absolute adoration for this young woman. Before her visit is over, Suzanne will unleash the forces of rage between Aaron and Jack, compelling one brother to commit an act against the other that can never be taken back.A decade later, living in New York, Lila still searches for Aaron, who disappeared that night, and Suzanne, whose mystique still exerts a hold on her memory. For Lila to move past her family’s tragedy, she must piece together what happened that fateful weekend–and recover the things lost down by the water–before she can at last let them go.A stunning literary novel that captures the lingering effects of longing and loss, Swimming is by turns a gripping family story, a heartbreaking coming of age journey, and a suspenseful psychological investigation into the meaning and limits of fidelity, identity, and intimacy.",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "6 Minute Morning Workout",
        "Authors": "By Rowe, Faye and Rose, Sara",
        "Description": "",
        "Category": " Health & Fitness , Exercise , General",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Find Us Faithful",
        "Authors": "By Russell, Bob",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Standard Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Day by Day: The One Year (R) Devotional for Young Children",
        "Authors": "By Reeves, Eira (ILT), Davies, Valerie, and Free, Betty",
        "Description": "One-year devotional for 3- to 6-year-olds that provides a daily Bible verse explained in words children can easily understand.",
        "Category": " Juvenile Nonfiction , Religion , Biblical Studies",
        "Publisher": "Tyndale Kids",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Bronte Sisters: Wuthering Heights / Jane Eyre / Agnes Grey (Great Classic Library)",
        "Authors": "By Bronte, Charlotte, Bronte, Emily, and Bronte, Anne",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Longmeadow Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Lord Arthur Savile's Crime (Wordsworth Classics)",
        "Authors": "By Wilde, Oscar",
        "Description": "",
        "Category": "",
        "Publisher": "Wordsworth",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "How to Hypnotize Yourself and Others: Techniques for Solving Over 350 Problems, From Quitting Smoking to Curing Insomnia",
        "Authors": "By Colepan, Rachel",
        "Description": "Explains how to use hypnosis to change eating habits, stop smoking, cure insomnia, control pain, and alter behavior",
        "Category": " Medical , General",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "December",
            "Year": "1982"
        }
    },
    {
        "Title": "Whose Panties are These? More Misadventures from Funny Women on the Road",
        "Authors": "By Leo, Jennifer L. (EDT)",
        "Description": "Following on the heels of the successful Sand in My Bra and Other Misadventures: Funny Women Write from the Road comes another collection of hilarious travel stories by women. From America to Australia to everywhere in between, the true stories in Whose Panties are These? will have you shaking your head in disbelief and rolling in the aisles.? Escape to New York for the wax job of your life and \"Blame It on Rio\" with Cynthia Barnes? Fly with \"Sex in the City\" writer Cindy Chupack and \"The Mile High and Dry Club\" and be glad you weren’t there with her? Get on the \"Case of the Date Post Mortem\" with Colette O’Connor and find out what really happened? Go \"Knocking on Heaven’s Door\" with Anne Lamott and discover why sometimes it helps to \"get religion\"? Try to put on weight with Wendy Soref in Senegal where \"Small Butts\" are an embarrassment to women and a turnoff to men? Take a sidekick to Vienna with Jessica Maxwell and see how the Austrians handle the \"Cowboy Waltz\"...and much more",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Travelers' Tales",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Games to Play with Toddlers",
        "Authors": "By Silberg, Jackie",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "Gryphon House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Vampire Bytes: A Crime Novel with Catherine Sayler",
        "Authors": "By Grant, Linda",
        "Description": "Chloe Dorn is missing. The sixteen-year-old was there, in the Stanford Cactus Garden, the night of the murder. She saw something, knows something. Now she's running for her life.A young man is dead, killed in a particularly bizarre and frightening way. The cops find the body, neatly laid out with hands crossed on his chest, two puncture wounds to the neck, his blood drained. Either a cult is at work, or a cunning killer has taken a vampire game too far.Vampire games permeate this case, as private investigator Catherine Sayler soon discovers when she's called in both to search for a computer programmer who has disappeared and to help find Chloe.Chloe Dorn had a fascination with vampires, and she knew Matt Demming. Together, they were part of an LARP, a Live Action Role-Playing game, in which human beings play the role of vampires and the city streets become the game board. Chloe and Matt played the game the night they disappeared. Matt, Catherine soon learns, is the victim who was killed in the Cactus Garden.Catapulted into a high-profile case, where the cops, the media, and Chloe's outraged pastor are screaming \"cults,\" Catherine plays for time as she enlists her niece Molly, her lover Peter, and her partner Jesse in her search for the truth, and, even more urgently, for Chloe.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Treasury of Children's Classics",
        "Authors": "By Waber, Louis",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "You Just Can't Get Enough (Carlyles Gossip Girl)",
        "Authors": "By Von Ziegesar, Cecily (CRT) and Vestry, Annabelle",
        "Description": "After a whirlwind first week on the Upper East Side, the Carlyles have made their mark on Manhattan's Golden Mile. Owen is new BFFs with Rhys Sterling, but what will happen when they both fall for the same girl? Baby stole resident it girl Jack Laurent's boyfriend...and then Avery stole Jack's popularity. Now Jack is on the warpath, and she wants nothing more than to send the Carlyle girls packing their Louis Vuitton trunks. Is the UES big enough for all their drama?",
        "Category": " Young Adult Fiction , School & Education , Boarding School & Prep School",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Gossip Girl: The Carlyles: Take a Chance on Me (Gossip Girl: The Carlyles, 3)",
        "Authors": "By Von Ziegesar, Cecily (CRT) and Vestry, Annabelle",
        "Description": "The  Carlyle triplets have made a lot of new friends in Manhattan-and more than a few  enemies. O stole his best friend's girlfriend, and A dethroned the  queen bee. Now a line has been drawn down Fifth Avenue, and it's all-out war.  Only here, the battles are fought with icy glares and vicious rumors. It's the  Upper East Side, and all's fair in love and scandal...You  know you love me,Gossip Girl",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Poppy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "The A-List: Hollywood Royalty #2: Sunset Boulevard",
        "Authors": "By Dean, Zoey",
        "Description": "While Jojo and Myla continue to work on their relationship as sisters, friend Jake is cast in a film being shot at their school and must find a way to deal with the very real possibility that he will be the \"Next Big Thing.\"",
        "Category": " Young Adult Fiction , Performing Arts , Film",
        "Publisher": "Poppy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    }
]