[
    {
        "Title": "The Long Reach: New and Uncollected Poems 1948-1984",
        "Authors": "By Eberhart, Richard",
        "Description": "Poems deal with truth, religion, nature, thought, the role of poetry, death, visions, age, and the past",
        "Category": " Poetry , American , General",
        "Publisher": "New Directions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Change and continuity in the 1988 elections",
        "Authors": "By Abramson, Paul R.",
        "Description": "Drawing from a variety of sources including the U. of Michigan National Election Studies surveys, Gallup Polls, exit polls and official returns, this analysis discusses the outcome, the electorate, and the historical context. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "CQ Press",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The man who pardoned Nixon",
        "Authors": "By Mollenhoff, Clark R.",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Mr. Jefferson's Upland Virginia: Photographs and Quotations About Thomas Jefferson's Homeland",
        "Authors": "By Llewellyn, Robert",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Legacywords Pub",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "A Turn in the South",
        "Authors": "By Naipaul, V. S.",
        "Description": "In the tradition of political and cultural revelation V.S. Naipaul so brilliantly made his own in Among The Believers, A Turn In The South, his first book about the United States, is a revealing, disturbing, elegiac book about the American South—from Atlanta to Charleston, Tallahassee to Tuskegee, Nashville to Chapel Hill.",
        "Category": " Literary Collections , Essays",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "The magnificent promise: The unifying power of prayer",
        "Authors": "By Shoemaker, Helen",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Supreme Court: How It Was, How It Is",
        "Authors": "By Rehnquist, William H.",
        "Description": "The chief justice of the United States Supreme Court describes the history, evolution, and operations of the Court, and examines the relationship of the Court to Congress and the President",
        "Category": " Law , Courts",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Homeplan",
        "Authors": "By Niles, Bo",
        "Description": "",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Ingmar Bergman: An Artist's Journey",
        "Authors": "By Bergman, Ingmar and Oliver, Roger W. (EDT)",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Arcade Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Vinegars",
        "Authors": "By Gordon-Smith, Clare",
        "Description": "Explains how to use the growing assortment of vinegars to enhance everyday cooking and provides thirty any-occasion recipes that include Soiced Marinated Shrimp, Roast Monkfish with Sherry Vinegar and Caper Sauce, and Citrus Cucumber Relish.",
        "Category": " Cooking , General",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Residential Broadband (Design & Implementation)",
        "Authors": "By Abe George",
        "Description": "",
        "Category": " Computers , Networking , General",
        "Publisher": "Macmillan Technical Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Herbal Grove: A Celebration of the Beauty and Mystery of Trees",
        "Authors": "By Forsell, Mary and Cenicola, Tony (PHT)",
        "Description": "The Herbal Grove is a lavishly illustrated work that functions as an encyclopedic horticultural guide while it details the broad practical uses of the tree's gifts: incense, healing salves, potpourri, and recipes ranging from almond cookies to sweet potato-stuffed pork. For even the most avid green thumb, its source-book is thorough and completely updated: nationwide listings of nurseries, arboretums, and purveyors of medicinal, cosmetic, and household tree products; and a comprehensive bibliography on the history and uses of trees.The Herbal Grove is full of stunning full-color photographs and impeccable writing that should appeal to all who garden, hike, cook, seek alternative medicines, or simply love being in the company of trees.",
        "Category": " Gardening , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "4.93",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Bundling: Its Origin, Progress and Decline in America",
        "Authors": "By Henry Reed Stiles",
        "Description": "",
        "Category": "",
        "Publisher": "Book Collectors Assoc Inc",
        "Price Starting With ($)": "13.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1934"
        }
    },
    {
        "Title": "Relax, This Won't Hurt: Painless Answers to Women's Most Pressing Health Questions",
        "Authors": "By Reichman, Judith, M.D.",
        "Description": "From a doctor millions of women already trust, Relax, This Won't Hurt is an in-depth, decade-by-decade look at the health issues that women face, wonder about, and worry about. This  book is the ultimate answer for any woman who's ever wished she could spend unlimited time quizzing her doctor during a routine office visit.  What's the ideal contraceptive for me?  How can I make sure I don't have cancer?  What can I do about cramps and PMS?  What should I do if I have problems getting pregnant?  What do all those lab-test reports mean to me?  Should I take estrogen ?  Based on the latest research findings, this book comprehensively covers below-the -belt health and beyond, including mental health and other issues, plus the latest on genetics and health, which medical tests to have, and top-ten lists of ways women can take care of themselves at every age.  Relax, This Won't Hurt  is an invaluable resource for women, from adolescence throughout life.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The Yellow Wallpaper",
        "Authors": "By Gilman, Charlotte Perkins",
        "Description": "Gilman's turn-of-the-century feminist novel offers a portrait of a marriage and describes the experiences of a woman suffering a nervous breakdown",
        "Category": "",
        "Publisher": "Feminist Press -",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "True and Tacky: Weird Stories from the Worlds Newswires",
        "Authors": "By Hoose, Monica and Naifeh, Caroline",
        "Description": "Presents fantastic, absurd, funny, sad, and bizarre wire reports, highlighted by line drawings, taken from AP, UPI, Reuters, and other services, items usually buried in newspapers's back pages",
        "Category": " Humor , General",
        "Publisher": "Pharos Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "The Bonds of Womanhood: \"Woman`s Sphere\" in New England, 1780-1835",
        "Authors": "By Cott, Nancy F.",
        "Description": "Relies upon private and public documents of the time to investigate the circumstances and consciousness of middle-class women and to examine concepts of \"woman's place.\"",
        "Category": " History , United States , General",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1978"
        }
    },
    {
        "Title": "A Day in the Life of the Soviet Union",
        "Authors": "By Cohen, David (editor) and Smolan, Rick (editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Collins Publishers",
        "Price Starting With ($)": "9.78",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Postcards",
        "Authors": "By Proulx",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner Paper Fiction",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "The High-Performance Cookbook: 150 High-Carb Recipes for Peak Performance",
        "Authors": "By Kleiner, Susan M. and Frieman-Kester, Karen-Rae",
        "Description": "",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Eating Smart",
        "Authors": "By Bauer, Joy",
        "Description": "You're no idiot, of course. You take your vitamins every day, pick the low-fat muffin over its sinful twin, and even muster up just enough energy to take an occasional brisk walk.  But when it comes to figuring out how to incorporate the five food groups into your diet and stay on a realistic exercise program for life, you feel like you're trying to solve a mystery without any clues. Don't give up yet!  The Complete Idiot's Guide to Eating Smart provides you with everything you need to know about eating healthy and staying fit--a nutrition tune-up for life!  Feel confident about deciphering nutrition labels going to the grocery store and restaurants, and managing your weight. In this Complete Idiot's Guide, you get:",
        "Category": "",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Weekender's Gardening Manual",
        "Authors": "By Taylor, Patricia A.",
        "Description": "This illustrated book explains, season by season, how to achieve a beautiful, high-yield/low-maintenance garden while spending only two hours a week or less in actual gardening time",
        "Category": " Technology & Engineering , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Is It Hot In Here Or Is It Me?: Personal Look at the Facts, Fallacies, and Feelings of Menopause",
        "Authors": "By Sand, Gayle",
        "Description": "This book is not a medical manual or a guide to self-treatment, nor is it intended to replace medical or other professional advice. The author describes her own journey through menopause - using medical and alternative treatments - without intention of recommending or endorsing any particular treatment or product. Women concerned about or suffering the effects of menopause or related conditions are urged to seek the advice and counsel of qualified medical or other professionals. The author and the publisher expressly disclaim liability arising directly or indirectly from the use of this book.Many of the individuals whose experiences are described in the book are composites; in addition, others have had their names and identifying details disguised to protect privacy interests and for other legal reasons.",
        "Category": " Medical , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Practical Miracles for Mars and Venus Nine Principles for Lasting Love, Increasing Success and Vibrant Health in the 21st Century",
        "Authors": "By Gray, John",
        "Description": "\"Walking on water is certainly miraculous, but walking peacefully on earth is an even greater miracle. Changing water to wine is wondrous, but it is more practical to change an unhealthy craving into a healthy desire. Raising the dead is clearly a miraculous demonstration of God's power, but so is healing your daughter's tummy ache or ... better yet, making you and your loved ones feel vibrantly healthy so you don't get sick in the first place. The power to create practical miracles is now within the reach of every person.\" -- John GrayAccording to John Gray, author of the phenomenal #1 bestseller Men Are from Mars, Women Are from Venus, just as the pace of life has accelerated so has your potential for change. By awakening your hidden power to create practical miracles, you will more effectively adjust to life's challenges and respond with greater peace, joy, confidence, and love. When you feel a need to change, you will develop the ability to follow through without anxiety, resistance, indecision or procrastination. You will be able to release such negative reactions as blame, judgement, or resentment, and respond in stressful circumstances with understanding, patience and kindness.In order to fill each day with increasing wonder, power, and fulfillment, John Gray provides Nine Guiding Principles for creating miracles in your life as well as new practical tools and techniques for taking charge or your personal destiny. The nine Natural Energy Techniques do not take years of long practice to master; they can easily fit into your life, and they work right away. These nine energy techniques include:The Recharging Technique The Decharging Technique The Natural Energy Diet The Positive Response Technique The Blockbuster Process The Attitude Adjustment Technique The Willful Breathing Technique Natural Energy Healing and The What if Exercise.By following The Nine Guiding Principles and practicing The Nine Natural Energy Techniques, you can open the door for a life filled with practical miracles.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Hope Has Its Reasons: From the Search for Self to the Surprise of Faith",
        "Authors": "By Pippert, Rebecca Manley",
        "Description": "",
        "Category": "",
        "Publisher": "Guideposts 1989",
        "Price Starting With ($)": "7.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Emily Post's Complete Book of Wedding Etiquette",
        "Authors": "By Post, Elizabeth L",
        "Description": "A complete revision of the step-by-step guide for planning a perfect wedding provides advice on every phase of the wedding process, from the announcement of the engagement to the last detail of the wedding reception",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Right Brain Experience",
        "Authors": "By Zdenek, Marilee",
        "Description": "Discusses the function of the right half of the brain in the creative process and describes techniques for using the brain to increase creativity",
        "Category": " Psychology , Cognitive Psychology",
        "Publisher": "Mcgraw Hill",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Teach yourself C",
        "Authors": "By Schildt, Herbert",
        "Description": "Covers the fundamentals of C programming giving users a solid command of C programming principles. Utilizes examples, exercises and skill checks to ensure mastery of a topic. Large clear type, clean format. An inviting book. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Osborne McGraw-Hill",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Whisper of the River",
        "Authors": "By Sams, Ferrol",
        "Description": "The bittersweet and very funny story of a young man’s journey to adulthood that the Nashville Banner called \"Americana at its best.\"   Young for his class and small for his age, Porter Osborne, Jr., leaves his rural Georgia home in 1938 to meet the world at Willingham University, armed with the knowledge that he has been \"Raised Right\" in the best Baptist tradition. What happens over the next four years will challenge the things he holds infallible: his faith, his heritage, and his parents’ omniscience. As we follow Porter’s college career, full of outrageous pranks and ribald humor, we sense a quiet, constant flow toward maturity. Peppered with memorable characters and resonant with details of place and time, The Whisper of the River is filled with the richness of spirit that makes great fiction.   \"Wry, incisive, delicately structured, emotionally complex, and hilarious.\" -- Atlanta Magazine",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Dictionary of Economics, The Penguin (Dictionary, Penguin)",
        "Authors": "By Rees, R., Bannock, Graham, Baxter, R. E.",
        "Description": "Whether you want to follow the economic discussions in the media today, or study economics or need some knowledge of it at work (in business, finance or the public sector), this wide-ranging and accessible dictionary will prove invaluable. It explains a host of economic terms, from acceleration principle to X-efficiency, globalization to venture capital, and from Euro to zero-sum game. Revised and updated for its seventh edition, The Penguin Dictionary of Economics is detailed, practical and international in scope. Its entries include: general economic terms; economic theory, including coverage of development economics, industrial organization, finance and game theory, as well as international monetary and welfare economics; coverage of applied economics and major financial institutions; history of economics; and entries on individual economists who have made a definable contribution to contemporary economic thought.",
        "Category": "",
        "Publisher": "Puffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Serbs and Croats: The Struggle in Yugoslavia",
        "Authors": "By Dragnich, Alex N.",
        "Description": "The triumph of independent statehood after World War I became a tragedy for Yugoslavia seventy years later. Dragnich discusses the ideals and hopes of the South Slavs, their tortured attempt to create a workable political system, and the reasons behind the recent chaos and violence in the region. Index; maps.",
        "Category": " History , Europe , Baltic States",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Alice in Wonderland",
        "Authors": "By Carroll, Lewis",
        "Description": "Full-color illustrations reproduced from rare glass slides made for a Victorian Magic Lantern show and thirty-three of the original black-and-white Tenniel drawings complement the text of the original Lantern Slide lecture",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Adaptations",
        "Publisher": "Harry N. Abrams, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Mama, Across the Sea",
        "Authors": "By Godard, Alex and Wen, George",
        "Description": "A gentle story of a young island girl waiting for her mother to come home from work, far away on the mainland.Cecile lives on an island in the West Indies with her grandparents while her mother looks for work on the mainland. Much as she loves her grandparents, Cecile is lonely, and spends her days waiting for her mother to return from across the sea.As the summer passes, Cecile teaches her grandmother to read and write. She listens to the village storyteller's tales of the sea, and makes a beautiful picture with shells and sand to remind Mama of home. At long last, a letter comes for Cecil, and she crosses the sea to visit the Mama she has missed so much.A gentle story of a young island girl waiting for her mother to come home from work, far away on the mainland.Cecile lives on an island in the West Indies with her grandparents while her mother looks for work on the mainland. Much as she loves her grandparents, Cecile is lonely, and spends her days waiting for her mother to return from across the sea.As the summer passes, Cecile teaches her grandmother to read and write. She listens to the village storyteller's tales of the sea, and makes a beautiful picture with shells and sand to remind Mama of home. At long last, a letter comes for Cecil, and she crosses the sea to visit the Mama she has missed so much.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Henry Holt and Co. (BYR)",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Following the Brush: An American Encounter with Classical Japanese Culture",
        "Authors": "By Elder, John",
        "Description": "An American professor recounts the year that he and his family lived in Kyoto, Japan, discussing his experiences with an elementary school, a calligraphy class, a Go club, and Noh acting",
        "Category": " Literary Criticism , General",
        "Publisher": "Beacon Pr",
        "Price Starting With ($)": "13.46",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Embracing Earth",
        "Authors": "By Stevens, Payson R. and Kelley, Kevin W.",
        "Description": "Detailed, informative captions accompany stunning computer-enhanced satellite images (some double-page, i.e. 20x28\") that capture both Earth's natural rhythms (e.g. the changing contours of the land, the perpetual movement of the oceans' waters, the shifting global winds, the seasonal fluctuations of the polar ice caps) and humanity's disruption of these rhythms (e.g. global deforestation, the hole in the ozone layer, increasing desertification, the disastrous environmental consequences of the Gulf War). Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Nature , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "8.01",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Joyful Journey, The",
        "Authors": "By Clairmont, Patsy, Johnson, Barbara, Swindoll, Luci, and Meberg, Marilyn",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "With Open Heart (English and French Edition)",
        "Authors": "By Quoist, Michel",
        "Description": "A French priest describes his experiences and offers his thoughts on the spiritual life and the love of God",
        "Category": " Religion , General",
        "Publisher": "Crossroad Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Astronomy and Telescopes: A Beginner's Handbook",
        "Authors": "By Traister, Robert J",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill/TAB Electronics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Volcanoes and Earthquakes (Discovering Science Series)",
        "Authors": "By Erickson, Jon",
        "Description": "Discusses the creation of the universe, the solar system, and the earth, explains the theory of continental drift, and looks at the causes and effect of earthquakes and volcanoes",
        "Category": " Science , General",
        "Publisher": "Tab Books",
        "Price Starting With ($)": "6.49",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Ally McBeal: The Official Guide",
        "Authors": "By Appelo, Tim",
        "Description": "It's Ally WorldFunny, charming, and smart, award-winning Ally McBeal  stole the hearts of critics andviewers alike from its premiere episode in 1997. The \"hippest, hottest show on television\" (TV Guide),  now in its third season, continues to cultivate and entertain growing legions offans. Illustrated with more than 400 photographs, this official full-color companion guide takesreaders on an engaging trip through the hilarious, intelligent, and sometimes heartbreakingworld of the endearingly odd Ally and her friends and colleagues. Chock-full of fascinatingfacts and tidbits, this insider's guide includes:  An exclusive, behind-the-scenes glimpse at the show and stag-from lifeon the set to the writers, crew, wardrobe, and special effects  A complete guide to each episode An up close look at the show's creator and driving force, David E. Kelley Judge \"Whipper,'' the Dancing Twins, \"Happy'' Boyle, Stefan the frog, and more Fishisms, McBealisms, and Elaine's best inventions The lowdown on the show's music and the spectacular success of Vonda Shepard Interviews with the actors Plus special sections on the personal and professional--from Ally's men,memorable cases and clients, to her relationship with Billy and Georgia, to life in the Unisex universe.",
        "Category": " Performing Arts , Television , Reference",
        "Publisher": "Dey Street Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Show and Tell",
        "Authors": "By Relf, Patricia",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "The Dick Tracy Casebook: Favorite Adventures, 1931-1990",
        "Authors": "By Collins, Max Allan and Locher, Dick (CON)",
        "Description": "A representative collection of Dick Tracy adventures from the popular comic strip includes \"The Hotel Murders\" from the 1930s, \"Putty Puss\" from the 1980s, and other favorite cases",
        "Category": " Art , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "The Education of a Public Man: My Life and Politics",
        "Authors": "By HUMPHREY HUBERT H.",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "9.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Ozzy Knows Best: The Amazing Story of Ozzy Osbourne, from Heavy Metal Madness to Father of the Year on MTV's \"The Osbournes\"",
        "Authors": "By Nickson, Chris",
        "Description": "Always outrageous but equally compelling, its THE book to have on Ozzy, MTV's The Osbournes, and everything in between.Meet the Osbournes: children Kelly and Jack, mother Sharon, and the father, none other than Godfather of Metal Ozzy Osbourne. Starring in MTV's most popular show ever, the Osbournes have proven that the family of a heavy metal superstar can teach America what parenting is all about with their new twist on family values. So what's made Ozzy into such a great father? Experience. You name it, he's done it. He's bitten the heads off doves and bats, urinated on the Alamo (while wearing a woman's dress!), and been addicted to drink and drugs. With his first band, Black Sabbath, he practically invented heavy metal. As a solo performer, he's sold millions of albums, and helped turn the annual Ozzfest tour into one of the biggest events in music.Learn how Ozzy went from being banned at the Alamo to a guest at the White House, from bats to Beverly Hills. It's all in here, with plenty of trivia-like why oldest daughter, Aimee, didn't want to be a part of series- and all the parenting tips any father needs to be as good a dad as Ozzy.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Safire's political dictionary",
        "Authors": "By Safire, William L",
        "Description": "This entertaining and informative dictionary lists words and phrases peculiar to government officials and politicians, analyzing their meanings and tracing their origins",
        "Category": "",
        "Publisher": "Random House USA Inc",
        "Price Starting With ($)": "7.77",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Social Causes of Illness",
        "Authors": "By Totman, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Pantheon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Television",
        "Authors": "By Winship, Michael",
        "Description": "This volume surveys the history of television from the pioneering days of the 1930s, through the Golden Age of the 1950s, to the present",
        "Category": " Performing Arts , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The mortgaged heart",
        "Authors": "By McCullers, Carson",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "9.84",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Unsolved Mysteries of Science",
        "Authors": "By John Malone",
        "Description": "",
        "Category": "",
        "Publisher": "John Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Acid Plaid: New Scottish Writing",
        "Authors": "By Ritchie, Harry (EDT)",
        "Description": "Offers a collection of work from various Scottish writers who have revolutionized late-twentieth-century literature, such as Alan Warner, Irvine Welsh, Janice Galloway, William Boyd, and others. Original.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Arcade Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "History of the World: Earliest Times to the Present Day",
        "Authors": "By Hall, John Whitney",
        "Description": "",
        "Category": "",
        "Publisher": "World Publishing",
        "Price Starting With ($)": "14.02",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Venus observed : a play",
        "Authors": "By Fry, Christopher",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "The Changing Patterns of the Middle East (Praeger University Series)",
        "Authors": "By Rondot, Pierre",
        "Description": "",
        "Category": "",
        "Publisher": "Praeger",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "The Great Offensive",
        "Authors": "By [Russia]. Hindus, Maurice.",
        "Description": "",
        "Category": "",
        "Publisher": "Harrison Smith & Robert Haas",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1933"
        }
    },
    {
        "Title": "Novell's guide to NetWare 4.0 networks (The Inside story)",
        "Authors": "By Cheryl C Currid",
        "Description": "An easy-to-follow start-up guide to Novelle's Netware 4.0 Networks offers the novice user advice on installing and operating a microcomputer network. Original.",
        "Category": "",
        "Publisher": "Novell Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Apollo",
        "Authors": "By Kerrod, Robin",
        "Description": "To celebrate the 20th anniversary of the \"small step\" on the Moon that became the \"giant leap\" for mankind, traces the genesis of the Apollo program and the technologies that led to several lunar landings",
        "Category": " Science , General",
        "Publisher": "Bdd Promotional Book Co",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "After She Left",
        "Authors": "By Brickner, Richard",
        "Description": "Emily Weil, daughter of a prosperous Park Avenue family, tries to find her way in the adult world and face the challenges of raising her own family",
        "Category": " Fiction , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.83",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Sharing World Leadership?: A New Era for America and Japan (Aei Studies, 488)",
        "Authors": "By Makin, John H. and Hellmann, Donald C.",
        "Description": "",
        "Category": " Political Science , History & Theory",
        "Publisher": "Aei Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "A Reader’s Delight",
        "Authors": "By Perrin, Noel",
        "Description": "One of America's finest essayists writes about 40 literary masterpieces that have been wrongfully forgotten or were ignored in the first place.",
        "Category": " Literary Collections , Essays",
        "Publisher": "Dartmouth College Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Cal Ripken Jr: Count Me In",
        "Authors": "By Ripken, Cal, Jr., Brown, Greg, and Keith, Doug (ILT)",
        "Description": "Baltimore Oriole shortstop Cal Ripken tells young readers how the road to success in any field is rarely traveled overnight. Ripken, who stands poised to break one of baseball's most sacred records—Lou Gehrig's 2,130 consecutive games played—shares his thoughts on how success is attained over time, through sustained, day-by-day efforts and victories. More than 50 color photos and illustrations.",
        "Category": " Juvenile Nonfiction , Sports & Recreation , Baseball & Softball",
        "Publisher": "Taylor Trade Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "How to Bring Your Children to Christ (formerly Children for Christ)",
        "Authors": "By Murray, Andrew",
        "Description": "",
        "Category": "",
        "Publisher": "Whitaker House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Cases and Strategies for Preventive Action (Preventive Action Reports, Vol 2)",
        "Authors": "By Center for Preventive Action Conference 1996 (New York, N. Y.) (COR) and Rubin, Barnett R.",
        "Description": "In 1996, there were violent intrastate conflicts in ninety countries around the world. Governments, international organizations, nongovernmental organizations, and scholars continue to investigate how these deadly conflicts can be prevented. In order to assess what has been learned about conflict prevention and encourage further examination of cases and strategies, the Center for Preventive Action (CPA) of the Council on Foreign Relations convenes an annual conference. CPA's December 1996 Conference on Preventive Action examined three regions where CPA has programs--Nigeria, the Great Lakes region of Central Africa, and the South Balkans--and three tools of prevention--religion, economic sanctions and incentives, and small weapons disarmament. This conference volume is the second book in CPA's series of Preventive Action Reports. It uses CPA's case studies to examine the effectiveness of the tools of preventive action, and draws on comparative studies to guide the analysis of the case studies. Included: Edward J. Laurance of the Monterey Institute of International Studies on small weapons disarmament; David Cortright of the Fourth Freedom Forum and George Lopez of the Kroc Institute of International Peace Studies, University of Notre Dame, on the use of economic sanctions and incentives; Reverend Donald Shriver of Union Theological Seminary on religion and violence prevention; Steven Burg of Brandeis University on the South Balkans; Michael Lund of Creative Associates International on Burundi and the Great Lakes region of Central Africa; and Peter Lewis of American University on Nigeria.",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "The Century Foundation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Washington walked here; Alexandria on the Potomac, one of America's first \"new\" towns,",
        "Authors": "By Somerville, Mollie D",
        "Description": "",
        "Category": "",
        "Publisher": "Acropolis Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Making News",
        "Authors": "By Mayer, Martin",
        "Description": "New edition of Mayer's 1987 book on journalism's role in  making  news, what is made of it (often entertainment), and the too ready acceptance of the establishment's interpretation of events. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Harvard Business School Pr",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Perfect Match: A Dog Buyer's Guide",
        "Authors": "By Walkowicz, Chris",
        "Description": "This book is a must for anyone considering a canine addition to the family. Nearly 150 breeds are presented with a full photo for each and a complete checklist including personality and physical characteristics, as well as both possitive and negative attributes. Never before has there been such depth of truth and authority collected in one comprehensive volume.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Word Circus: A Letter-Perfect Book (Lighter Side of Language Series)",
        "Authors": "By Lederer, Richard and Morice, Dave",
        "Description": "Sit on a potato pan, Otis! Lederer, an International Punster of the Year, conducts a dazzling circus of words, spinning the alphabet into acrostics, anagrams, grammagrams, kangaroo words, and every other conceivable manner of letter juggling. Once you've watched the three-ring show, you can try your skill at word games. Includes whimsical two-color illustrations. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Merriam-Webster, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Women in the military: An unfinished revolution",
        "Authors": "By Holm, Jeanne",
        "Description": "Details the history of the participation of women in the American armed forces and examines the current policies concerning women's role in the military",
        "Category": "",
        "Publisher": "Presidio Press",
        "Price Starting With ($)": "21.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Rainy Days Sunny Days Saturday's Child",
        "Authors": "By Churchman, Deborah and Oman, Anne C.",
        "Description": "",
        "Category": "",
        "Publisher": "Washington Book Trading Co",
        "Price Starting With ($)": "9.62",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Character & Destiny: A Nation in Search of Its Soul",
        "Authors": "By Kennedy, D. James and Black, Jim Nelson",
        "Description": "America faces a crisis of moral authority. In this penetrating, informative book, Dr. D. James Kennedy takes readers to the core of today's cultural erosion.The United States' rich heritage of Christian liberty is now being corrupted by those who are trying to rewrite or reinterpret history. Even our traditional values are being undermined by our educational system. More than ever, we need to assert the truth - the truth of the existence of sin and of the absolute nature of morality.As Christians, we have the hope and promise of ultimate victory, but it is not enough to merely hope for better things. We have been a \"silent majority\" for too long - it is time to become committed. It takes everyone. As Dr. Kennedy says, \"Somehow, somewhere, we must all be involved.\"Character - the \"sense that things have eternal consequences\" - is a foundational principle in the Christian life. Character & Destiny challenges all Christians with the paramount question, \"Do we have the resolve to make character once more a priority in our lives?\"",
        "Category": "",
        "Publisher": "Zondervan Publishing Company",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Sarah Conley",
        "Authors": "By Gilchrist, Ellen",
        "Description": "A New York City magazine editor and novelist returns home to the South when her closest childhood friend falls ill--and finds herself forced to choose between pursuing her career and rekindling her relationship with the man she has long considered the love of her life. NPR sponsorship.",
        "Category": " Fiction , General",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Down from Troy: A Doctor Comes of Age",
        "Authors": "By Selzer, Richard",
        "Description": "Recounting his life and work, a surgeon and essayist describes his Depression-era boyhood in New York State, his dual career as doctor and writer, and the death of his father",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Day of the Bees",
        "Authors": "By Sanchez, Thomas",
        "Description": "A love story set during World War II follows the ill-fated relationship of two lovers--a world-renowned Spanish painter and his French mistress trapped in Vichy France--through their correspondance. By the author of Mile Zero. 40,000 first printing.",
        "Category": " Fiction , Historical",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "1001 Things Everyone Should Know About Science",
        "Authors": "By Trefil, James",
        "Description": "A crash course for a general audience, comprising literally 1,001 concise explanations of scientific phenomena in seven topical categories: classical biology, evolution, molecular biology, classical physical science, modern physical science, earth science, and astronomy. Includes 100 drawings and photos. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Science , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Human Options",
        "Authors": "By Cousins, Norman",
        "Description": "Cousins recalls key moments from his forty years of learning, editing and writing, reporting on important events, acting as a presidential emissary, and working on health projects, and tells of his work with famous men and women",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Part of My Soul Went with Him",
        "Authors": "By MANDELA, Winnie",
        "Description": "Winnie Mandela, one of South Africa's most visible and articulate apartheid foes, spent many years as a \"banned\" person in her own country. She lived under virtual house arrest and was forbidden to address public gatherings or meet with more than one person at a time. She endured a forced separation of 27 years from her husband, Nelson Mandela. Here, in interviews and letters, she tells the story of her life and political development.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "Reckless Disregard",
        "Authors": "By Adler, Renata",
        "Description": "A trained lawyer who served with the House Judiciary Committee during the Watergate investigation and a respected critic, Adler analyzes the libel cases of Sharon vs. \"Time\" and Westmoreland vs. CBS",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "43.95",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "The Red Fox",
        "Authors": "By Hyde, Anthony",
        "Description": "When May Brightman asks foreign correspondent and Russian expert Robert Thorne to help find her father, a millionaire fur dealer who has mysteriously disappeared, a transcontinental hunt for Brightman--and a cache of gold--ensues",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Flanagan's Version: A Spectator's Guide to Science on the Eve of the 21st Century",
        "Authors": "By Flanagan, Dennis",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Between Ourselves: Letters Between Mothers and Daughters 1750-1982",
        "Authors": "By Payne, Karen",
        "Description": "Contributes to current understanding of women's history by examining relationships between mothers and daughters as revealed in letters of both unknown and famous women",
        "Category": " Social Science , General",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Earth in the Balance: Ecology and the Human Spirit",
        "Authors": "By Gore, Albert",
        "Description": "A passionate and lifelong defender of the environment, Vice President Al Gore describes in this classic best-selling book how human actions and decisions can endanger or safeguard the vulnerable ecosystem that sustains us all. The book's groundbreaking analysis helped place the environment on the national agenda, summoning politicians, the media, and the public to attention and action. The message remains just as urgent today as it did eight years ago: while much has been accomplished, we must meet a global environmental challenge that reaches into every aspect of our society.In brave and unforgettable terms, Earth in the Balance probes the roots of the environmental crisis and offers a bold and forceful vision of a new, more sustainable path. Having provoked international discussion upon its original publication, it continues to confront us with profound challenges. Human civilization must change its course if we are to heal our ailing environment and preserve the earth's ecology for future generations.Vice President Gore describes in a new foreword to this classic what we have achieved and what remains to be done, and issues a clarion call to begin the millennium with an \"Environment Decade.\" It is time to reflect deeply on the fate of our planet and commit ourselves to its future.",
        "Category": " Political Science , Public Policy , General",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "McNally's Luck",
        "Authors": "By Sanders, Lawrence",
        "Description": "Just when you thought you knew all the dirt about Palm Beach ... Archy McNally returns to confront glitz, ghosts and gore in McNally's Luck, Lawrence Sanders's masterful new thriller.With McNally's Secret, Sanders fans were introduced to a south Florida sleuth whose high spirits and nose for clues endeared him to readers. Now diehard playboy Archy McNally is back, in a kinky caper the likes of which south Florida's elite has never seen.McNally's Luck begins as a search for a purloined pet but quickly becomes far more lethal. As investigator for his father's prestigious law firm, McNally regularly sees a side of elegant Palm Beach that's best described as seamy. But even he is shocked by the Pandora's box of lust and larceny slowly opening before him. On the heels of the catnapping, a prominent woman is brutally murdered, and in some cryptic way, the acts are linked. As he fits the many pieces of the puzzle into a single, lurid truth, Archy crosses paths with mediums, murderers, impostors and adulterers - and learns at an eerie seance that there are scandals even death can't hide.Intricate, unguessable, and sensual as a sultry Florida afternoon, McNally's Luck is blue-chip Lawrence Sanders.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Mad as Hell",
        "Authors": "By Lupica, Mike",
        "Description": "From one of sportswriting's best-known commentators comes a manisfesto for the common fan - an explosive exploration, by turns angry and mordantly funny, of the state of contemporary sports, and what we can do about it.We go to the games, we buy the merchandise, we commit ourselves to a team, and what happens? The players leave. The teams leave. The whole sport goes out on strike. And the ticket prices go up. Again. The only thing that's left is the uniforms - if the marketing geniuses haven't changed those too.Now nationally known columnist and sportswriter Mike Lupica gives vent to the anger that has permeated so much of contemporary sports discussion, delivering a broadside that not only lays out where we are, but investigates how we got there. Step by step, he explores how the players, the owners, the agents, the commissioners, even his own media, brought us to this state - and then proposes some revolutionary ideas of his own about how fans, individually and together, can make the whole runaway industry sit up and take notice.",
        "Category": " Sports & Recreation , Essays",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "The Rapture of Canaan",
        "Authors": "By Reynolds, Sheri",
        "Description": "At the Church of Fire and Brimstone and Gods Almighty Baptizing Wind, Grandpa Herman makes the rules for everyone, and everyone obeys, or else. Try as she might, Ninah hasn't succeeded in resisting temptation her prayer partner, James and finds herself pregnant. She fears the wrath of Grandpa Herman, the congregation and of God Himself. But the events that follow show Ninah that Gods ways are more mysterious than even Grandpa Herman understands.",
        "Category": " Fiction , Sagas",
        "Publisher": "Berkley Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Officer-cadet (Dirigent Mercenary Corps)",
        "Authors": "By Shelley, Rick",
        "Description": "Another installment in the explosive new series of future warfare features a young soldier expelled from Earth, who seeks to prove his worthiness in the Dirigent Mercenary Corps, the most demanding and refined of military outfits. Original.",
        "Category": " Fiction , Science Fiction , Hard Science Fiction",
        "Publisher": "Ace",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Scarlett: The Sequel to Margaret Mitchell's Gone With the Wind",
        "Authors": "By Ripley, Alexandra",
        "Description": "Set in the Reconstruction-era South, this sequel to Margeret Mitchell's well-loved novel follows Rhett, Scarlett, and Ashley as they pick up the pieces of their lives",
        "Category": " Fiction , Historical",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Four Letters of Love",
        "Authors": "By Williams, Niall",
        "Description": "The intriguing story of how Nicholas Coughlan's father and Isabel Gore's deaf-mute brother meet on an island off the West Coast intertwines with the love affair that ignites between Nicholas and Isabel. Reprint.",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "B.C. The Second and Third Letters of the Alphabet Revisited",
        "Authors": "By Hart, Johnny",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "Antique Guide to Decorative Arts (Dutton paperbacks)",
        "Authors": "By Stilinger, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "June",
            "Year": "1973"
        }
    },
    {
        "Title": "Environmental science: Sustaining the earth (Wadsworth biology series)",
        "Authors": "By Miller, G. Tyler",
        "Description": "",
        "Category": "",
        "Publisher": "Wadsworth Pub Co",
        "Price Starting With ($)": "24.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Conran's Do-it-yourself Home Design",
        "Authors": "By Innes, Jocasta, Blake, Jill",
        "Description": "Offers advice on color schemes, window treatments, lighting, fabrics, and furniture, and demonstrates how to work with paint, wallpaper, tile, wood, and soft floor coverings",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "WLT: A Radio Romance",
        "Authors": "By Keillor, Garrison",
        "Description": "The novel upon which Keillor has worked over the last 15 years. A treasure for his myriad fans. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Fiction , General",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Berserker Throne",
        "Authors": "By Saberhagen, Fred",
        "Description": "When Prince Harivarman, an exile on the Radiant Templor--with only his faithful servant, girlfriend, and newly arrived wife--learn that he is the target of an assassin, his salvation lies in an operable Berserker that he must learn to control",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "The Liberal Crack-Up",
        "Authors": "By Tyrrell, R. Emmett, Jr.",
        "Description": "Explains the reasons for the decline of liberalism, examines the anti-nuclear, feminist, and peace movements, and discusses liberal policies towards the Third World and the economy",
        "Category": " History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Careertracking: 26 Success Shortcuts to the Top",
        "Authors": "By Salzman, Jeff and Calano, Jimmy",
        "Description": "From the creators of the immensely successful CareerTrack seminar program come twenty-six shortcuts to success that can be quickly and easily mastered by those looking for rapid success",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "The Sensual Body: The Ultimate Guide to Body Awareness and Self-Fulfillment",
        "Authors": "By Lidell, Lucy",
        "Description": "Shows how to use massage to heighten sensitivity, and become more aware of one's body, and discusses posture, relaxation, exercise, dance, the martial arts, and meditation",
        "Category": " Health & Fitness , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "The Scent of Scandal",
        "Authors": "By Matthews, Carole",
        "Description": "Love Stinks It does when you find out that the guy you're head-over-heels about is already married. That's when Rose Stevens decides to escape her problems and flee to a remote country village. All she wants is peace and quiet, but the quaint, eccentric villagers of Great Brayford have other ideas. Rose is amazed that her occupation as an aroma-therapist is causing such consternation among the townsfolk, when what else goes on within the village limits seems so much worse: there's a housewife who's a hooker, a sex-starved neighbor and a troublesome Peeping Tom. Beneath the all-pervasive aroma of garden lavender there's a distinct scent of scandal here, and Rose thinks that her small transgressions seem paltry in comparison -- until she starts to get intimately involved with the sexy local builder ... and her ex-lover arrives out of nowhere with a shocking announcement ... and she unwittingly finds herself in the center of a chaotic, rumor-fed hurricane of scandal that ensures her life is even more complicated than it was before. But maybe that's also because she's in love again.",
        "Category": " Fiction , Romance , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Birding for Beginners: A Comprehensive Introduction to Birdwatching",
        "Authors": "By Buff, Sheila",
        "Description": "Birdwatching is for everyone. No other outdoor pursuit yields so much enjoyment of nature's ways with so little effort, and BIRDING FOR BEGINNERS is the ideal introduction to the pleasures to be found from birdwatching.All the essentials for the beginner to enjoy birdwatching are covered:         ¸         equipment         ¸         identification techniques         ¸         field guides         ¸         optics for birders         ¸         birding by 'ear'                and much more.Making this guide uniquely valuable for the novice are chapters on viewing bird behaviors such as feeding, flight, feather care, nesting, and migration so the birder understands not just what kind of bird it is, but what the bird is doing. Clear black and white illustrations as well as an exquisite four-color photographic insert, bring this exciting world vividly to life. In addition, a selection of appendices cover everything from birding organizations to birding publications.The most important qualification for birdwatching is a desire to do it--and BIRDING FOR BEGINNERS is just the guide to help make that desire a pleasurable reality.",
        "Category": " Nature , Birds & Birdwatching",
        "Publisher": "Gramercy Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Death, Grief, and Caring Relationships (Psychology)",
        "Authors": "By Kalish, Richard A.",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Brooks/Cole Pub Co",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Seminary: A Search",
        "Authors": "By Hendrickson, Paul",
        "Description": "Discusses the author's experiences in seminary while studying for the priesthood and assesses the significance of this period in his life, detailing the forces that brought him to the priesthood and those that drove him away",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "Your Cat's First Year",
        "Authors": "By Burton, Jane, Taylor, Kim, and Allaby, Michael",
        "Description": "With color photographs, the authors follow a litter of kittens as they develop from birth to maturity in the course of a year and explain everything an owner needs to know about cat behavior",
        "Category": " Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    }
]