[
    {
        "Title": "The Salem Witchcraft Trials",
        "Authors": "By Richardson, Katherine W.",
        "Description": "This brief, accurate booklet about the Salem witchcraft hysteria  includes a section on the Peabody Essex Museum's collection of  documents, paintings, and other artifacts associated with the trials.  It's a handy reference guide and concise overview of one of America's  darkest chapters.",
        "Category": " Law , Criminal Law , General",
        "Publisher": "Peabody Essex Museum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "How to Deal With Difficult People",
        "Authors": "By Friedman, Paul",
        "Description": "",
        "Category": " Self-help , General",
        "Publisher": "Skillpath Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Life: A Natural History of the First Four Billion Years of Life on Earth",
        "Authors": "By Fortey, Richard",
        "Description": "Fortey, a paleontologist with London's Natural History Museum, commences his concise biography of Earth based on evolution with a first person account of a Darwinian-type scientific sea expedition in search of fossils. Includes a glossary, reading list, and several b&w photos. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Nature , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Rock-A-Bye Snoopy (World of Snoopy)",
        "Authors": "By Lee Mendelson~Frank Hill",
        "Description": "",
        "Category": "",
        "Publisher": "United Features Syndicate",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "The Pentagon's New Map: War and Peace in the Twenty-First Century",
        "Authors": "By Barnett, Thomas P. M.",
        "Description": "Since the end of the Cold War, America's national security establishment has been searching for a new operating theory to explain how this seemingly \"chaotic\" world actually works. Gone is the clash of blocs, but replaced by what?Thomas Barnett has the answers. A senior military analyst with the U.S. Naval War College, he has given a constant stream of briefings over the past few years, and particularly since 9/11, to the highest of high-level civilian and military policymakers-and now he gives it to you. The Pentagon's New Map is a cutting-edge approach to globalization that combines security, economic, political, and cultural factors to do no less than predict and explain the nature of war and peace in the twenty-first century. Building on the works of Friedman, Huntington, and Fukuyama, and then taking a leap beyond, Barnett crystallizes recent American military history and strategy, sets the parameters for where our forces will likely be headed in the future, outlines the unique role that America can and will play in establishing international stability-and provides much-needed hope at a crucial yet uncertain time in world history.For anyone seeking to understand the Iraqs, Afghanistans, and Liberias of the present and future, the intimate new links between foreign policy and national security, and the operational realities of the world as it exists today,The Pentagon's New Map is a template, a Rosetta stone. Agree with it, disagree with it, argue with it-there is no book more essential for 2004 and beyond.",
        "Category": " History , Military , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Conservatives Without Conscience",
        "Authors": "By Dean, John W.",
        "Description": "The author of the best-selling Worse Than Watergate denounces practices among political conservatives, charging the current administration with using religious morality and propaganda-like tactics to promote big business interests and silence alternate perspectives at the expense of the nation's constitutional foundations. 250,000 first printing.",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Bouquets and Posies (Gifts from Nature Series)",
        "Authors": "By Jollands, Beverly",
        "Description": "",
        "Category": " Crafts & Hobbies , Flower Arranging",
        "Publisher": "Lorenz Books",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Great Housewives of Art",
        "Authors": "By Swain, Sally",
        "Description": "Offers humorous examinations of the inspirations for many great works of art, finding it largely in the household chores performed by the artist's wives",
        "Category": " Humor , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Will They Ever Trust Us Again?: Letters From the War Zone",
        "Authors": "By Moore, Michael (EDT)",
        "Description": "American soldiers serve willingly. They risk their lives so the rest of us can be safe. The one small thing they ask, though, is that they not be sent into harm's way unless it is absolutely necessary. But after being lied to about weapons of mass destruction and about the connection between al Qaeda and Iraq; after being forced by stop-loss orders to extend their deployment; after being undertrained, underequipped, and overworked long after George Bush declared Iraq \"Mission Accomplished,\" these soldiers have something to say.  From his famous 2003 Oscar acceptance speech to his record-breaking documentary Fahrenheit 9/11, Michael Moore has been an outspoken critic of the Bush administration and the war in Iraq. But in this book, Moore gives the spotlight to the real heroes of protest: the men and women who have fought in Iraq and want the American public to know how they feel about their mission and their commander in chief. Moore also fields letters from veterans of other wars and mothers, wives, and siblings of our heir anger and frustration, their tears and pain, and their hopes and prayers.  Impassioned, accessible, and moving, these are letters that reveal the true hearts and minds of the men, women, and families on the front line.",
        "Category": " Political Science , Reference",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Paris Was Yesterday",
        "Authors": "By FLANNER, Janet",
        "Description": "",
        "Category": "",
        "Publisher": "Viking",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "July",
            "Year": "1972"
        }
    },
    {
        "Title": "Napoleon Bonaparte: A Life",
        "Authors": "By Schom, Alan",
        "Description": "Filling a remarkable gap, Alan Schom, an acclaimed historian, scholar and author, offers the most complete picture ever of Napoleon Bonaparte, \"the scourge of Europe\" and France&#39;s greatest hero. Based on more than 10 years of exhaustive research, Schom illuminates Napoleon&#39;s important economic and social reforms, his reorganization of the French government and his tempestuous personal life and its effect on his political decisions.   Remarkably ambitious and compulsively readable, Napoleon Bonaparte covers every aspect of l&#39;Empereur&#39;s life and career -- from his childhood on Corsica to his dramatic rise to the throne of France; from his campaigns of conquest to his final crushing defeat at Waterloo and death in exile on St. Helena. A lively and accessible text, Schom&#39;s book is generously illustrated with halftones and maps and features startling new insights about Napoleon&#39;s key aides, ministers and generals. Schom portrays Napoleon with candor, exalting his ambition and undeniable genius, but also addressing his dark side -- his ego, his failures and frailties, and the misery caused by his years of warfare across Europe. Powerful, dramatic, colorful and impossible to put down, Napoleon Bonaparte is a biography as complex, challenging and fascinating as the legend himself.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Harper",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Chicken (Great Taste, Low Fat)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Poultry",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The War for the Union, Vol. 1: The Improvised War, 1861-1862",
        "Authors": "By nevins, allan",
        "Description": "Adventures of the leader of the Vermont militia which took on the British Army during the American Revolution",
        "Category": " History , General",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "The Holocaust: The Destruction of European Jewry 1933-1945",
        "Authors": "By Levin, Nora",
        "Description": "A documented history of German genocide of European Jews and of the various forms of Jewish resistance",
        "Category": " History , Holocaust",
        "Publisher": "Schocken",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "What Was Naturalism?",
        "Authors": "By Stone, Edward",
        "Description": "",
        "Category": "",
        "Publisher": "Appleton-Century-Crofts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Dear God, I Just Can't Sleep...Want to Talk? (Dear God Kids)",
        "Authors": "By Annie Fitzgerald",
        "Description": "",
        "Category": "",
        "Publisher": "Flying Frog Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "A Little Tour in France",
        "Authors": "By James, Henry",
        "Description": "",
        "Category": "",
        "Publisher": "Farrar Straus & Giroux",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "How to Get Your Kid to Eat: But Not Too Much",
        "Authors": "By Satter, Ellyn",
        "Description": "Answering a multitude of questions—such as What should a parent do with a child who wants to snack continuously? How should parents deal with a young teen who has declared herself a vegetarian and refuses to eat any type of meat? Or What can parents do with a child who claims he doesn't like what's been prepared, only to turn around and eat it at his friend's house?—this guide explores the relationship between parents, children, and food in a warm, friendly, and supportive way.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Bull Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Abba Eban: An Autobiography",
        "Authors": "By Eban, Abba Solomon",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The twaining of America",
        "Authors": "By Fiske, B. J",
        "Description": "",
        "Category": "",
        "Publisher": "Dorrance Pub",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Big Bad City (87th Precinct Mysteries)",
        "Authors": "By McBain, Ed",
        "Description": "The first thing you need to know about this city is that it is big. It is difficult to explain to someone who has never seen it. You can fold his town into a corner of one of the city's five separate sectors and still have room for more. The next thing you need to know is that it's dangerous. Never mind the reassuring bulletins from the mayor's office; just watch the first ten minutes of the eleven o'clock news and you'll learn exactly what the people of this city are capable of doing to other people in this city. So, if you came here thinking, Gee, there's going to be a neat little murder that takes place in a town house and some blue-haired lady will solve it, then you came to the wrong city at the wrong time of year. In this city, you have to pay attention. In this city, things are happening all the time, all over the place, and you don't have to be a detective to smell evil in the wind.  This week's city tabloids depict the face of a pretty, dead girl who lay sprawled near a park bench not seven blocks from the 87th precinct house, while the late night news reports on the latest exploits of The Cookie Boy, a professional thief who leaves a box of chocolate chip cookies behind after a score. Behind the scenes, detectives Carella and Brown soon discover that this is not your average dead girl, but one with an unusual past. As they piece together her secrets, detectives Meyer and Kling search Isola's pawnshops for items stolen by The Cookie Boy. While the detectives are investigating their cases, one of them is being stalked by the man who killed his father.  Like the city itself, this novel is wonderfully complex and filled with memorable characters, honest dialogue, and breathtaking violence.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Solis",
        "Authors": "By Attanasio, A. A.",
        "Description": "\"To die - to sleep...and by sleep to say we end...\" has for four hundred years said it all on the subject of life's finality, but what if death were just a sleep - a long, long sojourn out of one world, literally into another?One thousand years from now, Charlie Outis awakes to discover that he is a brain without a body; his gray matter was preserved through cyrogenics in a century he left behind, and now he must exist in a world that he can barely recognize. Even one thousand years from now, a good head - with or without shoulders - is worth more that a handful of computer chips. Charlie discovers he is in fact a hot commodity and is forcibly installed into a bit of interstellar transportation. Plying the asteroid-belt run, Charlie spends his days lamenting his tale of woe across radio waves. Soon Charlie's cause becomes celebrated and he finds his fate on mankind's sister planet, Mars, trading, he hopes, an old world for a new body.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Inheritance: A Novel",
        "Authors": "By Savage, Tom",
        "Description": "Yesterday, she was Holly Smith, living a comfortable, middle-class life. Today, all that has changed. For Holly Smith is actually Holly Randall, born twenty-four years ago to a woman convicted of a heinous crime and given up for adoption as an infant. Now, the mysterious death of a great aunt she never knew has made Holly one of the richest women in America - and heiress to a magnificent Connecticut estate.In the beautiful mansion above Long Island Sound, they are waiting for her. Uncle John and his imperious wife, robbed of what they believe to be rightfully theirs; the odd, reclusive great uncle, lost in his faded scrapbooks and disturbing memories of dark family secrets; the troubled young woman who roams the estate, murmuring cryptic warnings; the handsome servants' son to whom Holly is dangerously attracted; and the silent teenage boy who watches Holly's every move. But is he protector or predator, angel or devil? For Holly, the answer may come too late. From the moment she crosses the threshold, she sets in motion a series of tragic events that will reveal the true - and terrifying - price of the inheritance.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Oriental Casebook of Sherlock Holmes (Nine adventures from the lost years)",
        "Authors": "By Ted Riccardi",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Honor Bound",
        "Authors": "By Griffin, W. E. B.",
        "Description": "A crackling new novel from the author of the bestselling Corps series.From the Brotherhood of War novels to the saga of The Corps, W. E. B. Griffin's rich characters and special flair for the military heart and mind have made him one of America's most popular novelists.It is fall 1942. First Lieutenant Cletus Frade, a Spanish-speaking Marine aviator ace fresh from Guadalcanal, is suddenly called to a meeting with a Colonel Graham. Shortly thereafter, so too are Army demolitions expert and parachutist Second Lieutenant Anthony Pelosi, and Army Staff Sergeant and multilingual Counterintelligence Corps special agent David Ettinger, a communications expert who has already escaped from German hands in Europe. The three are about to become a team, but in an operation unlike any they have ever known before. For the mysterious Colonel Graham is in the OSS, their new mission is to sabotage by any means necessary the resupply of German ships and submarines, and their destination is not just anywhere, but Buenos Aires.In 1942, supposedly neutral Buenos Aires puts Casablanca and Lisbon to shame - a lethal mixture of German and American agents, Axis and Allied sympathizers, and ruthless internal security officers. If the three soldiers are to succeed in such a place, they will have to be not only very good - but very lucky.Written with all the energy and expertise that have driven Griffin's previous novels, filled with crackling realism, drama, and real heroes, Honor Bound is a captivating novel of valor and adventure, sure to please old fans and new.",
        "Category": " Fiction , War & Military",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "More Momilies",
        "Authors": "By Slung, Michele",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "The Yan Can Cook Book",
        "Authors": "By Yan, Martin",
        "Description": "An introduction to the basic Chinese cooking techniques includes recipes for a variety of vegetable, pork, chicken, and rice dishes",
        "Category": " Cooking , Regional & Ethnic , Chinese",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Bishop and The Missing L Train (A Father Blackie Ryan Mystery)",
        "Authors": "By Greeley, Andrew M.",
        "Description": "The Vatican has just assigned Auxiliary Bishop Gus Quill to the Archdiocese of Chicago - over the violent protests of Archbishop Cronin and the not-so-silent protests of Bishop Blackie. Bishop Quill is under the illusion, one might say delusion, that he has been sent from Rome to replace the good Cardinal, when in fact we know that Rome sent him to Chicago to get rid of him because of his incompetence.Immediately upon arriving in Chicago, the new Auxiliary Bishop manages to disappear while riding the L train - and strangely enough, the whole train disappears with him. Naturally, it is up to Blackie to find him. As the Cardinal says, \"The Vatican does not like to lose Bishops, even Auxiliaries.\" When the Archbishop suggests something, our hero doesn't exactly jump - he's not the jumping kind - but he does \"see to it.\"",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "A Formula of His Own: Henry Adams's Literary Experiment",
        "Authors": "By Conder, John J.",
        "Description": "",
        "Category": " Literary Criticism , General",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Every Night at Five",
        "Authors": "By Npr (National Public Radio)",
        "Description": "",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "All Time Family Favorites: Casseroles & One-Dish Meals",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Publlications International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Genius of the Sea : A Novel",
        "Authors": "By Murr, Naeem",
        "Description": "Daniel Mulvaugh is haunted by his failures. He has tried not to think about the death of his closest friend, for which he feels responsible, or the reasons for his mother's lifelong secrecy. He's estranged from his wife and true love, and his ability to connect to his life has begun to elude him. At this impasse, he can no longer find distraction in his pub-happy friends, or fulfillment in dealing with the squalid troubles of his social welfare clients.When fate beckons Daniel in the form of Amos Radcliff, a bizarre ex-merchant marine living in Daniel's childhood apartment, he finds comfort in surrendering to this man's stories about his experiences on the high seas. But Amos isn't all he seems, and Daniel soon realizes that the key to his own past resides somewhere in these increasingly intimate and disturbing tales.Between Amos and Daniel, the story moves back and forth: from the working-class pubs of London to the shantytowns of Bangkok, from a sanatorium for the mentally ill to a South American merchant ship crewed by misanthropic sailors, from this world into a deeper and more mysterious one of primal loss, love, and betrayal.",
        "Category": " Fiction , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Aladdin",
        "Authors": "By Golden Books Publishing Company",
        "Description": "A retelling of the adventures of Aladdin, who, with the aid of a genie from a magic lamp, fights an evil sorcerer and wins the hand of a beautiful princess.",
        "Category": " Social Science , General",
        "Publisher": "Western Publishing Company, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The New Birth Order Book: Why You Are the Way You Are",
        "Authors": "By Leman, Kevin and Leman, Keith",
        "Description": "Explains family dynamics and the effects of birth order on personality and offers advice on parenting and other important relationships",
        "Category": " Family & Relationships , General",
        "Publisher": "Fleming H. Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Jesus Freaks: Stories of Those Who Stood for Jesus, the Ultimate Jesus Freaks",
        "Authors": "By D. C. Talk",
        "Description": "",
        "Category": " Religion , Christianity , Literature & the Arts",
        "Publisher": "Albury Publishers",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Angels in America, Part Two: Perestroika",
        "Authors": "By Kushner, Tony",
        "Description": "The second half of Tony Kushner's Pulitzer Prize-winning epic Angels in America, Perestroika steers the characters introduced in Millennium Approaches from the opportunistic eighties to a new sense of community in the nineties. \"Not only a stunning resolution of the resounding human drama of Millennium Approaches, but also a true millennial work of art.\"--Frank Rich, The New York Times",
        "Category": " Drama , American , General",
        "Publisher": "Theatre Communications Group",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "One Day, All Children...: The Unlikely Triumph of Teach For America and What I Learned Along the Way",
        "Authors": "By Kopp, Wendy",
        "Description": "As a twenty-one-year-old college senior in 1988, Wendy Kopp was a bona fide member of the \"Me Generation.\" Yet she found herself searching for a chance to make a difference in the world, and she sensed that she was not alone.From her dorm room at Princeton University, Wendy developed a plan to call upon the most talented members of her generation to teach for two years in the nation's neediest urban and rural public schools. She envisioned a new national service corps called Teach For America that would heighten our country's commitment to its most disadvantaged children.One Day, All Children...is the story of one young social entrepreneur and her dream for a better America. It reveals the struggles of an organization created by and for young idealists. But more importantly, it explores the growth of a new civil rights movement, a movement that demands equal educational opportunity for all Americans. Wendy's vision is that one day, all children in this nation will have the opportunity to attain an excellent education. In this book, she shows us that we can make her vision a reality.",
        "Category": " Education , Finance",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Lifetime Encyclopedia of Letters (3rd Revised and Expanded)",
        "Authors": "By Meyer, Harold E.",
        "Description": "",
        "Category": " Business & Economics , Reference",
        "Publisher": "Prentice Hall Trade",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Man on Earth: A Celebration of Mankind: Portraits of Human Culture in a Multitude of Environments",
        "Authors": "By Reader, John",
        "Description": "Explores the adaptation of different cultures to the environmental and geographical conditions they live with, to find the best means of food production and subsistence",
        "Category": " Social Science , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "NEVER WORK FOR/JERK",
        "Authors": "By King, Patricia",
        "Description": "Describes various types of unpleasant bosses, gives practical advice on improving the work situation, and tells how to identify reasonable managers",
        "Category": " Business & Economics , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Dinner's Ready",
        "Authors": "By Hartwig, Daphne Metaxas",
        "Description": "Offers a collection of easy-to-prepare recipes that can be cooked ahead of time in serving-sized portions and can be put on the table in minutes",
        "Category": " Cooking , Reference",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Lean Thinking : Banish Waste and Create Wealth in Your Corporation",
        "Authors": "By Womack, James P. and Jones, Daniel T.",
        "Description": "In their landmark book The Machine That Changed the World, James Womack and Daniel Jones, two of the top industrial analysts in the world, explained how companies can dramatically improve their performance through the \"lean production\" approach pioneered by Toyota. Lean Thinking extends these ideas to provide a rallying cry for today's corporate leaders.  After a decade of downsizing and reengineering, most companies in North America, Europe, and Japan are still stuck, searching for a formula for sustainable growth and success. The problem, as Womack and Jones explain in Lean Thinking, is that managers have lost sight of value for the customer and how to create it. By focusing on their existing organizations and outdated definitions of value, managers create waste, and the economies of the advanced countries continue to stagnate.  What's needed instead is lean thinking to help managers clearly specify value, to line up all the value-creating activities for a specific product along a value stream, and to make value flow smoothly at the pull of the customer in pursuit of perfection. The first part of the book describes each of these concepts and makes them come alive with striking examples.  As Lean Thinking clearly demonstrates, these simple ideas can breathe new life into any company in any industry, routinely doubling both productivity and sales while stabilizing employment. But most managers will need guidance on how to make the lean leap in their firm. Part II provides a step-by-step action plan, based on in-depth studies of fifty lean companies in a wide range of industries across the world -- including Pratt & Whitney, Porsche, and Toyota.  Even those readers who believe they have embraced lean thinking will discover in Part III that another dramatic leap is possible by creating a lean enterprise for each of their product families that tightly links all value-creating activities from concept to product launch, from order to delivery, and from raw materials into the arms of the consumer. This new concept takes the best features from the American, German, and Japanese industrial traditions and recombines them in a way that can be applied to every economic activity, from long-distance travel to construction to health care.  Lean Thinking does not provide a new management \"program\" for the one-minute manager. Instead, it offers a new way of thinking, being, and doing for the serious manager -- one that will change the world.",
        "Category": " Business & Economics , Training",
        "Publisher": "Productivity Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Every Little Thing About You (A Yellow Rose Trilogy #1)",
        "Authors": "By Wick, Lori",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Winning Right: Campaign Politics and Conservative Policies",
        "Authors": "By Gillespie, Ed",
        "Description": "It's been nearly two decades since Chris Matthews' national bestseller Hardball opened a door onto the inner workings of Washington politics, and now the time is ripe for a sharp, new insider's perspective on how the game is played and on the challenges facing the Republican Party in the future. No one is more qualified to provide that analysis than Ed Gillespie: In Winning Right, the former chairman of the Republican National Committee draws from lessons learned in more than twenty years of campaign strategy and national policy debate -- most especially from his role at the heart of the historic and groundbreaking 2004 presidential election -- to reveal how the game of politics is played on its highest level. In a frank and engaging narrative, he looks inside the George W. Bush presidency and beyond, to discuss such topics as    A political code of ethics and playing by the rules   Successes and failures in campaign planning and execution   The role of old and new media   The battle for the Supreme Court   Hot-button issues   The future of the GOP -- and how to win right in 2008",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "Threshold Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Successful Manager's Handbook : Development Suggestions for Today's Managers",
        "Authors": "By Davis, Brian L. (EDT) and Personnel Decisions International (COR)",
        "Description": "",
        "Category": "",
        "Publisher": "Personnel Decisions International",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Informed Argument",
        "Authors": "By Miller, Robert Keith",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace Jovanovich Japan",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Rich Dad's Retire Young, Retire Rich: How to Get Rich Quickly and Stay Rich Forever!",
        "Authors": "By Kiyosaki, Robert T. and Lechter, Sharon L.",
        "Description": "This book is about how we started with nothing and retired financially free in less than ten years. Find out how you can do the same. If you do not plan on working hard all of your life...this book is for you. Why not Retire Young and Retire Rich?",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Business Plus",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Passionate God",
        "Authors": "By Haughton, Rosemary",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "Baltimore: Charm City (Urban Tapestry Series)",
        "Authors": "By Miller, Roger, Rodricks, Dan, and Brown, Carolyn Spencer",
        "Description": "",
        "Category": " Photography , Photojournalism",
        "Publisher": "Towery Pub",
        "Price Starting With ($)": "8.4",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Golf Magazine's Top 100 Courses You Can Play",
        "Authors": "By McCallen, Brian",
        "Description": "The biennial survey of the top one hundred golf courses that admit non-members features more than three hundred color photographs of the best greens and useful information on lodging, dining, and entertaining.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Nostradamus: Visions of the Future",
        "Authors": "By Brennan J H",
        "Description": "",
        "Category": " Philosophy , General",
        "Publisher": "Aquarian / Thorsons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Moral Compass: Stories for a Life's Journey",
        "Authors": "By Bennett, William J. (EDT)",
        "Description": "The Moral Compass, the inspiring and instructive companion volume to The Book of Virtues, offers many more examples of good and bad, right and wrong, in great works from literature and in exemplary stories from history. Organized by the stages along life's journey, The Moral Compass moves from the first character lessons taught in the home, which shape the way children see life, to the countless choices that call the virtues into play as they grow older. The stories and poems serve as reference points on a moral compass, guiding the reader through the ethical and spiritual challenges along the pathway of life: leaving home, entering into marriage, easing the burdens of others, nurturing one's children , and fulfilling the obligations of citizenship and leadership.The Moral Compass offers well-known examples from Western history and mythology along with a wider selection of tales and folklore from Asia, Africa, and Latin America. Drawing on familiar authors such as Hans Christian Andersen, Washington Irving, Leo Tolstoy, and John Milton, as well as on intriguing but forgotten tales from centuries past, the stories in the Moral Compass are literary and evocative, designed to inspire as well as instruct.",
        "Category": " Literary Criticism , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Chinese Cinderella and the Secret Dragon Society",
        "Authors": "By Mah, Adeline Yen",
        "Description": "The future belongs to you. Should anyone insult you, tell yourself this: I am a child of destiny who will unite East and West and change the world.After enduring abuse at the hands of her cruel stepmother, Chinese Cinderella (CC) seeks refuge at a martial-arts school and joins a secret dragon society.Under the guidance of Grandma Wu, CC is introduced to the exciting world of espionage as a part of the Chinese Resistance movement. And when CC and her new comrades take on a daring mission to rescue a crew of WWII American airmen, they prove that true bravery knows no age barrier.",
        "Category": " Juvenile Fiction , Social Themes , Self-Esteem & Self-Reliance",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Cry, The Beloved Country",
        "Authors": "By Paton, Alan",
        "Description": "Cry, the Beloved Country is a beautifully told and  profoundly compassionate story of the Zulu pastor  Stephen Kumalo and his son Absalom, set in the  troubled and changing South Africa of the 1940s.   The book is written with such keen empathy and  understanding that to read it is to share fully in the  gravity of the characters' situations. It both touches  your heart deeply and inspires a renewed faith in  the dignity of mankind. Cry, the Beloved Country is  a classic tale, passionately African, timeless and  universal, and beyond all, selfless.",
        "Category": " Fiction , Classics",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Roger Dawson's Secrets of Power Negotiating",
        "Authors": "By Dawson, Roger",
        "Description": "Offers business executives, managers, and salespeople a guide to developing effective negotiating skills by using the author's easily understood negotiating gambits",
        "Category": "",
        "Publisher": "Career Pr Inc",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Dried flowers for all seasons",
        "Authors": "By Berry, Susan, Raworth, Jenny, and Newton, Mike (PHT)",
        "Description": "Organized by season, a complete, practical guide to drying and arranging flowers features more than twenty carefully explained projects and visual reference guides to flowers and foliage by color. 30,000 first printing.",
        "Category": " Crafts & Hobbies , Flower Arranging",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Complete Idiot's Guide to Etiquette (The Complete Idiot's Guide)",
        "Authors": "By Mitchell, Mary and Corr, John",
        "Description": "In this Complete Idiot's Guide, you get solid information on basic business etiquette - from taking phone messages to speaking with the CEO; the Ins and Outs of business and home entertaining; friendly advice on formal dining, including which fork to use with each course; tips, definitions, and warnings to help you along the way; valuable advice on buying gifts; and travel dos and don'ts.",
        "Category": " Reference , Etiquette",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "If Life Is a Game, These Are the Rules: Ten Rules for Being Human as Introduced in Chicken Soup for the Soul",
        "Authors": "By Carter-Scott, Cherie",
        "Description": "Learn the rules of life to conquer any challenge, manage unpredictable ups and downs, and become a satisfied and well-adjusted person.We all know the feeling: In the game of life, why am I the only one who doesn't know how to play? But now, help is at hand, because this wonderful little book will teach you the rules so that you can conquer life's challenges and manage its unpredictable ups and downs.For one of her workshops several years ago, Chérie Carter-Scott, a corporate trainer and consultant, composed a list of basic truths about life, which she named \"The Ten Rules for Being Human.\" Right away, the Rules resonated with her clients, who photocopied and passed the list to friends and relatives. Within months, Chérie's Rules were in thousands of homes all over the country, and eventually, they were published in Chicken Soup for the Soul and have also appeared in Ann Landers' column. Although there's no formula to help you win the game of life, Chérie's Rules convey a universal wisdom that, once understood and embraced, can contribute to meaningful relationships with ourselves and others, at work and in the home.In If Life Is a Game, These Are the Rules, Chérie shares that there are no mistakes in life, only lessons that are repeated. In thoughtful, inspirational essays illustrated with encouraging personal anecdotes, she includes the lessons that can be learned from each of the Rules and offers insights on self-esteem, respect, acceptance, forgiveness, ethics, compassion, humility, gratitude, and courage. Best of all, Chérie shows that wisdom lies inside each one of us and that by putting the Ten Rules for Being Human into action we can create a more fulfilling life.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Treasures (From My Utmost For His Highest)",
        "Authors": "By Oswald Chambers",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Mountain Bike America Virginia: An Atlas of Virginia's Greatest Off-Road Bicycle Rides (Mountain Bike America Series)",
        "Authors": "By Adams, Scott",
        "Description": "",
        "Category": "",
        "Publisher": "Beachway Press",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Tarzan (Disney Moviebook Library, Vol. 9)",
        "Authors": "By Edgar Rice Burroughs",
        "Description": "",
        "Category": "",
        "Publisher": "Advance Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Children : The Challenge",
        "Authors": "By Rudolf Dreikurs, Vicki Soltz",
        "Description": "Individual case studies and a sound psychological approach deal with rational methods for the solution of family conflicts and the development of a healthy relationship between parent and child",
        "Category": "",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Douglas Adams's Starship Titanic: A Novel",
        "Authors": "By Adams, Douglas and Jones, Terry",
        "Description": "Arguably the greatest collaboration in the whole history of comedy!Bestselling author Douglas Adams wrote the storyline based on his CD-ROM game of the same name (as this novel, not as him, obviously).Terry Jones of Monty Python wrote the book. In the nude! Parents be warned! Most of the words in this book were written by a naked man!So. You want to argue with that? All right, we give in.Starship Titanic is the greatest, most fabulous, most technologically advanced interstellar cruise line ever built. It is like a cross between the Queen Mary, the Chrysler Building, Tutankhamen's tomb, and Venice. Furthermore, it cannot possibly go wrong. . . .Sadly, however, seconds after its launch it undergoes SMEF, or Spontaneous Massive Existence Failure. And disappears. Except, everything's got to be somewhere. Coming home that night, on a little known planet called Earth, Dan and Lucy Gibson find something very large and very, very shiny sticking into their house. . .",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Lizzie McGuire: The Rise and Fall of the Kate Empire",
        "Authors": "By Larsen, Kirsten (ADP)",
        "Description": "Lizzie McGuire always tries to stay out of Kate Sanders's way. Ever since Kate made cheerleader, she has become the most popular girl in school. And she's turned into a major she-beast -- the kind that likes to hunt defenseless Lizzies. Yikes! But when Kate injures her ankle in cheerleading practice, the other girls kick her off the squad. Suddenly, Kate isn't so popular anymore. Lizzie wants to he;p her old friend...but Kate still won't give her the time of day. Can Lizzie get Kate to admit that - for once - she actually needs Lizzie's help?",
        "Category": " Juvenile Fiction , Social Themes , Adolescence & Coming of Age",
        "Publisher": "Volo",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "World's fair through a camera: Snap shots by an artist",
        "Authors": "By Todd, F. Dundas",
        "Description": "",
        "Category": "",
        "Publisher": "Woodward & Tiernan Print. Co",
        "Price Starting With ($)": "37.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1893"
        }
    },
    {
        "Title": "Black Lies, White Lies: The Truth According to Tony Brown",
        "Authors": "By Brown, Tony",
        "Description": "PBS television commentator and syndicated radio talk show host Tony Brown attacks the political and cultural attitudes of both blacks and whites that have perpetuated racism and fostered a black underclass in the US.  Also discusses the US economy, AIDS, biomedical research, and other topics. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Gilles and Jeanne (English and French Edition)",
        "Authors": "By Tournier, Michel",
        "Description": "Depicts the relationship between Gilles de Rais, later know as Bluebeard, and Joan of Arc, and suggests the effect of her condemnation and martyrdom on him",
        "Category": " Fiction , General",
        "Publisher": "Grove Weidenfield",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "The Decline and Fall of the House of Windsor",
        "Authors": "By Spoto, Donald",
        "Description": "After a veritable avalanche of books on this or that member of the contemporary Royal Family of Great Britain, here at last we have the entire Windsor tapestry - a dramatic, colorful, intimate, sometimes poignant, and often shocking family history.The Decline and Fall of the House of Windsor is in fact a compelling album of portraits - the first book to tell the whole story of the family that has occupied the British throne from the reign of Queen Victoria to the time of Queen Elizabeth II.",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Great British Paintings from American Collections: Holbein to Hockney",
        "Authors": "By Warner, Malcolm, Yale Center for British Art (COR), Alexander, Julia Marciari, Allen, Brian, Asleson, Robyn, McCaughey, Patrick, and Henry E. Huntington Library and Art Gallery (COR)",
        "Description": "Outside Britain itself, the richest holdings of British art are found in American collections. This extraordinary presentation of some 85 works pays tribute to this strength of American collecting, while offering a fresh and engaging account of the history of painting in Britain from the sixteenth century to the present. The selection is drawn from collections from around the United States, both public and private, and includes spectacular pictures from the Yale Center for British Art and the Huntington Art Collections in California--the two leading collections of British art in America. Among the highlights are such masterpieces as Sir Anthony Van Dyck’s portrait of Queen Henrietta Maria with her dwarf, Sir Jeffrey Hudson, William Hogarth’s Beggar’s Opera, Thomas Gainsborough’s Blue Boy, Henry Fuseli’s Nightmare, John Constable’s Hadleigh Castle, J. M. W. Turner’s Staffa, Fingal’s Cave, and William Holman Hunt’s Lady of Shalott. Following introductory essays by Malcolm Warner on anglophilia and art, and by Robyn Asleson on the history of collecting British art in the States, each painting is reproduced in color, with a discussion of its artistic importance and the circumstances of its crossing the Atlantic.",
        "Category": " Art , Collections, Catalogs, Exhibitions , General",
        "Publisher": "YC British Art",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Super Stereogram",
        "Authors": "By Cadence Books",
        "Description": "A sequel to the best-selling Stereogram presents a collection of stunning pictures that allow readers to experience three-dimensional images in an exciting new way and includes \"stereo naturalism\" and incredible stereo pairs based on famous paintings. 100,000 first printing. Original. IP.",
        "Category": " Art , General",
        "Publisher": "Cadence Books",
        "Price Starting With ($)": "5.75",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Be Your Own Home Decorator: Creating the Look You Love Without Spending a Fortune",
        "Authors": "By Guntlow, Pauline B.",
        "Description": "Presented with an infectious \"can-do\" attitude and clear instructions, Be Your Own Home Decorator tells how to select a look and carry it throughout your home; customize kitchens, bedrooms, living rooms, and baths; maximize storage and enhance the usefulness of existing space; use moldings, prints, and window treatments for visual appeal; transform secondhand furnishings into customized pieces; combine colors and textures to create a distinctive look; and refinish floors, install tiling, and do basic renovations yourself.",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Steven Raichlen's High-Flavor, Low-Fat Cooking",
        "Authors": "By Raichlen, Steven",
        "Description": "",
        "Category": "",
        "Publisher": "Camden House Publishing (VT)",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Cultural Life of the New Nation (The New American nation series)",
        "Authors": "By Nye, Russel Blaine",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row/ Torchbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Hotel Du Lac",
        "Authors": "By Brookner, Anita. and Desser, Robin (EDT)",
        "Description": "In the novel that won her the Booker Prize and established her international reputation, Anita Brookner finds a new vocabulary for framing the eternal question \"Why love?\"  It tells the story of Edith Hope, who writes romance novels under a psudonym.  When her life begins to resemble the plots of her own novels, however, Edith flees to Switzerland, where the quiet luxury of the Hotel du Lac promises to resore her to her senses.But instead of peace and rest, Edith finds herself sequestered at the hotel with an assortment  of love's casualties and exiles.  She also attracts the attention of a worldly man determined to release her unused capacity for mischief and pleasure.   Beautifully observed, witheringly funny, Hotel du Lac is Brookner at her most stylish and potently subversive.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Mirth of a Nation: The Best Contemporary Humor",
        "Authors": "By Rosen, Michael J. (EDT)",
        "Description": "Seriously Funny Writing By Today's Most Celebrated AuthorsAt last, a premier showcase of fifty-four great literary humorists and masters of the journalistic jab, the social spoof, the parodic proof, the satire, the tirade, and the send-up. Here are those \"last laughs\" and \"wit's end\" pieces everyone turns to first but then loses in back issues of favorite magazines and newspapers, including:Merrill Markoeon Networking with angelsGarry Trudeau on re-retranslating MadonnaDavid Sedaris on reviewing school Christmas PlaysJohn Updike on cross-dressing with J. Edgar HooverAlso included are riotous contributions from Henry Alford, Jon Stewart, and David Ives, as well as millennial maxims by Mark O'Donnell, gardening advice by Mertensia Corydalis, and highlights from Randy Cohen's savvy \"News Quiz.\"Brought to you by The Thurber House",
        "Category": " Humor , Form , Essays",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Copying Masterpieces (Watson-Guptill Artist's Library)",
        "Authors": "By Parramon, Jose Maria",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Watson-Guptill Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "A Bed by the Window",
        "Authors": "By Peck, M. Scott",
        "Description": "FROM THE INTERNATIONAL BESTSELLING AUTHOR OF THE ROAD LESS TRAVELLED - HIS FIRST NOVEL, A POWERFUL STORY OF MYSTERY AND REDEMPTIONWithin the self-contained world of the Willow Glen nursing home there are two extraordinary people. One is there to give care, the other to recieve it. Together they form a bond of love and trust that transcends their expectations and changes their lives. STEPHEN SOLARIS - imprisoned in a helpless body since birth, unable even to speak, he has an incredible ability to touch the hearts of those around him with the power of his personality. HEATHER BARSTEN - a nurse whose devotion to her patients surpasses her ability to fulfil her own needs. From Stephen she learns the importance of being true to her own heart. And she finds herself falling in love. Then violence shatters Willow Glen. Residents and staff must confront a truly terrifying evil and face their innermost fears, suspicions and darkest secrets... A BED BY THE WINDOW is an exceptional work, a gripping psychological thriller and a luminous bringing together of Peck's thoughts on good and evil, spiritual growth and the miracles worked by love.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "I Die, but My Memory Lives on: The World AIDS Crisis and the Memory Book Project",
        "Authors": "By Mankell, Henning",
        "Description": "Henning Mankell, internationally famous creator of the bestselling Kurt Wallander mysteries, here offers a nonfiction fable about a heartrending tradition spawned by a major health crisis: the invaluable Memory Book Project, which gives those dying of AIDS an opportunity to record their lives in words and pictures for the children they leave behind.In Uganda, Mankell finds village after village populated only by children and the elderly—those left behind after AIDS swept away an entire generation. These slim, intensely personal volumes can contain words, pictures, a pressed butterfly, or even grains of sand as ways to represent the lives lost to this devastating plague. Excerpts from Ugandan memory books appear throughout I Die, But My Memory Lives On and, together with Mankell’s narrative, they tell stories of individual lives while sounding a powerful warning about the threat of AIDS.Featuring a foreword by Archbishop Desmond Tutu, the book includes an appendix listing AIDS organizations and resources. A portion of the book’s proceeds with be donated to AIDS charities in Africa.",
        "Category": " Political Science , General",
        "Publisher": "The New Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Growing In Christ: A Thirteen-Week Follow-Up Course for New and Growing Christians",
        "Authors": "By Navigators",
        "Description": "This perennial best-selling discipleship tool contains the classic Bible studies Lessons on Assurance and Lessons on Christian Living in one package—13 lessons in all! These Navigator Bible studies are a great leader’s resource to explain the fundamentals of the Christian life. An ideal gift for a new believer or someone who has an interest in Jesus. Tear-out Scripture memory verse cards are included in KJV, NIV, NASB, and NKJV.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "NavPress",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Advancing Through Adversity (In Touch Study Series)",
        "Authors": "By Stanley, Charles F.",
        "Description": "Dr. Charles Stanley's new series of Bible study guides feature insights and wisdom of this beloved pastor and author.  Small groups and individuals who want a Bible study that's spiritually sound and practical will find a wealth of ideas to help them understand and apply the Scriptures to the real world.  Each title takes a unique fourfold approach to get the most out of Bible study time - emphasizing personal identification with the Scripture passage, recognition of your emotional response, reflection of the passage's meaning and application, and taking steps to apply what's been learned.  This is a sound way to explore the Word of God.",
        "Category": " Religion , Biblical Studies , Bible Study Guides",
        "Publisher": "Nelson Reference & Electronic Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "American Psychiatric Press Review of Psychiatry",
        "Authors": "By Hales, Robert E. (EDT) and Frances, Allen J.",
        "Description": "This is annual review of psychiatry that covers panic disorder, unipolar depression, suicide, electroconvulsive therapy, and cognitive therapy.",
        "Category": " Medical , Psychiatry , General",
        "Publisher": "Amer Psychiatric Pub Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Never Work for a Jerk",
        "Authors": "By King, Patricia",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Mass Hate: The Global Rise of Genocide and Terror (Revised and Updated)",
        "Authors": "By Kressel, Neil J.",
        "Description": "Mass Hate explores why the brutality of humankind erupted and flowed more expansively in the twentieth century than ever before. Psychologist Neil Kressel recommends specific steps to help stem this bloody global tide of slaughter, terror and genocide. In his investigation, Kressel focuses on the horrifying butchery in Rwanda, the terrifying tactics of rape and torture of women in Bosnia, the systematic murder of Jews and others during the Holocaust. He examines history, psychology, and political science for explanations of what propels a citizen to raise a machete against innocent neighbors, and, in a moving conclusion, suggests practical ways for humankind to eradicate the causes of mass hate. Now included in the preface is a discussion of the terrorist attack of September 11, 2001, on New York and the Pentagon.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Westview Press",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "About Cape Cod",
        "Authors": "By KELLEY,STANLEY",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Todd",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1936"
        }
    },
    {
        "Title": "Tuva or Bust!: Richard Feynman's Last Journey",
        "Authors": "By Leighton, Ralph",
        "Description": "The moving, humorous tale of Richard Feynman's quest for the lost country of Tannu Tuva follows the renowned physicist as he struggles with cancer and searches for the elusive Tuva.",
        "Category": " Science , Physics , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "McCARTHY FOR PRESIDENT",
        "Authors": "By Herzog, Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "24.94",
        "Publish Date": {
            "Month": "October",
            "Year": "1969"
        }
    },
    {
        "Title": "Complete Idiot's Guide to Photography Like a Pro",
        "Authors": "By Alpha Development Group (EDT) and Stensvold, Mike (EDT)",
        "Description": "You're no idiot, of course. You can snap a mean Polaroid on family vacations and capture memorable moments with a disposable. But when it comes to operating a camera with more than one button, you probably think your pictures are worth a lot less than a thousand words. Don't resign yourself to your Instamatic just yet! The Complete Idiot's Guide to Photography Like a Prois where beginning and even experienced shutterbugs can learn to take dazzling professional-quality family shots, holiday snaps, and nature images, with even the most basic equipment. In this Complete Idiot's Guide, you get:",
        "Category": " Photography , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "6.16",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "All I Really Need to Know I Learned in Kindergarten",
        "Authors": "By Fulghum, Robert",
        "Description": "1 cassette / 1 hourRead by the AuthorRobert Fulghum, Unitarian minister, tapes into the basic tenets we know already but tend to forget in the course of our increasingly complex lives.  In the title essay of this uplifting collection, Fulghum praises the rules we learned as children \"Share everything . .  Play fair . .  Live a balanced life . . Say you're sorry when you hurt someone\"  Remember these things as adults, Fulghum suggests, and your life can be richer, our world a better place.Listen to Robert Fulghum - he is an inspiration.",
        "Category": "",
        "Publisher": "Random House Audio",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Sound of Mad",
        "Authors": "By Meglin, Nick, Woodbridge, George",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Books, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Lost Jewels of Nabooti (Choose Your Own Adventure #4)",
        "Authors": "By Montgomery, R. A.",
        "Description": "If readers make the right decisions, they can help Peter and Lucy find the mysterious jewels of a secret African kingdom.",
        "Category": " Juvenile Fiction , Interactive Adventures",
        "Publisher": "Chooseco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Awesome Book of Heavenly Humor: Inspirational Jokes, Quotes, and Cartoons",
        "Authors": "By Phillips, Bob and Hawkins, Jonny (ILT)",
        "Description": "",
        "Category": " Humor , Topic , Religion",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Curtains: A Design Sourcebook",
        "Authors": "By Merrell, James (PHT) and Clifton-Mogg, Caroline",
        "Description": "",
        "Category": " House & Home , Decorating",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Middle East",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Congressional Quarterly, Inc.",
        "Price Starting With ($)": "7.26",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "101 Reasons Why a Cat Is Better Than a Man",
        "Authors": "By Zobel-Nolan, Allia and Hollander, Nicole (ILT)",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Adams Media Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Ancient Egpyt (Eyewitness)",
        "Authors": "By Hart, George",
        "Description": "Full-color photos. From the splendor of the pharaoh's court to the everyday life of ordinary people, the great civilization of the Nile valley is revealed in page after page of dramatic photos of the objects they left behind: human and animal mummies, reed brushes, children's pull-toys, and more. \"Stunning.\"--School Library Journal.",
        "Category": " Juvenile Nonfiction , History , Middle East",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Country Bunny and the Little Gold Shoes (Sandpiper Books)",
        "Authors": "By Heyward, Du Bose and Flack, Marjorie (ILT)",
        "Description": "To the surprise of many, the little country cottontail becomes one of the special Easter bunnies even though she has twenty-one children of her very own.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1974"
        }
    },
    {
        "Title": "The Amelia Bedelia Treasury: Three Books by Peggy Parish (An I Can Read Book)",
        "Authors": "By Parish, Peggy",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Presidential Doodles: Two Centuries of Scribbles, Scratches, Squiggles, and Scrawls from the Oval Office squiggles & scrawls from the Oval Office",
        "Authors": "By Greenberg, David and Cabinet Magazine",
        "Description": "What were the leaders of the free world really doing during all those meetings? As the creators of Cabinet magazine reveal here for the first time, they were doodling. Our Founding Fathers doodled, and so did Andrew Jackson. Benjamin Harrison accomplished almost nothing during his time in the White House, but he left behind some impressive doodles. During the twentieth century--as the federal bureaucracy grew and meetings got longer--the presidential doodle truly came into its own. Theodore Roosevelt doodled animals and children, while Dwight Eisenhower doodled weapons and self-portraits. FDR doodled gunboats, and JFK doodled sailboats. Ronald Reagan doodled cowboys and football players and lots of hearts for Nancy. The nation went wild for Herbert Hoover's doodles: A line of children's clothing was patterned on his geometric designs. The creators of Cabinet magazine have spent years scouring archives and libraries across America. They have unearthed hundreds of presidential doodles, and here they present the finest examples of the genre. Historian David Greenberg sets these images in context and explains what they reveal about the inner lives of our commanders in chief. Are Kennedy's dominoes merely squiggles, or do they reflect deeper anxieties about the Cold War? Why did LBJ and his cabinet spend so much time doodling caricatures of one another? Smart, revealing, and hilarious -- Presidential Doodles is the ideal gift for anyone interested in politics or history. And for anyone that doodles!",
        "Category": " History , United States , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Command of Office: How War, Secrecy, and Deception Transformed the Presidency, from Theodore Roosevelt to George W. Bush",
        "Authors": "By Graubard, Steven",
        "Description": "Command of Office reveals the remarkable-and dangerous-concentration of power in the American presidency over the course of the twentieth century, told through incisive analyses of the eighteen men who have held the office and the events that shaped their presidencies. Stephen Graubard tracks the steady expansion of secrecy as a tool of presidential authority, one that inevitably diminished the power of the other two branches of government. Widely esteemed by his fellow historians and with unique access to former members of both Republican and Democratic administrations, Graubard has written a masterful history of presidential power-essential reading for anyone concerned with American politics.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "This Is Cuba: An Outlaw Culture Survives",
        "Authors": "By Corbett, Ben",
        "Description": "Beyond the throngs of tourists streaming through Central Havana's broad Prado Avenue, and outside the yoke of Castro's 43-year-old Revolutionary program, there exists a parallel Cuba - a separate evolution of a people struggling to survive. With personal stories that depict a people torn between following the directives of their government and finding a way to better their lot, journalist Ben Corbett gives us the daily life of many considered outlaws by Castro's regime. But are they outlaws or rather ingenious survivors of what many Cubans consider to be a forty-year mistake, a tangle of contradictions that has resulted in a strange hybrid of American-style capitalism and a homegrown black market economy.At a time when Cuba walks precariously on the ledge between socialism and capitalism, This Is Cuba gets to the heart of this so-called outlaw culture, taking readers into the living rooms, rooftops, parks, and city streets to hear stories of frustration, hope, and survival. Updated with a new preface.",
        "Category": " Travel , Caribbean & West Indies",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    }
]