[
    {
        "Title": "Questions Women Ask in Private: Trusted Counsel on the Most Compelling Issues Women Face Today",
        "Authors": "By Wright, H. Norman",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Regal Books",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Fat Free & Ultra Lowfat Recipes: Over 175 Delicious Guilt-Free Recipes--No Butter, No Oil, No Margarine!",
        "Authors": "By Cross, Doris",
        "Description": "",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "More So Fat, Low Fat, No Fat For Family and Friends: Recipes for Family and Friends That Cut the Fat but Not the Flavor",
        "Authors": "By Rohde, Betty",
        "Description": "200 more tempting recipes from the author of So Fat, Low Fat, No Fat that taste so good you'll never believe they're good for you!Betty Rohde's first book, So Fat, Low Fat, No Fat, introduced the world to her delicious down-home low-fat food. In this new collection of sensible and savory dishes, you'll find recipes designed to please the palate and safeguard the waistlines of people who enjoy a well-stocked table without a lot of fuss in the kitchen. Now you can enjoy: -Ham Swirls -Sweet Potato Chips -Oklahoma Lazy-Daze Tex-Mex Casserole -Bayou Magic Chicken -Sausage and Grits for Breakfast -Old-Fashioned Banana Pudding -Spaghetti Pizza -Krispy Chicken Betty shares her tips for cutting fat and spicing up your diet, as well as menu suggestions for a Christmas morning party, a New Year's buffet, sit-down dinners, informal brunches, and more. More So Fat, Low Fat, No Fat makes having company, whether the occasion is casual or formal, a cause for celebration.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "National Geographic Atlas Of World History",
        "Authors": "By Grove, Noel",
        "Description": "00  The challenge to understanding history lies in the tendency to focus on single scenes instead of the big picture, akin to looking at a tapes-try by examining individual stitches instead of the entire design. The Atlas of World History undertakes a fair-minded journey through the human story by mingling close-up looks at events with broader views of what was then happening elsewhere in the world.  Each of this book's six sections, arranged chronologically, opens with a world map that shows developments at various points of the compass, along with an essay about what was happening and why.  Cross-cultural time lines run through the book like a thick thread, tying all of history together. Thus, as one reads a section on Charlemagne, for example, the time line shows selected events happening in Nubia, in India, in China, and in Cyprus.  The text by author Noel Grove, a staff writer for 25 years with the National Geographic magazine, continues with a world-wide perspective usually ignored in works of history: \"By A.D. 100, when the Roman Empire was in full swing, some Maya cities were already in decline.\"  Events are examined for their local as well as global impact: \"Great empires butted heads and power changed hands, but these episodes fed a...kinship with a wider community.\"  Here, then, as Daniel J. Boorstin says in his foreword, \"...is an invitation to discover both the mystery and the miracle of human experience on our planet,\" as Grove shapes complex history into an understandable tale with a storyteller's eye for little-known details: \"Russia's...Peter the Great died at the age of 53 after diving into the Neva River in winter to rescue drowning sailors.\" And \"Vikings were not just ruthless killers; they traded as often as they raided, and their wives knew rights that other medieval women could scarcely imagine.\"  Artwork, maps, and photographs complement the text to tell the story of human history in a single volume.  The challenge to understanding history lies in the tendency to focus on single scenes instead of the big picture, akin to looking at a tapes-try by examining individual stitches instead of the entire design. The Atlas of World History undertakes a fair-minded journey through the human story by mingling close-up looks at events with broader views of what was then happening elsewhere in the world.  Each of this book's six sections, arranged chronologically, opens with a world map that shows developments at various points of the compass, along with an essay about what was happening and why.  Cross-cultural time lines run through the book like a thick thread, tying all of history together. Thus, as one reads a section on Charlemagne, for example, the time line shows selected events happening in Nubia, in India, in China, and in Cyprus.  The text by author Noel Grove, a staff writer for 25 years with the National Geographic magazine, continues with a world-wide perspective usually ignored in works of history: \"By A.D. 100, when the Roman Empire was in full swing, some Maya cities were already in decline.\"  Events are examined for their local as well as global impact: \"Great empires butted heads and power changed hands, but these episodes fed a...kinship with a wider community.\"  Here, then, as Daniel J. Boorstin says in his foreword, \"...is an invitation to discover both the mystery and the miracle of human experience on our planet,\" as Grove shapes complex history into an understandable tale with a storyteller's eye for little-known details: \"Russia's...Peter the Great died at the age of 53 after diving into the Neva River in winter to rescue drowning sailors.\" And \"Vikings were not just ruthless killers; they traded as often as they raided, and their wives knew rights that other medieval women could scarcely imagine.\"  Artwork, maps, and photographs complement the text to tell the story of human history in a single volume.",
        "Category": " History , Reference",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "7.0",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Complete Book of Main Courses",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "500 Terrific Ideas for Cleaning Everything",
        "Authors": "By Aslett, Don",
        "Description": "A cleaning professional offers upbeat, expert advice on tidying up absolutely everything and making the work easy, efficient, and more enjoyable. From clearing the clutter to shining the furniture, these 500 tips cover the job, whether it involves light dusting or a major spring cleanup. Dust, mop, sweep, and vacuum with skill-and style. Remove stains from carpets and clothing. Successfully tackle hard to reach spots, such as oven lights and narrow-neck bottles, so they're sparkling. Find out what the experts already know about eliminating the dirt without inflicting damage on precious items, and what supplies they use for long-term care. Every short paragraph includes a minute-sized idea for each particular task. It's an essential reference for every household.",
        "Category": " House & Home , Cleaning & Caretaking",
        "Publisher": "Galahad Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Magic of the Medals: Discover the Winning Spirit Within",
        "Authors": "By Fellwock, Kim D.",
        "Description": "",
        "Category": "",
        "Publisher": "Eggman Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "A Fine Madness",
        "Authors": "By Elliott Baker",
        "Description": "",
        "Category": "",
        "Publisher": "Putnam",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Community Suppers and Other Glorious Repasts",
        "Authors": "By Voltz, Jeanne",
        "Description": "Explains how to plan a community supper, and shares large serving recipes for soups, meat, poultry, fish, seafood, vegetables, salads, rice, pasta, breads, cookies, desserts, and punches",
        "Category": " Cooking , General",
        "Publisher": "Scribner Paper Fiction",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Lighthearted Gourmet",
        "Authors": "By Sharon O'Connor",
        "Description": "",
        "Category": "",
        "Publisher": "Menus Music",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Merry Mixes: Fun Food Fixin's for Great Gift-Giving (Gooseberry Patch Book #26) (The Country Friends Collection)",
        "Authors": "By Gooseberry Patch",
        "Description": "Our best-seller! These mixes are easy to make and fun to give...delight everyone on your list.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Gooseberry Patch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Magnolia Collection",
        "Authors": "By Westbrook, Gene",
        "Description": "",
        "Category": "",
        "Publisher": "G Westbrook Pubns",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Gifts in a Jar: For Kids",
        "Authors": "By Cq Products",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "G & R Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Joy of Cooking: All About Chicken",
        "Authors": "By Rombauer, Irma von Starkloff, Becker, Marion Rombauer, Becker, Ethan, and Beisch, Leigh (PHT)",
        "Description": "The book that taught America how to cook, now illustrated with glorious color photography  ALL ABOUT CHICKEN  A fresh and original way to put the classic advice of Joy of Cooking to work -- illustrated and designed in a beautiful and easy-to-use new book.  Organized by techinique -- roasting, broiling, baking, braising, grilling, frying, and more More than 100 of Joy's recipes, including the legendary Chicken Fricassee, Chicken Cordon Bleu, and Turned Roasted Chicken Invaluable techniques and tips for buying, storing, preparing, and carving chicken  Sixty years after Irma Rombauer advised new cooks to \"Stand facing the stove,\" America's love affair with Joy of Cooking continues unabated. And why not? Joy in hand, tens of millions of people -- from novices to professionals -- have learned to do everything from make a meat loaf to clean a squid to frost a wedding cake. For decades, Joy of Cooking has taught America how to cook, serving as the standard against which all other cookbooks are judged.  All About Chicken upholds that standard. In the conversational and instructional manner of the flagship book, All About Chicken is organized by technique. Chapters that cover roasting, broiling, baking, sautéing and stir-frying, braising, frying, and grilling chicken incorporate more than 100 of Joy's best-loved recipes -- Casserole Roasted Chicken with Forty Cloves of Garlic to Broiled Lemon Garlic Chicken to Chicken Breasts Baked on Mushroom Caps. You'll also find recipes for a dozen or more stuffings, sauces, marinades, and gravies, as well as techniques for carving, preparing, buying, and storing chicken. Add to that more than 150 original photographs, specially commissioned for this volume, presented in the most easy-to-use design imaginable.  Whether you belong to one of the millions of American households that already own a copy (or two) of Joy, or you have never cracked the spine of a cookbook before, Joy of Cooking: All About Chicken is for you. It is a spectacular achievement, worthy of its name. Joy has never been more beautiful.  The Indispensable Kitchen Resource... All-New, All-Purpose, and now All-in-Color",
        "Category": " Cooking , Specific Ingredients , Poultry",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Omaha Steaks: Let's Grill",
        "Authors": "By Harrisson, John and Simon, Frederick J.",
        "Description": "One of the nation's most popular mail-order companies shares sixty recipes--for fish meat, poultry, vegetables, soups, desserts, and more--for backyard grilling and includes practical tips on smoking, marinating, selecting various types of grills, and building and maintaining a fire. 40,000 first printing.",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The Military History of World War II, Vol. 13: The Air War in the Pacific: Air Power Leads the Way",
        "Authors": "By Dupuy",
        "Description": "",
        "Category": "",
        "Publisher": "Franklin Watts",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "PARTICULAR PLEASURES: BEING A PERSONAL RECORD OF SOME VARIED ARTS AND MANY DIFFERENT ARTISTS",
        "Authors": "By Priestley, J. B.",
        "Description": "",
        "Category": "",
        "Publisher": "Stein and Day c1975",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Chindi",
        "Authors": "By McDevitt, Jack",
        "Description": "On a routine survey mission studying a neutron star, an Academy starship receives a transmission in an unknown language. Before leaving the area, the starship launches a series of satellites to find the signal - and perhaps discover its origins.Five years later, a satellite finally encounters the signal - which is believed to be of extraterrestrial origin by the Contact Society, a wealthy group of enthusiasts who fund research into the existence of alien life. Providing a starship for the academy to be piloted by Captain Priscilla \"Hutch\" Hutchins, the Contact Society embarks on a mission to find the source of the transmission. Across a myriad of stars, from world to world, Hutch and her crew follow the signal, but find only puzzles and lethal surprises.Then, in a planetary system far beyond the bounds of previous exploration, they discover an object. It is immense, ominous and mysterious. And it may hold the answer not only to the questions of the Contact Society, but to those of every person who has ever looked to the sky and wondered if we were alone.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Ace Hardcover",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Distributed Computing and Client-Server",
        "Authors": "By Umar, Amjad",
        "Description": "This book explores both the technical and management aspects of distributed computing focusing on interrelationships, interfaces, and integration.  Comprehensive in scope, this practical reference covers the spectrum of topics integral to the development and management of distributed computing, including: the underlying technologies in distributed computing and the approaches used to develop/acquire, utilize, support, and manage these technologies...Ethernet, TCP/IP, SNA, LU6.2, FTP, NPS, Sockets, X25, and CSMA/CD...the role of open systems today and in the future, and the advantages and disadvantages of distributed computing over conventional centralized computing environments.  A must have reference for any practitioner or manager involved with information technology (IT).",
        "Category": " Computers , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Man in Prehistory",
        "Authors": "By Chard, Chester S.",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw Hill Book co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Jews in their land, (A Windfall book)",
        "Authors": "By Ben-Gurion, David (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.65",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "New York Public Library Writer's Guide to Style and Usage",
        "Authors": "By Sutcliffe, Andrea (EDT)",
        "Description": "A worthy challenger to  The Chicago Manual of Style , comprehensive in scope, yet addressing a somewhat wider audience than its competitors everyone who writes, rather than the narrow group of academic editors and writers. The presentation is clear, friendly, and up-to-date. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Collins",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Baby-Gami: Baby Wrapping for Beginners",
        "Authors": "By Sarvady, Andrea, Milne, Bill (PHT), Drillings, Fern (FRW), and Stislow, John (ILT)",
        "Description": "Origami meets the age-old art of swaddling in Baby-Gami and no longer does baby wrapping have to be an intimidating undertaking. Easy-to-follow instructions illustrated with step-by-step diagrams and unbearably cute photographs make it a cinch to execute flawless wraps. The first part of the book offers a variety of cocoon-like styles for newborns; the second shows parents how to create slings for \"wearing\" older babies. Once new parents master the basic swaddles and slings, they can branch out into more pizazzy terrain. Try the Picnic Wrap, the Glamour Sling, or the satin and tulle Gift Wrap. With advice from experts and real parents, tips on baby-carrying, baby-soothing, and a rundown of items not to wrap your baby in,Baby-Gami is a must-have for any new parent.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Baby Name Wizard: A Magical Method for Finding the Perfect Name for Your Baby",
        "Authors": "By Wattenberg, Laura",
        "Description": "Yes, your baby’s perfect name is out there. The trick is finding it. The perfect baby name will speak to your heart, give your child a great start in life—and maybe even satisfy your relatives.  But you can't expect to just stumble on a name like that in an A to Z dictionary or on a trendy list. That’s why you need The Baby Name Wizard. Created by a name-searching mom, it uses groundbreaking research and computer generated models to pinpoint each name’s image, examine its usage and popularity over the last 100 years, and suggest other promising ideas. A perfect guide to the modern world of names, The Baby Name Wizard will engage you from the first name you look up and keep you enchanted through your journey to the just-right name for your baby.",
        "Category": " Family & Relationships , Baby Names",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Ruthless.Com (Tom Clancy's Power Plays, Book 2)",
        "Authors": "By Clancy, Tom and Greenberg, Martin Harry",
        "Description": "Encryption technology keeps the codes for the world's security and communication systems top secret.  Deregulating this state-of-the-art technology for export could put a back-door key in the pockets of spies and terrorists around the world.    So when American businessman Roger Gordian refuses to put his sophisticated encryption program on the market, he finds his company the object of a corporate takeover--and to say it's hostile doesn't even come close. Only Gordian stands between the nation's military software and political extremists who want to put the leadership of the free world out of business--for good...",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Why We Love Cats",
        "Authors": "By Levin, Kim and O'Neill, John",
        "Description": "\"I have learned why cats are so special, that you have to earn their trust and love. I have found the beauty and character that cats possess.\" When photographer Kim Levin created the magic duet of words and images that appeared in Why We Love Dogs and Why We Really Love Dogs, thousands of animal lovers responded. Now Levin's long-anticipated version for cat lovers is finally here! Kim's gift for capturing the essence of animals is reflected in beautiful photos and playful words that show the ways we love cats: because they stop to smell the flowers, because they look like lions, because they clean themselves . . . all the time. Why We Love Cats portrays all that is enchanting, mysterious, and fun in the world of cats.",
        "Category": " Pets , Cats , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Chapters into Verse: A Selection of Poetry in English Inspired by the Bible from Genesis through Revelation",
        "Authors": "By Atwan, Robert (EDT) and Wieder, Laurance (EDT)",
        "Description": "Drawing a unique map of the history of English poetry, Chapters Into Verse surveys and defines the literary legacy of the Scriptures from the fourteenth century to the present. Arranged in scriptural order from Genesis to Revelation, the book presents each poem alongside the biblical passage that inspired it. Thus readers can conveniently witness the various ways sacred text has sparked the imagination of poets throughout the ages. The editors have included poems by virtually all the prominent religious poets--among them John Donne, George Herbert, Henry Vaughan, Edward Taylor, and Gerard Manley Hopkins. Included, too, are devotional and visionary works from a wide range of vintage poets--Robert Burns, William Blake, Walt Whitman, Emily Dickinson, Christina Rossetti, Alfred Tennyson, and Robert Browning. Proving that the Bible is just as powerful a source of inspiration today as it was in the past, the collection also assembles a mixed congregation of modern and contemporary poets, such as Dylan Thomas, Robert Frost, William Carlos Williams, Countee Cullen, e.e. cummings, William Butler Yeats, Laura (Riding) Jackson, A.D. Hope, Denise Levertov, and Philip Levine.Of enduring interest to readers of both scripture and literature, this anthology illuminates key passages of the Old and New Testament. In selection after selection, readers will encounter an astonishing variety of religious experiences, as a host of poets from many eras and many backgrounds respond to Holy Scripture profoundly and imaginatively.",
        "Category": " Poetry , Subjects & Themes , Inspirational & Religious",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "6.11",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Once upon a Castle",
        "Authors": "By Roberts, Nora, Langan, Ruth Ryan, Roberts, Nora (EDT), Gregory, Jill, and Willman, Marianne",
        "Description": "#1 New York Times bestselling author Nora Roberts presents four enchanting tales of castles, spells, and happily-ever-afters...In Nora Roberts's \"Spellbound,\" a bewitchingly beautiful lady casts a thousand-year love spell on the man of her dreams—and unleashes a nightmare that only true love can conquer.In Jill Gregory's \"Castle Doom,\" a Gypsy's prophecy spells love when an unlikely pair join to fight the ultimate evil—and find themselves in their own battle of hearts.In Ruth Ryan Langan's \"Falcon's Lair,\" a young American travels to England to free her father's friend from a fatal curse—and discovers a helping hand from a charming, handsome spirit.In Marianne Willman's \"Dragonspell,\" a brave young princess sets out to save her kingdom with the help of a meddling sorceress—and wins the heart of a dashing warrior along the way.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The complete food catalogue: Hundreds of mail-order sources from all over the world for the best of every kind of food, with recipes, cooking tips, ... yours without leaving your doorstep",
        "Authors": "By Wilson, Jose",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Sum of All Fears (Jack Ryan Novels)",
        "Authors": "By Clancy, Tom",
        "Description": "When his proposal for a ground-breaking Middle Eastern peace plan falls through, Deputy Director of the CIA Jack Ryan must stop anti-Israeli agents from acquiring an atom bomb and using it against Israel. Reprint.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Gourmet's Quick Kitchen",
        "Authors": "By Yanes, Romulo A. (PHT)",
        "Description": "Oven-Roasted Eggplant Crostini ... Chicken and Shallots with Riesling and Grapes ... Tiramisu Chocolate Wafer Cake ... Who has time to make dishes like these? With Gourmet's Quick Kitchen you will, because each delicious, satisfying recipe for two takes less than 45 minutes to prepare. Incredibly, there are over 200 quick-and-easy kitchen-tested recipes in this volume, beautifully illustrated with more than 40 full-color photographs of the outstanding dishes within.And, because Gourmet knows how important healthful eating has become, recipes for over 40 leaner and lighter dishes are included that are low in fat and calories but are just as quickly prepared.",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Keeping Faith: Memoirs of a President",
        "Authors": "By Carter, Jimmy",
        "Description": "Quotations from the former president's personal daily diaries supplement his detailed account of the events, issues, relationships, disappointments, and accomplishments of his four years in office",
        "Category": " History , United States , General",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "New Dieters Cook Book",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "Meredith Corporation",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Great Escapes of World War II",
        "Authors": "By Sullivan, George",
        "Description": "A collection of true stories of seven daring escapes by prisoners of war during World War II",
        "Category": "",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Tony Award Book",
        "Authors": "By Morrow, Lee Alan",
        "Description": "",
        "Category": "",
        "Publisher": "Abbeville Promotional",
        "Price Starting With ($)": "8.24",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Impressionists in Winter: Effets De Neige",
        "Authors": "By Fine Arts Museums of San Francisco (COR), Phillips Collection (COR), Moffett, Charles S. (EDT), and Center for the Arts at Yerba Buena Gardens (COR)",
        "Description": "Collects works by French impressionist painters to commemorate the 1998/1999 exhibition",
        "Category": " Art , Techniques , Painting",
        "Publisher": "Phillips Collections",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Painting Interiors",
        "Authors": "By Rodwell, Jenny",
        "Description": "Discusses materials and techniques useful in drawing or painting indoor scenes, with sections on light, shadows, reflections, and close-ups",
        "Category": " Art , Techniques , Painting",
        "Publisher": "Watson-Guptill",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "The Good Husband",
        "Authors": "By Godwin, Gail",
        "Description": "\"Mates are not always matches, and matches are not always mates,\" pronounces Magda Danvers, the magnificent central figure in Gail Godwin's wise and affecting new novel. With The Good Husband, one of America's most gifted novelists creates a portrait of two marriages and four unforgettable characters that travels beyond the usual questions of love and domestic comfort to explore the most profound consequences of intimate relationships. It is also, in its deepest sense, a novel about how we influence and transform - and sometimes complete - one another.As a young woman, brilliant, charismatic, and eternally curious, Marsha Danziger transformed herself into Magda Danvers, taking the academic world by storm with her controversial treatise on visionaries, The Book of Hell. She was already a star when she came upon Francis Lake in a midwestern seminary and married him, to everyone's surprise, including their own. It was a mating that seemed perfect: Magda pursued her career, and attentive, caring Francis devoted himself to Magda. Now, Magda's grave illness puts their marriage to its ultimate test.Even as she faces her \"Final Examination,\" Magda's genius does not desert her. From her bed she continues to arouse her visitors with compelling thoughts and questions, which will change the lives of some of them. Into the heady atmosphere of Magda's provocative repartee comes Alice Henry, fresh from her own family tragedy. Magda's room soon becomes a refuge for Alice from her crumbling marriage to brooding Southern novelist Hugo Henry.But is it the incandescence of Magda's ideas that draws Alice, or the secret of \"the good marriage\" that she is desperate to discover? For Alice, Hugo, Francis, and Magda will learn that the most ideal relationship - even a perfect marriage - doesn't come without a price.Gracefully written, keenly insightful, intimate in its revelations, The Good Husband reverberates with the lives of its characters, their histories, and the most urgent longings of their hearts - a triumph of the novelist's art, from the author of A Mother and Two Daughters, The Finishing School, A Southern Family, and Father Melancholy's Daughter, all of which were New York Times bestsellers.",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "I Heard the Owl Call My Name",
        "Authors": "By Margaret Craven",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Seinlanguage",
        "Authors": "By Seinfeld, Jerry",
        "Description": "Seinfeld.  For more than 33 million viewers, the Emmy Award-winning television show has become a Thursday night ritual.   Even though the show has ended,  Jerry Seinfeld's distinct brand of humor can still be yours.  In his #1 New York Times bestselling book, SeinLanguage, Jerry Seinfeld has captured on the page his views on topics ranging from Raisinettes to relationships, from childhood to cop shows, and from parents to power suits.  This must-have book for all fans—and who isn't a fan?—remains available in both paperback and hardcover.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Stencilling",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "MARSHALL CAVENDISH",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Paint Effects Master Class",
        "Authors": "By Sacha Cohen",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Flags of Our Fathers (Movie Tie-in Edition)",
        "Authors": "By Bradley, James and Powers, Ron",
        "Description": "#1 NEW YORK TIMES BESTSELLER • This is the true story behind the immortal photograph that has come to symbolize the courage and indomitable will of AmericaIn this unforgettable chronicle of perhaps the most famous moment in American military  history, James Bradley has captured the glory, the triumph, the heartbreak, and the  legacy of the six men who raised the flag at Iwo Jima. Here is the true story behind  the immortal photograph that has come to symbolize the courage and indomitable will  of America. In February 1945, American Marines plunged into the surf at Iwo Jima—and  into history. Through a hail of machine-gun and mortar fire that left the beaches  strewn with comrades, they battled to the island's highest peak. And after climbing  through a landscape of hell itself, they raised a flag. Now the son of one of the  flagraisers has written a powerful account of six very different young men who came  together in a moment that will live forever. To his family, John Bradley never spoke  of the photograph or the war. But after his death at age seventy, his family discovered  closed boxes of letters and photos. In Flags of Our Fathers, James Bradley draws  on those documents to retrace the lives of his father and the men of Easy Company.  Following these men's paths to Iwo Jima, James Bradley has written a classic story  of the heroic battle for the Pacific's most crucial island—an island riddled with  Japanese tunnels and 22,000 fanatic defenders who would fight to the last man. But  perhaps the most interesting part of the story is what happened after the victory.  The men in the photo—three were killed during the battle—were proclaimed heroes and  flown home, to become reluctant symbols. For two of them, the adulation was shattering.  Only James Bradley's father truly survived, displaying no copy of the famous photograph  in his home, telling his son only:  “The real heroes of Iwo Jima were the guys who  didn't come back. ” Few books ever have captured the complexity and furor of war  and its aftermath as well as Flags of Our Fathers. A penetrating, epic look at a  generation at war, this is history told with keen insight, enormous honesty, and  the passion of a son paying homage to his father. It is the story of the difference  between truth and myth, the meaning of being a hero, and the essence of the human  experience of war.",
        "Category": " History , Military , World War II",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Maze (An FBI Thriller)",
        "Authors": "By Coulter, Catherine",
        "Description": "In this FBI Thriller Special Agent Dillon Savich teams up with new agent Lacey Sherlock in a case that leads them back to the murder of Sherlock's sister seven years ago—and puts both their lives on the line.As the head of the FBI’s Criminal Apprehension Unit, Dillon Savich has developed predictive analogue programs to aid in the capture of serial killers. Enter Lacey Sherlock, a very well-qualified new agent who seems bright and eager and on the up-and-up. But is she really?When there’s a vicious murder in Boston, she’s off like a shot, lying to Savich. When Savich finds out what’s going on, he realizes they’ll all be in deep trouble, maybe even victims themselves, if he and Sherlock don’t find out who murdered her sister seven years before....",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Forgiving",
        "Authors": "By Spencer, LaVyrle",
        "Description": "When Sarah Merritt arrives in Dakota Territory in 1876, she steps off the dusty Cheyenne stagecoach determined to start this ramshackle gold-rush town’s first newspaper. In Deadwood, her runaway younger sister, Addie, is living and working as domestic help at Mrs. Hossiter’s boardinghouse, according to her letters. Five years after Addie’s flight from home, Sarah is carrying the sad news that their one remaining parent, newspaper publisher Isaac Merritt, has died.   But when Sarah—tall, prim, and nearly a spinster at twenty-five—sets up her father’s printing press in the middle of Main Street, she finds herself at loggerheads with Sheriff Noah Campbell. Headstrong and opinionated, with an auburn mustache and grinning gray eyes, he arrests her on the spot. And so begins an enmity between two willful individuals that can change only when they find themselves united in a common goal: to reclaim the Addie that Sarah once knew.   But life is never simple. Mrs. Hossiter is more commonly known as Rosie in this bawdy frontier town, and Addie’s work is as an “upstairs girl,” not an upstairs maid. Addie is furious when Sarah turns up at the bordello—and she tells her proper sister to get out. What could have happened to change Addie so—and what can Sarah do to regain the sweet sister of her youth and bring her home again?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Total Fitness",
        "Authors": "By Morehouse gross",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Sea of Dreams",
        "Authors": "By Delancey, Elizabeth",
        "Description": "Content with her land-based life as bookstore clerk and companion in nineteenth-century Boston, Norah Paige is uprooted when her employer takes a six-month trip abroad, boarding a ship captained by a man Norah once secretly loved. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Diamond Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "AGE OF INNOCENCE",
        "Authors": "By Wharton, Edith",
        "Description": "As Newland Archer prepares to marry docile May Welland, the return of the mysterious Countess Olenska turns his life upside down. By the author of Ethan Frome. Reprint. Movie tie-in. 350,000 first printing.",
        "Category": " Fiction , Classics",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Welcome Holy Spirit",
        "Authors": "By Williams, Garrie F.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Review & Herald Pub Assn",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Sure as the Dawn",
        "Authors": "By Mansell, Donald E., Mansell, Vesta W.",
        "Description": "",
        "Category": "",
        "Publisher": "Review and Herald Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Uncle John's Ahh-Inspiring Bathroom Reader",
        "Authors": "By Bathroom Readers' Institute",
        "Description": "Uncle John’s Ahh-Inspiring Bathroom Reader, Uncle John’s all-new 15th edition, sheds a light on everything under the sun and over the moon. From obscure history to classic wordplay to dumb crooks to inspiring quotations, you never know what you’re going to read next! Since 1987, the Bathroom Readers’ Institute has led the movement to stand up for those who sit down and read in the bathroom (and everywhere else for that matter). With more than 12 million books in print, the Uncle John’s Bathroom Reader series is the longest-running, most popular series of its kind in the world. Where else could you learn how the banana peel changed history, how to predict the future by rolling the dice, how the Jivaro tribes shrunk heads, and the science behind love at first sight? Uncle John rules the world of information and humor, so get ready to be thoroughly entertained. Read all about… * Homer the Greek versus Homer the Simpson* The history of the bicycle* When humans become hailstones* Alternate definitions for common words* Helen Keller’s wisdom* The Silly Putty saga* And much more!",
        "Category": " Reference , Trivia",
        "Publisher": "Portable Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Geography Behind History",
        "Authors": "By East, W. Gordon",
        "Description": "In studying the inescapable physical setting of history, writes the author, the geographer examines one of the strands from which history itself is woven. To illuminate the vital relationship between history and geographical conditions, W. Gordon East draws examples from ancient times to the mid–twentieth century. He demonstrates that when we look at the physical conditions under which an event occurs, we find that \"the particular characteristics of this setting serve not only to localise but also to influence part at least of the action.\" Topographical position, climate, distribution of water and minerals, the placement of routes and towns, and ease or difficulty of movement between districts and countries are among the factors which the historian must take into account.Professor East's topics include the role of geography in international politics, the contribution of the geographer to the study of ancient civilizations, and the use of old maps as historical documents.",
        "Category": " History , Historical Geography",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Prayer of Jesus: Developing Intimacy with God Through Christ's Example",
        "Authors": "By Nappa, Mike",
        "Description": "",
        "Category": " Religion , Christianity , General",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Sense and Sensibility (Bantam Classics)",
        "Authors": "By Austen, Jane",
        "Description": "In 1811, Jane Austen’s first published work, Sense and Sensibility, marked the debut of England’s premier novelist of manners. Believing that “3 or 4 families in a country village is the very thing to work on,” she created a brilliant tragicomedy of flirtation and folly. Romantic walks through lush Devonshire and genteel dinner parties at a stately manor draw two pretty sisters into the schemes and manipulations of landed gentry determined to marry wisely and well. Neither sense nor sensibility can guarantee happiness for either—as romantic Marianne falls prey to a dangerous rascal, and reasonable Elinor loses her heart to a gentleman already engaged. Wonderfully entertaining yet subtle and probing in its characterizations, Sense and Sensibility richly displays the supreme artistry of a great English novelist.",
        "Category": " Fiction , Classics",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1982"
        }
    },
    {
        "Title": "Double Homicide",
        "Authors": "By Kellerman, Jonathan and Kellerman, Faye",
        "Description": "A new series, the first to be co-written by the best-selling husband and wife, features a reversible format and includes the tales, \"In the Land of the Giants,\" in which Boston detectives MacCain and Sylvestor investigate the murder of a basketball star; and \"Still Life,\" in which the murder of a Santa Fe art gallery employee is examined by detectives Darryl Two Moons and Steve Katz. Reprint.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Twice Kissed",
        "Authors": "By Jackson, Lisa",
        "Description": "Mirror, Mirror . . . Marquise Walker has vanished without a trace. There are few clues and much speculation on her sudden disappearance. But the truth is more terrifying than anyone can even imagine. . . . On The Wall . . . Maggie McCrae would do anything to find her identical twin sister--even if it means stepping into her unfamiliar shoes. Walking through Marquise's wild, uninhibited life is a revelation for Maggie, proof that she knew very little about her twin's darker side and her connection to the only man Maggie ever loved, Thane Walker. Now he's the man she shouldn't trust, a man who could be her best hope . . . or a cold-blooded killer. . . .  Who's The Deadest Twin Of All? The deeper Maggie digs, the more she is drawn into the web of her own past. . . . to a twisted family legacy of desperate deceit, betrayal, and revenge . . . each secret bringing her closer to a final, shocking truth--and to the identity of a killer who's closer than she thinks. . . .",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Zebra Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Time and Again: An Anthology",
        "Authors": "By Roberts, Nora",
        "Description": "The New York Times best-selling author presents two classic novels of romance--Time Was and Times Change--that center around the Hornblower brothers, who must decide between returning to the future, where they belong, or staying in the past with the women they love. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Sixth Form",
        "Authors": "By Dolby, Tom",
        "Description": "When seventeen-year-old Ethan Whitley attends an elite New England prep school, he is invited into a world of privilege and desire where he surrenders his innocence and discovers the true price of betrayal and trust when he is drawn into an investigation of the death of another student.",
        "Category": " Fiction , Coming of Age",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Wrestling With Angels",
        "Authors": "By Horwitz, Joshua and Rosenblatt, Naomi H.",
        "Description": "Drawing upon insights into human nature gleaned from decades of private practice and a lifelong study of the Bible, Naomi H. Rosenblatt sifts through the Bible's epic stories, filled with vivid characters in dramatic circumstances, to show how the lessons of their lives empower us today as parents, spouses, businesspeople, citizens, and lovers.In Wrestling with Angels, she and her co-author Joshua Horwitz retell and interpret the multigenerational saga of the first family of the Bible, showing how their all-too-human struggles are decidedly relevant to the issues confronting us today.The Bible? Relevant today? Many readers will be surprised by how truly relevant the Book of Genesis is. It discusses, among other things, the first recorded case of sexual harassment; surrogate parenting and the problems it raises; siblings battling over the love of a parent; rape and its consequences; and vigilante justice. The issues faced by Adam and Eve, Abraham and Sarah, and their descendants are remarkably similar to those that arise in all of our lives.",
        "Category": " Religion , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "10.0",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Macbeth (Folger Shakespeare Library)",
        "Authors": "By Shakespeare, William, Mowat, Barbara A. (EDT), and Werstine, Paul (EDT)",
        "Description": "In 1603, James VI of Scotland ascended the English throne, becoming James I of England. London was alive with an interest in all things Scottish, and Shakespeare turned to Scottish history for material. He found a spectacle of violence and stories of traitors advised by witches and wizards, echoing James’s belief in a connection between treason and witchcraft. In depicting a man who murders to become king, Macbeth teases us with huge questions. Is Macbeth tempted by fate, or by his or his wife’s ambition? Why does their success turn to ashes? Like other plays, Macbeth speaks to each generation. Its story was once seen as that of a hero who commits an evil act and pays an enormous price. Recently, it has been applied to nations that overreach themselves and to modern alienation. The line is blurred between Macbeth’s evil and his opponents’ good, and there are new attitudes toward both witchcraft and gender. The authoritative edition of Macbeth from The Folger Shakespeare Library, the trusted and widely used Shakespeare series for students and general readers, includes:  -Freshly edited text based on the best early printed version of the play -Newly revised explanatory notes conveniently placed on pages facing the text of the play -Scene-by-scene plot summaries -A key to the play’s famous lines and phrases -An introduction to reading Shakespeare’s language -An essay by a leading Shakespeare scholar providing a modern perspective on the play -Fresh images from the Folger Shakespeare Library’s vast holdings of rare books -An up-to-date annotated guide to further reading Essay by Susan Snyder The Folger Shakespeare Library in Washington, DC, is home to the world’s largest collection of Shakespeare’s printed works, and a magnet for Shakespeare scholars from around the globe. In addition to exhibitions open to the public throughout the year, the Folger offers a full calendar of performances and programs. For more information, visit Folger.edu.",
        "Category": " Fiction , Classics",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Cliff Sheats' Lean Bodies Cookbook: A Cooking Companion to Cliff Sheats' Lean Bodies",
        "Authors": "By Sheats, Cliff and Thornbrugh, Linda M.",
        "Description": "Gathers low-fat recipes for the reducing diet that suggests eating five meals a day of leaner foods",
        "Category": " Cooking , Reference",
        "Publisher": "The Summit Publishing Group",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Say Goodbye",
        "Authors": "By Gardner, Lisa",
        "Description": "Lisa Gardner, the New York Times bestselling author of Hide and Gone, draws us into the venomous mind games of her most terrifying killer yet.Come into my parlor . . .For Kimberly Quincy, FBI Special Agent, it all starts with a pregnant hooker. The story Delilah Rose tells Kimberly about her johns is too horrifying to be true—but prostitutes are disappearing, one by one, with no explanation, and no one but Kimberly seems to care.Said the spider to the fly . . .As a member of the Evidence Response Team, dead hookers aren’t exactly Kimberly’s specialty. The young agent is five months pregnant—she has other things to worry about than an alleged lunatic who uses spiders to do his dirty work. But Kimberly’s own mother and sister were victims of a serial killer. And now, without any bodies and with precious few clues, it’s all too clear that a serial killer has found the key to the perfect murder . . . or Kimberly is chasing a crime that never happened.Kimberly’s caught in a web more lethal than any spider’s, and the more she fights for answers, the more tightly she’s trapped. What she doesn’t know is that she’s close—too close—to a psychopath who makes women’s nightmares come alive, and if he has his twisted way, it won’t be long before it’s time for Kimberly to . . .",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Italian for Dummies (With Audio CD)",
        "Authors": "By Onofri, Francesca Romana and Moller, Karen",
        "Description": "As society becomes more international in nature, knowing a few words in other languages has become more useful. Perhaps you travel frequently abroad, or your business requires you to travel overseas. Perhaps you have friends and neighbors who speak other languages, or you want to find out more about your heritage by learning a little bit of the language your ancestors spoke.Whatever your reason for wanting to learn some Italian, Italian For Dummies is the right book for you. Written in partnership with Berlitz – experts in helping people learn foreign languages – this book gives you the skills you need for basic communication in Italian, and it will get you well on your way to becoming fluent. Just think what you're family and friends will think when you order off the menu at your favorite Italian restaurant!Italian For Dummies covers not only ordering at an Italian restaurant, but also these topics:Basic spelling, grammar, and numbersMeeting and greeting, and making small talkShopping, shopping, and even more shoppingGoing out on the townBusiness situationsTraveling, checking into a hotel, and planning a tripHandling emergenciesTop Ten lists with advice on how to pick up Italian quickly, things you should never say in Italian, and favorite Italian expressionsThe best thing about this book is that you can learn at your own pace; for example, if you're planning a trip to Italy next year, sit down once or twice a week with this book and go through the chapters that you'll think you need for your trip. That's a lot easier than dragging yourself to a class twice a week – not to mention a lot more fun, too!",
        "Category": " Foreign Language Study , Italian",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Art Marketing 101: A Handbook for the Fine Artist",
        "Authors": "By Smith, Constance",
        "Description": "An accessible, practical guide providing coverage of a myriad of subjects useful to artists who would like to sell their work. Topics include business basics, number crunching, legal protection, pricing, shipping and displaying, creating and planning an exhibit, presentation finesse, marketing plans, promo pieces, and sales techniques.  Discussion also includes reps and galleries, shows and fairs, greeting cards, and the licensing industry. Checklists and recommended reading lists help readers stay on target. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Art , Reference",
        "Publisher": "Artnetwork Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Existentialism and Human Emotions",
        "Authors": "By Sartre, Jean-Paul",
        "Description": "",
        "Category": "",
        "Publisher": "Citadel Press",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Angel in the Whirlwind: The Triumph of the American Revolution",
        "Authors": "By Bobrick, Benson",
        "Description": "An epic narrative documents the fight to create the United States of America, beginning with the deterioration in relations between England and her colonists and chronicling the events of the American Revolution until the last British flag was lowered during the siege of Yorktown. Reprint.",
        "Category": " History , United States , Revolutionary Period (1775-1800)",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Difficult Conversations: How to Discuss What Matters Most",
        "Authors": "By Stone, Douglas, Patton, Bruce, Heen, Sheila, and Fisher, Roger (FRW)",
        "Description": "The authors outline a step-by-step process designed to help readers negotiate the most difficult conversations imaginable, from negotiating with a tricky client to telling someone \"I love you.\" Reprint.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Eastman's Expectant Motherhood",
        "Authors": "By Russell, Keith",
        "Description": "A practical, updated resource for pregnant women offers new, expanded sections on natural childbirth, family-centered birth methods, prenatal monitoring and testing, diet and nutrition, and exercise",
        "Category": " Medical , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1983"
        }
    },
    {
        "Title": "Genes VII",
        "Authors": "By Lewin, Benjamin",
        "Description": "Oxford University Press is proud to present GENES VII--the latest edition of Benjamin Lewin's best-selling textbook. This authoritative work provides an integrated account of the structure and function of genes and incorporates all the latest research in the field.    THE MOST SIGNIFICANT REORGANIZATION TO DATE   The power of direct analysis of the genome has made a significant difference in the approach of GENES VII. In a departure from previous editions, which started with a traditional analysis of formal genetics, the new edition begins with the molecular properties of the gene itself. The text is now reorganized to begin with the concept of genes as a segment of DNA coding for protein, and then proceeds directly to the characterization of the genome in terms of its content of genes.   INTEGRATED APPROACH   GENES VII first explains the structure and function of the gene as a means to revealing the operation of the genome as a whole, and offers an integrated approach to prokaryotes and eukaryotes. The gene is considered from all aspects, including:   * Basic forms   * The numbers and relationships among genes in a genome   * Their packaging into chromosomes   * The process of gene expression from transcription through translation   * The reproduction and safeguarding of the gene structure   * Aspects of the overall circuitry through which genotype determines phenotype   STREAMLINED, FULL-COLOR DESIGN   GENES VII has been considerably restructured and reorganized to highlight the latest research and technology. It contains more than 800 full color illustrations that are extremely useful in teaching the key concepts presented in the book.  GENES VII CONTAINS NEW, GROUNDBREAKING INFORMATION ON:  * New technologies that count and compare expressed genes   * Accessory proteins (chaperones)   * The role of the proteasome   * Licensing   * Reverse translocation   * Connections between repair and recombination systems and human diseases   * Connections between the structure of chromosomal material and control of gene expression in eukaryotes   * The process of X chromosome inactivation   * Imprinting   * Control of gene expression by epigenetic changes   * The enzymatic activities that control chromatin structure and affect the regulatory process   * Archeael enzymes   * The mechanism of RNA editing in lower eukaryotes   * The role of RAG genes   * Interactions within and between pathways   * The use of protein degradation to control passage through the cell cycle   * Programmed cell death   * Telomerase and its role in carcinogenesis. And much more!",
        "Category": " Science , Life Sciences , Genetics & Genomics",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Heart Full of Lies: A True Story of Desire and Death",
        "Authors": "By Rule, Ann",
        "Description": "In perhaps the most profound character portrait she has ever drawn, America's bestselling true-crime writer, Ann Rule, asks, Can the female really be deadlier than the male? In Heart Full of Lies, she answers that question in one of her most intriguing tales ever -- a riveting story of seduction, betrayal, and murder.  Liysa and Chris Northon seemed the epitome of idyllic lovers when they married on a moonlit beach in Hawaii. Their friends admired the romantic couple: Chris -- tall, athletic, handsome with a thatch of blond hair, a pilot for Hawaiian Airlines -- and Liysa -- attractive, charismatic, seductive, an acclaimed surf photographer, with a tanned, perfect body. Their son, Bjorn, looked just like his dad, and they were raising Liysa's son by a previous marriage. They had beautiful homes on the mainland and in Hawaii.  But it wasn't long before Chris saw a side of Liysa that he hadn't glimpsed before. Nothing was quite enough for her -- she wanted more money, more property, and a future that included fame as a Hollywood screenwriter. She complained to her closest friends that her husband was a heavy drinker who beat her. The marriage seemed to be unraveling, but Chris struggled to hold it together, afraid he'd be separated from Bjorn and from Liysa's son, Papako. And then the worst happened.  On a sunny morning in October 2000, Chris Northon lay dead in a sleeping bag at a campsite beside a pristine river, while his wife drove four hours to a friend's house, sobbing inconsolably. She appeared to have been beaten, and had a black eye and bruises on her knee. Was Chris's death a tragic accident or a deliberate homicide? Was Liysa involved? Questions arose that made Oregon State detectives suspicious, yet her family and friends stood staunchly by her, incredulous that anybody would ask such questions.  Ann Rule became involved with the mystery of Chris's death when one of his fellow pilots at Hawaiian Airlines contacted her, and only later did she learn that the ranking Oregon State Police investigator had thought of her to tell this bizarre story. A book that leads the reader from Hawaii to the Northwest to Hollywood, Heart Full of Lies is an extraordinary character study as well as a brilliant investigative report that will keep you enthralled to the very last page.",
        "Category": " True Crime , Murder , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Mapping the World",
        "Authors": "By Swift, Michael",
        "Description": "",
        "Category": " Technology & Engineering , Cartography",
        "Publisher": "Chartwell Books",
        "Price Starting With ($)": "29.55",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "My Little Bible Series: My Little Psalms",
        "Authors": "By Ward, Brenda and Britt, Stephanie McFetridge (ILT)",
        "Description": "The My Little Bible series has simple Bible stories, memory verses, prayers and psalms for young readers and attractive art.  A world-wide bestseller in several languages.",
        "Category": " Juvenile Nonfiction , Religion , Biblical Studies",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Why We Want You to Be Rich: Two Men, One Message",
        "Authors": "By Trump, Donald and Kiyosaki, Robert T.",
        "Description": "The world is facing many challenges and one of them is financial. The entitlement mentality is epidemic, creating people who expect their countries, employers, or families to take care of them. Donald Trump and Robert Kiyosaki, both successful businessmen, are natural teachers and have joined forces to address these challenges. They believe you cannot solve money problems with money. You can only solve money problems with financial education. Trump and Kiyosaki want to teach you to be rich.\"Give a man a fish, and you feed him for a day. Teach him to fish, and you feed him for a lifetime.\" They each could have written a book on the subject, but they chose instead to write a book together because of their shared passion for education and their desire to bring emphasis to the importance of financial education. In addition they have designated a portion of the profits from each book to be donated to charitable and educational organizations that also support financial education. Why We Want YOU To Be Rich, Two Men — One Message was written for you.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Rich Press",
        "Price Starting With ($)": "4.95",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Precalculus a Graphing Approach",
        "Authors": "By Larson, Ron",
        "Description": "",
        "Category": " Mathematics , Pre-Calculus",
        "Publisher": "D C Heath & Co",
        "Price Starting With ($)": "7.75",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Hope Within (Heirs of Montana #4)",
        "Authors": "By Peterson, Tracie",
        "Description": "1886 Montana stands on the brink of statehood, and Dianne Selby finds her world turned upside down. Cole takes her and the children to Kansas to care for his dying father, but after the funeral, Cole's mother insists he stay and take over his inheritance. Unable to deal with her mother-in-law's cruel treatment, Dianne takes the children back to Montana alone. There, blizzards devastate the area, trapping a now pregnant Dianne at the ranch. Through the twists and turns of life and nature, Dianne comes to realize that the hope within--Jesus Christ--is the only hope that lasts.  Book 4 of the bestselling Heirs of Montana.",
        "Category": " Fiction , Historical",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Project Management : A Systems Approach to Planning, Scheduling, & Controlling",
        "Authors": "By Kerzner, Harold",
        "Description": "The author has extensive experience as a planning executive for a leading corporation, a consultant to the international business community, an educator, and the leader of a popular series of project management seminars. Project Management, Fifth Edition, synthesizes this wealth of knowledge into a practical resource you will rely on every day - learn from the successes and failures of leading companies in planning and scheduling complex projects, explore new cost control and risk management techniques, assess the impact of concurrent engineering, merge total quality management techniques with effective project planning, master the resolution of conflicts in project planning and execution, and gain skill at predicting project success at early stages of evolution.The design of the Fifth Edition has been considerably enhanced to make this a usable desktop companion for the working professional and educator, and a focused self-study and review guide for project managers who plan to take the certification exam. Worksheets, checklists, and chapter summaries are highlighted so that essential points are visible at a glance.",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold",
        "Price Starting With ($)": "8.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Accidental Buddhist: Mindfulness, Enlightenment, and Sitting Still, American Style",
        "Authors": "By Moore, Dinty W.",
        "Description": "The Accidental Buddhist is the funny, provocative story of how Dinty Moore went looking for the faith he'd lost in what might seem the most unlikely of places: the ancient Eastern tradition of Buddhism. Moore demystifies and explains the contradictions and concepts of this most mystic-seeming of religious traditions. This plain-spoken, insightful look at the dharma in America will fascinate anyone curious about the wisdom of other cultures and other religions.  Cutting through religious jargon and abstract concepts, Moore explains in clear terms why Buddhism is becoming part of popular culture. He has the rare ability to be at once sincere about religion and good-humored about the human condition. The Accidental Buddhist never takes itself too seriously—which, as Moore discovers, Buddhists aren’t supposed to do, even when they are mindful, enlightened, and sitting perfectly still.  “Moore’s hilarious and sometimes irreverent look at Buddhism is a perfect primer for the budding Buddhist.”—Publishers Weekly “[Moore’s] witty and candid ‘regular guy’ approach to these experiences is entertaining and comforting, and his conclusions are right on target.”—Booklist",
        "Category": " Religion , Buddhism , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "P.S. I Love You",
        "Authors": "By Bullas, Will",
        "Description": "",
        "Category": " Art , Individual Artists , General",
        "Publisher": "Greenwich Workshop Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Essential Goldfish (Howell Book House's Essential)",
        "Authors": "By Howell Book House (COR), Norman, Aaron (EDT), and Hargrove, Maddy (EDT)",
        "Description": "Owning a goldfish is rewarding and fun! Get all you need to know about feeding, housing and caring for your fish's health in The Essential Goldfish. Special features include professional color photos and expert tips on how to make your fish a wonderful addition to the family. Learn how to have a great relationship with your pet with The Essential Goldfish.",
        "Category": " Pets , Fish & Aquariums",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Oscar and Lucinda",
        "Authors": "By Carey, Peter",
        "Description": "The Booker Prize-winning novel--now a major motion picture from Fox Searchlight  Pictures.This sweeping, irrepressibly inventive novel, is a romance, but a romance of the sort that could only take place in  nineteenth-century Australia. For only on that sprawling continent--a haven for misfits of both the animal and human kingdoms--could a nervous Anglican minister who gambles on the instructions of the Divine become allied with a teenaged heiress who buys a glassworks to help liberate her sex. And only the prodigious imagination of Peter Carey could implicate Oscar and Lucinda in a narrative of love and commerce, religion and colonialism, that culminates in a half-mad expedition to transport a glass church across the Outback.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Baker Towers: A Novel",
        "Authors": "By Haigh, Jennifer",
        "Description": "Bakerton is a community of company houses and church festivals, of union squabbles and firemen's parades. Its neighborhoods include Little Italy, Swedetown, and Polish Hill. For its tight-knit citizens -- and the five children of the Novak family -- the 1940s will be a decade of excitement, tragedy, and stunning change. Baker Towers is a family saga and a love story, a hymn to a time and place long gone, to America's industrial past, and to the men and women we now call the Greatest Generation. It is a feat of imagination from an extraordinary voice in American fiction, a writer of enormous power and skill.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "A Very Merry Christmas (Twins' Bad Boys)",
        "Authors": "By Maynard, Janice, Foster, Lori, and Bruce, Gemma",
        "Description": "This naughty collection of holiday romances features Lori Foster's Do You Hear What I Hear, in which Sergeant Osbourne Decker gets frisky with a gorgeous pet psychic who is accused of stealing a donkey from the local nativity scene, as well as Bah Humbug, Baby by Gemma Bruce and Janice Maynard's By Firelight. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Governance in a Globalizing World",
        "Authors": "By Donahue, John D. (EDT) and Nye, Joseph S. (EDT)",
        "Description": "A Brookings Institution Press and Visions of Governance for the 21st Century publicationFar from being another short-lived buzzword, \"globalization\" refers to real changes. These changes have profound impacts on culture, economics, security, the environment&#151;and hence on the fundamental challenges of governance. This book asks three fundamental questions: How are patterns of globalization currently evolving? How do these patterns affect governance? And how might globalism itself be governed? The first section maps the trajectory of globalization in several dimensions&#151;economic, cultural, environmental, and political. For example, Graham Allison speculates about the impact on national and international security, and William C. Clark develops and evaluates the concepts of \"environmental globalization.\" The second section examines the impact of globalization on governance within individual nations (including China, struggling countries in the developing world, and the industrialized democracies) and includes Elaine Kamarck's assessment of global trends in public-sector reform. The third section discusses efforts to improvise new approaches to governance, including the role of non-governmental institutions, the global dimensions of information policy, and Dani Rodrik's speculation on global economic governance.",
        "Category": " Political Science , International Relations , Diplomacy",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Beyond Discipline: From Compliance to Community",
        "Authors": "By Kohn, Alfie",
        "Description": "Contrasts the idea of discipline, in which things are done to students to control their behavior, with an approach that features teachers working with students to make decisions together within the framework of a caring community.",
        "Category": " Education , Classroom Management",
        "Publisher": "Assn for Supervision & Curriculum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Wee Sing Fun 'n' Folk book",
        "Authors": "By Beall, Pamela Conn",
        "Description": "Gathers words and music for traditional songs, including Polly wolly doodle, The Wabash Cannonball, The old gray mare, Old Dan Tucker, and Turkey in the straw.",
        "Category": " Juvenile Nonfiction , Music , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Ideas on wings: A collection of poems from the Christian Science periodicals",
        "Authors": "By Lindsey, Carol Chapin (Ed.)",
        "Description": "",
        "Category": "",
        "Publisher": "Christian Science Pub Society",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Better Than A Lemonade Stand: Small Business Ideas For Kids (Kid's Books by Kids)",
        "Authors": "By Bernstein, Daryl and Husberg, Rob (ILT)",
        "Description": "Suggests a variety of small business ideas, including being a birthday party planner, dog walker, and photographer",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "Aladdin/Beyond Words",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Bore No More! 2",
        "Authors": "By Nappa, Mike (EDT)",
        "Description": "",
        "Category": " Religion , Sermons , General",
        "Publisher": "Group Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "How Come? Planet Earth",
        "Authors": "By Solomon, Debra (ILT) and Wollard, Kathy",
        "Description": "Kids never stop asking questions. And Kathy Wollard, whose Los Angeles Times syndicated column \"How come?\" appears in newspapers around the world, never stops answering them. In five years since the first How Come? was published, Ms. Wollard has written hundreds of columns addressing the whys, whats, wheres, and hows sent in by her readers. A direct follow-up to the original How Come?, How Come? Planet Earth is packed with lively, engagingly written, and often wittily illustrated answers to questions that kids have about the natural world around them. There are questions about animals - Why are electric eels electrical? (the charges not only help them find their way around in the dark, but act as a defense system). About human body - Where does the fat go when you lose weight? (it's burned up inside the muscles for energy). About Earth science - Why are storm clouds gray? (they contain a lot of water, which absorbs more sunlight than an ordinary cloud does, so storm clouds appear ominously dark). And just about everyday stuff - How do they make chewing gum? Why are diamonds the hardest material on Earth? Why do dogs bark? For all kids who want to know (and all kids want to know), and for the parents who can't always explain it to them (no parents know every answer), How Come? Planet Earth is the perfect reference and companion.",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Utz: A Novel",
        "Authors": "By Chatwin, Bruce",
        "Description": "Art collector Kaspar Utz takes refuge from the Gestapo horrors of World War II Prague, finding in his Meissen porcelains an exquisite reality and a counterfoil to his part-Jewish heritage",
        "Category": " Fiction , Historical",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "17.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Leadership and Self Deception: Getting Out of the Box",
        "Authors": "By Arbinger Institute (EDT)",
        "Description": "Since its original publication in 2000, Leadership and Self-Deception has become a word-of-mouth phenomenon. Its sales continue to increase year after year, and the book’s popularity has gone global, with editions now available in over twenty languages.  Through a story everyone can relate to about a man facing challenges on the job and in his family, the authors expose the fascinating ways that we can blind ourselves to our true motivations and unwittingly sabotage the effectiveness of our own efforts to achieve success and increase happiness.  This new edition has been revised throughout to make the story even more compelling. And drawing on the extensive correspondence the authors have received over the years, they have added a section that outlines the many ways that readers have been using Leadership and Self-Deception to improve their lives and workplaces—areas such as team building, conflict resolution, and personal growth and development, to name a few. Read this extraordinary book and discover what millions already have learned—how to consistently tap into an innate ability that dramatically improves both your results and your relationships.",
        "Category": " Business & Economics , Organizational Behavior",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Sharpe's Triumph: Richard Sharpe and the Battle of Assaye, September 1803 (Richard Sharpe's Adventure Series #2)",
        "Authors": "By Cornwell, Bernard",
        "Description": "From New York Times bestselling author Bernard Cornwell, the second installment in the world-renowned Sharpe series, chronicling the rise of Richard Sharpe, a Private in His Majesty’s Army at the siege of Seringapatam.\"The greatest writer of historical adventures today.\" —Washington PostRichard Sharpe. Soldier, hero, rogue—the man you always want on your side. Born in poverty, he joined the army to escape jail and climbed the ranks by sheer brutal courage. He knows no other family than the regiment of the 95th Rifles, whose green jacket he proudly wears.",
        "Category": " Fiction , War & Military",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2012"
        }
    },
    {
        "Title": "Summer of Light: A Novel",
        "Authors": "By Cramer, W. Dale",
        "Description": "From the Christy Award-winning Author of Levi's Will\"You never know what the day will bring...\"Mick Brannigan, a construction worker, loses a good-paying job because of some freak accident, sort of his fault but not his fault. Adding insult to injury, he finds himself playing nursemaid to his three kids.\"Mick's whole life felt like an accident...\"Even more flustered is his wife, Layne, now forced to get a job to keep a paycheck coming in. Mick isn't the stay-at-home-dad type, she's sure. He's a good dad--when she is there to supervise it all…the unrelenting daily stuff. Keeping the house clean, food in the fridge. Attacking the ever-mounting laundry. Supervising their five acres of land and the menagerie of animals....\"It wasn't his idea to stay home with the kids...\"A lot is on the line, and just how the Brannigan family will survive--that is, without anyone getting seriously hurt or killed, the kids not ending up psychologically and emotionally damaged, the laundry not undoing their marriage--all remains to be seen....Packed with humor, true-to-life characters, and themes to enlighten the soul, Summer of Light is altogether poignant, witty, entertaining, and delightfully down-to-earth.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Getting Personal (Red Dress Ink)",
        "Authors": "By Manby, Chris",
        "Description": "Three friends--Ruby, Louisa, and Martin--decide to take control of each other's love lives by placing personal ads, sorting replies, and planning dates, a clever scheme that results in hilarious encounters and causes them to discover what they really want in life. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Red Dress Ink",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Discipline: The Brazelton Way (A Merloyd Lawrence Book)",
        "Authors": "By Brazelton, T. Berry and Sparrow, Joshua D., M.D.",
        "Description": "Sleepless nights, wailing babies, and defiant toddlers-these are universal issues for new parents. Now beloved pediatrician T. Berry Brazelton and his esteemed colleague the child psychiatrist Joshua Sparrow come to the rescue with these highly effective and affordable guides. Full of empathy, warmth, and wisdom, each book in the Brazelton Way series leads parents step-by-step through these trying struggles. Courtesy of Dr. Brazelton's unparalleled under-standing and experience, parents will emerge from the turmoil relieved, empowered, and full of new pleasure in the strength and progress of their individual child.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "HP Way, The",
        "Authors": "By Packard, David, Kirby, David (EDT), and Lewis, Karen R. (EDT)",
        "Description": "From a one-car-garage company to a multibillion-dollar industry, the rise of Hewlett-Packard is an extraordinary tale of vision, innovation and hard work. Conceived in 1939, Hewlett-Packard earned success not only as a result of its engineering know-how and cutting-edge product ideas, but also because of the unique management style it developed -- a way of doing things called \"the HP way\".   Decades before today's creative management trends, Hewlett-Packard invented such strategies as \"walk-around management\", \"flextime\", and \"quality cycles\". Always sensitive to the needs of its customers and responsive to employee input, Hewlett-Packard earned massive steady growth that far outshone its competitors' vacillating fortunes, even with radically different products from those responsible for its initial boom.   For entrepreneurs and managers alike, the wisdom found in these pages is invaluable if they want their businesses to gain steady growth and consistent success. Transcending the ever-shifting marketplace and management trends, The HP Way offers the hard-won and battle-tested practical experience of a proven and respected leader.",
        "Category": " Business & Economics , Industries , General",
        "Publisher": "HarperPb",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Ultimate Book of Kid Concoctions: More Than 65 Wacky, Wild & Crazy Concoctions",
        "Authors": "By Thomas, John E., Thomas, Danita, and Pagel, Danita",
        "Description": "Includes instructions for creating such objects as sidewalk chalk, finger paint, and scratch-and-sniff stickers, using items found around the home like corn syrup, cornstarch, food coloring, and gelatin",
        "Category": " Juvenile Nonfiction , Art , Sculpture",
        "Publisher": "Kid Concoction Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Babycakes: A Novel (Tales of the City, 4)",
        "Authors": "By Maupin, Armistead",
        "Description": "The fourth novel in the beloved Tales of the City series, Armistead Maupin’s best-selling San Francisco saga, soon to return to television as a Netflix original series once again starring Laura Linney and Olympia Dukakis.When an ordinary househusband and his ambitious wife decide to start a family, they discover there’s more to making a baby than meets the eye. Help arrives in the form of a grieving gay neighbor, a visiting monarch, and the dashing young lieutenant who defects from her yacht. Bittersweet and profoundly affecting, Babycakes was the first piece of fiction to acknowledge the arrival of AIDS.",
        "Category": " Fiction , LGBT , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Bible As History",
        "Authors": "By Keller, Werner",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes Noble",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Group processes;: An introduction to group dynamics",
        "Authors": "By Luft, Joseph",
        "Description": "",
        "Category": "",
        "Publisher": "National Press Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    }
]