[
    {
        "Title": "Five Important Things: A Motivational Novel for Every Individual, Family or Team Pursuing a Dream",
        "Authors": "By Paluch, Jim",
        "Description": "",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Kendall Hunt Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Complete Guide to America's National Parks: The Official Visitor's Guide to All 375 National Parks (Serial)",
        "Authors": "By Fodor's Travel Publications, Inc. (NA)",
        "Description": "The Only Guide to All 376 National Park Areas\"Very useful for anyone contemplating a visit to the national parks.\" -- The NY Times\"One of the best travel resources published -- and a bargain, too.\" -- The Fresno Bee\"A wealth of useful information...and proceeds from its sale benefit the park system.\" -- Atlant. Journal-ConstitutionThe Official Visitor's Guide to Our National ParklandsNo other guide covers every one of the 376 sites under National Park Service jurisdiction. Use it as a quick reference or to help you plan a park trip of a lifetime. Now completely revised and updated, it gives you the latest information on every area. Inside -- Parks of All TypesNature parks in the mountains, on the plains, and by the seaScenic and historic trailsWild and scenic riversBattlefieldsHistoric sitesSpecial parks for special interestsComplete, Up-to-Date Information on Each ParkWhat to see and doWhere to camp and stayAll about permits and feesWhere to find food and suppliesWhen to goHow to get thereTerrific Maps22 pages of easy-to-use regional maps locating every park",
        "Category": " Travel , Parks & Campgrounds",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "How to Start and Operate Your Own Bed-and-Breakfast",
        "Authors": "By Murphy, Martha Watson and Seton, Amelia Rockwell (ILT)",
        "Description": "Down to earth advice from an award-winning B&B owner. Illustrated with charming line drawings and lightened by real-life anecdotes, this is an easily accessible guide to an ever growing small-business niche.",
        "Category": " Business & Economics , Industries , Hospitality, Travel & Tourism",
        "Publisher": "Holt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Look Gorgeous Always (52 Brilliant Ideas): Find It, Fake It, Flaunt It",
        "Authors": "By Bird, Linda",
        "Description": "Looking beautiful comes naturally...to about one person in a thousand. The rest of us have to work at it. Look Gorgeous Always shows women how to uncover their most intoxicating, sensual, radiant selves by revealing how to walk the walk, flatter their figures, build confidence, and take good care of their bodies and souls. Among the 52 Brilliant Ideas:  - Idea #4: Lose pounds without trying - Idea #6: Look great in photos - Idea #10: Purify your mind - Idea #12: Luscious lips - Idea #22: Breathe for beauty - Idea #26: Lighten up - Idea #39: Playing with color",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Do I Look Fat in This?: Get Over Your Body and On With Your Life",
        "Authors": "By Britten, Rhonda",
        "Description": "The author of Change Your Life in 30 Days and Fearless Living confronts that nagging question from the inside out.  As a Life Coach on the Emmy Award-winning daytime reality show Starting Over, Rhonda Britten has helped countless women befriend their bodies-first by encouraging them to face and accept what they see in the mirror, and then by empowering them to make healthier decisions about their weight.  In Do I Look Fat in This?, Rhonda shares her personal story of body confidence and the stories of many of the women who have reached out to her. With Rhonda's encouragement and advice, people can find the courage and inspiration they need to move from disliking their bodies to celebrating them, from seeing them as objects of shame to considering them their own best friends.",
        "Category": " Psychology , General",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "For Pete's Sake (The Piper Cove Chronicles #2)",
        "Authors": "By Windsor, Linda",
        "Description": "Ellen isn't sure true love exists. That is until she landscapes the estate of the widower next door, Adrian Sinclair. Adrian has it all—at least on the surface. A successful businessman, he's engaged to a beautiful woman and he'll soon have a stepmom for his troubled son, Pete. Yet from the moment Ellen rescues a stranded Adrian on her Harley, his well-ordered world turns upside down. With his business under investigation for espionage and his son pushing for the tomboy next door as his new mom, Adrian's facade of happiness shatters. As Ellen and Pete bond, she realizes that Adrian is about to marry the wrong woman. Despite her resolve to remain “neighbors only,” Ellen is drawn to Adrian. But how can she be the one when he's engaged to a sophisticated beauty who is everything Ellen isn't? As Ellen's three best friends step in to help her navigate this uncharted territory, Ellen must ask herself whether she's ready to risk the heart that she's always held close. Will Ellen trust that God brought this family into her life for a reason? Or will fear cause her to turn away from God's plan and her one true chance at love?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Just Call Me Mike: A Journey to Actor and Activist",
        "Authors": "By Farrell, Mike",
        "Description": "From its opening pages, Mike Farrell’s new memoir reveals the distinctive voice of a man for whom life is an ongoing odyssey of self-discovery, personal commitment, and uncompromising social engagement.With deep insight and disarming candor, Farrell describes his early years as a timid but restless teenager in West Hollywood, delivering groceries to the homes of Jack Benny, Lucille Ball, Jimmy Stewart, and countless other celebrities, while dreaming of having his own career as an actor. In stark but riveting language, he relates his formative years as a Marine recruit, confused, conflicted, and eager to prove himself as a man.Farrell humorously portrays his professional development from a young soap opera player on Days of Our Lives to the amiable star of two popular television series, M*A*S*H and Providence, to the respected producer of successful motion pictures like Dominick and Eugene and Patch Adams.  At the heart of his story, Farrell narrates his public struggle to be a responsible citizen of the world. From his firsthand accounts of the ravages of war and oppression in Cambodia, El Salvador, Somalia, Bosnia, Rwanda, and the Gaza Strip, to his tireless advocacy against capital punishment, to his deep commitment to environmental causes, Farrell portrays each of these experiences with passion, outrage, and stubborn optimism.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Akashic Books",
        "Price Starting With ($)": "7.95",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Uncook Book: Raw Food Adventures to a New Health High",
        "Authors": "By Baker, Elizabeth",
        "Description": "Explains the advantages of eating raw food and offers recipes for combining fresh vegetables and fruits, grains, nuts, milk, honey, and other natural foods in dishes that need not be cooked",
        "Category": "",
        "Publisher": "Drelwood Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "Atlas of World History - Borders",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Philips",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1925"
        }
    },
    {
        "Title": "Chambermaid: A Novel",
        "Authors": "By Rao, Saira",
        "Description": "The devil holds a gavel in this wickedly entertaining debut novel about a young attorney’s eventful year clerking for a federal judge. Sheila Raj is a recent graduate of a top-ten law school with dreams of working for the ACLU, but law school did not prepare her for the power-hungry sociopath, Judge Helga Friedman, who greets her on her first day. While her beleaguered colleagues begin quitting their jobs, Sheila is assigned to a high-profile death penalty case and suddenly realizes that she has to survive the year as Friedman’s chambermaid — not just her sanity, but actual lives hang in the balance. With Chambermaid, debut novelist Saira Rao breaks the code of silence surrounding the clerkship and boldly takes us into the mysterious world of the third branch of US government, where the leaders are not elected and can never be fired. With its biting wit and laugh-out-loud humor, this novel will change everything you think you know about how great lawyers, and great judges, are made.",
        "Category": " Fiction , Literary",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Cuts Fitness for Men: The Ultimate 30-Minute Workout",
        "Authors": "By Oz, Mehmet, M.D. (FRW), Murphy, Myatt (CON), Gennaro, John, and Haase, Steven L. (CON)",
        "Description": "Harness the power of the only 30-minute workout designed specifically for men-from the fastest-growing fitness franchise in the world.  Men of all ages, shapes, and fitness levels are discovering the power of taking control of their body and their health, with the help of the Cuts Fitness for Men workout program. Designed by veteran fitness professional John Gennaro, it addresses specific health and fitness goals with a program that delivers fast and lasting results. This information-packed guide delivers the proven Body Cuts(tm) workout-a 30-minute, full body circuit training workout designed to firm up muscles, increase energy and endurance, and lose body fat and inches. Complete with health, eating, and lifestyle advice and illustrated with more than 100 photographs, this is the ultimate guide for getting and staying in shape-as well as improving health, increasing energy, and enjoying the powerful feeling of taking control of one's body and one's life.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Your Visit to Versailles",
        "Authors": "By Simone and Saule, Beatrix Hoog",
        "Description": "",
        "Category": "",
        "Publisher": "ART LYS",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Fall of Saigon: Scenes from the Sudden End of a Long War",
        "Authors": "By Butler, David",
        "Description": "A noted journalist draws on his firsthand impressions and experiences to interweave the lives of thirty men and women, both American and Vietnamese, who became caught up in the climactic fall of Saigon in April 1975",
        "Category": " History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "In Retrospect: The Tragedy and Lessons of Vietnam",
        "Authors": "By McNamara, Robert S. and Vandemark, Brian",
        "Description": "Robert S. McNamara, the brilliant secretary of defense for Presidents Kennedy and Johnson, helped lead America into Vietnam. McNamara believed that the fight against communism in Asia was worth the sacrifice of American lives, and yet he eventually came to believe that the war was, in fact, unwinnable. Outnumbered by those who wanted to continue fighting, he left the Johnson administration and his involvement in Vietnam behind. He refused any public comment on the war, and for almost three decades he has kept that silence - until now.Drawing on his personal experience and a wealth of documentation - much of it only recently declassified and some presented here for the first time ever - McNamara has crafted the classic insider account of Vietnam policy making. He reveals exactly how we stumbled into the war, and exactly why it quickly became so difficult to pull out. We meet John F. Kennedy, and McNamara discloses what he believes Kennedy would have done in Vietnam had he lived. We get to know Lyndon B. Johnson, and see exactly how the war tore him apart and damaged his entire presidency. We sit in on secret meetings, we read private cables, and we hear the voices and arguments of the men who battled over America's Vietnam policy. McNamara takes us into the Oval Office for late-night discussions with the president, into the halls of the Pentagon as military strategy is argued, and into the chambers of Congress as policy is debated. He also reveals his own inner torment as the war effort becomes increasingly frustrating, and then utterly disastrous. The result is a book that is not only history of the highest order, but a revealing portrait of the trials of leadership.",
        "Category": " History , Military , Vietnam War",
        "Publisher": "Crown",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Best of Mr. Food, Vol. 2",
        "Authors": "By Ginsburg, Art and Oxmoor House (EDT)",
        "Description": "The host of the Mr. Food Show shares a second collection of  tips and secrets from his kitchen, including a rich variety of easy-to-prepare, budget-minded recipes that can be easily replicated by even novice cooks.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Chix Can Fix: 100 Home-Improvement Projects and True Tales from the Diva of Do-It-Yourself",
        "Authors": "By Vally, Norma",
        "Description": "The Discovery Channel's Tool-Belt Diva urges women everywhere to drop the honey-do list and \"Honey, do it yourself!\"  With more than 250,000 women enrolled in Home Depot's Do-It-Herself workshops in the last two years, women are definitely taking the lead in America's home improvement game. Now that women are making more of the home improvement decisions than ever before, it's only natural that they would look to one of the most recognized home improvement experts on television- Norma Vally, the Tool-Belt Diva. But Chix Can Fix offers much more than just construction tips; it inspires women to take on home repairs-from wiring a light fixture to repairing drywall to fixing that leaky faucet for good-with confidence and gusto.  A comprehensive resource to common home repairs-including plumbing, electricity, walls, floors, doors, and windows-Chix Can Fix offers easy-to-follow instructions and more than two hundred illustrations for those who are new to plunging a toilet, as well as more intricate tasks for the seasoned DIYer, like installing a ceiling fan. Complete with safety tips, dos and don'ts, expert advice, quick shortcuts, and Vally's own lively commentary, Chix Can Fix is the must-have guide for the wannabe handywoman.",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Studio",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Short-Term Play Therapy for Children",
        "Authors": "By Schaefer, Charles E. (EDT) and Kaduson, Heidi Gerard (EDT)",
        "Description": "Play therapy can be enormously beneficial to children facing a wide range of psychological problems and stressful life situations. This practical volume presents a variety of play approaches that facilitate children's healing in a shorter time frame. Ideal for practitioners working within managed care, the book describes effective short-term methods for working with individual children, families, and groups. Chapters feature session-by-session guidelines and lively clinical illustrations that bring diverse techniques and theoretical orientations to life. Strategies are provided for addressing such difficulties as fears and phobias, grief, behavior problems, ADHD, and the effects of sexual abuse. Also covered are short-term interventions for teen parents and their children, children in divorced or adoptive families, and those whose families are affected by chronic illness.",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Don't Know Much About George Washington",
        "Authors": "By Davis, Kenneth C. and Shepperson, Rob (ILT)",
        "Description": "•Where did George go to college? (see page 20)•Why didn't he sign the Declaration of Independence? (see page 60)•Did everyone vote for him to be president of the United States? (see page 92)Best-selling author Kenneth C. Davis lays aside popular myth to unveil the true character of an avid farmer -- and our nation's first president. He weaves a smooth, flowing narrative into the trademark question-and-answer format of his popular Don't Know Much About® series, peppering this outstanding biography with informational sidebars and compelling quotes. Washington's life illuminates a glorious era in American history. Maps, reproductions from the period, and clever black-and-white illustrations by Rob Shepperson help re-create the flavor of these exciting times.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "HarperTrophy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Soldier's Heart: Reading Literature Through Peace and War at West Point",
        "Authors": "By Samet, Elizabeth D.",
        "Description": "Elizabeth D. Samet and her students learned to romanticize the army “from the stories of their fathers and from the movies.” For Samet, it was the old World War II movies she used to watch on TV, while her students grew up onBraveheart and Saving Private Ryan. Unlike their teacher, however, these students, cadets at the United States Military Academy at West Point, have decided to turn make-believe into real life. West Point is a world away from Yale, where Samet attended graduate school and where nothing sufficiently prepared her for teaching literature to young men and women who were training to fight a war. Intimate and poignant,Soldier’s Heart chronicles the various tensions inherent in that life as well as the ways in which war has transformed Samet’s relationship to literature. Fighting in Iraq, Samet’s former students share what books and movies mean to them—the poetry of Wallace Stevens, the fiction of Virginia Woolf and J. M. Coetzee, the epics of Homer, or the films of James Cagney. Their letters in turn prompt Samet to wonder exactly what she owes to cadets in the classroom. Samet arrived at West Point before September 11, 2001, and has seen the academy change dramatically. InSoldier’s Heart, she reads this transformation through her own experiences and those of her students. Forcefully examining what it means to be a civilian teaching literature at a military academy, Samet also considers the role of women in the army, the dangerous tides of religious and political zeal roiling the country, the uses of the call to patriotism, and the cult of sacrifice she believes is currently paralyzing national debate. Ultimately, Samet offers an honest and original reflection on the relationship between art and life.",
        "Category": " Language Arts & Disciplines , Study & Teaching",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Few and Chosen: Defining Yankee Greatness Across the Eras",
        "Authors": "By Pepe, Phil and Ford, Whitey",
        "Description": "Whitey Ford, a Hall of Fame pitcher with the Yankees for 16 seasons, gives unique insight and takes on the challenge of selecting the five best players at each position in the franchise's history, which includes 26 World Series championships and 36 American League pennants—a legacy no other team comes close to achieving. Featured players include Joe DiMaggio, Phil Rizzuto, Yogi Berra, Mickey Mantle, Johnny Mize, and Enos Slaughter.",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "Triumph Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "My Freshman Year: What a Professor Learn By Becoming a Student",
        "Authors": "By Nathan, Rebekah",
        "Description": "After more than fifteen years of teaching, Rebekah Nathan, a professor of anthropology at a large state university, realized that she no longer understood the behavior and attitudes of her students. Fewer and fewer participated in class discussion, tackled the assigned reading, or came to discuss problems during office hours. And she realized from conversations with her colleagues that they, too, were perplexed: Why were students today so different and so hard to teach? Were they, in fact, more likely to cheat, ruder, and less motivated? Did they care at all about their education, besides their grades?Nathan decided to put her wealth of experience in overseas ethnographic fieldwork to use closer to home and apply to her own university. Accepted on the strength of her high school transcript, she took a sabbatical and enrolled as a freshman for the academic year. She immersed herself in student life, moving into the dorms and taking on a full course load. She ate in the student cafeteria, joined student clubs, and played regular pick-up games of volleyball and tag football (sports at which the athletic fifty-something-year-old could hold her own). Nathan had resolved that, if asked, she would not lie about her identity; she found that her classmates, if they were curious about why she was attending college at her age, never questioned her about her personal life.Based on her interviews and conversations with fellow classmates, her interactions with professors and with other university employees and offices, and her careful day-to-day observations, My Freshman Year provides a compelling account of college life that should be read by students, parents, professors, university administrators, and anyone else concerned about the state of higher education in America today. Placing her own experiences and those of her classmates into a broader context drawn from national surveys of college life, Nathan finds that today's students face new challenges to which academic institutions have not adapted. At the end of her freshman year, she has an affection and respect for students as a whole that she had previously reserved only for certain individuals. Being a student, she discovers, is hard work. But she also identifies fundamental misperceptions, misunderstandings, and mistakes on both sides of the educational divide that negatively affect the college experience.By focusing on the actual experiences of students, My Freshman Year offers a refreshing alternative to the frequently divisive debates surrounding the political, economic, and cultural significance of higher education—as well as a novel perspective from which to look at the achievements and difficulties confronting America's colleges and universities in the twenty-first century.",
        "Category": " Education , Student Life & Student Affairs",
        "Publisher": "Cornell University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Be the Ball: A Golf Instruction Book for the Mind",
        "Authors": "By Charlie Jones",
        "Description": "",
        "Category": "",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Ten Boys Who Changed the World (Lightkeepers)",
        "Authors": "By Howat, Irene",
        "Description": "George Muller was a thief when he was younger and spent time in jail for his crimes. Brother Andrew grew up in Holland during the second World War and played tricks on German soldiers. Nicky Cruz grew up in a family where spirit worship was a regular occurrence. He became a very angry young man, out to cause trouble.John Newton was captured at a young age and forced to join Her Majesty's Navy, leaving his friends and family behind. What happened to these young boys and how did God make them into men who changed their world? Read how George Muller was finally trusted with millions of pounds. Discover how Brother Andrew grew up to be a smuggler of Bibles. Read how Nicky Cruz was rescued from self-destruction and eventually went on to begin one of the largest youth organisations reaching out to hurt and confused young people throughout the world.David Livingstone (Missionary in Africa)Nicky Cruz (Evangelist)Brother Andrew (Smuggler for God in Communist Countries)George Muller (Founder of Children's Homes)William Carey (Missionary in India)John Newton (Minister and reformer)Adoniram Judson (Missionary in Burma)Billy Graham (Evangelist)Luis Palau (Evangelist)Eric Liddell (Athlete and Missionary in China)",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "CF4Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Beyond Vietnam: The United States and Asia",
        "Authors": "By Reischauer, Edwin O.",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Killer Heat",
        "Authors": "By Fairstein, Linda A.",
        "Description": "It’s August in New York, and the only thing that’s hotter than the pavement is Manhattan D.A. Alex Cooper’s professional and personal life. Just as she’s claiming an especially gratifying victory in a rape case, she gets the call: the body of a young woman has been found in an abandoned building.  The brutality of the murder is disturbing enough, but when a second body, beaten and disposed of in exactly same manner, is found off the Belt Parkway, the city’s top brass want the killer found fast, before the tabloids can start churning out ghoulish serial killer headlines.Between dodging the bullets of the gang members who are infuriated by Alex’s most recent courtroom victory and keeping a rendezvous with a charming restaurateur, a serial killer on the loose is the last thing she needs on her plate right now. Then a third victim is found, and it becomes clear to Alex and her team that time is not on their side.Through Alex’s peerless interrogation skills—and one big break—the search becomes focused on someone who has a twisted obsession with the military, and things grow increasingly dangerous when the chase leads to a chain of small, abandoned islands around New York harbor.Once again Linda Fairstein brilliantly orchestrates a page-turning mix of cutting-edge legal issues and forensics, New York City history, and spine-tingling suspense. And at the center of it all is Alex Cooper—stunning, single-minded, accomplished, and not to be trifled with whether she’s in or out of a courtroom.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Ezekiel Option (Political Thrillers Option #3)",
        "Authors": "By Rosenberg, Joel C.",
        "Description": "New York Times best-selling author Joel Rosenberg brings readers this thrilling new novel. When Russia's richest oil baron is killed, Moscow suddenly teeters on the verge of political chaos. Tehran races to complete its nuclear arsenal. Washington finds herself dangerously divided from her European allies. And in the dead of night, in the hills overlooking Jerusalem, a senior White House advisor uncovers a chilling ancient conspiracy as real as the morning's headlines. Woven through the writings of the Hebrew prophet Ezekiel, more than 2,500 years old, are eerily prescient descriptions of modern countries then unborn, modern alliances then unformed, and an imminent day of unspeakable terror. Now, with the clock ticking down to war, two Americans are caught in the crossfire, wondering, Is the last judgment at hand?",
        "Category": " Fiction , Christian , Suspense",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Open Marriage: A New Lifestyle for Couples",
        "Authors": "By O'Neill, Nena",
        "Description": "",
        "Category": " Social Science , Sociology , Marriage & Family",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1973"
        }
    },
    {
        "Title": "Leopard and Fat-Tailed Geckos (Reptile and Amphibian Keeper's Guide)",
        "Authors": "By Bartlett, Patricia and Bartlett, Richard D.",
        "Description": "Reptiles are among the more exotic pets - and owning them can be a very fascinating and rewarding experience. Each book in the Reptile and Amphibian Keeper's Guides provides basic information on reptiles and specific instructions on care. Each book begins with a description of the subject animal's natural history, distribution, life expectancy, and notable characterieistics. The information that follows focuses on selecting a good specimen, determining the sex, providing proper caging, nutritious feeding, health care, and steps owners need to take if they plan to breed.",
        "Category": " Pets , Reptiles, Amphibians & Terrariums",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "The Magic of Honey",
        "Authors": "By Perlman, Dorothy",
        "Description": "",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The New Face of Baseball: The One-Hundred-Year Rise and Triumph of Latinos in America's Favorite Sport",
        "Authors": "By Wendel, Tim, Bostas, Bob (FRW), and Baldizon, Victor (PHT)",
        "Description": "For decades, Americans have been fascinated by the complexity and rich history of baseball. No other sport has captivated so many fans. The New Face of Baseball explores a different chapter in baseball's chronicles, one often ignored but remarkably influential. Into the tapestry of baseball history, Tim Wendel weaves the stories of its Latino athletes -- who they are and how they helped transform the sport into what it is today.Going as far back as the mid-nineteenth century, to the early days of Cuban baseball, Wendel traces the spread of American baseball fever in the Caribbean and Mexico, and discusses lesser-known historical standouts, including Adolfo Luque, the first Hispanic to play in the World Series (in 1923), and Martin Dihigo, a black Cuban whom many baseball insiders consider the greatest ballplayer of all time.Wendel masterfully describes the days when only light-skinned Latinos were allowed to participate in Major League competition, much like their inspirational African American counterparts, and the linguistic barrier Latinos were confronted with when playing on teams with \"English-only\" rules inside their dugouts.Featuring material on Roberto Clemente, Fernando Valenzuela, and Sammy Sosa, as well as interviews with Latino superstars past and present -- such as Alex Rodriguez, Ivan Rodriguez, Mariano Rivera, Alfonso Soriano, and the Hernandez brothers -- The New Face of Baseball helps fans of America's favorite pastime to understand the history of those who bring hope and honor every season to the teams they have given their lives to, and the Hispanic culture that, if allowed, can lie hidden and unnoticed under a team jersey.With a foreword by Bob Costas, the first-ever-published Latino All-Century Team featuring players selected by Omar Minaya, and photos taken by award-winning Sports Illustrated photographer Victor Baldizon, this important book is sure to make as much of a splash a the Latino players themselves -- the new faces of baseball.",
        "Category": " Social Science , Ethnic Studies , General",
        "Publisher": "Rayo",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Heat: My Life on and Off the Diamond",
        "Authors": "By Gooden, Dwight and Klapisch, Bob",
        "Description": "Dwight Gooden's early years with the New York Mets were golden -- he was the youngest winner of the Cy Young Award in baseball history and led the New York Mets to one of the most dramatic World Series victories in 1986.  Dwight Gooden -- a.k.a. Doc or simply Dr. K -- had a fastball that hitters just could not beat.  But Gooden's fall was as quick and dramatic as his rise.  By 1994 he had twice been suspended from the league for drug abuse, plunging him into a vicious cycle that threatened his career and, ultimately, his life.Today, Dwight Gooden is back in the big leagues.  Heat captures Gooden's poignant road to recovery, and how it culminated in his second World Series ring with the New York Yankees in 1996, and offers a behind-the-scenes look at the Yankees club.  During his fourteen years in the big leagues, Dwight Gooden has seen plenty.  Heat brings to life the glorious world championship baseball through the eyes of one of its most popular and talented stars.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "My Generations, a Course in Jewish Family History",
        "Authors": "By Kurzwell, Arthur",
        "Description": "",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Behrman House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Gianna: Aborted...and Lived to Tell About It (Living Books)",
        "Authors": "By Shaver, Jessica",
        "Description": "At the tender age of 17, Tina was frightened and pregnant. Feeling abandoned and desperate, she stepped into the clinic to have an abortion. But in the midst of it, something unexpected happened . . . something wonderful. Instead of snuffing out the growing life within, the procedure failed. And with defiance and courage, a baby girl made her way into the world.Gianna is the incredible true story of one girl's remarkable journey from abortion survivor to steadfast defender and lover of life. This book isn't about issues —it's about a young woman's determination to make the most of her God-given opportunities.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Tyndale House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Kathy Kaehler's Celebrity Workouts: How to Get a Hollywood Body in Just 30 Minutes a Day",
        "Authors": "By Kaehler, Kathy",
        "Description": "A-list personal trainer Kathy Kaehler reveals the body-sculpting secrets of the stars in a breakthrough fitness regimen guaranteed to deliver your best body yet.Ever wonder how Hollywood’s hottest names manage to achieve their knock-out bodies? It’s not money, and it’s not just great genes—it’s having access to truly stellar fitness expertise. Top personal trainer Kathy Kaehler has trained dozens of today’s most glamorous, shapely celebrities, including Julia Roberts, Jennifer Aniston, Cindy Crawford, and Sarah Jessica Parker. Now, for the first time, she reveals her workout secrets—the same body-sculpting and fat-busting strategies she uses to prepare Hollywood’s leading ladies for photo shoots, action movies, red carpet moments, and more.Kathy knows that to keep her clients happy, she needs to provide a workout with enough variety to help them stick with it day after day—and most importantly, one that gets maximum results. Celebrity Workouts presents seven action-packed routines that draw on cutting-edge fitness practices and target different parts of the body, each based on Kathy’s work with a different client, and geared toward giving you the physique of your favorite stars. You’ll find:The Early Morning Start-up Workout with Michelle Pfeiffer: a simple, energizing workout, perfect for new exercisers or for those looking to jump-start their day.The Supermodel Lower–Body Conditioner with Claudia Schiffer: sculpts from head to toe using Pilates and other hot fitness techniques.Rachel’s Super-Sexy Upper Body–Workout with Jennifer Aniston: delivers great shoulders and arms, perfect for tank tops and strapless dresses.The Pretty Woman Leg Workout with Julia Roberts: focuses on thighs and calves for sexy, slender legs.The Charlie’s Angels Boot Camp Workout with Drew Barrymore: a full-body workout using kick-boxing moves that emphasizes strength and stamina.The Amazing Abs Workout with Cindy Crawford: builds core strength and an amazing waistline—even after pregnancy.Plus: The Hidden Hills Workout, inspired by Kathy’s weekly class at Hollywood’s most exclusive country club.Inside you’ll also find slimming, delicious recipes from chefs that cater to the Hollywood elite—including Wolfgang Puck, Jamie Oliver, and personal chefs who specialize in keeping their high-profile clients fit and trim—along with realistic nutrition advice to help jumpstart your metabolism and melt away extra pounds. With entertaining behind-the-scenes anecdotes, and in-the-gym photographs of her biggest clients, Kathy Kaehler’s Celebrity Workouts is the ultimate guide to having fun while getting fit—and achieving superstar results.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Harmony",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "The Motorcycle Diaries: Notes on a Latin American Journey",
        "Authors": "By Guevara, Ernesto",
        "Description": "The book of the popular movie STARRING GAEL GARCIA BERNAL NOW A NEW YORK TIMES BESTSELLER   The young Che Guevara’s lively and highly entertaining travel diary.This new, expanded edition features exclusive, unpublished photos taken by the 23-year-old Ernesto on his journey across a continent, and a tender preface by Aleida Guevara, offering an insightful perspective on the man and the icon.  “As his journey progresses, Guevara’s voice seems to deepen, to darken, colored by what he witnesses in his travels. He is still poetic, but now he comments on what he sees, though still poetically, with a new awareness of the social and political ramifications of what’s going on around him.”—January Magazine   “A journey, a number of journeys. Ernesto Guevara in search of adventure, Ernesto Guevara in search of America, Ernesto Guevara in search of Che. On this journey of journeys, solitude found solidarity, ‘I’ turned into ‘we’.” —Eduardo Galeano   “When I read these notes for the first time, I was quite young myself and I immediately identified with this man who narrated his adventures in such a spontaneous manner… To tell you the truth, the more I read, the more I was in love with the boy my father had been…” —Aleida Guevara   “Our film is about a young man, Che, falling in love with a continent and finding his place in it.” —Walter Salles, director of “The Motorcycle Diaries.”   Also available in Spanish: DIARIOS DE MOTOCICLETA (978-1-920888-11-4)   Features of this edition include:  A preface by Che Guevara’s daughter Aleida Introduction by Cintio Vintier, well-known Latin American poet Photos & maps from the original journey Postcript: Che’s personal reflections on his formative years: “A child of my environment.”    Published in association with the Che Guevara Studies Center, Havana",
        "Category": " Philosophy , Political",
        "Publisher": "Ocean Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Significance of the Frontier in American History",
        "Authors": "By Turner, Frederick J.",
        "Description": "",
        "Category": " Law , Intellectual Property , General",
        "Publisher": "Ungar Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1963"
        }
    },
    {
        "Title": "The Teller of Tales: In Search of Robert Louis Stevenson (Literary Roads)",
        "Authors": "By Davies, Hunter",
        "Description": "",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Interlink Publishing Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Vitale: Just Your Average Bald, One-Eyed Basketball Wacko Who Beat the Ziggy and Became a PTP'er",
        "Authors": "By Vitale, Dick",
        "Description": "Profiles the meteoric career of Dick Vitale, who rose from high school coach to NBA coach in seven years and who has now found new life as a cable network broadcaster",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Crazy Love: Overwhelmed by a Relentless God",
        "Authors": "By Chan, Francis and Yankoski, Danae",
        "Description": "God is love.  Crazy, relentless, all-powerful love.  Have you ever wondered if we're missing it?It's crazy, if you think about it. The God of the universe—the Creator of nitrogen and pine needles, galaxies and E-minor—loves us with a radical, unconditional, self-sacrificing love. And what is our typical response? We go to church, sing songs, and try not to cuss.Whether you've verbalized it yet or not, we all know something's wrong.Does something deep inside your heart long to break free from the status quo? Are you hungry for an authentic faith that addresses the problems of our world with tangible, even radical, solutions? God is calling you to a passionate love relationship with Himself. Because the answer to religious complacency isn't working harder at a list of do's and don'ts-it's falling in love with God. And once you encounter His love, as Francis describes it, you will never be the same. Because when you're wildly in love with someone, it changes everything.Learn more about Crazy Love at www.crazylovebook.com. Check out Francis Chan's video blog at francischanblog.blogspot.com.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "David C Cook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Funny Little Monkey",
        "Authors": "By Auseon, Andrew",
        "Description": "Arty may be shorter than your average teen, but that doesn't mean his problems are small. If anything, they're huge. Whether he is dodging the fists of his hulking twin older brother, dealing with the other misfits in his school, helping track down the stolen school mascot, or falling in love for the first time, Arty lives his life looking up--and giving readers an unusual perspective on becoming a man. A hilarious, surprisingly moving novel from a huge talent, Funny Little Monkey heralds the arrival of a bold new comedic voice.",
        "Category": " Young Adult Fiction , Family , Siblings",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Fight of Your Life: Why Your Teen Is at Risk and What Only You Can Do About It",
        "Authors": "By Dean, Jeffrey",
        "Description": "Christian parents today feel replaced as the primary influence in their teen’s lives--undermined at school, invaded by the web, and in the dark about what’s really going on. Truth is, says teen expert Jeffrey Dean, parents don’t know the half of it! In The Fight of Your Life, Dean offers a frank, solutions-oriented plan for parents who want to protect their teens from dangerous choices and guide them toward God’s best–and are ready to fight to make it happen. First Dean gives parents a shocking but invaluable inside view of what teens are up against. Then he helps parents discover their irreplaceable role in their kids’ success. Along the way he tackles hot button issues--sex, partying, porn, cheating and eating disorders--and coaches parents on how to protect and grow a healthy relationship with their teens.Packed with hope and solid Bible teaching, The Fight of Your Life gives parents the tools they need to help their teens discover their exciting futures as passionate Christ followers and positive, world-changing adults.",
        "Category": " Religion , Christian Living , Family & Relationships",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Christianity In Crisis: 21st Century",
        "Authors": "By Hanegraaff, Hank",
        "Description": "Nearly two decades ago Hank Hanegraaff’s award-winning Christianity in Crisis alerted the world to the dangers of a cultic movement within Christianity that threatened to undermine the very foundation of biblical faith. But in the 21st century, there are new dangers—new teachers who threaten to do more damage than the last.These are not obscure teachers that Hanegraaff unmasks. We know their names. We have seen their faces, sat in their churches, and heard them shamelessly preach and promote the false pretexts of a give-to-get gospel. They are virtual rock stars who command the attention of presidential candidates and media moguls. Through make-believe miracles, urban legends, counterfeit Christs, and twisted theological reasoning, they peddle an occult brand of metaphysics that continues to shipwreck the faith of millions around the globe:“God cannot do anything in this earthly realm unless we give Him permission.”“Keep saying it—‘I have equality with God’—talk yourself into it.”“Being poor is a sin.”“The Jews were not rejecting Jesus as Messiah; it was Jesus who was refusing to be the Messiah to the Jews!”“You create your own world the same way God creates His. He speaks, and things happen; you speak, and they happen.”Christianity in Crisis: 21st Century exposes darkness to light, pointing us back to a Christianity centered in Christ.From the Preface:“Having lost the ability to think biblically, postmodern Christians are being transformed from cultural change agents and initiators into cultural conformists and imitators. Pop culture beckons, and postmodern Christians have taken the bait. As a result, the biblical model of faith has given way to an increasingly bizarre array of fads and formulas.”",
        "Category": " Religion , Christian Theology , Apologetics",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Girl Soldier: A Story of Hope for Northern Uganda's Children",
        "Authors": "By Mcdonnell, Faith J. H. and Akallo, Grace",
        "Description": "For several decades a brutal army of rebels has been raiding villages in northern Uganda, kidnapping children and turning them into soldiers or wives of commanders. More than 30,000 children have been abducted over the last twenty years and forced to commit unspeakable crimes. Grace Akallo was one of these. Her story, which is the story of many Ugandan children, recounts her terrifying experience. This unforgettable book--with historical background and insights from Faith McDonnell, one of the clearest voices in the church today calling for freedom and justice--will inspire readers around the world to take notice, pray, and work to end this tragedy.",
        "Category": " Religion , Christianity , History",
        "Publisher": "Chosen Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "A Saint on Death Row: The Story of Dominique Green",
        "Authors": "By Cahill, Thomas",
        "Description": "On October 26, 2004, Dominique Green, thirty, was executed by lethal injection in Huntsville, Texas. Arrested at the age of eighteen in the fatal shooting of a man during a robbery outside a Houston convenience store, Green may have taken part in the robbery but always insisted that he did not pull the trigger. The jury, which had no African Americans on it, sentenced him to death. Despite obvious errors in the legal procedures and the protests of the victim’s family, he spent the last twelve years of his life on Death Row. When Cahill found himself in Texas in December 2003, he visited Dominique at the request of Judge Sheila Murphy, who was working on the appeal of the case. In Dominique, he encountered a level of goodness, peace, and enlightenment that few human beings ever attain. Cahill joined the fierce fight for Dominique’s life, even enlisting Dominique’s hero, Archbishop Desmond Tutu, to make an historic visit to Dominique and to plead publicly for mercy. Cahill was so profoundly moved by Dominique’s extraordinary life that he was compelled to tell the tragic story of his unjust death at the hands of the state.A Saint on Death Row will introduce you to a young man whose history, innate goodness, and final days you will never forget. It also shines a necessary light on America’s racist and deeply flawed legal system. A Saint on Death Row is an absorbing, sobering, and deeply spiritual story that illuminates the moral imperatives too often ignored in the headlong quest for justice.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Tribal Church: Ministering to the Missing Generation",
        "Authors": "By Merritt, Carol Howard and Jinkins, Michael (FRW)",
        "Description": "Carol Howard Merritt, a pastor in her mid-thirties, suggests a different way for churches to be able to approach young adults on their own terms. Outlining the financial, social, and familial situations that affect many young adults today, she describes how churches can provide a safe, supportive place for young adults to nurture relationships and foster spiritual growth. There are few places left in society that allow for real intergenerational connections to be made, yet these connections are vital for any church that seeks to reflect the fullness of the body of Christ. Carol Howard Merritt, a pastor in her mid-thirties, suggests a different way for churches to be able to approach young adults on their own terms. Outlining the financial, social, and familial situations that affect many young adults today, she describes how churches can provide a safe, supportive place for young adults to nurture relationships and foster spiritual growth. There are few places left in society that allow for real intergenerational connections to be made, yet these connections are vital for any church that seeks to reflect the fullness of the body of Christ. Using the metaphor of a tribe to describe the close bonds that form when people of all ages decide to walk together on their spiritual journeys, Merritt casts a vision of the church that embraces the gifts of all members while reaching out to those who might otherwise feel unwelcome or unneeded. Mainline churches have much to offer young adults, as well as much to learn from them. By breaking down artificial age barriers and building up intentional relationships, congregations can provide a space for all people to connect with God, each other, and the world.",
        "Category": " Religion , Christian Ministry , General",
        "Publisher": "Rowman & Littlefield Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Fairyville (Berkley Sensation)",
        "Authors": "By Holly, Emma",
        "Description": "Zoe Clare is a medium who has no trouble communicating with the dead-or with real live fairies, for that matter! But she can't seem to get her feelings across to her landlord-slash-manager- Magnus Monroe, Fairyville, Arizona's most eligible bachelor. She's tired of his erotic antics with every woman in town but her. So when her high school flame returns to town, Zoe is more than a little vulnerable to his charms. How Alex broke herheart is a scandal no one in Fairyville has forgotten. But even if Zoe isn't ready to forget, she's willing to forgive. The rules they're about to break will bring out the jealousy in Magnus-and the astounding truth.",
        "Category": " Fiction , Romance , Paranormal",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Invitation: Billy Graham and The Lives God Touched",
        "Authors": "By Tchividjian, Basyle and Tchividjian, Aram",
        "Description": "Billy Graham... A crusade... A stadium poised for a spiritual change… A person in need…Now for the first time, through pictures and stories of ordinary people who heard the invitation and responded, we glimpse the breathtaking panorama of a seventy-year work of God on a scale no one could have imagined.Here is the inspiring spiritual journey of hearts and souls encountering God through the ministry of Billy Graham. From despair to hope, from broken life to renewed spirit,Invitation tells each individual story within the visual context of the Crusade experience.This new book of images and stories brings together never-before published stories of real people who responded to God’s invitation and as a result found their lives transformed and utterly turned around.Created by Billy Graham’s grandsons, Basyle (“Boz”) and Aram Tchividjian, Invitationdraws from www.thankyoubilly.com, a website designed to capture for all time the human impact of Graham’s crusades. Here, the stories poured in, from young and old, near and far–those who once were lonely, addicted, abandoned, sick, suicidal–all sharing how one invitation changed everything.Designed around photographs, many never before seen, from the private Graham family collections and the archives of the Billy Graham Evangelistic Association,Invitation has a place in every home, and is itself an invitation to all of us to experience the spiritual legacy of Billy Graham and the work of God in changing lives.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Thumpin' It: The Use and Abuse of the Bible in Today's Presidential Politics",
        "Authors": "By Berlinerblau, Jacques",
        "Description": "",
        "Category": " Religion , Biblical Studies , History & Culture",
        "Publisher": "Westminster John Knox Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "The S Factor: Strip Workouts for Every Woman",
        "Authors": "By Kelley, Sheila",
        "Description": "Hipper than Taebo, sexier than Pilates, The S Factor--stripping--is the hottest new fitness trend. Created by actress Sheila Kelley (LA Law, Sisters, and a host of film and Broadway roles), S-Factor classes are wildly popular and generating an avalanche of attention from Extra, Entertainment Tonight, The Los Angeles Times, Allure, Us magazine, Fox News, and CBS's 48 Hours, which proclaimed: \"Women don't even know they're working out until two months later when they say, 'I've never had a better body in my life. I'm strong, I'm limber, I feel great.'\" Sheila even convinced Barbara Walters to try a pole dance on The View.No wonder. Combining yoga, dance, and erotic movements, The S Factor is a program that tones muscle, firms the body, increases flexibility, promotes weight loss, and gives you a few new tricks for the bedroom. Illustrated in hundreds of photographs that show step by step how each move is done, the exercises are sensual yet demanding, requiring a balance of strength and finesse. There are slow, rounded warm-ups, the Spine Circles and Hip Circles. Strenuous motions, like the Rocking Cat-Cow. Peels and rolls, grinds, pounces, arches. And pole work, from the Firefly to Descending Angel.Something else happens, too: These exercises and routines boost self-esteem and give women a new way to think about their bodies. Stripping is a liberating act, out of which comes a new look, new body, new confidence, new you.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Inventing the Rest of Our Lives: Women in Second Adulthood",
        "Authors": "By Levine, Suzanne Braun",
        "Description": "New brain research is proving it: Women at midlife really do start to see the world differently.   Some 37 million women now entering their fifties and sixties—a unique generation—are   refashioning their lives, with dramatic results. They have fulfilled all the prescribed roles—  daughter, wife, mother, employee, but they’re not ready to retire. They want to experience   more. Suzanne Braun Levine gives us a fun, smart, and tremendously informative road   map through the challenging and uncharted territory that lies ahead.",
        "Category": " Psychology , Applied Psychology",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "How to Quit Golf: A 12-Step Program",
        "Authors": "By Brass, Craig",
        "Description": "All golfers know they don't need to play golf. The problem is they don't know how to quit. Every time a golfer thinks of quitting, the game entices him back with a 250-yard drive down the middle, an unfathomable recovery shot to the green, or a birdie on the hardest hole, as if to say, \"You're almost there, just a little more work and you'll get it. Any day now you'll have the game figured out and when you do you'll be the envy of all.\" But it's not going to happen and everyone knows it, because no one gets any better at this game.  The perfect gift for the golfer who just can't get enough, How to Quit Golf offers the guidance, counseling and tough love necessary to abstain from the most addictive, demanding and maddening game known to man. And if quitting isn't an option, Craig Brass's \"12-Step Program\" makes it clear that laughing is.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "My Usual Game: Adventures in Golf",
        "Authors": "By Owen, David",
        "Description": "My Usual Game chronicles David  Owen's funny and enlightening quest to come to  terms with a game that has frustrated and fascinated  him ever since he was a child. Follow Owen as he  rescues his swing at golf school, spends a week  with the inventor of the modern golf club, nearly  wins a three-day Pro-Am at a tournament on the PGA  Tour, travels with three golf-crazed friends to  tacky Myrtle Beach, follows Fred Couples and Paul  Azinger at the Ryder Cup, and discovers what may be  the darkest secret of the golf swing: The difference  between a slice and a draw is a certain number of  beers. My Usual  Game is a hilarious and wonderfully literate  tour through the sometimes peculiar culture of this  very popular sport. Golfers of all ages will  discover My Usual Game for many years  to come. It is destined to become a classic of  golf literature.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Main Street Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "First Freedom First: A Citizen's Guide to Protecting Religious Liberty and the Separation of Church and State",
        "Authors": "By Lynn, Barry W. and Gaddy, C. Welton",
        "Description": "The United States is the most religiously diverse nation in the world, due in large part to the clauses of the First Amendment that guarantee freedom for and from religion. But as we debate displaying Christmas trees at city hall and the Ten Commandments in the courthouse, we must ask: in what other ways is our religious liberty being compromised.In First Freedom First, with clear language and recognizable examples, two of the most trusted voices on church-state separation address head-on the many areas where religion and politics overlap, with consequences for all Americans. This book is for anyone concerned about such issues as:* Churches hosting politicians and insisting they give testaments of their faith* Science teachers questioning the theory of evolution in their public school classrooms* Public religious debates on private issues involving end-of-life decisions and reproductive choices* Federal funding for religious organizations, including those that discriminate openlyWith religion a constant presence in political discussions, First Freedom First offers practical and easy ways to remind our leaders and our community of the importance of keeping religion and politics separate, for the sake of both institutions.",
        "Category": " Political Science , General",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Lazarus and the Hurricane: The Freeing of Rubin \"Hurricane\" Carter",
        "Authors": "By Chaiton, Sam and Swinton, Terry",
        "Description": "A moving chronicle of the seven-year-battle to free boxer Rubin \"Hurricane\" Carter from wrongful imprisonment reveals the role of a group of Canadians in winning Carter's release. Original. Movie tie-in. 35,000 first printing.",
        "Category": " Sports & Recreation , Boxing",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Heaven Is Real: Lessons on Earthly Joy--What Happened After 90 Minutes in Heaven",
        "Authors": "By Murphey, Cecil and Piper, Don",
        "Description": "So how should we spend our time on Earth? Don Piper, the Minister of Hope who spent 90 minutes in Heaven, brings us God's message. Hope for the here and now from the multimillion-selling author of 90 Minutes in Heaven. Millions believe in Heaven. Don Piper's been there. He was pronounced dead after a car accident on January 18, 1989. Ninety minutes later, Piper came back to life with an extraordinary story. His 90 Minutes in Heaven has strengthened the faith of countless people. When Piper returned to this life, he had a long road back to health, dealing with painful treatments and physical disabilities-the \"new normal,\" as Piper calls it. Still, he had been transformed spiritually and this allowed him not only to cope with his suffering, but to transcend it. Piper found purpose in his pain, he found the message in the mess, and so can anyone else who embraces God's grace in the here and now-as well as the Hereafter. Don Piper did not return from Heaven alone-he brought the gift of hope back with him. Those who read Heaven Is Real can use what he learned to live the lives God has called them to live.",
        "Category": " Religion , Inspirational",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "What If? The World's Foremost Military Historians Imagine What Might Have Been",
        "Authors": "By Cowley, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "G. P. Putnam's Sons ",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Thomas Kinkade's Home for Christmas",
        "Authors": "By Brown, Jo Ann",
        "Description": "Now the major motion picture Thomas Kinkade’s Christmas Cottage Bestselling author Thomas Kinkade—the renowned “Painter of Light”™—inspired millions of people with his gorgeous paintings and heartwarming novels. Now discover how it all began in this novel based on events in his own life...With his mother suddenly in danger of losing the only home they’ve ever known, a young man must rely on the Christmas spirit of those around him. It will take an entire community coming together, and the wisdom of his aging mentor, to save their home—and teach Thomas Kinkade the meaning of love, friendship, and what it means to be an artist...",
        "Category": " Fiction , Media Tie-In",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Devil Came on Horseback: Bearing Witness to the Genocide in Darfur",
        "Authors": "By Steidle, Brian and Wallace, Gretchen Steidle",
        "Description": "Former United States Marine Brian Steidle served for six  months in Darfur as an unarmed military observer for the  African Union. There he witnessed first-hand the ongoing  genocide, and documented every day of his experience  using email, audio journals, notebook after  notebook and nearly 1,000 photographs. Gretchen  Steidle Wallace, his sister, who wrote this book with  Brian, corresponded with him throughout his time in  Darfur. Fired upon, taken hostage, a witness to villages  destroyed and people killed, frustrated by his mission's  limitations and the international community's reluctance  to intervene, Steidle resigned and has since become an  advocate for the world to step in and stop this genocide.  The Devil Came on Horseback depicts the tragic impact  of an Arab government bent on destroying its black  African citizens, the maddening complexity of international  inaction in response to blatant genocide, and the  awkward, yet heroic transformation of a formerMarine  turned humanitarian. It is a gripping and moving memoir  that bears witness to atrocities we have too long averted  our eyes from, and reveals that the actions of just one  committed person have the power to change the world.",
        "Category": " History , Africa , General",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Color Harmony 2: Guide to Creative Color Combinations (This Bk Per Pub Is Titled Palette Picker Enough Thou the Bk Says Color harmOny 2. Isbn ... Palette Picker Isbn 1564960668 Is Just book)",
        "Authors": "By Whelan, Bride M.",
        "Description": "",
        "Category": " Computers , CD-DVD Technology",
        "Publisher": "Rockport Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Jupiter Effect: The Planets As Triggers of Devastating Earthquakes",
        "Authors": "By Gribbin, John R. and Plageman, Stephen H.",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "13.46",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "The Night of the Iguana",
        "Authors": "By Williams, Tennessee",
        "Description": "",
        "Category": "",
        "Publisher": "Signet Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "The World Series: A History of Baseball's Fall Classic (Sports Illustrated)",
        "Authors": "By Fimrite, Ron",
        "Description": "Surveys the history of the baseball championships, describes the leading Series since 1905, and profiles the most important teams and individual players",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "The Vietnam War: The Story and Photographs (American War Series)",
        "Authors": "By Goldstein, Donald M., Dillon, Katherine V., and Wenger, J. Michael",
        "Description": "Goldstein (public and international affairs, U of Pittsburgh) describes the Vietnam War in terms of its historical background, the Vietnamese terrain and people, weapons and other tools of war, key battles, the history of US involvement, efforts at Vietnamization, and the fall of Saigon. The 450 plus b&w photos of events, participants, weapons, and various locales are accompanied by Goldstein's commentary. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " History , Military , Vietnam War",
        "Publisher": "Potomac Books Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Sports Illustrated Halls of Fame",
        "Authors": "By Sports Illustrated (EDT)",
        "Description": "More than two hundred photographs from some of history's finest sports photographers complement a colorful tour of twelve of North America's most important sports Halls of Fame, covering such landmarks at the National Baseball Hall of Fame and Museum in Cooperstown, New York, as well as sites honoring football, basketball, tennis, and more. 25,000 first printing.",
        "Category": " Sports & Recreation , Essays",
        "Publisher": "Sports Illustrated",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Yoga Three in One Three Complete Home Workout Programs",
        "Authors": "By Sam Grimmer",
        "Description": "",
        "Category": "",
        "Publisher": "Hinkler Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Good News, Bad News: Evangelization, Conversion and the Crisis of Faith",
        "Authors": "By Shaw, Russell and McCloskey, C. John, III",
        "Description": "",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Ignatius Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Israel/Palestine: How to End the War of 1948",
        "Authors": "By Reinhart, Tanya",
        "Description": "In Israel/Palestine, Reinhart traces the development of the Security Barrier and Israel’s new doctrine of \"disengagement,\" launched in response to a looming Palestinian-majority population. Examining the official record of recent diplomacy, including United States–brokered accords and talks at Camp David, Oslo, and Taba, Reinhart explores the fundamental power imbalances between the negotiating parties and identifies Israel’s strategy of creating facts on the ground to define and complicate the terms of any future settlement. In this indispensable primer, Reinhart’s searing insight illuminates the current conflict and suggests a path toward change.",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Wolf of Winter",
        "Authors": "By Volsky, Paula",
        "Description": "Passed over for a key position at court, bookish Prince Varis retreats to a family stronghold in the mountains, where a madman introduces him to the forbidden art of necromancy. Original.",
        "Category": " Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "10.95",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "The Faith: What Christians Believe, Why They Believe It, and Why It Matters",
        "Authors": "By Colson, Charles and Fickett, Harold",
        "Description": "Rightly understood and rightly communicated, the Christian faith is one of great joy. It is an invitation to God’s kingdom, where tears are replaced by laughter and longing hearts find their purpose and their home. This is the heart of the gospel: God’s search to reclaim us and love us as his own. But have we truly grasped this? Those of us who have disdained Christianity as a religion of bigotry—have we repudiated the genuine article or merely demonstrated our own prejudice and ignorance? Those of us who are Christians—have we deeply apprehended the mission of Jesus, and do our ways and character faithfully reflect his beauty? From the nature of God, to the human condition, to the work of Jesus, to God’s coming kingdom, and all that lies between, how well do we understand the foundational truths of Christianity and their implications? The Faith is a book for our troubled times and for decades to come, for Christians and non-Christians alike. It is the most important book Chuck Colson and Harold Fickett have ever written: a thought-provoking, soul-searching, and powerful manifesto of the great, historical central truths of Christianity that have sustained believers through the centuries. Brought to immediacy with vivid, true stories, here is what Christianity is really about and why it is a religion of hope, redemption, and beauty.",
        "Category": " Religion , Christian Theology , Ethics",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Closing Time: A Memoir",
        "Authors": "By Queenan, Joe",
        "Description": "Recounts the author's Irish-Catholic upbringing in a 1960s Philadelphia housing project, a youth marked by his alcoholic father's volatile temper, a series of mentors and surrogate fathers, and the author's struggles to forge a more promising future through his love for books and music.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Prayer (Catholic Spirituality for Adults)",
        "Authors": "By Rupp, Joyce",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Orbis Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Angel of Mercy (Mercy Hollings, Book 2)",
        "Authors": "By Andrews, Toni",
        "Description": "A beautiful hypnotherapist, armed with a dark and secret talent, finds herself on the brink of losing control when she becomes emotionally involved with an abused little girl who has been violated in the worst possible way. Original.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Sin Boldly: A Field Guide for Grace",
        "Authors": "By Falsani, Cathleen",
        "Description": "Justice is getting what you deserve. Mercy is not getting what you deserve. And grace is getting what you absolutely don't deserve.Award-winning author and columnist Cathleen Falsani says, “People regularly ask me why I believe in God. The simple answer … is grace.” In Sin Boldly: A Field Guide to Grace, Falsani explores the meaning and experience of grace through story and song, quotes and photos.Falsani says, “Grace makes no sense to our human minds. We're hardwired to seek justice, or our limited idea of what that means, and occasionally dole out mercy. Grace is another story.” Sin Boldly is an uplifting, multifaceted, and thought-provoking look at what makes grace so amazing.",
        "Category": " Religion , Christian Life , Spiritual Growth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "More Than You Know: Finding Financial Wisdom in Unconventional Places",
        "Authors": "By Mauboussin, Michael J.",
        "Description": "",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Columbia University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "AN American Gospel: On Family, History, and the Kingdom of God",
        "Authors": "By Reece, Erik",
        "Description": "Traces the author's conflicted relationship with Christianity, describing how his childhood was marked by a fire-and-brimstone, pleasure-eschewing Baptist minister grandfather and a minister father who violently committed suicide, in a personal account that also relates the author's spiritual renewal through readings of the Jefferson Bible.",
        "Category": " Religion , Faith",
        "Publisher": "Riverhead Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Light Force: A Stirring Account of the Church Caught in the Middle East Crossfire",
        "Authors": "By Janssen, Al and Andrew, Brother",
        "Description": "For years, Christians have fled from the horrific conflict in the Middle East. Today, in the land where the church began, less than two percent of the people in Israel, West Bank and Gaza are Christians. Yet that remnant holds the hope for peace-if they can only persevere in faith and not be discouraged.Light Force is the remarkable story of Brother Andrew's mission to seek out the church in the Middle East, learn about its conditions and needs, and do whatever he can to strengthen what remains. Through dramatic true stories, readers get an exclusive behind-the-scenes look at real people affected by the centuries-old conflicts in this volatile part of the world. Now available in paper, this gripping account of the church caught in the crossfire will captivate readers everywhere.",
        "Category": " Religion , Christian Ministry , Missions",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "12.43",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Standard Operating Procedure",
        "Authors": "By Gourevitch, Philip and Morris, Errol",
        "Description": "Collects the stories of the American soldiers who took and appeared in the controversial digital photographs from Abu Ghraib, in a collaborative account of Iraq's scandal-marked occupation that reveals how it is being experienced by both guards and prisoners. 100,000 first printing.",
        "Category": " Social Science , Penology",
        "Publisher": "Penguin Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Will of God: Answering the Hard Questions",
        "Authors": "By Howell, James C.",
        "Description": "How are we to know “the will of God?” In this honest discussion, veteran pastor and theologian James C. Howell considers a number of issues relating to God’s will, how it is known, how it is done, and how we respond when bad things happen and we feel God is absent or has turned away from us. In this sensitive presentation, Howell explores these questions and provides ways of recognizing the true things to which we can hold in the midst of hard times.",
        "Category": " Religion , Christian Living , Personal Growth",
        "Publisher": "Westminster John Knox Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "A Case for the Existence of God",
        "Authors": "By Overman, Dean L.",
        "Description": "A Case for the Existence of God explores fundamental questions about why our world exists and how it functions, using principles of logic, physics, and theology to show that a belief in God can explain more about our world than even the most sophisticated science. In a time when religion and science are often portrayed as diametrically opposed, Dean Overman presents a refreshing view of the interplay between science and religion and makes a compelling case for the existence of God and his role in our world.",
        "Category": " Religion , Religion & Science",
        "Publisher": "Rowman & Littlefield Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "SUPERNUTRITION",
        "Authors": "By Richard passwater",
        "Description": "",
        "Category": "",
        "Publisher": "POCKET",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1976"
        }
    },
    {
        "Title": "Essential Elements – Book 2. for Bb Trumpet",
        "Authors": "By Rhodes, Tom C. and Bierschenk, Donald",
        "Description": "",
        "Category": " Music , Instruction & Study , General",
        "Publisher": "Hal Leonard Publishing Corporation",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Constitution of the United States of America (Bicentennial Keepsake Edition)",
        "Authors": "By United States Constitution (COR), Preiss, Byron (EDT), and Osterlund, David (EDT)",
        "Description": "Presents the full text of the Constitution with commentary from leading scholars, including former Chief Justice Warren Burger, Congressional leaders Tip O'Neill and Robert Dole, and Senator Charles Mathias, leading Congressional expert on the Constitution",
        "Category": " Law , Constitutional",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "WP212 - Bastien Piano Basics - Performance Level 2",
        "Authors": "By Jane Bastien",
        "Description": "",
        "Category": "",
        "Publisher": "Kjos Music Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Touch and Feel Christmas",
        "Authors": "By Dorling Kindersley, Inc. (COR)",
        "Description": "A new addition to the Touch and Feel series includes large, simple text and colorful photographs of objects that can be seen during the Christmas holiday, with tactile pads that add an extra dimension to the reading experience.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "DK CHILDREN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The Martyred",
        "Authors": "By Kim, Richard E.",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "The Letters of Junius",
        "Authors": "By Junius (pseud. Sir Philip Francis?)",
        "Description": "",
        "Category": "",
        "Publisher": "J. F. Dove",
        "Price Starting With ($)": "6.38",
        "Publish Date": {
            "Month": "January",
            "Year": "1827"
        }
    },
    {
        "Title": "The Pilgrim Village Mystery (Boxcar Children Series, Special No. 5)",
        "Authors": "By Warner, Gertrude Chandler",
        "Description": "",
        "Category": "",
        "Publisher": "paperback",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Indians: a play",
        "Authors": "By Alan Kopit",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Young Readers Christian Library: Jesus",
        "Authors": "By Larsen, Dan",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Lilly's Purple Plastic Purse",
        "Authors": "By Henkes, Kevin",
        "Description": "Lilly loves everything about school, especially her cool teacher, Mr. Slinger. But when Lilly brings her purple plastic purse and its treasures to school and can't wait until sharing time, Mr. Slinger confiscates her prized possessions. Lilly's fury leads to revenge and then to remorse and she sets out to make amends. Lilly, the star of Chester's Way and Julius, the Baby of the World, is back. And this time she has her name in the title - something she's wanted all along. If you thought Lilly was funny before, you are in for a treat. So hurry up and start reading. Lilly can't wait for you to find out more about her.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "When the Angels Laughed",
        "Authors": "By Swieson, Eddy",
        "Description": "",
        "Category": "",
        "Publisher": "Logos International",
        "Price Starting With ($)": "7.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "A History of the Habsburg Empire, 1526-1918",
        "Authors": "By Kann, Robert A.",
        "Description": "\"An impressive achievement in a task of extraordinary difficulty...The outstanding asset of this work does not consist in in its comprehensiveness and objectivity, however, nor even in the wide knowledge and special expertise Kann can bring to bear from his early legal training, his formidable scholarship on the nationalities question, and his keen critical appreciation of the diverse cultures of the monarchy. Its greatest merit derives from the author's determination always to ask fundamental questions, his care to discriminate between surface phenomena and deeper causes, his skill in finding significant patterns in an apparently chaotic welter of events, his facility for perceptive and penetrating distinctions and generalizations. In short, he tried with considerable success to tell what really happened in history rather than simply what obviously happened.\"&#151;Canadian Historical Review",
        "Category": " History , Europe , General",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1974"
        }
    },
    {
        "Title": "Miracle on the 17th Green: A Novel",
        "Authors": "By Patterson, James and De Jonge, Peter",
        "Description": "Travis McKinley is an ordinary man living an ordinary life - he has a job that he despises, a marriage that has lost its passion, children from whom he feels disconnected, and at age fifty, a sense that he has accomplished nothing of consequence with his life. But on Christmas Day, he goes out to play a round of golf, and for the first time, he finds himself in the \"zone.\" He sees the putting line that has eluded him for years. Always a fairly good golfer, he finds himself playing like a pro and is so caught up in his excitement that he continues to play, sinking putt after putt, missing Christmas dinner with his wife and family. It is too much for his already troubled marriage.His family collapses - but Travis is soon too busy living his dream to notice. His amazing new golf skills catapult him into the PGA Senior Open at Pebble Beach, where he advances to the final round with two of his heroes, Jack Nicklaus and Raymond Floyd. And with his wife, children, and a live television audience watching, a miracle takes place on the 17th green that will change Travis, and his family, forever.",
        "Category": " Fiction , Sports",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Photographs of the Most Eminent Modern Statesmen and Politicians of the United States of America",
        "Authors": "By Seidle, Thomas C",
        "Description": "",
        "Category": "",
        "Publisher": "THOMAS C SEIDLE PUBLISHING CO",
        "Price Starting With ($)": "8.9",
        "Publish Date": {
            "Month": "January",
            "Year": "1894"
        }
    },
    {
        "Title": "On the Down Low: A Journey into the Lives of 'Straight' Black Men Who Sleep with Men",
        "Authors": "By Hunter, Karen and King, J. L.",
        "Description": "A bold exposé of the controversial secret that has potentially dire consequences in many African American communitiesDelivering the first frank and thorough investigation of life “on the down low” (the DL), J. L. King exposes a closeted culture of sex between black men who lead “straight” lives. King explores his own past as a DL man, and the path that led him to let go of the lies and bring forth a message that can promote emotional healing and open discussions about relationships, sex, sexuality, and health in the black community.Providing a long-overdue wake-up call, J. L. King bravely puts the spotlight on a topic that has until now remained dangerously taboo. Drawn from hundreds of interviews, statistics, and the author’s firsthand knowledge of DL behavior, On the Down Low reveals the warning signs African American women need to know. King also discusses the potential health consequences of having unprotected sex, as African American women represent an alarming 64 percent of new HIV infections. Volatile yet vital, On the Down Low is sure to be one of the most talked-about books of the year.",
        "Category": " Psychology , Human Sexuality",
        "Publisher": "Broadway",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "My Weird School #5: Miss Small Is off the Wall!",
        "Authors": "By Gutman, Dan and Paillot, Jim (ILT)",
        "Description": "With more than 11 million books sold, the My Weird School series really gets kids reading!In the fifth book of the original My Weird School series, Ella Mentry’s gym teacher, Miss Small, is teaching A.J., Andrea, and the gang about fitness. But how can anyone stay in shape juggling scarves, balancing feathers, and doing the Chicken Dance? Whatever happened to freeze tag or dodgeball?Perfect for reluctant readers and word lovers alike, bestselling author Dan Gutman’s insanely popular My Weird School series has something for everyone. Don’t forget to join A.J. and the gang on the rest of their hilariously weird adventures.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Iphigenia, Phaedra and Athaliah (Penguin Classics)",
        "Authors": "By Racine, Jean and Cairncross, John (TRN)",
        "Description": "Three plays by RacineFor more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " Drama , Ancient & Classical",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1964"
        }
    },
    {
        "Title": "The Reluctant Belligerent: American Entry Into World War II",
        "Authors": "By Divine, Robert A",
        "Description": "This detailed examination focuses on day-by-day diplomacy and confronts the reasons why the United States hesitated to enter the war. The author discusses the American retreat behind the facade of neutrality legislation, and how by waiting until the nation was forced into fighting, the U.S. may have actually added to the severity of World War II. --  (Softcover)",
        "Category": " History , United States , 20th Century",
        "Publisher": "McGraw-Hill College",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1979"
        }
    },
    {
        "Title": "Jackie Robinson (Pocket Biographies)",
        "Authors": "By academic industries",
        "Description": "",
        "Category": "",
        "Publisher": "Academic Industries",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Here In America's Test Kitchen: All New Recipes, Quick Tips, Equipment Ratings, Food Tastings, and Science Experiments from the Hit Public Television Show",
        "Authors": "By Cook's Illustrated Magazine (EDT)",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Boston Common Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    }
]