[
    {
        "Title": "Merry Christmas Boots (Boots lift-the-flap book)",
        "Authors": "By James, Sara",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Russia: The Land, the People",
        "Authors": "By Smithsonian Institution Traveling Exhibition Service",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Univ of Washington Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Remington and Russell",
        "Authors": "By Fisher, Leonard Everett",
        "Description": "",
        "Category": "",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Ellis Island (American Landmarks)",
        "Authors": "By Burdick, John",
        "Description": "Part of a series of books that recognize some of America's most beloved landmarks, this edition focuses on the history of Ellis Island, the first taste of America for many of our ancestors, captured in beautiful photographs.",
        "Category": " Photography , Subjects & Themes , Regional",
        "Publisher": "Smithmark Publishers",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Women Of The West (Library of the American West)",
        "Authors": "By Olwell, Carol and Luchetti, Cathy",
        "Description": "A myth-shattering look at the women who helped to settle the West, told through their own words and illustrated with 150 period photographs. This is American history, not as it was romanticized, but as it was lived. \"An authentic, refreshing, and even inspiring view of life on the frontier.\"--San Francisco Chronicle. Illustrations.",
        "Category": " Social Science , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "American foreign policy: A history",
        "Authors": "By Paterson, Thomas G.",
        "Description": "",
        "Category": "",
        "Publisher": "D. C. Heath",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Time for Joy: Daily Affirmations",
        "Authors": "By Fishel, Ruth",
        "Description": "Words can inspire, motivate and change us if we let them. Words can lift us to action. Words can move us to anger and rage or to love and tears. Most important, words can heal.May the words in this book be an inspiration for you when and as you need it. Read it by the page, one day at a time, or at random as you are so moved. Know that you are worthy of joy, that you deserve to have joy in your life. May you take this time to find  joy and may you know peace and love.",
        "Category": " Self-help , Affirmations",
        "Publisher": "Health Communications Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Future of the American Family",
        "Authors": "By Barna, George",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Moody Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "A Guide to Japanese Prints and Their Subject Matter (English and Japanese Edition)",
        "Authors": "By Stewart, Basil",
        "Description": "British connoisseur describes in detail the subject of famous Japanese color prints using 274 reproductions of works by Hokusai, Hiroshige, Utamaro, Shunyei, and other masters. Bibliography. Index.",
        "Category": " Art , Asian , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1979"
        }
    },
    {
        "Title": "The Journey to Peace: Reflections on Faith, Embracing Suffering, and Finding New Life",
        "Authors": "By Bernardin, Joseph Cardinal, Spilly, Alphonse P. (INT), and Langford, Jeremy (INT)",
        "Description": "Joseph Cardinal Bernardin (1928-1996) touched millions of people through his passionate witness, humble wisdom, and spiritual writings. In the final months of his life he shared his personal reflections in The Gift of Peace, a modern classic about finding inner peace in the face of life's greatest trials. As part of his rich legacy, The Gift of Peace has become an international bestseller and has brought courage, healing, faith, hope, and love to people of all backgrounds throughout the world. Cardinal Bernardin's legacy is continued here in The Journey to Peace, a special collection of his previously unpublished spiritual reflections.Using the Stations of the Cross as a framework, The Journey to Peace reveals the extraordinary faith, wisdom, and compassion of Joseph Cardinal Bernardin. Through these excerpts from his homilies, Cardinal Bernardin helps readers understand the relevance of Jesus' suffering, death, and resurrection to their own lives, inviting all to join the journey that leads to peace.Written with eloquent simplicity, and elegantly designed and illustrated with specially commissioned contemporary artwork, The Journey to Peace reaches people of all faiths for reading throughout the year.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Doubleday Religion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "I Touch (Baby Beginner Board Books)",
        "Authors": "By Oxenbury, Helen and Oxenbury, Helen (ILT)",
        "Description": "Helen Oxenbury's brilliant board books have delighted a generation of babies. Now from the most widely loved of artists comes a reissue of a board book to help very young children explore their worlds. In I TOUCH, a baby strokes a beard, pats a cat, and snuggles with a blanket. Full of character and humor, this charming book forms a winsome introduction to the senses.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Currier & Ives Christmas: Dreams and Secrets/Snow Storm/Image of Love/Circle of Blessings (Inspirational Christmas Romance Collection)",
        "Authors": "By Coleman, Lynn A., Mills, DiAnn, Grote, Joann A., and Raney, Deborah",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Daddy Loves His Girls",
        "Authors": "By Jakes, T. D.",
        "Description": "For Ingest Only - Data needs to be cleaned up for all products being loaded",
        "Category": " Religion , Christian Education , General",
        "Publisher": "Creation House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Look at a Tree (Now I Know First Start Reader)",
        "Authors": "By Curran, Eileen",
        "Description": "Shows the many things that can be found in trees, including beehives, bird's nests, squirrels, opossums, raccoons, tangled kites, treehouses, blossoms, flowers and pine cones",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "God's Little Lessons For Women",
        "Authors": "By Honor Books",
        "Description": "",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "An Important Office of Immense Love: A Handbook for Eucharistic Ministers",
        "Authors": "By Champlin, Joseph M.",
        "Description": "",
        "Category": "",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "The Confident Woman: Start Today Living Boldly and Without Fear",
        "Authors": "By Meyer, Joyce",
        "Description": "What keeps women from being their best? Joyce has been helping women better themselves by helping identify emotional barriers and physical, mental, and spiritual obstacles in their lives for years. Now she provides another answer-confidence. Our society has an insecurity epidemic, women in particular. Compensating by pretending to be secure-a common response-only leads to feelings of shame. Lack of self-confidence causes great difficulty in relationships of all kinds, and in marriage instances can even lead to divorce. In THE CONFIDENT WOMAN, Joyce explores the seven characteristics of a woman with confidence, which include a woman who knows she is loved, who refuses to live in fear, and who does not live by comparisons. Joyce explains that confidence stems from being positive in your actions and living honestly, but most importantly from having faith, in God and in ourselves.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Running with the Giants: What the Old Testament Heroes Want You to Know About Life and Leadership (Giants of the Bible)",
        "Authors": "By Maxwell, John C.",
        "Description": "The best-selling author and motivational speaker speculates on the leadership advice that Old Testament figures would give if they had the chance. 175,000 first printing.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Irish Rogue (Palisades Contemporary Romance)",
        "Authors": "By Jones, Annie",
        "Description": "Michael Shaugnessy longs for a new beginning. Fiona O'Dea wants to help the old family friend start fresh, setting an example for her son who once adored Michael but now despises him. Yet a legacy of lies and a stolen fortune stand between them and the mending of their Irish hearts in this follow-up to the Palisades romance Irish Eyes.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Adobe Photoshop Cs Classroom in a Book",
        "Authors": "By Adobe Creative Team",
        "Description": "Photoshop is one of those programs that's so cool you just want to dive right in and start creating--but by plunging in head-first, without any guidance, you're likely to miss a lot. There's a solution: With this book, you learn by doing, getting your feet wet immediately as you progress through a series of hands-on projects that build on your growing Photoshop knowledge. Simple step-by-step instructions, review questions at the end of each chapter, and a companion CD with all of the book's project files make learning a breeze as the Adobe Creative Team takes you on a self-paced tour of the image-editing powerhouse. Completely revised to cover all of Photoshop CS's new features (including a new file browser, nonsquare pixel support, Layer comps for creating design variations, and more), the book starts with an introductory tour of the software and then progresses on through lessons on everything from Photoshop's interface to more complex topics like color management, Web graphics, and photo retouching.",
        "Category": " Computers , Computer Graphics",
        "Publisher": "Adobe Pr",
        "Price Starting With ($)": "7.13",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "A Woman's Passion for Travel: More Stories from a Woman's World (Travelers' Tales)",
        "Authors": "By Bond, Marybeth, Bond, Marybeth (EDT), Michael, Pamela, and Michael, Pamela (EDT)",
        "Description": "Includes nearly 40 personal accounts by women whose travels include trips of self-discovery, research, recreation, adventure-seeking, pilgrimage, and escape to locales ranging from the Trobriand Islands off Papua New Guinea to the International Toilet Symposium in Toyama, Japan. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Travelers' Tales Guides",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Which way to the Islands (Volume 1)",
        "Authors": "By Nowak, Mr. H.G",
        "Description": "",
        "Category": "",
        "Publisher": "Daring Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2012"
        }
    },
    {
        "Title": "Frommer's Italy From $70 a Day (Frommer's $ A Day)",
        "Authors": "By Bramblett, Reid and Levine, Lynn A.",
        "Description": "\"Written in the spirit of discovery, as Frommer?s guides always have been, and it bears the time-tested pedigree.\"?Chicago Sun-TimesFrommer?s Dollar-A-Day guides show you how to travel in style?without breaking the bank. You?ll find inexpensive accommodations that don?t skimp on comfort. Affordable restaurants where locals go for a good meal. And all the best sightseeing and shopping values. Frommer?s Dollar-A-Day guidebooks. First-class travel on a budget.Everything You Need for an Unforgettable?and Affordable?Trip!Charming places to stay, from antique-filled palazzi to family-run pensiones?for as little as $30 per person a night!Authentic dining at unbelievably low prices, from $12 multi-course meals at a Florentine trattoria to Neapolitan pizza for as little as $6.A complete guide to Italy?s sights, from Tuscan hill towns and the spectacular scenery of the Amalfi Coast to ancient Roman ruins and masterpieces of the Renaissance?plus the lowdown on what to see and do for free.Where to shop for local crafts and find high fashion you can really afford.Low-cost nightlife: wine bars, cafes, opera, and more.",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Frommers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Stuart Little: The Storybook",
        "Authors": "By Shyamalan, M. Night, Cooper, Amy Jo (ADP), and Brooker, Greg",
        "Description": "Just right for reading aloud over and over again, this oversize storybook retells Stuart's mighty adventures from the film: living with the Littles, outwitting Snowbell and the alley cats, winning the Central Park Boat Race, and more!",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "A Prisoner of Birth",
        "Authors": "By Archer, Jeffrey",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Treasures from the Kremlin: An Exhibition from the State Museums of the Moscow Kremlin at the Metropolitan Museum of Art, New York, May 19-september 2, 1979 and the Grand Palais, Paris, October 12, 1979-january 7, 1980",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "New York",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Mother Massage: A Handbook for Relieving the Discomforts of Pregnancy",
        "Authors": "By Stillerman, Elaine and Kurz, Diana (ILT)",
        "Description": "A Handbook for Relieving the Discomforts of PregnancyMassage is a sensuous, relaxing, and loving treatment that has the added bonus of being especially good for you. It’s the perfect way to reduce stress and promote general well-being. During pregnancy, your body is undergoing many changes, some of them stressful and discomforting. Mother Massage, by licensed massage therapist Elaine Stillerman, is a beautifully illustrated guide to help eliminate some of these adverse effects. Designed to be used either alone or with a partner, Mother Massage provides techniques for a variety of massages, including full body massage, preparation for labor and birthing massage, massage during the postpartum and nursing stages, and infant massage. These techniques are explained in step-by-step, illustrated detail. You’ll also learn special massages for treating such discomforts as:• Backaches  • Breast Soreness   • Charley Horse and Leg Cramps   • Headaches   • Heartburn   • Fatigue   • Morning Sickness   • Sciatica   • Stretch Marks    • Varicose Veins   • And Many OthersAlso included are sections on reflexology, herbal remedies, and nutritional requirements for pregnant and lactating women.",
        "Category": " Health & Fitness , Massage & Reflexology",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "The Lord of the Rings (Movie Art Cover)",
        "Authors": "By Tolkien, J. R. R.",
        "Description": "In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, The Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell, by chance, into the hands of the hobbit, Bilbo Baggins.     From his fastness in the Dark Tower of Mordor, Sauron's power spread far and wide. He gathered all the Great Rings to him, but ever he searched far and wide for the One Ring that would complete his dominion.     On his eleventy-first birthday Bilbo disappeared, bequeathing to his young cousin Frodo the Ruling Ring and a perilous quest --- to journey across Middle-earth, deep into the shadow of the Dark Lord, and destroy the Ring by casting it into the Cracks of Doom. THE LORD OF THE RINGS tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the Wizard, Merry, Pippin, and Sam, Gimli the Dwarf, Legolas the Elf, Boromir of Gondor, and a tall, mysterious stranger called Strider.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Zapp! In Education: How Empowerment Can Improve the Quality of Instruction, and Student and Teacher Satisfaction",
        "Authors": "By Cox, Jeff, Byham, William C., and Shomo, Kathy Harper",
        "Description": "In this dynamic, helpful, guide William C. Byham takes his Zapp! empowerment principles and adapts it for the classroom with workable, hands-on advice for how educators can get their students (and themselves) excited about education again. He shows how to get students to take responsibility for their own progress by involving them in decision-making; encouraging them to think for themselves; and fostering trust, creativity, and hunger for new challenges. Innovative, accessible, and fun to read, ZAPP! IN EDUCATION offers essential guidance for teachers, school administrators, school board members, and support staff.",
        "Category": " Education , Leadership",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Pennsylvania's Northeast (Pa's Cultural & Natural Heritage Series)",
        "Authors": "By Seitz, Ruth Hoover, Seitz, Blair, and Seitz, Blair (PHT)",
        "Description": "",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "RB Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Snow White and the Seven Dwarfs (Disney Princess Storybook Library, Volume 4)",
        "Authors": "By Walt Disney",
        "Description": "",
        "Category": "",
        "Publisher": "ADVANCE PUBLISHERS (FL)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Boris Carmi: Photographs from Israel",
        "Authors": "By Kaniuk, Yoram, Nocke, Alexandra (EDT), Schlor, Joachim, Karmi, Boris, and Nocke, Alexandra",
        "Description": "Unlike any other photographer, Boris Carmi (1914-2002) succeeded in capturing the essence of Israeli society from its very beginning in images that never fail to surprise. He was one of the founding fathers of photojournalism in a new-born country, focussing on scenes of everyday life, and portraits of the country's cultural elite. In the midst of conflict, however, it was the ordinary people who interested Carmi most.",
        "Category": " Photography , Photojournalism",
        "Publisher": "Prestel Publishing",
        "Price Starting With ($)": "11.64",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "EGYPTIAN SCULPTURE /ANGLAIS",
        "Authors": "By JAMES, T.G.H. and W.V. DAVIES.",
        "Description": "",
        "Category": "",
        "Publisher": "BRITISH MUSEUM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "The Kingdom",
        "Authors": "By Chadwick, Douglas",
        "Description": "",
        "Category": "",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "7.82",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "The History of Photography from 1839 to the Present Day",
        "Authors": "By Beaumont Newhall",
        "Description": "",
        "Category": "",
        "Publisher": "THE MUSEUM OF MODERN ART",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "CRIMES OF TEH HEART",
        "Authors": "By Beth Henley",
        "Description": "",
        "Category": "",
        "Publisher": "Dramatists Play Service",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Tucker's Last Stand",
        "Authors": "By Buckley, William F.",
        "Description": "Dispatched by the United States government to Vietnam in the wake of the chaotic events of 1964, Blackford Oakes and a swashbuckling mercenary named Tucker stir up trouble along the Ho Chi Minh Trail and in the Gulf of Tonkin",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Medieval Europe: A short history",
        "Authors": "By Hollister, C.Warren",
        "Description": "",
        "Category": "",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Burgermeister's Daughter: Scandal in a Sixteenth-Century German Town",
        "Authors": "By Ozment, Steven E.",
        "Description": "Historian Steven Ozment's haunting story examines the brutal legal battle between Anna Buschler and her powerful father, the burgermeister of the imperial German City of Schwabisch Hall and a local hero, in the first half of the sixteenth century. A frequent subject of gossip because of her garish dress and flirtatious behavior, Anna was banished from her father's house after she was caught in secret, simultaneous love affairs with two men - one a member of royalty, the other a cavalryman.After being forced from her home, she brought suit against her father, charging him with abandonment in the very chambers over which he had presided. He responded by taking her captive and chaining her to a table for six months, before she escaped and took up her case again, now adding abuse to the charge of abandonment. Thus began nearly thirty years of on-and-off litigation between Anna and her father, her siblings, and the city council of Hall, as she fought disinheritance and impoverishment. In her legal battles, as in her personal life, she defied the accepted standards of behavior for the women in her age.Drawing on rare surviving love letters and extensive court records, The Burgermeister's Daughter recaptures Anna's compelling story from the perspectives of the combatants and the testimony of more than forty citizens, shedding light on the politics of sexuality, gender, and family, and demonstrating what a determined woman might do at law even in the Middle Ages. However, the morals of Anna's story reach far beyond the sixteenth century, teaching the modern reader universal lessons about surviving unrightable wrongs and maintaining human dignity through even the most degrading circumstances.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Sarah: A Novel (The Canaan Trilogy, Book 1)",
        "Authors": "By Halter, Marek",
        "Description": "The first novel in a dazzling new trilogy about the women of the Old Testament by internationally bestselling author Marek Halter.The story of Sarah--and of history itself--begins in the cradle of civilization: the Sumerian city-state of Ur, a land of desert heat, towering gardens, and immense wealth. The daughter of a powerful lord, Sarah is raised in great luxury, but balks at the arranged marriage her father has planned for her. The groom is handsome and a nobleman, but on their wedding day, Sarah panics and impulsively flees to the vast, empty marshes outside the city walls. There she meets a young man, Abram, a member of a nomadic tribe of outsiders. Drawn to this exotic stranger, Sarah spends the night with him, but reluctantly returns to her father’s house. But on her return, still desperate to avoid another wedding, she drinks a poisonous potion that will make her barren and thus unfit for marriage.  Many years later, Abram’s people return to Ur, and he discovers that the lost, rebellious girl from the marsh has been transformed into the most splendid and revered woman in Sumeria--the high priestess of the goddess Ishtar. But the memory of their night together has always haunted Sarah, and she gives up her exalted life to join Abram's tribe and follow the one true God, an invisible deity who speaks only to Abram. It is then that her journey truly begins--a journey that holds the key to her remarkable destiny as the mother of nations.From the great ziggurat of Ishtar and the fertile valleys of Canaan to the bedchamber of the mighty Pharaoh himself, Sarah’s story reveals an ancient world full of beauty, intrigue, and miracles.",
        "Category": " Fiction , Historical",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Steps",
        "Authors": "By Cohn, Rachel",
        "Description": "Twelve-year-old Annabel thought Christmas break was going to be amazing. She'd planned to stay home in New York City with her best friend and do traditional things like go ice-skating in Rockefeller Center, hit the after-Christmas sale at Bloomingdale's, and scream with the TRL crowd at MTV in Times Square. But when her best friend bails, Annabel's mom decides it's high time Annabel visit her father and his new family in Australia.  Annabel is not pleased about traveling around the world to meet \"the steps\" -- twelve-year-old fashion-disaster stepsister, five-year-old stepbrother, and baby half sister -- but she's not going to waste this chance to steal her father back.",
        "Category": " Juvenile Fiction , Family , Marriage & Divorce",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "A Month of Seven Days",
        "Authors": "By Climo, Shirley",
        "Description": "",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Diamond (The Divas)",
        "Authors": "By Murray, Victoria Christopher",
        "Description": "Diamond. India.  Veronqie. Aaliyah. What does that spell? DIVA!!   The Divine Divas. They're fifteen and they're fine, and they want to be the hottest, hippest new girl group to hit gospel music. First they'll have to win the team talent competition. But with looks, energy, and voices like theirs, they are sure they'll go right to the top.   Diamond Winters is the one who formed the Divas. With her wealthy, loving parents and an endless supply of charm, she's always been able to sweet-talk her way into anything. But this time, has Diamond talked her way right into trouble? Diamond has support for her group from her family and church, but she has a lot going on. She's made it onto the school's varsity cheerleading squad, and she's caught the eye of the totally cool senior Jason Xavier. Jax is sweeping her off her feet, but Diamond is starting to feel as if she's in over her head.   Diamond has always been so sure she's in control. Will she have the courage to ask for help and guidance when she needs it? And will the Divas even manage to stay together long enough for the first round of the talent competition?",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Hope, Not Fear: A Path to Jewish Renaissance",
        "Authors": "By Bronfman, Edgar M. and Zasloff, Beth",
        "Description": "A distinguished Jewish leader and philanthropist argues for openness and joy to reinvigorate Judaism in America.After a lifetime of fighting the persecution of Jews, Edgar M. Bronfman has concluded that what North American Jews need now is hope, not fear. Bronfman urges North American Jewry “to build, not fight. We need to celebrate the joy in Judaism, even as we recognize our responsibility to alleviate suffering and to help heal a broken world. We need to understand Judaism as a multifaceted culture as well as a religion, and explore Jewish literature, music, and art. We need to understand our tradition of debate and questioning, and invite all to enter a conversation about our central texts, rituals, and laws. We need to open our book anew, and re-create a vital Judaism for our time.”Through a reexamination of important texts and via interviews with some of the leading figures in Judaism today, Bronfman outlines a new agenda for the Jewish community in North America, one that will ensure that Judaism grows and thrives in an open society. He calls for welcome without conditions for intermarried families and disengaged Jews, for a celebration of Jewish diversity, and for openness to innovation and young leadership. Hope, Not Fear is an impassioned plea for all who care about the future of Judaism to cultivate a Jewish practice that is open to the new as it delves into the old, that welcomes many voices, and that reaches out to make the world a better place.",
        "Category": " Religion , Judaism , General",
        "Publisher": "St Martins Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Cliques, Phonies, & Other Baloney (Laugh & Learn®)",
        "Authors": "By Romain, Trevor",
        "Description": "Cliques can make you sick. If you’re on the outside, you’re treated like dirt. And if you’re on the inside, you have to follow the rules. Who needs more rules at school? Written for every kid who has ever felt excluded or trapped by a clique, this book blends humor with practical advice as it tackles a serious subject. Trevor Romain starts by explaining what cliques are and why they exist: because everyone wants to have friends. He reveals why some cliques are so annoying—and often full of phonies. And he shares the secret to being popular: just be yourself! Trevor knows how to get through to kids. As readers smile at his cartoons and laugh at his jokes, they’ll also be learning skills they need to make and keep friends—real friends, not people who pretend to be cool. They’ll discover that some supposedly “popular” kids are lonely and miserable inside. And they’ll pick up important self-esteem tips that will help them feel good about themselves (because there’s no need to let a bad clique spoil a perfectly good day). Part of the Bully Free Kids™ line",
        "Category": " Juvenile Nonfiction , Social Topics , Friendship",
        "Publisher": "Free Spirit Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Jennifer, Hecate, MacBeth, William McKinley, and Me, Elizabeth",
        "Authors": "By Konigsburg, E. L.",
        "Description": "A lonely girl discovers a magical world and a new friend when she meets a young witch on Halloween",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "Having Our Say: The Delany Sisters' First 100 Years",
        "Authors": "By Delany, Sarah, Hearth, Amy Hill, Delany, Elizabeth, Hearth, Hill, and Delany, Annie Elizabeth",
        "Description": "Warm, feisty, and intelligent, the Delany sisters speak their mind in a book that is at once a vital historical record and a moving portrait of two remarkable women who continued to love, laugh, and embrace life after over a hundred years of living side by side. Their sharp memories show us the post-Reconstruction South and Booker T. Washington; Harlem's Golden Age and Langston Hughes, W.E.B. Du Bois, and Paul Robeson. Bessie breaks barriers to become a dentist; Sadie quietly integrates the New York City system as a high school teacher. Their extraordinary story makes an important contribution to our nation's heritage--and an indelible impression on our lives.",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Angels Don't Know Karate (The Adventures Of The Bailey School Kids #23)",
        "Authors": "By Dadey, Debbie, Jones, Marcia Thornton, and Gurney, John Steven (ILT)",
        "Description": "The hugely popular early chapter book series re-emerges with a new look! Brand-new eye-catching cover art brings a modern feel to this classic monster series for young readers.Melody believes in guardian angels, but the other Bailey School kids aren't convinced. That is until a new woman comes to town who keeps showing up just in time to save people. Melody even says she saw the woman spreading her wings! Could the newcomer really have come to Bailey City on a miracle mission?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "The King of Show-And-Tell (Ready, Freddy! #2)",
        "Authors": "By Klein, Abby and McKinley, John (ILT)",
        "Description": "Watch out, Junie, there's a new kid on the block! It's Freddy Thresher, a first grader who knows it's a jungle out there. A new chapter book series written by an elementary teacher who's seen it all!Freddy Thresher has a problem: a really, really, big problem. He never has anything cool to bring for show-and-tell. This week, his best friend, Robbie, has brought the most amazing artifact to share: a real alligator head. How will Freddy come up with anything as cool as that? Good news! Later that day, he finds something very unusual and exciting. If only he can get it to school without his mom, \"The Neat Freak,\" finding out, Freddy will be the King of Show-and-Tell!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "The Blue Sky Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Cardinal Mahony: A Novel",
        "Authors": "By Kaiser, Robert Blair",
        "Description": "An American bishop gets kidnapped outside his cabin in the High Sierras one snowy morning in November 2008 by three liberation theologians who look like terrorists. They take him off to southern Mexico in his own helicopter and put him on trial for his sins in front of an international television audience. A jury of his peers, six retired Latin American bishops, find him guilty, and give him a surprising sentence. He falls in love with his kidnappers and leads the American Catholic Church into a radical new way of being, still Catholic, but aggressively accountable to the people, which is to say aggressively American. The fictional bishop in this novel is, obviously, based on Cardinal Mahony of Los Angeles in a piece of reality fiction that pushes the envelope. It is set in the reality of the current priest-sex-abuse scandal, and it projects ahead in time to tell the story of a colorful crewand a new Cardinal Mahony working to give Catholics a voice, a vote, and citizenship in their Church.",
        "Category": " Fiction , Religious",
        "Publisher": "Humble-bee Press",
        "Price Starting With ($)": "7.57",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Mediterranean Europe (Lonely Planet Mediterranean Europe)",
        "Authors": "By Adams, Fiona, Garwood, Duncan, Bain, Carolyn, and Bindloss, Joe",
        "Description": "",
        "Category": " Travel , Europe , General",
        "Publisher": "Lonely Planet Publications",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Power Vision",
        "Authors": "By Amazon.com Books Delivers",
        "Description": "",
        "Category": "",
        "Publisher": "Day Dream Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "European Integration Revisited: Progress, Prospects, And U.s. Interests",
        "Authors": "By Calingaert, Michael",
        "Description": "In this fresh and timely account, Michael Calingaert explores the successes and failures of European economic and political integration, analyzes the factors that will determine its future course, and outlines the directions the European Union is moving in as it approaches the 21st century. Assessing U.S. interests affected by European integration, Calingaert recommends policies for the United States to consider in the face of an increasingly consolidated Europe. With its broad coverage and readable synthesis of a wealth of detailed information, this book will be of interest to students, scholars, and policymakers alike.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Routledge",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Little Hands Big Fun Craft Book: Creative Fun for 2- to 6-Year-Olds (Williamson Little Hands Series)",
        "Authors": "By Press, Judy and Braren, Loretta Trezzo (ILT)",
        "Description": "Presents over seventy-five simple arts and crafts activities related to holidays, school, occupations, travel, nature, home, and friendship",
        "Category": " Juvenile Nonfiction , Crafts & Hobbies",
        "Publisher": "WorthyKids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Hamsters (Complete Pet Owner's Manuals)",
        "Authors": "By Frisch, Otto Von",
        "Description": "Children love hamsters, but owners of all ages should know how to keep these animals correctly housed, properly fed, and provided with toys and devices to help keep them active and healthy.",
        "Category": " Pets , Reference",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Ironwood Tree (The Spiderwick Chronicles, Book 4)",
        "Authors": "By Holly Black, Tony DiTerlizzi",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Pocahontas",
        "Authors": "By Bruchac, Joseph",
        "Description": "In 1607, when John Smith and his \"Coatmen\" arrive in Powhatan to begin settling the colony of Virginia, their relations with the village's inhabitants are anything but warm. Pocahontas, the beloved daughter of the Powhatan chief, Mamanatowic, is just eleven; but in spite of her age, this astute young girl acts with wisdom and compassion, and plays a fateful, peaceful role in the destinies of two peoples. Drawing from the personal journals of John Smith, Joseph Bruchac, winner of the American Book Award for Breaking Silence, reveals an important part of history through the eyes of two historic figures.",
        "Category": " Young Adult Nonfiction , People & Places , United States , Native American",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Define \"Normal\"",
        "Authors": "By Peters, Julie Anne",
        "Description": "From National Book Award Finalist Julie Anne Peters  This thoughtful, wry story is about two girls--a \"punk\" and a \"prep\"--who find themselves facing each other in a peer-counseling program and discover that they have some surprising things in common. A new reading-group guide written by the author is included in the back of this paperback edition.",
        "Category": " Young Adult Fiction , Family , Parents",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "unChristian: What a New Generation Really Thinks about Christianity... and Why It Matters",
        "Authors": "By Kinnaman, David",
        "Description": "Based on groundbreaking research conducted with sixteen to twenty-nine-year-old non-believers, and featuring responses from a vast array of Christian leaders, this insightful book, filled with motivation and hope, shows Christians how society really perceives them and what can be done to reverse these negative perceptions. 50,000 first printing.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Baker Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Little Genie: Make a Wish",
        "Authors": "By Jones, Miranda and Calver, David (ILT)",
        "Description": "When Ali and her gran pick up a dusty Lava lamp at the flea market, Ali never expects to find a little genie inside! Little Genie has a groovy approach to magic–after all, she hasn’t been out of her lamp since the 1960s! An excited Ali is soon making wishes–but Little Genie missed a few magic lessons . . . and, well, now Ali has a tiny purple tiger, 10,000 chocolate bars, and a visit from her favorite band–which she has to keep secret from her family or Little Genie will be sent back to her bottle! Having all your wishes come true might not be so great!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Matthew Henson (Black Americans of Achievement)",
        "Authors": "By Gilman, Michael",
        "Description": "Follows the life of the Black explorer who accompanied Robert Peary on the expedition to the North Pole",
        "Category": " Science , General",
        "Publisher": "Chelsea House Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "The Joy of Twins and Other Multiple Births: Having, Raising, and Loving Babies Who Arrive in Groups",
        "Authors": "By Novotny, Pamela Patrick",
        "Description": "A revised edition of the encouraging and comprehensive guide to the latest medical, psychological, and sociological finding on all aspects of caring for two or more infants at a time. \"...A vital, practical guide detailing the care of infant twins and methods for parent survival.\"--Booklist Black-and-white photographs.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Rescue (DK Eyewitness Books)",
        "Authors": "By Watts, Claire",
        "Description": "",
        "Category": "",
        "Publisher": "(DK Eyewitness Books)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Richard M. Nixon: The Complex President (MAKERS OF AMERICA)",
        "Authors": "By Goldman, Martin S.",
        "Description": "Presents the life and career of former President Richard Nixon, from his days in the Senate, to his presidency, to the Watergate scandal",
        "Category": " Young Adult Fiction , Biographical",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Groom Your Room: Terrific Touches to Brighten Your Bedroom (American Girl Library)",
        "Authors": "By In House",
        "Description": "Offers ideas and advice that allow girls to create bedrooms that suit their personalities and lifestyles",
        "Category": " Juvenile Nonfiction , Girls & Women",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "God Is a Salesman: Learn from the Master",
        "Authors": "By Stevens, Mark",
        "Description": "Laced with anecdotes based on the experiences of the author and the many others he has known, loved, mentored, coached, and partnered with, GOD IS A SALESMAN shows us how to translate powerful lessons from God into tools to help us achieve extraordinary success through better relationships, and new dimensions in life.",
        "Category": " Business & Economics , Customer Relations",
        "Publisher": "Center Street",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Touch and Feel: Birthday (Touch and Feel)",
        "Authors": "By Dorling Kindersley, Inc. (COR)",
        "Description": "Two new titles in our award winning Touch and Feel series that use birthday and mealtime to reinforce primary learning skills through sensory perception. Would you like to touch a birthday balloon? Turn the pages to enjoy more party textures. With easy-to-read text, superb full-color photography, and textures that can be touched again and again, Touch and Feel Birthday and Touch and Feel Mealtime are the next two titles in this award-winning series designed encourage children to explore the world around them.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Birthdays",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Kids Create! Art & Craft Experiences for 3- to 9-Year-Olds",
        "Authors": "By Carlson, Laurie",
        "Description": "More than 150 craft and art activities for creative self-expression of youngsters, with easy-to-follow instructions",
        "Category": " Juvenile Nonfiction , Art , General",
        "Publisher": "Williamson Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Creative parenting: How to use the new continuum concept to raise children successfully from birth through adolescence",
        "Authors": "By Sears, William",
        "Description": "",
        "Category": "",
        "Publisher": "Dodd, Mead",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "God: The Failed Hypothesis: How Science Shows That God Does Not Exist",
        "Authors": "By Stenger, Victor J.",
        "Description": "Throughout history, arguments for and against the existence of God have been largely confined to philosophy and theology, while science has sat on the sidelines. Despite the fact that science has revolutionized every aspect of human life and greatly clarified our understanding of the world, somehow the notion has arisen that it has nothing to say about the possibility of a supreme being, which much of humanity worships as the source of all reality. This physicist and author contends that, if God exists, some evidence for this existence should be detectable by scientific means, especially considering the central role that God is alleged to play in the operation of the universe and the lives of humans. Treating the traditional God concept, as conventionally presented in the Judeo-Christian and Islamic traditions, like any other scientific hypothesis, Stenger examines all of the claims made for God's existence. He considers the latest Intelligent Design arguments as evidence of God's influence in biology. He looks at human behavior for evidence of immaterial souls and the possible effects of prayer. He discusses the findings of physics and astronomy in weighing the suggestions that the universe is the work of a creator and that humans are God's special creation. After evaluating all the scientific evidence, Stenger concludes that beyond a reasonable doubt the universe and life appear exactly as we might expect if there were no God.",
        "Category": " Religion , Atheism",
        "Publisher": "Prometheus",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Magic Handbook",
        "Authors": "By Eldin, Peter",
        "Description": "The deep, dark secrets of the world of magic are conjured up to bring out and encourage the young magician in everyone! Using inexpensive equipment and following easy, step-by-step instructions and full-color illustrations, you can learn to fool your friends and family. Card tricks, fun ideas for a spectacular magic show and much more are all here in this elegant grab bag of tricks and treats! Including: Magic with money, mental magic, conjuring for children A complete introduction and history of magic Full color art and photography throughout Extensive bibliography Glossary of magical terms and index Information on magic dealers and societies",
        "Category": " Juvenile Fiction , Sports & Recreation , Games",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "After the Baby Boomers: How Twenty- and Thirty-Somethings Are Shaping the Future of American Religion",
        "Authors": "By Wuthnow, Robert",
        "Description": "Much has been written about the profound impact the post-World War II baby boomers had on American religion. But the lifestyles and beliefs of the generation that has followed--and the influence these younger Americans in their twenties and thirties are having on the face of religion--are not so well understood. It is this next wave of post-boomers that Robert Wuthnow examines in this illuminating book. What are their churchgoing habits and spiritual interests and needs? How does their faith affect their families, their communities, and their politics? Interpreting new evidence from scores of in-depth interviews and surveys, Wuthnow reveals a generation of younger adults who, unlike the baby boomers that preceded them, are taking their time establishing themselves in careers, getting married, starting families of their own, and settling down--resulting in an estimated six million fewer regular churchgoers. He shows how the recent growth in evangelicalism is tapering off, and traces how biblical literalism, while still popular, is becoming less dogmatic and more preoccupied with practical guidance. At the same time, Wuthnow explains how conflicts between religious liberals and conservatives continue--including among new immigrant groups such as Hispanics and Asians--and how in the absence of institutional support many post-boomers have taken a more individualistic, improvised approach to spirituality. Wuthnow's fascinating analysis also explores the impacts of the Internet and so-called virtual churches, and the appeal of megachurches. After the Baby Boomers offers us a tantalizing look at the future of American religion for decades to come.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Bendon 13374 Piggy Toes Press Eight Silly Monkeys Board Book",
        "Authors": "By Haskamp, Steve (ILT)",
        "Description": "Silly monkeys everywhere! Can you count with them? Join the fun and sing along with Bendon's Eight Silly Monkeys countdown storybook. Your little reader will love this timeless story freshened up with cute, tactile monkeys that make counting interactive and fun.  It's a perfect introduction to reading, rhyming, and counting for your little reader!",
        "Category": " Juvenile Fiction , Concepts , Counting & Numbers",
        "Publisher": "Dalmatian Pr",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Greater Than You Think: A Theologian Answers the Atheists About God",
        "Authors": "By Williams, Thomas D.",
        "Description": "The recent runaway bestsellers God Is Not Great and The God Delusion have left Christians feeling defensive but not necessarily equipped to refute the accusations of nonbelievers. The bestsellers have also provoked those who are the fence about whether God exists, and if so, whether He's good. In his trademark elegant prose, Father Williams  provides accessible but intellectually rich answers for both groups. Questions include \"Isn't religion just another name for superstition (or magic or myth)?\" \"If God is all-good and all-powerful, how can evil exist in the world?\" and \"Hasn't science disproved God's existence?\" For believers and those searching for something to believe in, Father Williams offers an easy-to-use resource for building up one's own faith and igniting others'.",
        "Category": " Religion , Christian Theology , Apologetics",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Amazing Facts About Ancient Egypt (Beginner's Guides)",
        "Authors": "By Putnam, James and Pemberton, Jeremy",
        "Description": "Hundreds of curious, extraordinary, zany, and hilarious facts about the ancient Egyptians are featured in an humorously illustrated fact book, which includes tidbits about their lumpy beer, trained baboons, egg hatcheries, tatoos, and more. Natural Sci Alt.",
        "Category": " Young Adult Nonfiction , History , Middle East",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "My Life in Dog Years",
        "Authors": "By Paulsen, Gary and Paulsen, Ruth Wright (ILT)",
        "Description": "Gary Paulsen has owned dozens of unforgettable and amazing dogs. In each chapter he tells of one special dog, among them Cookie, the sled dog who saved his life; Snowball, the puppy he owned as a boy in the Philippines; Ike, his mysterious hunting companion; Dirk, the grim protector; and his true friend Josh, a brilliant border collie.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Literary",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Look What I Did with a Leaf! (Naturecraft)",
        "Authors": "By Sohi, Morteza E.",
        "Description": "Look What I Did with a Leaf! will show young art and craft lovers how to use nature's bounty to create fanciful animals and natural scenes. Readers will develop their artistic eye and soon learn to see the artistic possibilities that surround them. Morteza E. Sohi gives careful directions on how to choose leaves for shape and color, how to arrange them in an animal form, and how to preserve the finished work of art. A field guide helps young leaf artists learn more about the tools of their craft.",
        "Category": " Juvenile Nonfiction , Science & Nature , Trees & Forests",
        "Publisher": "Bloomsbury USA Childrens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "NoBrow: The Culture of Marketing - the Marketing of Culture",
        "Authors": "By Seabrook, John",
        "Description": "Prepare to enter the outrageous new world of Nobrow, where the old cultural distinctions - highbrow (Wagner's Ring), middlebrow (Masterpiece Theater), and lowbrow (the latest MTV video) - cease to exist. John Seabrook raises the curtain on an onrushing cultural phenomenon: the melding of culture with the marketing of culture and the culture of marketing.He shows us how Nobrow increasingly defines the great American audience that now follows the Three Tenors on tour, cheers rock groups like Radish (whose fifteen-year-old lead singer wins a multi-million-dollar recording contract and fifteen minutes of celebrity), obsesses on the prequel to Star Wars, and is as hip to promotion as to performance.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Rat (An Owner's Guide to a Happy Healthy Pet)",
        "Authors": "By Cardinal, Ginger",
        "Description": "This is our seventh set of Happy, Healthy Pet titles. These latest books will bring our series up to fifty-five titles and, like the others, they are books pet owners can turn to for the essential information they need to raise a healthy, happy pet. All books contain information on: c feeding c grooming c housing c health care c what to expect from the pet c basic training As our series expands and focuses on different kinds of pets, the emphasis remains on making the pet a companion. Owners of more unusual pets will particularly appreciate the expert advice in these books because professional care for exotic animals can be hard to come by. As always, the instruction on the books is from experts people who know their pets intimately but always remember what it was like to have one the first time. Happy, Healthy Pet guides are rich with professional quality color photos and are designed to be enjoyable and easy to learn from. More and more people are discovering each year what affectionate, intelligent and charming pets rats can be. Ginger Cardinal already knows. She s the former president of the Rat, Mouse and Hamster Society and a longtime breeder, exhibitor, judge and dedicated companion of these special rodents. 128 pages",
        "Category": " Pets , Rabbits, Mice, Hamsters, Guinea Pigs, etc.",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Moving Up: Dr. Sujay's Ten Steps to Turning Your Life Around and Getting to the Top!",
        "Authors": "By Cook, Suzan Johnson",
        "Description": "The minister the New York Times described as “Billy Graham and Oprah rolled into one” shares her winning formula for facing life’s transitions with confidence and faith.A dynamic religious leader, Suzan Johnson Cook epitomizes the positive attitude and self-help spirit that can take you from where you are to where you want to be. Whether you are facing a career change or moving to a new city, dealing with aging parents or settling into an “empty nest” after your children have grown, she teaches you how to move on without messing up. This book will capture your attention and advance you toward a new spirit of liberty and “UPness.” The Journey of Life is a series of steps—some forward, some backward, but always important. The steps here will take you on the Journey of Life you’ve always wanted.Moving Up sets out the ten steps that will lead you to a new, more satisfying place in life: Stand Up, Speak Up, Look Up, Book Up, Kiss Up, Listen Up, Hang Up, Make Up, Wake Up, and Cheer Up. Using an engaging combination of autobiographical vignettes, her experiences as a pastor, and biblical stories, Cook illustrates each step—and concludes each chapter with simple exercises and helpful suggestions for incorporating Moving Up’s lessons into your own life.",
        "Category": " Self-help , General",
        "Publisher": "Doubleday Religion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Soul Graffiti: Making a Life in the Way of Jesus",
        "Authors": "By Claiborne, Shane (FRW) and Scandrette, Mark",
        "Description": "In Soul Graffiti ? Mark Scandrette—writer, poet, and leader in the Emergent church movement—uses vivid stories of his own life and the lives of the many people he has encountered in his home in the Mission District of San Francisco to explore what \"good news of God\" might mean for our particular time and place. He seeks to answer the central question:\"How can we be about making a life in the way of Jesus?\" Soul Graffiti is a simple and lyrical exploration of the essential message of Jesus as it relates to the experiences of contemporary spiritual seekers. He integrates theological insight with awareness of human psychology, culture, and daily life. Written to appeal to the sensibilities of those who inhabit a post-Christendom milieu, Mark Scandrette's deepest hope is to give readers greater motivation for, and a fuller sense of what it means to make a life in, the way of Jesus.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Delaying the Real World: A Twentysomething's Guide to Seeking Adventure",
        "Authors": "By Kinder, Colleen",
        "Description": "Congratulations - you've finished school. But if you're not sure you're ready to settle down into an office environment, Delaying the Real World is chock-full of creative ideas and practical information that will help you craft your own life-changing adventure: Teach English in Thailand; Take a road trip; Build houses in a Mexican village; Counsel at a children's art camp; Work on a cruise ship; Lead excursions in the Grand Canyon; Intern at a wildlife sanctuary; Bike (or drive) across America; Guide snorkeling groups in Australia; Hike along the Pacific Trail; Create (and fund) your own service project; Travel around the globe on one affordable plane ticket; And much more! In this one-of-a-kind guide, Colleen Kinder scouts out experiences that will not only satisfy your free spirit but also pay the bills, make the world a better place, and maybe even catapult you into a future career. Including stories from young adventurers and detailed information on making these dreams a reality,Delaying the Real World is a road map for the new graduate, inspiring and directing you toward making your twenties the most rewarding (and adventurous) decade of your life.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Age of American Unreason",
        "Authors": "By Jacoby, Susan",
        "Description": "Combining historical analysis with contemporary observation, Susan Jacoby dissects a new American cultural phenomenon--one that is at odds with our heritage of Enlightenment reason and with modern, secular knowledge and science. With mordant wit, she surveys an anti-rationalist landscape extending from pop culture to a pseudo-intellectual universe of \"junk thought.\"  Disdain for logic and evidence defines a pervasive malaise fostered by the mass media, triumphalist religious fundamentalism, mediocre public education, a dearth of fair-minded public intellectuals on the right and the left, and, above all, a lazy and credulous public.Jacoby offers an unsparing indictment of the American addiction to infotainment--from television to the Web--and cites this toxic dependency as the major element distinguishing our current age of unreason from earlier outbreaks of American anti-intellectualism and anti-rationalism.  With reading on the decline and scientific and historical illiteracy on the rise, an increasingly ignorant public square is dominated by debased media-driven language and received opinion.At this critical political juncture, nothing could be more important than recognizing the \"overarching crisis of memory and knowledge\" described in this impassioned, tough-minded book, which challenges Americans to face the painful truth about what the flights from reason has cost us as individuals and as a nation.",
        "Category": " Psychology , Social Psychology",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Grandma and Me: A Lift-the-Flap Book (Karen Katz Lift-the-Flap Books)",
        "Authors": "By Katz, Karen",
        "Description": "Everyone is excited when Grandma comes for a visit, in a special tribute to grandmothers and their bond with their grandchildren that includes numerous lift-the-flaps, bold illustrations, and simple text.",
        "Category": " Juvenile Fiction , Family , Multigenerational",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Carl Faberge: Goldsmith to the Imperial Court of Russia",
        "Authors": "By Snowman, A. Kenneth",
        "Description": "From intricate jewelry to the imperial Easter eggs created for the Russian czars, a lavish volume contains hundreds of examples of Carl Faberge's artistry, offering insight into his works, studios, and supporters.",
        "Category": " Art , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "The Bishop's Daughter: A Memoir",
        "Authors": "By Moore, Honor",
        "Description": "Paul Moore's vocation as an Episcopal priest took him—with his wife Jenny and a family that grew to nine children—from robber-baron wealth to work among the urban poor of postwar America, prominence as an activist bishop in Washington during the Johnson years, leadership in the civil rights and peace movements, and two decades as the bishop of New York. The Bishop's Daughter is a daughter's story of that complex, visionary man: a chronicle of her turbulent relationship with a father who struggled privately with his sexuality while she openly explored hers, and a searching account of the consequences of sexual secrets. With a depth of questioning that recalls James Carroll's An American Requiem, this memoir engages the reader in the great issues of American life: war, race, family, sexuality, and faith.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Judgment of Paris: The Revolutionary Decade That Gave the World Impressionism",
        "Authors": "By King, Ross",
        "Description": "With a novelist's skill and the insight of an historian, bestselling author Ross King recalls a seminal period when Paris was the artistic center of the world, and the rivalry between Meissonier and Manet.While the Civil War raged in America, another revolution took shape across the Atlantic, in the studios of Paris: The artists who would make Impressionism the most popular art form in history were showing their first paintings amidst scorn and derision from the French artistic establishment. Indeed, no artistic movement has ever been quite so controversial. The drama of its birth, played out on canvas and against the backdrop of the Franco-Prussian War and the Commune, would at times resemble a battlefield; and as Ross King reveals, it would reorder both history and culture, and resonate around the world.",
        "Category": " Art , History , General",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "China, Inc.: How the Rise of the Next Superpower Challenges America and the World",
        "Authors": "By Fishman, Ted C.",
        "Description": "China today is visible everywhere -- in the news, in the economic pressures battering america, in the workplace, and in every trip to the store. provocative, timely, and essential, this dramatic account of china's growing dominance as an industrial super-power by journalist Ted C. Fishman explains how the profound shift in the global economic order has occurred -- and why it already affects us all.How has an enormous country once hobbled by poverty and Communist ideology come to be the supercharged center of global capitalism? What does it mean that China now grows three times faster than the United States? That China uses 40 percent of the world's concrete and 25 percent of its steel? What is the global impact of 300 million rural Chinese walking off their farms and heading to the cities in the greatest migration in human history? Why do nearly all of the world's biggest companies now have large-scale operations in China? What does the corporate march into China mean for workers left behind in America, Europe, and the rest of the world?Meanwhile, what makes China's emerging corporations so dangerously competitive? What could happen when China will be able to manufacture nearly everything -- computers, cars, jumbo jets, and pharmaceuticals -- that the United States and Europe can, at perhaps half the cost? How do these developments reach around the world and straight into the lives of all Americans?These are ground-shaking questions, and China, Inc. provides answers.Veteran journalist and former commodities trader Ted C. Fishman paints a vivid picture of the megatrends radiating out of China. Fishman's account begins with the burgeoning output of China's vast low-cost factories and the swelling appetite of its 1.3 billion consumers, both of which are being driven by historically unprecedented infusions of foreign capital and technological know-how. Traveling through China's frenetic landscape of growth, Fishman visits the factories, markets, streets, stores, towns, and cities where the story of Chinese capitalism is being lived by one-fifth of all humanity. Fishman also draws on interviews with Chinese, American, and European workers, managers, and executives to show how China will force all of us to make big changes in how we think about ourselves as consumers, workers, citizens, and even as parents. The result is a richly engaging work of penetrating, up-to-the-minute reportage and brilliant analysis that will forever change how readers think about America's future.",
        "Category": " Business & Economics , Foreign Exchange",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "The Secular Conscience: Why Belief Belongs in Public Life",
        "Authors": "By Dacey, Austin",
        "Description": "From Washington to the Vatican to Tehran, religion is a public matter as never before, and secular values — individual autonomy, pluralism, separation of religion and state, and freedom of conscience — are attacked on all sides and defended by few. The godly claim a monopoly on the language of morality, while secular liberals stand accused of standing for nothing.Secular liberals did not lose their moral compass: they gave it away. For generations, too many have insisted that questions of conscience — religion, ethics, and values — are \"private matters\" that have no place in public debate. Ironically, this ideology hinders them from subjecting religion to due scrutiny when it encroaches on individual rights and from unabashedly advocating their own moral vision in politics for fear of \"imposing\" their beliefs on others.In his incisive new book, philosopher Austin Dacey calls for a bold rethinking of the nature of conscience and its role in public life. Inspired by an earlier liberal tradition that he traces to Spinoza and John Stuart Mill, Dacey urges liberals to lift their self-imposed gag order and defend a renewed secularism based on the objective moral value of conscience.Dacey compares conscience to the press in an open society: it is protected from coercion and control, not because it is private, but because it has a vital role in the public sphere. It is free, but not liberated from shared standards of truth and right. It must come before any and all faiths, for it is what tells us whether or not to believe. In this way, conscience supplies a shared vocabulary for meaningful dialogue in a diverse society, and an ethical lingua franca in which to address the world.",
        "Category": " Religion , Atheism",
        "Publisher": "Prometheus Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Dr. Kimball and Mr. Jefferson: Rediscovering the Founding Fathers of American Architecture",
        "Authors": "By Howard, Hugh",
        "Description": "In 1914, Fiske Kimball made the first of the discoveries that rewrote the story of American architecture. An industrious young scholar with a keen eye, Kimball tracked down important drawings and other documents that revealed an untold tale: Thomas Jefferson had been an architect of great skill. Until Kimball's arrival on the scene, historians had hailed Jefferson as a brilliant statesman - but the design of his beloved home, Monticello, had been attributed to someone else. For nearly a century, his designs for the Virginia Capitol and the University of Virginia had gone unrecognized.Kimball's research revealed Jefferson's central role in inspiring America's first generation of imaginative designers. The earliest practitioners included not only Jefferson but Benjamin Henry Latrobe, Charles Bulfinch, Dr. William Thornton, and Robert Mills, the first American-trained professional architect. Kimball profiled the key figures who transformed the craft of building into the art of architecture, the men who set the aesthetic tone for the young country. From the competitions that invited the public to submit drawings for the nation's Capitol and President's House to the controversies decades later surrounding the erection of the national monuments in Washington, D.C., from the homes of founding fathers in Virginia and Annapolis to the fine Federal mansions of Salem, Massachusetts, and Boston's Beacon Hill, Hugh Howard charts the triumph of Neoclassicism in early American architecture.",
        "Category": " Architecture , History , General",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "From the Hood to the Hill: A Story of Overcoming",
        "Authors": "By Black, Barry C., Ph.D.",
        "Description": "From the Hood to the Hill is Chaplain Black's story of overcoming unpromising beginnings in the ghettos of Baltimore. His travels through uncharted waters exemplify God's power for change. Read his story and discover how you, too, can move toward unprecedented satisfaction through a living faith in God.\"With Barry Black, you don't just hear a sermon, you see the sermon. That sermon is captured vividly in this story of his life. A life shaped by love, humility, confidence, courage, strength, and hope.\" - from theForeword, THOMAS R. CARPER, US Senator\"Barry Black is a leader among leaders. Brilliant and articulate, yet humble and approachable, he is a force for integrity, goodness, and compassion on Capitol Hill . . . this narrative,From the Hood to the Hill, is a fascinating read.\" - DR. RICK WARREN,Best-Selling Author,The Purpose Driven Life, and Pastor, Saddleback Church, Lake Forest, CA\"Chaplain Barry Black embodies the best of the American Spirit and the Christian tradition-a man of great erudition who has never forgotten hishumble roots; a man of great faith who remains open to all the wisdom of all people; a man of great seriousness who knows how to laugh. The Senate and the country are grateful for his service.\" - BARRACK OBAMA,US Senator\"From a wonderfully unique man comes a powerfully unique story. Barry Black is a testimony to God's faithfulness and grace.\" - MAX LUCADO,Pastor, Oak Hills Church, San Antonio, TX\"This is an inspiring autobiography by an outstanding man of God, a great leader, a powerful preacher, and a true patriot . . . Barry Black is my cherished friend. I'm honored that he succeeded me as Chaplain of the United States Senate.From the Hood to the Hill is a stirring and power-packed book of the way God uses whom He chooses.\" - DR. LLOYD J. OGILVIE,Former US Senate Chaplain",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "English Springer Spaniels (Complete Pet Owner's Manual)",
        "Authors": "By Earle-Bridges, Michele (ILT) and Ditto, Tanya B.",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "PETS: EYE OPENERS",
        "Authors": "By Kendersley",
        "Description": "Introduces a variety of pets, including dogs, cats, goldfish, and hamsters",
        "Category": "",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Stand the Storm: A Novel",
        "Authors": "By Clarke, Breena",
        "Description": "Even after Sewing Annie Coats and her son, Gabriel, have managed to buy their freedom, their days are marked by struggle and sacrifice - to the extent that Annie sometimes secretly recalls with a perverse nostalgia times spent back on the plantation.Washington's Georgetown neighborhood, where the Coatses are seeking to build their new lives - with Gabriel, a tailor, producing uniforms for soldiers and fine suits for pompous politicians, and Annie, a seamstress and laundress, catering to the nearby brothels and stately homes - is understood to be a safe haven, a \"promised land\" for former slaves, but is effectively a frontier town, gritty and dangerous, with no laws protecting black people.Through fortitude, luck, and abundant hard work, the Coats family grows and prospers, only to find its status compromised anew when the District of Columbia's emancipation efforts put Gabriel's three young daughters (each of them born free of free parents) at risk of becoming the property of the Coatses' former master.The remarkable emotional energy with which the Coatses surmount the obstacles they face - as they negotiate with their former owner, as they assist other former slaves en route to freedom, as they prepare for the encroaching war, and as they struggle to love one another enough - is what fuels this novel and makes its startling denouement so powerfully affecting.",
        "Category": " Fiction , Historical",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Amazing Science Experiments With Everyday Materials",
        "Authors": "By Churchill, E. Richard and Zweifel, Frances W. (ILT)",
        "Description": "\"Over 60 simple experiments...illustrate seven groups of physical principles....Illustrated by charming drawings, each activity lists equipment needed, procedures, what happens, why, and what now....Interesting enough to intrigue any age, particularly 7-12.\"--Science Books & Films.",
        "Category": " Science , General",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "The Dragon's Scales (Step-Into-Reading, Step 3)",
        "Authors": "By Albee, Sarah, Willson, Sarah, and Manders, John (ILT)",
        "Description": "When a hot-tempered dragon seizes the local bridge, the people of Berryville are cut off from their supply of beloved strawberries until they can correctly answer three questions related to weight. The grownups of the town are stumped, but one very smart little girl saves the day with some facts she learned in school.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Secret Things of God: Unlocking the Treasures Reserved for You",
        "Authors": "By Cloud, Henry",
        "Description": "A positive Christian alternative to the bestselling The Secret, this book reveals the \"secret things of God\" -- secrets about God, about happiness, about relationships, and about your purpose. These tested spiritual truths reveal principles that make life work.   With millions of copies of The Secret in print, countless readers are left wondering how its teachings fi t with the truths found in Scripture. Though many teachings in The Secret may have shocked those of the Christian faith, believers have also been reminded of the deep spiritual hunger that exists in all of us -- the desire for a power beyond the human to work change in our individual lives.   Even Christians who know and claim biblical truths often don't know how to use them. Author Dr. Henry Cloud shows readers how to unlock the treasure of these truths and ignite their power in their lives.   There is, indeed, a powerful attraction at work in the universe, but rather than being between an impersonal universe and our own thoughts, this attraction is between the personal Creator of the universe and the creation he loves.",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Starving Jesus: Off the Pew, Into the World",
        "Authors": "By Gross, Craig and Mahon, J. R.",
        "Description": "I was hungry and you gave me no food, I was thirsty and you gave me no drink … It’s time to STOP STARVING JESUS.In other words it’s time for Christians to get off their comfortable seats near the back of the sanctuary and get out into the world. Authors Craig Gross and JR Mahon challenge fellow Christ-followers to stop talking about being spiritual, and start being spiritual—by rolling up their sleeves and serving a world desperate for the hope Christ offers.You can make a difference.",
        "Category": " Religion , Christian Ministry , Evangelism",
        "Publisher": "David C. Cook",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "A Friendly Dialogue Between an Atheist and a Christian",
        "Authors": "By Palau, Luis and Qizheng, Zhao",
        "Description": "UNDERSTAND CHINA through the eyes of a renowned Chinese diplomat's conversations with Luis Palau, American Evangelist.In A Friendly Dialogue between an Atheist and a Christian, Luis Palau, representing the Christian faith, and Zhao Qizheng, representing atheism, present a composite of recorded dialogues held in China in 2005 between them.Through these dialogues, readers are provided insight into the current struggles atheists have regarding the truth claims of the Christian faith.Topics discussed include philosophy, history, religion, the Bible, creation, atheism, Confucianism, politics, ethics, Chinese and Western cultures, and the relevance of Jesus Christ to society.Through the engaging dialogue between Luis Palau and Zhao Qizheng, many of the stereotypes and misinformation concerning the Chinese culture are exposed, revealing a nation in which the Bible is published and new churches are being built. By avoiding the use of complicated theological language, these discussions express the concerns of both Christians and atheists in a clear, meaningful, and respectful way.A Friendly Dialogue between an Atheist and a Christian is a must read for anyone interested in gaining a greater appreciation of the oriental world of China and how the Christian faith is being received within that context.",
        "Category": " Religion , Atheism",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Dark Horse: A Political Thriller",
        "Authors": "By Reed, Ralph",
        "Description": "At the Democratic National Convention in Chicago, California governor Robert Long got robbed.It's a tight race between Long and Senator Salmon Stanley for the Democratic nomination for president. When Stanley triumphs, Long's delegates walk out, the media has a field day, and Long and his team -- including ace political strategist Jay Noble -- pack their bags and go home, knowing that whether Stanley fought fair or not, it's the end of the line.Unless...Would Long consider running as an independent? Independent campaigns of the past, such as those of Ross Perot and Ralph Nader, have been more gesture than genuine threat -- but how might the Internet and modern communications technology change that? And are the American people so disgusted at the partisanship and gridlock of the two-party system -- in particular, is the right wing so fed up with the Republican Party -- that they would vote for an independent? Would Long even be able to get on the ballot in all fifty states?A lively cast of characters struggles with issues of their own:? Michael Kaplan, Senator Stanley's consigliere and alter ego, is a shrewd and ruthless campaigner -- but this time, has he gone too far? Can he avoid being indicted as scandal consumes the campaign?? Harrison Flaherty is the incumbent vice president and the Republican nominee for president. He is confident of victory, but there remain major obstacles to his inauguration -- some that he is aware of, some that he cannot foresee...and some that can kill.? Dr. A ndrew S tanton is a mega-church pastor and religious broadcaster whose millions of listeners (and their financial support) give him great influence in Washington. Vice President Flaherty wants and expects Stanton's support...but will Flaherty get it?? Rassem el Zafarshan is in the United States with a band of terrorists, unlimited financing, and only one goal: to create an act of terrorism so horrific that it will make Americans forget about September 11, 2001 -- and bring about war between the United States and Iran. And in this election year, he knows just how to do it.? Claire L ong, the wife of the governor, wants revenge against her husband's enemies, so she supports his presidential candidacy without question. But she has just one slight problem...? Jay Noble has met a beautiful young woman who loves him, and he gets a second shot at winning a presidential campaign, one more chance to go out on top. But as the campaign grinds on, he has to wonder: Did he pick the right horse? And is the woman just too good to be true?Author Ralph Reed's many years of political involvement at the highest levels have prepared him to identify and portray in fiction some of the most glaring problems in our current political system -- and to tell that story with characters so true to life that they could well be subjects of a news story.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    }
]