[
    {
        "Title": "Secret Strength: For Those Who Search",
        "Authors": "By Tada, Joni Eareckson",
        "Description": "Do you want to know a secret?What's so secret about God? Nothing. And yet everything.Scripture tells us, \"the secret things belong to the Lord our God.\" God has secrets. Some to keep, and some to tell. And who doesn't want to know a secret?Most of us are filled with an incurable urge to discover secrets, to walk the higher and hidden roads. And it is our God, our wonderfully mysterious God, who has placed that yearning within us. He is the treasure we seek...the precious gem to be mined.So take the time to spend these one hundred concise, life-changing appointments with him. And discover incredible handholds of refreshment, courage, and endurance you can cling to inSecret Strength.From the Trade Paperback edition.",
        "Category": " Religion , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "The Borgias (English and French Edition)",
        "Authors": "By Cloulas, Ivan",
        "Description": "Traces the lives of the famous Italian family, discusses their influence in religion and politics, and looks at period in which they lived",
        "Category": " History , General",
        "Publisher": "Franklin Watts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Mrs. Pargeter's Pound of Flesh: A Mrs. Pargeter Mystery",
        "Authors": "By Brett, Simon",
        "Description": "Mrs. Pargeter doesn't much like diets. She never felt any need to change her own pleasingly ample figure, but she's happy enough to accompany her slimming-obsessed friend Kim Thurrock for a few days' stay at the exclusive Brotherton Hall health spa.There's one condition, however. Mrs. Pargeter must receive a special \"allergy treatment\" featuring the choice delicacies of a cordon bleu chef and an excellent wine list. Suitably assured of rich food and drink, she relaxes and looks forward to a luxurious rest.Until ... she sees two men wheeling away a young girl's body.Never one to let a murder go unsolved, Mrs. Pargeter sets off on a dangerous trail of inquiry through the pretensions and occasional charlatanism of the health-and-fitness game. It's a trail that brings her up against many of her late husband's \"business associates\" - among them, the lugubrious private eye Truffler Mason, journalist Ellie Fenchurch, Brotherton Hall's manager \"Ankle-Deep\" Arkwright, surgical specialist \"Jack the Knife,\" and the enigmatic Stan the Stapler.But can she trust them all, or were some involved in the notorious betrayal of the late Mr. Pargeter summed up in the one ominous word \"Streatham\"?In typically unflappable style, Mrs. Pargeter rides through the investigation - from Brotherton Hall to London's King's Cross, through Cambridge University to a Dead Sea mud bath - in search of the villain. Justice will prevail. One way or another, Mrs. Pargeter will get her pound of flesh.The fourth excursion for this irrepressible widow, Mrs. Pargeter's Pound of Flesh is bound to bring even more enthusiastic fans to Simon Brett's masterly series of mysteries.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "The Best American Poetry 1995",
        "Authors": "By Lehman, David (EDT)",
        "Description": "The Best American Poetry 1995 once again highlights the dazzling spectrum of style and subject matter to be found in the art today. Guest editor Richard Howard's accent is on discovery and surprise, and he has gleaned the most inventive and searching writing from a wide variety of literary journals. The themes and imagery here are indisputably \"American,\" as our best poets continue to mine personal as well as communal experience for their work. Now in its eighth year, this series has established itself as a rich and vibrant source of new poetry -- celebrated in bookstores and on college campuses. Welcome, once again, the memorable voices and unique pleasures of Best American Poetry.  Featuring:  Margaret Atwood  Sally Ball  Catherine Bowman  Stephanie Brown  Lewis Buzbee  Cathleen Calbert  Rafael Campo  William Carpenter  Nicholas Christopher  Jane Cooper  James Cummins  Olena Kalytiak Davis  Lynn Emanuel  Elaine Equi  Irving Feldman  Donald Finkel  Aaron Fogel  Richard Frost  Allen Ginsberg  Peter Gizzi  Jody Gladding  Elton Glaser  Albert Goldbarth  Beckian Fritz Goldberg  Laurence Goldstein  Barbara Guest  Marilyn Hacker  Judith Hall  Anthony Hecht  Edward Hirsch  Janet Holmes  Andrew Hudgins  T.R. Hummer  Brigit Pegeen Kelly  Karl Kirchwey  Carolyn Kizer  Wayne Koestenbaum  John Koethe  Yusef Komunyakaa  Maxine Kumin  Lisa Lewis  Rachel Loden  Robert Hill Long  James Longenbach  Gail Mazur  J. D. McClatchy  Heather McHugh  Susan Musgrave  Charles North  Geoffrey O'Brien  Jacqueline Osherow  Molly Peacock  Carl Phillips  Marie Ponsot  Bin Ramke  Katrina Roberts  Michael J. Rosen  Kay Ryan  Mary Jo Salter  Tony Sanders  Stephen Sandy  Grace Schulman  Robyn Selman  Alan Shapiro  Reginald Shepherd  Anglea Sorby  Laurel Trivelpiece  Paul Violi  Arthur Vogelsang  David Wagoner  Charles H. Webb  Ed Webster  David Wojahn  Jay Wright  Stephen Yenser",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "My Brother, Lyndon",
        "Authors": "By Sam Houston Johnson",
        "Description": "",
        "Category": "",
        "Publisher": "Cowles Book Company",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The Cereal Murders: A Culinary Mystery",
        "Authors": "By Davidson, Diane Mott",
        "Description": "The caterer for Elk Park Preparatory School's College Advisory Dinner, Goldy Bear discovers that the real main course for the evening is murder, in a work that includes recipes for Goldy's original creations.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "6.49",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Fireside Treasury of Light",
        "Authors": "By Kelly, Mary Olsen",
        "Description": "An anthology of New Age literature, with essays on healing and alternative medicine, shamanism and native traditions, channels and psychics, and more",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Domesticity: A Gastronomic Interpretation of Love",
        "Authors": "By Shacochis, Bob",
        "Description": "The author of Easy in the Islands and The Next New World presents a volume about love and food containing two hundred delicious recipes by a chef well versed in the relationship of food to love.",
        "Category": " Cooking , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "How to Be Your Own Best Friend: A Conversation With Two Psychoanalysts",
        "Authors": "By Newman, Mildred",
        "Description": "\"Sensible advice on how to give up childhood, accept yourself and your own maturity and deal with life on your own two feet.\"DALLAS TIMES HERALDIn this unique, bestselling question-and- answer guide to self-love and acceptance, two practicing psychologists (who are also married to one another) reveal the secret of pursuing happiness, by revealing to ourselves what we think we are striving for, and what it is that keeps us from achieving our goals.",
        "Category": " Self-help , Affirmations",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1973"
        }
    },
    {
        "Title": "Taking Sides: Clashing Views on Controversial Psychological Issues",
        "Authors": "By Slife, Brent (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Dushkin Pub Group",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Contemporary Business",
        "Authors": "By Boone, Louis E.",
        "Description": "",
        "Category": "",
        "Publisher": "Dryden Press",
        "Price Starting With ($)": "7.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Burpee American Gardening Series: Vegetables",
        "Authors": "By Burpee",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Blinded By The Light: New Theories About the Sun and the Search for Dark Matter",
        "Authors": "By Gribbin, John R.",
        "Description": "Gribbin, author of  In search of Schrodinger's cat , a popular introduction to quantum physics, here turns his attention to recent findings in solar research, including the sun's role in the search for the missing \"cold dark matter\" in the universe. For a wide audience. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Science , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Magistrate",
        "Authors": "By Gann, Ernest K.",
        "Description": "Follows the legal career of the Honorable Julian Hickock, a judge torn by the conflicting laws, overcrowded prisons, and moral conflict of his profession and threatened because of his belief in justice and the integrity of the law",
        "Category": " Fiction , General",
        "Publisher": "Arbor House Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1982"
        }
    },
    {
        "Title": "Raggedy Ann and Andy in The Tunnel Of Lost Toys",
        "Authors": "By Catharine Bushnell",
        "Description": "",
        "Category": "",
        "Publisher": "Bobbs-Merrill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Some Great Thing",
        "Authors": "By McAdam, Colin",
        "Description": "Jerry McGuinty is a simple, self-made builder who claims he can plaster a wall that will change your life. Simon Struthers is a disaffected businessman who proves the old adage about money and happiness. Together they face the new Ottawa of the seventies: brash, bright, and ready for the taking. With their different careers and successes, these two strangers seek to carve out their own happiness-Jerry with his new wife, Simon with his endless affairs and intrigues. But love can be suffocated by the drive to succeed, and individuals crushed by greed and progress. Only when both men realize what they have to lose will their lives finally intersect and the story spiral to its astonishing conclusion",
        "Category": " Fiction , Literary",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Picking Your Battles: Winning Strategies for Raising Well-Behaved Kids",
        "Authors": "By Maslin, Bonnie",
        "Description": "How often as parents do we promise ourselves that we won't \"sweat the small stuff\" when it comes to our kids? And how often does our concern--or our tight schedules--make us do exactly that? In a non-judgemental voice that speaks to parents everywhere, the author shows how to avoid \"no-win\" discipline styles and instead set limits, develop a child's sense of self-discipline, and use anger positively to survive the hassles and headaches of everyday life. With a unique and effective combination of authority and accessibility, Maslin gives parents both the big picture on understanding their child and step-by-step solutions to those inevitable battles they will face. How often as parents do we promise ourselves that we won't \"sweat the small stuff\" when it comes to our kids? And how often does our concern--or our tight schedules--make us do exactly that? In a non-judgemental voice that speaks to parents everywhere, the author shows how to avoid \"no-win\" discipline styles and instead set limits, develop a child's sense of self-discipline, and use anger positively to survive the hassles and headaches of everyday life. With a unique and effective combination of authority and accessibility, Maslin gives parents both the big picture on understanding their child and step-by-step solutions to those inevitable battles they will face.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Rise and Decline of the Asian Century: False Starts on the Path to the Global Millennium",
        "Authors": "By Lingle, Christopher",
        "Description": "",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Bookworld Services",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Colors of New York",
        "Authors": "By Dailey, Donna",
        "Description": "",
        "Category": " Travel , Pictorials",
        "Publisher": "Thunder Bay Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Ace in the Hole",
        "Authors": "By Gregory, Jackson",
        "Description": "",
        "Category": " Fiction , Westerns",
        "Publisher": "Thorndike Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Natural Garden",
        "Authors": "By Druse, Ken",
        "Description": "How to create a garden that practically takes care of itself and harmonizes with nature, presented with more than 400 gorgeous photographs taken all over the United States. More than 400 full-color photographs, 15 line drawings.",
        "Category": " Gardening , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "7.34",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "San Francisco & Northern California (EYEWITNESS TRAVEL GUIDE)",
        "Authors": "By Williams, Linda (EDT) and Jensen, Jamie (EDT)",
        "Description": "Describes the highlights of each part of the city, recommends hotels, shops, restaurants, and art galleries, and offers a brief look at the city's history.",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "DK Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "A Time for Truth",
        "Authors": "By Simon, William E.",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The World of Time Inc.: The Intimate History of a Changing Enterprise : 1960-1980: 3",
        "Authors": "By Prendergast, Curtis",
        "Description": "A look at the recent corporate history of Time covers the important political events, the creation of new magazines, and involvement in film and book production",
        "Category": " History , General",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "9.77",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Fire And Maneuver (Able Team)",
        "Authors": "By Stivers, Dick",
        "Description": "Fire And Maneuver by Dick Stivers released on Feb 22, 1985 is available now for purchase.",
        "Category": " Fiction , Westerns",
        "Publisher": "Gold Eagle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "The Unburied",
        "Authors": "By Palliser, Charles",
        "Description": "A riveting historical murder-mystery by the bestselling author of The Quincunx.There are three separate tales interwoven in this novel-three tales that could be called ghost stories, for their mysteries can never be resolved, the victims and the perpetrators never laid to rest.Dr. Courtine, an unworldly academic, is invited to spend the days before Christmas with an old friend. Twenty years have passed since Courtine and Austin last met, and the invitation to Austin's home in the cathedral close of Thurchester is a welcome one. When Courtine arrives, Austin tells him a tale of deadly rivalry and murder two centuries old. The mystery captures Courtine's donnish imagination, as it is intended to do.Courtine also plans to pursue his research into another unresolved and older mystery in the labyrinthine cathedral library. If he can track down an elusive eleventh-century manuscript, he hopes to dispose of a deadly rival of his own. Doubly distracted, Courtine becomes unwittingly enmeshed in the sequence of terrible events that follows his arrival, and he becomes witness to a murder that seems never to have been committed.",
        "Category": " Fiction , Ghost",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Practical Astronomer",
        "Authors": "By Ronan, Colin A",
        "Description": "An introduction to astronomy discusses the stars, moon, planets, comets, meteors, gravity nebulae, deep space, and many other aspects of practical and theoretical astronomy",
        "Category": " Science , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "The Writer's Digest Guide to Manuscript Formats",
        "Authors": "By Buchman, Dian Dincin and Groves, Seli",
        "Description": "Explains how to prepare a manuscript for submission, and shows sample proposals, query letters, curriculum vitae, title pages, tables of contents, forewords, glossaries, articles, and screenplays",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Abracadaver: A Father Dowling Mystery",
        "Authors": "By McInerny, Ralph M.",
        "Description": "A magic trick during a show a the St. Hilary's parish center uses a ring with an inscription memorable to Father Dowling, an item that figures largely in a subsequent murder investigation",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Come to Grief",
        "Authors": "By Francis, Dick",
        "Description": "After constant requests from fans to bring back Sid Halley, the champion jockey turned investigator of Odds Against and the breakout thriller Whip Hand, Dick Francis does just that in his new novel. Although more than a decade has passed since the publication of Whip Hand, little time has elapsed in Sid Halley's life. Still in his mid-thirties, he remains troubled, courageous, unwilling to admit defeat to disabling injury or corruption. Now, though, Sid faces nineties dilemmas and hazards even more serious than those he once faced in horse racing, the passion that cost him his hand, and \"the only sport so dangerous that ambulances follow the athletes from start to finish\" (The Philadelphia Inquirer).\"I had this friend that everyone loved,\" Halley says, \"and I put him on trial.... I grieved for the loss of a friendship, for a man who still looked the same but was different, alien...despicable. I could much more easily have grieved for him dead.\"Having exposed an adored racing figure as a monster, Sid must testify at the man's trial. But the morning of his appearance, a tragic suicide shatters the proceedings and jars Halley's conscience. Plagued by regret and the suspicion that there's more to the death than has yet come to light, he is catapulted into days of hard, rational investigation, heart-searching torments, and the gravest of perils. Business as usual for Sid...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "A+ Certification Training Guide (The Training Guide Series)",
        "Authors": "By Brooks, Charles J.",
        "Description": "",
        "Category": " Computers , Computer Science",
        "Publisher": "New Riders Pub",
        "Price Starting With ($)": "7.7",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "How to Benefit from Stress",
        "Authors": "By Tauraso, Nicola Michael",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Hidden Valley Press",
        "Price Starting With ($)": "6.69",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "The struggle for democracy",
        "Authors": "By Barber, Benjamin R",
        "Description": "This companion to the PBS-television series charts humankind's efforts through the ages to establish and maintain stable democratic institutions",
        "Category": "",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "A World of Ideas II",
        "Authors": "By Moyers, Bill D. and Tucher, Andie (EDT)",
        "Description": "Presents interviews with luminaries such as Archbishop Desmond Tutu, poet Robert Bly, and novelist Toni Morrison",
        "Category": " History , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "8.78",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Disappearing Acts",
        "Authors": "By McMillan, Terry",
        "Description": "When Franklin, a young construction worker, meets Zora, a struggling singer from Ohio, neither is certain they can make the sacrifices and commitments needed to build love",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Modern French Masters the Impressionists",
        "Authors": "By Fabbri, Fratelli",
        "Description": "",
        "Category": "",
        "Publisher": "Mccall Publ. Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Whose Rose Garden is it Anyway?",
        "Authors": "By Buchwald, Art and Mendelson, Steve (ILT)",
        "Description": "The political humorist's twenty-seventh collection of syndicated columns levels its sights at the end of the Reagan Administration, the advent of George Bush, the telephone company, and airline agents",
        "Category": " Humor , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "The New Market Leaders: Who's Winning and How in the Battle for Customers",
        "Authors": "By Wiersema, Fred",
        "Description": "In the decade since Fred Wiersema coauthored the #1 bestseller The Discipline of Market Leaders, a momentous shift has occured. We have entered an age of customer scarcity--an age in which exciting, often unorthodox companies are revolutionizing the global marketplace. In this path-cutting work, Wiersema provides new benchmarks for ranking businesses in this new economy and reveals the strategies that set winning companies apart.  After tracking 5,000 companies worldwide for over six years, Wiersema discovered that just a few hundred of these of these exert tremendous influence on the new economy. Here, he explains why traditional measures of competitive prowess no longer apply and, using new yardsticks, identifies today's 100 most influential businesses. With practical strategies for managers and investors, Wiersema then shows how to recognize and emulate these dynamic new market leaders.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "I'm Listening: The Butter Busters Cookbook Companion",
        "Authors": "By Mycoskie, Pam",
        "Description": "Offering health-conscious readers a supplement to her famous cookbook,  The Butter Busters, the author includes information on new products, a name brand shopping guide, exercise and weight-loss strategies, a restaurant eating guide, and more. Original.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "7.28",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Being human: The psychological experience",
        "Authors": "By McNeil, Elton B",
        "Description": "",
        "Category": "",
        "Publisher": "Canfield Press",
        "Price Starting With ($)": "5.02",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Goren's Bridge Complete",
        "Authors": "By Charles Henry Goren, Omar Sharif",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Zapp!: The Lightning of Empowerment",
        "Authors": "By Cox, Jeff and Byham, William C.",
        "Description": "A contemporary fable of corporate life shows how empowering workers with responsibility helps build strong, enthusiastic employees and organization",
        "Category": " Business & Economics , Motivational",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Kennedys: An American Drama",
        "Authors": "By Collier, Peter and Horowitz, David",
        "Description": "Tells the complete story of the triumphs and failures of the Kennedy family, a chronicle that encompasses the major events of the second half of this century",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "A Marriage Sabbatical",
        "Authors": "By Shalom, Sabina",
        "Description": "The author describes her backpacking trip around the world, which gave her a new perspective on her marriage and her life",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "Dodd, Mead",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Rodale's Book of Hints, Tips & Everyday Wisdom",
        "Authors": "By Hupping, Carol",
        "Description": "Gathers practical information about cooking, cleaning, home maintenance, energy conservation, banking, investments, gardening, car maintenance, fitness, and health care",
        "Category": " House & Home , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Jim Palmer's Way to Fitness",
        "Authors": "By Palmer, Jim",
        "Description": "The award-winning pitcher and sportscaster's lifetime program for staying in shape includes nutrition information, exercise and workout routines, and advice on grooming and skin and hair care",
        "Category": " Medical , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "The Case of the Murdered MacKenzie",
        "Authors": "By Cunningham, E. V.",
        "Description": "Supersleuth Masao Masuto searches for the identity of a corpse discovered in a Beverly Hills bathtub and finds himself the target of a vicious killer",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "The Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "The Wellness Encyclopedia: The Comprehensive Family Resource for Safeguarding Health and Preventing Illness",
        "Authors": "By University of California, Berkeley, Wellness Letter (COR)",
        "Description": "From the editors of the University of California, Berkeley  Wellness letter , the foremost popular health publication in the US, comes this home reference which sorts out misconceptions about diet and exercise, reports on the most effective ways of coping with stress, explains the link between lifestyle and staying well, and explores healthcare alternatives. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Medical , General",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "8.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Release 2.0",
        "Authors": "By Dyson, Esther",
        "Description": "In a book scheduled to be published simultaneously by a dozen publishers around the world, an influential technology analyst offers a visionary study of the social and global issues raised by the burgeoning Internet. 150,000 first printing. $150,000 ad/promo.",
        "Category": " Computers , Computer Science",
        "Publisher": "Broadway",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Empowered Manager: Positive Political Skills at Work (The Jossey-Bass Management Series)",
        "Authors": "By Block, Peter",
        "Description": "This is one of the most useful and clearly written books on the leading edge of management that I have read.--Warren BennisPeter Block, the author of the classic Flawless Consulting, is a true visionary. And here he turns his sights on management. Managers and other employees who feel powerless to control their own destinies, who feel stifled by bureaucracy, who feel sapped of creativity--will feel invigorated by Block's legAndary insight.Offers practical advice to help your managers:* Empower themselves to help shape the organization* Develop positive political skills in their dealings with all levels of employees* Take responsibility for their own actions* Negotiate with their allies and adversaries* Face failure courageously...and much more!Block presents ways to treat all members of the organization as entrepreneurs so that employees feel that their units are their own businesses and that they, and they alone, are in the process of creating an organization of their own choosing. Managers and other employees who pick up The Empowered Manager won't just be reading about management. They'll be harvesting timeless tips from a master of business thinking. And they'll be uncovering a road map that leads to enhanced effectiveness and job satisfaction.This is a liberating book that cuts through our rationalizations and self-deceptions to help us think about both work and life from a new perspective.--Geoff Bellman, author of The Consultant's CallingHelp your managers become more confident, contributing members of your organization with guidance from a famed consultant. This guide is a perfect addition to your management and leadership development programs.Winner of the Society for Human Resource Management (SHRM) Book Award",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "Jossey-Bass Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "The Duchess of Windsor: The Secret Life",
        "Authors": "By Higham, Charles",
        "Description": "Wallis, the Duchess of Windsor, was one of the most famous women in history, the American divorcee who captured the King of England, Edward VIII, and cost him his throne. Until Charles Higham's 1.3 million-copy bestseller, much of her life was a glamorous mystery. Now, fifteen years later, major new documentary evidence, classified at the time, makes for a book far more sensational than the original bestseller. Drawing from long-suppressed archives in France, England, and the United States, Higham has uncovered the duchess's passionate affair with a top-ranking political figure, the duke's romantic involvement with a male equerry, the secret radio broadcasts the couple made to Hitler, and the blackmail plot in Paris that almost brought them - and the British royal family - to ruin.",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "The Gladstone Bag: A Sarah Kelling Mystery",
        "Authors": "By MacLeod, Charlotte",
        "Description": "When detective Sarah Kelling's aunt finds her life in danger on the cozy island inn where she retreated for relaxation, she summons Sarah and her detective-husband Max Bittersohn to track a murderer",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Pr",
        "Price Starting With ($)": "20.85",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Run Around",
        "Authors": "By Freemantle, Brian",
        "Description": "A conference of world leaders in Geneva attracts a Russian assassin, as well as Charlie Muffin, who is determined to prevent the killer from executing his bloody plan",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "The Bean Trees",
        "Authors": "By Kingsolver, Barbara",
        "Description": "Barbara Kingsolver's 1988 debut novel is a classic workof American fiction. Now a standard in college literature classes across thenation, and a book that appears in translation across the globe,The BeanTrees is not only a literary masterpiece but a popular triumph—anarrative that readers worldwide have taken into their hearts. TheLos Angeles Times calls The Bean Trees “the work of a visionary. . . . It leaves you open-mouthed and smiling.”",
        "Category": " Fiction , Literary",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "By Blood Possessed",
        "Authors": "By Santangelo, Elena",
        "Description": "Pat Montella is summoned from her dreary office job in suburban Pennsylvania by an unusual request from a stranger. Ninety-one-year-old Magnolia Shelby wants to bequeath to Pat, in her will, her house and acreage in rural Virginia. The only condition is that Pat must visit during the first week of May in order to learn what this is all about.What she finds is Bell Run, a Civil War-era estate and battleground inhabited by the enigmatic Miss Maggie, a retired history teacher with a passion for the Civil War. And that's not all, for just as Pat begins to get the lay of the land, she finds herself noticing curiously out-of-date details, like the vibrations of bullets hitting old wood, and the smell of campfire coffee and roast pork, and the faraway hissing of a steam engine. Before too long, she has to admit that what she's hearing, seeing, and smelling are the details of an era long past, the sights and sounds of 1863.Pat soon begins to \"see\" enough about these long-ago events to put some of the facts together. But then she learns something extraordinary, and how this knowledge affects Pat and Maggie in 1990s Virginia stirs up some very modern, very real danger.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Which Reminds Me",
        "Authors": "By Randall, Tony and Mindlin, Michael",
        "Description": "The actor and entertainer offers a collection of show business anecdotes from his forty years in television, motion pictures, and the theater, from Broadway to Europe",
        "Category": " Performing Arts , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Blue Corn Murders",
        "Authors": "By Pickard, Nancy and Rich, Virginia",
        "Description": "Mrs. Potter visits the Medicine Wheel Archaeological Camp near Cortez, Colorado, where she hopes to glean the wisdom of the ancients, and see some exciting ruins to boot. There's lots to see at the camp, and treats galore from Bingo, the cook, like Cream Cheese Corn Bread and Uncle Dick's Chicken. But trouble looms when a busload of youngsters disappears without a trace, drawing an eerie connection with the lost Anasazi tribe of so many years before. Then two women at Medicine Wheel end up dead. Are their deaths connected in some way? Who would want to harm them, and why? Mrs. Potter must take matters into her own hands as she investigates, hoping to avert another murder before it's too late.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "More Ribbon Embroidery by Machine",
        "Authors": "By Duncan, Marie and Farrell, Betty",
        "Description": "",
        "Category": " Crafts & Hobbies , Needlework , Embroidery",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "D. H. Lawrence: novelist, poet, prophet",
        "Authors": "By Spender, Stephen (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Westminster Abby (SASS Students Across the Seven Seas)",
        "Authors": "By Ostow, Micol",
        "Description": "Abby has always considered herself to be a little vanilla—sweet,plain, but not very exciting. So when she finds herself flying across the ocean to London, trying to forget her problems with her cheating ex-boyfriend and her overprotective parents, she figures her semester abroad is her chance to become one big hot fudge sundae. And she isn't disappointed. London boasts a plethora of funky pubs and shops, drivers on the wrong side of the street, French fries called chips, and a very charming Brit named Ian. As Abby moves closer to the vision of her wild child self, she realizes that sometimes leaving what you know best actually brings you closer to what you best know—yourself. This S.A.S.S. (Students Across the Seven Seas) novel is one of the first two in our new study abroad fiction series. Teen girls will latch onto these books as they're enmeshed in the lives of characters just like themselves, who are experiencing new cultures, new friendships, and new worlds through study abroad!",
        "Category": " Young Adult Fiction , People & Places , Europe",
        "Publisher": "Speak",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Liberty in Expansion, 1760-1850 (Liberty in America, 1600 to the Present)",
        "Authors": "By Handlin, Oscar and Handlin, Lilian",
        "Description": "Traces the development of the idea of liberty from seventeenth-century America, and discusses the change in its meaning to people from all social levels",
        "Category": " History , United States , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Jesus Is My Special Friend (Happy Days Books)",
        "Authors": "By Boldman, Craig (ILT) and Balika, Susan S.",
        "Description": "",
        "Category": "",
        "Publisher": "Standard Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Arthritis A Comprehensive Guide to Understanding Your Arthritis (Revised Edition)",
        "Authors": "By Fries, James F.",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Roots of War",
        "Authors": "By Barnet, Richard J.",
        "Description": "This investigation of America's preoccupation with war is concerned primarily with the domestic forces that shape United States foreign policy",
        "Category": " History , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1973"
        }
    },
    {
        "Title": "Japan's New Middle Class: The Salary Man and His Family in a Tokyo Suburb, Second edition",
        "Authors": "By Vogel, Ezra F",
        "Description": "",
        "Category": " Social Science , Sociology , General",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Citizen Hughes",
        "Authors": "By Drosnin, Michael and Hughes, Howard",
        "Description": "Presents a selection of more than ten thousand previously unpublished internal documents of the Hughes organization, including three thousand pages of the billionaire's own handwritten memos, which reveal his innermost activities and how he tried to buy t",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "For Such a Time as This: Gospels (Comfort from Meditations)",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Northwestern Pub House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Perfect Man: He's Quiet, He's Sweet, and If He Gives You Any Grief, You Can Bite His    Head Off",
        "Authors": "By Day, Dream Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Day Dream Calendars",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Shadow Man: A Daughter's Search for Her Father",
        "Authors": "By Gordon, Mary",
        "Description": "\"My father died when I was seven years old. I've always thought that was the most important thing anyone could know about me.\" The beloved, lost father - the Shadow Man: in this searing memoir, one of America's finest writers discovers the truth about the man whose romantic image defined her life.But who was David Gordon really? In Mary Gordon's memories of him, he was an erudite and charming man: an intellectual, a writer and publisher, a Harvard dropout and Jazz Age bohemian. But at midlife she began to question these loving memories and to go in search of the man whose presence - and absence - haunted her life. Unburying startling truths, Gordon discovers both a devoted, inventive, and loving father and a person desperate to cover up the underside of the immigrant's encounter with the American dream. As Gordon tracks her father - in the archives, in libraries, in the middle of America - she uncovers lies, despair, madness: a man who lied about many things, including his date and place of birth, his native language, his family, his education. A Jew born in the last years of the nineteenth century, he became a convert to Catholicism and to right-wing politics, a literary critic who was also a pornographer, and a vicious anti-Semite. As a realistic portrait of her father emerges, Mary Gordon reevaluates herself in the light of these painful discoveries about her heritage and past.",
        "Category": " Literary Criticism , General",
        "Publisher": "RANDOM HOUSE",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Mean Business: How I Save Bad Companies and Make Good Companies Great",
        "Authors": "By Adelman, Bob, Andelman, Bob, Mahaney (EDT), and Dunlap, Albert J.",
        "Description": "Al Dunlap is an original: an outspoken, irascible executive with an incredible track record of injecting new life into tired companies. The business media have coined a new verb--\"to dunlap\"--when describing a fast company turnaround. In April 1994 he became CEO and chairman of Scott Paper, which had lost $277 million in 1993, was on credit watch for excessive debt, and whose stock had been comatose for seven years. In a mere nineteen months, Scott had record earnings, the stock had increased in value by $6.5 billion (over 200 percent), and Dunlap merged Scott with Kimberly-Clark in a stock swap that valued Scott at $9 billion and created the second largest consumer-products company in the United States.Mean Business combines Dunlap's colorful personal history--his working-class background, employment, friendship with such people as Sir James Goldsmith and George Soros, his views on why too many executives think of themselves as corporate royalty--and his provocative ideas on management and leadership. His specific, tested program on how to evaluate and choose a management team, get the lowest costs from suppliers, improve the balance sheet, and develop a real strategy make this an invaluable book.The controversy about corporate performance and how to achieve it is near the boiling point, as executives face the hard fact of business life: What is good or even excellent today won't be satisfactory tomorrow. Mean Business is absolutely essential for both companies in trouble as well as those at the top of their game.",
        "Category": " Business & Economics , Management",
        "Publisher": "Crown Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Sides: Over 150 Enticing Accompaniments that Make the Meal",
        "Authors": "By Phillips, Melicia",
        "Description": "A mouth-watering compilation of side dishes to suit any type of meal presents more than 150 delicious accompaniments, from New England Corn and Scallion Pancakes to Wild Rice Crepes with Apple and Chestnuts. 20,000 first printing.",
        "Category": " Cooking , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "12.96",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Ritual Murder",
        "Authors": "By Haymon, S. T.",
        "Description": "Detective Inspector Ben Jurnet investigates the bizarre and horrible murder of a young boy in an English cathedral",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "Circumstances Unknown: A Novel of Suspense",
        "Authors": "By Heckler, Jonellen",
        "Description": "After her husband, Tim, is found dead--the victim, according to police, of an accidental drowning--Deena Reuschel begins to suspect that she and her five-year-old son have become the target of an obsessed madman. 30,000 first printing. $20,000 ad/promo.",
        "Category": " Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "KILLED IN FRINGE TIME: A Matt Cobb Mystery",
        "Authors": "By Deandrea, William L.",
        "Description": "As the clock approached four on a warm Friday afternoon, Matt Cobb, network vice-president in charge of special projects, debated his options. He could bolt from his office in Manhattan for an early start to a long weekend, or continue to toil over the paperwork that had been sitting on his desk for far too long. But as the network's youngest executive, Cobb saw his duty and buried his nose in a heap of spreadsheets. Moments later Richard Bentyne burst into his office and Matt Cobb knew he should have hit the highway.In the late-night talk-show wars, Richard Bentyne is a ruthless samurai whose whopping forty-five-million-dollar contract is shadowed only by the size of his ego. The network brought him on board to battle Letterman and Leno, and he has come to ask Cobb to go to Kennedy International to pick up his secret weapon - the \"mountain man.\"Clement Bates, the ultrawealthy and intensely eccentric mountain hermit, hasn't set foot on civilized soil in thirty-five years and is making his first public appearance on Bentyne's show. America, however, never gets to see Bates's debut. Television's favorite talk-show host has been canceled - forever - and Cobb's newest special project is to find the killer and protect the Network.",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "16.42",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "The Fur Person",
        "Authors": "By Sarton, May",
        "Description": "May Sarton's fictionalized account of her cat Tom Jones's life and adventures prior to making the author's acquaintance begins with a fiercely independent, nameless street cat who follows the ten commandments of the Gentleman Cat—including \"A Gentleman Cat allows no constraint of his person, not even loving constraint.\" But after several years of roaming, Tom has grown tired of his vagabond lifestyle, and he concludes that there might be some appeal after all in giving up the freedom of street life for a loving home. It will take just the right human companion, however, to make his transformation from Cat About Town to genuine Fur Person possible. Sarton's book is one of the most beloved stories ever written about the joys and tribulations inherent in sharing one's life with a cat.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1983"
        }
    },
    {
        "Title": "Shapinsky's Karma, Bogg's Bills: And Other True-Life Tales",
        "Authors": "By Weschler, Lawrence",
        "Description": "",
        "Category": "",
        "Publisher": "North Point Press",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "The Life: Memoirs of a French Hooker",
        "Authors": "By Cordelier Jeanne",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "58.61",
        "Publish Date": {
            "Month": "July",
            "Year": "1978"
        }
    },
    {
        "Title": "The Miami Giant",
        "Authors": "By Sendak, Maurice (ILT) and Yorinks, Arthur",
        "Description": "Leaving Italy to search for China, the great explorer Giuseppe Giaweeni accidentally stumbles across Miami, where he discovers a lost tribe of dancing giants and enjoys a brief stint in show business",
        "Category": "",
        "Publisher": "HarperCollins Children's Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Circle of Steel : Bolan Deals a Blow to the Illicit Arms Trade (Mack Bolan, The Executioner No 115)",
        "Authors": "By Pendleton, Don",
        "Description": "",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Gold Eagle",
        "Price Starting With ($)": "7.17",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Dr. Bob Arnot's Revolutionary Weight Control Program",
        "Authors": "By Arnot, Bob",
        "Description": "The physician and medical television correspondent for Dateline NBC and Today makes use of recent scientific research to outline a comprehensive, effective, drug-free, diet-and-exercise plan for losing weight. Reprint. 50,000 first printing.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Will & Ariel Durant: A Dual Autobiography",
        "Authors": "By Durant, Will",
        "Description": "The Durants discuss their scholarly and personal life together, their enduring love for each other, and the acquaintanceship of almost every major literary and intellectual personality in Europe and America",
        "Category": " History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.16",
        "Publish Date": {
            "Month": "November",
            "Year": "1977"
        }
    },
    {
        "Title": "Interest amortization tables (McGraw-Hill paperbacks)",
        "Authors": "By Estes, Jack C.",
        "Description": "Tables indicate monthly payments for amortizing mortgage loans up to $100,000, reveal monthly, quarterly, semiannual, and annual payments for amortizing a $1000 loan, and give the percentage of the original loan unpaid at the end of specified time periods",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Retirement Places Rated: All You Need to Know to Plan Your Retirement or Select Your Second Home",
        "Authors": "By Savageau, David",
        "Description": "Compares and ranks over one hundred and fifty of the best retirement places in the United States, with information on climate, housing, economics, crime, health care, and leisure activities",
        "Category": "",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "MOTHERS PA",
        "Authors": "By Kenison, Katrina (EDT), Hirsch, Kathleen (EDT), Hirsch, Kathleen (INT), and Kenison, Katrina (INT)",
        "Description": "This remarkable collection of twenty stories about motherhood by writers who are mothers evokes every stage of the journey, from pregnancy and birth through the childhood years, adolescence, and adulthood. Together they depict the complexity of mothering in America today as woman are actually experience it. The works gathered here constitute a step toward a new mothers literature that puts to rest the long-held myth that has separated motherhood from a woman's creativity. In these pages women from all walks of life, single, married, divorced or just out of their teens and well into their eighties, rich and poor, black and white, grapple with the realities of motherhood – sacrifice and boundless joy, self-doubt and miracles of the every day. Whether you are a new mother, a seasoned mother, or a grandmother many times over you will find yourself in this book. Contributors: Mary Grimm, Laurie Colwin, Perri Klass, Kate Braverman, Molly Giles, Mary Gordon, Ronnie Sandroff, Roxana Robinson, Barbara Kingsolver, Marian Thurm, Paula K. Gover, Marsha Lee Berkman, Melissa Pritchard, Jane Shapiro, Julia Whitty, Alice Elliott Dark, J. California Cooper, Sue Miller, Eileen Fitzgerald.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "North Point Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Tom Clancy's Rainbow Six: Rogue Spear & Urban Operations--Prima's Official Strategy Guide",
        "Authors": "By Knight, Michael and Clancy, Tom",
        "Description": "Strategies for new Urban Operations missionsIncludes five classic RAINBOW Six missionsComplete roster of all RAINBOW  team membersTips on base destruction, hostage rescue, and surveillanceDetailed maps for all Rogue Spear and Urban Operations missionsMultiplayer strategies and mapsDetailed weapons and equipment lists",
        "Category": " Games & Activities , Video & Electronic",
        "Publisher": "Prima Games",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Self-Esteem: The New Reformation",
        "Authors": "By Schuller, Robert Harold",
        "Description": "",
        "Category": "",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Celebrate the Season 1998",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": "",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Complete Chicken: A Special Cookbook for Cooking Chicken",
        "Authors": "By Jerome, Carl",
        "Description": "",
        "Category": "",
        "Publisher": "RANDOM HOUSE",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Good Housekeeping Menus for a Whole Year of Dinners With over 700 Recipes and Tips",
        "Authors": "By Good Housekeeping Institute",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1971"
        }
    },
    {
        "Title": "A Zoo For All Seasons: The Smithsonian Animal World",
        "Authors": "By Smithsonian Institution",
        "Description": "Compiles dozens of stories about the animals, keepers, and scientists at the National Zoological Park and its 3,150-acre conservation and research center in Virginia and about their activities and achievements",
        "Category": "",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Stoner & Spaz",
        "Authors": "By Koertge, Ronald",
        "Description": "For sixteen-year-old Ben Bancroft — a kid with cerebral palsy, no parents, and an overprotective grandmother — the closest thing to happiness is hunkering alone in the back of the Rialto Theatre and watching Bride of Frankenstein for the umpteenth time. The last person he wants to run into is drugged-up Colleen Minou, resplendent in ripped tights, neon miniskirt, and an impressive array of tattoos. But when Colleen climbs into the seat beside him and rests a woozy head on his shoulder, Ben has that unmistakable feeling that his life is about to change. With unsparing humor and a keen flair for dialogue, Ron Koertge captures the rare repartee between two lonely teenagers on opposite sides of the social divide. His smart, self-deprecating protagonist learns that kindred spirits may be found for the looking — and that the resolve to follow your passion can be strengthened by something as simple as a human touch.",
        "Category": " Young Adult Fiction , Social Themes , Friendship",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Man Who Loved God",
        "Authors": "By Kienzle, William X.",
        "Description": "After the husband of a woman who is having an affair with four different men is murdered in one of worst neighborhoods in Detroit, Father Zachary Tully and his half-brother, Police Lieutenant Alonzo (Zoo) Tully must solve the murder. 15,000 first printing.",
        "Category": " Fiction , General",
        "Publisher": "Andrews Mcmeel Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Connecticut Yankee in New York (Mark Twain Mystery)",
        "Authors": "By Heck, Peter J.",
        "Description": "Peter J. Heck's Death on the Mississippi gave new life to the legend of Mark Twain, winning the debut novelist widespread acclaim for his depiction of the celebrated author. Now, Heck presents A Connecticut Yankee in Criminal Court, a riveting and rollicking historical mystery full of adventure and humor - and worthy of the great Mark Twain.New Orleans was a charming city - quaint buildings along beautiful avenues, a healthy mix of people, and the best food one could find anywhere. But underneath the charm lay something sinister - an unhealthy mix of corruption and racism that had a black man set to hang for a murder he didn't commit.\"Detective\" Mark Twain - more famous than ever after solving a pair of murders - wasn't about to let it happen without putting his two cents in. Together with traveling secretary Wentworth Cabot, Twain set about finding the truth. But those who knew the truth wanted it hidden. And they would dispose of anyone - even a world-famous author - who got in the way...",
        "Category": " Fiction , General",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Rinker on Collectibles",
        "Authors": "By Rinker, Harry L.",
        "Description": "",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Wallace-Homestead Book Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "More Than I Dreamed/a Lifetime of Collecting",
        "Authors": "By Forbes, Malcolm S. and Clark, Tony",
        "Description": "This glimpse into the extraordinary world of the flamboyant Malcolm Forbes reveals his passion for collecting and includes photographs of his most prized possessions--including Faberge Imperial Eggs, art, vehicles, and houses",
        "Category": " Biography & Autobiography , Business",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The Deaf Smith Country Cookbook: Natural Foods for Family Kitchens",
        "Authors": "By Ford, Marjorie Winn",
        "Description": "The preferences of all family members are considered in more than two hundred recipes for a full range of dishes comprised of whole, natural foods",
        "Category": " Cooking , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1973"
        }
    },
    {
        "Title": "Beanie Babies Summer 1998 Value Guide",
        "Authors": "By CheckerBee Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Checkerbee Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Real Freshman Handbook: An Irreverent & Totally Honest Guide to Life on Campus",
        "Authors": "By Hanson, Jennifer",
        "Description": "Geared to equip students for the front lines of the college experience, The College Handbook is a funny and insightful manual on everything a freshman needs to know to make the transition from high school to college, from home life to dorm life. From filling out the dreaded roommate questionnaire and choosing courses to studying for exams, writing papers, doing laundry, and surviving the social scene, Jennifer Hanson covers it all with a sense of humor and an insider's eye toward what really matters and works at college. Full of practical tips and funny anecdotal proof of their value, The College Handbook will quickly become every freshman's bible.",
        "Category": " Education , Students & Student Life",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Mork & Mindy",
        "Authors": "By Ralph Church",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1978"
        }
    },
    {
        "Title": "Washington Journal: The Events of 1973-1974",
        "Authors": "By Drew, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "RANDOM HOUSE",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    }
]