[
    {
        "Title": "Technical drawing",
        "Authors": "By Giesecke, Frederick E., etc.",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Library Reference",
        "Price Starting With ($)": "8.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Cristy Lane: One Day at a Time",
        "Authors": "By Stoller, Lee and Chaney, Pete",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "L S Records",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Death Defiers (Men's Health Life Improvement Guides)",
        "Authors": "By Men's Health Books (COR), Yeager, Selene, and Garrett, Kelly",
        "Description": "Details ways men can defeat diseases and includes tips on what to eat, how to exercise, and ways to handle stress to live longer and healthier lives",
        "Category": " Health & Fitness , Men's Health",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Breathe: A Guy's Guide to Pregnancy",
        "Authors": "By Brown, Mason",
        "Description": "Finally, a book for guys that solves the riddles of pregnancy.  Do you think that newborn babies can eat Doritos? That they can't scream very loudly since they just have tiny little baby lungs? That you will still be able to golf on weekends after your baby is born?  If so, you need this book!  Breathe takes guys misstep-by-misstep through the stages of pregnancy and the early days of childhood. Considered by many to be the unofficial pregnancy handbook of the NBA, Breathe is filled with useful tips such as these:  Brown's First Law of Conception: The odds of conception are inversely proportional to its desirability. High school virgins experimenting behind bleachers are guaranteed to get pregnant; financially secure married men hoping for children are doomed to spend their weekends in fertility clinics masturbating into cups.  Picking a doctor: Never use a gynecologist whose Medical School Diploma has palm trees on the side.  Pre-Natal Music: Mozart, yes. Wagner, No!  Common Concerns: If your baby is born with dark hair that covers its head, back, neck, temples and forehead, don't panic. This is perfectly normal. It just means your baby was born Italian.  Child experts from all over the world agree -- if you're a first time father, drop your baby and pick up this book!",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Groom's Secret Handbook: How Not to Screw Up the Biggest Day of Her Life",
        "Authors": "By Marsh, Anthony E. and Blumenfield, Jay",
        "Description": "Takes a humorous look at weddings from the point of view of the groom, including the engagement, planning the ceremony and reception, the wedding day itself, the honeymoon and the start of married life",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Careful Writer; A Modern Guide to English Usage",
        "Authors": "By Bernstein, Theodore Menline",
        "Description": "The definitive writers’ handbook of alphabetized entries that provides answers to questions of use, meaning, grammar, punctuation, precision, logical structure, and color.The Careful Writer is a concise yet thorough handbook, covering in more than 2,000 alphabetized entries the problems that give (or should give) writers pause before they set words to paper. It is perhaps the liveliest and most entertaining reference work for writers of our time—delighting while it instructs and amusing even as it scolds and cajoles the reader into skillful, persuasive, and vivid writing.The Careful Writer, Mr. Bernstein’s major work on usage, is an indispensible desk reference, and a perennial source of continuing reading pleasure.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "September",
            "Year": "1977"
        }
    },
    {
        "Title": "The Nanny",
        "Authors": "By Nathan, Melissa",
        "Description": "Twenty-three-year-old Jo Green knows that if she has to spend one more night in ultra-provincial Niblet-Upon-Avon she'll go completely bonkers! So she answers an ad in the paper, bids her devoted boyfriend Shaun adieu, and heads off to the big city. With a new job that offers excitement; a cool car; and her own suite with a TV, DVD player, and a cell phone, how can she go wrong?Then she meets . . . the Fitzgeralds -- Dick and Vanessa and their unruly brood of rugrats who have suddenly been entrusted into Jo's care. There's eight-year-old \"psycho-babe\" Cassandra; bloodthirsty Zak, the six-year-old Terminator; and timid little Tallulah.So what else could go wrong? How about the arrival of Dick's children from his first marriage: teenage Toby and (gulp!) all-grown-up-and-very-nicely-at-that Josh the accountant? And now that she has to temporarily share her room with Josh, Jo's head is really in a spin -- because with her hometown beau still in the picture and a sexy possibility sleeping just a foot away, life has suddenly gotten very complicated indeed!",
        "Category": " Fiction , Humorous",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Soul Mountain",
        "Authors": "By Gao, Xingjian and Lee, Mabel",
        "Description": "In 1983 Chinese playwright, critic, fiction writer, and painter Gao Xingjian (pronounced gow shing-jen) was diagnosed with lung cancer and faced imminent death.  But six weeks later, a second examination revealed there was no cancer -- he had won \"a reprieve from death\" and had been thrown back into the world of the living.  Faced with a repressive cultural environment and the threat of a spell in a prison farm, Gao fled Beijing.  He traveled to the remote mountains and ancient forests of Sichuan in southwest China and from there back to the east coast, a journey of fifteen thousand kilometers over a period of five months.  The results of this epic voyage of discovery is Soul Mountain.A bold, lyrical, prodigious novel, Soul Mountain probes the human soul with an uncommon directness and candor.  Interwoven with the myriad of stories and countless memorable characters -- from venerable Daosit masters and Buddhist nuns to mythical Wild Men, deadly Qichun snakes, and farting buses -- is the narrator's poignant inner journey and search for freedom. Fleeing the social conformity required by the Communist government, he wanders deep into the regions of the Qiang, Miago, and Yi peoples located on the fringes of Han Chinese civilization and discovers a plethora of different traditions, history, legends, folk songs, and landscapes. Slowly, with the help of memory, imagination, and sensory experience, he reconstructs his personal past. He laments the impact of the Cultural Revolution on the ecology -- both human and physical -- of China. And in a polyphony of narrating selves -- the narrator's \"I\" spawns a \"you,\" a \"she,\" and a \"he,\" each with a distinct perspective and voice -- the novel delights in the freedom of the imagination to expand the notion of the individual self.Storytelling saves the narrator from a deep loneliness that is part of the human condition. His search for meaning -- in life, in the journey -- turns up the possibility that there may be no meaning. The elusive Lingshan (\"Soul Mountain\"), which becomes the object of his quest, never yields up its secrets, but the journey is a rich, strange, provocative, and rewarding one. Soul Mountain is a novel of immense wisdom and profound beauty.",
        "Category": " Fiction , Political",
        "Publisher": "Harper",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "The Last Laugh",
        "Authors": "By Perelman, S. J.",
        "Description": "",
        "Category": "",
        "Publisher": "Holiday House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Guide to Chesapeake Seafood Dining: Bayside Views to Dine by",
        "Authors": "By Schmidt, Whitney",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Seafood",
        "Publisher": "Marian Hartnett Pr",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "The Sea in Their Blood",
        "Authors": "By Frederick John Pratson",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Wine Handbook",
        "Authors": "By Sutcliffe, Serena",
        "Description": "Describes types of wine, looks at the wine producing regions of Europe and America, and offers advice on selecting, storing, and serving wine",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "National Parks of the West",
        "Authors": "By the editors of Sunset Books, Sunset Magazines",
        "Description": "An illustrated guide to the natural history, location, and outstanding features of parks in the western regions of America's mainland and Hawaii",
        "Category": " Science , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "Travel Writing",
        "Authors": "By O'Neil, L. Peat",
        "Description": "Tell us where you've been, and what you experienced there. Let us feel the ticket in your hand, see your ports of call, meet the people you've come to know. Put it all on paper.",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Better Homes and Garden Christmas Cooking From the Heart (Treasured American Traditions)",
        "Authors": "By Joy Taylor",
        "Description": "",
        "Category": "",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "A Little Vietnamese Cookbook",
        "Authors": "By Tan, Terry and Tay, Sherri (ILT)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Cat Astrology: The Complete Book of Feline Horoscopes",
        "Authors": "By Zullo, Michael",
        "Description": "",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Tribune Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Low Fat Pasta (Step-By-Step)",
        "Authors": "By Maggs, Sue and Reilly, Peter (PHT)",
        "Description": "Low-fat recipes include lasagne, penne with salmon and dill, turkey and pasta casserole, curried chicken salad, and crescent spinach ravioli",
        "Category": " Cooking , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "5.95",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Encyclopedia of Annuals & Perennials",
        "Authors": "By Nurnie, Geoffrey",
        "Description": "",
        "Category": " Technology & Engineering , Agriculture , General",
        "Publisher": "Fog City Press",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Buttons and Foes: A Mandy Dyer Mystery (Mandy Dyer Mysteries)",
        "Authors": "By Johnson, Dolores",
        "Description": "Valued customer and old friend Thelma Chatwick is dead, and intrepid Denver dry cleaner Mandy Dyer is called upon to brush up her sleuthing skills and tidy up the investigation's loose ends. Why did Thelma insist on saving seemingly worthless garments-could her motives have something to do with the unusual buttons Thelma collected? When Mandy decides to hire a private detective, the reluctant gumshoe turns out to be none other than a rough, handsome heartbreaker Mandy stood up in high school. He's still a good-looking guy, but he has since transformed himself into Mr. Clean. Romance is a distinct possibility; if, that is, the pair can outwit a murderer. Mandy is also reunited in this adventure with her indispensable right-hand man, Mack Rivers; the all-too-dispensable Betty-the-bag-lady; and Nat, wonderboy reporter. Will they be able to help Mandy get the case all sewn up? Will the truth of Thelma's demise come out in the wash? Or will the witnesses button their lips and let Mandy get the starch knocked out of her? Sit back and relax-Mandy will get the whole mystery ironed out in no time. We guarantee that Buttons and Foes will pick up your spirits and deliver a rousing good time.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Diana (Unseen Archives)",
        "Authors": "By Alison Gauntlett",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "8.11",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Illustrated Encyclopedia of Automobiles",
        "Authors": "By David B. Wise",
        "Description": "",
        "Category": "",
        "Publisher": "Chartwell/Quarto",
        "Price Starting With ($)": "7.92",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "The Morgan Stanley Guide to Personal Investing",
        "Authors": "By Robert M. Gardiner",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Business Ethics: Ethical Decision Making and Cases",
        "Authors": "By Ferrell, O. C., Fraedrich, John, and Ferrell, Linda",
        "Description": "",
        "Category": " Business & Economics , Home-Based Businesses",
        "Publisher": "Houghton Mifflin College Div",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Roadside History of Arizona (Roadside History Series)",
        "Authors": "By Trimble, Marshall",
        "Description": "",
        "Category": " Travel , United States , West , Mountain (AZ, CO, ID, MT, NM, NV, UT, WY)",
        "Publisher": "Mountain Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "At Random: The Reminiscences of Bennett Cerf",
        "Authors": "By Cerf, Bennett Alfred",
        "Description": "“I’ve got the name for our publishing operation. We just said we were going to publish a few books on the side at        random. Let’s call it Random House.” So recounts Bennett Cerf in this wonderfully amusing memoir of the making of a great publishing house. An incomparable raconteur, possessed of an irrepressible wit and an abiding love of books and authors, Cerf brilliantly evokes the heady days of Random House’s first decades.             Part of the vanguard of young New York publishers who revolutionized the book business in the 1920s and ’30s, Cerf helped usher in publishing’s golden age. Cerf was a true personality, whose other pursuits (columnist, anthologist, author, lecturer, radio host, collector of jokes and anecdotes, perennial judge of the Miss America pageant, and panelist on What’s My Line?) helped shape his reputation as a man of boundless energy and enthusiasm and brought unprecedented attention to his company and to his authors. At once a rare behind-the-scenes account of book publishing and a fascinating portrait of four decades’ worth of legendary authors, from James Joyce and William Faulkner to Ralph Ellison and Eudora Welty, At Random is a feast for bibliophiles and anyone who’s ever wondered what goes on inside a publishing house.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1977"
        }
    },
    {
        "Title": "True Life Encounters Powers (True-Life Encounters Series)",
        "Authors": "By Spencer, John and Spencer, Anne",
        "Description": "",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "TV Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Customs and Characters: Contemporary Portraits",
        "Authors": "By Quennel, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Roosevelt Grady",
        "Authors": "By Shotwell, Louisa Rossiter",
        "Description": "",
        "Category": "",
        "Publisher": "Dell Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "If I Could",
        "Authors": "By Hill, Donna",
        "Description": "Tired of her old life, Regina Everette divorces her husband and the father of her two children, quits her unfulfilling job, scandalizes her family and friends, and sets out to rebuild her life by finding a new career and entering into a dynamic new relationship. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Land of the Living (French, Nicci)",
        "Authors": "By French, Nicci",
        "Description": "Abbi Devereaux lies flat on her back, her arms and legs tied down, her head covered with a hood. She senses the eyes that watch her. She feels the unknown hands that touch her in the dark. She knows she has been kidnapped. And she knows that somehow she must stay alive, even though everything she is experiencing tells her she won't.Miraculously, she escapes. One nightmare is over...but another is about to begin.Her memories of the recent past - where she lives, whether she has a job, where she stands with her boyfriend - are oddly out of synch with reality, her normal, everyday life in \"the land of the living.\" As the authorities question her credibility, Abbie can't help but wonder if there is a connection between the facts she has forgotten and the kidnapping itself.Now there's only one way to reclaim both her mind and her life - and stop a monstrous psycho-killer. She must dare to retrace her steps to the place where all the horror began.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The Spirit of Christmas",
        "Authors": "By Robinson, James, Bevere, John, Hagee, John, Barnett, Tommy (EDT), Dollar, Creflo A., McCullough, Jackie, and Phillips, Ron M.",
        "Description": "",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Liberty: A Jake Grafton Novel",
        "Authors": "By Coonts, Stephen",
        "Description": "On a quiet park bench in Manhattan---just miles from the ruins of the World Trade Center---spymaster Jake Janos Illin delivers a chilling secret message to Jake Grafton: A rogue Russian general has sold four nuclear warheads to a radical Islamic terrorist group, the Sword of Islam. The group intends to detonate them in America in the ultimate terror strike, the apocalypse that will trigger a holy war between Western civilization and the Muslim world. After passing Illin’s message to his superiors, Grafton is charged by the president with the task of assembling a secret team to find the warheads before America’s population centers are consumed by a nuclear holocaust.As he hunts for the terrorists, Grafton soon finds himself up to his neck in power politics, techno-billionaires, money-grubbing traitors, anarchists, and spies. He also discovers that the terrorists don’t all come from the Middle East. They come from places close to home. They masquerade as patriots. Some may even have the president’s ear.With the survival of Western civilization at stake, Grafton pulls out all the stops. Calling on the assistance of the indomitable Toad Tarkington, and CIA burglar Tommy Carmellini, he raids the prisons to assemble his team while the clock ticks toward Armageddon.Peopled with the rich, vivid characters that have made Stephen Coonts famous worldwide, Liberty is all action and suspense from the very first page.  And it poses the unanswerable question: How far should civilization go to defend itself from its mortal enemies?",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Healing Lessons",
        "Authors": "By Taylor, Nick and Winawer, Sidney J.",
        "Description": "A world-renowned cancer specialist puts his love for his wife before all that he has learned in medical school and journeys with her into the world of alternative medicine when she is given only a few months to live, in this compassionate and elegantly written memoir.",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Moment She Was Gone: A Novel",
        "Authors": "By Hunter, Evan",
        "Description": "It's two o'clock in the morning when Andrew Gulliver gets a phone call from his mother, who tells him his twin sister, Annie, is gone. This is not the first time. Ever since she was sixteen, she's been taking off without notice to places as far distant as Papua New Guinea, then returning unexpectedly, only to disappear yet another time, again and again and again.  But this time is different.  Last month, Annie got into serious trouble in Sicily and was briefly held in a mental hospital, where an Italian doctor diagnosed her as schizophrenic. Andrew's divorced mother refuses to accept this diagnosis. Andrew himself just isn't sure. But during the course of a desperate twelve hours in New York City, he and the Gulliver family piece together the past and cope with the present in a journey of revelation and self-discovery. Recognizing the truth at last, Andrew can only hope to find his beloved sister before she harms herself or someone else.  The Moment She Was Gone, a shattering novel of a family confronting its collective secrets, marks the high point in a writing career spanning almost five decades.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "A Body to Die For",
        "Authors": "By White, Kate",
        "Description": "After her last adventure, Bailey Weggins is one tired reporter in need of R & R. So when an old family friend invites her for a few weekend at the Cedar Inn in rural Massachusetts, she jumps at the chance to leave Manhattan for some major pampering.At the elegant mid-nineteenth-century hideaway, with its Asian-inspired spa, Bailey is soon luxuriating to the hypnotic sound of water spilling over stones and the soothing scent of green-tea candles. Yet mayhem is mere steps away, as Bailey discovers when she literally stumbles across a corpse wrapped mummy-style in a treatment room.Suddenly, her time-out is transformed into a full-tilt murder investigation. Bailey hadn't expected to meet anyone other than socialites slathering their cellulite with shea butter, but now she's dealing with a list of suspects dirtier than a mud bath: a spurned lover, a shady husband, and a group of employees who seem to be hiding something. And against her better judgment, she can't seem to keep her own hands off the sexy homicide detective assigned to the case.Desperate to help her mother's friend, the owner of the spa, Bailey will find herself chasing clues across state lines just as another death sweeps her into the sights of a vicious killer. And this time, the body in the mud wrap could be her own.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Collector's Bookshelf",
        "Authors": "By Lefontaine, Joseph Raymond",
        "Description": "Book collectors are a special (and wonderful) breed, as are books related to book-collecting. This fine example lists the correct titles and original date and place of publication of more than 33,000 collectible book titles. The titles listed were written by 931 authors who used a total of 1,764 different names, including pseudonyms. The authors listed have published works of mainstream fiction; also included are novelists in the genres of crime and mystery, westerns, romance and gothic novels, children's and juvenile fiction, science fiction, fantasy, and horror. The listings provide chronological checklists of works of fiction, poetry, and published plays; in many cases, nonfiction works are also included. See also following entry. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Antiques & Collectibles , Books",
        "Publisher": "Prometheus Books",
        "Price Starting With ($)": "9.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Family",
        "Authors": "By Frazier, Ian",
        "Description": "With the same quirky brilliance that drew fans to his previous work, Ian Frazier narrates the history of his family from early colonial days to the present. He reconstructs two hundred years of middle-class life, visiting small towns his ancestors lived in, reading the books they read, discovering the larger forces of history that affected them. He observes family members during the Revolutionary War; he follows others west as they pioneer in the wilderness of Ohio and Indiana, where schoolteachers were paid in whiskey and door hinges were made of bacon ride. He visits the battlefields where they fought the Civil War. He interviews old-timers, uncles, aunts, cousins, maids, a beer-store owner who knew his dad. Family is a poetic epic of facts, a chronicle of a culture's rise and fall, a memorial, a view of American history as romantic as it is unflinching.",
        "Category": " Family & Relationships , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Love Hunger: Recovery from Food Addiction",
        "Authors": "By Minirth, Frank",
        "Description": "",
        "Category": " Psychology , Psychopathology , Eating Disorders",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Not Now... I'm Having a No Hair Day: Humor & Healing for People With Cancer",
        "Authors": "By Clifford, Christine",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Pfeifer-Hamilton Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Narrative of the Life of Frederick Douglass, an American Slave",
        "Authors": "By Douglass, Frederick",
        "Description": "This dramatic autobiography of the early life of an American slave was first published in 1845, when its young author had just achieved his freedom. Douglass' eloquence gives a clear indication of the powerful principles that led him to become the first great African-American leader in the United States.",
        "Category": " Biography & Autobiography , Cultural Heritage",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1963"
        }
    },
    {
        "Title": "Prince Friedrich of Homburg: A New Translation for the American Stage",
        "Authors": "By Kleist, Heinrich Von",
        "Description": "Available until now only in verse translation, it has been newly rendered for the American stage by Diana Stone Peters and Frederick G. Peters.A work of profound psychological insight, Prince Friedrich of Homburg probes with passionate intensity questions fundamental to “civilized” behavior. Prince Friedrich, the hero of the historic battle of Fehrbellin (1675) against the invading Swedes, receives not laurels for his victory but the sentence of death for disobeying orders in the field. Faced with certain execution, his mood swings from abject terror to high-minded exultation as first he challenges, and then accepts, the rule of law and subservience to the state. The action moves relentlessly in the near-frenzied pace characteristic of Kleist. Intended as a paean to a Prussia triumphant in the Napoleonic wars. the play was, ironically, censured and never produced in Kleist's lifetime. In our own day, Prince Friedrich of Homburg has been both denounced as a protofascist work and lauded as a supreme metaphysical disquisition. Whatever the merits of such intellectualization, it remains one of the most moving and performable plays available for the modern stage.",
        "Category": " Drama , European , General",
        "Publisher": "New Directions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "From Daughters to Mothers, I've Always Meant to Tell You : An Anthology of Letters",
        "Authors": "By Warlow, Constance (EDT) and Warloe, Constance (EDT)",
        "Description": "In this extraordinary collection of letters written especially for this volume, more than seventy-five distinguished daughters -- novelists, poets, essayists, cartoonists, journalists -- speak to their mothers, both living and deceased. From Joyce Carol Oates to Barbara Kingsolver, from Ntozake Shange to Hilma Wolitzer, these writers deliver messages straight from the heart....  Here are authors of different ages and cultures, many of them mothers and grandmothers themselves, each writing in her own distinctive voice, sharing her secret sorrows, joys, hurt, anger, and understanding. \"What do I tell her? What do I not tell her? What do I wish I had said?\"  Their thoughtful, provocative, funny, and sometimes painful letters hold revelations -- memories and confessions, poems and tales -- at once personal and universal, touching and profound.",
        "Category": " Family & Relationships , Parenting , Parent & Adult Child",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Circle of Simplicity: Return to the Good Life",
        "Authors": "By Andrews, Cecile",
        "Description": "For a growing number of people, simplicity has been a path to experience the joy in life, to cherish its richness and vitality.It strips away the burdens of our daily lives so that we are left with exhilaration, spirit and fullness.  These people are finding that less -- less work, less rushing, less debt -- is more -- more time with family and friends, more time with community, more time with nature, and more time to develop a meaningful and compelling spirituality.In The Circle of Simplicity: Return to the Good Life,  author Cecile Andrews helps you discover and create the good life for yourself.  She is renowned for her workshops on voluntary simplicity and her seminars on creating simplicity circles, where people explore their own life stories and share information and knowledge, helping one another develop lives of simplicity and satisfaction.  The circles do not only give people the tools to change, but they also fill unmet needs for community and intimacy and the desire to search for truth in the company of kindred spirits.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "All Dressed Down and Nowhere to Go (Paperback)",
        "Authors": "By Adams, Scott",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Shyest 'Kid in the Patch (Cabbage Patch Kids)",
        "Authors": "By Taylor, Mark and Lace, Lynn (ILT)",
        "Description": "When New One is born in the cabbage patch, she is very shy until her new friends are threatened by a mean jackrabbit.",
        "Category": "",
        "Publisher": "Parker Brothers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Sex, Lies And Politics: The Naked Truth",
        "Authors": "By Flynt, Larry",
        "Description": "The notorious pornographer and defender of the First Amendment rights, who is fed up with the current state of our government, shares his thoughts on a vast array of issues, including sex, the War on Terror, the Bush administration, religion, feminism, entrepreneurism, and privacy. 50,000 first printing.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Great Rescue (Cabbage Patch Kids)",
        "Authors": "By Taylor, Mark",
        "Description": "",
        "Category": "",
        "Publisher": "Parker Brothers",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "When I Lived in Modern Times",
        "Authors": "By Grant, Linda",
        "Description": "For a weary and exhausted Europe, it is a time to begin picking up the pieces of the past, and for the armies of displaced persons on the move to slowly return home - if they still have one. But for Evelyn Sert, a young twenty-year-old woman from London standing on the deck of a ship bound for Palestine, it is a time of adventure and a time of change when anything seems possible.Evelyn is quickly caught up in the spirited, chaotic churning of her new, strange country. Unsure of herself and where she belongs in this exotic world whose only constant is change, she will first join a kibbutz, then move on to the teeming metropolis of Tel Aviv to find her own home and a collection of friends as eccentric and disparate as the city itself. Ultimately, she will find love with a man who is not what he seems to be, as she is swept up as an unwitting spy in an underground army for a nation fighting to be born.",
        "Category": " Fiction , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Plays Well with Others",
        "Authors": "By Gurganus, Allan",
        "Description": "In his widely read, prizewinning Oldest Living Confederate Widow Tells All, Allan Gurganus gave fresh meaning to an overexplored American moment: 1860-65. He now turns that comic intensity and historical vision to another war zone: entry-level artistic Manhattan 1980-95. In his first novel since Widow, Gurganus offers us an indelible, addictive praise-song to New York's wild recent days, their invigorating peaks and lethal crashes.It's 1980, and Hartley Mims jr., a somewhat overbred Southerner, arrives in town to found his artistic career and find a Circle of brilliant friends. He soon discovers both Robert Christian Gustafson, archangelic boy composer of Symphony no. 1: The Titanic, and Alabama Byrnes, a failed Savannah debutante whose gigantic paintings reveal an outsized talent that she, five feet tall, can't always live up to.This circle--sexually venturesome, frequently hungry, hooked on courage, caffeine, and the promise of immortality--makes history and most everybody else. Their dramatic moment in New York history might've been a collaboration begun, as a toast, by Cole Porter and finished, as pure elegy, by Poe himself. Plays Well with Others is a fairy tale. It has a Legend's indoctrinating charm and hidden terrors. It chronicles a ragtag group of gifted kids who come to seek their fortunes; they find the low-paying joys of making art and the heady education only multiple erotic partners can provide. Having mythologized each other through the boom years, having commenced becoming \"names,\" they suddenly encounter a brand-new disease like something out of fifth-rate sci-fi. Friends are soon questioning how much they really owe each other; they're left with the ancient consolation of one another's company and help. We watch this egotistic circle forge its single greatest masterwork: a healthy community.The novel, a sort of disco requiem-mass, divides itself into three symphonic movements: \"Before,\" \"After,\" and \"After After.\" The work concludes in a homemade paradise that resembles Hartley Mims's own starter vision of all that seemed waiting--latent and convivial--in New York itself.This is a work that could've only been written now, in our age of medical advances, written about these unsuspecting unsung heroes of a medieval scourge's first endgame moves among us. Plays Well with Others becomes a hymn to the joys and woes of caretaking (for waning parents and young friends). Allan Gurganus has created a deeply engaging narrative about flawed, well-meaning people who seem lifted from our own address books. His book offers an obsessive love story, a complex vision of our recent past, and an emotional firestorm--a pandemic's long-awaited great novel.",
        "Category": " Fiction , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Irresistible (Conrad Voort Novels)",
        "Authors": "By Black, Ethan",
        "Description": "While a beautiful woman prowls the city, killing the men she seduces, a sex crime detective hunts her through the streets during the Manhattan's worst heat wave in twelve years. By the author of The Broken Hearts Club.",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Mistletoe Man (A China Bayles Mystery)",
        "Authors": "By Albert, Susan Wittig",
        "Description": "Former big-city lawyer China Bayles worked hard to make her herb shop, Thyme and Seasons, a success. Now business is booming at her newest venture, Thyme for Tea - but China is too distracted to revel in her latest entrepreneurial triumph. When she's not trying to spend more time with her new husband and stepson, she's worrying about Ruby, who just hasn't been herself lately. To further complicate matters, China has to round up a supply of mistletoe, the season's most popular herb. It seems an easy enough task - until her chief supplier turns up dead...",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Staggerford Flood",
        "Authors": "By Hassler, Jon",
        "Description": "Jon Hassler, \"Minnesota's most engaging cultural export,\" returns in his latest novel to the town of his first-Staggerford-reuniting the irrepressible Agatha McGee with characters from her past, as well as introducing her to new friends.  Now in her eightieth year, Agatha McGee finds herself feeling her age, more tired and less a part of daily life in town. The new parish priest, Father Healy (of North of Hope), isn't helping matters either, as he tries to wean her off her frequent Confessions, thinking Agatha has become a bit too zealous with morality. But when a flood hits the Badbattle River, engulfing every house except hers, Staggerford needs Agatha like never before, and seven neighbors, friends, and former students seek refuge with Agatha for four days and nights.  With Jon Hassler's trademark wry wit, gentle humor, and wonderful storytelling, The Staggerford Flood delivers another view of life in small town Minnesota. Reuniting favorite Hassler characters from Staggerford, Simon's Night, A Green Journey, North of Hope, Dear James, and The Dean's List, The Staggerford Flood is another classic novel from one of America's favorite writers.",
        "Category": " Fiction , Literary",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Mentors, Masters and Mrs. MacGregor: Stories of Teachers Making A Difference",
        "Authors": "By Bluestein, Jane (EDT)",
        "Description": "Did you ever have a teacher who changed the way you looked at yourself and your life? Almost every one of us remembers a special person who touched our heart and mind, who gave us a glimpse of what we might achieve or who we might become. This teacher may have been in a classroom, or may have simply been someone we met during our lives who showed us how we could become better people.You'll savor this collection of entertaining, inspiring and moving stories about teachers, mentors and other special people who have made a positive and significant difference in the lives of others. Stories are collected from people of all ages, professions and backgrounds. Some are famous--Joe Paterno, Jimmy Carter, Archbishop Desmond Tutu, Dave Barry, Shari Lewis, Steve Allen--while others are ordinary folks with extraordinary stories. Stories included here tell of the teachers who taught individuals to appreciate their own talents, abilities and uniqueness; sparked an interest in a particular subject area; or inspired their students to dream--and then showed them how to achieve those dreams.",
        "Category": " Education , General",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Encyclopedia of Container Gardening",
        "Authors": "By Geoffrey Burnie",
        "Description": "",
        "Category": "",
        "Publisher": "Fog City Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "A Traveler's Guide to the Smoky Mountains Region",
        "Authors": "By Bradley, Jeff",
        "Description": "",
        "Category": "",
        "Publisher": "Harvard Common Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Lamia",
        "Authors": "By P. L. Thyraud de Vosjoli",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Five Days in London, May 1940",
        "Authors": "By Lukacs, John",
        "Description": "The days from May 24 to May 28, 1940 altered the course of the history of this century, as the members of the British War Cabinet debated whether to negotiate with Hitler or to continue what became known as the Second World War. The decisive importance of these five days is the focus of John Lukacs’s magisterial new book.Lukacs takes us hour by hour into the critical unfolding of events at 10 Downing Street, where Churchill and the members of his cabinet were painfully considering their war responsibilities. We see how the military disasters taking place on the Continent—particularly the plight of the nearly 400,000 British soldiers bottled up in Dunkirk—affected Churchill’s fragile political situation, for he had been prime minister only a fortnight and was regarded as impetuous and hotheaded even by many of his own party. Lukacs also investigates the mood of the British people, drawing on newspaper and Mass-Observation reports that show how the citizenry, though only partly informed about the dangers that faced them, nevertheless began to support Churchill’s determination to stand fast.Other historians have dealt with Churchill’s difficulties during this period, using the partial revelations of certain memoirs and private and public papers. But Lukacs is the first to convey the drama and importance of these days, and he does so in a compelling narrative that combines deep knowledge with high literary style.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "No Ordinary Time: Franklin and Eleanor Roosevelt: The Home Front in World War II",
        "Authors": "By Goodwin, Doris Kearns",
        "Description": "Winner of the Pulitzer Prize for History, No Ordinary Time is a monumental work, a brilliantly conceived chronicle of one of the most vibrant and revolutionary periods in the history of the United States.With an extraordinary collection of details, Goodwin masterfully weaves together a striking number of story lines—Eleanor and Franklin’s marriage and remarkable partnership, Eleanor’s life as First Lady, and FDR’s White House and its impact on America as well as on a world at war. Goodwin effectively melds these details and stories into an unforgettable and intimate portrait of Eleanor and Franklin Roosevelt and of the time during which a new, modern America was born.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Adoption, Second Edition",
        "Authors": "By Adamec, Christine A.",
        "Description": "“A beacon through the often tangled and varied paths to parenting through adoption.”—William Pierce, President, National Council for Adoption    Hailed as “an extremely valuable resource” by Jann Heffner, executive director of the Dave Thomas Foundation for Adoption, this new edition covers the adoption process, new information on cyber adoption, changes in adoption laws, and the financial considerations of adoption.    • Updated appendixes with new listings for adoption agencies, publications, adoptive parents’ groups, and adoption attorneys    • Comprehensive information on adopting abroad, Internet-assisted adoptions, and the legal aspects of adoption, including pre-birth consent laws",
        "Category": " Family & Relationships , Adoption & Fostering",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to American Heroes",
        "Authors": "By Stevenson, Jay and Budman, Matthew",
        "Description": "You're no idiot, of course.  You know America loves its heroes as much as baseball, hot dogs, and apple pie.  But when it comes to knowing the true stories of folk and real-life heroes--as well as understanding how and why they have become so much larger than life--you feel like Superman facing a mountain of kryptonite.  Don't fall from the sky yet!  The Complete Idiot's Guide to \"American Heroes is an inspirational look at the exceptional men and women who have captured our imaginations from colonial times to the present.  In this Complete Idiot's Guide, you'll find:",
        "Category": " History , United States , General",
        "Publisher": "Alpha Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Hot Dog (Step-Into-Reading, Step 1)",
        "Authors": "By Coxe, Molly and Coxe, Molly (ILT)",
        "Description": "Step 1 books entice early readers with rhyme, rhythm, and repetition. Poor Dog. He's awfully hot! But Mom won't share her lemonade. Cat won't share his shady spot on the porch. And Skunk's making a real stink about sharing his hollow log. What does a hot Dog have to do to get cool?Step 1 Readers feature big type and easy words. Rhymes and rhythmic text paired with picture clues help children decode the story. For children who know the alphabet and are eager to begin reading.",
        "Category": " Juvenile Fiction , Lifestyles , Farm & Ranch Life",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "The Search for Signs of Intelligent Life in the Universe",
        "Authors": "By Wagner, Jane",
        "Description": "The text of the Broadway play, captures the last twenty years of American culture",
        "Category": " Drama , American , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Doubleday Wine Companion, 1983",
        "Authors": "By Wagenvoord, James",
        "Description": "Discusses the current trends in wine making, traces the history of the winery, Chateau Mounton-Rothschild, and supplies guidance on the storage, serving, tasting, and purchase of wine",
        "Category": " Cooking , Beverages , Alcoholic , Wine",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "The Windows Internet Tour Guide: Cruising the Internet the Easy Way/Book and Disk",
        "Authors": "By Fraase, Michael",
        "Description": "Provides a comprehensive introduction to the world of Internet via Windows, detailing getting connected, network infrastructure, electronic mail, news and newsgroups, transferring files, Gopher and other Windows-based programs, Internet resources, and more. Original. (All Users).",
        "Category": " Computers , General",
        "Publisher": "Ventana Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "New Age Masquerade: The Hidden Agenda in Your Childs Classroom",
        "Authors": "By Buehrer, Eric",
        "Description": "Argues that some schools are teaching New Age philosophy and thereby undermining Christian belief",
        "Category": " Education , General",
        "Publisher": "Wolgemuth & Hyatt Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Lost",
        "Authors": "By Devon, Gary",
        "Description": "Tells the story of Sherman Abbot, a twelve-year-old psychopath who becomes murderously obsessed with stalking the lonely woman who \"stole\" his six-year-old sister",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "The Things That Matter Most",
        "Authors": "By Thomas, Cal",
        "Description": "With a growing readership that is outpacing that of all other political columnists, Cal Thomas now turns his attention to the tragic consequences of misguided liberal thinking, laying out a damning indictment that will surely provoke a lively national debate.The Things That Matter Most is for people who wonder why social problems don't seem to go away, no matter how much money we pour into them...who think that families do matter, that fidelity does count, that fighting for one's country is noble...who long for a sense of purpose more transcendent than collecting another paycheck.With an objective, analytic eye, Thomas traces our current national malaise - rampant disease, crime, and despair - to the false promises of the sixties. Ironically, by topping all traditions; by declaring drugs and sex \"in\" and God \"out\"; by promulgating a credo of \"it feels good, do it,\" the activists of that era triggered a process that produced the following: a widespread erosion of standards - most alarmingly in the area of education; a \"can you top this\" race to fill the media with ever cruder content; an explosive rise in sexual promiscuity and drug taking, leading to epidemic disease; the increasing rarity of the society-strengthening two-parent family; a spiritual vacuum that causes people to question why life is worth living; and a \"Welfare Pentagon\" whose enfeebling mantra is \"you can't do it alone.\"Mixing hard truths with wry commentary, Cal Thomas prescribes a new vision for America that begins with reconsidering the values by which our parents and grandparents lived. America may have lost its way, but it can regain it, Thomas argues - in what will surely be one of the most important and talked-about books of the year.",
        "Category": " Social Science , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "A Lifetime Burning in Every Moment: From the Journals of Alfred Kazin",
        "Authors": "By Kazin, Alfred",
        "Description": "While leading an active life, Kazin has faithfully kept diaries from the late 1930s up to the present. A Lifetime Burning in Every Moment offers readers the best of thousands of pages of his journals, comprising an extraordinary picture of intellectual, social, political, and even celebrity life - including such figures as Bernard Berenson, Josephine Herbst, Saul Bellow, Bernard Malamud, Hannah Arendt - during the past five and a half decades. Kazin candidly reflects on his four marriages, his feelings about the Holocaust, his criticism of American society, the pleasure and stimulation of reading good writers (Simone Weil, Ignazio Silone, Joseph Conrad, and Saul Bellow, among others), his need to pray, his travels abroad and within the United States, and more.",
        "Category": " Literary Criticism , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "General Motors, the first 75 years of transportation products",
        "Authors": "By general motors corporation and Princeton Institute for Historic Research",
        "Description": "",
        "Category": "",
        "Publisher": "Automobile Quarterly Publications",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Economics: Principles, Problems, and Policies",
        "Authors": "By McConnell, Campbell R. and Bruce, Stanley",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill College",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Inc. Your Dreams: For Any Woman Who Is Thinking About Her Own Business",
        "Authors": "By Maddox, Rebecca",
        "Description": "",
        "Category": " Business & Economics , Entrepreneurship",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Quilting, Patchwork & Applique",
        "Authors": "By Sunset",
        "Description": "Details basic patchwork and quilting techniques, features a gallery of quilts, and presents patterns and instructions for creating a variety of quilt projects",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "Golf My Way",
        "Authors": "By Nicklaus, Jack",
        "Description": "A practical guide to playing golf according to the system and method of the superstar golfer",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1976"
        }
    },
    {
        "Title": "Judgment Day at the White House: A Critical Declaration Exploring Moral Issues and the Political Use and Abuse of Religion",
        "Authors": "By Fackre, Gabriel (EDT)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "William B. Eerdmans Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Standing Firm: Dan Quayle",
        "Authors": "By Quayle, Dan",
        "Description": "Standing Firm leaves no doubt that Dan Quayle is the most misjudged figure in modern political history. Prior to 1988, Quayle had never lost an election. Not for Congress. Not even for the Senate. Heading into that year's Republican Convention, Quayle was considered one of the party's brightest young stars - a man of unusual political instincts who, when it came to campaigning, had a reputation as a giant killer. He would become the first in his generation to hold national office, but only after a tumultuous contest that frequently put him on the defensive.With gritty honesty and admirable self-deprecation, Quayle describes what it was like to weather that 1988 media storm, and the other squalls that followed. Poignantly, he also talks of the self-confidence and Christian faith that gave him the courage to stand firm and record some of the most noteworthy contributions of any Vice President ever. Among the high points: his coordination of America's response to a coup attempt in the Philippines, the details of which have never been reported; his bringing the family-values issue to the fore with the Murphy Brown speech - a call for action that, one year later, would even draw support from Democratic President Bill Clinton; his use of the White House Competitiveness Council to curtail harmful \"overregulation\"; his unreported diplomacy with Latin American leaders; and his championing of legal reform, which would earn him the strongest praise of his vice-presidency.Quayle pulls no punches when it comes to assessing himself and other players in the Bush administration - the men and women who were his allies, and sometimes his opponents, in helping George Bush spread democracy around the world. He shares entries from his diary of the Persian Gulf crisis, offers a surprising snapshot of what the typical Bush cabinet meeting was like, describes intramural battles waged by White House power brokers, and reveals his special relationship with the President. Quayle, a former journalist, interviewed several members of the press for this book, and their contributions form a vital part of its fabric.Standing Firm is perhaps most intriguing in its analysis of what went wrong in the 1992 election. Quayle does not hesitate to place blame where it is deserved - in fact, he reserves some of the strongest criticism for himself. Throughout, the portrait is that emerges of the former Vice President is that of a man whose good humor is exceeded only by a competence for which he has never been fully credited.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Broken Places: A Novel",
        "Authors": "By Perabo, Susan",
        "Description": "When an abandoned farmhouse collapses in Casey, Pennsylvania, twelve-year-old Paul Tucker's father, Sonny, and the other Casey firemen attempt a dangerous rescue to reach a teenager buried under the rubble. Sonny himself is trapped by a secondary collapse and Paul and his mother fear the worst, but Sonny -- a second-generation fireman beloved in town -- emerges hours later, carrying the maimed body of sixteen-year-old Ian Finch. The rescue of this swastika-tattooed hoodlum -- who may have brought the house down while building bombs -- becomes a validation of all things American and true, and Sonny is immediately hailed as a national hero. But Ian's continued presence in Sonny's life creates a new set of hurdles for young Paul -- and his mother and his hometown -- to overcome.",
        "Category": " Fiction , Psychological",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Now, God Be Thanked: A Novel (His Loss of Eden)",
        "Authors": "By Masters, John",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Land of Yesterday, Land of Tomorrow: 9",
        "Authors": "By Conklin, Paul, Conklin, David, and Conklin, Peter",
        "Description": "An informative look at the Xinjiang Province of China examines this little-known region of Chinese Central Asia, detailing its history, its use as a testing ground for nuclear weapons, its natural resources, and its people.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "A Visionary Nation: Four Centuries of American Dreams and What Lies Ahead",
        "Authors": "By Karabell, Zachary",
        "Description": "America is a nation based on an idea. For nearly four centuries, Americans have shared the conviction that a perfect world is within reach. Running through our history is the presumption that we can have it all.In A Visionary Nation, Zachary Karabell shows how this utopian impulse forms a continuous thread in the tapestry of the American experience and represents who we really are. In this penetrating volume, he brings the core of American history to life by examining its successive stages, each promising utopia and none delivering it. Karabell reveals that during every stage, there have been men and women who strove to transform the world. These are the visionaries who have defined American culture. Part history, part essay, part prediction, this profoundly original work tells the stories of visionaries past and present, from Anne Hutchinson to FDR, Alexander Hamilton to Bill Gates. It shows that if our history has proven one thing, it is that no era lasts forever. In striving for the ideal, we have achieved much, but never have realized our dreams of spiritual fulfillment and material prosperity. And so we are chronically plagued by disappointment that we have not achieved everything.Along with this distinctive view of American history, Karabell offers his own vision of where our nation is heading. Just as the Puritan vision of a City on a Hill was supplanted by the Founding Fathers' vision of individuality, and just as the expansive vision of a government-led Great Society was eclipsed by the New Economy in the 1990s, so too will the New Economy be replaced in our near future by a period when community and spirituality will occupy center stage. Provocative, intelligent, and deeply engaging, A Visionary Nation provides a framework for understanding America's past while preparing us for the next phase of the nation's growth.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Customer Connection: Quality for the Rest of Us",
        "Authors": "By Guaspari, John",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Quick-Sew Celebrations: Decorative Creations for Festive Occasions from America's Top Designers (Best-Loved Designers' Collection)",
        "Authors": "By Schaefer, Marjon (EDT)",
        "Description": "",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Martingale & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Better homes and gardens easy bazaar crafts (Better homes and gardens books)",
        "Authors": "By Better Homes & Garden Staff",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Complete Book of Nature Crafts: How to Make Wreaths, Dried Flower Arrangements, Potpourris, Dolls, Baskets, Gifts, Decorative Accessories for th",
        "Authors": "By Cusick, Dawn, Taylor, Carol, and Carlson, Eric",
        "Description": "Instructions for making hundreds of fun and imaginative items that evoke the beauty of the great outdoors include tips on collecting natural materials, drying flowers, preserving materials, natural dyeing, and more.",
        "Category": " Art , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Presence",
        "Authors": "By Saul, John",
        "Description": "It is an offer anthropologist Katharine Sundquist cannot refuse. A chance to study the unusual skeletal remains unearthed on the volcanic flanks of Haleakala, Maui. Yet for Katharine's sixteen-year-old son, Michael, the sudden move is jarring. It's the last thing he needs while struggling with the still painful death of his father.And here, beyond the sparkling beaches, masked by the deceptive beauty of the rainforest, a terrible danger waits.It begins with a video transmission so shocking that Katharine cannot believe what flashes on her computer screen - then instantly, inexplicably, vanishes. Secret deliveries in the dead of the night to a restricted wing of the high-tech laboratory in which she works signal that behind locked doors some sinister experiment is unfolding.And then, with the sudden, unexplained death of Michael's friend, a disturbing truth dawns: the corporation that is funding Katharine's dig has a far greater investment than she has imagined - an investment in medical terror. And her son may be part of their hideous grand plan.",
        "Category": " Fiction , Horror",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Unbeheaded King",
        "Authors": "By De Camp, L Sprague",
        "Description": "Aided by error-prone demons and a friendly ghost, Jorian--the fugitive, unbeheaded king of Xylar--braves all to regain his wife, Queen Estrildis, and ends up with a lady-in-waiting",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey / Ballantine Books",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "The Death of Vishnu: A Novel",
        "Authors": "By Suri, Manil",
        "Description": "Vishnu, the odd-job man in a Bombay apartment block, lies dying on the staircase landing: Around him the lives of the apartment dwellers unfold: the warring housewives on the first floor, lovesick teenagers on the second, and the widower, alone and quietly grieving on the top floor of the building. In a fevered state Vishnu looks back on his love affair with the seductive Padmim and wonders if he might actually be the god Vishnu, guardian of the entire universe. Blending incisive comedy with Hindu mythology and a dash of Bollywood sparkle, The Death of Vishnu is an intimate and compelling view of an unforgettable world.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Can Tommy Come Out and Play? My Adventures in Education",
        "Authors": "By Thomas H. Shade",
        "Description": "",
        "Category": "",
        "Publisher": "Self-Published",
        "Price Starting With ($)": "8.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Food Festival, U.S.A.: Red, White, and Blue Ribbon Recipes from All 50 States",
        "Authors": "By Mercuri, Becky and Klare, Tom (ILT)",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , General",
        "Publisher": "Laurel Glen",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Molly and the Magic Dress",
        "Authors": "By Norwich, William and Miller, M. Scott (ILT)",
        "Description": "Molly doesn’t want to go to her cousin’s stuffy society wedding. She’ll be bored—as always. Worse, her mother insists that she wear a starchy velvet dress. Molly obliges, but also packs into her book bag her favorite dress—a tattered magic one that allows her to become anyone she wishes. Molly knows that the only way she’ll have any fun is by making quick getaways from the hoity-toity celebration and the la-di-da conversation of her relatives. And the magic dress doesn’t disappoint! It transports Molly into unexpected adventures of the spirit and the heart. If you believe in the magic dress, anything is possible. . . .",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Doubleday Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "TV Guide: Fifty Years of Television",
        "Authors": "By Lasswell, Mark",
        "Description": "More than 350 full-color and black-and-white photographs from the archive of TV Guide celebrate a half century of television history, from The Howdy Doody Show and I Love Lucy to The Simpsons and The Sopranos, and the personalities, shows, and landmark events that changed entertainment history. 150,000 first printing.",
        "Category": " Performing Arts , Television , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "8.82",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Rolling Stones (Unseen Archives)",
        "Authors": "By Hill, Susan",
        "Description": "",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Good Fat Cookbook",
        "Authors": "By Sears, Barry and McCullough, Fran",
        "Description": "Good news. The good fats -- butter, chocolate, eggs, coconut, olive oil, avocado, fish and shellfish, among many other favorites -- are not only delicious, they're good for your brain, heart, immune system, hormones, skin, memory, and emotional well-being.   Whatever you think you know about fat, forget it. After two decades of the low-fat diet trend, Americans are fatter -- and less healthy -- than ever before. For many, those torturous no-fat, low-fat diets are outright health hazards, contributing to everything from premature wrinkling and depression to hormone dysfunction and even cancer.  In The Good Fat Cookbook, best-selling author Fran McCullough delivers the delicious news. Here is powerful evidence that not only have we been sold a bill of low-fat goods, but the foods we love to eat -- real butter, chocolate, coconut, whole milk and cream, nuts, avocados, cold-water fish, red meat, olive oil, bacon and eggs -- are actually good for us.  Not only does fat not make you fat, the good fats slow the effects of aging, improve mood and memory, boost the immune system, and protect against catastrophic disease such as stroke and cancer. And the most surprising news of all: the right fats are great tools for weight loss -- they make you fuller faster and for longer and jump-start your metabolism.  McCullough debunks fat myths and demystifies cutting-edge science, while exploring all aspects of the fat phenomenon, fork in hand. More than a hundred simple recipes -- Salmon Chowder, Tuna with Rice, Deep-Fried Coconut Shrimp, Parsley Salad with Avocado, Chicken with Olives and Oranges, Grilled Cheese with Oregano, Crisp Coconut Waffles, Avocado Cheesecake, and Wall-to-Wall Walnut Brownies -- put the good fats back on your table, and McCullough offers spirited advice on everything from the best cooking oils and tastiest canned tuna to nutritional supplements and testing for your fatty-acid profile. Her hundreds of thousands of low-carb fans will be overjoyed to see that most of the recipes here are perfect for them as well.  Fran McCullough is the author of the best-selling The Low-Carb Cookbook and Living Low-Carb. She won a James Beard Award for Great Food Without Fuss and, since 1999, has been the editor of the annual Best American Recipes anthology series. A graduate of Stanford University, McCullough began her career as an editor, discovering Sylvia Plath, Pulitzer Prize winner N. Scott Momaday, and National Book Award winner Robert Bly as well as Richard Ford. She also edited and published a distinguished list of cookbook authors, including Diana Kennedy, Paula Wolfert, and Deborah Madison. Her website address is www.blackdirt.net/lowcarb",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Passion of Artemisia: A Novel",
        "Authors": "By Vreeland, Susan",
        "Description": "Recently rediscovered by art historians, and one of the few female post-Renaissance painters to achieve fame during her own era, Artemisia Gentileschi led a remarkably \"modern\" life. Susan Vreeland tells Artemisia's captivating story, beginning with her public humiliation in a rape trial at the age of eighteen, and continuing through her father's betrayal, her marriage of convenience, motherhood, and growing fame as an artist. Set against the glorious backdrops of Rome, Florence, Genoa, and Naples, inhabited by historical characters such as Galileo and Cosimo de' Medici II, and filled with rich details about life as a seventeenth-century painter, Vreeland creates an inspiring story about one woman's lifelong struggle to reconcile career and family, passion and genius.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Executioner #20: New Orleans Knockout",
        "Authors": "By Pendleton, Don",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Hellbinder (Mack Bolan, Executioner #72)",
        "Authors": "By Pendleton, Don",
        "Description": "",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Gold Eagle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Finding My Voice",
        "Authors": "By Rehm, Diane",
        "Description": "A leading radio personality describes her rise from an abusive childhood in an Arab-American household in Washington, D.C., to success in the field of radio and details her determined battle with Spasmodic Dysphonia, the rare neurological disorder that nearly destroyed her career. 50,000 first printing. Tour.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "American Heart Association Cookbook: 5th Edition",
        "Authors": "By American Heart Association",
        "Description": "Features more than 600 recipes for dishes ranging from appetizers to desserts, each accompanied by a complete nutritional breakdown of cholesterol, sodium, and other dietary components",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Napkin Folds",
        "Authors": "By Chalmers, Irena",
        "Description": "",
        "Category": "",
        "Publisher": "Irena Chalmers Cookbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Undersea Life",
        "Authors": "By Levine, Joseph S.",
        "Description": "Examines the interrelationships between sea plants and animals and includes discussions of corals, plankton, kelp, sharks, and sea anemones",
        "Category": " Science , General",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "7.04",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    }
]