[
    {
        "Title": "Six Hours One Friday: Anchoring to the Power of the Cross (Chronicles of the Cross)",
        "Authors": "By Lucado, Max",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Espresso Tales",
        "Authors": "By McCall Smith, Alexander and McIntosh, Iain (ILT)",
        "Description": "44 SCOTLAND STREET - Book 2 The residents and neighbors of 44 Scotland Street and the city of Edinburgh come to vivid life in these gently satirical, wonderfully perceptive serial novels, featuring six-year-old Bertie, a remarkably precocious boy—just ask his mother.    Back are all our favorite denizens  of a Georgian townhouse in Edinburgh. Bertie the immensely talented six year old  is now enrolled in kindergarten, and much to his dismay, has been clad in pink overalls  for his first day of class. Bruce has lost his job as a surveyor, and between admiring  glances in the mirror, is contemplating becoming a wine merchant. Pat is embarking  on a new life at Edinburgh University and perhaps on a new relationship, courtesy  of Domenica, her witty and worldly-wise neighbor. McCall Smith has much in store  for them as the brief spell of glorious summer sunshine gives way to fall a season  cursed with more traditionally Scottish weather.Full of McCall Smith’s gentle humor  and sympathy for his characters, Espresso Tales is also an affectionate portrait  of a city and its people who, in the author’s own words, “make it one of the most  vibrant and interesting places in the world.”",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Tearing Down the Walls: How Sandy Weill Fought His Way to the Top of the Financial World. . .and Then Nearly Lost It All (Wall Street Journal Book)",
        "Authors": "By Langley, Monica",
        "Description": "The very night that Sanford \"Sandy\" Weill, the chairman and chief executive officer of Citigroup, was being feted on the floor of the New York Stock Exchange as CEO of the Year, the television screens above the floor were flashing danger: A congressional panel was tearing into Jack Grubman, the $20-million-a-year telecommunications analyst who worked for Sandy. Had Grubman and Citigroup favored corporate clients at the expense of average investors? Was Citigroup recommending stocks of troubled companies to get their business? The worst scandal of Sandy Weill's long career was breaking around him.  Here, from its very beginning, is the riveting inside story of how a rough-edged kid from Brooklyn overcame incredible odds and deep-seated prejudice to put together Citigroup, the world's largest financial empire, and to transform financial services in America -- for better or worse.  Tearing Down the Walls provides an unprecedented look at how business and finance are conducted at the highest levels, with extraordinary insight into the character and motivations of powerful men and women. And it's the enthralling account of the interplay between power and personality. Sandy Weill, the son of an immigrant dressmaker, is a larger-than-life character, a legendary Wall Street CEO whose innovativeness, opportunism, and even fear drove him from the lowliest job on Wall Street to its most commanding heights. Over a span of five decades he has tangled with -- and usually bested -- some of the most prominent and powerful titans of finance, including the elitist financier John Loeb, the mutual-fund gunslinger and conglomerateur Gerald Tsai, the patrician American Express chairman Jim Robinson, and the cerebral banking visionary John Reed. A consummate deal maker, Sandy Weill amassed and then lost an astounding assemblage of securities firms, only to plunge ahead to rebuild his empire and ultimately create the modern American financial-services supermarket. At the center of Citigroup's recent crises, he's the mogul many are waiting to see topple, while many more are trying to figure out how he succeeded.   Using nearly five hundred firsthand interviews with key players in his life and career -- including Weill himself -- The Wall Street Journal's Monica Langley brilliantly chronicles not only his public persona, but his hidden side: blunt and often crude, yet unpretentious and sometimes disarmingly charming. Tearing Down the Walls reveals Weill's tyrannical rages as well as his tearful regrets, the crass stinginess and the unprecedented generosity, the fierce sense of loyalty and the ruthless elimination of potential rivals -- even those he loves. Langley illuminates a climb to the top filled with class conflict -- Jew against WASP, immigrant against Mayflower descendant, entrepreneur against establishment -- and explores the volatile personality that inspires slavish devotion or utter disdain. By highlighting in new and startling detail one man's life in a narrative as richly textured and compelling as a novel, Tearing Down the Walls provides the historical context of the dramatic changes not only in business but also in American society in the last half century. Compulsively readable, it is also essential for understanding the forces that are reshaping the American financial system today.  The very night that Sanford \"Sandy\" Weill, the chairman and chief executive officer of Citigroup, was being feted on the floor of the New York Stock Exchange as CEO of the Year, the television screens above the floor were flashing danger: A congressional panel was tearing into Jack Grubman, the $20-million-a-year telecommunications analyst who worked for Sandy. Had Grubman and Citigroup favored corporate clients at the expense of average investors? Was Citigroup recommending stocks of troubled companies to get their business? The worst scandal of Sandy Weill's long career was breaking around him.  Here, from its very beginning, is the riveting inside story of how a rough-edged kid from Brooklyn overcame incredible odds and deep-seated prejudice to put together Citigroup, the world's largest financial empire, and to transform financial services in America -- for better or worse.  Tearing Down the Walls provides an unprecedented look at how business and finance are conducted at the highest levels, with extraordinary insight into the character and motivations of powerful men and women. And it's the enthralling account of the interplay between power and personality. Sandy Weill, the son of an immigrant dressmaker, is a larger-than-life character, a legendary Wall Street CEO whose innovativeness, opportunism, and even fear drove him from the lowliest job on Wall Street to its most commanding heights. Over a span of five decades he has tangled with -- and usually bested -- some of the most prominent and powerful titans of finance, including the elitist financier John Loeb, the mutual-fund gunslinger and conglomerateur Gerald Tsai, the patrician American Express chairman Jim Robinson, and the cerebral banking visionary John Reed. A consummate deal maker, Sandy Weill amassed and then lost an astounding assemblage of securities firms, only to plunge ahead to rebuild his empire and ultimately create the modern American financial-services supermarket. At the center of Citigroup's recent crises, he's the mogul many are waiting to see topple, while many more are trying to figure out how he succeeded.   Using nearly five hundred firsthand interviews with key players in his life and career -- including Weill himself -- The Wall Street Journal's Monica Langley brilliantly chronicles not only his public persona, but his hidden side: blunt and often crude, yet unpretentious and sometimes disarmingly charming. Tearing Down the Walls reveals Weill's tyrannical rages as well as his tearful regrets, the crass stinginess and the unprecedented generosity, the fierce sense of loyalty and the ruthless elimination of potential rivals -- even those he loves. Langley illuminates a climb to the top filled with class conflict -- Jew against WASP, immigrant against Mayflower descendant, entrepreneur against establishment -- and explores the volatile personality that inspires slavish devotion or utter disdain. By highlighting in new and startling detail one man's life in a narrative as richly textured and compelling as a novel, Tearing Down the Walls provides the historical context of the dramatic changes not only in business but also in American society in the last half century. Compulsively readable, it is also essential for understanding the forces that are reshaping the American financial system today.",
        "Category": " Biography & Autobiography , Business",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Websters Concise World Atlas",
        "Authors": "By 298, Unknown Author|Cross, Tom|(Firm), Institutio Geografico de Agostini",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Master: A Novel",
        "Authors": "By Toibin, Colm",
        "Description": "“Colm Tóibín’s beautiful, subtle illumination of Henry James’s inner life” (The New York Times) captures the loneliness and hope of a master of psychological subtlety whose forays into intimacy inevitably fail those he tried to love.Beautiful and profoundly moving, The Master tells the story of Henry James, a man born into one of America’s first intellectual families who leaves his country in the late nineteenth century to live in Paris, Rome, Venice, and London among privileged artists and writers. With stunningly resonant prose, “The Master is unquestionably the work of a first-rate novelist: artful, moving, and very beautiful” (The New York Times Book Review). The emotional intensity of this portrait is riveting.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Gods in Alabama",
        "Authors": "By Jackson, Joshilyn",
        "Description": "For 10 years Arlene has kept her promises, and God has kept His end of the bargain. Until now.  When an old schoolmate from Possett turns up at Arlene's door in Chicago asking questions about Jim Beverly, former quarterback and god of Possett High, Arlene's break with her former hometown is forced to an end. At the same time, Burr, her long-time boyfriend, has raised an ultimatum: introduce him to her family or consider him gone. Arlene loves him dearly but knows her lily white (not to mention deeply racist)Southern Baptist family will not understand her relationship with an African American boyfriend. Reluctantly, Arlene bows to the pressure, and she and Burr embark on the long-avoided road trip back home.  As Arlene digs through guilt and deception, her patched-together alibi begins to unravel, and she discovers how far she will go for love and a chance at redemption.*Includes reading group guide",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Creatures",
        "Authors": "By Van Hoesen, Beth",
        "Description": "Gathers portraits of dogs, cats, bulls, sheep, birds, frogs, a vulture, tiger, rabbit, bobcat, rat, rhino, and chinchilla",
        "Category": " Art , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "More Stories for the Heart: The Second Collection",
        "Authors": "By Lucado, Max, Swindoll, Charles R., Arthur, Kay, Smalley, Gary, Graham, Billy, Bombeck, Erma, Dobson, James, Gray, Alice (EDT), and Graham, Ruth",
        "Description": "A sequel to Stories for the Heart, More Stories for the Heart offers up  over one hundred stories that hug readers' hearts and encourage their  souls. This treasury of timeless tales-written by some of the best  Christian communicators today-offers a wealth of compassion and love  certain to minister to multiple generations. Readers will find  themselves sharing these uplifting tales in conversation and letting the  stories' wisdom inspire their thinking. These are stories that will add  flavor to readers' views...and will be carried in their hearts. Whether  read during peaceful moments spent cuddled up by the fire, during  moments basking in the sunshine...or during read-aloud family times with  loved ones, More Stories for the Heart is certain to encourage the  soul.",
        "Category": " Religion , Christian Living , Spiritual Growth",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Sleeping In A Sack: Camping Activities for Kids (Gibbs Smith Jr. Activity)",
        "Authors": "By White, Linda and Lee, Fran (ILT)",
        "Description": "From The Team That Brought You The Deliciously Successful Cooking On A  Stick: Campfire Recipes For Kids Comes  Even More Outdoor Fun For Kids. It's  All Here! You'll Find Out How To Have  A Full, Well-Planned, and Adventurous  Camping Trip--Whether That Trip Is A  Night In The Backyard Or Two Weeks In The Woods. and It's Filled With Lively Illustrations, How-To Diagrams, and  Packing Lists.",
        "Category": " Juvenile Nonfiction , Sports & Recreation , Camping & Outdoor Activities",
        "Publisher": "Gibbs Smith",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Plan of Attack: The Definitive Account of the Decision to Invade Iraq",
        "Authors": "By Woodward, Bob",
        "Description": "Plan of Attack is the definitive account of how and why President George W. Bush, his war council, and allies launched a preemptive attack to topple Saddam Hussein and occupy Iraq. Bob Woodward's latest landmark account of Washington decision making provides an original, authoritative narrative of behind-the-scenes maneuvering over two years, examining the causes and consequences of the most controversial war since Vietnam.  Based on interviews with 75 key participants and more than three and a half hours of exclusive interviews with President Bush, Plan of Attack is part presidential history charting the decisions made during 16 critical months; part military history revealing precise details and the evolution of the Top Secret war planning under the restricted codeword Polo Step; and part a harrowing spy story as the CIA dispatches a covert paramilitary team into northern Iraq six months before the start of the war. This team recruited 87 Iraqi spies designated with the cryptonym DB/ROCKSTARS, one of whom turned over the personnel files of all 6,000 men in Saddam Hussein's personal security organization.  What emerges are astonishingly intimate portraits: President Bush in war cabinet meetings in the White House Situation Room and the Oval Office, and in private conversation; Dick Cheney, the focused and driven vice president; Colin Powell, the conflicted and cautious secretary of state; Donald Rumsfeld, the controlling war technocrat; George Tenet, the activist CIA director; Tommy Franks, the profane and demanding general; Condoleezza Rice, the ever-present referee and national security adviser; Karl Rove, the hands-on political strategist; other key members of the White House staff and congressional leadership; and foreign leaders ranging from British Prime Minister Blair to Russian President Putin.  Plan of Attack provides new details on the intelligence assessments of Iraq's alleged weapons of mass destruction and the planning for the war's aftermath.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "101 Best Family Card Games",
        "Authors": "By Sheinwold, Alfred and Miller, Myron (ILT)",
        "Description": "\"A nicely organized book chockablock with games that can be enjoyed by...a variety of ages....Begins with games that children as young as five can play with their parents, then...a number of more complicated games that older children can easily play on their own...a great assortment...clearly written and easy enough for many children to read on their own. Great for the parenting shelf, or pull the book out for kids on rainy or snowy days.\"--Booklist.",
        "Category": " Games & Activities , Card Games , General",
        "Publisher": "Puzzlewright",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "Beyond Valor: World War II's Ranger and Airborne Veterans Reveal the Heart of Combat",
        "Authors": "By O'Donnell, Patrick K.",
        "Description": "Previous books have promised to describe the combat experience of the World War II GI, but there has never been a book like Patrick O'Donnell's Beyond Valor. Here is the first combat history of the war in Europe in the words of the men themselves, and perhaps the most honest and brutal account of combat possible on the printed page. For more than fifty years the individual stories that make up this narrative -- shockingly frank reflections of sacrifice and courage -- have been bottled up, buried, or circulated privately. Now, nearing the ends of their lives, our WWII soldiers have at last unburdened themselves.  Beyond Valor recaptures their hidden history. A pioneering oral historian, Patrick O'Donnell used his award-winning website, The Drop Zone, to solicit oral- and \"e-histories\" from individual soldiers. Gradually, working from within the community, O'Donnell convinced some of the war's most battle-hardened soldiers to tell their stories. The result is WWII seen through the eyes of the men who saw the most intense of its action. O'Donnell focuses on the elite units of the war -- the Rangers, Airborne, and 1st Special Service Force -- troops that spearheaded the most dangerous operations and often made the difference between victory and defeat.    From more than 650 interviews O'Donnell has chosen oral- and e-histories that form a seamless story line, a pointillistic history of the war in Europe from the first parachute drops in North Africa through the final battles in Germany and the long trip home. It is the story of the war not discussed in polite company.  O'Donnell presents the wreckage of entire battalions nearly annihilated, invisible personal scars, and haunting revelations of wartime atrocities.  But more important are the men who recount lives risked without hesitation for comrades and cause, and those who did not return: the friends who died in their arms. Their stories remind all of us that victory came only at the highest price.  Remembering the infamous cliffs at Pointe-du-Hoc, bloody Omaha Beach, the bitter fighting at the Battle of the Bulge, and Hill 400 in the Hürtgen Forest, the soldiers reveal war as seen, heard, and smelled by the GIs on the front line. Also included is the unique story of the 555th Parachute Infantry Battalion, and the trailblazing African-American \"Experimental\" Test Platoon that had to fight its own battle behind the lines.  Beyond Valor captures the truths that exist among soldiers. It is one of the most inspiring accounts of the war ever produced.",
        "Category": " History , Military , World War II",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Understanding Our Century: Commemorating the 75th Anniversary of The Christian Science Monitor",
        "Authors": "By Editors",
        "Description": "",
        "Category": "",
        "Publisher": "Christian Science Monitor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Favorite restaurant recipes: 500 unforgettable dishes from the R.S.V.P. column of Bon appétit",
        "Authors": "By Bon Appetit",
        "Description": "",
        "Category": "",
        "Publisher": "Knapp Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Dave Barry's Complete Guide to Guys: A Fairly Short Book",
        "Authors": "By Barry, Dave",
        "Description": "A bawdy guide to understanding the male animal notes the differences between men and dogs, warns about the threat of male extinction by feminism and cleanliness standards, and more. 150,000 first printing. Tour.",
        "Category": " Humor , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Man and Superman: A Comedy and Philosophy (Penguin Plays Series)",
        "Authors": "By Shaw, Bernard",
        "Description": "A drama about a modern Don Juan and a discourse on social reform comprise a volume of writings by the Irish dramatist",
        "Category": " Drama , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1950"
        }
    },
    {
        "Title": "Whitetail Wisdom",
        "Authors": "By North American Hunting Club",
        "Description": "",
        "Category": "",
        "Publisher": "North American Hunting Club",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Plantagenet Chronicles",
        "Authors": "By Hallam, Elizabeth (EDT)",
        "Description": "Examines the reigns of Henry II, Richard I, and King John, and discusses the Magna Carta, the Crusades, and life in twelfth-century England",
        "Category": " History , United States , General",
        "Publisher": "Grove Pr",
        "Price Starting With ($)": "7.77",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "America's First Ladies",
        "Authors": "By Caroli, Betty Boyd",
        "Description": "Illuminating the evolution of the role of the President's wife over the centuries, more than two hundred photographs, plus intimate stories and anecdotes, bring each First Lady to life and show how her individual style impacted American culture.",
        "Category": " History , United States , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "29.96",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Chopra Center Cookbook: Nourishing Body and Soul",
        "Authors": "By Chopra, Deepak, Simon, David, and Backer, Leanne",
        "Description": "The food at the world-famous Chopra Center for Well Being is designed to delight the senses, enliven vitality, and tap into the joy of being alive. Now, Deepak Chopra, David Simon, and Leanne Backer offer you marvelous recipes from this extraordinary place of healing?showing how nature provides us with all the nutrients we need to create meals that are delicious as well as nutritious. Combining modern nutritional science and Ayurveda, the most ancient healing system on the planet, The Chopra Center Cookbook features more than 200 appetizing, easy-to-prepare recipes and 30 days of balanced meal plans. You?ll discover a new world of flavor and enjoyment with these low-fat dishes as the authors show you how to eat food that is good for you, re-establish the mind-body connection, and reverse the aging process ZUCCHINI PECAN BREAD ? THAI NOODLES ? BRAISED SALMON WITH MANGO TOMATO SALSA ? EGGPLANT CAULIFLOWER CURRY ? VEGETARIAN PAELLA ? ROSEMARY WHITE BEAN SOUP ? MOTHER EARTH?S APPLE PIE ? RAINBOW RISOTTO ? GREEK GODDESS SALAD ? MOROCCAN VEGETABLES ? SPICY MEXICAN RICE ? VEGETABLE HUMMUS WRAP ? APPLE LEEK CHUTNEY ? MANDARIN TOMATO SALSA ? PEANUT BUTTER COOKIES ? NUTTY FRENCH TOAST ? HOMEMADE ALMOND BUTTER ? BREAKFAST BURRITOS ? MEDITERRANEAN PASTA ? SPINACH POLENTA ? UNBELIEVABLE DOUBLE CHOCOLATE CAK",
        "Category": " Health & Fitness , Nutrition",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Use What You've Got, and Other Business Lessons I Learned from My Mom",
        "Authors": "By Corcoran, Barbara and Littlefield, Bruce",
        "Description": "As one of ten kids in a blue-collar family in Edgewater, New Jersey, Barbara Corcoran didn't have many material advantages. She shared her bedroom with five sisters and shared her socks in a communal sock drawer. Yet she grew up to have plenty of self-confidence, because her mother had an amazing gift for nurturing the unique talents in each of her children. Barbara's mom didn't know much about business, but she understood how the world works, and how to make the most of what you've got.  In the early 1970s, Barbara borrowed $1000 from her boyfriend to get her start in real estate. That led to the birth of The Corcoran Group, which today is New York's premier residential real estate brokerage, with over $1 billion in annual revenue. Her amazing rise to the top has become the stuff of legend and inspiration.  Barbara -- now nicknamed the Queen of New York Real Estate -- credits her success to not just to hard work and determination, but to her mom's enormously valuable advice. Not just the standard maternal wisdom, but real gems such as, \"If the clubhouse is quiet, they're probably not making spaghetti.\"  In Use What You've Got, Corcoran illustrates her mother's wisdom and insight with twenty-five \"how tos\" for getting ahead in business. Each lesson is brought to life with real business scenarios, an outrageous childhood adventure story, and tips garnered from Corcoran's years in the most competitive real estate market in the world.  Her mother's winning advice includes:  ¥ \"There's always room for one more.\" ¥ \"It's your game, make up your own rules.\" ¥ \"You've got to bully a bully.\"  With a tell-it-like-it-is attitude, Corcoran offers her keys to success -- from dressing the part and overcoming obstacles to the nuts and bolts of hiring, firing, motivating, marketing, and much, much more.",
        "Category": " Business & Economics , General",
        "Publisher": "Portfolio Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "The Atheling (Vol I of the Last Legacy)",
        "Authors": "By Chetwin, Grace",
        "Description": "As a courageous man struggles to save Earth from imminent catastrophe, his efforts are paralleled light-years away by a prince who seeks to find himself and to humanize his corrupt civilization",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Long Time Gone: A Novel of Suspense",
        "Authors": "By Jance, Judith A.",
        "Description": "After more than twenty years of distinguished service with the Seattle Police Department, Jonas Piedmont Beaumont is now working for the Washington State Attorney's Special Homicide Investigation Team or, as it's more commonly called, the SHIT squad. But the more things change, the more they stay the same.An eyewitness to a fifty-year-old murder has just come forward, and Beau has been hand-picked to lead the investigation. While undergoing hypnotherapy, a middle-aged nun unexpectedly recalls the grisly details of a cold-blooded killing she witnessed when she was five years old. Though fear has kept these memories repressed for half a century, they've now risen to the surface to cast a harsh light on a deadly plot that spans two generations. And Beau's caught in the glare, facing a ruthless band of coconspirators willing to go to any lengths to keep their secrets hidden.But there's more shaking up Beau's world. His former partner, Ron Peters—caught in a bitter child-custody battle—becomes the prime suspect in his ex-wife's vicious murder. A surrogate parent to Ron's three children, Beau must watch helplessly as his friend spirals through an emotional free fall, his life and family torn to pieces. Everywhere he turns, Beau keeps butting heads with an adversary from the Seattle PD with a personal vendetta. And his growing feelings for Melissa Soames—the squad's newest investigator and Beau's unlikely ally—is a distraction that threatens to open painful old wounds and rouse his personal demons.Filled with all of the Jance trademarks—heart-stopping suspense, deeply drawn characters, local flavor, intelligence, and humanity—Long Time Gone is a crowning achievement in this bestselling author's career.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Rebel Angels (Cornish Trilogy)",
        "Authors": "By Davies, Robertson",
        "Description": ", defrocked monks, mad professors, and wealthy eccentrics-a remarkable cast peoples Robertson Davies' brilliant spectacle of theft, perjury, murder, scholarship, and love at a modern university. Only Mr. Davies, author ofFifth Business, The Manticore, and World of Wonders, could have woven together their destinies with such wit, humour-and wisdom.",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Breakpoint",
        "Authors": "By Clarke, Richard A.",
        "Description": "Against All Enemies warned about how we were conducting the war against terror. The Scorpion's Gate demonstrated what could happen. And now America's preeminent counterterrorism expert and #1 bestselling author shows us all . . .hat might come next.  The global village-an intricately intertwined network of technology that binds together the world's economies, governments, and communication systems. So large, so vital-and so fragile. Now a sophisticated group is seeking to \"disconnect the globe\"-destroying computer grids, communications satellites, Internet cable centers, biotech firms. Hard to do? If only that were so.  Quickly, a dedicated team of men and women assembles to try to track the group down, searching through right-wing militias and Russian organized crime, Jihadist terrorists and enemy nation-states. But the attacks are coming more swiftly now, and growing in destructiveness. Soon, they will reach the breakpoint- and then there may be nothing anybody can do.  Reviewers everywhere praised the suspense and pace of The Scorpion's Gate, the vivid depictions of war, espionage, and bureaucracy, but most of all they hailed its authenticity. \"Unlike most novelists, the man has been there and done that,\" said The New York Times Book Review. \"Some of us,\" added The Washington Post, \"have learned to listen when Richard A. Clarke has something to say.\" And we'd better hope they're listening now.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Stonehenge Revealed",
        "Authors": "By Souden, David",
        "Description": "Between dramatic and colorful photographs, drawings, and maps, Souden assembles the various findings and theories about the renowned prehistoric monument in southwestern England. He considers the landscape, prehistory, the construction, the people, ritual and the heavens, and the legacy. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Social Science , Archaeology",
        "Publisher": "Checkmark Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Tea-totally Dead",
        "Authors": "By Girdner, Jaqueline",
        "Description": "When Kate Jasper agrees to attend a family reunion with her beloved Wayne Caruso, she suddenly finds herself coping with his abrasive mother and his dysfunctional relatives, until someone slips Wayne's mother a lethal cup of herbal tea. Original.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Great Pursuit",
        "Authors": "By Sharpe, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Hell to Pay: A Novel (Derek Strange and Terry Quinn Series, 2)",
        "Authors": "By Pelecanos, George P.",
        "Description": "Derek Strange and Terry Quinn, a team of investigators, are hired to find a fourteen-year-old girl who's run away from her home in the suburbs. It's easy for Strange and Quinn to learn that the girl is now working as a prostitute in one of D.C.'s most brutal neighborhoods. Getting her to leave is harder. The two ex-cops think they know this world - but nothing in their experience has prepared them for the vengeance of Worldwide Wilson, the ruthless operator whose territory they are intruding upon.Their mission is fractured by a violent criminal act against a young player from the neighborhood football team that Strange coaches. Tracking down the perpetrators becomes a point of honor for Strange and Quinn, and their investigation leads them deep inside the city's labyrinth of crime - and back, again, to the lethal Worldwide Wilson.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Arthur & George",
        "Authors": "By Barnes, Julian",
        "Description": "From one of England’s most esteemed novelists, an utter astonishment that captures an era through one life celebrated internationally and another entirely forgotten.In the vast expanse of late-Victorian Britain, two boys come to life: George, the son of a Midlands vicar, and Arthur, in shabby genteel Edinburgh, both of them feeling at once near to and impossibly distant from the beating heart of Empire. One falls prey to a series of pranks en route to a legal vocation, while the other studies medicine before discovering a different calling entirely, and it is years before their destinies are entwined in a mesmerizing alliance. We follow each through outrageous accusation and unrivaled success, through faith and perseverance and dogged self-recrimination, whether in the dock awaiting complete disgrace or at the height of fame while desperately in love with a woman not his wife, and gradually realize that George is half-Indian and that Arthur becomes the creator of the world’s most famous detective. Ranging from London clubs to teeming prisons, from a lost century to the modern age, this novel is a panoramic revelation of things we thought we knew or else had no clue of, as well as a gripping exploration of what goals drive us toward whatever lies in wait–an experience resounding with issues, no less relevant today, of crime and spirituality; of identity and nationality; of what we think, what we believe and what we can prove.Intriguing, relentless and, most of all, moving, Arthur & George richly extends the reach and achievement of a novelist described by the Philadelphia Inquirer as “a dazzling mind in mercurial flight.”",
        "Category": " Fiction , Literary",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.85",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Jackdaws",
        "Authors": "By Follett, Ken",
        "Description": "D day is approaching. They don't know where or when, but the Germans know it'll be soon, and for Felicity \"Flick\" Clairet, the stakes have never been higher. A senior agent in the ranks of the Special Operations Executive (SOE) responsible for sabotage, Flick has survived to become one of Britain's most effective operatives in northern France. She knows that the Germans' ability to thwart the Allied attack depends upon their lines of communication, and in the days before the invasion, no target is of greater strategic importance than the largest telephone exchange in Europe.But when Flick and her Resistance leader husband try a direct, head-on assault that goes horribly wrong, her world turns upside down. Her group destroyed, her husband missing, her superiors unsure of her, her own confidence badly shaken, she has one last chance at the target, but the challenge, once daunting, is now near-impossible. The new plan requires an all-woman team, none of them professionals, to be assembled and trained within days. Codenamed the Jackdaws, they will attempt to infiltrate the exchange under the noses of the Germans - but the Germans are waiting for them now and have plans of their own. There are secrets Flick does not know - secrets within the German ranks, secrets among her hastily-recruited team, secrets among those she trusts the most. And as the hours tick down to the point of no return, most daunting of all, there are secrets within herself.",
        "Category": " Fiction , War & Military",
        "Publisher": "Dutton",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Letters to My Daughters",
        "Authors": "By Matalin, Mary",
        "Description": "In Letters to My Daughters, famed political consultant and TV personality Mary Matalin shares the moral, ethical, and occasionally comic life lessons gleaned from her mother's experiences and her own. These intimate, personal letters range from the spiritual to the practical, from giving life to accepting death, from civic to personal responsibility, from looking and feeling good to dealing with those pesky boys, and more.Here's a sampling of the mother wisdom found in these pages:Crying is not a weakness; it's cathartic and cleansing. People who live life with the fullest commitment tend to cry a lot. It's a healthy expression of deep emotions. I don't like or trust people who don't or can't cry.When I tell you I understand what you're going through, it's not just because I remember what it felt like to be a teenage girl whose body is being hijacked by hormones against her will. It's because I'm a fifty-something whose body is being hijacked by hormones against her will at this very moment. And if you don't believe me, just ask your father.I believe in my heart of hearts that a life without faith is unanchored and unfulfilling. Without it, you're just wandering in the desert. You experience deeply that the whole is greater than the sum of its parts -- and the singing is damn good.Ma had a complex philosophy of sex, which I heard almost every day from age ten. \"Boys would screw a snake if it would lay still long enough.\" Let's flash forward forty years and allow your mother to give you a twenty-first-century take on boys and S-E-X: \"Boys would screw a snake if it would lay still long enough.\"...And the men in Washington think that's a compliment.A deep sense of loyalty can help you overcome almost any bump in the road. The disloyal may advantage themselves in some work situations, but their gains will be temporary, fleeting. They will fail their institutions, their colleagues, and worst of all, themselves.Filled with warmth, common sense, a belief in the values that keep families strong, and her trademark sense of humor, Mary Matalin's letters will inspire, guide, entertain, and inform. They're the perfect companion for any mother looking for a smart, sensible fellow traveler on the road to raising good daughters.",
        "Category": " Family & Relationships , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Nimrod Hunt",
        "Authors": "By Sheffeild, Charles",
        "Description": "The appearance of non-living biological constructs threatens all life in the galaxy, and only the human of Earth stand between the galaxy and total annihilation",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "The Kingfisher A-Z Encyclopedia: Up-to-the-Minute Information",
        "Authors": "By Hoare, Ben (EDT)",
        "Description": "With its easy-to-use alphabetical organization and wide-ranging coverage, the Kingfisher A-Z Encyclopedia is an excellent starting point for children researching school assignments and an authoritative reference the entire family can share.Every area of information is covered, from plants, food, science, travel, the human body, and politics to animals, language, religion, sports, history, machines, and space. The extensive cross-referencing widens the scope of information available to the child hungry for knowledge, while the convenient A-Z format makes fast work of finding facts and figures. Packed with richly detailed color illustrations, succinct captions, and up-to-date information, the Kingfisher A-Z Encyclopedia is a delight to use and makes a perfect gift for a favorite youngster.Special Features•  Over 1,500 entries packed with information about every subject area•  Superb illustrations, cutaways, and photographs•  Fact features and special country panels for easy reference•  Hundreds of cross-references•  Comprehensive index",
        "Category": " Juvenile Nonfiction , Reference , Encyclopedias",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "7.57",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Chaos Weapon",
        "Authors": "By Kapp, Colin",
        "Description": "",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1977"
        }
    },
    {
        "Title": "Velocity",
        "Authors": "By Koontz, Dean R.",
        "Description": "Dean Koontz’s unique talent for writing terrifying thrillers with a heart and soul is nowhere more evident than in this latest suspense masterpiece that pits one man against the ultimate deadline. If there were speed limits for the sheer pulse-racing excitement allowed in one novel, Velocity would break them all. Get ready for the ride of your life.…Bill Wile is an easygoing, hardworking guy who leads a quiet, ordinary life. But that is about to change. One evening, after his usual eight-hour bartending shift, he finds a typewritten note under the windshield wiper of his car. If you don’t take this note to the police and get them involved, I will kill a lovely blond schoolteacher. If you do take this note to the police, I will instead kill an elderly woman active in charity work. You have four hours to decide. The choice is yours.It seems like a sick joke, and Bill’s friend on the police force, Lanny Olson, thinks so too. His advice to Bill is to go home and forget about it.  Besides, what could they do even if they took the note seriously? No crime has actually been committed. But less than twenty-four hours later, a young blond schoolteacher is found murdered, and it’s Bill’s fault: he didn’t convince the police to get involved.  Now he’s got another note, another deadline, another ultimatum…and two new lives hanging in the balance.Suddenly Bill’s average, seemingly innocuous life takes on the dimensions and speed of an accelerating nightmare. Because the notes are coming faster, the deadlines growing tighter, and the killer becoming bolder and crueler with every communication—until Bill is isolated with the terrifying knowledge that he alone has the power of life and death over a psychopath’s innocent victims. Until the struggle between good and evil is intensely personal.  Until the most chilling words of all are: The choice is yours.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "International Adoption Handbook",
        "Authors": "By Alperson, Myra",
        "Description": "Foreign adoption is an often tricky, sometimes treacherous venture that is steadily gaining in popularity. Myra Alperson realizes that families pursuing this avenue of adoption need all the help they can get-and she fits it all into this handy guide.",
        "Category": "",
        "Publisher": "SMP Paperback",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Heart of a Family: Searching America for New Traditions That Fulfill Us",
        "Authors": "By Cox, Meg",
        "Description": "Parents today face an uphill battle: How can they make a haven of home and create treasured traditions when family time is besieged on every side? As a new mother, Meg Cox faced these concerns and began a quest to find new   traditions powerful enough to compete with the distractions and dislocations of contemporary life.  In this warm and wise book, Meg Cox shares what she found on her search and introduces us to the families who taught her. She learned what sorts of rituals help hold families together, from grand holiday bashes to everyday bedtime routines, and why they have such a lasting impact on children, guiding them safely through crucial transitions and reinforcing a sense of identity.        Meg Cox interviewed more than two hundred diverse families for this book, and found they are not only celebrating milestones and holidays in distinctive ways but also using ritual effectively in every phase of their lives, from the practical to the whimsical. She tells the story of Suzy Kellett, who raised quadruplets on her own and used rituals to keep the family close. In Merchantsville, N.J., the Lynch family has a \"Happiness Party\" when everyone is down in the dumps, and Mary Sutton of Wyoming made up a seatbelt-buckling ritual after the family was in a minor car accident. There are rituals here that break up sibling fights, scare away under-the-bed monsters, make an adopted child feel cherished, and celebrate a girl's first period.        Cox's reporting brings us new versions of favorite holiday traditions, as well as fresh rituals tailor-made for the demands of contemporary life. She gives valuable advice on creating new traditions from scratch, and also talks candidly about ritual's potential pitfalls, explaining when and how rituals should be changed or dropped.  The \"Heart of a Family is a joyous, welcoming, but always realistic book, full of activities and ideas that have been road-tested in the tumult of daily family experience. It will enrich your family life for years to come.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Western Guide to Feng Shui",
        "Authors": "By Collins, Terah Kathryn and Kathryn, Terah",
        "Description": "",
        "Category": " Architecture , Interior Design , General",
        "Publisher": "Hay House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "What Do We Have for the Witnesses, Johnnie?",
        "Authors": "By G. B. Trudeau",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Swimming (Ballantine Reader's Circle)",
        "Authors": "By Hershon, Joanna",
        "Description": "Twenty years ago, Vivian Silver abandoned her dreams of travel to marry the mysterious Jeb Wheeler, seduced both by his unnerving charm and his acres of untamed New Hampshire land. The hand-built house and swimming pond become the center of the universe for their entire family. Lila, their youngest, is consumed with love for her two older brothers, Aaron and Jack, and remains blind to the simmering tension between them. For beneath the surface of their idyllic setting lies a depth of explosive feeling that none of them can control. Into this heated atmosphere glides Aaron’s girlfriend, Suzanne, whose presence is threatening, exciting; Lila thrills to the ominous quality of Aaron’s absolute adoration for this young woman. Before her visit is over, Suzanne will unleash the forces of rage between Aaron and Jack, compelling one brother to commit an act against the other that can never be taken back.A decade later, living in New York, Lila still searches for Aaron, who disappeared that night, and Suzanne, whose mystique still exerts a hold on her memory. For Lila to move past her family’s tragedy, she must piece together what happened that fateful weekend–and recover the things lost down by the water–before she can at last let them go.A stunning literary novel that captures the lingering effects of longing and loss, Swimming is by turns a gripping family story, a heartbreaking coming of age journey, and a suspenseful psychological investigation into the meaning and limits of fidelity, identity, and intimacy.From the Hardcover edition.",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Cat Who Went into the Closet",
        "Authors": "By Braun, Lilian Jackson",
        "Description": "In this charming Cat Who mystery, a misused mansion sets the stage for a strange caper for Jim Qwilleran and his cats Koko and Yum Yum.Qwill’s moved into the old Gage mansion—and the cats are on a treasure hunt. The house’s fifty closets are crammed with several generations of junk, and while Qwill investigates two recent deaths—those of the mansion’s former occupant and a local potato farmer—Koko investigates the contents of the closets. Qwill and the cats wind up unearthing some surprising skeletons—and bringing long-buried secrets to light...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Book of the Dead (Pendergast, Book 7)",
        "Authors": "By Child, Lincoln and Preston, Douglas",
        "Description": "An FBI agent, rotting away in a high-security prison for a murder he did not commit...His brilliant, psychotic brother, about to perpetrate a horrific crime...A young woman with an extrodinary past, on th edge of a violent breakdown...An ancient Egyptian tomb with an enigmatic curse, about to be unveiled at a celebrity-studded New York gala...Memento Mori",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Type Talk at Work: How the 16 Personality Types Determine Your Success on the Job",
        "Authors": "By Kroeger, Otto and Thuesen, Janet M.",
        "Description": "",
        "Category": " Psychology , Reference",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "TWICE LOVED",
        "Authors": "By LaVyrle Spencer",
        "Description": "",
        "Category": "",
        "Publisher": "Jove Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Lawyers and Other Reptiles",
        "Authors": "By Brallier, Jess M.",
        "Description": "A witty collection of quips, quotations, and curses takes aim at the legal profession, ranging in hostility from gentle teasing to fierce loathing.  By the author of The Pessimist's Journal of Very, Very Bad Days.",
        "Category": " Humor , Topic , Business & Professional",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Starting a small restaurant: A guide to excellence in the purveying of public victuals",
        "Authors": "By Miller, Daniel",
        "Description": "",
        "Category": "",
        "Publisher": "distributed by Independent Publishers Group]",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Encounters with the Archdruid: Narratives About a Conservationist and Three of His Natural Enemies",
        "Authors": "By McPhee, John A.",
        "Description": "The narratives in this book are of journeys made in three wildernesses - on a coastal island, in a Western mountain range, and on the Colorado River in the Grand Canyon. The four men portrayed here have different relationships to their environment, and they encounter each other on mountain trails, in forests and rapids, sometimes with reserve, sometimes with friendliness, sometimes fighting hard across a philosophical divide.",
        "Category": " Nature , Ecology",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The 100 Best Bulbs : A Practical Encyclopedia",
        "Authors": "By McDonald, Elvin",
        "Description": "In The 100 Best Bulbs, horticultural authority Elvin McDonald simplifies selecting, planting, and maintaining bulbs by presenting his choice of \"the cream of the crop.\" With comprehensive, accessible entries and advice on everything from fertilizing to flower arranging, this hands-on encyclopedia is an indispensable reference tool for gardeners at all levels of expertise.The book includes an individual listing for each plant: description, suggestion for use, and detailed instructions for cultivation and maintenance; over 125 full-color illustrations that make identification easy; seasonal checklist for year-round gardening; troubleshooting guide; and source list of nurseries and suppliers of plants and equipment.",
        "Category": " Gardening , Flowers , Bulbs",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Chronic Fatigue Syndrome",
        "Authors": "By Fisher, Gregg Charles (CON)",
        "Description": "Fisher reveals what life is like on the front lines in the battle against this often misunderstood disease. He also offers constructive advice on coping with the illness and provides important information.",
        "Category": " Health & Fitness , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Jemima J: A Novel About Ugly Ducklings and Swans",
        "Authors": "By Green, Jane",
        "Description": "Jemima Jones is overweight.  About one hundred pounds overweight.  Treated like a maid by her thin and social-climbing roommates, and lorded over by the beautiful Geraldine (less talented but better paid) at the Kilburn Herald, Jemima finds that her only consolation is food.  Add to this her passion for her charming, sexy, and unobtainable colleague Ben, and Jemima knows her life is in need of a serious change.  When she meets Brad, an eligible California hunk, over the Internet, she has the perfect opportunity to reinvent herself–as JJ, the slim, beautiful, gym-obsessed glamour girl.  But when her long-distance Romeo demands that they meet, she must conquer her food addiction to become the bone-thin model of her e-mails–no small feat.  With a fast-paced plot that never quits and a surprise ending no reader will see coming, Jemima J is the chronicle of one woman's quest to become the woman she's always wanted to be, learning along the way a host of lessons about attraction, addiction, the meaning of true love, and, ultimately, who she really is.",
        "Category": " Fiction , Literary",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Innocent Man: Murder and Injustice in a Small Town",
        "Authors": "By Grisham, John",
        "Description": "John Grisham’s first work of nonfiction, an exploration of small town justice gone terribly awry, is his most extraordinary legal thriller yet.In the major league draft of 1971, the first player chosen from the State of Oklahoma was Ron Williamson. When he signed with the Oakland A’s, he said goodbye to his hometown of Ada and left to pursue his dreams of big league glory.Six years later he was back, his dreams broken by a bad arm and bad habits—drinking, drugs, and women. He began to show signs of mental illness. Unable to keep a job, he moved in with his mother and slept twenty hours a day on her sofa.In 1982, a 21-year-old cocktail waitress in Ada named Debra Sue Carter was raped and murdered, and for five years the police could not solve the crime. For reasons that were never clear, they suspected Ron Williamson and his friend Dennis Fritz. The two were finally arrested in 1987 and charged with capital murder.With no physical evidence, the prosecution’s case was built on junk science and the testimony of jailhouse snitches and convicts. Dennis Fritz was found guilty and given a life sentence. Ron Williamson was sent to death row.If you believe that in America you are innocent until proven guilty, this book will shock you. If you believe in the death penalty, this book will disturb you. If you believe the criminal justice system is fair, this book will infuriate you.",
        "Category": " True Crime , Murder , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "I Am Rosa Parks (Penguin Young Readers, Level 4)",
        "Authors": "By Parks, Rosa, Haskins, James, and Clay, Wil (ILT)",
        "Description": "When Rosa Parks refused to give up her seat on a bus to a white man on December 1, 1955, she made history. Her brave act sparked the Montgomery, Alabama bus boycott and brought the civil rights movement to national attention. In simple, lively language, Rosa Parks describes her life from childhood to the present and recounts the events that shook the nation. Her story is powerful, inspiring and unforgettable.An NCSS-CBC Notable Children's Trade Book in the Field of Social Studies",
        "Category": " Juvenile Fiction , Social Themes , Prejudice & Racism",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "The Great Migration: An American Story",
        "Authors": "By Lawrence, Jacob",
        "Description": "This critically acclaimed picture book suitable for a wide range of readers chronicles the Great Migration—the diaspora of African Americans who headed to the North after WWI—through the iconic paintings and words of renowned artist Jacob Lawrence. The New York Times praised it as \"a compassionate and sensitive portrayal of history.”After World War I, large numbers of African Americans began leaving their homes in the rural South in search of employment, and a better life, in the industrial cities of the North like Chicago and Pittsburgh.Jacob Lawrence chronicled their journey of hope in his sixty-panel Migration Series, a flowing narrative sequence of paintings that can now be found divided between the Museum of Modern Art and the Phillips Collection.In this profound picture book, Lawrence brings all those landmark paintings together and pairs them with poetic text that further explores the experience of those enduring this mass exodus. From dealing with poor working conditions and competition for living space to widespread prejudice and racism, this is the story of strength, courage, and hope of the more than six million African Americans who were trying to build better lives for themselves and their families. This book features an introduction from Lawrence—whose family was part of this great migration—about its personal significance as well as a poem by Newbery Honor author Walter Dean Myers.ALA Notable BookALA Booklist Editors’ ChoiceIRA/CBC Teachers' ChoiceNotable Children's Trade Book in the Field of Social Studies (NCSS/CBC)Carter G. Woodson Outstanding Merit Book",
        "Category": " Juvenile Fiction , Historical , United States , 20th Century",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The High Place: a Comedy of Enchantment",
        "Authors": "By Cabell, James Branch",
        "Description": "",
        "Category": "",
        "Publisher": "Robert M. McBride",
        "Price Starting With ($)": "47.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1923"
        }
    },
    {
        "Title": "The Gardener's Guide to Plant Conservation",
        "Authors": "By Marshall, Nina T.",
        "Description": "",
        "Category": "",
        "Publisher": "World Wildlife Fund",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Private wants and public needs;: Issues surrounding the size and scope of Government expenditure (Problems of the modern economy)",
        "Authors": "By Edmund S. Phelps",
        "Description": "",
        "Category": "",
        "Publisher": "w.w. norton",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Taylor's Guide to Annuals (Taylor's Guide to Gardening)",
        "Authors": "By Taylor, Norman",
        "Description": "Annuals are often the first plants that new gardeners buy. They are also valuable to the gardener looking for color all season, flowers for cutting, and replacements for spring bulbs. This guide is organized by flower color and provides useful information for all soil types and climate for gardeners who want to add variety to their flower beds.",
        "Category": " Gardening , Flowers , Annuals",
        "Publisher": "Houghton Mifflin (P)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "Arctic National Wildlife Refuge: Seasons of Life and Land",
        "Authors": "By Matthiessen, Peter, Carter, Jimmy (FRW), Schaller, George B., Miller, Debbie S., Banerjee, Subhankar, Mauer, Fran, Meadows, William H., and Sibley, David Allen",
        "Description": "Examines the threats to the ecological stability of the Arctic National Wildlife Refuge from global warming and oil development.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Braided River",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Nor any drop to drink",
        "Authors": "By Ashworth, William",
        "Description": "",
        "Category": "",
        "Publisher": "distributed by Simon and Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Yellow Wallpaper and Other Stories (Dover Thrift Editions)",
        "Authors": "By Gilman, Charlotte Perkins",
        "Description": "Best known for the 1892 title story of this collection, a harrowing tale of a woman's descent into madness, Charlotte Perkins Gilman wrote more than 200 other short stories. Seven of her finest are reprinted here.Written from a feminist perspective, often focusing on the inferior status accorded to women by society, the tales include \"Turned,\" an ironic story with a startling twist, in which a husband seduces and impregnates a naïve servant; \"Cottagette,\" concerning the romance of a young artist and a man who's apparently too good to be true; \"Mr. Peebles' Heart,\" a liberating tale of a fiftyish shopkeeper whose sister-in-law, a doctor, persuades him to take a solo trip to Europe, with revivifying results; \"The Yellow Wallpaper\"; and three other outstanding stories.These charming tales are not only highly readable and full of humor and invention, but also offer ample food for thought about the social, economic, and personal relationship of men and women — and how they might be improved.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Great Depression",
        "Authors": "By McElvaine, Robert S.",
        "Description": "",
        "Category": "",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "A Portrait of the Artist as a Young Man (Dover Thrift Editions)",
        "Authors": "By Joyce, James",
        "Description": "Like much of James Joyce's work, A Portrait of the Artist as a Young Man is a fictional re-creation of the Irish writer's own life and early environment. The experiences of the novel's young hero, Stephen Dedalus, unfold in astonishingly vivid scenes that seem freshly recalled from life and provide a powerful portrait of the coming of age of a young man of unusual intelligence, sensitivity, and character.The interest of the novel is deepened by Joyce's telling portrayals of an Irish upbringing and schooling, the Catholic Church and its priesthood, Parnell and Irish politics, encounters with the conflicting roles of art and morality (problems that would follow Joyce throughout his life), sexual experimentation and its aftermath, and the decision to leave Ireland.Rich in details that offer vital insights into Joyce's art, this masterpiece of semiautobiographical fiction remains essential reading in any program of study in modern literature.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Complete Idiot's Guide To Learning German On Your Own",
        "Authors": "By Muller, Alice and Muller, Stephan",
        "Description": "You're no idiot.  You've mastered one of the trickiest languages on earth, English. You've trained your German shepherd, you cook strudel like a hausfrau, and you drive a Volkswagen with ease.  But when you enven think about conjugating a German verb or asking for directions in the Black Forest, you feel like a Dummkoph.  Don't despair!  The Complete Idiot's Guide to Learning German on Your Own gives you the help you need to begin speaking German today. Using the exercises and examples in this book, you'll soon be speaking German like a native.  In this Complete Idiot's Guide you get:",
        "Category": " Foreign Language Study , General",
        "Publisher": "Alpha Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Death by Choice",
        "Authors": "By Maguire, Daniel C.",
        "Description": "A theologian addresses himself to the right to death issue and considers the moral, medical, and legal dilemmas that have emerged. Bibliogs",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "April",
            "Year": "1974"
        }
    },
    {
        "Title": "Are Men Necessary?: When Sexes Collide",
        "Authors": "By Dowd, Maureen",
        "Description": "Fresh from her success with the best-selling Bushworld, Maureen Dowd turns her sparkling prose and wise wit to a topic even more incendiary than presidential politics: sexual politics.  Four decades after the sexual revolution, nothing has worked out the way it was supposed to. The sexes are circling each other as uneasily and comically as ever, from the bedroom to the boardroom to the Situation Room, and now the New York Times columnist who won a Pulitzer Prize in 1999 for saucy and incisive commentary about the dangerous liaisons of Bill, Monica, Hillary and Ken Starr digs into the Y and X files, exploring the mysteries and muddles of sexual combat in America.  In a new book filled with chapters that surprise and amuse, Dowd explains why getting ready for a date went from glossing and gargling to Paxiling and Googling; why men are in an evolutionary and romantic shame spiral; why women have reeled backward in many ways; why men may be biologically unsuited to hold higher office, given their diva fits and catfights, teary confessions and fashion obsessions; why women are fixated on their looks more than ever, freezing their faces and emotions in an orgy of plasticity that makes the Stepford Wives look authentic; why male politicians and male institutions get tripped up in so much monkey business; why many alpha women, from Martha to Hillary, can have a successful second act only after becoming humiliated victims; and why the new definition of Having It All is less about empowerment and equality than about flirting and getting rescued, downshifting from \"You go, girl!\" to \"You go lie down, girl.\"  In addition, Dowd, who has reported on historic moments on the sexual battlefield, from Geraldine Ferraro's vice-presidential run to the Anita Hill-Clarence Thomas hearings to Hillary Rodham Clinton's reign as copresident, explores not only how many of these shining feminist triumphs backfired on women but also how Hillary, a feminist icon busy plotting her campaign to be the first woman president, delivered the final blow to female solidarity herself.  Women's liberation has been less a steady trajectory than a confusing zigzag. Feminism lasted for a nanosecond and generated a gender tangle that has bewitched, bothered and bewildered men and women for forty years. Now comes a woman to cut through the tangle and tickle Adam's rib. The battle of the sexes will never be the same.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Loony Laws & Silly Statutes",
        "Authors": "By Miller, Myron (ILT) and Lindsell-Roberts, Sheryl",
        "Description": "Hundreds of the most ridiculous rules lawmakers have ever put into writing, drawn from actual city, state, and federal statute books. Find what has been forbidden about keeping pets (cats require tail lights in Sterling, Colorado), fishing and hunting, marriage, going to school, and much more.    128 pages, 75 b/w illus., 5 3/8 x 8 1/4.",
        "Category": " Law , General",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Fire Arrow: A Novel",
        "Authors": "By Leib, Franklin Allen",
        "Description": "The terrorist hijacking of a chartered Navy aircraft sets the stage for frantic negotiations between the United States and the Soviet Union and a dramatic, split-second rescue attempt that threatens to explode into global conflict",
        "Category": " Fiction , General",
        "Publisher": "Presidio Pr",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Sphinx (A Medical Thriller)",
        "Authors": "By Cook, Robin",
        "Description": "It was the magic and mystery of an empire long past that beautiful Erica Baron came to explore. Innocently she cast her eyes in forbidden places and discovered the clue to a treasure beyond imagination. It was then that terror overtook her, as the most fearful curse of the ancient world and the most savage menace of the modern one threatened to detroy her. One dangerously attractive man offered Erica help...he offered her protection...he offered her love. And in this strange, exotic land of seductive evils, where no one could be trusted, desire became for Erica the deadliest snare of all...",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "G.P Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Eyewitness on Alcatraz, Life on The Rock as told by the Guards, Families & Prisoners.",
        "Authors": "By Babyak, Jolene",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Ariel Vamp Pr",
        "Price Starting With ($)": "13.46",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "In Search of Nixon: A Psychohistorical Inquiry",
        "Authors": "By Mazlish, Bruce",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1973"
        }
    },
    {
        "Title": "Great Government Goofs: Over 350 Loopy Laws, Hilarious Screw-Ups and Acts-Idents of Congress",
        "Authors": "By Gregory, Leland",
        "Description": "Here is the utterly amazing, laugh-out loud scoop on the local, state, and federal foul-ups supported by your tax dollars. From Washington D.C. to Small Town, U.S.A., you can count on one thing from our government...Bloopers!A federal computer glitch listed everyone in Hartford, Connecticut as dead.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Witch's House",
        "Authors": "By Charlotte Armstrong",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Crest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Star Precinct",
        "Authors": "By Randle, Kevin and Driscoll, Richard",
        "Description": "The members of the 107th Precinct are ready to handle the crime problems of the universe, but they are not as well equipped to deal with the death of a fellow officer. Original.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Wildflowers : Seasonal Splendors of the North American West",
        "Authors": "By Osborne, Graham and Hume, Stephen",
        "Description": "",
        "Category": " Nature , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Perennials",
        "Authors": "By Harper, Pamela",
        "Description": "Discusses the various ways of using perennials and offers advice on the care of more than 250 perennial plants",
        "Category": " Gardening , Flowers , Perennials",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Harrowsmith Perennial Garden: Flowers for Three Seasons",
        "Authors": "By Lima, Patrick",
        "Description": "The Harrowsmith Perennial Garden is your key to a beautiful, well-designed garden, featuring flowers that will bloom continually from spring through fall and provide a progression of eye-catching color throughout the growing season.",
        "Category": " Gardening , Flowers , Perennials",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "The New Encyclopedia of American Trees",
        "Authors": "By Walters, Martin, Russell, Tony, and Cutler, Catherine",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Turning Point: A Candidate, a State, and a Nation Come of Age",
        "Authors": "By Carter, Jimmy",
        "Description": "The former president's personal tale of political intrigue and social conflict during his first campaign for public office. Iluminates the origins of his commitment to human rights and bears further witness to the accomplishments of an extraordinary man.",
        "Category": " History , United States , General",
        "Publisher": "Times Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "The Dead Father",
        "Authors": "By Barthelme, Donald",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Frederick Douglass (African American)",
        "Authors": "By Chesnutt, Charles Waddell",
        "Description": "Concise, readable survey examines the life of a leading spokesman for abolition and one of the most influential promoters of the civil rights movement. Covers Douglass' early life in slavery, his escape from Maryland to New York, his power and charisma as a public speaker, and much more.",
        "Category": " Biography & Autobiography , Cultural, Ethnic & Regional , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Complete Family Guide to Alternative Medicine",
        "Authors": "By Shealy, C. Norman",
        "Description": "",
        "Category": "",
        "Publisher": "Element Books Inc",
        "Price Starting With ($)": "7.15",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "American Country Christmas 1992",
        "Authors": "By Oxmoor House, Nancy Fitzpatrick",
        "Description": "Presents recipes, decorating ideas, and craft projects to bring the holiday season to life",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Dictionary of Problem Words and Expressions by Harry Shaw (1987-02-03)",
        "Authors": "By Shaw, Harry",
        "Description": "Defines, explains, and illustrates more than 1500 of the most common mistakes in word use made in English. Includes a brief guide to more effective writing and speaking.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "The Makers of the Western Tradition",
        "Authors": "By Sowards, J. Kelley",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1979"
        }
    },
    {
        "Title": "See the USA the Easy Way (Reader's Digest)",
        "Authors": "By Lipsitz, Alexis and Wait, Marianne",
        "Description": "Presents 136 customized tours that cover every region, highlight historic towns, scenic drives, local festivals, and unusual museums, and includes special sections on restaurants, lodgings, and famous landmarks. 25,000 first printing.",
        "Category": " Travel , Reference",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The hidden minority: A profile of handicapped Americans",
        "Authors": "By Kleinfield, Sonny",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Lord Vanity",
        "Authors": "By Samuel Shellabarger",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "Granta 28: Birthday Surprise, 10th Anniversary Issue",
        "Authors": "By Buford, Bill, Stewart, Lucretia, and Adams, Tim",
        "Description": "Essays and stories deal with violence in China, travel, South African architecture, the past pilgrimages, death, and fame",
        "Category": "",
        "Publisher": "Granta Publications Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "The Recipes of the Five Brothers - Volume III (The Recipes of the Five Brothers, 3)",
        "Authors": "By Five Brothers",
        "Description": "",
        "Category": "",
        "Publisher": "Lipton",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "William Newman: Peripheral vision",
        "Authors": "By Schmidt, Stacey J",
        "Description": "",
        "Category": "",
        "Publisher": "Corcoran Gallery of Art",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Connecticut Yankee;: An autobiography",
        "Authors": "By Cross, Wilbur L.",
        "Description": "",
        "Category": "",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "23.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1943"
        }
    },
    {
        "Title": "Making Things Grow Indoors",
        "Authors": "By Cruso, Thalassa",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "The New Art: A Critical Anthology",
        "Authors": "By Battcock, Gregory (EDT)",
        "Description": "Surveys the nature, function, and value of modern art and illustrates the trends and standards of contemporary criticism.",
        "Category": " Art , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1973"
        }
    },
    {
        "Title": "101 Careers: A Guide to the Fastest-Growing Opportunities",
        "Authors": "By Harkavy, Michael David",
        "Description": "Explores over 100 occupations that are predicted to be among the fastest growing throughout the 1990s. The Bureau of Labor Statistics expects that all of the jobs that appear in this book will grow between 20 and 30 percent in the coming decade. Each entry includes an introductory overview, descriptions of the nature of the work, working conditions, training and qualifications, advancement and salary, and job prospects. Also included are separate essays on regional trends in employment and the role and effect of women and minorities in the workplace. Resource listings of corporations by industry and region, trade magazines by industry, professional organizations, and employment agencies and search firms can also be found.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Lord of the Silent",
        "Authors": "By Peters, Elizabeth",
        "Description": "“Irresistible….Amelia is still a joy.” —New York Times Book Review The intrepid archeologist Amelia Peabody and her fearless family, the Emersons, are back in Egypt, and something very nasty is afoot in Lord of the Silent—New York Times bestselling Grandmaster Elizabeth Peters’s sparkling adventure with more riddles than the Sphinx and more close calls and stunning escapes than  an Indiana Jones movie. Reviewers are simply agog over Lord of the Silent, calling it, “Wonderfully entertaining” (Washington Times), “Deeply satisfying”  (Entertainment Weekly), and in the words of the Toronto Globe and Mail, “The hype is true. This is Peters’s best book.”",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Dining in France",
        "Authors": "By Millau, Christian",
        "Description": "Provides a gastronomic tour of the greatest restaurants and the best of regional foods throughout France and features recipes for numerous specialty dishes",
        "Category": " Cooking , General",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "Brother's War",
        "Authors": "By Tapert, Annette (EDT)",
        "Description": "Written in an era without military censorship, these ninety letters cover the war from its beginning through the assassination of Lincoln",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Saint Peter: A Biography",
        "Authors": "By Michael Grant",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Tribulation to triumph: A mandate for today's church",
        "Authors": "By Parsley, Rod",
        "Description": "",
        "Category": "",
        "Publisher": "Harrison House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    }
]