[
    {
        "Title": "The Greatest Skits on Earth (Volume 2)",
        "Authors": "By Yaconelli, Mike and Rice, Wayne",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Classic Brainteasers",
        "Authors": "By Sinclair, Jeff (ILT) and Gardner, Martin",
        "Description": "“From math, science, and logic puzzlers to word games to what’s-wrong-with-this-picture challenges. Cartoon illustrations give the book pick-me-up appeal, but it’s the games themselves that will keep readers going as they match wits with Gardner, challenge their friends, or simply read along and look up the answers in the back.”—Booklist.",
        "Category": " Games & Activities , Puzzles",
        "Publisher": "Puzzlewright",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Biology, Fourth Edition",
        "Authors": "By Arms, Karen",
        "Description": "",
        "Category": " Science , Life Sciences , Biology",
        "Publisher": "Saunders College Pub",
        "Price Starting With ($)": "10.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "A Complaint Is a Gift: Recovering Customer Loyalty When Things Go Wrong",
        "Authors": "By Barlow, Janelle and Moller, Claus",
        "Description": "The first edition of A Complaint Is a Gift introduced a revolutionary notion: customer complaints are a valuable feedback mechanism that can help organizations rapidly and inexpensively strengthen products, service style, and market focus. In fact, they’re the best bargain around in market research.  Using numerous real-life examples, Janelle Barlow and Claus Møller show precisely how to handle complaints to bring benefit to your organization and satisfaction to your customer—even when you have to say no. The second edition features a new chapter on receiving and responding to Internet complaints; a new chapter on how to deal with and take advantage of complaints that are directed at you personally; and, turning the tables, a section on how you can complain constructively and effectively. And throughout, the text has been heavily revised, with a wealth of new examples, tools, and strategies.",
        "Category": " Business & Economics , Development , Business Development",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Secrets of a Shoe Addict",
        "Authors": "By Harbison, Beth",
        "Description": "Every woman has a secret. The question is: How far will she go to make sure it stays secret?Abbey Walsh never wanted anyone to find out about her shady past. After all, she’s the wife of a minister now, living an exemplary life. That is, until someone shows up from her past with blackmail in mind . . .Tiffany Vanderslice Dreyer never dreamed that she’d find herself up to her new designer sunglasses in credit card debt from one mad moment of a shopping spree. She’s an upstanding wife and mother with the perfect marriage . . . right? Loreen Murphy hadn’t meant to hire a male prostitute in Las Vegas. It was all just a big, stupid, and expensive misunderstanding. . . .Abbey, Tiffany, and Loreen are each in need of thousands of dollars and fast. Tiffany’s sister, Sandra, has the perfect idea. It’s fast, it’s easy, it’s legal, and it’s the secret that kept her shoe addiction alive. It’s the perfect plan. . . .In this deliciously sassy novel, three very different women bond when they find themselves in more than one kind of trouble. It’s the story of how sometimes you have a secret that can get you in---and out---of dire straits. It’s about romance, friendship, kids, revenge, affairs, and, most of all, a love of the well-heeled things in life.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Angels in Art (Hardcover)",
        "Authors": "By Grubb, Nancy",
        "Description": "Captures a myriad of angels in a multitude of guises as portrayed by artists ranging from Botticelli to Rembrandt, and organizes its enclosed works under such headings as \"Heavenly Messengers\" and \"Guardian Angels and Companions.\"",
        "Category": " Art , History , General",
        "Publisher": "Abbeville Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Endangered Species: Portraits of a Dying Millenium",
        "Authors": "By Dierdre Luzwick",
        "Description": "",
        "Category": "",
        "Publisher": "Harper San Francisco",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "The American Eagle in Art and Design (Dover Pictorial Archives Series)",
        "Authors": "By Hornung, Clarence P.",
        "Description": "Largest collection illustrating the use and development of the eagle in art and design in America contains 321 photos, drawings and designs featuring eagle in hundreds of sizes and positions in every conceivable medium.",
        "Category": " Design , Clip Art",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Summer of Love: The Principles of Love",
        "Authors": "By Franklin, Emily",
        "Description": "After a rough spring semester at Hadley Hall, Love Bukowski is ready for some sun on Martha's Vineyard. Running her Aunt Mable's cafe might not sound glamorous, but when she's working with her best friend, Arabella, anything can be fun. Plus, Mable's set up a treasure map of clues for her to find-each one bringing Love closer to the truth about her family history.  But now that those pieces of her past are finally fitting together, Love's future isn't clear. College and senior year are ahead, but the boys of summer are more appealing than ever. Surprises, sun, summer love-no matter what happens, the next three months will be ones to write home about.",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "NAL Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "The Trouble With Paradise",
        "Authors": "By Shalvis, Jill",
        "Description": "When Dorie Anderson meets a cute guy, she becomes a huge klutz. But one phone call has turned her dead-end dating life into an adventure: she's won a trip on a singles' cruise to Fiji. On board, she soon meets pro baseball player Andy, and the ship's hunky French doctor. She's sure she'll fall head- over-heels in no time. Unfortunately, she's right: soon, she trips over her luggage right in front of them. Mortifying. But a bigger disaster is just on the horizon. Dorie finds a man murdered in his bunk the same night a storm wrecks the ship, stranding everyone on a deserted shore. It'd be a perfect setting for romance-if it weren't for the fact that there's a killer among them.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Help! I'm Trapped in Santa's Body (Help! I'm Trapped Series)",
        "Authors": "By Strasser, Todd",
        "Description": "When a very tired Santa Claus hands a special red and green envelope to Jake, the boy is surprised by his instantaneous transformation into Santa Claus and must sit at the mall while kids beg for presents and pull his beard. Original.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Scholastic Canada, Limited",
        "Price Starting With ($)": "142.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Corporate Information Systems Management: The Issues Facing Senior Executives",
        "Authors": "By Applegate, Lynda M., McFarlan, F. Warren, and McKenney, James L.",
        "Description": "",
        "Category": "",
        "Publisher": "Richard d Irwin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Weight Watchers Slim Ways Hearty Meals",
        "Authors": "By Haiken, Lee (EDT)",
        "Description": "Collects weight-conscious recipes for beef, veal, pork, lamb, poultry, seafood, and meatless entrees, and includes dietary exchanges and nutritional information for each recipe",
        "Category": " Cooking , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Learn to Paint & Draw",
        "Authors": "By Gair, Angela",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Mother Teresa 1910-1997, a Pictorial Biography by Joanna Hurley (1997-01-01)",
        "Authors": "By Joanna Hurley",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Picasso--The Early Years, 1892-1906",
        "Authors": "By Picasso, Pablo, McCully, Marilyn, Staller, Natasha, National Gallery of Art (U. S.) (COR), and Museum of Fine Arts, Boston (COR)",
        "Description": "Shows and describes some of Picasso's earliest artwork and discusses influences on his work",
        "Category": " Art , History , General",
        "Publisher": "Natl Gallery of Art",
        "Price Starting With ($)": "8.66",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Annotated Mona Lisa: A Crash Course in Art History from Prehistoric to Post-Modern",
        "Authors": "By Boswell, John and Strickland, Carol",
        "Description": "A layman's guide to art history free from bogged down, convoluted theories provides the reader with a basic working knowledge of art and its influence on society, from ancient times to today. Simultaneous.",
        "Category": " Art , Study & Teaching",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Legendary Outlaws and Lawmen of the Old West Coloring Book (Dover History Coloring Book)",
        "Authors": "By Reedstrom, E. Lisle",
        "Description": "Meet a band of frontier gunslingers — on both sides of the law! You'd have to ride the range for miles to find colorful characters like these. The lawmen include Wild Bill Hickok, Bat Masterson, Wyatt Earp, and \"Doc\" Holliday; the outlaws include the Apache Kid, Jesse James, Belle Star, and many others. Without glamorizing these figures, the 45 authentic scenes — complete with captions — offer an action-packed glimpse of the Old West.",
        "Category": " Juvenile Nonfiction , History , United States , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "And the Waters Turned to Blood",
        "Authors": "By Barker, Rodney",
        "Description": "In this account, Rodney Barker tells the full and terrifying story of a microorganism popping up along the Eastern seaboard - far closer to home than the Ebola virus and equally frightening.In the coastal waters of North Carolina - and now extending as far north as the Chesapeake Bay area - a mysterious and deadly aquatic organism named Pfiesteria piscicida threatens to unleash an environmental nightmare and human tragedy of catastrophic proportions.At the very center of this narrative is the heroic effort of Dr. JoAnn Burkholder and her colleagues, embattled and dedicated scientists confronting medical, political, and corporate powers to understand and conquer this new scourge before it claims more victims.",
        "Category": " Medical , Toxicology",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Getting Started with Geographic Information Systems (3rd Edition)",
        "Authors": "By Clarke, Keith C.",
        "Description": "",
        "Category": " Science , Earth Sciences , Geography",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "The College Writer: A Guide to Thinking, Writing, and Researching",
        "Authors": "By Sebranek, Patrick, Meyer, Verne, Vandermey, Randall, and Van Rys, John",
        "Description": "Combining streamlined, nuts-and-bolts writing instruction with accessibility and visual appeal, The College Writer helps visual learners and less-prepared students master the writing process. The text features step-indexing and color-coding that allow students to thumb directly to a topic, and checklists and summary boxes that make it easy to refer back to previously covered material. In addition, thorough coverage of drafting, writing, revising, and proofreading includes sample paragraphs and visuals that walk students through the process of identifying a topic and writing a paper.The Second Edition offers 20 additional professional readings, new information on stylistic choices, and enhanced coverage of incorporating visual elements into the writing process. Market leading technology support?including The College Writer CD for students, online professional readings, and the WriteSpace online writing program?help make teaching and learning writing more dynamic.New! Coverage of visual literacy and enhanced coverage of design and illustration teach students how to evaluate and utilize visuals that they encounter in media such as the Internet, television, movies, and advertisements.New! Twenty additional professional readings?including \"The Media's Image of Arabs\" by Jack Shaheen (persuasive writing), \"Communication Styles\" by Deborah Tannen (report writing), and \"On Excellence\" by Cynthia Ozick (definition)?provide high-interest examples of a variety of writing strategies and models.New! Additional information on stylistic choices such as passive voice, weak verbs, and other common problems with student writing help students to identify problem areas and strengthen their writing.New! Readings now reflect both national and international diversity, and feature current topics of high interest to students. Examples include \"Campus Racism 101\" by Nikki Giovanni and \"The Handicap of Definition\" by William Raspberry.A research section offers comprehensive coverage on finding, using, and documenting research sources, as well as advice on avoiding plagiarism.The WriteSpace online writing program delivers interactive exercises, diagnostic tests, assignments, and learning modules for more effective writing. It can be used in distance-learning courses, wired classrooms, or as an enhancement to traditional courses.The web site at www.thecollegewriter.com builds upon the lessons in the book with a range of resources including assignments, practice tests, and critical-reading models.The College Writer CD contains the entire text of the printed book, as well as grammar exercises, audio clips, videos, activities, web links, and other resources.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "6.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Silent Son",
        "Authors": "By Warfield, Gallatin",
        "Description": "Why would anyone kill Henry and Addie Bowers? The savage, senseless shooting of the elderly store owners shocks neighbors and police, yet no one is more distraught than county prosecutor Gardner Lawson - for the state's sole witness is Gardner's only son. Worse yet, whoever killed the Bowers left the eight-year-old unconscious, with the imprint of a gun barrel on his forehead. So traumatized is the boy that he cannot remember anything. No one can get through to him, not even his father.Spotted near the scene of the crime, a town bully has been pegged as the key suspect. He responds evasively to questioning, and Gardner is positive the state has found its man. But his close friend, police sergeant Joseph Brown, isn't so sure. He digs deeper, and starts unearthing a tangled trail of lies leading to a secret as horrifying as the crime itself. And waiting in the wings for Gardner and his allies is his adversary Kent King, a clever, antagonistic defense attorney all too willing to take advantage of Gardner's escalating emotional stake in the case.In the courtroom and out, pressure mounts as he tries to help the boy face the nightmarish truth. Now Gardner is torn between his thirst for justice and the primal, parental drive to protect his child. As the killer roams free, Gardner must ask himself: Will the ultimate cost of a conviction be the life of his son?A profoundly moving, explosive thriller that incorporates both legal expertise and powerful narrative technique, SILENT SON confirms Gallatin Warfield's place as a new master of courtroom suspense.",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Scared to Life",
        "Authors": "By Rumford, Douglas J.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Under Cover (EZ Lesson Plan)",
        "Authors": "By Bevere, John",
        "Description": "Based on John's live presentation of the Biblical principles he explored in the book by the same title, Under Cover will help you undertake a serious, Holy Spirit led study of God's authority. Your shield of faith will be strengthened by Biblical awareness in order to protect you from some of the most dangerous arrows of the enemy.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "A Discipline for Software Engineering",
        "Authors": "By Humphrey, Watts S.",
        "Description": "This new work from Watts Humphrey, author of the influential book, Managing the Software Process, broadens his orderly view of software process management, and lays the foundation for a disciplined approach to software engineering. In his earlier book, the author developed concrete methods for managing software development and maintenance. These methods, now commonly practiced in industry, provide programmers and managers with specific steps they can take to evaluate and improve their software capabilities. In this new book, Humphrey scales those methods down to a personal level, helping software engineers develop the skills and habits needed to plan, track, and analyze large, complex projects.Humphrey and others have used material from this book to train professionals and students around the world in a projects-oriented software engineering course. First establishing the need for discipline in software engineering, and the benefits to practitioners of learning how to manage their personal software process, Humphrey then develops a model that they can use to monitor, test, and improve their work. Examples drawn from industry enhance the practical focus of the book, while project exercises give readers the opportunity to practice software process management as they learn it.Features: presents concepts and methods for a disciplined software engineering process; scales down industrial practices for planning, tracking, analysis, and defect management to fit the needs of small-scale program development; and shows how small project disciplines provide a solid base for larger projects.",
        "Category": " Computers , Software Development & Engineering , General",
        "Publisher": "Addison-Wesley Professional",
        "Price Starting With ($)": "6.92",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Alcoholics Anonymous Comes of Age: A Brief History of A. A.",
        "Authors": "By Service, Alcoholics Anonymous World",
        "Description": "",
        "Category": " Self-help , Substance Abuse & Addictions , Alcoholism",
        "Publisher": "Alcoholics Anonymous World Serv inc",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "June",
            "Year": "1957"
        }
    },
    {
        "Title": "The Best Book of Useless Information Ever: A Few Thousand Other Things You Probably Don't Need to Know (But Might as Well Find Out)",
        "Authors": "By Botham, Noel",
        "Description": "From the creators of the #1 New York Times bestseller The Book of Useless Information comes another enlightening, entertaining, and ultimately useless assortment of trivia.  If you find yourself transfixed by the most trivial of trivia, or mesmerized by the most minor of minutiae, The Useless Information Society's latest findings can satisfy your every need. This wide-ranging collection will fill every nook and cranny of your brain with information you'll surely never need, but will enjoy learning anyway!  Did you know...  - that penguins can jump six feet out of the water? - that everyone is color-blind at birth?  Would you care to know...  - what the first meal eaten on the moon was? - what country drinks the most Coca-Cola? (Hint: It's not the United States.)  In 1995, a secret society was formed comprising Britain's foremost thinkers, writers, and artists to trade and share in useless information (or, as founding member Keith Waterhouse, playwright and journalist, would have it, \"totally bloody useless\").",
        "Category": " Reference , Curiosities & Wonders",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "The Tao: Finding the Way of Balance and Harmony",
        "Authors": "By Forstater, Mark",
        "Description": "The Tao Te Ching is one of the most influential philosophies in the Eastern world. As relevant now as it was 2,300 years ago, the ageless wisdom of the Tao offers profound guidance and shows readers how to seek contentment. In The Tao, Mark Forstater reinterprets and illuminates these mysterious ancient writings to create a blueprint for daily life.  Through its gentle insights and focus on the eternal harmony of life, The Tao can help readers:• Unite mind, body, and spirit• Establish a better way of living• Reverse destructive habits• Enjoy a long and healthy lifeA contemporary look at a timeless practice that has influenced everything from Feng Shui to acupuncture, The Tao is the essential guide to achieving balance and serenity and experiencing personal transformation.",
        "Category": " Philosophy , Taoist",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Here's Johnny!: My Memories of Johnny Carson, the Tonight Show, and 46 Years of Friendship",
        "Authors": "By McMahon, Ed",
        "Description": "For 30 years, Johnny Carson entertained millions of The Tonight Show viewers, creating a landmark of television. Now, Carson's irreplaceable partner and straight man Ed McMahon tells the touching, turbulent, and laugh-out-loud funny story of his personal, professional, and public relationship with one of the most beloved icons in entertainment history.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Little Mermaid (Disney Princess, Vol. 2)",
        "Authors": "By Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Advance Publishers, L.C.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Disney Princess Aladdin (Disney princess, 6)",
        "Authors": "By Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Advance",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "My Perfect Wedding (Disney Princess Storybook Library, Volume 7)",
        "Authors": "By Lisa Ann Marsoli",
        "Description": "",
        "Category": "",
        "Publisher": "Advance Publishers, L.C.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Disney Princess, Vol. 11: A Moment to Remember",
        "Authors": "By Catherine McCafferty",
        "Description": "",
        "Category": "",
        "Publisher": "Advance",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Physics Super Review",
        "Authors": "By Research and Education Association (COR) and Fogiel, M. (EDT)",
        "Description": "Need help with physics? Want a quick review or refresher for class? This is the book for you!REA’s Physics Super Review® gives you everything you need to know!This Super Review® can be used as a supplement to your high school or college textbook, or as a handy guide for anyone who needs a fast review of the subject.• Comprehensive, yet concise coverage – review covers the material that is typically taught in a beginning-level physics course. Each topic is presented in a clear and easy-to-understand format that makes learning easier.• Questions and answers for each topic – let you practice what you’ve learned and build your physics skills.• End-of-chapter quizzes – gauge your understanding of the important information you need to know, so you’ll be ready for any physics problem you encounter on your next quiz or test.Whether you need a quick refresher on the subject, or are prepping for your next test, we think you’ll agree that REA’s Super Review® provides all you need to know!",
        "Category": " Science , Physics , General",
        "Publisher": "Research & Education Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Getting to Know Nature's Children: Puffins / Old World Monkeys",
        "Authors": "By MacLeod, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Scholastic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "CPR For Family And Friends",
        "Authors": "By American Heart Association",
        "Description": "",
        "Category": "",
        "Publisher": "Washington,D.C:American Heart",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Martin Luther King Jr. : Heroes of America",
        "Authors": "By Boyd, Herb",
        "Description": "",
        "Category": "",
        "Publisher": "Baronet Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Sign of the Twisted Candles (Nancy Drew, Book 9)",
        "Authors": "By Keene, Carolyn",
        "Description": "Another exciting mystery begins for the  young detective when her friends Bess and George ask her to investigate a rumor that their wealthy great-granduncle, Asa Sidney, is virtually a prisoner in his own mansion. But solving the mystery and befriending Carol Wipple, the sixteen-year-old foster daughter of the caretakers of the old mansion, nearly costs Nancy the friendship of Bess and George. It takes all of Nancy's sleuthing ability as well as diplomacy to save it.Nancy braves one danger after another to bring to justice the swindlers who are stealing Asa Sidney’s fortune. With only the sign of the twisted candles to guide her, Nancy uncovers hidden treasure and an amazing letter that ends a family feud and brings unexpected happiness to Carol.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "December",
            "Year": "1968"
        }
    },
    {
        "Title": "The Mystery of the Moss-Covered Mansion: Nancy Drew Mystery Stories, No. 18",
        "Authors": "By Keene, Carolyn",
        "Description": "A friend of Carson Drew’s has been arrested and charged with sending a truck loaded with explosive oranges into the Space Center complex at Cape Kennedy. Knowing that Mr. Billington could not possibly be guilt of sabotage, Nancy and her father rush to the defense of the accused man. During the Drews’ investigation Nancy become suspicious of an old spooky mansion that houses fierce African wild animals on its extensive grounds. Soon, she discovers that something besides the training of wild animals is going on at the mysterious estate. Many dangerous moments await Nancy before she proves Mr. Billington’s innocence and thwarts the plans of treacherous subversives bent on undermining the U.S. space program.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1941"
        }
    },
    {
        "Title": "The Mystery of the Fire Dragon (Nancy Drew #38)",
        "Authors": "By Keene, Carolyn",
        "Description": "Nancy receives an urgent call from her Aunt Eloise in New York, requesting her help in solving a mystery. Her neighbor's granddaughter, Chi Che Soong, has gone missing! Nancy and her friends fly to New York to help track down the missing girl.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "My War: Killing Time in Iraq",
        "Authors": "By Buzzell, Colby",
        "Description": "An underemployed, skateboarding party animal, Colby Buzzell traded a dead-end future for the army—and ended up as a machine gunner in Iraq. To make sense of the absurd and frightening events surrounding him, he started writing a blog about the war—and how it differed from the government’s official version. But as his blog’s popularity grew, Buzzell became the embedded reporter the Army couldn’t control—despite its often hilarious efforts to do so. The result is an extraordinary narrative, rich with unforgettable scenes: the Iraqi woman crying uncontrollably during a raid on her home; the soldier too afraid to fight; the troops chain-smoking in a guard tower and counting tracer rounds; the first, fierce firefight against the “men in black.” Drawing comparisons to everything from Charles Bukowski to Catch-22, My War depicts a generation caught in a complicated and dangerous world—and marks the debut of a raw, remarkable new voice.",
        "Category": " History , Military , United States",
        "Publisher": "Dutton Caliber",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Michelin Green Guide: Spain",
        "Authors": "By Michelin",
        "Description": "",
        "Category": "",
        "Publisher": "MICHELIN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The Lover's Knot: A Someday Quilts Mystery",
        "Authors": "By O'Donohue, Clare",
        "Description": "Book #1 of the Someday Quilts Mystery series In the tradition of Jennifer Chiaverini and Emilie Richards, a debut quilting mystery Nell Fitzgerald is thrilled when she receives a gorgeous handmade quilt in a lover's knot pattern from her grandmother Eleanor as an engagement gift. Her joy is short-lived, however, when her fiancé announces he's calling off the wedding. Heartbroken, 25-year-old Nell flees New York City for her grandmother's home in quaint Archers Rest. In this small town Eleanor's life revolves around her quilt shop, Someday Quilts, and the members of the shop's quilting circle. When the body of a local handyman known for his flirting is found in the quilt shop, murdered with a pair of quilting scissors, Nell finds herself drawn into the case, and drawn to the handsome police chief. As a pattern of clues begins to emerge, one of the prime suspects is Nell's ex-fiancé, whose arrival in Archers Rest seems suspicious. The ladies of the quilting circle continue to piece together their quilts as Nell unravels the mystery. For quilters and mystery lovers alike, The Lover's Knot is a delightful and promising debut.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Cove (An FBI Thriller)",
        "Authors": "By Coulter, Catherine",
        "Description": "A picturesque town. A woman on the run. An undercover agent.   The first riveting novel in Catherine Coulter's #1 New   York Times bestselling FBI Thriller series. Sally Brainerd can't remember what happened the   night her father was murdered. Maybe she did it. Or maybe it was her poor,   traumatized mother. Either way, the   safest place for her is far away from Washington, D.C.. But while her aunt's   home in The Cove should be a quiet refuge, Sally can't shake the feeling that   there's something not quite right about the postcard perfect little   town. Despite his target's checkered past and convenient memory loss, FBI Special   Agent James Quinlan isn't convinced she's the killer—but maybe she knows who   is. As he uses his cover to get close   to Sally and unearth the memories her mind has hidden away, James can't deny   his connection to the troubled woman. But as their lies and passions   intertwine, Sally and James soon learn they aren't the only ones keeping   deadly secrets in The Cove...",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "20,000 Leagues Under The Sea",
        "Authors": "By Verne, Jules (EDT)",
        "Description": "",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Modern Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Johns Hopkins Complete Home Encyclopedia of Drugs: Developed Especially for People over 50",
        "Authors": "By Margolis, Simeon (EDT)",
        "Description": "An encyclopedia of essential information on nearly every major prescription and over-the-counter medication available for consumer use, presenting basic facts in plain language. Each drug is covered in a one- or two-page profile, organized in alphabetical order by generic name. Entries give information on brand names, side effects, uses, dosage, onset and duration, and storage. Entries also briefly describe how the drug works, and give precautions on stopping the drug, prolonged use, and use by those over 60. Includes color photos, and an illustrated introduction on drugs and aging. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Medical , Pharmacology",
        "Publisher": "REBUS",
        "Price Starting With ($)": "8.61",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Palladio (Architect and Society)",
        "Authors": "By Ackerman, James S.",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1974"
        }
    },
    {
        "Title": "The Armchair Detective Book of Lists",
        "Authors": "By Stine, Kate (EDT)",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Otto Penzler Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Night Watch: A Long-Lost Adventure in Which Sherlock Holmes Meets Father Brown",
        "Authors": "By Kendrick, Stephen",
        "Description": "When the mutilated body of a priest is discovered in a London church during a secret meeting between the Archbishop of Canterbury and the representatives of the great world religions, Sherlock Holmes is called in and seemingly solves the case in record time, until Father Brown arrives to reveal a few \"loose ends.\" 15,000 first printing.",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Old Yeller",
        "Authors": "By Gipson, Fred",
        "Description": "Set in the rugged landscape of early frontier Texas, a tale of love and hardship emerges as fourteen-year-old Travis is faced with taking over his family's farm and a painful, important decision.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "HarperCollins Children’s Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "The Magic Lamp: Goal Setting for People Who Hate Setting Goals",
        "Authors": "By Ellis, Keith",
        "Description": "Do you have trouble setting goals? Would you like to have greater focus, stronger follow-through, and achieve dramatically better results? Would you like to learn how to get anything you want from life--more money, a new home, a promotion, better relationships, a greater sense of fulfillment, or anything else you can imagine? If so, then read The Magic Lamp. This remarkable book describes a simple yet unforgettable process for how to obtain whatever you want from both your personal life and your career.What's the Secret?The Magic Lamp is the first goal-setting guide for people who hate setting goals. Goals can take you anywhere you want to go, but they rarely give you the inspiration you need to get there. Wishes are different. They have emotional impact. They give you the freedom to dream and the power to make your dreams come true.The Magic Lamp transforms the process of setting goals from a dull routine into an exciting adventure because it's the first book to combine the methods of goal setting with the magic of making your wishes come true.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Harmony",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Shakespeare: A Study and Research Guide",
        "Authors": "By Bergeron, David Moore and De Sousa, Geraldo U.",
        "Description": "",
        "Category": "",
        "Publisher": "Univ Pr of Kansas",
        "Price Starting With ($)": "5.97",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Whistling in the Dark",
        "Authors": "By Kagen, Lesley",
        "Description": "It was the summer on Vliet Street when we all started locking our doors...  Sally O'Malley made a promise to her daddy before he died. She swore she'd look after her sister, Troo. Keep her safe. But like her Granny always said-actions speak louder than words. Now, during the summer of 1959, the girls' mother is hospitalized, their stepfather has abandoned them for a six pack, and their big sister, Nell, is too busy making out with her boyfriend to notice that Sally and Troo are on the Loose. And so is a murderer and molester.  Highly imaginative Sally is pretty sure of two things. Who the killer is. And that she's next on his list. Now she has no choice but to protect herself and Troo as best she can, relying on her own courage and the kindness of her neighbors.",
        "Category": " Family & Relationships , Friendship",
        "Publisher": "New American Library Accent",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Firing Up Commitment During Organizational Change: A Handbook for Managers",
        "Authors": "By Pritchett, Price",
        "Description": "",
        "Category": "",
        "Publisher": "Pritchett, LP",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2014"
        }
    },
    {
        "Title": "The Book of Desserts",
        "Authors": "By Taylor, Sally and Gill, David (PHT)",
        "Description": "Provides recipes for making milk and cream, egg-based, chocolate, and fruit desserts, as well as pastries, cakes, and sauces",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Jesus, the Reason for the Season",
        "Authors": "By Honor Books",
        "Description": "",
        "Category": " Poetry , Subjects & Themes , Inspirational & Religious",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "With Burning Hearts: A Meditation on the Eucharistic Life",
        "Authors": "By Nouwen, Henri J. M.",
        "Description": "From mourning to discernment, from invitation to intimacy, and from community to the charge to go forth and witness, this work seeks a fuller understanding of the Eucharist through the story of the disciples on their way to Emmaus and calls us to experience the entire journey, to know that what we celebrate and what we are called to live are one and the same.",
        "Category": " Religion , Spirituality",
        "Publisher": "Orbis Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Dave Barry Is Not Taking This Sitting Down",
        "Authors": "By Barry, Dave and MacNelly, Jeff (ILT)",
        "Description": "Pulitzer Prize-winning humorist Dave Barry is a pretty amiable guy. But lately, he’s been getting a little worked up. What could make a mild-mannered man of words so hot under the collar? Well, a lot of things–like bad public art, Internet millionaires, SUVs, Regis Philbin . . . and even bigger problems, like• The slower-than-deceased-livestock left-lane drivers who apparently believe that the right lane is sacred and must never come in direct contact with tires• The parent-misery quotient of last-minute school science fair projects• Day trading and other careers that never require you to take off your bathrobe• The plague of the low-flow toilets, which is so bad that even in Miami, where you can buy drugs just by opening your front door and yelling “Hey! I want some crack,” you can’t even sell your first born to get a normal-flushing toiletDave Barry is not taking any of this sitting down. He’s going to stand up for the rights of all Americans against ridiculously named specialty “–chino” coffees and the IRS. Just as soon as he gets the darn toilet flushed.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Hardball for Women: Revised Edition",
        "Authors": "By Heim, Pat and Golant, Susan K.",
        "Description": "In Hardball for Women, Pat Heim shows women how to break patterns of behavior that have put them at a disadvantage in the business world of men. Whether the arena is a law firm, a medical group, a corporation, or any other work environment, Hardball for Women decodes the male business culture and gives readers strategies on how to use its rules to get ahead—and stay ahead.  Readers will learn to:       Be assertive without being obnoxious       Display confidence       Engage in smart self-promotion       Lead both men and women—and recognize the differences between them       Use “power talk” language to your advantage",
        "Category": " Business & Economics , Skills",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Lilly Oncology on Canvas Expressions of a Woman's Cancer Journey",
        "Authors": "By Eli Lilly and Company",
        "Description": "",
        "Category": "",
        "Publisher": "Eli Lilly and Company",
        "Price Starting With ($)": "7.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "George Washington, Spymaster: How the Americans Outspied the British and Won the Revolutionary War",
        "Authors": "By Harness, Cheryl",
        "Description": "Now in paperback—the award-winning National Geographic book that presents the untold story of the invisible war behind the American Revolution. A riveting tale of intrigue, spies, counterspies and secret agents, George Washington, Spymasteris a unique and entertaining account of one of the most important chapters in our nation's history. The compelling narrative reveals the surprising role played by the first commander-in-chief, General George Washington in the War of Independence. Follow the action as 1775 dawns, and Washington finds himself in serious trouble. At war with Britain, the world's most powerful empire, his ragtag army possesses only a few muskets, some cannons, and no money. The Americans' only hope is to wage an invisible war—a war of spies, intelligence networks, and deception. Enter the shadowy world of double agents, covert operations, codes and ciphers—a world so secret that America's spymaster himself doesn't know the identities of some of his agents. Meet members of the elusive Culper Ring, uncover a \"mole\" in the Sons of Liberty, and see how invisible ink and even a clothesline are used to send secret messages. You can even use Washington's own secret codebook, published here for the first time. Experience at close quarters the successes and failures of the Americans as they strive to outwit the British. Meet the chief of covert operations, one Benjamin Franklin, and several other surprising players in America's secret war. Author Thomas B. Allen has sifted through dozens of historical documents and coded letters to uncover the facts about a time shrouded in secrets. Archival art, coupled with lively pen-and-ink sketches by children's illustrator Cheryl Harness, detail all the action and adventure of this momentous tale. Like the highly acclaimed hardback, this little paperback is sure to have a big impact on the imagination of readers everywhere.National Geographic supports K-12 educators with ELA Common Core Resources.Visit www.natgeoed.org/commoncore for more information.",
        "Category": " Juvenile Nonfiction , History , United States , Colonial & Revolutionary Periods",
        "Publisher": "National Geographic Children's Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Mystery of the Mummy's Curse (The Boxcar Children Mysteries)",
        "Authors": "By Warner, Gertrude Chandler",
        "Description": "The Greenfield Museum's new attraction is a 4,000-year-old mummy. The Aldens are helping the museum curator set up the exhibit and learning about life in ancient Egypt. But ever since the mummy arrived, nothing has gone right for the museum.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "INDPB",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Second Contact (Colonization, Book 1)",
        "Authors": "By Turtledove, Harry",
        "Description": "“[A] tour de force of speculative historical fiction. Highly recommended.”—Library JournalIn the extraordinary Worldwar tetralogy, set against the backdrop of World War II, Harry Turtledove, the “Hugo-winning master of alternate SF” (Publishers Weekly), wove an explosive saga of world powers locked in conflict against an enemy from the stars. Now he expands his magnificent epic into the volatile 1960s, when the space race is in its infancy and humanity must face its greatest challenge: alien colonization of planet Earth.Yet even in the shadow of this inexorable foe, the United States, the Soviet Union, and Nazi Germany are unable to relinquish their hostilities and unite against a massive new wave of extraterrestrials. For all the countries of the world, this is the greatest threat of all. This time, the terrible price of defeat will be the conquest of our world, and perhaps the extinction of the human race itself.Praise for Second Contact“An exciting, often surprising, story that will not only delight his fans but will probably send newcomers back to the Worldwar saga.”—Publishers Weekly (starred review)“Outstanding entertainment.”—Booklist",
        "Category": " Fiction , Historical",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Mystery in Washington D.C. (2) (The Boxcar Children Mystery & Activities Specials)",
        "Authors": "By Warner, Gertrude Chandler and Tang, Charles (ILT)",
        "Description": "The Boxcar Children take a trip to Washington, D.C, and visit the Capitol Building and the Air and Space Museum. But when things start disappearing from their hotel, and they realize they are being followed, the children know there's a mystery.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Albert Whitman & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Mistress of the Art of Death (A Mistress of the Art of Death Novel)",
        "Authors": "By Franklin, Ariana",
        "Description": "The national bestselling hit hailed by the New York Times as a \"vibrant medieval mystery...[it] outdoes the competition.\"  In medieval Cambridge, England, Adelia, a female forensics expert, is summoned by King Henry II to investigate a series of gruesome murders that has wrongly implicated the Jewish population, yielding even more tragic results. As Adelia's investigation takes her behind the closed doors of the country's churches, the killer prepares to strike again.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Snowbound Mystery (13) (The Boxcar Children Mysteries)",
        "Authors": "By Warner, Gertrude Chandler and Cunningham, David (ILT)",
        "Description": "The Alden children discover a secret recipe for sweet buns while they are snowbound in an old hunter's cabin",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Official Privilege",
        "Authors": "By Deutermann, Peter T.",
        "Description": "Official Privilege begins with a mystery: in the Philadelphia Naval Shipyard, the mummified body of a black Navy lieutenant is found bolted inside the boiler of a deactivated battleship. While the cause of death is clear, the officer's identity is not. With nerve ends raw from the media focus on recent scandals, the Pentagon bypasses its own investigative service and appoints a commander, Dan Collins, and a civilian, Grace Snow, to conduct an inquiry. Together they resolve to ignore the Navy's political sensitivities and conduct a by-the-book murder investigation. But then they uncover evidence that points back to Washington, D.C., and a two-year-old unsolved case involving another black Navy lieutenant, a beautiful young woman, who died under violent circumstances. While they search for links between the two deaths, they attract the attention of one Malachi Ward. Cunning, ruthless, well paid, and ferociously resourceful, he will do whatever it takes to protect his hidden client's privilege. In a tense, deadly game of cat-and-mouse, Malachi tracks Collins and Snow through Washington's streets and corridors of power, determined to keep them from learning the secret behind the body in the battleship.",
        "Category": "",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Mystery at Kill Devil Hills #9 Carole Marsh Mysteries - Real Kids Real Places",
        "Authors": "By Marsh, Carole",
        "Description": "Four children attend the Centennial of Flight celebration and become involved in finding the missing replica of Flyer, the first airplane.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Carole Marsh Mysteries",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Looking for Mr. Goodbar",
        "Authors": "By Judith rossner",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1977"
        }
    },
    {
        "Title": "The Two Princesses of Bamarre",
        "Authors": "By Levine, Gail Carson",
        "Description": "A kingdom beset by monsters . . .A disease that weakens and destroys . . .An epic poem and a hero of long ago . . .A story of danger and desperation.The two princesses of Bamarre couldn't be more different. Princess Addie is fearful and shy. Her deepest wish is for safety. Princess Meryl is bold and brave. Her deepest wish is to save the kingdom of Bamarre. They are sisters, and they mean the world to each other.Then disaster strikes, and Addie—terrified and unprepared—sets out on a perilous quest. In her path are monsters of Bamarre: ogres, specters, gryphons, and dragons. Addie must battle them, but time is running out, and the sisters' lives—and Barmarre's fate—hang in the balance.Gail Carson Levine left her mark on fantasy with her well-loved 1998 Newbery Honor Book Ella Enchanted. Now she has created another shimmering and tapestried landscape of fantasy and fairies. Bamarre and the journeys of its two princesses will burn themselves into the minds of readers, and all will relish this moving saga about two sisters groping their way toward heroism.",
        "Category": " Juvenile Fiction , Social Themes , Self-Esteem & Self-Reliance",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2012"
        }
    },
    {
        "Title": "The Mystery at Jamestown: First Permanent English Colony in America! (17) (Real Kids Real Places)",
        "Authors": "By Marsh, Carole",
        "Description": "The kids find plenty of history, mystery, legend, lore, lost bones, and more when they travel to Jamestown, Va., the first permanent English colony in America.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Carole Marsh Mysteries",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Mystery in New York City (10) (Real Kids Real Places)",
        "Authors": "By Marsh, Carole",
        "Description": "Four children see many of New York City's landmarks in their quest to solve the disappearance of the Statue of Liberty's torch.",
        "Category": " Juvenile Fiction , People & Places , United States , General",
        "Publisher": "Carole Marsh Mysteries",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Bright from the Start: The Simple, Science-Backed Way to Nurture Your Child's Developing Mind from Birth to Age 3",
        "Authors": "By Spencer, Paula and Stamm, Jill, Ph.D.",
        "Description": "A cutting-edge handbook for parents from a pioneer in infant brain developmentShould you really read to your baby? Can teaching a baby sign language boost IQ? Should you pipe classical music into the nursery? Dr. Stamm translates the latest neuroscience findings into clear explanations and practical suggestions, demonstrating the importance of the simple ways you interact with your child every day. It isn’t the right “edu-tainment” that nurtures an infant’s brain. It is as simple as Attention, Bonding, and Communication, and it’s within every parent’s ability to provide. Practical games and tips for each developmental age group will show you not only what the latest findings are but, more importantly, tell you what to do with them.",
        "Category": " Education , General",
        "Publisher": "Avery",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Winning Office Politics: Dubrins Gd for 90s",
        "Authors": "By Dubrin, Andrew J.",
        "Description": "Discusses the use of effective political techniques for surviving in the corporate world, offering proven strategies for gaining power and visibility and examples of courses of action and solutions for various office scenarios",
        "Category": " Business & Economics , Management",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Ten years after Ivan Denisovich",
        "Authors": "By Medvedev, Zhores A.",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "501 Tips for Teachers : Kid-Tested Ideas, Strategies, and Inspirations",
        "Authors": "By Ramsey, Robert D",
        "Description": "Newly revised and updated, this invaluable resource from esteemed educator Robert Ramsey is packed with practical and inspirational tips for teachers.501 Tips for Teachers covers everything from classroom management, to student relations, to personal development and motivation, to working with parents, colleagues, and the community. Educators at all levels will appreciate the book's easy-to-follow advice and no-nonsense approach to teaching.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Rotten Reviews 2",
        "Authors": "By Henderson, Bill",
        "Description": "An entertaining compendium of bad reviews of books that are now considered classics features commentary on the works of contemporary writers as John Updike, Joyce Carol Oates, Saul Bellow, Raymond Carver, and Susan Sontag",
        "Category": " Humor , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Presidents: Over 100 Questions and Answers to Things You Want to Know",
        "Authors": "By Chris Oxlade",
        "Description": "",
        "Category": "",
        "Publisher": "Bright Sparks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Under The Ice",
        "Authors": "By Henrick, Richard P.",
        "Description": "Soviet submarine commander Sergei Markova and U.S.S. Defiance skipper Matt Colter become pawns on opposite sides of a search for the missing aircraft that contains the Soviet Premier",
        "Category": " Fiction , General",
        "Publisher": "Zebra Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "A Rogue's Proposal (Cynster Novels, Book 4)",
        "Authors": "By Laurens, Stephanie",
        "Description": "Demon Cynster has seen love bring his brethren to their knees, and he′s vowed that he will not share their fate ... until he spies Felicity Parteger sneaking about his racing stable. Demon remembers Felicity as a mere chit of a girl, but now she stands before him, all lush curves and sparkling eyes... Felicity knows Demon was one of the town′s most eligible bachelors and a rogue of the worst sort, but he was the only one capable of getting her friend out of trouble. She knows Demon will never yield her the love she desperately seeks, but could a marriage of passion alone be enough?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Taste of Innocence (Cynster Novels, 14)",
        "Authors": "By Laurens, Stephanie",
        "Description": "For no gentleman is this more true than Charles Morwellan, the eighth Earl of Meredith. Although he's seen the many successful unions of his Cynster connections, he has also watched his father's obsessions nearly destroy their family and fortune, a mistake Charles will not repeat. But as Lord Meredith he must marry, so he offers for Sarah, the daughter of his neighbors Lord and Lady Conningham. She's intelligent enough to run his social life, beautiful enough to grace his arm, and old enough to know the value of his offer. For most young ladies of the ton, the right marriage is the culmination of years of training, perfect deportment, and intricate plans that would impress a general. But as a lady of independent means with a life of her own, Sarah is unwilling to wed unless it is for unbounded love.But Charles always gets what he wants. He convinces Sarah to give him two weeks to win her; if he succeeds, they will marry immediately. And so begins an intense courtship. By day, Charles and Sarah are models of decorum indulging in innocuous walks, polite conversation, sedate waltzes. Each night they steal away to the lush, moonlit gardens, where sensual embraces turn to searing kisses, and much, much more. Both are swept away on a tide of passion and feeling neither can resist.And yet, after the wedding, despite nights of insatiable passion, Charles remains aloof, as if the near-sinful sweetness of their nights exists only in a dream. Sarah battles to prove that true love is a force that can't be contained, a gift worth fighting for, but it's only when she's engulfed in a web of increasingly dangerous incidents that Charles discovers how much he's willing to surrender to protect . . . the taste of innocence.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Garden of Ruth",
        "Authors": "By Etzioni-Halevy, Eva",
        "Description": "A historical novel imagines the riveting story behind the Book of Ruth    Sitting beneath a tree in ancient Bethlehem, Osnath, niece of the prophet Samuel, examines a dusty scrap of parchment she found hidden in her relative’s scroll room. Scrawled on the decaying page is an intriguing message addressed to Ruth the Moabite?great-grandmother of David, the future king of Israel. Compelled to discover the truth about Ruth’s life, Osnath begins searching for the identity of Ruth’s nameless lover and the secret that is cloaked behind his anonymity. But as she digs deeper into the past, she finds her inquiries blocked by David’s brother Eliab. What is the long-buried truth he fears will come to light? And what is the threat that Ruth’s story poses to his family’s vast inheritance?    Eva Etzioni-Halevy’s novel deftly interweaves history and fiction to create a compelling exploration of a prominent biblical figure. Told through the voices of both Osnath and Ruth herself, The Garden of Ruth transports readers into the ancient world?and offers a dramatic and thought-provoking new perspective on a well-known tale.",
        "Category": " Fiction , Historical",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Impetuous Innocent",
        "Authors": "By Laurens, Stephanie",
        "Description": "When Miss Georgiana Hartley implores him to help her find a position as a lady's companion, Dominic Ridgely instead sends her to his sister, who transforms Georgiana into a stunning beauty, and as a vast array of suitors vie for her attentions, Dominic discovers that he wants her for himself, forever. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Scandal's Bride (Cynster Novels)",
        "Authors": "By Laurens, Stephanie",
        "Description": "How can an honourable lady like Lady Catriona Hennessy unite with a rake like Richard Cynster? Though charmed by his commanding presence, she cannot give up her independence. Marriage had not previously been on Richard′s agenda, but perhaps taming the lady was just the challenge he needs - if he can have the rights of the marriage bed without making any revealing promises of love?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "All About Love (Cynster Novels)",
        "Authors": "By Laurens, Stephanie",
        "Description": "Alasdair Cynster known to his intimates as Lucifer decides to rusticate in the country before the matchmaking skills of London′s mamas become firmly focused on him, the last unwed Cynster. But an escape to Devonshire leads him straight to his destiny in the irresistible form of Phyllida Tallent, a willful, independent beauty of means who brings all his masterful Cynster instincts rioting to the fore. Lucifer isn′t about to deny his desire for Phyllida, and he′s determined to use all his seductive skills to enjoy the benefits of destiny′s choice without submitting to the parson′s noose. Phyllida has had a bevy of suitors, her charm and wit are well known throughout the countryside, but none of them has tempted her the way Lucifer does. His offer to teach her all about the ways of love is almost too tantalising to resist. And though she′s not yet completely surrendered, she knows only a fool stands against a Cynster...and Phyllida is no one′s fool.",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "Avon",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Promise in a Kiss (A Cynster Christmas Special)",
        "Authors": "By Laurens, Stephanie",
        "Description": "What would you do if you were kissed by the most handsome stranger you'd ever seen? And what if that man was a Cynster?Every girl—even convent-educated ones—dreams of forbidden kisses. So when a man literally falls at Helena's feet as she's walking through the courtyard one moonlit Christmas Eve, the pretty, young comtesse d'Lisle knows he's up to no good. He's clearly a bit dangerous... and obviously caught in the middle of a clandestine rendezvous. Why else would he have risked his neck and jumped out of a window into the snow?It's wrong, it's outlandish . . . and it's the most utterly romantic gesture she's ever seen. So when the good sisters rush up, demanding to know ifshe has seen a man on the grounds, Helena ignores the years of strict upbringing that insist she reveal his presence.To lie would be a sin, but 'no one can be good all the time.As a reward for her silence, the stranger takes her in his arms and enticingly, unforgettably kisses her—and then departs, leaving a lingering if unspoken promise of all that might be, should fate decree that they meet again. Although Helena doesn't know it, her wild Englishman is Sebastian Cynster, Duke of St. Ives, a nobleman who will prove to be her destiny.Seven years later, Helena has been transformed from a pretty schoolgirl to an aristocratic beauty. Her sparkling wit has made her sought after by London's hostesses; her considerable dowry has made winning her hand the aim of many a gentleman . . . but she is deadeningly aware of how boring so many ofthese gentlemen are.Her manipulative guardian has unexpectedly allowed her to find a husband of her own choosing, and she has no intention of marrying any man who tries to tame her. There must be someone perfect for her . . . someone who can live up to the promise ofthat long-ago kiss.Then, at a ball, fate strikes. Once again, it is the Christmas season, and across the crowded room Helena stands transfixed . . . for there is the man whose kiss she has never forgotten, the man of her memory whom no other has ever been able to supplant. Her wild, mysterious Englishman, Sebastian Cynster, Duke of St. Ives.One look, and he's determined to reclaim her . . . .",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "The Official Guide to Ballroom Dancing (Chartwell)",
        "Authors": "By Dow, Allen",
        "Description": "",
        "Category": " Performing Arts , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "What Price Love? (Cynster Novels, 13)",
        "Authors": "By Laurens, Stephanie",
        "Description": "Enter the unforgettable world of New York Times bestselling author Stephanie Laurens, creator of the phenomenal Cynster family. This amazing clan -- and their friends -- is a bold, powerful group of men who let nothing stand in their way when it comes to matters of the heart. And in this, Stephanie Laurens's newest novel, a passionate man and a daring woman confront the ultimate question. . . .What Price Love?There is nothing more fascinating than a darkly handsome rake, especially one as controlled and elusive as Dillon Caxton, protégé of Demon Cynster. Despite his dangerous air, Dillon is a man of sterling reputation, but it wasn't always so. Years ago, an illicit scheme turned into a nefarious swindle, and only the help of his cousin, Felicity, and her husband, Demon, saved Dillon from ruin. Now impeccably honest, he guards his hard-won reputation and is the Keeper of the Register of all racing horses in England. His standing and aloofness make Dillon undeniably desirable to young ladies, but despite all the lures thrown his way, he remains uninterested -- his attention unfixed.Until \"Miss Priscilla Dalling\" erupts into his life. A stunning beauty, she affects Dillon as no other ever has, but what fascinates him even more is that this tempting young lady is clearly desperate, and equally clearly lying about wanting to see the Register to fulfill the whim of an eccentric aunt.Lady Priscilla Dalloway will do anything to see what's in the Register -- even lie! Her twin brother, Russell, who had fought with their father and left the family home to work with the finest racehorses, has disappeared. Pris knows that clues to his whereabouts can be found in the tome Dillon Caxton refuses to let her see.She unleashes her feminine wiles on Dillon -- to no avail. But Dillon is now determined to learn the truth behind her quest. Exploiting the powerful attraction that flares between them, he succeeds in convincing Pris to tell him all, to trust him with her twin's life. Together, Dillon and Pris locate Rus, only to discover that his life is being threatened by the perpetrators of a massive betting swindle.The time is ripe for Dillon to repay old debts by helping another as he himself was helped. Assisted by Demon, Felicity, and Barnaby Adair, Dillon and Pris embark on a journey riddled with danger -- and undeniable passion -- as they seek to overturn the swindle and expose Rus's deadly enemies. And along the way they discover the answer to that age-old question: What price love?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "All About Passion",
        "Authors": "By Laurens, Stephanie",
        "Description": "New York Times bestselling Australian author Stephanie Laurens delivers the latest tale in the immensely popular Cynster series. When Chillington is elected an ′honorary Cynster′ at the end of All About Love, he knows he needs a wife , and an heir. His goal; a simple marriage without romance. He agrees to marry a woman he believes to be pliant and quiet. Unfortunately for him, the woman he thinks is Francesca Rawling is really her cousin, Franni.Francesca herself is proud, passionate and opinionated in short, the perfect bride for a Cynster...",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Penny and Pup",
        "Authors": "By Jennings, Linda M.",
        "Description": "Penny the puppy enjoys the company of big, floppy, toy Pup so much that she feels she no longer needs real animal friends.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Little Tiger Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Devil's Bride (Cynster Novels)",
        "Authors": "By Laurens, Stephanie",
        "Description": "When Devil, the most infamous member of the Cynster family, is caught in a compromising position with plucky governess Honoria Wetherby, he astonishes the entire town by offering his hand in marriage. No one dreamed this scandalous rake would ever take a bride. And as society mamas swooned at the loss of England′s most eligible bachelor, Devil′s infamous Cynster cousins began to place wagers on the wedding date.  But Honoria wasn′t about to bend society′s demands and marry a man \"just\" because they′d been found together virtually unchaperoned. No, she craved adventure, and while solving the murder of a young Cynster cousin fit the bill for a while, she decided that once the crime was solved she′d go off to see the world. But the scalding heat of her unsated desire for Devil soon had Honoria craving a very different sort of excitement. Could her passion for Devil cause her to embrace the enchanting peril of a lifelong adventure of the heart?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "A Rake's Vow (Cynster Novels)",
        "Authors": "By Laurens, Stephanie",
        "Description": "He vowed he′d never marry. To Vane Cynster, Bellamy Hall seems like the perfect place to temporarily hide from London′s husband hunters. But when he encounters irresistible Patience Debbington, Vane realises he′s met his match ... She vowed no man would catch her. Patience isn′t about to succumb to Vane′s sensuous propositions. Yes, his kisses leave her dizzy and his caresses made her melt; but Patience has promised herself she′ll never become vulnerable to a broken heart. Is this one vow that was meant to be broken?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "No Man's Mistress (The Mistress Trilogy)",
        "Authors": "By Balogh, Mary",
        "Description": "Critics call her “a veritable treasure, a matchless storyteller” (Romantic Times). Readers have fallen in love with Mary Balogh’s sparkling blend of wit and romance. Now this dazzling writer sweeps us back to Regency England, into a world of dangerous secrets and glittering intrigue, as a dashing lord meets his match in a fiery beauty who vows to be ... No Man’s Mistress.The dark, devastating stranger rode into the village fair and wagered twenty pounds at the throwing booth — for a chance to win the daisies in Viola Thornhill’s hair. The Gypsy fortune teller had warned: “Beware of a tall, dark, handsome stranger. He can destroy you — if you do not first snare his heart.”Recklessly Viola flirted, then danced with him around the Maypole. And then came his delicate, delicious kiss. Viola did not regret that she had let down her guard — until the next morning, when he appeared at her door to claim her beloved Pinewood Manor. Lord Ferdinand Dudley won her home in a game of cards!Viola hated him for trying to take everything, including her soul. She was mistress of Pinewood Manor. Yet Dudley refused to leave, even as his conscience rebelled at compromising this beautiful innocent whose only proof of ownership was a dead earl’s promise. Dudley held the deed, but at what cost? Each day under the same roof brought its share of temptation, intimacy, and guilt. But Viola knew it was a battle she could not afford to lose. Marriage was out of the question, and she would be no man’s mistress. Even as Dudley’s unnerving presence, his knowing smile, threatened to melt her resolve.Against his better judgment, Lord Ferdinand Dudley was beguiled. This maddening beauty had stirred him as no woman had before. And he was bound and determined to make her his own.At once sensuous, whimsical, and wonderfully romantic, Mary Balogh’s new novel holds us in thrall, bringing to life a love story that sizzles with passion and originality.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "A Summer to Remember: A Bedwyn Family Novel (Get Connected Romances)",
        "Authors": "By Balogh, Mary",
        "Description": "“Matchless storyteller”(Romantic Times) Mary Balogh weaves a tantalizing web of wit and seduction in her new novel—an irresistible tale of two unlikely lovers and one unforgettable summer.Kit Butler is cool, dangerous, one of London’s mostinfamous bachelors—marriage is the last thing on his mind.  But Kit’s family has other plans. Desperate to thwart his father’s matchmaking, Kit needs a bride...fast. Enter Miss Lauren Edgeworth.A year after being abandoned at the altar, Lauren has determined that marriage is not for her. When these two fiercely independent souls meet, sparks fly—and a deal is hatched.  Lauren will masquerade as Kit’s intended if he agrees to provide a passionate, adventurous, unforgettable summer. When summer ends, she will break off the engagement, rendering herself unmarriageable and leaving them both free. Everything is going perfectly—until Kit does the unthinkable: He begins to fall in love.  A summer to remember is not enough for him.  But how can he convince Lauren to be his...for better, for worse, for the rest of their lives?",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Harold's Circus (Purple Crayon Books)",
        "Authors": "By Johnson, Crockett",
        "Description": "From the treasured creator of Harold and the Purple Crayon, Crockett Johnson, comes another adventure for Harold and his magical purple crayon.One night Harold, with his trusty purple crayon, goes for a walk on a tightrope. Down he falls into a circus complete with trapeze, clowns, and lion tamers. A must-have for every imaginative child’s bookshelf.“As fresh and imaginative as ever.” (The Horn Book)“Harold is at the top of his form.” (New York Times)",
        "Category": " Juvenile Fiction , Imagination & Play",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "The Secret Pearl: A Novel",
        "Authors": "By Balogh, Mary",
        "Description": "Mary Balogh has no equal when it comes to capturing the complex,  irresistible passions between men and women. Her classic novel, The Secret Pearl, is one of the New York Times bestselling author’s finest–a tale of temptation and seduction, of guarded hearts and raw emotion…and of a love so powerful it will take your breath away….He first spies her in the shadows outside a London theatre, a ravishing creature forced to barter her body to survive. To the woman known simply as Fleur, the well-dressed gentleman with the mesmerizing eyes is an unlikely savior.  And when she takes the stranger to her bed, she never expects to see him again. But then Fleur accepts a position as governess to a young girl…and is stunned to discover that her midnight lover is a powerful nobleman. As two wary hearts ignite–and the threat of scandal hovers over them–one question remains: will she be mistress or wife?",
        "Category": " Fiction , Romance , Regency",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Bin Ladens: An Arabian Family in the American Century",
        "Authors": "By Coll, Steve",
        "Description": "The rise and rise of the Bin Laden family is one of the great stories of the twentieth century; its repercussions have   already deeply marked the twenty-first. Until now, however, it is a story that has never been fully told, as the Bin   Ladens have successfully fended off attempts to understand the family circles from which Osama sprang. In this the   family has been abetted by the kingdom it calls home, Saudi Arabia, one of the most closed societies on earth.      Steve Coll’s The Bin Ladens: An Arabian Family in the American Century is the groundbreaking history of a   family and its fortune. It chronicles a young illiterate Yemeni bricklayer, Mohamed Bin Laden, who went to the new,   oil-rich country of Saudi Arabia and quickly became a vital figure in its development, building great mosques and   highways and making himself and many of his children millionaires. It is also a story of the Saudi royal family, whom   the Bin Ladens served loyally and without whose capricious favor they would have been nothing. And it is a story of   tensions and contradictions in a country founded on extreme religious purity, which then became awash in oil   money and dazzled by the temptations of the West. In only two generations the Bin Ladens moved from a famine-  stricken desert canyon to luxury jets, yachts, and private compounds around the world, even going into business   with Hollywood celebrities. These religious and cultural gyrations resulted in everything from enthusiasm for   America—exemplified by Osama’s free-living pilot brother Salem—to an overwhelming determination to destroy   it.    The Bin Ladens is a meticulously researched, colorful, shocking, entertaining, and disturbing narrative of   global integration and its limitations. It encapsulates the unsettling contradictions of globalization in the story of a   single family who has used money, mobility, and technology to dramatically varied ends.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Penguin Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Mandie and the Hidden Treasure (Mandie, Book 9)",
        "Authors": "By Leppard, Lois Gladys",
        "Description": "Mandie and her friend Celia discover a buried treasure and embark on a new adventure",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "13.46",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "You Will Live Again",
        "Authors": "By Steiger, Brad",
        "Description": "",
        "Category": "",
        "Publisher": "Dell Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1978"
        }
    },
    {
        "Title": "Cool Repentance (Jemima Shore Mysteries (Paperback))",
        "Authors": "By Fraser, Antonia",
        "Description": "Each of Antonia Fraser’s four Jemima Shore mysteries has enlarged the audience for that redoubtable and unpremeditated sleuth. This new one is set against a theatrical background and shows all the narrative skills that have marked the works of its distinguished author along with an ever-increasing quality of suspense. It is the chilling story of Christobel, a beautiful and profligate actress, who thought she could just come back, repent, and resume with impunity the life she had deserted.",
        "Category": "",
        "Publisher": "W. W. Norton and Company, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    }
]