[
    {
        "Title": "Good Dogs Bad Habits: The Complete A-To-Z Guide for When Your Dog Misbehaves",
        "Authors": "By Carlson, Jeanne and Green, Ranny",
        "Description": "Who said you can't teach an old dog new tricks? \"I love my dog, but he chews on everything, jumps on my friends, barks at my neighbors, digs up my yard, and chases my cat. When I try to walk him, he drags me down the street like I'm a sled!\" Sound familiar? Wondering how to trade your dog's bad habits for good habits? You're holding the answer in your hands! These and other common behavior problems can drive even the most caring and patient dog owner crazy. Good Dogs, Bad Habits gives you the insights and tools necessary to help your dog learn better habits. Straightforward advice, step-by-step instructions, and on-the-spot solutions will eliminate your dog's bad behavior -- not just for the moment, but forever. Included are Carlson's innovative calming massage techniques, which are incorporated into the training process; these unique methods all but guarantee success. Using a quick A-to-Z format, the authors provide solutions for such problems as: * How to solve housebreaking difficulties that have you baffled * What to do when your dog's barking is out of control * How to stop your dog from destroying your shoes, furniture, or yard * What to do if your dog is shy, nervous, or overly excitable * How to help your children and dog get along better So before you send Fido to the doghouse -- get hold of this must-have compendium of excellent advice and watch your dog become the happiest, most mannerly, and best-behaved furry friend ever.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Chile Pepper Book: A Fiesta of Fiery, Flavorful Recipes",
        "Authors": "By Belsinger, Susan and Dille, Carolyn",
        "Description": "Discusses the history of chile peppers, provides advice on cooking and growing them, and shares recipes for appetizers, sauces, main and side dishes, and desserts",
        "Category": " Cooking , Reference",
        "Publisher": "Interweave Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "White House Inc. Employee Handbook",
        "Authors": "By Wooden, John A. (EDT)",
        "Description": "From the creators of WhiteHouse.org comes the guide to success, profit, and eternal salvation in Bush's Executive Branch  WhiteHouse.org, the Internet's most popular political parody, busts the Executive Mansion's elegant doors wide open to take you on a hilariously eye-popping, completely top secret tour through the most guarded-and ridiculous-people, places, prophesies, and policies of the otherwise \"on message\" world of the George W. Bush Administration. The White House Inc. Employee Handbook reveals the secret life of the White House staffer-from his introduction to senior management (Dick Cheney, commander of the Commander-in-Chief; Donald Rumsfeld, secretary of the smackdown; etc...) to the official Bush policy on hot-button issues (ex: homelessness: eliminate the glut of shelters so these people can finally live up to their name).  Equal parts shrewd business lampoon and political send-up, this is wickedly astute satire at its finest-funny and gutsy, with a frightening, yet familiar ring of that oft-forgotten thing called truth. Welcome to The White House Inc., patriotic worker bee-you picked the winning team!",
        "Category": " Humor , Topic , Political",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Elixir",
        "Authors": "By Bunn, T. Davis (COR)",
        "Description": "Against a backdrop of international intrigue and ruthless drug monopolies, award-winning author Davis Bunn delivers an intoxicating page-turner in this redemptive thriller.Multi-billion dollar giant Revell Pharmaceuticals is devouring its competition. A new research breakthrough propels the company into releasing its most profitable product ever. Yet a family crisis confronts them when Kirra Revell, heiress to the empire, goes missing. Taylor Knox, an employee of Revell's latest acquisition, is blackmailed into leading the search. An expert surfer, Taylor pursues the world's biggest waves as a cover, only to be ensnared in a deadly contest of corporate espionage. In the race to find Kirra, everyone's motives are suspect. A Celtic monk's warning only heightens the peril. Is it money, power, passion, or something deeper that compels Taylor to risk everything? From Scotland's holy islands to the rugged Basque coast of Spain, from boardrooms and luxury yachts to the dungeons of America's oldest surviving fortress, the hunt is on. Can Taylor Knox achieve his quest before time runs out for Kirra Revell -- and for himself?",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Better Homes and Gardens: Vegetables : The Gardeners Collection (BETTER HOMES AND GARDENS THE GARDENER'S COLLECTION)",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Offers suggestions for planning a vegatable garden, discusses vegetable planting and care, and lists popular garden vegetables",
        "Category": " Gardening , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "A Delirious Summer: A Novel",
        "Authors": "By Blackston, Ray",
        "Description": "Jay Jarvis returns to South Carolina, and brings his Spanish language teacher Neil Rucker with him, with their quest for single ladies leading them both to the only place women seem to be found: the local church. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "She's Having a Baby - and I'm Having a Breakdown",
        "Authors": "By Barron, James Douglas",
        "Description": "A Man&#39;s Survival Guide to PregnancyIt&#39;s easy for a man to feel like a bystander during pregnancy. Finally, from one man to another, here is a pregnancy book with funny, down-to-earth, and practical advice on:   figuring out what you wife&#39;s obstetrician is saying   keeping your sex life alive   staying on top of insurance forms and other paperwork   and much, much moreThis book will help make pregnancy the experience of a lifetime.",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Ronald Reagan: The Great Communicator",
        "Authors": "By Ryan, Frederick J., Jr., Reagan, Nancy (INT), and Noonan, Peggy (AFT)",
        "Description": "This unique collection of photographs and quotations is a celebration of the warmth, wisdom, and wit of Ronald Reagan, one of America's most beloved presidents.  Through more than half a century of public life, he spoke with consistency and contagious optimism to the hearts and minds of American people, and his ability to inspire and persuade led to his reputation as \"the Great Communicator.\"  This volume is the consummate treasury of his insights and unwavering beliefs, carefully selected from thousands of speeches and public appearances.  It is a spirited tribute to one of the twentieth century's greatest political leaders, whose captivating humor and enduring optimism helped shape a nation.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Finding the Boyfriend Within: A Practical Guide for Tapping into your own Scource of Love, Happiness, and Respect",
        "Authors": "By Gooch, Brad",
        "Description": "In the tradition of the perennial bestseller I'm OK, You're OK, noted author Brad Gooch offers single and coupled gay men a provocative, sophisticated, and inspirational guide that addresses the big issues of love, romance, and being alone. Part memoir, part self-help, Finding the Boyfriend Within is a remarkably practical and helpful guide in the quest for self-discovery for the thousands of gay men who despair of ever being in a committed relationship.  Filled with anecdotes, romantic advice, problem-solving suggestions, and humor -- as well as wisdom from both the East and West -- Finding the Boyfriend Within offers simple self-awareness exercises to help discover the respect, happiness, and love that come first, and most enduringly, from within.",
        "Category": " Social Science , LGBT Studies , Gay Studies",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "'Tis: A Memoir",
        "Authors": "By McCourt, Frank",
        "Description": "A #1 New York Times bestseller and the eagerly anticipated sequel to the Pulitzer Prize–winning Angela’s Ashes, this masterpiece from Frank McCourt tells of his American journey from impoverished immigrant to brilliant teacher and raconteur.Frank McCourt’s glorious childhood memoir, Angela’s Ashes, has been loved and celebrated by readers everywhere for its spirit, its wit and its profound humanity. A tale of redemption, in which storytelling itself is the source of salvation, it won the National Book Critics Circle Award, the Los Angeles Times Book Award and the Pulitzer Prize. Rarely has a book so swiftly found its place on the literary landscape.And now we have ’Tis, the story of Frank’s American journey from impoverished immigrant to brilliant teacher and raconteur. Frank lands in New York at age nineteen, in the company of a priest he meets on the boat. He gets a job at the Biltmore Hotel, where he immediately encounters the vivid hierarchies of this “classless country,” and then is drafted into the army and is sent to Germany to train dogs and type reports. It is Frank’s incomparable voice—his uncanny humor and his astonishing ear for dialogue—that renders these experiences spellbinding. When Frank returns to America in 1953, he works on the docks, always resisting what everyone tells him, that men and women who have dreamed and toiled for years to get to America should “stick to their own kind” once they arrive. Somehow, Frank knows that he should be getting an education, and though he left school at fourteen, he talks his way into New York University. There, he falls in love with the quintessential Yankee, long-legged and blonde, and tries to live his dream. But it is not until he starts to teach—and to write—that Frank finds his place in the world. The same vulnerable but invincible spirit that captured the hearts of readers in Angela’s Ashes comes of age. As Malcolm Jones said in his Newsweek review of Angela’s Ashes, “It is only the best storyteller who can so beguile his readers that he leaves them wanting more when he is done...and McCourt proves himself one of the very best.” Frank McCourt's ’Tis is one of the most eagerly awaited books of our time, and it is a masterpiece.",
        "Category": " Social Science , Emigration & Immigration",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Law of Similars",
        "Authors": "By Bohjalian, Christopher A.",
        "Description": "From the New York Times bestselling author of Midwives comes this riveting medical thriller about a lawyer, a homeopath, and a tragic death.  When one of homeopath Carissa Lake's patients falls into an allergy-induced coma, possibly due to her prescribed remedy, Leland Fowler's office starts investigating the case.  But Leland is also one of Carissa's patients, and he is begining to realize that he has fallen in love with her.  As love and legal obligations collide, Leland comes face-to-face with an ethical dilemma of enormous proportions.  Graceful, intelligent, and suspenseful, The Law of Similars is a powerful examination of the links between hope and hubris, love and deception.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Open Net",
        "Authors": "By Plimpton, George",
        "Description": "The author recounts his experiences attending the Boston Bruins training camp and briefly playing in goal in a preseason game against the Philadelphia Flyers",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Racing Through Paradise: A Pacific Passage",
        "Authors": "By Buckley, William F.",
        "Description": "Chronicles the author's four-thousand-mile sailing voyage across the Pacific ocean with four close friends, his son, Christopher, and a photographer",
        "Category": " Travel , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "59.95",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Charles at Fifty",
        "Authors": "By Holden, Anthony",
        "Description": "An intimate, insider's study of the public and private worlds of Prince Charles on his fiftieth birthday offers a frank look at the marriage of Charles and Diana, his relationship with Camilla, his role as a father, and more. By the author of Diana: Her Life & Her Legacy. 75,000 first printing.",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Garlic",
        "Authors": "By Hazen, Janet",
        "Description": "Presents thirty international recipes for appetizers, soups, salads, entrees, and sauces featuring garlic",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "The Little Kernel Cookbook",
        "Authors": "By Stapley, Patricia",
        "Description": "A collection of ideas for cooking with corn features dozens of recipes for dishes ranging from Paris, Texas, corn and potato pancakes to corn blini shortstack with caviar Gorbachev",
        "Category": " Cooking , Reference",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Angela's Ashes: A Memoir",
        "Authors": "By McCourt, Frank",
        "Description": "A Pulitzer Prize–winning, #1 New York Times bestseller, Angela’s Ashes is Frank McCourt’s masterful memoir of his childhood in Ireland.“When I look back on my childhood I wonder how I managed to survive at all. It was, of course, a miserable childhood: the happy childhood is hardly worth your while. Worse than the ordinary miserable childhood is the miserable Irish childhood, and worse yet is the miserable Irish Catholic childhood.” So begins the luminous memoir of Frank McCourt, born in Depression-era Brooklyn to recent Irish immigrants and raised in the slums of Limerick, Ireland. Frank’s mother, Angela, has no money to feed the children since Frank’s father, Malachy, rarely works, and when he does he drinks his wages. Yet Malachy—exasperating, irresponsible, and beguiling—does nurture in Frank an appetite for the one thing he can provide: a story. Frank lives for his father’s tales of Cuchulain, who saved Ireland, and of the Angel on the Seventh Step, who brings his mother babies. Perhaps it is story that accounts for Frank’s survival. Wearing rags for diapers, begging a pig’s head for Christmas dinner and gathering coal from the roadside to light a fire, Frank endures poverty, near-starvation and the casual cruelty of relatives and neighbors—yet lives to tell his tale with eloquence, exuberance, and remarkable forgiveness. Angela’s Ashes, imbued on every page with Frank McCourt’s astounding humor and compassion, is a glorious book that bears all the marks of a classic.",
        "Category": " Biography & Autobiography , Survival",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Diana: A Tribute to the People's Princess",
        "Authors": "By Donnelly, Peter",
        "Description": "Celebrates the life of the late princess, mother, and advocate, from her early childhood to her altrustic missions worldwide, in more than two hundred full-color and black-and-white photographs and quotations from those whose lives she touched.",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Sierra Club Guides to the National Parks of the Pacific Southwest and Hawaii (The Sierra Club guides)",
        "Authors": "By Sierra Club (COR)",
        "Description": "Describes the history, geology, facilities and trails of eight national parks, including Sequoia and Yosemite, and includes information on local mammals, birds, reptiles, trees and flowers",
        "Category": "",
        "Publisher": "Random House Inc (P)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Hiring The Best",
        "Authors": "By Yate, Martin",
        "Description": "Offers tips on how to analyze the strengths and weaknesses of a job candidate through an interview",
        "Category": "",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Wind in the Stone",
        "Authors": "By Norton, Andre",
        "Description": "An evil magician's enslavement of a peaceful valley is hampered by a woman driven into the forest as a child and raised to be a master magician herself.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Eos",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Merchants' War",
        "Authors": "By Pohl, Frederik",
        "Description": "The great Account Executives of Earth will stop at nothing--not even war--to crush the handful of rebels on Venus who oppose their all-encompassing domination",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "Cosm",
        "Authors": "By Benford, Gregory",
        "Description": "On an otherwise ordinary day not long from now, inside a massive installation of ultra-high-energy scientific equipment, something goes wrong with a brilliant young physicist's most ambitious experiment. But this is not a calamity. It will soon be seen as one of the most significant breakthroughs in history.For the explosion has left something behind: a wondrous sphere the size of a basketball, made of nothing known to science. Before long, it will be clear that this object has opened a vista on an entirely different universe - a newborn cosmos whose existence will rock this world and test one woman to the limit as she comes face-to-face with fame and terror. That woman is the physicist who has ignited this thrilling adventure.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Manhattan Transfer",
        "Authors": "By Stith, John E.",
        "Description": "Aliens come to Earth and decide that Manhattan would make a great souvenir, in a tale by a science fiction master that explores how ordinary people would cope with removal from the planet.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Transfigurations",
        "Authors": "By Bishop, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley Pub. Corp. : distributed by Putnam",
        "Price Starting With ($)": "25.03",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The World and Thorinn",
        "Authors": "By Knight, Damon Francis",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley Publishing Corp., distributed by Putnam",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Strange Justice: The Selling of Clarence Thomas",
        "Authors": "By Mayer, Jane and Abramson, Jill",
        "Description": "After almost three years of intensive research, two superb journalists shed much light on the explosive issues that arose during the confirmation hearings: Did Thomas indeed harass Hill? How did Hill's allegations leak to the press? Why was the Senate Judiciary Committee unable to solve the mysteries surrounding the case?But as Jane Mayer and Jill Abramson show, the story of Thomas's ascension to the Court goes far beyond what emerged during the hearings. Over the course of their investigation, the authors conducted hundreds of interviews - including the first on-the-record interview with Anita Hill about her role in the controversy - and uncovered many documents that were never shared with the public. For the first time, we learn about Thomas's ten-year campaign for the high court and the doubts about him that haunted the White House from the start. We see the profound cynicism behind the administration's campaign for Thomas: its canny manipulation of the weak and scandal-ridden Senate, its quiet collaboration with the religious right, its calculated creation of \"grassroots\" black support. In the end, we learn the truth about who Clarence Thomas and Anita Hill really are and how both were treated unfairly by Washington's establishment.",
        "Category": " Law , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Child Growth and Development 03/04 (ANNUAL EDITIONS : CHILD GROWTH AND DEVELOPMENT)",
        "Authors": "By Junn, Ellen N. (EDT) and Boyatzis, Chris J. (EDT)",
        "Description": "",
        "Category": " Psychology , Developmental , Child",
        "Publisher": "McGraw-Hill College",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Perilous Pursuits: Our Obsession With Significance",
        "Authors": "By Stowell, Joseph M.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Moody Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "ACTIVE FAITH: How Christians are Changing the Face of American Politics",
        "Authors": "By Reed, Ralph",
        "Description": "Ralph Reed, Executive Director of the Christian Coalition, is responsible for wedding high technology with cutting-edge political organization to engineer the most efficient and effective projection of religion into the nation's political life in modern times. In Active Faith, Reed articulates a new \"theology\" of political activism for devout Christians and calls upon all Americans, both religious and secular, to heal our ailing body politic.With a historian's practiced eye, Reed recounts the long tale of religious involvement in American life, showing that despite the popular belief, devout Christians and religious rhetoric have been the driving force behind nearly every major social reform movement in America, whether of the right or of the left. From abolition to the New Deal, from the labor movement to civil rights, Christian believers have been instrumental to the expansion of social justice in the United States. Reed paints compelling portraits of the most famous religious reformers of the past, including William Jennings Bryan, Walter Rauschenbusch, and Martin Luther King, Jr., men whose ideas and ideals exerted a broad positive influence on the secular politics of their day.By contrast, the involvement of Christian conservatives in politics today prompts puzzlement, anger, and condescension from the media and establishment politicians. Reed explains why this is so, blaming a knee-jerk secularism that has infected many of our institutions and that makes American elites suspect any public pronouncements of religious faith, Christian or otherwise.Reed gives a detailed account of how the Christian Coalition overcame media hostility, cultural stereotypes, and the missteps of the old religious right to become a respected and permanent fixture in American politics. Today, by uniting with Catholics and observant Jews, as well as reaching out to African-Americans, it stands poised to capture majority status on hundreds of local school boards, in city councils, in state legislatures, and in the U.S. Congress itself.",
        "Category": " Political Science , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Man before the morning",
        "Authors": "By Maiden, Cecil",
        "Description": "",
        "Category": "",
        "Publisher": "Christian Herald Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "My American Journey: An Autobiography",
        "Authors": "By Persico, Joseph E. and Powell, Colin",
        "Description": "\"A GREAT AMERICAN SUCCESS STORY . . . AN ENDEARING AND WELL-WRITTEN BOOK.\"--The New York Times Book ReviewColin Powell is the embodiment of the American dream. He was born in Harlem to immigrant parents from Jamaica. He knew the rough life of the streets. He overcame a barely average start at school. Then he joined the Army. The rest is history--Vietnam, the Pentagon, Panama, Desert Storm--but a history that until now has been known only on the surface. Here, for the first time, Colin Powell himself tells us how it happened, in a memoir distinguished by a heartfelt love of country and family, warm good humor, and a soldier's directness. MY AMERICAN JOURNEY is the powerful story of a life well lived and well told. It is also a view from the mountaintop of the political landscape of America. At a time when Americans feel disenchanted with their leaders, General Powell's passionate views on family, personal responsibility, and, in his own words, \"the greatness of America and the opportunities it offers\" inspire hope and present a blueprint for the future. An utterly absorbing account, it is history with a vision.\"The stirring, only-in-America story of one determined man's journey from the South Bronx to directing the mightiest of military forces . . . Fascinating.\"--The Washington Post Book World\"Eloquent.\"--Los Angeles Times Book Review\"PROFOUND AND MOVING . . . . Must reading for anyone who wants to reaffirm his faith in the promise of America.\"--Jack Kemp The Wall Street Journal\"A book that is much like its subject--articulate, confident, impressive, but unpretentious and witty. . . . Whether you are a political junkie, a military buff, or just interested in a good story, MY AMERICAN JOURNEY is a book well worth reading.\"--San Diego Union Tribune\"Colin Powell's candid, introspective autobiography is a joy for all with an appetite for well-written political and social commentary.\"--The Detroit NewsFrom the Paperback edition.",
        "Category": " Biography & Autobiography , Cultural Heritage",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Veil: The Secret Wars of the CIA 1981-1987",
        "Authors": "By Woodward, Bob",
        "Description": "Based on hundreds of inside sources and secret documents, the author reveals the inner operations of the C.I.A., the world's largest and most sophisticated espionage apparatus, its players, and its clandestine relationships throughout the world",
        "Category": " Political Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "For the Glory: College Football Dreams and Realities Inside Paterno's Program",
        "Authors": "By Denlinger, Ken",
        "Description": "Every year thousands of high school seniors across America dream of playing big-time college football. In For the Glory, Ken Denlinger takes the reader on a five-year odyssey into the lives of one scholarship class and reveals their experiences at Penn State and in Coach Joe Paterno's program.Here is the college football experience as seen through the eyes of the young men who play the game. Ken Denlinger was given extraordinary access to the Penn State football program starting with the recruiting process and then onto the field and in the locker room. Over five years, Ken became a friend and confidant to twenty-eight scholarship players and one incredible walk-on. He found every player had the same dream: to become a college football hero and bring glory to himself and his school and then to ascend to the NFL. In this gritty account, Ken sets moving stories of triumph against the stark realities of injury, disillusionment, and failure.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Behind Palace Doors",
        "Authors": "By Dempster, Nigel and Evans, Peter",
        "Description": "For three decades, Nigel Dempster, London's top gossip columnist, has chronicled Britain's royal family and been the confidant of several of its members. While others have speculated about the royals' loves and liaisons, their marriages, divorces, and remarriages, Dempster has heard the truth from some of the most highly placed sources in Britain. In Behind Palace Doors, he and investigative journalist Peter Evans present a through-the-keyhole story of the marital woes of the Windsors and their most celebrated members, Prince Charles and Princess Diana.Behind Palace Doors is an astonishing anatomy of what went wrong and where it will end. The union of Charles and Diana, the authors reveal, was doomed from the start. Soon after the engagement, Charles told his parents he had made a \"bloody awful\" mistake, and begged to be released, but to no avail. As the marriage faltered, he returned to an old love, Camilla Parker Bowles, whose own husband was philandering. Caught in this sorrowful triangle, Diana changed from naive young girl to angry, vengeful wife. But the major reason the marriage fell apart, we learn, was not Camilla, or even Diana's own relationships with other men, but Diana's destructive tantrums and deep hereditary depressions. In less than two years' time, Dempster has learned, she will liberate herself from the Prince of Wales and his family.As for Charles's brother Andrew, his marriage to Sarah Ferguson fared no better. Five months pregnant with their second child, she began a close friendship with Texan Steve Wyatt, and later she kept steady company with her \"financial advisor\" John Bryan. The authors provide the reasons for Sarah's reckless behavior and explain why Andrew remained tolerant for so long.In this intimate, anecdotal book, Dempster and Evans take the reader inside the private family meeting called to handle the crisis surrounding the \"Camillagate\" tapes. The authors present the reactions - including actual comments - of the Queen and Prince Philip, the manipulations of the Queen Mother, and the acid recriminations of Princess Anne. They also divulge the wrenching trauma of the Parker Bowles family and describe an extraordinary scene in which Camilla's father dresses down the Prince of Wales.Revealing, at times even shocking, Behind Palace Doors is nonetheless surprisingly sympathetic. The authors portray the British royals as spoiled, selfish, frequently wanton, yet in the end, supremely human.",
        "Category": "",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Inside Music: How to Understand, Listen To, and Enjoy Good Music",
        "Authors": "By Haas, Karl and Mark, Mona (ILT)",
        "Description": "The renowned radio personality, lecturer, pianist, and conductor explains the fundamentals of music and musical instruments and offers ideas on how to build a record library",
        "Category": " Music , Instruction & Study , Appreciation",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Revolutionary ladies",
        "Authors": "By Young, Philip",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf; [distributed by Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "North American Indians",
        "Authors": "By Viola, Herman J. and Barnard, Bryn (ILT)",
        "Description": "Illustrated in full color, with full-color & black-and-white photographs and maps. Each chapter of this striking survey of Native American life begins in a uniquely appropriate way: with a dramatic, double-page painting showing the dwelling of a particular tribe. From a Zuni adobe pueblo to an Iroquois communal long house, paintings introduce the reader to the book's eight chapters covering the continent's eight regions and offer a comprehensive examination of the lifestyles of North America's native peoples. This splendid reference volume is enhanced by six essays by Native American contributors about their life today--a valuable feature that places the historical material in a contemporary context. A glossary, resource-guide sidebars on such topics as \"how to read\" a totem pole and the introduction of horses to North America, and over one hundred paintings, color photographs, and maps ensure that this book will rise above all others in bringing to life the world of the American Indian.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "How to Make Love to a Woman",
        "Authors": "By Smith, Gregory White, Naifeh, Steven W., and Morgenstern, Michael",
        "Description": "Explains what qualities women find attractive in men, describes the details of modern courtship, and offers frank advice on helping women achieve sexual fulfillment",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "New Vision, New Reality: A Guide to Unleashing Energy, Joy, and Creativity in Your Life",
        "Authors": "By Klein, Donald C. and Morrow, Kathleen",
        "Description": "New Vision, New Reality presents a promising new approach to realizing our human potential by reclaiming our birthright to energy, joy, and creativity. Demonstrating how we all configure our world through personal perceptions, author Donald Klein shows that by removing self-imposed protective filters we can see and experience more fully the good things in life. Guided exercises illustrate how to stop projecting our fears and shortcomings and instead view the world through a lens of appreciation.",
        "Category": " Self-help , Personal Growth , Self-Esteem",
        "Publisher": "Hazelden",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Lee and Grant: A Dual Biography",
        "Authors": "By Smith, Gene",
        "Description": "A dual portrait of the two Civil War leaders interweaves the lives of U.S. Grant and Robert E. Lee with the momentous historical events of the mid-nineteenth century in America",
        "Category": " Biography & Autobiography , General",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "The Complete Book of Quiltmaking",
        "Authors": "By Walker, Michele",
        "Description": "Shows a variety of new and traditional quilts made in Britain, the U.S., and Canada, explains how to design, piece, and assemble a quilt, and shares patchwork, applique, and quilting patterns",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "God incognito",
        "Authors": "By Schilling, S. Paul",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "10.26",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "HIROHITO: Behind the Myth",
        "Authors": "By Behr, Edward",
        "Description": "",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Beware the Crystal Dragon",
        "Authors": "By Maylan Schurch",
        "Description": "",
        "Category": "",
        "Publisher": "Review and Herald Publishing Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Picture Dictionary For Children",
        "Authors": "By Garnette Watters, Stuart A. Courtis",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap Publishers",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1948"
        }
    },
    {
        "Title": "Dictionary of Imaginary Places",
        "Authors": "By Guadalupi, Gianni and Manguel, Alberto",
        "Description": "From Atlantis to Xanadu and beyond, this Baedeker of make-believe takes readers on a tour of more than 1,200 realms invented by storytellers from Homer's day to our own. Here you will find Shangri-La and El Dorado; Utopia and Middle Earth; Wonderland and Freedonia. Here too are Jurassic Park, Salman Rushdie's Sea of Stories, and the fabulous world of Harry Potter. The history and behavior of the inhabitants of these lands are described in loving detail, and are supplemented by more than 200 maps and illustrations that depict the lay of the land in a host of elsewheres. A must-have for the library of every dedicated reader, fantasy fan, or passionate browser, Dictionary is a witty and acute guide for any armchair traveler's journey into the landscape of the imagination.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "7.88",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Grow Rich Slowly: The Merrill Lynch Guide to Retirement Planning",
        "Authors": "By Brown, Paul B. and Underwood, Don",
        "Description": "While people now in their fifties or sixties are grappling with the problem of shrinking employer pension plans, and wondering whether to roll over their pensions assets (two subjects that receive substantial attention in this book), baby boomers are in a different predicament. They may never have been in one job long enough to have acquired any meaningful pension. And they face other unique problems. Having decided to marry and have children later, odds are they'll be putting their kids through college while simultaneously worrying about their aging parents. When you face financial burdens like these, it's hard to think about retirement. Grow Rich Slowly can help, by providing information distilled from Merrill Lynch's extensive research into retirement planning and vast knowledge of investment principles.In clear, concise examples - whether they are talking about how to invest your retirement money or how to address estate planning - the authors explain how decisions you make today can make your retirement much more pleasant tomorrow.",
        "Category": " Business & Economics , General",
        "Publisher": "Viking",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Understanding: Eliminating Stress and Finding Serenity in Life and Relationships",
        "Authors": "By Nelsen, Jane",
        "Description": "Clears up misconceptions about relationships, tells how to find happiness in one's current situation in life, and offers advice on raising children",
        "Category": "",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "The St. Martin's handbook",
        "Authors": "By Lunsford, Andrea A.",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "When Anger Hurts: Quieting the Storm Within",
        "Authors": "By McKay, Matthew",
        "Description": "",
        "Category": "",
        "Publisher": "New Harbinger Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Crazy Time: Surviving Divorce and Building a New Life, Revised Edition",
        "Authors": "By Trafford, Abigail",
        "Description": "A fully revised and updated edition of the essential guide for men and women moving through the turmoil of divorce.",
        "Category": " Self-help , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "If It's Going to Be, It's Up to Me: The Eight Proven Principles of Possibility Thinking",
        "Authors": "By Schuller, Robert Harold",
        "Description": "Extracts a lifetime of motivational and spiritual wisdom into the eight principles of Possibility Thinking, explaining how to use these principles to develop goals, establish priorities, enhance commitment, and achieve success, fulfillment, and joy. $150,000 ad/promo. Tour.",
        "Category": " Religion , Inspirational",
        "Publisher": "Harper San Francisco",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Relative Values of Early American Patterned Glass",
        "Authors": "By Caurtman G. House",
        "Description": "",
        "Category": "",
        "Publisher": "Caurtman House",
        "Price Starting With ($)": "6.92",
        "Publish Date": {
            "Month": "January",
            "Year": "1944"
        }
    },
    {
        "Title": "Letters of a Nation: A Collection of Extraordinary American Letters",
        "Authors": "By Carroll, Andrew (EDT)",
        "Description": "A collection of some 200 letters by presidents, slaves, soldiers, prisoners, revolutionaries, artists, religious and civil rights leaders, and Americans from all walks of life, spanning 350 years of American culture and history. Letters offer eyewitness accounts of political and social upheaval, reveal private fears of the famous and powerful, and remind us of the horrors of war. Writers include Malcolm X, Elvis Presley, Eleanor Roosevelt, Amelia Earhart, and Benjamin Franklin. For students and general readers. No index. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Literary Criticism , Reference",
        "Publisher": "Kodansha USA Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Vintage Reading: From Plato to Bradbury: a Personal Tour of Some of the World’s Best Books",
        "Authors": "By Kanigel, Robert",
        "Description": "Story Easton knows the first line of every book, but never the last.She never cries, but she fakes it beautifully.And at night, she escapes from the failure of her own life by breaking into the homes of others, and feeling, for a short while, like a different, better person.But one night, as an uninvited guest in someone’s empty room, she discovers a story sadder than her own: a boy named Cooper Payne, whose dream of visiting the Amazon rainforest and discovering the moonflower from his favorite book, Once Upon a Moonflower, died alongside his father.For reasons even she doesn't entirely understand, Story decides that she will help Cooper and his mother. She will make his dream come true.The Understory is a magical, moving, funny, and poignant story of failure and success; of falling apart and rebuilding; and of coincidences that never really are. Part comedy, part drama, and part fairy tale, Elizabeth Leiknes’s second novel is a wonder you won't soon forget.",
        "Category": " Reference , General",
        "Publisher": "Bancroft Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Raggedy Ann in the Magic Book",
        "Authors": "By Gruelle, Johnny",
        "Description": "",
        "Category": "",
        "Publisher": "Bobbs-Merrill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Hormones from Hell: The Ultimate Womens Humor Book",
        "Authors": "By King, Jan",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "CCC Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Wordo Berzerko: An Uncommon Dictionary",
        "Authors": "By Hand, Ray",
        "Description": "",
        "Category": "",
        "Publisher": "HarperPerennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Disconnecting Parties: Managing the Bell System Break-Up, an Inside View",
        "Authors": "By Tunstall, Brooke",
        "Description": "The AT&T vice president responsible for divestiture planning details the entire process of the break-up and reorganization of the Bell System, focusing with an insider's eye on the daily challenges, responses, and managerial decisions involved",
        "Category": " Business & Economics , General",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "UP NEXT",
        "Authors": "By Star, Nancy",
        "Description": "As the new senior producer of the celebrated daytime gabfest Paula Live, May Morrison can barely juggle her time among her job, her two precocious daughters, and a post-Victorian dream house that's coming apart faster than her failed marriage did. But after rival talk-show producers start dropping faster than Nielsen ratings after sweeps week, the police believe May is behind their permanent cancellations.Then things get worse than a bad-hair day: every piece of evidence that criminally handsome Detective Paul O'Donnell has collected points to her.As the NYPD task force closes in, May realizes that someone has targeted her to take the fall. Now she's going to have to outwit a homicidal maniac who wants her dead, while resisting the arresting charms of one cop who wants her in prison, and another who simply wants her.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "The Nazi Officer's Wife: How One Jewish Woman Survived the Holocaust",
        "Authors": "By Beer, Edith Hahn",
        "Description": "Edith Hahn was an outspoken young woman in Vienna when the Gestapo forced her into a ghetto and then into a labor camp. When she returned home months later, she knew she would become a hunted woman and went underground. With the help of a Christian friend, she emerged in Munich as Grete Denner. There she met Werner Vetter, a Nazi Party member who fell in love with her. Despite Edith's protests and even her eventual confession that she was Jewish, he married her and kept her identity a secret.In wrenching detail, Edith recalls a life of constant, almost paralyzing fear. She tells of German officials who casually questioned the lineage of her parents; of how, when giving birth to her daughter, she refused all painkillers, afraid that in an altered state of mind she might reveal something of her past; and of how, after her husband was captured by the Soviet army, she was bombed out of her house and had to hide while drunken Russian soldiers raped women on the street.Yet despite the risk it posed to her life, Edith created a remarkable record of survival. She saved every document and set of papers issued to her, as well as photographs she managed to take inside labor camps. Now part of the permanent collection at the Holocaust Memorial Museum in Washington, D.C., these hundreds of documents, several of which are included in this volume, form the fabric of a gripping new chapter in the history of the Holocaust -- complex, troubling, and ultimately triumphant.",
        "Category": " History , Jewish",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Pawnbroker",
        "Authors": "By Wallant, Edward, Lewis",
        "Description": "Sol Nazerman survived the Holocaust. His wife and children did not -he witnessed their murder in a concentration camp. He is now a Harlem pawnbroker, emotionally dead and indifferent to the desperation around him, running his shop as a front for a racketeer. Made into an Academy Award-winning film starring Rod Steiger, this is one of the most moving pieces in modern fiction.",
        "Category": " Fiction , General",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "I Been in Sorrow's Kitchen and Licked Out All the Pots",
        "Authors": "By Straight, Susan",
        "Description": "Marietta Cook leaves South Carolina's Low Country to seek a new life in Charleston, only to become pregnant with twin boys whom she struggles to support as a domestic amid the turmoil of the civil rights movement.",
        "Category": " Fiction , African American , Historical",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Lanterns: A Memoir of Mentors",
        "Authors": "By Edelman, Marian Wright",
        "Description": "I am grateful beyond words for the example of the lanterns shared in this memoir whose lives I hope will illuminate my children's, your children's, and the paths of countless others coming behind.--Marian Wright Edelman, from the PrefaceMarian Wright Edelman, \"the most influential children's advocate in the country\" (The Washington Post), shares stories from her life at the center of this century's most dramatic civil rights struggles. She pays tribute to the extraordinary personal mentors who helped light her way: Martin Luther King, Jr., Robert F. Kennedy, Fannie Lou Hamer, William Sloane Coffin, Ella Baker, Mae Bertha Carter, and many others.She celebrates the lives of the great Black women of Bennettsville, South Carolina-Miz Tee, Miz Lucy, Miz Kate-who along with her parents formed a formidable and loving network of community support for the young Marian Wright as a Black girl growing up in the segregated South. We follow the author to Spelman College in the late 1950s, when the school was a hotbed of civil rights activism, and where, through excerpts from her honest and passionate college journal, we witness a national leader in the making and meet the people who inspired and empowered her, including Dr. Benjamin E. Mays, Howard Zinn, and Charles E. Merrill, Jr.Lanterns takes us to Mississippi in the 1960s, where Edelman was the first and only Black woman lawyer. Her account of those years is a riveting first-hand addition to the literature of civil rights: \"The only person I recognized in the menacing crowd as I walked towards the front courthouse steps was [a] veteran New York Times reporter. He neither acknowledged me nor met my eyes. I knew then what it was like to be a poor Black person in Mississippi: alone.\" And we follow Edelman as she leads Bobby Kennedy on his fateful trip to see Mississippi poverty and hunger for himself, a powerful personal experience for the young RFK that helped awaken a nation's conscience to child hunger and poverty. Lanterns is illustrated with thirty of the author's personal photographs and includes \"A Parent's Pledge\" and \"Twenty-five More Lessons for Life,\" an inspiration to all of us-parents, grandparents, teachers, religious and civic leaders-to guide, protect, and love our children every day so that they will become, in Marian Wright Edelman's moving vision, the healing agents for national transformation.",
        "Category": " Political Science , Civil Rights",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Microsoft Office 97 Professional 6 in 1",
        "Authors": "By Plumley, Sue, Fulton, Jennifer, Wempen, Faithe, Aitken, Peter G., Aitken, Peter G. (EDT), and Wempen, Faithe (EDT)",
        "Description": "Describes the features of Microsoft Windows 95, Windows NT, and each of the components in the integrated software package, and tells how to use them together",
        "Category": " Computers , General",
        "Publisher": "Que Pub",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Miss Lea's Bible Stories",
        "Authors": "By Lea, Rosemary",
        "Description": "",
        "Category": "",
        "Publisher": "Zagat Survey",
        "Price Starting With ($)": "4.91",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Avoiding Armageddon",
        "Authors": "By Schram, Martin",
        "Description": "Published in conjunction with the eight-hour public-television series airing this spring, Avoiding Armageddon focuses our attention like never before on threats posed by weapons of mass destruction and terrorism. It engages the reader in an exploration of who endangers our national interest, the forms their threats might take, and what can be done to avert the kinds of disasters likely to ensue from the use of unsecured weapons.Martin Schram and his team of reporters explain why biological, chemical, and nuclear warfare may very well be our next nightmare. Using interviews with an international team of experts, Avoiding Armageddon is a riveting story of America's newfound vulnerability and offers a new understanding of the future contours of our personal, national, and global security.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Rise of Babylon: Sign of the End Times",
        "Authors": "By Dyer, Charles H.",
        "Description": "Many people are curious—what does the Bible tell us about today's headlines from the Middle East? Is Armageddon just around the corner? What should Christians do? This book shows how Babylon and Iraq fit into the Bible's prophecies of last-day events. It brings understanding of God's plan in our perplexing age. It points readers to Jesus, the only source of security in today's tumultuous world.",
        "Category": " Social Science , General",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "A Life God Rewards: Why Everything You Do Today Matters Forever",
        "Authors": "By Wilkinson, Bruce and Kopp, David (CON)",
        "Description": "In this book, you're going to discover that God's son Jesus revealed a direct link between what you do today and what you will experience after you die. Astoundingly, the majority of spiritual seekers around the world -- including millions who follow Jesus -- seem to have missed what He said. Could you be one? If so, your picture of the future is missing about a billion stars. Author Bruce Wilkinson shows you what Jesus said about God's plan to reward you in eternity for what you do for Him today. What you'll discover will unlock the mystery of God's power, plan and will for your life. And you'll begin to live with the unshakable certainty that what you do today matters ... forever!Are You Looking at Eternity through a Keyhole?  In the little book you’re holding, you’re going to discover that Jesus revealed a direct link between what you do today and what you will experience after you die. Astoundingly, the majority of spiritual seekers around the world—including millions who follow Jesus—seem to have missed what He said.  Could you be one? If so, your picture of the future is missing about a billion stars.  In this stirring follow-up to his bestsellers The Prayer of Jabez and Secrets of the Vine, Bruce Wilkinson shows you what Jesus said about God’s plan to reward you in eternity for what you do for Him today.  What you’ll discover will unlock the power and potential of your life, starting now. And you’ll begin to live with the unshakable certainty that what you do today matters…forever!",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Jackie Robinson",
        "Authors": "By Rampersad, Arnold",
        "Description": "The extraordinary life of Jackie Robinson is illuminated as never before in this full-scale biography by Arnold Rampersad, who was chosen by Jack's widow, Rachel, to tell her husband's story, and was given unprecedented access to his private papers. We are brought closer than we have ever been to the great ballplayer, a man of courage and quality who became a pivotal figure in the areas of race and civil rights.Born in the rural South, the son of a sharecropper, Robinson was reared in southern California. We see him blossom there as a student-athlete as he struggled against poverty and racism to uphold the beliefs instilled in him by his mother--faith in family, education, America, and God. We follow Robinson through World War II, when, in the first wave of racial integration in the armed forces, he was commissioned as an officer, then court-martialed after refusing to move to the back of a bus. After he plays in the Negro National League, we watch the opening of an all-American drama as, late in 1945, Branch Rickey of the Brooklyn Dodgers recognized Jack as the right player to break baseball's color barrier--and the game was forever changed.Jack's never-before-published letters open up his relationship with his family, especially his wife, Rachel, whom he married just as his perilous venture of integrating baseball began. Her memories are a major resource of the narrative as we learn about the severe harassment Robinson endured from teammates and opponents alike; about death threats and exclusion; about joy and remarkable success. We watch his courageous response to abuse, first as a stoic endurer, then as a fighter who epitomized courage and defiance.We see his growing friendship with white players like Pee Wee Reese and the black teammates who followed in his footsteps, and his embrace by Brooklyn's fans. We follow his blazing career: 1947, Rookie of the Year; 1949, Most Valuable Player; six pennants in ten seasons, and 1962, induction into the Hall of Fame. But sports were merely one aspect of his life. We see his business ventures, his leading role in the community, his early support of Martin Luther King Jr., his commitment to the civil rights movement at a crucial stage in its evolution; his controversial associations with Eisenhower, Kennedy, Nixon, Humphrey, Goldwater, Nelson Rockefeller, and Malcolm X.Rampersad's magnificent biography leaves us with an indelible image of a principled man who was passionate in his loyalties and opinions: a baseball player who could focus a crowd's attention as no one before or since; an activist at the crossroads of his people's struggle; a dedicated family man whose last years were plagued by illness and tragedy, and who died prematurely at fifty-two. He was a pathfinder, an American hero, and he now has the biography he deserves.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Confessions of a Sociopathic Social Climber: The Katya Livingston Chronicles",
        "Authors": "By Lang, Adele",
        "Description": "After weasel-eyed tax inspectors question her work-related claims, Katya Livingston is forced to keep a financial diary. As well as documenting the cruel and parsimonious ways of her ad agency boss, Katya waxes lyrical about putting up with loser friends, mortal enemies, and thoroughly bad restaurants. She also throws in a completely candid account of her love life, just in case some of it is tax deductible. What begins as a private account of expenses rapidly becomes, through Katya's chronic delusions of grandeur, a matter of public record: first as a tawdry gossip column, then as a salacious book, and finally as a Hollywood B-movie.Bitingly written with wit and style reminiscent of Candace Bushnell, Adèle Lang's novel is a cutting, bitchy, hilarious take on the young-single-British-woman genre.",
        "Category": " Fiction , Humorous",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Raising a Family: Living on Planet Parenthood",
        "Authors": "By Elium, Don and Elium, Jeanne",
        "Description": "It's now time to turn your attention to an entirely new concept of family. . . .The new responsibility of children equals an exponential explosion of daily tasks: mounds of laundry, bushels of shopping for food and other stuff, preparing many meals for a diverse range of tastes, cleaning up after it all, chauffeuring people to and fro, planning events and schedules, maintaining the care of a pet or two. Then factor in time to yourself, time with your friends, romance with your partner, personal goals or interests?how will you ever juggle all this? The key is to approach the family not as a set of separate individuals pulling in twelve different directions, but as members within a group who all really do want to arrive together at the same destination.The Eliums teach us how to distinguish between the service-oriented environment of work, where energy is focused on a single goal or outcome, and the care-oriented environment of family, where there are multiple issues that need attention. When faced with conflict you will learn to ask, \"What does this group of people need, including me?\"?a questioning process known as FamilyMind.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The State We're In",
        "Authors": "By Hutton, Will",
        "Description": "This is an analysis of the social, political, and economic arrangements in Britain, which the author asserts have become out-of-date. He argues that the weaknesses of the economy cannot be divorced from the problems in the rest of society. He makes a critique of Britain's institutions and argues that we have an 18th-century state dealing with 20th-century issues.",
        "Category": " Political Science , Constitutions",
        "Publisher": "Random House UK",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Ship Fever: Stories",
        "Authors": "By Barrett, Andrea",
        "Description": "The elegant short fictions gathered hereabout the love of science and the science of love are often set against the backdrop of the nineteenth century. Interweaving historical and fictional characters, they encompass both past and present as they negotiate the complex territory of ambition, failure, achievement, and shattered dreams. In \"Ship Fever,\" the title novella, a young Canadian doctor finds himself at the center of one of history's most tragic epidemics. In \"The English Pupil,\" Linnaeus, in old age, watches as the world he organized within his head slowly drifts beyond his reach. And in \"The Littoral Zone,\" two marine biologists wonder whether their life-altering affair finally was worth it. In the tradition of Alice Munro and William Trevor, these exquisitely rendered fictions encompass whole lives in a brief space. As they move between interior and exterior journeys, \"science is transformed from hard and known fact into malleable, strange and thrilling fictional material\" (Boston Globe).",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Five Minutes in Heaven",
        "Authors": "By Alther, Lisa",
        "Description": "The author of Kinflicks narrates the story of a Tennessee woman who comes of age during the 1950s and 1960s, suffers the early death of her mother, and has relationships with a gay man and a married woman. Reprint. Tour.",
        "Category": " Fiction , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Streamlined Cooking for a Healthy Lifestyle (Cole's Kitchen Arts Series)",
        "Authors": "By Ovregaard, Keith (PHT), Carroll, Mary Harrison, and Lamotte, Michael",
        "Description": "",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Cole Group",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Mothers and Daughters: An Anthology",
        "Authors": "By Manguel, Alberto (EDT)",
        "Description": "Turning his inspired anthologizing skills to two subjects we can all relate to, celebrated writer and editor Alberto Manguel offers his most fascinating literary collections yet. Manguel brings his quirky sensibility and instinct for exceptional writing to a core realm of human experience, presenting an outstanding array of international voices that delve into the mystery of these primary relationships. Both volumes feature an exceptional collection of complete short stories, each selection accompanied by a provocative introduction from the editor. With such writing talents as Richard Ford, Kensaburo Oe, Margaret Atwood, Bharati Mukherjee, Ethan Canin, Anita Desai, and many others,Mothers & Daughters and Fathers & Sons explode the typical and plunge us into a literary world at turns humorous, dark, touching, bizarre, and moving.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Gluck (McGraw-Hill paperbacks)",
        "Authors": "By Einstein, Alfred",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw Hill Book Co.",
        "Price Starting With ($)": "19.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Funniest Joke Books: Daffy Definitions",
        "Authors": "By Rosenbloom, Joseph",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Loving Che",
        "Authors": "By Menendez, Ana",
        "Description": "The story opens in contemporary Miami, where a young Cuban woman has for years been searching in vain for details of her birth mother. All she knows of her past is that her grandfather had fled the turbulent Havana of the 1960s for Miami with her in tow, and that pinned to her sweater - possibly by her mother - were a few treasured lines of a Pablo Neruda poem. These facts remain her only tenuous links to her history, until a mysterious parcel arrives in the mail. Inside the soft, worn box are layers of writings and photographs. Fitting these pieces together with insights she gleans from several trips back to Havana, the daughter reconstructs the life of her mother, her youthful affair with the enigmatic Che, and the child she bore by the handsome rebel.",
        "Category": " Fiction , Literary",
        "Publisher": "Atlantic Monthly Pr",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Setting of the Pearl: Vienna under Hitler",
        "Authors": "By Weyr, Thomas",
        "Description": "When Adolf Hitler seized Vienna in the Anschluss of 1938, he called the city \"a pearl to which he would give a proper setting.\" But the setting he left behind seven years later was one of ruin and destruction--a physical, spiritual, and intellectual wasteland.     Here is a grippingly narrated and heartbreaking account of the debasement of one of Europe's great cities. Thomas Weyr shows how Hitler turned Vienna from a vibrant metropolis that was the cradle of modernism into a drab provincial town. In this riveting narrative, we meet Austrian traitors like Arthur Seyss-Inquart and mass murderers like Odilo Globocnik; proconsuls like Joseph Buerckel, who hacked Austria into seven pieces, and Baldur von Schirach, who dreamed of making Vienna into a Nazi capital on the Danube--and failed miserably. More painfully, Weyr chronicles the swift destruction of a rich Jewish culture and the removal of the city's 200,000 Jews through murder, exile, and deportation. Vienna never regained the global role the city had once played. Today, Weyr concludes, only the monuments remain--beautiful but lifeless.     This is not only the story of Nazi leaders but of how the Viennese themselves lived and died: those who embraced Hitler, those who resisted, and the many who merely, in the local phrase, \"ran after the rabbit.\" The author draws on his own experiences as a child in Vienna under Nazi rule in 1938, and those of his parents and friends, plus extensive documentary research, to craft a vivid historical narrative that chillingly captures how a once-great city lost its soul under Hitler.",
        "Category": " History , Military , World War II",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Brave Enemies: A Novel of the American Revolution (Shannon Ravenel Books)",
        "Authors": "By Morgan, Robert",
        "Description": "As the War for Independence wore on into the 1780s, unrest ruled the Carolinas. Settlers who had cleared the land after the Cherokees withdrew were being mustered for battle as British forces pillaged their hard-won farms. Robert Morgan's stunning novel tells a story of two people caught in the chaos raging in the wilderness.After sixteen-year-old Josie Summers murders her abusive stepfather, she runs away from home disguised as a boy. Lost in the woods, she accepts a young preacher's invitation to assist in his itinerant ministry. Eventually her identity is revealed and affection grows between the two. But when the preacher is kidnapped by British soldiers, Josie disguises herself once again and joins the militia in a desperate attempt to find him.Brave Enemies is a page-turning story of people brought together by chance and torn apart by war—a story of enduring love and of the struggle to build a homeland.",
        "Category": " Fiction , Historical",
        "Publisher": "A Shannon Ravenel Book",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Notebooks of the Mind: Explorations of Thinking",
        "Authors": "By John-Steiner, Vera",
        "Description": "Analyzes the thought processes of creative individuals, suggests a model for intellectual development, and discusses different modes of thinking",
        "Category": " Psychology , Cognitive Psychology & Cognition",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Sneeze on Sunday",
        "Authors": "By Norton, Andre and Hogarth, Gene Allen",
        "Description": "While on vacation in Massachusetts, librarian and writer Fredricka Wing discovers a corpse in her backyard hammock, her helper Margie is found dead, and she realizes that she may be the next victim on the killer's list",
        "Category": " Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Another Day At The Front: Dispatches From The Race War",
        "Authors": "By Reed, Ishmael",
        "Description": "African Americans have been at war with some elements of the white population from the very beginning. In this collection of essays, his first since Airing Dirty Laundry in 1993, Reed explores the many forms that this homefront war has taken. His brilliant social criticism feints deftly among past and present, government and media, personal and political. From the author whose essay style has been compared to the punching power of boxers Mike Tyson and Muhammad Ali, this book is a series of fast, powerful strikes against America's long tradition of racism.",
        "Category": " Political Science , Civil Rights",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Iliad (Wordsworth Classics)",
        "Authors": "By Homer",
        "Description": "Recounts the triumphs and defeats of the Greek and Trojan heroes during the Trojan War and the destruction of Troy by combined Greek armies",
        "Category": " Poetry , European , General",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Discipline with Dignity",
        "Authors": "By Curwin, Richard L and Mendler, Allen N.",
        "Description": "",
        "Category": " Business & Economics , Management",
        "Publisher": "Association for Supervision & Curriculum Deve",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Talking About Divorce and Separation: A Dialogue Between Parent and Child",
        "Authors": "By Grollman, Earl A.",
        "Description": "A guide to helping small children of divorcing parents understand and accept the fact that their parents are no longer able to live in the same residence together. Includes a parents' guide, sources for further help, and a bibliography of fiction and non-fiction about divorce.",
        "Category": " Social Science , General",
        "Publisher": "Beacon Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1975"
        }
    },
    {
        "Title": "Never Trust a Calm Dog: And Other Rules of Thumb",
        "Authors": "By Parker, Tom",
        "Description": "Offers thousands of pieces of wisdom and advice, providing solutions to such dilemmas as when to stop pouring milk on Cheerios and how to estimate the number of people it takes to capture a python",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Bill Clinton and Black America",
        "Authors": "By Clinton, Bill and Wickham, Dewayne",
        "Description": "Featuring contributions from Mary Frances Berry, Suzanne DePasse, Bill Gray, Alice Randall, and others, a landmark collection of interviews with prominent African Americans on the Clinton presidency reveals Clinton's very personal connection to Black America, exploring his administration and his move to Harlem after his presidency ended.",
        "Category": " History , General",
        "Publisher": "One World/Ballantine",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Katharine and E.B. White: An Affectionate Memoir",
        "Authors": "By Russell, Isabel",
        "Description": "Isabel Russell gives readers a portrait, both humorous and touching, of one of the great literary marriages of our time and of two people whose love for one another and their work burned as brightly in their old age as it did in their youth.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Turning Right: The Making of the Rehnquist Supreme Court",
        "Authors": "By Savage, David G.",
        "Description": "Based on the author's extensive coverage of the Supreme Court (including personal interviews), it lifts the veil of secrecy surrounding the Court by showing who the justices are and how they make their decisions. Explores the gradual shift of the Court to conservative ideology. Highlights the antagonisms between liberals and the new conservative majority showing how Scalia, Kennedy, Souter and now Thomas have fundamentally altered the Court's philosophy. Major reversals and decisions are covered ranging from abortion and civil rights to the right to die and criminal rights. The future direction of the Court is also discussed.",
        "Category": " Law , Constitutional",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The Unabridged Uncensored Unbelievable Garfield",
        "Authors": "By Davis, Jim",
        "Description": "Cartoons featuring Garfield the cat offer a numorous look at cat nightmares, dogs, mice, and cat owners",
        "Category": " Humor , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "No-Load Stocks: How to Buy Your First Share & Every Share Directly from the Company--With No Broker's Fee",
        "Authors": "By Carlson, Charles B.",
        "Description": "Now you can become a player in no-load stocks with expert advice from the man who coined the term.In this brand-new edition of No-Load Stocks, Carlson offers the cutting-edge techniques and up-to-date stock ratings you need to succeed. You'll find an expanded directory of over 145 companies (nearly triple the number of the previous edition) who offer no-load stock plans - with detailed profiles, stock performance, ratings, plan specifics, contact information, and author's commentary; companies to watch for new no-load stock offerings; information sources for new (and generally unadvertised) no-load stock plans; current no-load profit-building techniques such as automatic investing and dollar-cost averaging; an eye-opening comparison of no-load stocks and no-load mutual funds; up-to-date \"starter\" portfolios for every pocketbook; and strategies to help you incorporate no-load stocks into your investment program.",
        "Category": " Business & Economics , Investments & Securities",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Fighting Disease: The Complete Guide to Natural Immune Power",
        "Authors": "By Michaud, Ellen and Feinstein, Alice",
        "Description": "Provides advice on strengthening one's own immune system, promoting faster healing, and preventing diseases through nutritional aids",
        "Category": " Health & Fitness , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "The Last Ten Pounds: The Diet to Finally Lose Them!",
        "Authors": "By Konner, Linda",
        "Description": "The former editor-in-chief of Weight Watchers Magazine presents solutions to the most common weight loss obstacles, new medically approved diets, realistic menus, food lists, and exercise programs for those frustrated with the dieting rollercoaster.",
        "Category": " Medical , General",
        "Publisher": "Longmeadow Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Angus Wilson: A Biography",
        "Authors": "By Drabble, Margaret.",
        "Description": "Angus Wilson (1913-1991) led one of the most remarkable and, until now, uncharted lives in the annals of twentieth-century literature. Here in this long-awaited biography, acclaimed novelist Margaret Drabble portrays Angus Wilson as one of the most brilliant writers of his time, on a par with such literary greats as Graham Greene, Kingsley Amis, and John Osborne. In this first full biography, Drabble traces Wilson's meteoric career as novelist, critic, lecturer, and man of letters.At first an assistant cataloguer at the British Museum, Wilson burst onto the literary scene like a blazing comet in 1949 with a collection of short stories called The Wrong Set. This stunning debut was followed by such memorable books as Hemlock and After, The Middle Age of Mrs. Eliot, The Old Men at the Zoo, and his most enduring and famous novel, Anglo-Saxon Attitudes.At once painfully insecure and highly narcissistic, Wilson both captivated and repelled many of the great literary figures of twentieth-century England, inspiring Rebecca West to exclaim nastily that Wilson reminded her of Jane Eyre. Yet Angus Wilson also served as a great influence for many of today's writers including Martin Amis, Jonathan Raban, V S. Pritchett, and Margaret Drabble herself. His satiric, often grotesque, but in the end sympathetic portrayal of his female characters also endeared him to millions of female readers.What makes Wilson particularly extraordinary to a new generation of readers is his decision to live life, even as early as the 1940s, as an open homosexual through his lifelong relationship with Tony Garrett and his public opposition to discriminatory homosexual laws. Above all, Angus Wilson is the portrait of an artist of enormous courage, a man who confronted challenge to the end.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Life Is Too Short",
        "Authors": "By Rooney, Mickey",
        "Description": "The legendary actor chronicles his years as a child star, his turbulent private life, the ups and downs of his acting career, and his relationships with Judy Garland, Clark Gable, and others",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Villard Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Sanyo Microwave Cooking",
        "Authors": "By Edited By Polshek, Ellyn",
        "Description": "",
        "Category": "",
        "Publisher": "The Benjamin Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    }
]