[
    {
        "Title": "Perfect Preserves: Easy Recipes for Delicious Jams, Jellies, Pickles, and Relishes",
        "Authors": "By King, M. Dalton",
        "Description": "For readers wanting to rediscover the traditional art of canning and preserving at home, this volume provides an overview of all of the methods and includes such tasty recipes as Spiced Peaches, Italian Stewed Tomatoes, and Raspberry Cobbler Jam.",
        "Category": " Cooking , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Outdoor Living With Style",
        "Authors": "By Plante, Ellen M.",
        "Description": "Whether you're building from scratch or remodeling an existing porch or backyard deck, transitional places between indoors and out can provide the means to live large, even in the most modest space. The high-rise apartment balcony or free-standing garden gazebo can be every bit as lovely, functional, and enjoyable as an old-fashioned veranda or classic brick patio. All it takes is careful planning to meet your needs and an eye toward comfortable, inviting, and attractive design. This volume will show you how to make the most of your outdoor spaces.",
        "Category": " House & Home , Decorating",
        "Publisher": "Friedman/Fairfax Pub",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Sextet: T.S. Eliot & Truman Capote & others",
        "Authors": "By Brinnin, John Malcolm",
        "Description": "",
        "Category": "",
        "Publisher": "Delacorte Press/Seymour Lawrence",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Shared Destiny: Fifty Years of Soviet-American Relations",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Beacon Press,U.S.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Natural Crafts from America's Backyards: Decorate Your Home With Wreaths, Arrangements, and Wall Decorations Gathered from Nature's Harvest",
        "Authors": "By Platt, Ellen Spector",
        "Description": "Ellen Spector Platt traveled across the country gathering many of the natural materials used in the projects in this book. She also grew her own materials and enlisted friends and relatives to send the bounty from their own backyards and travels. Her goal was to create projects that represent the diverse regions of the country. The result is a book filled with over 80 projects, beautifully photographed, that anyone, anywhere can make.",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Songs of Innocence and Experience: Essays in Celebration of the Ordinary",
        "Authors": "By De Vinck, Christopher",
        "Description": "Christopher de Vinck's first collection of essays, Only the Heart Knows How to Find Them, was praised by the likes of Jim Trelease, Madeleine L'Engle, and Wendell Berry. Library Journal said, \"De Vinck has the knack of taking the ordinary occurrences of life and showing how they reveal what is really important.\"In his new collection of essays, de Vinck reflects simply and evocatively on the joys of parenthood and family, the challenges of combining them with a career, on ordinary times and quiet moments, and on the stresses of loneliness, sickness, old age and death.Taken as a whole, these essays exalt and harmonize the child and the adult in all of us. Songs of Innocence and Experience is an infectious, inspiring work, one that will be treasured for years to come.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Viking",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "On the Wings of Eros: Nightly Readings for Passion and Romance",
        "Authors": "By Alvrez, Alicia (EDT)",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Conari Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "On Kissing: Travels in an Intimate Landscape",
        "Authors": "By Blue, Adrianne",
        "Description": "A kiss can be an expression of parental affection or the focus of an erotic experience, a defensive social maneuver or an admission of vulnerability. In legend, a kiss can turn an ugly witch into a great beauty; in Hollywood, a kiss can transform a great beauty into a legend. Few gestures bring so much pleasure or play such an important role in our lives, as Adrianne Blue demonstrates in this funny, sexy, and eye-opening book.She explores every dimension of kissing, from the purely physical to the artfully abstract. Physiologically, it takes only two muscles to purse the lips, but a passionate kiss can involve all thirty-four facial muscles, and the rest of the body as well. Psychologically, kissing develops an infant's need to suckle, and it picks up a great deal of symbolic emotional baggage throughout our lives. Socially, it all depends on context: in Provence, three kisses are expected as a friendly greeting; in Japan, even a single peck can be a grave affront.One of Edison's first films was devoted to the kiss, and Blue offers her candidates for the silver screen's hottest kisses, reflecting along the way on the changing ideals of the sexy mouth, from Garbo's delicate thin line to Julia Roberts's fulsome fleshiness. She describes the kiss in other visual arts as well, such as the famous sculptures of Rodin and Brancusi, and she gathers a richly varied collection of poems, from those by Catullus (\"the Elvis of ancient Rome\") to the Song of Songs, assembled here for lovers to share as they explore the many dimensions of kissing.",
        "Category": " Psychology , General",
        "Publisher": "Kodansha Amer Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Preparing Web Graphics",
        "Authors": "By Weinman, Lynda",
        "Description": "A detailed guide to creating graphics for web delivery shares tips and techniques for fast and high-quality web graphics, and covers such topics as cross-platform issues, compression methods, and transparent GIFs. Original. (Intermediate).",
        "Category": " Computers , Computer Graphics",
        "Publisher": "New Riders Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Particles and Luck",
        "Authors": "By Jones, Louis B.",
        "Description": "Particles and Luck is the story of one night, two men, and an invisible third force that has brought these two men together. Mark Perdue and Roger Hoberman have nothing in common - except the joy of adjoining yards. Mark is a whiz-kid physicist who knows that the \"genius\" stature and the endowed chair at Berkeley that have been accorded him are bits of dumb luck; Roger is the owner of a pizza franchise whose luck has turned dumb - in financial and marital distress, he has been denied child visitation rights but not babysitting obligations.Roger and Mark have just been notified of a claim of adverse possession on their property, effective the next day. Particles and Luck is the story of the Halloween night they spend together, trying to imagine how this threat will materialize. Camped out amidst pieces of Roger's Naugahyde furniture, warmed by a pile of Kingsford briquettes, fortified by some frozen peas and meat that has not quite thawed, marking boundary lines with Oakland Raiders pennants - this will be a night unlike any other in contemporary fiction.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Prince Caspian: The Return to Narnia (The Chronicles of Narnia, Book 4)",
        "Authors": "By Lewis, C. S. and Baynes, Pauline (ILT)",
        "Description": "A beautiful paperback edition of C. S. Lewis&#39;s Prince Caspian, book four in the classic fantasy series, The Chronicles of Narnia, featuring cover art from three time Caldecott Medal-winning illustrator David Wiesner and interior black-and-white artwork by the original illustrator, Pauline Baynes.The Pevensie siblings travel back to Narnia to help a prince denied his rightful throne as he gathers an army in a desperate attempt to rid his land of a false king. But in the end, it is a battle of honor between two men alone that will decide the fate of an entire world.Prince Caspian is the fourth book in C. S. Lewis&#39;s classic fantasy series, which has been drawing readers of all ages into a magical land with unforgettable characters for over sixty years. This is a stand-alone novel, but if you would like to read about more Narnian adventures, pick up The Voyage of the Dawn Treader, the fifth book in The Chronicles of Narnia.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "PCs for Dummies (4th Edition)",
        "Authors": "By Gookin, Dan and Rathbone, Andy",
        "Description": "Covers setup, disks and disk drives, monitors, printers, peripheral equipment, and common mistakes",
        "Category": " Computers , Hardware , Personal Computers , PCs",
        "Publisher": "Hungry Minds Inc",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Solutions in C: Hundreds of Programming Tips by the Author of \"Doctor C's Pointers\"",
        "Authors": "By Jaeschke, Rex",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "Saving Money Any Way You Can: How to Become a Frugal Family",
        "Authors": "By Yorkey, Mike",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Vine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Case of the Felon's Fiddle: A McGurk Mystery",
        "Authors": "By Hildick, E. W. and Weil, Lisl (ILT)",
        "Description": "McGurk and his Organization tackle a case featuring a villainous violinist that leads to a suspenseful hunt for a treasure of uncut gems",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "The Written world: Reading and writing in social contexts",
        "Authors": "By Miller, Susan",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Terrible Hours: The Greatest Submarine Rescue in History",
        "Authors": "By Maas, Peter",
        "Description": "On the eve of World War II, the Squalus, America's newest submarine, plunged into the North Atlantic.  Miraculously, thirty-three crew members still survived.  While their loved ones waited in unbearable tension on shore, their ultimate fate would depend upon one man, U.S. Navy officer Charles \"Swede\" Momsen -- an extraordinary combination of visionary, scientist, and man of action.  In this thrilling true narrative, prize-winning author Peter Maas brings us in the vivid detail a moment-by-moment account of the disaster and the man at its center.  Could he actually pluck those men from a watery grave?  Or had all his pioneering work been in vain?",
        "Category": " History , Military , Naval",
        "Publisher": "Perennial",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The Age-Free Zone (The Zone)",
        "Authors": "By Sears, Barry",
        "Description": "Enter The Age-Free Zone... You have the power to reverse aging -- beginning with your next meal!  Ask yourself these life-changing questions:  Is it too late to reverse aging?  What type of diet will increase my sexual energy and desire?  Can I make my hormones work more effectively?  Do high-carbohydrate diets accelerate aging?  How can I reduce free-radical-induced aging?  How does stress reduce brain longevity?  No one wants to get old or show the signs of age. In this breakthrough book Dr. Barry Sears goes beyond looking at food simply as a source of calories and explains the incredibly powerful biological effects it has on your hormones. In addition to unravelling the mysteries of your hormones and their role in aging, Dr. Sears reveals the essential dietary information you need to start your own age-reversal journey. Begin your age-free lifestyle today! The Age-Free Zone includes:  A week of Age-Free Zone meals for men and women  Age-Free Zone meals for the business traveller  Age-Free Zone meals in fast-food restaurants  A simple, at-home Age-Free Zone exercise program",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Chameleon Wore Chartreuse: A Chet Gecko Mystery",
        "Authors": "By Hale, Bruce",
        "Description": "Chet Gecko loves a good mystery. Almost more than he loves his fee--stinkbug pie.So when fellow fourth grader Shirley Chameleon asks him to find her missing brother, Billy, Chet expects the case to be as easy a pie. But Billy's disappearance is part of a larger plot, one that involves the Rat Sisters, a riddling junkyard dog, and a vicious Gila monster named Herman. If Chet doesn't solve the case fast, the entire school could be humiliated. Worst of all, Chet might not get his fee. And Chet's hungry. . . .",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Patron Saint of Unmarried Women",
        "Authors": "By Ackerman, Karl",
        "Description": "Jack Townsend and Nina Lawrence were a couple for three years, four months, and ten days (according to Nina's mother, Marie, who has kept count while faithfully attending confession and observing saint's days). They nearly made it to the altar, but Nina got cold feet. Now Jack landscapes rich people's gardens in Washington, D.C., and plays hoops with his buddies, while Nina paints and fends off the ministrations of her large family.At loose ends, Jack meets another woman, only to find that Nina, too, is being wooed, by a man Jack knows - a lawyer, of all things, with a BMW and a jump shot that clangs like a doomsday gong. While Marie prays to Saint Anne - her patron saint of unmarried women - Jack and Nina seem to go their separate ways.How Jack tries to rekindle the interest of his old flame forms the engaging plot of this novel, which offers a touch of romance while making good fun of the whole enterprise.",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Gypsy in My Soul: The Autobiography of Jose Greco",
        "Authors": "By Greco, Jose and Ardman, H.",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "The world is my eggshell",
        "Authors": "By Mulford, Philippa Greene",
        "Description": "After their father dies and they move to another town, sixteen-year-old twins learn to adapt to change and to form individual identities.Moving to a new town after the death of her father, Abbey Reilly hopes to come into her own and to no longer compete with her cocky twin brother, since they will be attending different schools",
        "Category": "",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "They asked for death",
        "Authors": "By Houts, Marshall",
        "Description": "",
        "Category": "",
        "Publisher": "Cowles",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The Jericho Iteration",
        "Authors": "By Steele, Allen M.",
        "Description": "The author of Clark County, Space,  weaves a powerful story of a corrupt corporation planning to release a deadly artificial life form on St. Louis in 2012 and the reporter trying to live long enough to prevent it.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace Hardcover",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Management Game",
        "Authors": "By Schlesinger, Leonard A., Burst, Ardis",
        "Description": "A participatory book that puts the reader in charge at a major corporation tests managerial skills, decision-making, product initiation, problem solving, and more and offers an in-depth analysis of chosen solutions and a gauge for calculating managerial aptitude",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Privilege of His Company: Noel Coward Remembered",
        "Authors": "By Marchant, William.",
        "Description": "",
        "Category": " Performing Arts , General",
        "Publisher": "Bobbs-Merrill",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "April",
            "Year": "1975"
        }
    },
    {
        "Title": "The Myth of Free Trade: A Plan for America's Economic Revival",
        "Authors": "By Batra, Ravi",
        "Description": "Dr. Ravi Batra, whose book The Great Depression of 1990 was on the New York Times bestseller list for fifty-two weeks, now boldly challenges the myth of free trade. The startling evidence he sets forth shows that the United States is on the edge of economic disaster.Although mainstream economists - and highly paid corporate executives - trumpet \"free trade\" as America's best possible source of prosperity, Dr. Batra insists the policy may have damaged our economy as severely as the Great Depression. Almost every economic problem we face - the outrageous federal deficit; rising unemployment; the shrinking middle class; the \"merger mania\" that slashed jobs, killed competitiveness, and increased corporate debt; and environmental degradation - can be linked to the free trade policy that the United States has been following over the last twenty years.Batra sets forth a compelling plan for \"competitive protectionism\" and prescribes a radical but well-reasoned five-year plan for economic revival:average tariffs on imports should be raised from 5 percent to 40 percentban mergers among giant firmsIBM, General Motors, and other Fortune 500 firms should be split into smaller, more competitive units, along the lines of the AT&T divestiture in 1982; no single company should be allowed more than 10 percent of the domestic marketencourage foreign investment in the United States in new ventures; don't permit investors to simply buy existing concernsthe U.S. government should take an active role in subsidizing private R&D spending with money from increased tariff revenue and from drastically reduced defense spendingIn his stunning conclusion, Batra makes a clear and convincing argument that \"competitive protectionism would increase tax revenues, resurrect the manufacturing base, raise real earnings for 80 percent of the work force, trim inequality, reduce the rate of poverty, enhance the growth of productivity, cripple the abuse of monopoly power by big business, revitalize the economy, and, above all, restore America's economic leadership in the world.\"",
        "Category": " Business & Economics , Organizational Behavior",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "The Physics of everyday phenomena: Readings from Scientific American",
        "Authors": "By Walker, Jearl",
        "Description": "The cause and effect of common natural phenomena--often taken for granted--are explored, including the formation of snowflakes and raindrops, ocean waves, fog, and thunder",
        "Category": "",
        "Publisher": "W. H. Freeman",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Lucky Gourd Shop",
        "Authors": "By Scott, Joanna C.",
        "Description": "When an American mother's three adopted children reach their teens, they grow curious about their Korean heritage. A much-anticipated letter from Korea fails to satisfy them but sparks memories in the eldest. So begins the heartbreaking and inspiring tale of their birth mother's life as their adoptive mother imagines it.  Abandoned as a baby and then again and again, Mi Sook is raised in a Korean coffee shop by its string of owner-mothers. She grows to adulthood fiercely independent and eventually comes to manage the shop. But her marriage to Kun Soo, with whom she has three children, begins a series of events that ultimately wrench her babies from her arms. Deceived by Kun Soo and his well-intentioned mother, and unsupported by a rigidly Confucian culture, Mi Sook emerges as a tragic and heroic figure who embodies the rich complexities of a nation -- and of the heart.",
        "Category": " Fiction , Literary",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "The Constitutional Foundations of World Peace (Suny Series in Global Conflict and Peace Education) (SUNY series, Global Conflict and Peace Education)",
        "Authors": "By Falk, Richard A., Kim, Samuel S. (EDT), and Johansen, Robert C.",
        "Description": "",
        "Category": " Political Science , Peace",
        "Publisher": "State University of New York Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "The Encyclopedia of American Scandal",
        "Authors": "By Kohn, George C.",
        "Description": "Some 350 entries, arranged alphabetically, profile people and chronicle events considered scandalous at one time or another. The book's purpose is to be informational as well as entertaining. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , General",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "This Business of Music, Fifth Edition",
        "Authors": "By Shemel, Sidney, Krasilovsky, M.William",
        "Description": "Provides information on copyright laws and the legal problems faced by music industry publishers, writers, record companies, producers, artists, and agents",
        "Category": "",
        "Publisher": "Billboard Books",
        "Price Starting With ($)": "10.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Supreme Court in the federal judicial system (The Nelson-Hall series in political science)",
        "Authors": "By Wasby, Stephen L.",
        "Description": "",
        "Category": "",
        "Publisher": "Nelson-Hall",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Charlie Osburn Story: You Gotta Give It All to Jesus",
        "Authors": "By Lilly, Fred and Osburn, Charlie",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Servant Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The TeddyBear Lovers Catalog",
        "Authors": "By Menten, Theodore",
        "Description": "",
        "Category": "",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The epicure's book of steak and beef dishes",
        "Authors": "By Patten, Marguerite",
        "Description": "",
        "Category": "",
        "Publisher": "The Knapp Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Macintosh Bible: Thousands of Basic and Advanced Tips, Tricks, and Shortcuts, Logically Orgainized and Fully Indexed",
        "Authors": "By Aker, Sharon Zardetto (EDT) and Naiman, Arthur (EDT)",
        "Description": "Covers Macintosh hardware, memory, printing, software, fonts, utilities, troubleshooting, word processing, databases, spreadsheets, graphics, page layout, and programming",
        "Category": " Computers , General",
        "Publisher": "Goldstein & Blair",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "The Winn L. Rosch Hardware Bible",
        "Authors": "By Rosch, Winn L.",
        "Description": "An indispensable reference includes the latest developments in Pentium chips, portables and laptops, easy instructions for PC expansion and troubleshooting, and inside information to help readers purchase and customize the best system for their needs. Original. (Beginner).",
        "Category": " Computers , Hardware , Personal Computers , General",
        "Publisher": "Brady",
        "Price Starting With ($)": "9.36",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The Complete Book of Confederate Trivia",
        "Authors": "By Lang, J. Stephen",
        "Description": "",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Burd Street Press",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Telling It Like It Is: Reflections of a Not So Radical Feminist",
        "Authors": "By Clift, Elayne",
        "Description": "",
        "Category": "",
        "Publisher": "Knowledge Ideas & Trends",
        "Price Starting With ($)": "5.97",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Trouble in History (White Pine Press Poetry Prize)",
        "Authors": "By Keller, David",
        "Description": "Winner of the Fifth Annual White Pine Press Poetry Prize.",
        "Category": " Poetry , American , General",
        "Publisher": "White Pine Press",
        "Price Starting With ($)": "5.73",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Sesame Street Pet Show: Featuring Jim Henson's Sesame Street Muppets",
        "Authors": "By Kingsley, Emily P. and Chartier, Normand",
        "Description": "",
        "Category": "",
        "Publisher": "Western Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Ultimate Adventure Sourcebook",
        "Authors": "By McMenamin, Paul",
        "Description": "Discusses mountaineering, boating, exploring, and other choices, and describes services in each area",
        "Category": " Sports & Recreation , Mountaineering",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "7.65",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Mortal Sin:  A Novel",
        "Authors": "By Levine, Paul",
        "Description": "Miami lawyer Jake Lassiter uncovers a scheme to ruin the Everglades and begins to suspect that an environmentalist's death in a client's wine cellar was no accident. By the author of Night Vision. 35,000 first printing. Author tour.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Mokey's Birthday Present (A Fraggle Rock Book Starring Jim Henson's Muppets)",
        "Authors": "By Weiss, Ellen",
        "Description": "",
        "Category": "",
        "Publisher": "HOLT, RINEHART AND WINSTON",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Geography of Desire",
        "Authors": "By Boswell, Robert",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Turning People on: How to Be an Encouraging Person",
        "Authors": "By Losoncy, Lewis E.",
        "Description": "Parents, leaders, supervisors, friends, and others are tendered advice in encouraging the people around them in situations ranging from job dissatisfaction to loneliness",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "The Portable Bernard Shaw (Viking Portable Library)",
        "Authors": "By Shaw, Bernard",
        "Description": "The complete texts of The Devil's Disciple, Pygmalion, In the Beginning, Heartbreak House, and Shakes Versus Shav are combined with letters, articles, reviews, and other writings representing the spectrum of Shaw's career",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1977"
        }
    },
    {
        "Title": "The Forever King",
        "Authors": "By Murphy, Warren and Cochran, Molly",
        "Description": "Determined to possess the Holy Grail, Saladin, a dark sorcerer, kidnaps ten-year-old Arthur Pendragon, who possesses the Grail, and it is up to Hal, a former FBI agent, to rescue the young king and save Camelot. By the authors of Grandmaster.  75,000 first printing. $50,000 ad/promo.",
        "Category": " Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Pobby and Dingan",
        "Authors": "By Rice, Ben",
        "Description": "Pobby and Dingan live in Lightning Ridge, New South Wales, the opal capital of Australia. They are friends with Kellyanne Williamson, the daughter of an opal miner, but only Kellyanne can see them. Pobby and Dingan are imaginary.Ashmol Williamson, Kellyanne's brother, thinks his sister should grow up and stop being such a fruit loop. Until the day, that is, when Pobby and Dingan disappear--the same day that Ashmol and Kellyanne's father is accused of \"ratting\" (poaching on someone else's land), the worst sin an opal miner can commit.As Kellyanne--grief-stricken and suddenly, mysteriously, ill--begins to fade away, Ashmol recruits the whole town in a search for Pobby and Dingan. In the end, however, he discovers that only he can find them, and that he can only find them if he too believes they are real.Funny, deeply moving and told without a wasted word, Pobby and Dingan--the debut of a prodigiously gifted new writer--is an enchanting story.",
        "Category": " Fiction , Literary",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Last Little Citadel: American High Schools Since 1940 (Study of High Schools)",
        "Authors": "By Hampel, Robert L.",
        "Description": "Describes the sweeping transformation of secondary school education that has occurred over the past forty-five years, an essential background for understanding the high school today",
        "Category": " Education , General",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Murder in the Mist",
        "Authors": "By Scott, Willard and Crider, Bill",
        "Description": "After twenty years as the weatherman for the popular morning show, Hello, World, Stanley Waters still likes to go before the cameras - especially if it helps advertise Blue Skies, the charming bed-and-breakfast he now runs in his Virginia hometown. He gets his wish when a Civil War reenactment brings the Hello, World gang down to Higgins to tape Stanley marching off to war in Confederate gray. But the mock battle could be his last stand when a well-aimed minie ball emerges from the mist to knock Stanley unconscious and kill local businessman Rance Wofford. Which man was the target? No one knows.The idea that someone might want to kill him shakes Stanley to his core. He concedes that the host of Hello, World often stabbed him in the back in front of millions of viewers, but would he actually stoop to murder? Stanley doesn't intend to be a sitting duck for another try. But Higgins police chief Marilyn Tunney, Stanley's high school sweetheart and new flame, warns him to leave the investigating to Brad Bridger - her young, very handsome detective.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "How to Murder the Man of Your Dreams",
        "Authors": "By Cannell, Dorothy",
        "Description": "For stay-at-home mum Ellie Haskell, life grows ever more hectic. But once she's made peace between lovelorn Gerta, her twins' new Swiss nanny, and Mrs. Malloy, her caustic daily help, everything else should fall tidily into place. Time enough for Ellie to slim down, pick up the threads of her design career, and kick the romance-reading habit that keeps her from her marital boudoir till dawn.Yet Ellie's hopes for a settled existence are dashed when, arriving for the Chitterton Fells Library League meeting, she stumbles upon a corpse among the fiction stacks: Miss Bunch, who ruled the library with a rod of iron, lies sprawled next to an open copy of The Dream Lover. Shockingly, the librarian's demise exactly coincides with the hundredth anniversary of the death of Mr. Hector Rigglesworth, the Chitterton Fells Library ghost, a man with a deep grudge against the romantic novels that kept his seven daughters endlessly holding out for the perfect suitor.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Herbs for All Seasons",
        "Authors": "By HEMPHILL, Rosemary",
        "Description": "Provides seasonal recipes for soups, salads, vegetable dishes, meat, poultry, fish, seafood, and teas that feature herbs",
        "Category": " Gardening , Herbs",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The Use of Fire",
        "Authors": "By Price, Reynolds",
        "Description": "A new collection of poetry from the author of \"Kate Vaiden\" and \"The Laws of Ice\" probes the creative, procreative temperament of fire, in a life-enhancing poetic vision",
        "Category": " Poetry , General",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Decorating with Needlepoint",
        "Authors": "By Scobey, Joan",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corp",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Christmas in New England",
        "Authors": "By Anonymous",
        "Description": "",
        "Category": "",
        "Publisher": "World Book Encyclopedia",
        "Price Starting With ($)": "8.32",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Easy Beauty With Annuals (Time-life Complete Gardener)",
        "Authors": "By Time-Life Books and Cave, Janet",
        "Description": "A guide to annuals presents tips for choosing, planting, and growing flowers, and answers common questions",
        "Category": " Gardening , Regional , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "50 Ways to Ease Foot Pain",
        "Authors": "By Consumer Guide",
        "Description": "",
        "Category": "",
        "Publisher": "Pubns Intl Ltd",
        "Price Starting With ($)": "6.1",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Why Do We Laugh? (Why Books)",
        "Authors": "By Decaire, Camela (EDT), Martin, Terry (EDT), and Bingham, Caroline (EDT)",
        "Description": "Presents information, in question-and-answer format, about what happens to the body when we laugh",
        "Category": " Juvenile Nonfiction , Social Science , Psychology",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "The Clerihews of Paul Horgan",
        "Authors": "By Horgan, Paul",
        "Description": "Gathers brief, humorous poems about Marie Antoinette, Flaubert, Fitzgerald, Thoreau, Woolf, Sand, Dreiser, James, Browning, Stein, Bach, Poe, Liszt, Brahms, and Freud",
        "Category": " Poetry , General",
        "Publisher": "Wesleyan University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "Women for All Seasons: The Story of the Women's International League for Peace and Freedom",
        "Authors": "By Foster, Catherine",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "University of Georgia Press",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "World Out of Balance: Our Polluted Planet",
        "Authors": "By Erickson, Jon",
        "Description": "Shows how fragile the balance of nature has become, and discusses what needs to be done to reverse the destruction",
        "Category": " Social Science , General",
        "Publisher": "Tab Books",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Dave Barry's Book of Bad Songs",
        "Authors": "By Barry, Dave",
        "Description": "Encompassing such categories as \"songs people always get wrong,\" \"teen death songs,\" \"songs women hate,\" and \"weenie music,\" this musical commentary by the author of Dave Barry Turns 40 offers an amusing look at the \"world's worst lyrics\" and, in general, bad songs. 75,000 first printing.",
        "Category": " Music , Reference",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Healing Power of Foods Cookbook",
        "Authors": "By Murray, Michael T.",
        "Description": "Gathers healthful recipes for soups, salads, breads, vegetables, rice, vegetarian main dishes, pizza, pasta, and desserts",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "How Macs Work (How It Works)",
        "Authors": "By Rizzo, John and Clark, K. Daniel",
        "Description": "A fact-filled tour of the world of the Macintosh reveals its inner workings and user-friendly applications including an exploration of the closely guarded Mac ROM chip, in a presentation by two noted MacUser magazine contributors. (Beginner).",
        "Category": " Computers , General",
        "Publisher": "Pearson Indiana",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "A Marriage Without Regrets",
        "Authors": "By Arthur, Kay",
        "Description": "Using the bible has a starting place, this handbook for a healthy marriage offers advice on communication, feeling secure, parenting, divorce, and remarriage, all following the Christian model.",
        "Category": " Religion , Reference",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Home (Chic Simple)",
        "Authors": "By Robledo, Maria (PHT) and Iovine, Julie V.",
        "Description": "An illustrated primer for stylish living--filled with insights by top designers--shows readers how to demystify, simplify, and refine their homes, showing them how to mix the expensive with the inexpensive in economical ways. 50,000 first printing.",
        "Category": " House & Home , Decorating",
        "Publisher": "Knopf",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Romantic Weekend Getaways: The Mid-Atlantic States",
        "Authors": "By Fox, Larry and Radin-Fox, Barbara",
        "Description": "Revised guide to the most romantic sights, tastes, adventures and places to stay in Maryland, Delaware, Virginia, the District of Columbia, portions of North Carolina, Pennsylvania and New Jersey. Focuses on weekend trips for couples centered around specific themes: art and antiques, wine country, the Chesapeake Bay and the Atlantic Shore, sports, big cities, grand resorts, mountain escapes and more. Updated to include listings of new inns, restaurants and special activities in the region.",
        "Category": " Travel , Food, Lodging & Transportation , Bed & Breakfast",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Professor of Desire",
        "Authors": "By Roth, Philip",
        "Description": "A chronicle of the passion and desire of David Kepesh and of his endeavors, from adolescent accession to middle-aged ebb, to realize and sustain, with dignity, erotic happiness and domestic security",
        "Category": " Fiction , General",
        "Publisher": "Farrar Straus & Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1977"
        }
    },
    {
        "Title": "The Practical Encyclopedia of Feng Shui",
        "Authors": "By Gill Hale",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Sound and Fury: The Washington Punditocracy and the Collapse of American Politics",
        "Authors": "By Alterman, Eric",
        "Description": "Never in our history has the American political system seemed so aimless, so irrelevant, and so downright disgraceful as it does today. Television has become dominant to the point that it now not only serves as the sole viable medium for the debate of issues but has also provided the fodder for political platforms, and even budding presidential candidates. \"Objective\" reporting in the print media is political double-speak, but, even more important, it deprives us of the context that would allow us to make an informed judgment about a given issue. What we are left with, simply, is the punditocracy: the highly visible, extremely well-paid, and seemingly omnipresent pontificators who make their living offering \"inside political opinions and forecasts\" in the elite national media. It is their debate, rather than any semblance of a democratic one, that determines the parameters of political discourse in the nation today.In his shrewd, provocative, and entertaining Sound and Fury, journalist and historian Eric Alterman takes the first comprehensive survey of the world of political pundits - their history, their influence, their style and substance. How have the George Wills, the John McLaughlins, the Robert Novaks, the William Safires, the Pat Buchanans, and all the op-ed and opinion makers whom we have come to regard as authoritative voices on the subject of government actually achieved their authority? How do they deploy their power? Who really listens to them, and what does their ascendancy mean for our political future?Sound and Fury opens with a historical overview of punditry, focusing on the greatest of all pundits, Walter Lippmann, avatar of punditry's Golden Age and as close to a philosopher as the popular media has ever produced. Tracing Lippmann's heirs, Alterman presents a series of portraits of the leading pundits of the Reagan/Bush years, a period when the profession came into its own - no more notably than in the person of the jaunty courtier George Will, and no more potently than around the bullyboy roundtables, the weekly pundit sitcoms, led by the likes of punditry's P. T. Barnum, former Watergate priest John McLaughlin. The book closes with an examination of the punditocracy at work in the Bush era, and how it successfully - and dangerously - defined the shape of the United States' response to Mikhail Gorbachev, the end of the Cold War, and that ne plus ultra of pundit adventurism, Operation Desert Storm.One of the most original and witty treatments of American politics in decades, Sound and Fury is a searching look at the diseased American body politic and its blithely hubristic talking heads.",
        "Category": " Social Science , Media Studies",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Don't Forget!: Easy Exercises for a Better Memory at Any Age",
        "Authors": "By Lapp, Danielle C.",
        "Description": "Explains how the human memory works, tells how to improve one's concentration, and discusses association techniques, visualization, and techniques for remembering names and numbers",
        "Category": " Psychology , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Next Time I Fall in Love",
        "Authors": "By Clark, Chap",
        "Description": "Explores the concepts of friendship and love from a Christian viewpoint and prescribes ways to have more fulfulling dating relationships.",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Mary Ellen's Help Yourself Diet Plan: The One That Worked for Me!",
        "Authors": "By Pinkham, Mary Ellen",
        "Description": "A guide to losing weight a personal account of the author's struggle with obesity, an eight-step weight-loss program that includes diet plans and exercises and a section of food tips and anecdotes",
        "Category": " Health & Fitness , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1982"
        }
    },
    {
        "Title": "The Most Dangerous Man in America: Scenes from the Life of Benjamin Franklin",
        "Authors": "By Bowen, Catherine Drinker",
        "Description": "Franklin's character, genius, and interests are highlighted in a study of his myriad activities and pursuits",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Madeleine's Ghost",
        "Authors": "By Girardi, Robert",
        "Description": "Ned Conti is a young historian struggling to piece together the miraculous past of a Brooklyn nun for a tiny stipend, while, at night, he grapples with the paranormal phenomena that have recently seized his rent-controlled apartment: furniture set askew, strange light haunting the bedroom, rocks appearing mysteriously in midair to pummel the floor. His only refuge is the F train and its connection to long Manhattan nights in East Village bars that he visits with his forlorn and eccentric friends.As the summer grows hotter and his apartment more threatening, a baffled but tolerant Ned sets out to uncover the secret behind the angry spirit and, in so doing, is drawn irretrievably into a world of desire and fate ... where all around him lingers the dark dream of New Orleans, a place of magical disaster. Ten years before, he fled the Crescent City, never to return, when Antoinette, his true love, ended their brief but urgent affair. Now he's going back, returning to the past that has haunted him for a decade.",
        "Category": " Fiction , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "The Twilight of World Steam",
        "Authors": "By Ziel, Ron",
        "Description": "Pictures and describes the last steam locomotives in countries throughout the world, and discusses the reasons for their sadly dwindling numbers",
        "Category": " Business & Economics , General",
        "Publisher": "Madison Square Pr",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "November",
            "Year": "1973"
        }
    },
    {
        "Title": "An Instant Guide to Cats (Instant Guides)",
        "Authors": "By Bell, Chris and Burn, David",
        "Description": "Compact, handy, accessible guide that assumes no previous knowledge of  the subject, and provides a simple system of color-coded bands and symbols to the various sections of the book.  Detailed, full-color illustrations throughout, and a concise but informative text make learning about the different breeds of cats much more fun and useful.",
        "Category": " Pets , Cats , Breeds",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "American Patchwork Quilts",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Forbidden Knowledge: The Gap into Vision (The Gap, Book 2)",
        "Authors": "By Donaldson, Stephen R.",
        "Description": "Author of The Chronicles Of Thomas Covenant, one of the most acclaimed fantasy series of all time, master storyteller Stephen R. Donaldson retums with the second book in his long-awaited new science fiction series--a story about dark passions, perilous alliances, and dubious heroism set in a stunningly imagined future.Beautiful, brilliant, and dangerous, Morn Hyland is an ex-police officer for the United Mining Companies--and the target of two ruthless, powerful men.  One is the charismatic ore-pirate Nick Succorso, who sees Morn as booty wrested from his vicious rival, Angus Thermopyle.  thermopyle once made the mistake of underestimating Morn and now he's about to pay the ultimate price.  Both men think they can possess her, but Morn is no one's trophy--and no one's pawn.Meanwhile, withing the borders of Forbidden Space, wait the Amnioin, an alien race capable of horrific atrocities.  The Amnion want something unspeakable from humanity--and they will go to unthinkable lengths to get it.In Forbidden Knowledge, Stephen R. Donaldson spins a galaxy-wide web of intrigue, deception, and betrayal that tightens with inexorable strength around characters and readers alike.",
        "Category": "",
        "Publisher": "Spectra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Think on Death: A Hudson Valley Ziza Todd Mystery",
        "Authors": "By McCullough, David Willis",
        "Description": "Detective Nick Story and amateur sleuth Reverend Ziza Todd investigate when the bodies of Llewelyn Quick and Harry Van Schoonhoven are found in the home of Aunt Nan, a respected elder in the Utopian Smyrna Community, after her death",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Kiplinger's Retire & Thrive",
        "Authors": "By Otterbourg, Robert K. and Mahaney, John (EDT)",
        "Description": "Whether you're approaching traditional retirement age or being forced into an early exit from the workplace, \"retirement\" can be the chance of a lifetime. While you may not be able to afford a work-free lifestyle - and may not even want one - you do want these years to be as active, challenging and creative as possible.",
        "Category": " Business & Economics , Personal Finance , Retirement Planning",
        "Publisher": "Kiplinger Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Burden of Truth: Defending Truth in an Age of Unbelief",
        "Authors": "By Colson, Charles W.",
        "Description": "Value priced! Popular author Charles Colson provides practical help for Christians in understanding difficult issues on which their faith collides with the surrounding culture.Burden of Truth covers topics such as medical ethics, education, crime, science, pop culture, family, art, and government. InBurden of Truth Colson spurs Christians on in confronting the deception of the world with the truth of God's Word.",
        "Category": " Religion , Faith",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "World News & Bible Prophecy",
        "Authors": "By Dyer, Charles H.",
        "Description": "This timely book reveals the truth of Bible prophecy in current events, how the nation of Israel is at the center of our changing world, and what we can expect from God's promises for the future.",
        "Category": " Religion , Biblical Studies , Prophecy",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Threshold: 002",
        "Authors": "By University of Illinois",
        "Description": "",
        "Category": "",
        "Publisher": "Rizzoli Intl Pubns",
        "Price Starting With ($)": "7.28",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Marriage & the Spirituality of Intimacy",
        "Authors": "By Kehrwald, Leif",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Franciscan Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Cruising in Comfort",
        "Authors": "By Skoog, James",
        "Description": "",
        "Category": " Sports & Recreation , General",
        "Publisher": "Olympic Marketing Corp",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "The Way Back",
        "Authors": "By A. Bertram Chandler",
        "Description": "",
        "Category": "",
        "Publisher": "DAW Books",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "New Treasury of Christmas Recipes",
        "Authors": "By Consumer Guide",
        "Description": "",
        "Category": "",
        "Publisher": "Pubns Intl Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "The American Bed and Breakfast Cookbook",
        "Authors": "By Bed Post Writers Group",
        "Description": "Collects recipes for breakfast and brunch foods including buttermilk pancakes, blue cheese quiche, blueberry muffins, and baked ziti",
        "Category": " Cooking , General",
        "Publisher": "East Woods Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Breakthroughs! How the Vision and Drive of Innovators in Sixteen Companies Created Commercial Breakthroughs that Swept the World",
        "Authors": "By Ketteringham, John M. and Nayak, P. Ranganath",
        "Description": "A study of individuals from eighteen companies who made worldwide commercial breakthroughs, with information on the conflicts, concepts, creativity, and climate that let a good idea break every barrier and become a fixture in millions of lives",
        "Category": " Social Science , General",
        "Publisher": "Rawson Assoc",
        "Price Starting With ($)": "6.43",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Priority One: What God Wants",
        "Authors": "By Norman Lewis",
        "Description": "",
        "Category": "",
        "Publisher": "Promise Pub. Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Best Wines!: Gold Medal Winners from the Leading Competitions Worldwide",
        "Authors": "By Bradney, Gail (EDT) and Block, Corliss (EDT)",
        "Description": "",
        "Category": " Cooking , Beverages , Wine & Spirits",
        "Publisher": "Print Project",
        "Price Starting With ($)": "7.58",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Eating Southern Style",
        "Authors": "By Thompson, Terry",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Gothic Revival (Abbeville Stylebooks)",
        "Authors": "By Massey, James C. and Maxwell, Shirley",
        "Description": "A taste for the romantic, fostered by the novels of Sir Walter Scott and a fondness for the medieval past, spurred the revival of Gothic designs during the late eighteenth and early nineteenth centuries. As James Massey and Shirley Maxwell show in this fact-filled sampler, Gothic Revival caught the fancy of many Victorians who sought refuge in supposedly simpler days. Picturesque castles and cathedrals with spiky towers, high gabled roofs, and medieval ornament provided just the escape needed from the rigors of the industrial revolution.Gothic Revival recreates the age of Victoria by chronicling the era and its architecture, furnishings, fashions, art, literature, designers, and key buildings, all in an inviting format that brings back the style's heyday from the 1830s to the 1870s.",
        "Category": " Architecture , Buildings , Residential",
        "Publisher": "Abbeville Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Following Christ the Man of God: A Study of John 6-14",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": "",
        "Publisher": "Insight for Living",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Like Boogie On Tuesday (Sepia)",
        "Authors": "By Grosvenor, Linda Dominique",
        "Description": "A powerful novel follows the lives of four unforgettable characters--Tim, an arrogant filmmaker and notorious womanizer; Nina, a high-powered career woman; Vaughn, a devoted husband and father who decides to act upon his deepest desires; and Troi, Vaughn's wife, whose dreams are shattered by Vaughn's desires--as they learn valuable lessons in life and in love. Reprint. 25,000 first printing.",
        "Category": " Fiction , Literary",
        "Publisher": "Sepia Bet Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Cool Parent's Guide to All of New York: Excursions and Activities in and Around Our City That Your Children Will Love and You Won't Think Are Too Bad Either",
        "Authors": "By Rogan, Helen and Gingold, Alfred",
        "Description": "",
        "Category": " Travel , Special Interest , Family",
        "Publisher": "City & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "A City of Gardens: Glorious Public Gardens In and Around the Nation’s Capital (Washington Weekends)",
        "Authors": "By Seeber, Barbara H.",
        "Description": "Few cities can boast the rich history and diversity of gardens as the Nation’s Capital. City of Gardens provides a guide to 30 public gardens in the Washington area - a look at the traditional and the contemporary; the manicured and the naturalized; the aesthetic and the practical; national treasures and national parks. These gardens range from kitchen garden to historic showplace, from arboretum to downtown pocket garden. This newest guide in Capital’s popular Washington Weekends series offers natives and visitors a rich array of treks through DC’s gardens, with up-close and in-depth looks at the plants, the plans, and the personalities that shape them. It is an insider’s guide to these remarkable spaces, highlighting designs and designers, new cultivars and native species, garden ornament and sculpture, greenhouse and gift shop attractions, garden trivia and historic tidbits. Web sites and directions tell visitors exactly how and why to visit each. Illustrated with spectacular black-and-white photographs, \"City of Gardens\" is a regional travel guide written by a highly knowledgeable garden-lover for all who love plants and gardens, botany and horticulture, and landscape architecture in a city rich in all. Barbara Seeber captures the essence of each individual garden, and her enthusiasm shines through in each chapter, making this is a garden feast - much more than a guide book!",
        "Category": " Gardening , Regional , General",
        "Publisher": "Capital Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    }
]