[
    {
        "Title": "Unix Networking (Hayden Books Unix System Library)",
        "Authors": "By Kochan, Stephen G. (EDT) and Wood, Patrick H. (EDT)",
        "Description": "Programming considerations, system security, and the respective advantages of various networks are discussed in detail as the book presents the major UNIX system architectures. No bibliography. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Computers , Operating Systems , UNIX",
        "Publisher": "Sams",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Pass it on: How to make your own family keepsakes",
        "Authors": "By Brunner, M.",
        "Description": "",
        "Category": "",
        "Publisher": "Sovereign Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Life Sentence",
        "Authors": "By Colson, Charles W.",
        "Description": "",
        "Category": "",
        "Publisher": "Word Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Heirloom Gifts: Handmade Gifts to Pass Down from Generation to Generation",
        "Authors": "By Griffiths, Anna",
        "Description": "Applying such techniques as doll-making, patchwork, papier mache, and decoupage, a handmade craft guide includes thirty-five creative projects, from an embroidered christening gown to a collage memory album, and demonstrates various personalizing suggestions.",
        "Category": "",
        "Publisher": "Crescent Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "At End of Day",
        "Authors": "By Higgins, George V.",
        "Description": "Every state police officer in Boston knows that Arthur McKeach and Nick Cistaro are the most prolific and ruthless practitioners of extortion, fraud, theft, bribery, assault, and murder in the area. What none of them know is how to stop these Michelangelos of crime, who for thirty years have eluded jail-and even arrest. Their secret is at the heart of George Higgins's most searing and shocking dissection of the criminal life yet. At End of Day lays bare not only the inner workings of a criminal empire, but also reveals the corruption at the heart of American law enforcement. Few writers have mapped the intricate highways and byways of crime with equal vividness and elegance, and with At End of Day, Higgins has created a cast of characters to match his unique gifts. McKeach and Cistaro stand shoulder-to-shoulder with any of Eddie Coyle's friends, and their story solidifies George Higgins's place in the forefront of novelists who write about crime in America.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Big Show: Inside ESPN's Sportscenter",
        "Authors": "By Nelson, Bonnie",
        "Description": "The hosts of ESPN's popular show SportsCenter offer a whimsical behind-the-scenes look at the series and the world of modern sports, discussing their choices for the greatest athletes of all time, on-the-air errors, superstar athletes, and each other.",
        "Category": "",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Making of the President, 1972: A Narrative History of American Politics in Action",
        "Authors": "By White, Theodore H.",
        "Description": "Explores the complex interaction of men and events that shaped the 1972 Republican and Democratic presidential campaigns",
        "Category": " Political Science , General",
        "Publisher": "ATHENEUM PUBLISHERS",
        "Price Starting With ($)": "36.61",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Babies and Other Hazards of Sex",
        "Authors": "By Barry, Dave",
        "Description": "In this classic crack-up of a book, Dave Barry gives his wacky perspective on sex, childbirth, parenting and other forms of slow, cruel torture.In Babies and Other Hazards of Sex, Dave exposes natural childbirth for what it is:  a pop phenomenon of the 1960s that, along with paisley bell-bottoms and creative sideburns, deserves a rest. He examines the new federal law requiring prospective fathers to free themselves from their self-made macho prisons--to laugh, cry, love and just generally behave like certified wimps.Dave also reveals, for the first time in print, the secret chant for painless childbirth.Then learn why no secret chant could possibly take a woman's mind off the fact that she is in such pain that she wants a gigantic comet to crash into the earth and kill her and her husband and the dotor and the nurses and everyone else in the world.",
        "Category": " Humor , Topic , Marriage & Family",
        "Publisher": "Rodale",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Overcoming Setbacks",
        "Authors": "By Steve Brown",
        "Description": "",
        "Category": "",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Stones from the River",
        "Authors": "By Hegi, Ursula",
        "Description": "From the acclaimed author of Floating in My Mother’s Palm and Children and Fire, a stunning story about ordinary people living in extraordinary times—“epic, daring, magnificent, the product of a defining and mesmerizing vision” (Los Angeles Times).Trudi Montag is a Zwerg—a dwarf—short, undesirable, different, the voice of anyone who has ever tried to fit in. Eventually she learns that being different is a secret that all humans share—from her mother who flees into madness, to her friend Georg whose parents pretend he’s a girl, to the Jews Trudi harbors in her cellar.  Ursula Hegi brings us a timeless and unforgettable story in Trudi and a small town, weaving together a profound tapestry of emotional power, humanity, and truth.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Sam Walton: Made in America",
        "Authors": "By Walton, Sam and Huey, John",
        "Description": "Meet a genuine American folk hero cut from the homespun cloth of America's heartland: Sam Walton, who parlayed a single dime store in a hardscrabble cotton town into Wal-Mart, the largest retailer in the world. Combine the pluck and luck of Horatio Alger, the wit of Will Rogers, the promotional verve of P. T. Barnum, and the charm of Professor Harold Hill and you'll discover the powerful personality of Sam Walton. An undisputed Captain of Commerce, Sam never lost the common touch--he reveled in it.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Man of the House: The Life and Political Memoirs of Speaker Tip O'Neill",
        "Authors": "By Novak, William and O'Neill, Thomas P., Jr.",
        "Description": "The memoirs of Speaker of the House Tip O'Neill's career sketch his ties with the Kennedys, his break with Lyndon Johnson on Vietnam, the Watergate years, and his dealings with Jimmy Carter and Ronald Reagan",
        "Category": " Political Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "The Seduction of Hillary Rodham",
        "Authors": "By Brock, David",
        "Description": "David Brock, America's most controversial journalist, has taken on the most controversial first lady in history, producing a boldly incisive yet surprisingly sensitive portrait. The Hillary Rodham who emerges from these pages is not just a fascinating and important figure in her own right but the figurehead and unofficial leader of an activist liberal cohort that was born in the social and civil unrest of the 1960s and has risen to the highest levels of American government. A political biography of the highest order, The Seduction of Hillary Rodham is the story of one strong-willed woman's struggle to maintain her personal and political integrity in the face of powerfully seductive forces: the allure of a religiously inspired progressive ideology that engendered easy certitudes; the temptations of exercising unencumbered political power in a one-party state; and above all, the appeal of Bill Clinton, a charismatic, talented, but deeply flawed man who may have been both the best and worst thing that ever happened to Hillary Rodham.With unparalleled depth, Brock profiles Hillary's early mentors; delves into the byzantine world of Arkansas politics; and describes in explicit detail what Hillary has done to ensure Bill's meteoric rise to the top of American politics. Along the way, Hillary comes to terms with the strains in her marriage and undergoes multiple makeovers for the sake of an unprecedented political partnership. She plays an extensive role in staffing the Clinton White House and shaping its agenda, but her vaunted health care initiative ends in spectacular collapse and much of the still-brewing Whitewater scandal is laid at her door.Concluding that Hillary is neither the selfless and untarnished icon that her allies would portray nor the scheming Lady MacBeth of conservative demonology, Brock illuminates the character and actions of one of America's most poorly understood and unfairly maligned public figures.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Hangups from way back: historical myths and canons",
        "Authors": "By Gentles, Frederick",
        "Description": "",
        "Category": "",
        "Publisher": "Canfield Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Yorkshire Terriers",
        "Authors": "By Donnelly, Kerry",
        "Description": "",
        "Category": "",
        "Publisher": "T F H Publications, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1979"
        }
    },
    {
        "Title": "Seeing Red",
        "Authors": "By Ormerod, Roger",
        "Description": "When Angela Holleson's nondriving father dies in an auto crash in a small Welsh town, detective Sergeant Harry Kyle travels from London to help Angela investigate and both become involved in a complex mystery",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Firebird",
        "Authors": "By Carroll, James",
        "Description": "With McCarthy-era Washington rife with rumors of atomic secrets being leaked to the Russians, FBI agent Malone is drafted to steal the top-secret Soviet code book and enters a world of intrigue and danger",
        "Category": " Fiction , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "A Crowded Heart",
        "Authors": "By Papandreou, Nicholas",
        "Description": "Told from a boy's perspective, a series of vignettes illuminates the life of a man destined to be Greece's prime minister, his strong yet troubled family, and the dangerous world of Byzantine politics. A first novel. Tour.",
        "Category": " Fiction , Literary",
        "Publisher": "Picador USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Clinical Companion for Fundamental Nursing",
        "Authors": "By Kozier, Barbara",
        "Description": "",
        "Category": " Medical , Nursing , Home & Community Care",
        "Publisher": "Benjamin-Cummings Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Riverdance: The Story",
        "Authors": "By Smyth, Sam",
        "Description": "Tells the story of how a seven-minute Irish music and dance showpiece designed to fill a TV interlude became the popular two-hour theater show, Riverdance",
        "Category": " Sports & Recreation , Essays",
        "Publisher": "TRAFALGAR SQUARE +",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Trial in the Upper Room",
        "Authors": "By Paul Sann",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "8.45",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "Decorating with Fabric",
        "Authors": "By Lang, Donna, Robertson, Lucretia, and Datoli, Michael",
        "Description": "Showing how to decorate using fabric as the unifying element",
        "Category": " House & Home , Decorating",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.28",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Beyond Beauty: Girls Speak Out on Looks, Style and Stereotypes",
        "Authors": "By Pratt, Jane, White, Antoinette, and Arrowsmith, Alexandra",
        "Description": "Beyond Beauty is the first book to give girls under 20 what they really want - tons of advice and insights on the issues that most fascinate them: beauty, style, health, fitness, fame, and the role that these concerns should play in their lives.25 teens, all notable in such areas as film, sports, science, fashion, dance, theater, and music, reveal to Jane Pratt how issues of physical appearance have affected them: how their experiences, accomplishments, and pressure from friends, family, and skinny girls in glossy magazines have shaped their impressions of what it means to be beautiful.The girls also share makeup tips, their favorite never-leave-home-without-it items, their least favorite physical features, what they love about their jobs (like kissing Brad Pitt) and what they don't love about them (like never getting to see friends), and where they hang out. Jane's own makeup and hairstyling gurus provide beauty techniques and tips especially tailored to girls under 20.",
        "Category": " Young Adult Nonfiction , Social Topics , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Adventures in Porkland: How Washington Wastes Your Money and Why They Won't Stop",
        "Authors": "By Kelly, Brian",
        "Description": "A look at the making of the 1991 and 1992 budgets for the United States describes the waste, cheating, and abuse that politicians practice in order to please their friends, constituents, and campaign contributors. 25,000 first printing. Tour.",
        "Category": " Political Science , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "In Praise of Public Life",
        "Authors": "By D'Orso, Michael and Lieberman, Joseph I.",
        "Description": "What It Means to Serve the Public  In a vigorous defense of public life, Senator Joseph Lieberman, renowned as one of our most articulate and respected politicians,defines the duty, thehonor and the privilege of public life in the face of Americans' perennial cynicism about it.  Drawing widely from his own experience as a politician and his pride in public service, Lieberman makes a passionate, hopeful argument for the value of public life -- its place and necessity in our democracy and our need for more Americans to embrace it if we are to sustain our self-government.",
        "Category": " Political Science , Public Affairs & Administration",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Doctor's Book of Home Remedies for Women: Women Doctors Reveal over 2,000 Self-Help Tips on the Health Problems That Concern Women the Most",
        "Authors": "By Faelten, Sharon (EDT) and Prevention Magazine Health Books (EDT)",
        "Description": "A self-care book for women based entirely on advice from female doctors focuses on simple, practical solutions to more than two hundred health problems and includes tips on what women doctors do when they themselves become ill.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Rachel and Her Children - Homeless Families in American",
        "Authors": "By Kozol, Jonathan",
        "Description": "\"Extraordinarily affecting....A very important book....To read and remember the stories in this book, to take them to heart, is to be called as a witness.\"THE BOSTON GLOBEThere is no safety net for the millions of heartbroken refugees from the American Dream, scattered helplessly in any city you can name. RACHEL AND HER CHILDREN is an unforgettable record for humanity, of the desperate voices of the men, women, and especially children, and their hourly struggle for survival, homeless in America.From the Trade Paperback edition.",
        "Category": " Social Science , Sociology , Urban",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Beach : Stories by the Sand and Sea",
        "Authors": "By Lencek, Lena (EDT), Bosker, Gideon (EDT), and Hellmich, Mittie (PHT)",
        "Description": "J. D. Salinger's \"A Perfect Day for Bananafish,\" John Cheever's \"Goodbye, My Brother,\" Doris Lessing's \"Through the Tunnel\": These and dozens of other beloved stories share the beach as their setting. In fact, it is remarkable how many of the finest writers have set stories and novels in whole or in part at the beach -- and how often they use this locale to explore the great themes of love, loss, death, family, and redemption. Beach brings together, for the first time, the very best of this literary tradition, including stories, novel excerpts, and narrative nonfiction.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Politically Correct Holiday Stories: For an Enlightened Yuletide Season",
        "Authors": "By Garner, James Finn",
        "Description": "Holiday tales have long delighted and entertained us, but until now they've always been burdened with society's skewed values and mores. Stories that reinforce the stifling class system (Dickens's A Christmas Carol), legitimize the stereotype of a merry, over-weight patriarchal oppressor (Santa Claus in The Night Before Christmas), and justify the domestication and subjugation of wild animals (Rudolph the Red-Nosed Reindeer) abound in the literature and lore of this season.Now James Finn Garner has stepped in to revise and improve these familiar tales to free our social consciousness from the ghost of prejudice past. From the newly revised \"Nutcracker\" to \"Frosty the Persun of Snow,\" these stories rekindle the true holiday spirit and redefine the idea of \"good will to all men\" to include womyn, pre-adults, and companion animals as well.",
        "Category": " Humor , Topic , Political",
        "Publisher": "John Wiley & Sons, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Barter",
        "Authors": "By Stapleton, Constance",
        "Description": "",
        "Category": "",
        "Publisher": "Encore Editions",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "Dragon In My Backpack (Trade)",
        "Authors": "By Brunkus, Denise (ILT) and Woodruff, Elvira",
        "Description": "Bumps the toy dragon helps his friend Ben deal with his first-day-of-kindergarten apprehension",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Hammurabi's Code",
        "Authors": "By Kenney, Charles",
        "Description": "When Boston's most beloved public figure, Councillor Philip Stewart, is murdered in his home, the city is stricken with grief. As Boston reels from the shock of such a tragedy, newspapers across the city scramble to get the biggest story in this city's recent history. Who would wish harm upon a man regarded as a sainted soul who dedicated his life to helping the poor and downtrodden?The Boston Post has put its best investigative reporter on the case. Frank Cronin has achieved near celebrity status himself as a shrewd, tireless journalist who always manages to get his story - even if it means bending the rules, ignoring conventional wisdom, or bucking political pressures. Before long, while rival papers are still printing their glowing eulogies, Cronin is hunting down the story no one else wants to know about. In death, facts about Councillor Philip Stewart are emerging that raise troubling questions about the true nature of his life, his character, and his deeds.As Cronin persists in stripping back the facade that in life made Stewart such a beloved public figure, the trouble begins. With pressure mounting to leave the dead man's reputation alone, Cronin must put everything on the line - his job, his reputation, even his life - as he decides just how much of the truth to tell.Digging ever deeper into Stewart's past, Cronin moves inexorably closer to unmasking the killer and his motive - but just when you think you know exactly what to expect, the story takes a stunning turn.",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "A Cannibal in Manhattan",
        "Authors": "By Janowitz, Tama",
        "Description": "Manhattan heiress Maria Fishburn returns from a vacation in the South Sea islands with a new fiance, Mgungu Yabba Mgungu, a former cannibal who becomes the toast of Manhattan",
        "Category": "",
        "Publisher": "Crown Publishers",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Working Men: Stories",
        "Authors": "By Dorris, Michael",
        "Description": "A new collection of short fiction by the award-winning author of The Broken Cord presents fourteen incisive stories that bring to life colorful, meticulously detailed characters who speak in a rich variety of voices. 50,000 first printing. Tour.",
        "Category": " Fiction , General",
        "Publisher": "Henry Holt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Violent Decade: A Foreign Correspondent in Europe and the Middle East, 1935-1945",
        "Authors": "By Gervasi, Frank",
        "Description": "A personal account of events and personalities in Europe and the Middle East between 1935 and 1945. Gervasi was the bureau chief in Rome for Hearst, and later a roving correspondent for  Collier's  magazine. This is anecdotal history, emphasizing personal encounters with the powerful and famous, from Mussolini to Garbo and Hemingway. Several b&w photos. No bibliography. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "W. W. Norton & Co",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Sweetwater, Gunslinger 201: A Saga of Carrier Pilots Who Live by Chance, Love by Choice",
        "Authors": "By Labarge, William H.",
        "Description": "Describes the adventures of two daring pilots based on a United States Navy aircraft carrier during the early 1980s",
        "Category": "",
        "Publisher": "Aero Pub Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "Life sentences: A novel",
        "Authors": "By Hailey, Elizabeth Forsythe",
        "Description": "",
        "Category": "",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Growing and Using Healing Herbs",
        "Authors": "By Weiss, Gaea and Weiss, Shandor",
        "Description": "Describes the folklore and medicinal uses for sixty healing plants, and explains how to grow, harvest, and store each herb",
        "Category": " Gardening , Herbs",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Six Minute Souffle and Other Culinary Delights",
        "Authors": "By Carol Cutler",
        "Description": "",
        "Category": "",
        "Publisher": "Clarkson N Potter, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "The Proud and the Free",
        "Authors": "By Dailey, Janet",
        "Description": "Vivacious, black-haired Temple Gordon was raised on a grand southern plantation. The sassy, outspoken belle has known only luxury and laughter. But in truth, no matter how elegant the Gordon Glen estate is, no matter how beautiful Temple is, they are both Cherokee.Although Temple's father, Will, has attended the finest eastern schools, the proud Gordons share a mixed Scot and Native American heritage. By 1830, their graceful life of parties and parlor games begins to shatter. Gangs of Georgia vigilantes roam the roads. Treaties have been broken. Trouble rumbles closer, forcing men to choose sides. And Temple's fiance, reckless, dangerously seductive \"The Blade\" Stuart, knows the old ways Temple so dearly loves are coming to an end.Soon Temple and her entire family - including her tormented teenage brother Kipp and the Gordons' slaves, who have dreams of their own - are caught in a crossfire of tribal arguments and government betrayal. One source of hope and strength is Eliza Hall. A schoolteacher who arrives from New England expecting wilderness and savages, she finds instead a loving, genteel family to inspire her loyalty and devotion.Yet no one can stop the Cherokees' history from being written in blood. Challenged by tragedy and hardship, Temple will face losing everything and everyone she knows, as the Cherokees are forced westward by the government in Washington. Now desperate to be with the man she loves, determined to defy the world and stay by his side, Temple becomes a woman whose valor is forged by tears . . . and whose future lies at the end of a journey to a wild and turbulent destiny.An epic novel of sweeping grandeur, The Proud and the Free combines factual history with a wonderfully imagined cast of characters set against the scenic antebellum South. With more than 150 million copies of her books in print, Janet Dailey is one of America's most popular writers. In The Proud and the Free, she shows us why she is also one of America's best.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Little Brown & Co (T)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Getting Over Getting Older: An Intimate Journey",
        "Authors": "By Pogrebin, Letty Cottin",
        "Description": "As 77 million baby boomers begin turning fifty, Letty Cottin Pogrebin, a respected social critic and award-winning writer, tells the truth about that uncharted period when time speeds up and the body slows down - when you are no longer young but far from old, and you refuse to believe that you are over the hill. Pogrebin's journey out of her forties and into her fifties becomes a user-friendly map of this challenging terrain as she demystifies the fears most people can't face and celebrates the possibilities most people can't see.Every woman who is facing fifty or has already moved past it will be grateful for this warm, witty exploration of the indignities and epiphanies of midlife, large and small. Suddenly waking up in the middle of the night, for instance, with a non-negotiable need to go to the bathroom. Immediately. Having to let the waistband out on every skirt you own. Discovering one day that you can no longer read the phone book. Finally figuring out what you want to be when you grow up. Realizing that not everyone you love will be here forever and neither will you. Cherishing the present as never before.",
        "Category": " Self-help , Aging",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "800,000,000: The Real China",
        "Authors": "By Terrill, Ross",
        "Description": "",
        "Category": "",
        "Publisher": "Little Brown & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1972"
        }
    },
    {
        "Title": "Perfect Justice",
        "Authors": "By Bernhardt, William",
        "Description": "From William Bernhardt, bestselling author of PRIMARY JUSTICE, BLIND JUSTICE, and DEADLY JUSTICE.While attorney Ben Kincaid is vacationing in the Ouachita Mountains, he becomes embroiled in the brutal murder by crossbow of a young Vietnamese immigrant. Though revolted by the killing, Ben agrees to represent the accused--a remorseless youth and active member of the Anglo SaxonPatrol (ASP). Soon Ben begins to believe in the young man's innocence, yet before the trial, the client suddenly decides to pleade guilty. As members of the Vietnamese community fight fire with fire, Ben frantically searches for the truth. When he infiltrates an isolated ASP camp in thewoods, he discovers that what appears to be just another monstrous hate crime could be something else entirely.PERFECT JUSTICE is a whirlwind novel of suspense that addresses some of the most controversial issues of our time. William Bernhardt paints a riveting portrait of a town torn apart by xenophobia, racism and violence. With mounting suspense, his anatomy of an incendiary courtroom trial culminates in serpentine twists and sizzling revelations.\"I fought the real courtroom battle for the Vietnamese fisherman against the Texas Klan and I was stunned how real-to-life William Bernhardt's PERFECT JUSTICE is--a gripping courtroom thriller you can't put down.\"Morris Dees, Author of HATE ON TRIAL and A SEASON OF JUSTICE",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "India Fan",
        "Authors": "By Holt, Victoria and Plaidy, Jean",
        "Description": "Heir to an ornamental fan that brings bad luck and death to its owners, Drusilla Delaney travels with the wealthy Framblings to France and India to break the deadly curse",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "The Captive",
        "Authors": "By Holt, Victoria",
        "Description": "John, a fugitive from England wrongly accused of murder, and an English girl named Rosetta are shipwrecked in Africa, seized by pirates, and finally escape to England, where they strive to prove his innocence",
        "Category": " Fiction , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Mistress of the Boards",
        "Authors": "By Sumner, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Copper Beeches,",
        "Authors": "By Lewis, Arthur H",
        "Description": "",
        "Category": "",
        "Publisher": "Trident Press",
        "Price Starting With ($)": "24.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Triumph: A Novel",
        "Authors": "By Gann, Ernest K.",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Confessions of a Parish Priest: An Autobiography",
        "Authors": "By Greeley, Andrew M.",
        "Description": "Covering Andrew Greeley's controversial career over five decades of change in the Catholic Church, this autobiography, offers personal insight into the major issues confronting a modern priest, from the birth control encyclical, to clerical celibacy, to the role of women in the Church",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Passage Home",
        "Authors": "By McLeay, Alison",
        "Description": "From frontier America to a tawdry barroom stage, to the bustling city of Liverpool, indomitable Rachel Dean battles the constraints that bind nineteenth-century women to find love and to build the greatest steamship in the world",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Antonietta",
        "Authors": "By Hersey, John",
        "Description": "Follows the odyssey of a Stradivarius violin from its creation in 1699, through its impact on musicians and composers as diverse as Mozart, Berlioz, and Stravinsky, to its purchase in 1990 by a tone-deaf financier",
        "Category": " Fiction , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Approaching Zero: The Extraordinary Underworld of Hackers, Phreakers, Virus Writers, and Keyboard Criminals",
        "Authors": "By Mungo, Paul and Clough, Bryan",
        "Description": "A place has been created that has no physical dimensions. It can only be reached with a computer. You can hear it in the hum of a modem or the whistle of a fax machine, and see it in the lines on a computer screen, but you can never touch it. This place is a network of connections - from microwaves and fiber-optical cables to telephones, computers, and data banks, it is an ethereal web that links every remote corner of the world. It controls the technology that runs our lives, managing the flow of information, communication, and money, and it is now riddled with arcane computer viruses, overrun by adolescent hackers, and disputed in the electronic turf wars of high-tech street gangs.This place is called Cyberspace, a technological frontier where the outlaws are sophisticated computer renegades - hackers, phreakers, and virus writers who know the interconnected electronic networks as well as the engineers and programmers who built them. Using only small personal computers, hackers with names like Captain Zap and Acid Phreak, or hacker gangs like Rabid and the Legion of Doom, can infiltrate the protected and secured computers at the Pentagon, NATO, or NASA at will. They can roam invisibly through the electronic switches and links of our telephone network and tap into the computers that hold the credit records of all Americans, altering data and copying credit card numbers and access codes. They can even hack into the world's largest banking systems, and have learned how to transfer funds into their own accounts.In recent years, Cyberspace has been invaded by viruses with names like Number of the Beast, LoveChild, and Michelangelo, which can erase data and cause computers to crash. The shadowy creators of these viruses, working from obscure places like Bulgaria, Indonesia, or Thailand, have invented scores of pernicious programs that will infect as many as 12 million of the world's 90 million PCs over the next two years.Approaching Zero is the definitive history of the computer underworld, from its obscure origins in the phone phreaking of the late sixties to the extraordinary international phenomenon it has become in the present day. The book captures the exploits of the most accomplished data criminals, like Bulgaria's Dark Avenger, whose viruses have devastated systems across the world, and Fry Guy, in Indiana, who at the age of fifteen tampered with credit records and fund transfers for personal gain. It also charts the development of the other forms of electronic blight - the rabbits, trojans, logic bombs, and worms - as well as the international dimensions of the computer underworld, from America to Britain to Germany, then to Bulgaria, Russia, and the Far East. It is the first book to define the technological subculture of phreaking, hacking, and virus writing, and to put these elements into the context of our increasingly technology-dependent society, for in the future all crime will be data crime.",
        "Category": " Social Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Rainbow's End",
        "Authors": "By Grimes, Martha",
        "Description": "An elderly tapister keels over in Exeter Cathedral while viewing the famous embroidered rondels. A woman's body is found in Salisbury, and in London yet another woman dies from supposed \"natural causes.\" But there are no natural causes in a Martha Grimes novel or in the world inhabited by Scotland Yard Chief Superintendent Richard Jury.Is there a link connecting these three women? Of course. Jury is convinced that the link is Santa Fe, New Mexico. Leaving Melrose Plant, ex-earl and amateur sleuth, to pursue inquiries in London, Jury heads over to the States, where, surrounded by turquoise jewelry and a thirteen-year-old girl with a pet coyote, he searches for and finds an astonishing web of greed, murder, and mayhem.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Men of Brewster Place: A Novel",
        "Authors": "By Naylor, Gloria",
        "Description": "The author of The Women of Brewster Place journeys back to the old neighborhood to explore the lives and fates of seven men, from Basil Michael, who marries a woman he does love for the sake of her children, to Eugene Turner, torn between his homosexuality and his beloved wife. 200,000 first printing. Tour.",
        "Category": " Fiction , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Waldheim: The Missing Years",
        "Authors": "By Herzstein, Robert Edwin.",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Contrary to Popular Opinion",
        "Authors": "By Dershowitz, Alan M.",
        "Description": "As an outspoken lawyer, law professor, bestselling author, and public personality extraordinaire, Alan M. Dershowitz has been a controversial and vocal critic of the status quo for more than two decades. Never afraid to tackle controversy or take on an unpopular case, Dershowitz has emerged as the nation's preeminent civil libertarian. While his list of clients, including Claus Von Bulow, Jim Bakker, Leona Helmsley, Michael Milken, and Mike Tyson may read like a who's-who of celebrity outcasts, Dershowitz has also devoted countless hours to uncelebrated legal work on behalf of victims of shoddy law and social injustice. As a political gadfly and enemy of anti-Semitism, he has challenged the Polish Catholic hierarchy on its own ground and publicly admonished former Soviet President Gorbachev to renounce Soviet anti-Semitism. He has denounced critics who hold democratic Israel to an unrealistically high standard of behavior while turning a blind eye towards the massive human rights violations of its hostile neighbors. He has blasted the appointments Reagan and Bush have made to the Supreme Court, calling the current chief justice an \"enemy of liberty,\" and characterizing several recent appointees as \"mediocrities in robes.\"In Contrary to Popular Opinion Dershowitz selects his most recent columns, articles and essays and adds original commentary to present an engaging and spirited discussion from a remarkable mind about the most pressing issues of our time. Readers of Dershowitz's previous bestsellers, The Best Defense, Reversal of Fortune, and Chutzpah, will delight to see that Contrary to Popular Opinion continues Dershowitz's style of studied audacity. No matter how sensitive or incendiary the subject, Dershowitz is never afraid to say what is on his mind and back it up with solid and surprising arguments. In Contrary to Popular Opinion Dershowitz continues his crusade against blatant and subtle examples of anti-Semitism; dissects the \"political correctness\" controversy; exposes well-meaning censors on both the right and the left; blasts Bush's overtures to Beijing's repressive regime; makes a strong case for arresting and trying Yasir Arafat; questions the fairness of the RICO laws; makes a surprising pro-choice argument for the overturn of Roe v. Wade; wonders aloud about the damage the \"war on drugs\" is doing to our civil liberties; and condemns the ominous odor of fascism and bigotry rising from such diverse quarters as Russia's Pamyat and the Presidential campaigns of David Duke and Patrick Buchanan.No matter what your political convictions, Alan Dershowitz is certain to delight and inform and possibly surprise you. In an age when political discourse has gone the way of the sound-bite, Alan Dershowitz provides a stimulating dose of that all-too-rare commodity - original thought compellingly presented.",
        "Category": " Literary Criticism , General",
        "Publisher": "Pharos Books",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The 6 Imperatives of Marketing: Lessons from the World's Best Companies",
        "Authors": "By Magrath, Allan J.",
        "Description": "\"We live in a time of unprecedented market uncertainty, where the order of the day is often disorder,\" warns author Allan J. Magrath. Breaking through the marketing maelstrom of issues, priorities, and questions is perhaps the most difficult challenge for any company that wants to be a market leader. The 6 Imperatives of Marketing presents Magrath's insightful analysis of how to meet this challenge--based on the experiences of more than 300 highly successful organizations in 40 different industries. His lucid and objective viewpoint allows you to mentally stand back from the storm and get a clear sense of which issues are critical and which are mere distractions.As Magrath shows, \"winner\" companies concentrate their attention on six key areas:1. Marketing productivity2. Innovation3. Distribution channels4. Alliances5. Globalization6. QualityThe 6 Imperatives of Marketing examines these urgent issues, interweaving Magrath's lively observations with hundreds of examples of actual marketing victories. The book takes you on a fascinating sightseeing tour of the dilemmas, debates, and decisions these companies experienced--and are still working through. For instance, you'll learn about how the tightly-focused marketing productivity of Polaroid helped it beat out the much larger Kodak in the instant photography category... or how Braun uses innovation in product design... or how lumber chain Home Depot uses innovation in staffing... or how GE requires that one of its distributors, Cameron and Barkley Co., provides just-in-time service, with all inventory and orders routed through GE's computers... or how A.T. Cross invested its marketing energy in the global market for a decade and watched its sales grow from $20 million to $200 million.Each chapter focuses on one imperative, breaks it apart, and provides focused advice on how to deal with it--in terms the practicing manager can put to use immediately.In today's marketing-driven competitive environment, all forward-looking managers must consider the marketing strategies their company is using and how to tie those strategies into overall business strategy. The 6 Imperatives of Marketing alerts you to the critical make-or-break issues--and shows you how to deal with them before they break you.",
        "Category": " Business & Economics , General",
        "Publisher": "Amacom Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "A Fish in the Water: A Memoir",
        "Authors": "By Vargas Llosa, Mario and Lane, Helen (TRN)",
        "Description": "The autobiography of one of Latin America's most celebrated writers ranges from his birth in Arequipa, through his work with the reform movement and 1990 bid for the Peruvian presidency, and reveals the experiences that he transformed into his critically acclaimed literary works.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Farrar Straus Giroux",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Weather Flying",
        "Authors": "By Robert N. Buck",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "14.44",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Perfect Life: The Shakers in America",
        "Authors": "By Faber, Doris",
        "Description": "Traces the history of the Shakers in America, from their founding in England to their few surviving colonies in New England.",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Farrar Straus Giroux",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "April",
            "Year": "1974"
        }
    },
    {
        "Title": "Reading the Numbers: A Survival Guide to the Measurements, Numbers, and Sizes Encountered in Everyday Life",
        "Authors": "By Blocksma, Mary",
        "Description": "Explains number systems dealing with alcohol content, bar codes, blood pressure, checks, the Richter scale, fertilizers, pencils, tires, and zip codes",
        "Category": " Science , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Savings and Loam: An Andrew Broom Mystery",
        "Authors": "By McInerny, Ralph M.",
        "Description": "Andrew Broom becomes embroiled in murder when a children's book illustrator is gunned down in his Indiana backyard, a crime that baffles the police who are unaware of a fortune in German bonds that is buried in the yard",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Hour of gold, hour of lead;: Diaries and letters of Anne Morrow Lindbergh, 1929-1932",
        "Authors": "By Lindbergh, Anne Morrow",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Play for a Kingdom",
        "Authors": "By Dyja, Thomas",
        "Description": "In this “brilliantly imagined and neatly plotted” Civil War novel (Boston Globe), two battle-scarred companies-one Union, one Confederate-embark on a series of baseball games amid the carnage at Spotsylvania. “Wonderfully conceived and eloquently executed” (Caleb Carr). Maps.",
        "Category": " Fiction , Historical",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Disappearing Body",
        "Authors": "By Grand, David",
        "Description": "This rich tale of drug dealing and union-busting, murder and mayhem on both sides of the law, begins when Victor Ribe, an ex-junkie and World War I veteran, is mysteriously released from prison after serving fifteen years for a murder he didn't commit. He returns to a city where Prohibition has been repealed and a dark underworld is developing a new source of profits--illegal heroin trafficking. Meanwhile, legitimate industries are launching an offensive against unionization and the specter of Communism--and they're not above fighting dirty.  When Victor's old Army buddy, Freddy Stillman, a munitions salesman, reports a murder but can't explain why the body has disappeared, he unwittingly pulls himself and Victor into the bewildering swirl of corruption and conspiracy that encompasses everyone in the book's vast, raging cityscape. Combining the atmospheric richness of Dashiell Hammett and the irresistible, subversive humor of Thomas Pynchon, The Disappearing Body weaves suspenseful mystery into a stunning, darkly hilarious portrait of urban America between the wars.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "All New York: The Source Guide (All City Series)",
        "Authors": "By Lown, Patricia Twohill, Lown, David Amory, and McAree, Francoise (ILT)",
        "Description": "Where to find all of New York's things of beauty and elegance--an essential resource for architects, designers, and consumers. This entirely new source guide for the city of New York follows hard upon the heels of Tout Paris, a highly successful work by the same authors. As with Tout Paris, All New York is a guidebook for exploration and discovery of the things dreams are made of, the \"stuff\" we would wish for in our homes--on our floors, our walls, our beds and baths, our kitchens and gardens. A treasure hunter's guide, All New York presents the best craftsmen who create masterpieces and also repair and restore them. It is all here: where to buy antiques and art, frames and fabrics, porcelain and silver, linen and home furnishings, icons, maps, books, glass, leather, mosaics, marble, parquet, stained glass, and more. Apart from the dealers, this book also lists the manufacturers, the great design centers, and the city's famous flea markets. All New York is a book for all those who enjoy antiquing and decorating and love to explore New York's great pleasures.",
        "Category": " Antiques & Collectibles , Reference",
        "Publisher": "Palencar Co Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Dancing on Glass: A Novel",
        "Authors": "By Chehak, Susan Taylor",
        "Description": "Susan Taylor Chehak's startling new novel is a tale of illicit passion, transgression, and retribution, set once again in the very heart of middle America. Bader Von Vechten's marriage to Katherine Craig unites the leading families of Cedar Hill and promises to heal the wounds of three generations. But when Bader commences a love affair with a beautiful young man, Katherine is goaded to the desperate act that will change their lives irrevocably, setting in motion the series of tragic events that will play themselves out over two generations. Only twenty-five years later, in the wake of death, murder, and disgrace, can Bader, changed almost beyond recognition, return to Cedar Hill. There a chance encounter affords Bader his last hope for human contact - and redemption.Psychologically uncompromising and emotionally gripping, Dancing on Glass is a bold novel that sweeps the reader along from its unforgettable opening scene to its climactic ending. A brilliant evocation of the passion and violence that lurk beneath the surface of small-town life, it marks a significant step forward in the career of a writer whose ficton has already been hailed as masterly.",
        "Category": " Fiction , General",
        "Publisher": "Ticknor & Fields",
        "Price Starting With ($)": "10.49",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Letter From Home (Hart, Carolyn G)",
        "Authors": "By Hart, Carolyn G.",
        "Description": "World-renowned journalist G. G. Gilman does her best not to think of the past. But one day she gets a letter - sent from the small Oklahoma town where she grew up - that brings it all back. Memories of people she had once known and loved dearly - and of the sultry summer when her life changed forever...In the summer of 1944, Gretchen Gilman was working as a reporter at the local newspaper. Her assignments weren't very exciting - she mostly wrote about local boys just back from the war - but it was a good opportunity for a young woman with talent and ambition to spare. Gretchen knew better than anyone what people in town were talking about. And that summer they were talking about Faye Tatum.Just hours after Faye was found dead in her own living room, the speculation began. Murdered, people said, by her jealous husband - just back from the war - who hadn't been seen since the night of her death. A woman, they whispered, who got what she deserved. Shouldn't have been dancing down at the bar - and with a different man every night. Just imagine! What kind of example is that for her daughter? It seemed like the gossip would never stop...But Gretchen knew a different Faye - the talented artist, the devoted mother, the kind, fun-loving neighbor. She knew the circumstances of Faye's life and death were much different than people imagined - and she was determined to uncover the truth once and for all. Even if it meant writing a story that would haunt her for the rest of her life.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Single Wife",
        "Authors": "By Solomon, Nina",
        "Description": "\"Like a particularly sharp episode of Sex and the City, the novel poses a provocative question-does a woman need a man to feel 'married'?-and goes about answering it with both flair and heart.\" (Elle)  Grace Brookman thought she had it all-until her husband went out one day and never came back. Suddenly Grace is left responsible for everything, including covering up for her AWOL husband. Leaving traces of him everywhere, she discovers that a marriage can be reduced to a few timely excuses and well-placed props, some spilled crumbs here, some dirty laundry there. But then Laz's sordid past shows up on her doorstep, along with a few other surprises, turning her New York life into mess. As a single wife, Grace finally realizes it's time to take matters into her own hands...",
        "Category": " Fiction , Literary",
        "Publisher": "NAL Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Staying on Top When Your World Turns Upside Down",
        "Authors": "By Cramer, Kathryn",
        "Description": "Offers a unique four-stage program of recovery from traumatic events in life, advising how to turn these traumas into positive forces for personal growth",
        "Category": " Psychology , Emotions",
        "Publisher": "Viking",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "It Takes a Village, and Other Lessons Children Teach Us",
        "Authors": "By Clinton, Hillary Rodham",
        "Description": "For more than twenty-five years, First Lady Hillary Rodham Clinton has made children her passion and her cause. Her long experience with children -- not only through her personal roles as mother, daughter, sister, and wife but also as advocate, legal expert, and public servant -- has strengthened her conviction that how children develop and what they need to succeed are inextricably entwined with the society in which they live and how well it sustains and supports its families and individuals. In other words, it takes a village to raise a child.  This book chronicles her quest -- both deeply personal and, in the truest sense, public -- to discover how we can make our society into the kind of village that enables children to grow into able, caring, resilient adults. It is time, Mrs. Clinton believes, to acknowledge that we have to make some changes for our children's sake. Advances in technology and the global economy along with other developments society have brought us much good, but they have also strained the fabric of family life, leaving us and our children poorer in many ways -- physically, intellectually, emotionally, spiritually.  She doesn't believe that we should, or can, turn back the clock to \"the good old days.\" False nostalgia for \"family values\" is no solution. Nor is it useful to make an all-purpose bogeyman or savior of \"government.\" But by looking honestly at the condition of our children, by understanding the wealth of new information research offers us about them, and, most important, by listening to the children themselves, we can begin a more fruitful discussion about their needs. And by sifting the past for clues to the structures that once bound us together, by looking with an open mind at what other countries and cultures do for their children that we do not, and by identifying places where our \"village\" is flourishing -- in families, schools, churches, businesses, civic organizations, even in cyberspace -- we can begin to create for our children the better tomorrow they deserve.",
        "Category": " Social Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Golden Orange",
        "Authors": "By Wambaugh, Joseph",
        "Description": "Drunk and adrift in Orange County, California, forty-year-old ex-cop Winnie Farlowe attracts the attention of a three-time divorcee who introduces him to the mystery of her father's death and leads them both into danger",
        "Category": " Fiction , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "The Beardstown Ladies' Stitch-In-Time Guide to GrowingYour Nest Egg: Step-by-Step Planning for a Comfortable Financial Future",
        "Authors": "By Beardstown Ladies Investment Club (COR) and Dellabough, Robin",
        "Description": "A practical and friendly guide to preparing for the golden years offers advice on investment portfolios, understanding 401Ks and investment plans, obtaining needed insurance, Social Security and Medicare, mutual funds, CDs, Treasury bills, stocks, and bonds. Reprint. Tour.",
        "Category": " Business & Economics , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Japanophobia:: The Myth of the Invincible Japanese",
        "Authors": "By Emmott, Bill",
        "Description": "The author, editor of  The Economist , refutes the ominous view of Japanese multinationals hyped in Michael Crichton's  Rising Sun  and echoed elsewhere in America. He explains why the paranoid idea that the sinister Japanese are on a roll that won't end is both wrong and destructive. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Wonderful Ways to Love a Child",
        "Authors": "By Ford, Judy",
        "Description": "A treasury of gentle advice and a series of success stories combine in an encouraging guide for parents that helps readers to overcome the emotional stresses of child-rearing and enjoy the the benefits of parenthood. Original. 50,000 first printing. Tour. IP.",
        "Category": "",
        "Publisher": "Conari Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Secrets of Good Carb / Low Carb Living",
        "Authors": "By Woodruff, Sandra",
        "Description": "From the top-selling author of The Good Carb Cookbook comes a comprehensive and motivating guide to the good-carb lifestyle. Lately, low-carb diets have been all the rage, but until recently little scientific research has been available regarding their effectiveness and potential health consequences. Now, studies are proving that low-carb diets do work and, contrary to popular belief, they don't pose health risks-if they are done right. But with so many diets to choose from, it is hard for many people to find a program that is realistic for their lifestyle and to which they can adhere. Nationally recognized nutritionist Sandra Woodruff demystifies the process and explains how anyone can tailor a low-carb plan to their individual needs to achieve long-term weight loss. She provides hundreds of delicious recipes, innovative menu plans, instructive cooking tips, and helpful advice for eating out. The healthy eating plan in Secrets of Good-Carb/Low-Carb Living includes lean proteins, healthy fats, and good carbs to not only lose weight but also to lower blood sugar and cholesterol levels and help correct metabolic syndrome and insulin resistance. Now anyone can get better results from their low-carb diet or formulate a new eating plan specifically for their needs. With Sandra Woodruff, low-carb living never tasted so good!",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Avery",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Haunted: A Tale of the Mediator",
        "Authors": "By Cabot, Meg",
        "Description": "Haunted is the fifth book in the thrilling, romantic Mediator series, from the New York Times bestselling author of the Princess Diaries, Meg Cabot.  Suze is used to trouble, but this time she's in deep: Ghostly Jesse has her heart, but Paul Slater, a real flesh-and-blood guy, is warm for her form. And mediator Paul knows how to send Jesse to the Great Beyond. For good. Paul claims he won't do anything to Jesse as long as Suze will go out with him. Fearing she'll lose Jesse forever, Suze agrees. But even if Suze can get Jesse to admit his true feelings for her, what kind of future can she have with a guy who's already dead?Don't miss the delightfully funny supernatural Mediator series, from New York Times bestselling author Meg Cabot.",
        "Category": " Young Adult Fiction , Social Themes , General",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Four of a Kind: A Treasury of Favorite Works by America's Best Loved Humorist",
        "Authors": "By Bombeck, Erma",
        "Description": "Provides a satirical view of motherhood, suburbia, and the problems of contemporary family life",
        "Category": " Fiction , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Dave Barry's Guide to Life (Contains: \"Dave Barry's Guide to Marriage and/or Sex\" / \"Babies and Other Hazards of Sex\" / \"Stay Fit and Healthy Until You're Dead\" / \"Claw Your Way to the Top\")",
        "Authors": "By Barry, Dave and O'Brien, Jerry (ILT)",
        "Description": "A collection of four of Barry's most popular books features a new jacket design and includes Dave Barry's Guide to Marriage and/or Sex, Babies and Other Hazards of Sex, Stay Fit and Healthy Until You're Dead, and Claw Your Way to the Top.",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Mary Queen of Scots",
        "Authors": "By Fraser, Antonia",
        "Description": "",
        "Category": "",
        "Publisher": "Hunter Publishing+inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1970"
        }
    },
    {
        "Title": "Waterwise Gardening (Burpee American Gardening Series)",
        "Authors": "By Springer, Lauren",
        "Description": "Outlines how gardeners can make the most of their water resources through proper plant selection, providing detailed descriptions of 125 plants suitable for every region, as well as information on many more climate-specific plants. Original.",
        "Category": " Reference , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Little Bear's New Friend (Little Animal Adventures)",
        "Authors": "By Pepin, Muriel, Geneste, Marcelle (ILT), and Kovacs, Deborah",
        "Description": "Unable to sleep during his family's long winter nap, a little bear cub wanders out of his cave into the snow and makes friends with a little wolf pup",
        "Category": "",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Sir Gawain and the Green Knight (A New Verse Translation)",
        "Authors": "By Borroff, M.",
        "Description": "The classical medieval poem relating Sir Gawain's romances, his conflict with the Green Knight, and return to the Round Table",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1967"
        }
    },
    {
        "Title": "A+ Guide to Managing and Maintaining Your PC, Third Edition, Comprehensive",
        "Authors": "By Andrews, Jean",
        "Description": "Whether the goal is to support a PC, obtain A+ certification, or train others to become PC repair technicians, \"A+ Guide to Managing and Maintaining Your PC\" gets you there. Jean Andrews brings clear, conversational writing to technical topics to make tough topics easier--no electronic experience is assumed or required. This new edition contains coverage on NT 4, Windows 98, and is current for today's technology.",
        "Category": " Computers , Certification Guides , A+",
        "Publisher": "Course Technology",
        "Price Starting With ($)": "8.56",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Kennedy Women: The Saga of an American Family",
        "Authors": "By Leamer, Laurence",
        "Description": "Monumental in scope and extraordinary in sensitivity, The Kennedy Women chronicles five matrilineal generations in our nation's premier political dynasty. Not merely distinguished cultural history, it is a story of epic sweep, brimming with triumph and tragedy, courage and compliance, self-sacrifice and self-delusion.Moving from steerage on an immigrant vessel to the slums of Boston, from the Court of St. James's to the White House and beyond, The Kennedy Women paints startling, in-depth portraits of the mothers, wives, sisters, and daughters who stood beside some of the most dynamic men of the twentieth century through occasions of great opulence and heartbreak, victory and scandal. Among its revelations: how Rose's marriage almost ended on her wedding day; the poignantly detailed life stories of mentally challenged Rosemary and the glorious, lost Kathleen; Jackie's near death in the weeks before the inauguration; Eunice's struggle, despite chronic illness, to build the Special Olympics; a long-guarded account of Rose's response to Chappaquiddick; Jean Kennedy Smith's and the family's private reactions to the William Kennedy Smith rape charges; Jackie's gallant battle to live and die with dignity and privacy; and the unique challenges and pressures confronting future Kennedy matriarchs Caroline Kennedy Schlossberg, Maria Shriver Schwarzenegger, Kerry Kennedy Cuomo, Kathleen Kennedy Townsend, and Rory Kennedy.Here, finally, is the women's story; even those who feel they know all there is to know about the Kennedys will discover how much more there is to the story. For five years, Laurence Leamer researched this book, receiving unprecedented cooperation from family members, interviewing scores of relatives and close associates, gaining access to hundreds of personal documents. Included are thirty-two pages of rare and fascinating family photographs.The Kennedy Women combines exhaustive and superb scholarship with a gripping narrative that will alter forever our perception of America's royal family.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Villard",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "A Long Way from Home: Growing Up in the American Heartland",
        "Authors": "By Brokaw, Tom",
        "Description": "Reflections on America and the American experience as he has lived and observed it, by the bestselling author ofThe Greatest Generation.In this beautiful memoir, Tom Brokaw writes of America and of the American experience. From his parents’ life in theThirties, on to his boyhood along the Missouri River and on the prairies of South Dakota in the Forties, into his early journalism career in the Fifties and the tumultuous Sixties, up to the present, this personal story is a reflection on America in our time. Tom Brokaw writes about growing up and coming of age in the heartland, and of the family, the people, the culture and the values that shaped him then and still do today. His father, Red Brokaw, a genius with machines, followed the instincts of Tom's mother Jean, and took the risk of moving his small family from an Army base to Pickstown, South Dakota, where Red got a job as a heavy equipment operator in the Army Corps of Engineers' project building the Ft. Randall dam along the Missouri River. Tom Brokaw describes how this move became the pivotal decision in their lives, as the Brokaw family, along with others after World War II, began to live out the American Dream: community, relative prosperity, middle class pleasures and good educations for their children. \"Along the river and in the surrounding hills, I had a Tom Sawyer boyhood,\" Brokaw writes; and as he describes his own pilgrimage as it unfolded–from childhood to love, marriage, the early days in broadcast journalism, and beyond–he also reflects on what brought him and so many Americans of his generation to lead lives a long way from home, yet forever affected by it.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "I Am a Soldier, Too: The Jessica Lynch Story",
        "Authors": "By Bragg, Rick and Lynch, Jessica (CON)",
        "Description": "I Am a Soldier, Too: The Jessica Lynch Story is the story this country has hungered for, as told by Jessica Lynch herself to Rick Bragg. In it, she tells what really happened in the ambush; what really happened in the hospital; what really happened, from her perspective, on the night of the rescue. More than this, the collaboration between Lynch and Bragg captures who she is and where she's from: her childhood in Palestine, West Virginia, a lovely, rugged stretch of land always referred to as the hollow, where she rode horses, played softball, and was crowned Miss Congeniality at the Wirt County Fair the same year the steer she raised took a ribbon. It reveals her relationships with her older brother, Greg Jr., also an enlisted soldier, and her younger sister, Brandi; with her father, Greg Sr., a forty-three-year-old truck driver who has at times worked construction, cut hay, cut firewood, hauled timber, hauled concrete, run a bulldozer, run a backhoe, cleaned houses, and dug graves; and with her mother, Deadra, a city girl from Parkersburg who moved to the hollow and met her future husband when he was eleven and she was nine. And it describes what happened to the Lynch family in the agony of Jessica's capture and captivity; the terror and disbelief that cascaded through an entire town at the news of her disappearance into enemy hands; the joy of her rescue; and the long work of healing and recovery that lie ahead. Jessica Lynch has won the hearts and minds of Americans. In the hands of Rick Bragg, a renowned chronicler of American lives, her tale is told at last.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Beans of Egypt, Maine",
        "Authors": "By Chute, Carolyn",
        "Description": "",
        "Category": "",
        "Publisher": "Ticknor & Fields",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "National Geographic: Behind America's Lens on the World",
        "Authors": "By Abramson, Howard S.",
        "Description": "Traces the history of National Geographic magazine, examines its accomplishments, and assesses the magazine's influence on the nation",
        "Category": " Nature , General",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Drowning Ruth: A Novel (Oprah's Book Club)",
        "Authors": "By Schwarz, Christina",
        "Description": "Deftly written and emotionally powerful, Drowning Ruth is a stunning portrait of the ties that bind sisters together and the forces that tear them apart, of the dangers of keeping secrets and the explosive repercussions when they are exposed. A mesmerizing and achingly beautiful debut.Winter, 1919. Amanda Starkey spends her days nursing soldiers wounded in the Great War. Finding herself suddenly overwhelmed, she flees Milwaukee and retreats to her family's farm on Nagawaukee Lake, seeking comfort with her younger sister, Mathilda, and three-year-old niece, Ruth. But very soon, Amanda comes to see that her old home is no refuge--she has carried her troubles with her. On one terrible night almost a year later, Amanda loses nearly everything that is dearest to her when her sister mysteriously disappears and is later found drowned beneath the ice that covers the lake. When Mathilda's husband comes home from the war, wounded and troubled himself, he finds that Amanda has taken charge of Ruth and the farm, assuming her responsibility with a frightening intensity. Wry and guarded, Amanda tells the story of her family in careful doses, as anxious to hide from herself as from us the secrets of her own past and of that night.Ruth, haunted by her own memory of that fateful night, grows up under the watchful eye of her prickly and possessive aunt and gradually becomes aware of the odd events of her childhood. As she tells her own story with increasing clarity, she reveals the mounting toll that her aunt's secrets exact from her family and everyone around her, until the heartrending truth is uncovered.Guiding us through the lives of the Starkey women, Christina Schwarz's first novel shows her compassion and a unique understanding of the American landscape and the people who live on it.",
        "Category": " Fiction , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "A Man of Double Deed",
        "Authors": "By Leonard Daventry",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Coming of Age: The Story of Our Century by Those Who've Lived It",
        "Authors": "By Terkel, Studs",
        "Description": "Coming of Age: The Story of Our Century by Those Who've Lived It is a collective portrait of our times, woven from the voices of seventy very different people, the youngest of whom is seventy and the oldest ninety-nine. Together they give us an extraordinary panorama of American life and work throughout this century and underscore the ways in which the times have changed.Coming of Age is also, in many ways, a sequel to Terkel's acclaimed Working (1974), for it traces the extraordinary ways our working lives have changed in the past few decades - often beyond recognition. We meet politicians and preachers, advertising men and hucksters. Here is the partner in a large law firm, suing the colleagues who have forced him out; here, too, is the carpenter, accepting as inevitable the replacement of his skilled tasks by machine. But this is not a group of disgruntled Luddites; most accept - indeed welcome - the new technologies, yet they all deplore the degree to which human contact has declined and how traditional hopes and aspirations have been superseded by the often ruthless demands of the modern corporation.",
        "Category": " History , Modern , 20th Century",
        "Publisher": "New Pr",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Wildfowler's Quest / Forty Years of Wandering With America's Foremost Wildfowler",
        "Authors": "By Reiger, George",
        "Description": "The author shares his experiences hunting ducks, geese, turkey, woodcock, rail, and snipe",
        "Category": " Sports & Recreation , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Here at The New Yorker",
        "Authors": "By Gill, Brendan",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "New Orleans Beat",
        "Authors": "By Smith, Julie",
        "Description": "Detective Skip Langdon believes that TOWN, a computer bulletin board community, holds the key to the \"accidental\" death of Geoff, a computer genius. By the author of Jazz Funeral. 35,000 first printing. $20,000 ad/promo. Tour.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Bluebird Canyon",
        "Authors": "By McCall, Dan",
        "Description": "Rex, a durable soap-opera star, known to millions as the kindly Dr. Kelly, is lost in the persona of his TV role, which creates untold problems for his two women, his young son, his friend, and for himself",
        "Category": " Fiction , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.08",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "The Old Contemptibles",
        "Authors": "By Grimes, Martha",
        "Description": "When the lady he had hoped to marry is murdered, not even Richard Jury is above suspicion, and so Jury's friend, Melrose Plant, must probe the mystery of her death in his stead",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Pastime",
        "Authors": "By Parker, Robert B.",
        "Description": "Emotionally scarred Paul Giacomin begs Spenser, a tough-guy private eye, to help rescue his mother, and the request sets Spenser off on an emotional and dangerous journey",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Paper Doll",
        "Authors": "By Parker, Robert B.",
        "Description": "Spenser tracks a mystery woman who refuses to rest in peace, in Robert B. Parker's most beguiling thriller yet.Sam Spade. Philip Marlowe. Lew Archer. Spenser. Like his legendary predecessors, the tough and classy Boston PI has become an American institution. With Paper Doll, Robert B. Parker takes Spenser down a sinister path, where every welcome masks a warning and identity is paper-thin.Hired by Loudon Tripp, an aggrieved Boston aristocrat who believes the brutal street slaying of his wife, Olivia, to be something other than random violence, Spenser immediately senses Tripp's picture-perfect version of his family's life is false. For starters, the victim's reputation is far too saintly, while her house is as lived-in as a stage set and her troubled children don't appear the product of a happy home. Spenser plunges into a world of grand illusion, peopled by cardboard cutouts, including: a distinguished public servant with plenty to hide; a wealthy executive whose checks bounce; a sleepy southern town seething with scandal; and the ambiguous Olivia herself.Consummately mysterious and smokily sensual, Paper Doll is Parker and Spenser at their compelling best.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Tangents",
        "Authors": "By Bear, Greg",
        "Description": "A definitive overview of the work of a Hugo and Nebula Award-winning author presents a selection of stories that includes the Hugo and Nebula-winning \"Tangent\" and \"Blood Music,\" \"Sisters,\" \"Sleepside Story,\" and \"Dead Run\"",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    }
]