[
    {
        "Title": "Seven Kisses in a Row (Charlotte Zolotow Books (Paperback))",
        "Authors": "By MacLachlan, Patricia and Marrella, Maria Pia",
        "Description": "It&#39;s not fair, Emma thinks, for her parents to go away (for five whole days) and leave her with an aunt and uncle she hardly knows. What if they don&#39;t like children? But Aunt Evelyn and Uncle Eliot like Emma and her brother, Zachary, just fine. They also like rules. Rules about: Eating. Sleeping. Cleaning up. Messing up. Emma doesn&#39;t believe in rules. Not unless they&#39;re hers: Eating no broccoli, dead or alive. Sleeping: No sleeping in a room where night rumbles hide. Cleaning up: Don&#39;t. Messing up: Do. Emma can see that Aunt Evelyn and Uncle Elliot have a lot to learn about being parents. But that&#39;s okay---because Emma has five whole days in which to teach them.",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Midnight Lemonade",
        "Authors": "By Goethe, Ann",
        "Description": "Katherine Pierson, raised in the isolation of a Mississippi River town and educated in a convent school, careens into adulthood when she marries a man twelve years her senior. Nothing in her sheltered past prepares her for marriage, the subsequent responsibilities of motherhood, and the slow death of her warm, intelligent, spirited self. And when she decides to leave behind all that she knows, to grasp at a passion she has never known, nothing prepares her for the painful choice she will have to make.",
        "Category": " Fiction , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Mulan: The Highest Honor #3 My Princess Collection",
        "Authors": "By Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "DK Readers: MLB Strikeout Kings (Level 4: Proficient Readers)",
        "Authors": "By Buckley, James",
        "Description": "The MLB Readers give them exactly what they want: cool photographs and amazing facts to encourage reading. 1, 2, 3 strikes, you're out! Read how Randy Johnson, Pedro Martinez, and other pitchers mow 'em down! These 48-page books about fascinating subjects like pirates, mummies, and volcanoes are for proficient readers who can understand a rich vocabulary and challenging sentence structure. In addition to the stunning photographs, informative sidebars, and glossary, readers will find archival photographs and paintings. Averaging 4,500 to 5,000 words in length, Level 4 books are 40 percent pictures and 40 percent text. The Dorling Kindersley Readers combine an enticing visual layout with high-interest, easy-to-read stories to captivate and delight young bookworms who are just getting started. Written by leading children's authors and compiled in consultation with literacy experts, these engaging books build reader confidence along with a lifelong appreciation for nonfiction, classic stories, and biographies. There is a DK Reader to interest every child at every level, from preschool to grade 4.",
        "Category": " Juvenile Nonfiction , Readers , Chapter Books",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Hurray for Captain Jane!",
        "Authors": "By Reavin, Sam",
        "Description": "",
        "Category": "",
        "Publisher": "MacMillan Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1971"
        }
    },
    {
        "Title": "Nets to catch the wind,",
        "Authors": "By Elinor Wylie",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt, Brace and Company",
        "Price Starting With ($)": "17.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1921"
        }
    },
    {
        "Title": "Your Money or Your Life: Transforming Your Relationship with Money and Achieving Financial MORE",
        "Authors": "By Dominguez, Joe and Robin, Vicki",
        "Description": "Offers a nine-step program for living more meaningful lives, showing readers how to get out of debt, save money, reorder priorities, reserve inner conflicts, save the planet, and convert problems into opportunities. Reprint. 150,000 first printing. $100,000 ad/promo.",
        "Category": " Self-help , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Joel",
        "Authors": "By Lewis, Gregg and Sonnenberg, Joel",
        "Description": "Joel Sonnenberg was only two years old when an 18-wheeler smashed into his family's car. In the inferno that followed, he was burned on over 85 percent of his body. This is his story as only he can tell it.Experience the world from Joel's perspective as he takes you on a personal journey with more twists and turns than a Hollywood movie. It's been a life of both great struggles and of tremendous achievement and honor. Yet Joel asserts, 'I am just an ordinary person whom people find extraordinary.'  Be prepared to fall in love with a young man named Joel.  We have known Joel since he first moved to Montreat, North Carolina, eighteen years ago. What an incredible boy he was; what an incredible man he has become. His testimony will stir your heart and forever change you.Ruth and Billy GrahamJoel is a dear friend. His story is truly remarkable. I encourage everyone to read it. It is truly inspiring!Coach Mike Krzyzewski, Head Coach, Duke University BasketballJoel is an American hero. True courage is demonstrated in every page.Bob Dole, Former United States Senator, KansasThe dictionary doesn't have enough adjectives to describe my love and admiration for Joel Sonnenberg. To spend time with Joel---whether in his book, at a soccer game, or over a soda---is to come away a different person simply because you've been with him. Joni Eareckson Tada, Founder and CEO of Joni and FriendsJoel Sonnenberg's story is more than just an uplifting tale of persistence and achievement. Rooted in tragedy, it's the story of a mother's love, a boy's courage, and the resilience of the human spirit.Bryant Gumbel, Television News JournalistHis story is one all young people need to hear . . . optimistic, confident, and filled with faith. Dr. Jay Kesler, President Emeritus, Taylor University",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Appliqué quiltmaking: Contemporary techniques with an Amish touch",
        "Authors": "By Bass, Charlotte Christiansen",
        "Description": "",
        "Category": "",
        "Publisher": "ARCO",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Other People's Children",
        "Authors": "By Trollope, Joanna",
        "Description": "Joanna Trollope delves fearlessly into the emotional dynamics of family life - or rather, life in that ever-expanding unit, the stepfamily. There are the mothers - like Nadine, spurned, embittered, and trying desperately to hold on to her children any way she can; Elizabeth, the would-be stepmother, who only glimpses the shoals that lie ahead; Josie, the stepmother, who sees them all too clearly every day of her married life. There are the men, like Matthew, who must live with another man's son and without his own children; and Tom, torn between his own desires and what he believes he owes his daughter. And then there are the children, all battling to find a place for themselves in this new order they haven't chosen.With her sensitive eye and unerring ear, Trollope explores the hard-won truths and often harder-to-overcome difficulties of coping with present and former husbands and wives, and, above all, with other people's children.",
        "Category": " Fiction , Literary",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "In the Russian Style (A Studio Book)",
        "Authors": "By Onassis, Jacqueline Kennedy (EDT) and Onassi, Jacqueline K. (EDT)",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "The Viking Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "China: A History in Art",
        "Authors": "By Smith, Bradley",
        "Description": "National art treasures depict the evolution of Chinese culture between the Neolithic Age and the Industrial Revolution",
        "Category": " Travel , General",
        "Publisher": "Gemini Smith / Doubleday",
        "Price Starting With ($)": "6.01",
        "Publish Date": {
            "Month": "April",
            "Year": "1976"
        }
    },
    {
        "Title": "The Silent Passage",
        "Authors": "By Sheehy, Gail",
        "Description": "The best-selling reference for women presents the latest information in a candid and often humorous format, outlining a wide range of topics from early menopause to Chinese medicine and natural remedies. Reprint.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Countdown to Valentine's Day",
        "Authors": "By Huelin, Jodi and Haskamp, Steve (ILT)",
        "Description": "From ten colored valentines to one special kiss, readers will be delighted as they count their way through this brightly colored shaped paperback. Following a young child on Valentine's Day, this interactive book will not only reinforce counting skills, but its simple text will encourage solo reading. This holiday book is sure to be a hit with children and parents alike!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "And More by Andy Rooney",
        "Authors": "By Rooney, Andy",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1983"
        }
    },
    {
        "Title": "Resumes That Get Jobs Reed (Arco Resumes That Get Jobs)",
        "Authors": "By Reed, Jean",
        "Description": "Explains the components of a resume, and includes sample resumes for over 60 positions",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "9.98",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Golden Years",
        "Authors": "By Daugs, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Apple",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Your Four-Year-Old: Wild and Wonderful",
        "Authors": "By Ames, Louise Bates and Ilg, Frances L.",
        "Description": "What is it about four-year-olds that makes them so lovable? What problems do four-year-olds have?  What can they do now that they couldn't do at three? Drs. Ames and Ilg, recognized authorities on child behavior and development, discuss these and scores of other questions unique to four-year-old girls and boys, and they offer parents practical advice and enlightening psychological insights.Can Your Four-Year-Old make you a happier, less stressed, and more efficient parent? You bet! Find out about:• Embarrassing moments . . . how to deal with a four-year-old's fascination with bowel movements, belly buttons, body parts, and forbidden words—without turning red.• Words that will work a miracle . . . what to say to give your child and instant smile, raise self-esteem, and change behavior quicker than criticism.• Hyperactivity . . . how to determine if your “always on the go” four-year-old is truly hyperactive.• Kindergarten readiness . . . school too soon can cause lifelong problems, so note this warning for parents of “fall babies.”• Encouraging creativity . . . fifteen activities you can initiate to stimulate your child's natural talents and have a great time too!• Your child's body type: round and plump or bony and angular . . . does it predict behavior, temperament, and social success?. . . and more!",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "A Good Man Is Hard To  Find Unless You Ask God To Be Head Of Your Search Committee",
        "Authors": "By Pool, Jo Lynne",
        "Description": "Contains material previously published in A Celebration of Sex.",
        "Category": " Religion , Christian Life , Love & Marriage",
        "Publisher": "Thomas Nelson Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "The New American Poverty",
        "Authors": "By Harrington, Michael",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "On Becoming Baby Wise: The Classic Sleep Reference Guide Used by Over 1,000,000 Parents Worldwide",
        "Authors": "By Ezzo, Gary and Bucknam, Robert",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Parent-Wise Solutions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Great Political Wit: Laughing (Almost) All the Way to the White House",
        "Authors": "By Dole, Robert",
        "Description": "Bob Dole's political career may not have taken him to the White House, but he did pick up some great stories along the way. In this delightful collection, the longtime United States senator shares his favorite anecdotes, witticisms, and reminiscences.From the campaign trail to the Oval Office, from smoke-filled rooms to the chambers of the Capitol, Bob Dole surveys a century of political wit. There are bon mots from Calvin Coolidge, Winston Churchill, Harry Truman, John F. Kennedy, and a host of other political figures. Bob Dole introduces each section with mirthful moments from his own experience, displaying the gift for wry humor that has made him a favorite guest on late-night talk shows.A jovial--and completely bipartisan--compendium, Great Political Wit is a connoisseur's selection of political repartee at its best.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Stroke of Fortune (Lone Star Country Club)",
        "Authors": "By Rimmer, Christine",
        "Description": "The first novel in a new series, centering around the elegant Lone Star Country Club,  follows confirmed bachelor Flynt Carson, who stumbles upon an abandoned baby during a game of golf, as he turns to nanny Josie Lavendar, who opens his heart to the endless possibilities of love and family. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Dictionary of Wars",
        "Authors": "By Kohn, George C.",
        "Description": "Dictionary of Wars contains detailed summaries of all notable wars from earliest recorded history to the present day, spanning more than 4,000 years. It is an authoritative source of information on the global conflicts, civil wars, mutinies, punitive expeditions, undeclared wars, rebellions, and revolutions that have occurred throughout the world.",
        "Category": " Political Science , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Little Women (Little Apple Classics)",
        "Authors": "By Alcott, Louisa May, Magagna, Ann M., and Jambour, Louis (ILT)",
        "Description": "Little Women has remained enduringly popular since its publication in 1868, becoming the inspiration for a whole genre of family stories. Set in a small New England community, it tells of the March family: Marmee looks after her four daughters in the absence of her husband, who is serving as an army chaplain in the Civil War, and Meg, Jo, Beth, and Amy experience domestic trials and triumphs as they attempt to supplement the family's small income. In the second part of the novel (sometimes known as Good Wives) the girls grow up and fall in love.",
        "Category": "",
        "Publisher": "Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Silent Star",
        "Authors": "By Peterson, Tracie",
        "Description": "Facing the holidays with dread because of his job delivering telegrams during World War II, young Andy Gilbert finds himself harboring a death wish and finds hope and renewal from an elderly woman who offers him comfort and wisdom. Original.",
        "Category": " Fiction , Historical",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Guernica, the Crucible of World War II",
        "Authors": "By Thomas, Gordon",
        "Description": "",
        "Category": "",
        "Publisher": "Stein & Day Pub",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "November",
            "Year": "1975"
        }
    },
    {
        "Title": "Henry's happy birthday",
        "Authors": "By Keller, Holly",
        "Description": "",
        "Category": "",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Tale of Mrs. Tittlemouse",
        "Authors": "By Potter, Beatrix",
        "Description": "",
        "Category": "",
        "Publisher": "Warne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1938"
        }
    },
    {
        "Title": "Briar Rose",
        "Authors": "By Yolen, Jane",
        "Description": "It is an old, old tale, the German story of Briar Rose, the Sleeping Beauty. Now one of America's most celebrated writers tells it afresh, set this time in the forests patrolled by the German army during World War II. A tale of castles, of mists and thorns, of a beautiful sleeping princess, and an astonishing revelation of death and rebirth.A tale that will leave you changed forever.The tale of Briar Rose.",
        "Category": "",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "The Last Battle (Chronicles of Narnia, 7)",
        "Authors": "By Lewis, C. S. and Baynes, Pauline (ILT)",
        "Description": "A beautiful paperback edition of The Last Battle, book seven in the classic fantasy series, The Chronicles of Narnia, featuring cover art by three time Caldecott-winning illustrator, David Wiesner, and black-and-white illustrations by the series' original illustrator, Pauline Baynes. During the last days of Narnia, the land faces its fiercest challenge—not an invader from without but an enemy from within. Lies and treachery have taken root, and only the king and a small band of loyal followers can prevent the destruction of all they hold dear in this, the magnificent ending to The Chronicles of Narnia.The Last Battle is the seventh and final book in C. S. Lewis's classic fantasy series, which has been drawing readers of all ages into a magical land with unforgettable characters for over sixty years. A complete stand-alone read, but if you want to relive the adventures and find out how it began, pick up The Magician's Nephew, the first book in The Chronicles of Narnia.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "My Traitor's Heart",
        "Authors": "By Malan, Rian",
        "Description": "A former crime reporter who fled his country after witnessing unimaginable atrocities recounts his experiences on returning to find the truth behind apartheid",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Known World",
        "Authors": "By Jones, Edward P.",
        "Description": "Henry Townsend, a black farmer, bootmaker, and former slave, has a fondness for Paradise Lost and an unusual mentor -- William Robbins, perhaps the most powerful man in antebellum Virginia's Manchester County. Under Robbins's tutelage, Henry becomes proprietor of his own plantation -- as well as of his own slaves. When he dies, his widow, Caldonia, succumbs to profound grief, and things begin to fall apart at their plantation: slaves take to escaping under the cover of night, and families who had once found love beneath the weight of slavery begin to betray one another. Beyond the Townsend estate, the known world also unravels: low-paid white patrollers stand watch as slave \"speculators\" sell free black people into slavery, and rumors of slave rebellions set white families against slaves who have served them for years.An ambitious, luminously written novel that ranges seamlessly between the past and future and back again to the present, The Known World weaves together the lives of freed and enslaved blacks, whites, and Indians -- and allows all of us a deeper understanding of the enduring multidimensional world created by the institution of slavery.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Amistad",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Tenderwire",
        "Authors": "By Kilroy, Claire",
        "Description": "Brilliant, fast-paced, and highly suspenseful, Tenderwire tells the story of a reckless young musician and her obsession with a very old violin. Eva Tyne leaves her home in Ireland for New York to play in the New Amsterdam Chamber Orchestra. She collapses after her solo debut, checks herself out of the hospital prematurely, and embarks on a chaotic and dangerous odyssey. She falls in love with a mysterious man and becomes obsessed with a rare violin of dubious provenance, for which she must pay in cash. But consumed by obsession, her pursuit of the violin becomes a nightmare of paranoia: Haunted by the ghost of her father, racked with jealousy, and unsure whom she can trust, Eva is pitched into a desperate psychological conundrum as her desires threaten to destroy her.Narrated in Eva's unforgettable and unreliable voice, Tenderwire is a guessing game and a whodunit that surprises at every turn.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Make Your Contacts Count: Networking Know-How for Business and Career Success",
        "Authors": "By Baber, Anne and Waymon, Lynne",
        "Description": "Make Your Contacts Count is a practical, step-by-step guide for creating, cultivating, and capitalizing on networking relationships and opportunities. Packed with valuable tools, the book offers a field-tested \"Hello to Goodbye\" system that takes readers from entering a room, to making conversations flow, to following up. Updated from its first edition, the book now includes expanded advice on building social capital at work and in job hunting, as well as new case studies, examples, checklists, and questionnaires. Readers will discover how to: * draft a networking plan * cultivate current contacts * make the most of memberships * effectively exchange business cards * avoid the top ten networking turn-offs * share anecdotes that convey character and competence * transform their careers with a networking makeover Job-seekers, career-changers, entrepreneurs, and others will find all the networking help they need to supercharge their careers and boost their bottom lines.",
        "Category": " Business & Economics , Workplace Culture",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Everything You'Ve Heard Is Wrong",
        "Authors": "By Campolo, Tony",
        "Description": "\"This is a book about a way of doing business that works,\" says author Campolo. \"It is a refutation of those cynics who claim the values and principles laid down in the Bible mitigate against success in the dog-eat-dog world of commerce and industry.\" An ethical, biblical approach to business for a more satisfying and fulfilling career.",
        "Category": " Business & Economics , Motivational",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Man of My Dreams: A Novel",
        "Authors": "By Sittenfeld, Curtis",
        "Description": "“Being raised in an unstable household makes you understand that the world doesn’t exist to accommodate you, which, in Hannah’s observation, is something a lot of people struggle to understand well into adulthood.”–from The Man of My DreamsIn her acclaimed debut novel, Prep, Curtis Sittenfeld created a touchstone with her pitch-perfect portrayal of adolescence. Her prose is as intensely realistic and compelling as ever in The Man of My Dreams, a disarmingly candid and sympathetic novel about the collision of a young woman’s fantasies of family and love with the challenges and realities of adult life.Hannah Gavener is fourteen in the summer of 1991. In the magazines she reads, celebrities plan elaborate weddings; in Hannah’s own life, her parents’ marriage is crumbling. And somewhere in between these two extremes–just maybe–lie the answers to love’s most bewildering questions. But over the next decade and a half, as she moves from Philadelphia to Boston to Albuquerque, Hannah finds that the questions become more rather than less complicated: At what point can you no longer blame your adult failures on your messed-up childhood? Is settling for someone who’s not your soul mate an act of maturity or an admission of defeat? And if you move to another state for a guy who might not love you back, are you being plucky–or just pathetic?None of the relationships in Hannah’s life are without complications. There’s her father, whose stubbornness Hannah realizes she’s unfortunately inherited; her gorgeous cousin, Fig, whose misbehavior alternately intrigues and irritates Hannah; Henry, whom Hannah first falls for in college, while he’s dating Fig; and the boyfriends who love her more or less than she deserves, who adore her or break her heart. By the time she’s in her late twenties, Hannah has finally figured out what she wants most–but she doesn’t yet know whether she’ll find the courage to go after it. Full of honesty and humor, The Man of My Dreams is an unnervingly insightful and beautifully written examination of the outside forces and personal choices that make us who we are.From the Hardcover edition.",
        "Category": " Fiction , Coming of Age",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Stolen Blessings",
        "Authors": "By Sanders, Lawrence",
        "Description": "When Hollywood superstar Marilyn Taylor suffers the ultimate victimization, the resulting headlines threaten to blow the roof off Tinseltown",
        "Category": " Fiction , Thrillers",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "A Great Place to Work: What Makes Some Employers So Good (and Most So Bad)",
        "Authors": "By Levering, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Great Place to Work Insitute",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Christmas Dogs: A Literary Companion",
        "Authors": "By Berenson, Laurien (INT)",
        "Description": "",
        "Category": " Literary Collections , American , General",
        "Publisher": "Chamberlain Bros.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Song of the Exile (Ballantine Reader's Circle)",
        "Authors": "By DAVENPORT, Kiana",
        "Description": "In this epic, original novel in which Hawaii's fierce, sweeping past springs to life, Kiana Davenport, author of the acclaimed Shark Dialogues, draws upon the remarkable stories of her people to create a timeless, passionate tale of love and survival, tragedy and triumph, survival and transcendence. In spellbinding, sensual prose, Song of the Exile follows the fortunes of the Meahuna family—and the odyssey of one resilient man searching for his soul mate after she is torn from his side by the forces of war. From the turbulent years of World War II through Hawaii's complex journey to statehood, this mesmerizing story presents a cast of richly imagined characters who rise up magnificent and forceful, redeemed by the spiritual power and the awesome beauty of their islands.",
        "Category": " Fiction , Sagas",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Like Water for Chocolate: A Novel in Monthly Installments with Recipes, Romances, and Home Remedies",
        "Authors": "By Esquivel, Laura, Christensen, Carol, and Christensen, Thomas",
        "Description": "The bestselling phenomenon and inspiration for the award-winning film.Earthy, magical, and utterly charming, this tale of family life in turn-of-the-century Mexico blends poignant romance and bittersweet wit. This classic love story takes place on the De la Garza ranch, as the tyrannical owner, Mama Elena, chops onions at the kitchen table in her final days of pregnancy. While still in her mother's womb, her daughter to be weeps so violently she causes an early labor, and little Tita slips out amid the spices and fixings for noodle soup. This early encounter with food soon becomes a way of life, and Tita grows up to be a master chef, using cooking to express herself and sharing recipes with readers along the way.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Iguana Dreams: New Latino Fiction",
        "Authors": "By Poey, Delia and Suarez, Virgil (EDT)",
        "Description": "A collection of short fiction by Latino writers writing in English includes contributions by Mexican-American, Cuban-American, Puerto Rican, Chilean-American, and Dominican-American writers. By the author of The Cutter. Simultaneous. National ad/promo.",
        "Category": " Fiction , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Stop Telling, Start Selling: How to Use Customer-Focused Dialogue to Close Sales",
        "Authors": "By Richardson, Linda",
        "Description": "In this revised edition of her best-seller, noted sales consultant Linda Richardson offers salespeople the tools they need to successfully use customer-focused, dialogue selling. Featuring real-world dialogue samples, helpful dos and don’ts, self-tests, checklists, and other useful tools, this guide offers insight on every aspect of face-to-face selling, from the initial introduction through the needs identification and the negotiation of terms and price to the successful close, with prime emphasis on the six critical skills necessary to the dialogue-driven sales call: presence, rapport building, questioning, listening, product positioning, and checking.",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Color Purple",
        "Authors": "By Walker, Alice",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "Learned Optimism: How to Change Your Mind and Your Life",
        "Authors": "By Seligman, Martin E. P.",
        "Description": "Compiles scientific evidence that optimism is vital to overcoming defeat and exhibits how readers can learn the habit of optimism necessary for a successful and happy life. Reprint.",
        "Category": " Self-help , General",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Hot Target- Suzanne Brockmann",
        "Authors": "By Brockmann, Suzanne",
        "Description": "Bestselling author Suzanne Brockmann knows exactly what makes hearts  race and pulses pound: peril and passion. No one succeeds more brilliantly at blending  these exhilarating elements in breathtaking novels of men and women forced to grapple  with the deepest emotions and the highest risks. And there’s no better proof than Hot Target.  Like most  men of action, Navy SEAL Chief Cosmo Richter never learned how to take a vacation.  So when he finds himself facing a month’s leave, he offers his services to Troubleshooters  Incorporated. Founded by a former SEAL, the private-sector security firm is a major  player in the ongoing war against terrorism, known for carrying out covert missions  too volatile for official U.S. military action. But the first case Richter takes  on is anything but under the radar. High-profile maverick movie producer Jane Mercedes  Chadwick hasn’t quite completed her newest film, but she’s already courting controversy.  The World War II epic frankly portrays the homosexuality of a real-life hero–and  the storm of advance media buzz surrounding it has drawn the fury of extremist groups.  But despite a relentless campaign of angry E-mails, phone calls, and smear tactics,  Chadwick won’t be pressured into abandoning the project. Then the harassment turns  to death threats. While the FBI appears on the scene, nervous Hollywood associates  call in Troubleshooters, and now Chadwick has an army of round-the-clock bodyguards,  whether she likes it or not. And she definitely doesn’t. But her stubbornness doesn’ t make FBI agent Jules Cassidy’s job any easier. The fiercely independent filmmaker  presents yet another emotional obstacle that Cassidy doesn’t need–he’s already in  the midst of a personal tug-of-war with his ex-lover, while fighting a growing attraction  to Chadwick’s brother. Determined to succeed–and survive–on her own terms, Chadwick  will face off with enemies and allies alike. But she doesn’t count on the bond she  forms with the quiet, capable Cosmo Richter. Yet even as their feelings bring them  closer, the noose of deadly terror all around them draws tighter. And when all hell  erupts, desire and desperate choices will collide on a killing ground that may trap  them both in the crossfire.From the Hardcover edition.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Clay",
        "Authors": "By Blake, Jennifer",
        "Description": "Out of sheer desperation to save her daughter's life, Janna Kerr holds unscrupulous doctor Clay Benedict hostage in a secluded cabin in the Louisiana bayou until he agrees to help her, and soon, undeniable passion rages between them, but dangerous secrets threaten to tear them apart. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Mira",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Silver Bells",
        "Authors": "By Rice, Luanne",
        "Description": "The enchantment of the holidays meets the pure storytelling genius of New York Times  bestselling author Luanne Rice, as she presents readers with a special gift for the  season and a Christmas classic in the making…On a quaint, snowy Chelsea street,  librarian Catherine Tierney and a widowed Christmas tree seller from Nova Scotia  will rediscover the magic of the season where they least expect it:  in a chance  encounter that leads to a holiday surprise of love and hope powerful enough to last  a lifetime.",
        "Category": " Fiction , Women",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Little Bitty Lies: A Novel",
        "Authors": "By Andrews, Mary Kay",
        "Description": "“A delightful and hilarious tale.”—Chattanooga Times Free Press“Little white lies have never been so risky—or so much fun.”—Orlando SentinelNew York Times bestselling author Mary Kay Andrews delivers another treasure of a comic novel. Little Bitty Lies is a tantalizing tale about an abandoned Atlanta housewife and mother who tells one tiny white lie that sets her world spiraling outrageously out of control. This winning and wonderful romp focuses on about all the important things in life: marriage and divorce, mothers and daughters, friendship and betrayal. Throw in small town secrets, one woman’s lifelong quest for home, and the perfect chicken salad recipe, and you have an ideal escape for fans of Fannie Flagg, Jennifer Crusie, Adriana Trigiani, Emily Giffin, and the Sweet Potato Queens. No lie!",
        "Category": " Fiction , Women",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2012"
        }
    },
    {
        "Title": "The Story of Christianity, Volume 1: The Early Church to the Dawn of the Reformation (Story of Christianity)",
        "Authors": "By Gonzalez, Justo L.",
        "Description": "“This crisp retelling of Christian history from the days of the apostles to the eve of the Reformation is filled with insight.”— Mark A. Noll, Wheaton College The Story of Christianity, Volume 1 is a narrative history of Christianity, from the Early Church to the Dawn of the Reformation, from Justo L. Gonzalez, author of the highly praised three-volume History of Christian Thought.",
        "Category": " Religion , Meditations",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "Srimad Bhagavatam: First Canto \"Creation\"(Chapters 1-7)",
        "Authors": "By A. C. Bhaktivedanta Swami Prabhupada",
        "Description": "",
        "Category": " Health & Fitness , Yoga",
        "Publisher": "Bhaktivedanta Book Trust",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Scarlett: The Sequel to Margaret Mitchell's \"Gone With the Wind\"",
        "Authors": "By Ripley, Alexandra",
        "Description": "Come back to Tara...to Scarlett and Rhett...and to the greatest love story in all fiction. This is the book whose initial publication was an instant sensation: selling out immediately, setting new records, and enthralling readers all over the world. This is the book everyone wants to read, savor, and enjoy...",
        "Category": "",
        "Publisher": "Warner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Midnight Hour: A Novel",
        "Authors": "By Robards, Karen",
        "Description": "A time to fear....Grace Hart seemed to have it all: a bright, beautiful daughter, a successful career as a judge, and a lovely home in an Ohio suburb. But beneath the placid veneer, darker truths lie waiting. Her fifteen-year-old, Jessica, is teetering on the cusp of drugs and delinquency. And someone is stalking the troubled teenager. Someone who has already violated their home and stolen their peace of mind.A time to love....Now the police are involved. Grace is relieved--and worried. Is Jessica in danger from a drug dealer who wants to silence her? Detective Tony Marino is on the case. He's too close for comfort, asking disturbing questions, probing into her long-buried past, igniting feelings Grace has tried to suppress. In Tony's strong arms, Grace finds comfort, protection--passion--as he tries to shield them from the evil lurking just beyond their door....",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Beyond Pritikin",
        "Authors": "By Gittleman, Ann Louise",
        "Description": "Introduces a new diet and exercise regimen that emphasizes a low-fat, high-complex carbohydrate program that includes \"safe fat\" in the diet",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Letting Go: A 12-Week Personal Action Program to Overcome a Broken Heart",
        "Authors": "By Wanderer, Zev and Cabot, Tracy",
        "Description": "Are you crying over sad songs? Seeing his or her face in every crowd? Aching with loneliness and hoping the phone will ring? Feeling that no one else can give your life meaning? Losing a loved one is the most devastating crisis of intimate living. It can jeopardize your health . . . even your life. You might think only passing time will ease your pain, but now you can begin to end the hurt today. Within three months you can erase painful memories, regain control of your feelings, and be free to love again. Discover how to: • Short-circuit acute symptoms of grief and depression • Turn hurt into healthy anger• Fall out of love• Rebuild your self-esteem• Break the “sex hook” to your exMeet someone new and make that relationship really work! Here is the step-by-step, week-by-week program that has already helped thousands. Now you can learn how to survive a lost romance and regenerate your love life by . . . Letting Go.",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Pearl Cove (Donovan, Book 3)",
        "Authors": "By Lowell, Elizabeth",
        "Description": "Surrounded by potential enemies, Hannah McGarry faces the mystery of her husband's suspicious death, the prospect of bankruptcy ... and the disappearance of the fabulous Black Trinity necklace that was to be her financial security. Desperate, she calls Archer Donovan, a silent partner in Pearl Cove, her late husband's pearl farm venture. He might help her ... if the price is right.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Alf, the great Alfonso",
        "Authors": "By Doty, Eldon (ILT) and Ruth-Stephens, Roxanne",
        "Description": "",
        "Category": "",
        "Publisher": "Checkerboard Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Disney's Hercules: Friends and Foes (Golden Books)",
        "Authors": "By Cardona Studio (ILT) and Lundell, Margo",
        "Description": "Introduces characters in the film \"Hercules,\" including the Muses, Philoctetes, Pegasus, Megara, Hades, and various monsters",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Three Little Kittens/Super Shp (Look-Look)",
        "Authors": "By Golden Books",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Folly: A Novel",
        "Authors": "By Minot, Susan",
        "Description": "At a time when the choosing of a husband determines a woman's life, Lilian Eliot must decide between cool comfort or hot, passionate romance",
        "Category": " Fiction , Literary",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Nothing to Do (Sesame Street Growing-up Bks.)",
        "Authors": "By Alexander, Liza, Cooke, Tom (illustrator)",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books Publishing Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "King of the Beasties (Pooh) (Little Golden Books)",
        "Authors": "By Baker, Darrell (ILT) and Braybrooks, Ann",
        "Description": "In a storybook featuring Winnie the Pooh and his friends, Tigger crowns himself King of the Hundred-Acre Wood and turns everything upside down when he decides to paint the forest with orange and black stripes.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The White House Connection (Sean Dillon)",
        "Authors": "By Higgins, Jack",
        "Description": "The master of intrigue and suspense reunites the unforgettable team of his smash bestseller The President's Daughter to stop an unidentifed assassin--a woman who walks the streets of Manhattan, stalking the members of a secret politcal organization...and killing them, one by one.\"One heckuva heroine Awho? will keep you turning the pages.\"--Larry King, USA Today",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Clout",
        "Authors": "By Len O'Connor",
        "Description": "",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "March",
            "Year": "1976"
        }
    },
    {
        "Title": "The Vineyard",
        "Authors": "By Delinsky, Barbara",
        "Description": "New York Times bestselling author Barbara Delinsky has written her most complex and emotionally rewarding novel yet: a story of two women, a generation apart, each of whose dream becomes bound with the other's.  To her family, Natalie Seebring is a woman who prizes appearances: exquisitely mannered, a supportive wife, and head of a successful wine-producing enterprise. So when she announces plans to marry a vineyard employee mere months after the death of her husband of fifty-eight years, her son and daughter are stunned. Faced with their disapproval, Natalie decides to write a memoir.  Olivia Jones is a dreamer, living vicariously through the old photographs she restores. She and her daughter, Tess, cling to the fantasy that a big, happy family is out there just waiting for them. When Natalie hires Olivia to help with her memoir, a summer at Natalie's vineyard by the sea seems the perfect opportunity to live out that fantasy. But all is not as it seems.  As the illusion of an idyllic existence comes crashing headlong into reality, the lives of these two women, parallel in so many ways, become a powerful and moving story.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Running a One-Person Business",
        "Authors": "By Whitmyer, Claude",
        "Description": "",
        "Category": "",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Love Bugs: A Pop-Up Book",
        "Authors": "By Carter, David A. and Carter, David A. (ILT)",
        "Description": "A pop-up book for Love Bugs of all ages looks like a box of valentine chocolates with its heart shape--and sits nicely on a shelf--but it is perfect for gift givers of any age on all occasions.",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "I Can Fly (Little Golden Book)",
        "Authors": "By Golden Books",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "12.12",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Story of Miss Moppet (Potter 23 Tales)",
        "Authors": "By Potter, Beatrix",
        "Description": "",
        "Category": "",
        "Publisher": "Warne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1906"
        }
    },
    {
        "Title": "The Wall Street journal guide to understanding money & markets: Stocks, bonds, mutual funds, futures, money",
        "Authors": "By Wurman, Richard Saul, Siegel, Alan, Morris, Kenneth M.",
        "Description": "Presents an authoritative and comprehensive introduction to the financial world, offering a fully illustrated explanation of the financial pages and how to read them",
        "Category": "",
        "Publisher": "Access Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "From One Child to Two: What to Expect, How to Cope, and How to Enjoy Your Growing Family",
        "Authors": "By Dunn, Judy",
        "Description": "Most mothers and fathers are surprised at how different parenthood feels when the second child arrives. Even before the birth, a host of new questions arises: can you possibly love a second child as much as the first? Is it better to have them close in age or farther apart? What about sibling rivalry?In From One Child to Two, Judy Dunn gives parents all the information, emotional support, and reassurance they need to handle the stress -- and relish the joys -- of raising two children. An internationally recognized expert in the field of sibling relations, Dunn draws on her own decade-long study of siblings at home, as well as from extensive interviews and observations of parents and children.-- How the second pregnancy differs from the first-- How and when to break the news to the first child-- How to manage the days surrounding the birth, the hospital visit, and the crucial first month-- Being prepared for your firstborn's reaction to the new sibling by age group -- toddlers, preschoolers, or children in early elementary school-- How to cope with the new demands on your marriage-- The major milestones that families face together -- the changing role of fathers and grandparents, managing new schedules, and coping with parental burnout-- Sibling rivalry: what to do about fighting, when to intervene, and when it's supposed to get better!Whether you're contemplating a second child, expecting one any day, or trying to cope with the changing dynamics of your newly expanded family, From One Child to Two is an indispensable guide. Filled with common sense, down-to-earth, and eminently practical advice, this is the one parenting book that you will refer to again and again.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Lights! Camera! Action Dog! (Wishbone Mysteries)",
        "Authors": "By Butcher, Nancy",
        "Description": "",
        "Category": "",
        "Publisher": "Big Red Chair Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "The Book of Lights",
        "Authors": "By Potok, Chaim",
        "Description": "Gershon Loran, a quiet rabinical student, is troubled by the dark reality around him. He sees hope in the study of Kabbalah, the Jewish bok of mysticism and visions, truth and light. But to Gershon's friend, Arthur, light means something else, the Atom bomb, his father helped create. Both men seek different a refuge in a foreign place, hoping for the same thing....",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Thrill!",
        "Authors": "By Collins, Jackie",
        "Description": "Jackie Collins' most outrageous, erotically charged New York Times bestseller is a sexy, shaterring roller-coaster thrill ride!  From chic New York and the exclusive Hamptons to the hungry heart of L.A., this high-suspense tale pulses with deadly obsessions and relentless desires in the seemingly perfect world of a gorgeous film actress. She could have any man -- but the one she can't resist is a mysterious lover with a shadowed past. As their jolting affair skyrockets with electric passion, shocking secrets break through their hidden traps -- in a brilliantly twisting story that sparks with the explosive Jackie Collins touch.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Vermont Wilds: A Focus on Preservation",
        "Authors": "By Gardner, A. Blake and Gardner, Pauline",
        "Description": "",
        "Category": "",
        "Publisher": "Storey Books",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "A Painted House",
        "Authors": "By Grisham, John",
        "Description": "Until that September of 1952, Luke Chandler had never kept a secret or told a single lie. But in the long, hot summer of his seventh year, two groups of migrant workers — and two very dangerous men — came through the Arkansas Delta to work the Chandler cotton farm. And suddenly mysteries are flooding Luke’s world.A brutal murder leaves the town seething in gossip and suspicion. A beautiful young woman ignites forbidden passions. A fatherless baby is born ... and someone has begun furtively painting the bare clapboards of the Chandler farmhouse, slowly, painstakingly, bathing the run-down structure in gleaming white. And as young Luke watches the world around him, he unravels secrets that could shatter lives — and change his family and his town forever....",
        "Category": " Fiction , Coming of Age",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "The Perfect Summer (Hubbard's Point)",
        "Authors": "By Rice, Luanne",
        "Description": "Old friendships--and love--make all things new again.The acclaimed author of Safe Harbor and other New York Times bestsellers returns to the seaside, delving into the heart of a once happy family facing troubled waters.Bay McCabe relishes life’s simple pleasures, her children, her home by the sea. She has never forgotten the values of her Irish granny--the everyday happiness of family, good friends, and hard work. Bay and her husband, Sean, have weathered rough spells and moved on. Now a perfect summer, filled with the scent of beach roses, lies before them.Charming and ambitious, Sean splits his energy between the town bank, his old fishing boat, and the family he seems to adore--until he leaves his young daughter stranded after school. As troubling memories resurface, a phone call confirms that Sean is missing. So begins a season that will change everything. As the door to all Bay cherishes seems to close forever, another opens, and an old love steps through. Embraced by enduring friendships, Bay will discover the truth of who she is--what love is--and how life’s deepest mysteries are often those closest to home.",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "The Matarese Circle: A Novel",
        "Authors": "By Ludlum, Robert",
        "Description": "An international circle of killers, the Matarese will undoubtedly take over the world within just two years. Only two rival spies have the power to stop them: Scofield, CIA, and Talaniekov, KGB. They share a genius for espionage and a life of explosive terror and violence. But though these sworn enemies once vowed to terminate each other, they must now become allies. Because only they possess the brutal skills and ice-cold nerves vital to their mission: destroy the Matarese.Praise for Robert Ludlum and The Matarese Circle“A blockbuster . . . Ludlum’s best.”—The Wall Street Journal“A spellbinder.”—The Dallas Morning News“Ludlum stuffs more surprises into his novels than any other six-pack of thriller writers combined.”—The New York Times“Don’t ever begin a Ludlum novel if you have to go to work the next day.”—Chicago Sun-Times",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1983"
        }
    },
    {
        "Title": "What Kids Need to Succeed: Proven, Practical Ways to Raise Good Kids",
        "Authors": "By Galbraith, Judy, Espeland, Pamela, and Benson, Peter L.",
        "Description": "With over 220,000 copies in print, the original What Kids Need to Succeed is a proven best-seller. Communities across the nation have embraced its quick-read, common-sense suggestions for helping kids lead healthy, productive, positive lives and stay out of trouble. The first edition identified 30 Developmental Assets™ essential to promoting success and preventing at-risk behaviors. This revised, expanded, updated edition, based on findings from a recent nationwide survey conducted by Search Institute, includes the latest information on asset-building and expands the original 30 assets to 40. It describes new assets including caring neighborhoods, community service, integrity, cultural competence, and peaceful conflict resolution, then gives specific suggestions for building all 40 assets at home, at school, in the neighborhood, and in the faith community. With over 700 ideas to try, What Kids Need to Succeed makes anyone an asset-builder and a positive force in young people's lives.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Free Spirit Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Final Target (Wind Dancer)",
        "Authors": "By Johansen, Iris",
        "Description": "The President’s daughter...The women determined to save her...The man with the power to betray a nation...Melissa Riley arrives at her sister’s isolated Virginia country home to find herself plunged into a deadly drama. There the renowned Dr. Jessica Riley is attempting to draw the daughter of the President of the United States out of a severe catatonic trauma. The last thing young Cassie Andreas saw was an organized team ruthlessly murder her nanny and the Secret Service agents sworn to protect her. But to free Cassie, Melissa and Jessica must trust a mysterious, charismatic man.Michael Travis made his fortune in the international underworld. He risked everything to save Cassie during that terrible night of bloodshed. And he has entered into a secret bargain with the President. But is his show of concern all a treacherous charade? Melissa and Jessica have no choice but to accept Travis as their ally—and to follow a dangerous plan that will lead them into the world of a killer who’ll destroy anyone standing between him and the...Final Target.",
        "Category": " Fiction , Literary",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Changes: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "Top TV anchorwoman Melanie Adams had given up on love after a failed marriage and  an unhappy affair.  With her two teenage children and her television news career,  she had no room in her life for a man.  Then she met famous heart surgeon Peter Hallam,  a widower with three children of his own.  Suddenly Melanie was experiencing feelings  she thought were gone forever.  But two families (one in New York and one in Los  Angeles), two exciting careers, and two strong-willed people were too much to handle.   And Melanie faced a painful choice between her  glamorous life in the public eye,  her private life, the needs of her family, and the new family she took on.  Changes  lead each of them to new places, new problems, new people, and the new life they  begin.",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Secrets of Friendship (Secrets Gift Books)",
        "Authors": "By Walters, J. Donald",
        "Description": "",
        "Category": " Family & Relationships , Friendship",
        "Publisher": "Crystal Clarity Pubs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "The Cardinal of the Kremlin (Jack Ryan)",
        "Authors": "By Clancy, Tom",
        "Description": "Two men possess vital information on Russia's Star Wars missile defense system.One of them is CARDINAL -- America's highest agent in the Kremlin -- and he's about to be terminated by the KGB.The other one is the American who can save CARDINAL and lead the world to the brink of peace . . . or war.Here is author Tom Clancy's heart-stopping masterpiece -- a riveting novel about one of the most intriguing issues of our time.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Berkley Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "I Know What You Did Last Summer",
        "Authors": "By Duncan, Lois",
        "Description": "It was only an accident -- but it would change their lives forever. Last summer, four terrified friends made a desperate pact to conceal a shocking secret. But some secrets don't stay buried, and someone has learned the truth. Someone bent on revenge. This summer, the horror is only beginning....",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Count to Ten",
        "Authors": "By Golden Books Publishing Company",
        "Description": "Familiar Sesame Street characters introduce the numbers one to ten.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Walt Disney's The jungle book: Mowgli and the jungle animals (A First little golden book)",
        "Authors": "By West, Cindy",
        "Description": "",
        "Category": "",
        "Publisher": "Western Pub. Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Rachel's Holiday",
        "Authors": "By Keyes, Marian",
        "Description": "The fast lane is much too slow for Rachel Walsh. And Manhattan is the perfect place for a young Irish female to overdo everything. But Rachel's love of a good time is about to land her in the emergency room. It will also cost her a job and the boyfriend she adores.When her loving family hustles her back home and checks her into Ireland's answer to the Betty Ford Clinic, Rachel is hopeful. Perhaps it will be lovely—spa treatments, celebrities, that kind of thing. Instead, she finds a lot of group therapy, which leads her, against her will, to some important self-knowledge. She will also find something that all women like herself fear: a man who might actually be good for her.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Lust",
        "Authors": "By Minot, Susan",
        "Description": "",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Memories of Midnight",
        "Authors": "By Sheldon, Sidney",
        "Description": "In THE OTHER SIDE OF MIDNIGHT, they played the ultimate game of love, lust, and death.Now, in MEMORIES OF MIDNIGHT, the survivors meet to play one last time...Shadowed by tragedy and burdened by amnesia, a beautiful woman desperately tries to return to reality. She is Catherine Douglas, destined to once again challenge the cruel, charismatic power of Constantin Demiris, the Greek shipping tycoon who murdered Catherine's husband. Now, in the glittering capitals and carefree playgrounds of post-war Europe, Demiris sets his deadly sights on Catherine -- and the single, treacherous secret whose shattering truth is known to her alone...",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "For the Love of Marriage",
        "Authors": "By Drescher, John M.",
        "Description": "John Drescher brings together into one book his insights about marriage after many years of experience and counseling. His gentle advice and interesting, practical anecedotes fill this attractive book with warmth and encouragement.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Good Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "As a Gentleman Would Say: Responses to Life's Important (And Sometimes Awkward) Situations",
        "Authors": "By Bridges, John and Curtis, Bryan",
        "Description": "This easily accessible book focuses on those moments when knowing exactly what to say is an absolutely necessary challenge. From the light-hearted \"how to react when someone turns you down for a date\" or \"what to say when you notice someone's fly is open\" to the more serious \"what to say to a co-worker who has had a miscarriage or to a friend who has suffered the sudden death of a parent,\" AsA Gentleman Would Say differs from other etiquette books in that it not only offers suggestions for the correct thing to say in more than 100 social situations-it also gives examples of the wrong thing to say!",
        "Category": " Reference , Etiquette",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Basic Skills Reading Comprehension, Grade 4",
        "Authors": "By Thoman, Kim",
        "Description": "Reading Comprehension is designed to improve students' reading skills. These high-interest, fiction and non-fiction selections will spark the curiosity of your fourth graders. Each lesson includes a relevant comprehension activity,and most lessons have an optional extension that encourages creativity beyond the text. Use the selections for independent practice or whole group lessons when titles relate to a topic your class is studying.You may choose to place the lessons in a center and reproduce the answer key for self-checking.",
        "Category": " Education , Teaching Methods & Materials , Reading & Phonics",
        "Publisher": "Instructional Fair",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Garfield's A Good Friend Is",
        "Authors": "By Jim Davis",
        "Description": "",
        "Category": "",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "What's It Like to Be a Teacher",
        "Authors": "By Daniel, Kira",
        "Description": "Describes the many educational, supportive, and fun things one representative teacher does with and for the students in his class",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Army Wives",
        "Authors": "By Biank, Tanya",
        "Description": "Army Wives goes beyond the sound bites and photo ops of military life to bring readers into the hearts and homes of today's military wives. Biank tells the story of four typical Army wives who, in a flash, find themselves in extraordinary circumstances that ultimately force them to redefine who they are as women and wives. This is a true story about what happened when real life collided with army convention.Army Wives is a groundbreaking narrative that takes the reader beyond the Army's gates, taking a close look at the other woman—the Army itself—and how its traditions, rules and war-time realities deeply impact marriage and home life.",
        "Category": " Social Science , Customs & Traditions",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Living Out Loud",
        "Authors": "By Quindlen, Anna",
        "Description": "\"A books that brings a most refreshing message home with substance as well as style...Quindlen integrates memories of her childhood and observations of adulthood in such a way that make her just the sort of friend you wish you'd kept in touch with.\"BOSTON HERALDThe voice is Anna Quindlen's. But we know the hopes, dreams, fears, and wonder expressed in all her columns, for most of us share them. Now you can enjoy \"Life in the 30's\" anytime with the wonderful collection of essays and opinions in this volume. Other collections include OBJECT LESSONS and THINKING OUT LOUD.\"A reporter by training, a storyteller at heart, her writing is personal, humorous, and thought-provoking.\"SEATTLE POST-INTELLIGENCER",
        "Category": " Literary Collections , African",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "The Steel Wave: A Novel of World War II",
        "Authors": "By Shaara, Jeff",
        "Description": "Jeff Shaara, America’s premier author of military historical fiction, brings us the centerpiece of his epic trilogy of the Second World War. General Dwight Eisenhower once again commands a diverse army that must find its single purpose in the destruction of Hitler’s European fortress. His primary subordinates, Omar Bradley and Bernard Montgomery, must prove that this unique blend of Allied armies can successfully confront the might of Adolf Hitler’s forces, who have already conquered Western Europe. On the coast of France, German commander Erwin Rommel fortifies and prepares for the coming invasion, acutely aware that he must bring all his skills to bear on a fight his side must win. But Rommel’s greatest challenge is to strike the Allies on his front, while struggling behind the lines with the growing insanity of Adolf Hitler, who thwarts the strategies Rommel knows will succeed. Meanwhile, Sergeant Jesse Adams, a no-nonsense veteran of the 82nd Airborne, parachutes with his men behind German lines into a chaotic and desperate struggle. And as the invasion force surges toward the beaches of Normandy, Private Tom Thorne of the 29th Infantry Division faces the horrifying prospects of fighting his way ashore on a stretch of coast more heavily defended than the Allied commanders anticipate–Omaha Beach. From G.I. to general, this story carries the reader through the war’s most crucial juncture, the invasion that altered the flow of the war, and, ultimately, changed history.",
        "Category": " Fiction , War & Military",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Girl with the Crooked Nose: A Tale of Murder, Obsession, and Forensic Artistry",
        "Authors": "By Botha, Ted",
        "Description": "In The Girl with the Crooked Nose, Ted Botha tells the absorbing story of Frank Bender, a gifted, self-taught artist who can bring back the dead and the vanished through a unique, macabre sculpting talent. Bender has been the key to solving at least nine murders and tracking down numerous criminals. Then he is called upon to tackle the most challenging and bizarre case of his career.Someone is killing the young women of Juarez. Since 1993, the decomposing bodies of as many as four hundred victims, known as feminicidios, have been found in the desert surrounding this gritty Mexican border town. In 2003, prodded by local political pressure and international attention, the Mexican authorities turn to the United States to help solve these horrific crimes. The man they turn to is Bender. Through breathtakingly realistic sculptures, Bender reconstructs the faces of unknown murder victims or fugitives whose appearances are certain to have changed over years on the run. The busts are based in part on the painstaking application of forensic science to fleshless human skulls and in part on deep intuition, an uncanny ability to discern not only a missing face but also the personality behind it. Arriving in Mexico, Bender works in secrecy, in a culture of corruption and casual violence where the line between criminals and law enforcement is blurry, braving anonymous threats and sinister coincidences to give eight skulls back their faces and, hopefully, their histories. Drawn to one skull in particular–\"The Girl With the Crooked Nose\"–Bender gradually comes to suspect that perhaps he is not meant to succeed, and that the true solution to the mystery of the feminicidios is far more terrible than anyone has dared to imagine. Ted Botha brilliantly weaves Bender’s story–the cases he has solved, the intricacies of his art, the colorful characters he encounters, and the personal cost of his strange obsession–with the chilling story of the Juarez investigation. With a conclusion as shocking as its story is gripping, The Girl with the Crooked Nose will haunt readers long after the last page is turned. “…[a] crackling account of a quirky, maverick forensics artist, Frank Bender, and his largely successful efforts in facial reconstruction of murder victims…. extraordinary is Botha's writing, with his unerring depiction of Bender's painstaking work and the eventual unraveling of the brutal crimes it solves…. the tales in this book accurately capture the dark motives and complexities of senseless murder, and even the most savvy true-crime reader will not be able to resist the author's insightful storytelling.\"--Publishers Weekly",
        "Category": " Law , Forensic Science",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "wonders of nature",
        "Authors": "By Linsenmaier, Walter",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    }
]