[
    {
        "Title": "Doing Data Analysis with SPSS 10.0",
        "Authors": "By Carver, Robert H. and Nash, Jane Gradwohl",
        "Description": "A supplement for an introductory statistics course, enabling students to work independently to learn software skills outside of class and to understand underlying statistical concepts and techniques. Each session addresses a statistical issue and how to approach it with SPSS, rather than highlighting a particular feature of the software. Questions and challenges that illustrate the relevance of statistical reasoning are interwoven throughout. Nearly all data sets used are real, and reflect a variety of disciplines. The authors are affiliated with Stonehill College. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Mathematics , Probability & Statistics , General",
        "Publisher": "Duxbury Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Cases in bioethics: Selections from the Hastings Center report",
        "Authors": "By Levine, Carol",
        "Description": "Published by Trend Associates, Inc., 1125 NE 125th Street, Suite 204, North Miami, FL 33161. First impression is that this reference book is ready to be recycled itself: bad paper (though 100% recycled and  not  acidic) limp, dirty grey and fragile; and the binding is flimsy gloss stock. For this package Trend charges $.29 a page for pages with large type and large white (grey) spaces. Lists 2,700 contacts in 63 countries with address, phone, fax and occasional comment upon the subject's activity. Arranged by: continent and country; then lists associations, entities working with plastics, paper, glass, metals, textiles, tires; waste collectors equipment suppliers, manufacturers, consultants, universities, the media, conferences, legislators. Ads scattered throughout. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Trb, Views and Perspectives on the Presidency",
        "Authors": "By Strout, Richard Lee",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "How to Build Additions",
        "Authors": "By Beckstrom, Robert J.",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "American Pastels in the Metropolitan Museum of Art",
        "Authors": "By Bolger, Doreen, Fritzsche, Mary Wayne, and Hazzi, Jacqueline (CON)",
        "Description": "",
        "Category": "",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Searching for a God to Love",
        "Authors": "By Blake, Chris",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Adventist Book Center New Jersey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Detectionary: A Biographical Dictionary of Leading Characters in Mystery Fiction",
        "Authors": "By Roseman, M.",
        "Description": "Lists all major characters of detective fiction, providing information on their creators, their actions, the cases they were involved in, and their destinies",
        "Category": "",
        "Publisher": "The Overlook Press",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "99 Novels: The Best in English Since 1939- A Personal Choice",
        "Authors": "By Burgess, Anthony",
        "Description": "The novelist lists his selections of the ninety-nine best novels written in the past forty-five years and discusses each novel in a short essay that explains why he has chosen to include it",
        "Category": " Literary Criticism , General",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Like Father, Like Daughter (Spider-Girl, Vol. 2)",
        "Authors": "By DeFalco, Tom and Olliffe, Pat (ILT)",
        "Description": "Her name is May \"Mayday\" Parker, and she recently learned her father was the original Spider-Man.  The good news is that she's having the time of her life as she hones the amazing spider-like abilities she inherited from him.  The bad news is that some of her roughest, toughest battles lie ahead - against the likes of Ladyhawk, the Kingpin of Crime, Mr. Nobody, Crazy Eight...and her own parents?!   Collects SPIDER-GIRL #6-11.",
        "Category": " Juvenile Fiction , Comics & Graphic Novels , Superheroes",
        "Publisher": "Marvel Comics",
        "Price Starting With ($)": "8.9",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Students Guide To Core Curriculum: Core Curriculum Guide (Guides To Major Disciplines)",
        "Authors": "By Henrie, Mark C.",
        "Description": "",
        "Category": " Education , Curricula",
        "Publisher": "Isi Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Humanistic Tradition, Book 5: From Romanticism To Realism and The Nineteenth Century World",
        "Authors": "By Fiero, Gloria K.",
        "Description": "",
        "Category": " Philosophy , Movements , Humanism",
        "Publisher": "McGraw-Hill Companies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Minotaur (MythQuest, 1)",
        "Authors": "By Danko, Dan and Mason, Tom",
        "Description": "As Cleo stands helpless in the twentieth century, Alex is transported to ancient Crete to find a celebration surrounding the sacrifice of Theseus, when suddenly he realizes he is Theseus, and must battle the Minotaur to survive.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Skylark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Pacific Rising: The Emergence of a New World Culture",
        "Authors": "By Winchester, Simon",
        "Description": "Portrays the human side of the Pacific--its people, culture, history, and politics--and examines why the Pacific has reached preeminence",
        "Category": " History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "No Graves As Yet: A Novel of World War I",
        "Authors": "By Perry, Anne",
        "Description": "On a sunny afternoon in late June, Cambridge professor Joseph Reavley is summoned from a student cricket match to learn that his parents have died in an automobile crash. Joseph's brother, Matthew, as officer in the Intelligence Service, reveals that their father had been en route to London to turn over to him a mysterious secret document - allegedly with the power to disgrace England forever and destroy the civilized world. A paper so damning that Joseph and Matthew dared mention it only to their restless younger sister. Now it has vanished.What has happened to this explosive document, if indeed it ever existed? How had it fallen into the hands of their father, a quiet countryman? Not even Matthew, with his Intelligence connections, can answer these questions. And Joseph is soon burdened with a second tragedy: the shocking murder of his most gifted student, handsome Sebastian Allard, loved and admired by everyone. Or so it appeared.Meanwhile, England's seamless peace is cracking - as the distance between the murder of an Austrian archduke by a Serbian anarchist and the death of a brilliant university student by a bullet to the head becomes shorter with each day.",
        "Category": " Fiction , Historical",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Judgment Day",
        "Authors": "By Reinken, Patrick",
        "Description": "Judgment Day is a brilliant medical/legal thriller that dares to explore the unthinkable: an AIDS vaccine even more virulent than the disease and a drug company willing to kill to conceal it.When attorney Jon Patchett is asked by Weber BioTech to look into the apparent suicide of one of its researchers, Alexander Tomlin, the young lawyer knows the stakes are high: Weber fears the death will affect FDA approval of its new AIDS vaccine, Prohiva - approval that could save millions of lives and make millions of dollars. But Jon and his legal assistant, Anne Matheson, have no idea that they are about to uncover a diabolical plot more chilling than the fictional nightmare visions created by Robin Cook or the real-life headline-capturing ravages of viruses like Ebola.As Jon and Anne begin their investigation, they know that Weber is intent on making sure that nothing - including Tomlin's death - will interfere with the approval process. But the discovery of unexplained notes buried in boxes of documents, and then the death of Tomlin's secretary and lover, start them on a journey that leads to BioTech's laboratory in the southwest desert. There, they learn the truth: the company's top-secret Prohiva research included an experiment in human testing that has gone disastrously amok. And the pharmaceutical company is silently eliminating the victims to protect the secret.With the lies surrounding the vaccine beginning to unravel, Jon and Anne stumble into a race against time as Weber executives, in a frantic effort to eliminate all the evidence of their deadly research, close in on them...",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Samantha Learns A Lesson (A School Story Book 2)",
        "Authors": "By Adler, Susan S.",
        "Description": "",
        "Category": "",
        "Publisher": "Pleasant Company Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Exploring natural disasters (Eyes on adventure)",
        "Authors": "By Sands, Stella",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Better Homes and Gardens the Best-Ever Gift (A Max the Dragon Storybook)",
        "Authors": "By Better Homes and Gardens Staff",
        "Description": "When Max the dragon catches cold and has to stay in bed, his friend Elliot makes gifts that provide much-needed get-well medicine, with added ideas for creative activities",
        "Category": "",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Real People Don't Own Monkeys: And Other Stories of Pets, Their People and the Vets Who See It All",
        "Authors": "By Kiklevich, J. Veronika and Austad, Steven N.",
        "Description": "A veterinary instructor at Washington State Veterinary Hospital shares 21 amusing/dramatic/touching tales from her practice on treating pet owners as well as their menagerie of animals. Kiklevich's husband is a zoology professor at the U. of Idaho. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Pets , General",
        "Publisher": "Sourcebooks Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Literary Washington: A complete guide to the literary life in the nation's capital",
        "Authors": "By Cutler, David",
        "Description": "",
        "Category": " Travel , Reference",
        "Publisher": "Rowman & Littlefield",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Best American Spiritual Writing 2004",
        "Authors": "By Zaleski, Philip (EDT) and Miles, Jack (INT)",
        "Description": "Since its inception in 1915, the Best American series has become the premier annual showcase for the country's finest short fiction and nonfiction. For each volume, a series editor reads pieces from hundreds of periodicals, then selects between fifty and a hundred outstanding works. That selection is pared down to twenty or so very best pieces by a guest editor who is widely recognized as a leading writer in his or her field. This unique system has helped make the Best American series the most respected -- and most popular -- of its kind.   The latest addition to the esteemed Best American series is a collection of the best spiritual writing of the year, introduced by Pulitzer Prize-winning author Jack Miles and including both prose and poetry. Series editor Philip Zaleski has chosen the volume's pieces with an eye to spirituality's many guises, from its impact on personal relationships and the environment to politics, creativity, and literature. Christian, Muslim, Jewish, secular, and pan-Hindu perspectives are all represented in these pieces, which have been selected from both mainstream and more specialized periodicals.",
        "Category": " Fiction , Occult & Supernatural",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "kids are worth it!",
        "Authors": "By Coloroso, Barbara",
        "Description": "Barbara Coloroso's powerful message is that good parenting begins with treating kids with respect. It means giving them a sense of power in their own lives, and offering them opportunities to make decisions, take responsibility for their actions, and learn from their own successes and mistakes. Rejecting the \"quick fix\" solutions of punishment and reward, she uses everyday family situationsfrom sibling rivalry to teenage rebellion to demonstrate sound strategies for giving children the inner discipline and self-confidence that will help them grow into responsible, resourceful, and resilient adults. Discover:• Three basic tenets to a good parent/child relationship• Why discipline is not learned through threats and bribes• Why teaching a child how to think instead of what to think builds self-confidence• The good news about the strong-willed child• Three alternatives to always saying \"No\"• How to buffer your children from the dangers of sexual promiscuity, drug abuse, and other self-destructive behavior• Using mealtime, bedtime, toilet-training, chores, allowance, and sibling rivalry as opportunities to help children develop their own sense of inner discipline",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "HarpPeren",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Fundamentals of Financial Accounting (The Irwin Series in Undergraduate Accounting)",
        "Authors": "By Short, Daniel G.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Richard d Irwin",
        "Price Starting With ($)": "7.04",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Dark Knight Strikes Again, The - VOL 01 (Batman)",
        "Authors": "By Miller, Frank",
        "Description": "",
        "Category": " Comics & Graphic Novels , Superheroes",
        "Publisher": "DC Comics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Dewey Decimal System of Love",
        "Authors": "By Carr, Josephine",
        "Description": "Behind a french twist and sensible clothes, forty-year-old librarian Alison Sheffield hides an extravagant nature. But after last night, even her most proper attire can't disguise the signs-the pink cheeks, the extra-poufy hair, the bounce in her step. Alison Sheffield is in love.  The heart-palpitating, nausea-inducing, silly, inexplicable, absurd and pointless kind of love found in a romance novel. And for once in her life, what Alison needs to know she can't find in any reference book-she can only live it...",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "NAL Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Dream Me Home Safely: Writers on Growing Up in America",
        "Authors": "By Shreve, Susan Richards (EDT) and Edelman, Marian Wright (FRW)",
        "Description": "In the title essay of this extraordinary keepsake of childhood in America, John Edgar Wideman pays fierce tribute to a complex mother who \"used to dream me home safely by sitting up and waiting for me to stumble in.\" The young writer Bich Minh Nguyen remembers arriving in Michigan from Vietnam in 1975 and a classmate who said, \"Your house smells funny,\" and Michael Parker recalls a sister's vivid -- and hilarious -- act of defiance on a particular North Carolina evening in 1971. These and many more intensely intimate memories make Dream Me Home Safely a collection as diverse and powerful as all of American letters.",
        "Category": " Literary Collections , Essays",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "To the Lighthouse",
        "Authors": "By Woolf, Virginia",
        "Description": "To the Lighthouse features the serene and maternal Mrs. Ramsay, the tragic yet absurd Mr. Ramsay, and their children and assorted guests who are on holiday on the Isle of Skye. From the seemingly trivial postponement of a visit to a nearby lighthouse, Virginia Woolf constructs a moving examination of the complex tensions and allegiances of family life and the conflicts within a marriage.",
        "Category": "",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1978"
        }
    },
    {
        "Title": "Master Motivator: Secrets of Inspiring Leadership",
        "Authors": "By Hansen, Mark Victor and Batten, Joe D.",
        "Description": "Two of the world's most renowned and respected motivational speakers have joined forces to bring you the definitive book on motivating others. Joe Batten, mentor to Ross Perot and author of Tough-Minded Management, has teamed-up with Mark Victor Hansen, coauthor of the Chicken Soup for the Soul series, to show you how to inspire top performance from yourself and those you lead: how you can become The Master Motivator.The simple yet powerful steps detailed in this book will bring you the personal success you are striving for and transform your workers and your workplace.",
        "Category": " Business & Economics , Management",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Lancelot",
        "Authors": "By Percy, Walker",
        "Description": "",
        "Category": " Fiction , Literary",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1978"
        }
    },
    {
        "Title": "Little People Big Book About Bedtime",
        "Authors": "By Neil Kagan",
        "Description": "A collection of original stories, folktales, essays, questions and answers, poems, activities, and games relating to bedtime.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Surrendering to Marriage",
        "Authors": "By Krasnow, Iris",
        "Description": "The author of Surrendering to Motherhood offers a penetrating study of the complexities of modern marriage, examining the basic components of a successful marriage and the difficult work it requires to ensure a long-lasting relationship. Reprint. 50,000 first printing.",
        "Category": " Family & Relationships , Marriage",
        "Publisher": "Miramax",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The American Century",
        "Authors": "By Evans, Harold, Buckland, Gail, and Baker, Kevin",
        "Description": "\"In a style at once trenchant and easygoing, Harold Evans leads us on a walk through the century now drawing to a close, taking us back over ground that far too many of us have let slip from our memories.\"--Shelby Foote, author of The Civil WarThe American Century is an epic work. With its spectacular illustrations and incisive and lucid writing, it is as exciting and inspiring as the hundred years it surveys. Harold Evans has dramatized a people's struggle to achieve the American Dream, but also offers a thoughtful and provocative analysis of the great movements and events in America's rise to a position of political and cultural dominance. There are 900 photographs, several hundred brought to light for the first time, and the richly researched narrative offers many surprises.In 1889, when the United States entered the second hundred years of its existence, it was by no means certain that a nation of such diverse peoples, manifold beliefs, and impossible ideals could survive its own exceptional experiment in democracy or manage to avoid a headlong slide into oblivion. Evans describes what happened to the democratic ideal amid the clash of personalities and the convulsions of great events. Here are assessments of the century's nineteen presidents, from Benjamin Harrison, who brought the Stars and Stripes into American life in 1889, to the movie star who waved it so vigorously a hundred years later. Here are the muckrakers who exposed the evils of rampant capitalism, and the women who fought to make a reality of the rhetoric of equality. Here are the robber barons--the Carnegies, the Rockefellers, and the Morgans -- carving out great empires of unparalleled wealth, turning their millions into foundations for public benefit. Here are Al Capone and J. Edgar Hoover, Martin Luther King Jr. and the Ku Klux Klan, Joe McCarthy and Dwight Eisenhower. Here is the American heartland at peace (but on the wagon), America in two world wars, and at war with itself in the sixties.Evans analyzes the central questions of the era. Among them: How did the tradition arise that government should not meddle in business? How did anti-colonial America become an imperial power? How much was democracy threatened by the influence of money? What was the nature of American isolationism? Why did Woodrow Wilson take the United States into World War I? What caused the Great Depression, and why did it last so long? Did Franklin Roosevelt's New Deal succeed or fail? Did the protests of the sixties go too far? Was Vietnam a noble cause? Has the Watergate scandal been blown up out of all proportion? Who deserves the credit for the end of the Cold War?Throughout, Harold Evans lets us see how America prospered because of the power of an idea: the idea of freedom. The nation did not simply become the largest economic and military power, send men to the moon and jeans and consumer capitalism to Red Square--it strengthened Western society through acts of courage, generosity, and vision unequaled in history.The British may claim the nineteenth century by force, and the Chinese may cast a long shadow over the twenty-first, but the twentieth century belongs to the United States. This is America's story as it has never been told before.With 900 photographs",
        "Category": " History , United States , 20th Century",
        "Publisher": "Knopf",
        "Price Starting With ($)": "9.87",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Frontiers of Space Exploration (Greenwood Press Guides to Historic Events of the Twentieth Century)",
        "Authors": "By Launius, Roger D.",
        "Description": "From the first experimentation with rocket technology in the early 20th century to the Mir space station and the Mars Pathfinder mission of 1997, this one-stop guide to space exploration provides a wealth of information for student researchers. Combining narrative description, analytical essays, a timeline, biographical profiles, and the text of key primary documents, Roger D. Launius, Chief Historian of NASA, provides the latest information and analysis on all aspects of space exploration. Four essays give a historical overview of space exploration and up-to-date examinations of the race to the moon, exploration of the solar system, space stations and space shuttles, and U.S.-Soviet cooperative ventures. Ready reference features include: a timeline of key events; biographical profiles of 24 American and Soviet space pioneers; the text of 20 key primary documents relating to space exploration initiatives; a table of American space flight since 1961; and an annotated bibliography of works on space history.",
        "Category": " Technology & Engineering , Aeronautics & Astronautics",
        "Publisher": "Greenwood",
        "Price Starting With ($)": "5.46",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Basic Essentials of First Aid for the Outdoors (Basic Essentials Series)",
        "Authors": "By Forgey, William W.",
        "Description": "Covers wounds, abdominal pain, sprains, fractures, dislocations, bites, stings, hypothermia, heat exhaustion, and water purification.",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "The Blueprint for My Girls: How to Build a Life Full of Courage, Determination, & Self-love",
        "Authors": "By Shiraz, Yasmin",
        "Description": "Have you ever wished that someone had told you ahead of time how a problem could be avoided?  Do you feel like no one understands where you're coming from?  Now there's a blueprint that can offer you comfort, motivation, and real solutions.  When Yasmin Shiraz launched Mad Rhythms, a hip-hop magazine aimed at college students, she visited youth organizations and colleges across the country to teach young people how to effectively pursue their dreams. Drawn to Yasmin's confidence and determination, young women in particular sought her opinion on topics such as body image, popularity, dating, sexuality, child-parent relationships, and social and academic pressures. Yasmin could easily speak to those issues. She struggled with many of the same concerns when she was younger.  Inspired by the common threads connecting each generation, Yasmin developed The Blueprint for My Girls to help young women discover who they are, develop a sense of self, and stay positive. In the book, Yasmin pairs her personal stories with 99 \"expressions\" designed to help readers deal with situations they may not feel comfortable discussing with friends and family. Each expression is accompanied by exercises to help readers progress on their journey.  Staying real without being preachy, The Blueprint for My Girls will be a solution giver, a problem solver, and a friend in need for generations to come.",
        "Category": " Self-help , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The Over-Scheduled Child: Avoiding the Hyper-Parenting Trap",
        "Authors": "By Coles, Robert, Wise, Nicole, and Rosenfeld, Alvin",
        "Description": "Do you find yourself asking \"Whose life is it anyway?\" Parenting today has come to resemble a relentless to-do list. Even parents with the best intentions strive to micro-manage every detail of their kids' lives and live in constant fear that their child will under-perform in any area--academic, social, athletic. Lists and schedules, meetings and appointments invade our every moment and the need to be the best dominates--and undermines--our own sense of self as well as our children's. In this groundbreaking new book, renowed child psychiatrist Alvin Rosenfeld, M.D., and longtime family-issues journalist Nicole Wise combine personal and professional experience to take action against what they see as our overeager pursuit of perfection. The clear, comforting steps they prescribe to attack this rampant phenomenon will promote healthier and happier children and revitalize the parenting experience.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Day Christ Was Born: The True Account of the First 24 Hours of Jesus's Life",
        "Authors": "By Bishop, James Alonzo",
        "Description": "A reissue of the classic retelling of the Nativity. \"Written with dignity, unerring taste, and with no straining for effects.\"--Chicago Sunday Tribune",
        "Category": " Religion , Christianity , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Wedding Workout: Look and Feel Fabulous on Your Special Day",
        "Authors": "By Effinger, Tracy and Rowen, Suzanne",
        "Description": "A celebrity trainer shares shape-up secrets for a fit and fabulous bride Before you even walk down the aisle, you have made the really important vow­­to fit into your dress and look fabulous for the flashbulbs (oh, and your fiancé) on the big day. Now celebrity fitness trainer Tracy Effinger and bride-to-be Suzanne Rowen have created a surefire shape-up guaranteed to produce results whether you have six months, three months, or only six weeks until the nuptials. Their innovative Wedding Workout is fun and effective, designed to help you lose the necessary inches without losing your sense of humor or perspective. They've even included exercises that incorporate your fiancé in the fitness plan. Other program highlights include: Body-type recognition activities based on engagement ring \"cuts\"  Exercises to improve posture and poise  Targeted workouts focusing on key body areas featured by the bridal gown  Achieving a bikini-ready honeymoon body  Stress-reducing activities, foods, and reflections",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Better Homes and Gardens: Lawns : The Gardener's Collection (BETTER HOMES AND GARDENS THE GARDENER'S COLLECTION)",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Describes how to plant a new lawn or maintain an old lawn, offers troubleshooting tips, suggest various ground covers as an alternative to lawns, and lists common grasses and ground covers",
        "Category": " Gardening , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Getting Pregnant: What You Need To Know Right Now",
        "Authors": "By Lauersen, Niels H. and Bouchez, Colette",
        "Description": "Whether you are young and fertile, over forty and having trouble conceiving, or anywhere in between, here is the best resource to help you get pregnant.The only must-have fertility book, Getting Pregnant, completely revised and updated, not only addresses the needs of those who cannot conceive but serves as the ultimate guide for anyone planning to have a baby, now or in the future. Addressing the newest, state-of-the-art medical treatments for infertility, Getting Pregnant gives you all the latest news on: -eight brand-new fertility drugs -donor eggs and donor sperm -a new 15-minute in-office surgery that can double conception odds -breakthrough technologies for preventing chronic miscarriage -how both sex and lifestyle factors affect fertility, including the \"Nine to Five\" guide for protecting your reproductive health on the job Getting Pregnant also provides a wealth of practical information about the exercises, foods, and supplements that encourage a faster, healthier conception, as well as brand-new, all-natural techniques that influence the gender of your child. You'll also find a helpful six-month personal pregnancy planner that addresses all of your pre-conception health and medical needs. Don't miss the new chapters that focus on protecting, increasing, and extending fertility, while new frontiers in both the treatment of male fertility and the science of motherhood are explored.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Best American Poetry 1998",
        "Authors": "By Lehman, David (EDT) and Hollander, John (EDT)",
        "Description": "The appearance of The Best American Poetry every September is an eagerly awaited rite of fall -- as evidenced by soaring sales and terrific reviews. The popularity of the series is \"ample proof that poetry is thriving\" (The Orlando Sentinel), and this year's volume will dazzle and delight, instruct and inspire. Under the guiding vision of master poet John Hollander -- one of America's most erudite literary minds -- The Best American Poetry 1998 spotlights the imaginative power and insight of our finest poets at the fin-de-siècle. Diverse in form and method, the poems display an unwavering nobility of expression, maintaining the uncompromising artistic standards essential to The Best American Poetry tradition as it enters its second decade. With a foreword by series editor David Lehman and with comments from the poets illuminating their work, The Best American Poetry 1998 will lead you on an exhilarating and inspiring literary adventure.",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Blown Away: American Women and Guns",
        "Authors": "By Kelly, Caitlin",
        "Description": "A controversy that has divided America for decades. A decision more women must confront every day.  In the long-standing and heated debate between gun-control advocates and supporters of the Second Amendment, the perspective of women has often been overlooked in what most perceive to be the \"masculine\" world of firearms. This is the subject journalist Caitlin Kelly was motivated to explore after she was threatened by a stalker and contemplated acquiring a gun for her own protection.  Through interviews and firsthand accounts, Kelly probes the many issues affecting women who own guns and influence gun policies, to those whose lives are most affected by gun violence, and our society's conflicted views on women who acquire guns for sport and self-defense. Voices include activists and legislators such as Representative Carolyn McCarthy, whose husband and son were the victims of a shooting rampage; Patty Varone, who served Rudy Giuliani as a bodyguard for nine years; Mary Leigh Blek, founder of the Million Mom March; and Paxton Quigley, a modern-day Annie Oakley who teaches women how to shoot in the name of empowerment -- as well as insights on guns and violence from such high-profile women as Halle Berry, Madonna, and the late Katharine Graham.  Brutally frank in its description, yet balanced in its analysis, Blown Away is an up-close and unflinching look at guns in America -- and the women who live with them.",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Clearing the Aisle",
        "Authors": "By Schwartz, Karen",
        "Description": "They're getting hitched.  When Rachel Silverstein and her longtime boyfriend Dan Gershon decide to get engaged, they hardly expect that planning a wedding will be more difficult than any life changes they've braved in the five years they've been dating. After all, they already live together. But suddenly everyone from parents to friends to cousins to caterers seems to be losing their minds completely. Surely it can't all be in Rachel's head. Can it?  She's going insane.  Between her budget-crazed father, her flighty mother, her stepmother, her seemingly perfectly well-meaning in-laws, and a fiancé who's suddenly questioning the very institution of marriage, Rachel's barely holding it together. If the guest-list wars and menu battles don't kill her, the dress-shopping will. And what's it going to take for Dan to step up and realize that his beloved future bride needs his help coping with the madness if she's ever going to make it to the altar?",
        "Category": " Fiction , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Men in Black Dresses: A Quest for the Future Among Wisdom-Makers of the Middle East",
        "Authors": "By Seng, Yvonne, Ph.D.",
        "Description": "If we pause long enough, we can hear, above the din of our planet's rapid globalization and technological advancement, the quiet voices of spiritual leaders from ancient faiths. Middle East historian Yvonne Seng asks, What can these modern Desert Fathers with their long history of survival advise us on the future of our planet? Her intellectual quest rapidly becomes a personal journey that turns her Western training and perceptions on their head.  Men In Black Dresses takes the reader behind the walls of desert monasteries, Sufi enclaves, ancient cathedrals and mosques -- where the author knocks, uninvited, and waits for the wise men to allow her in. Once inside, they discuss the universal concerns of the environment and the Internet, the building of a global community, and the education of coming generations, as well as the state of the human spirit.",
        "Category": " Religion , Comparative Religion",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "American Pit Bull Terriers (Animal Planet® Pet Care Library)",
        "Authors": "By Gewirtz, Elaine Waldorf",
        "Description": "Discover how to handle the active lifestyle of American Pit Bull Terriers in this speical guide, which also calls into question several common myths about this energetic breed. TFH Publications, Inc. has teamed up with Animal Planet, the only television network devoted to the unique bonds between humans and animals, to present an exciting new series of comprehensive guides to superior pet care. Each book in the Animal Planet Pet Care Library offers incredible value, featuring 112 pages of all-new, current information from pet care and animal experts—with a family-friendly design, over 60 full-color photographs, and helpful tip boxes. Also included is advice on feeding, housing, grooming, training, health care, and fun activities.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "T.F.H. Publications, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Eat Chocolate Naked: And 142 Ways Other Ways to Attract Attention and Spark Romance!",
        "Authors": "By Johnson, Cam",
        "Description": "Ignite the fires of passion and romanceWant more romance, spark and passion in your life? Here's how to ignite it yourself and find sizzling ways to fill every day with romance. Whether you're after the ultimate seduction or a more intimate connection with your partner, included are hot tips and tricks for 143 sexy, silly, passionate and just plain fun activities to add spice to your love life.Your can:-Recognize romance in the most unlikely guises.-Make it easy for him to get it right.-Think about romance in a whole new way.-Create a mood, from soft and serene to brimming with sexiness.-Discover everything that attracts lovers to each other.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Sourcebooks Casablanca",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Workouts That Work for Women Who Work",
        "Authors": "By Pearlman, Barbara",
        "Description": "Suggests brief morning exercise routines, and includes workout advice for women who are seat-bound, work on their feet, travel, or slump and slouch",
        "Category": " Health & Fitness , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Wingman On Ice (Matt Christopher Sports Classics)",
        "Authors": "By Christopher, Matt and Lidbeck, Karin (ILT)",
        "Description": "Tod is sure his new hockey stick will improve his game. But when his team loses, he realizes that good stickhandling needs practice as well as good equipment. He vows not to use the stick until he deserves it, but will he earn that right this season?",
        "Category": " Juvenile Fiction , Sports & Recreation , Winter Sports",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Wine Spectator's: The Essentials Of Wine",
        "Authors": "By Steiman, Harvey",
        "Description": "The experts at Wine Spectator magazine contribute their knowledge and insight to this ultimate resource for oenophiles. Every page is packed with information on grape varieties, winemaking techniques, styles, flavors, and prices. With full-color photographs throughout, this handy guide also includes professional advice on shopping for wine, setting up tastings, and maintaining a wine cellar, as well as opinions from some of the world's most prominent wine authorities.",
        "Category": " Cooking , Beverages , Wine & Spirits",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "2500 Jokes to Start'Em Laughing",
        "Authors": "By Orben, Robert",
        "Description": "",
        "Category": " Humor , Form , Jokes & Riddles",
        "Publisher": "Wilshire Book Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "Singin' and Swingin' and Gettin' Merry Like Christmas",
        "Authors": "By Angelou, Maya",
        "Description": "Memoirist, novelist, poet, and dramatist, Maya Angelou is one of the best-loved writers of our time.  She is widely acclaimed for her searing, inspiring writings--and she has been praised for confronting both the racial and sexual pressures on black women, and for infusing her work with a perspective on larger social and political movements, including civil rights. In the volumes of her bestselling personal story--one of the most remarkable narratives ever shared--Maya Angelou writes about the struggles and triumphs of her extraordinary life with candor, humor, poignancy, and grace. These include: I Know Why the Caged Bird Sings The classic autobiography of her young years. Gather Together In My Name The coming-of-age story of her struggle for survival as a young unwed mother.   Singin' and Swingin' and Gettin' Merry Like Christmas The saga of her show business career, her failed marriage, and her early motherhood. The Heart of a Woman The turbulent story of her emergence as a writer and a political activist. Wouldn't Take Nothing For My Journey Now Her exhilarating collection of wisdom, spirituality, and life lessons.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "Vintage Stuff",
        "Authors": "By Sharpe, Tom",
        "Description": "Peregrine Clyde-Browne's tendency to take literally every expression he hears drives both his parents and teachers crazy",
        "Category": " Fiction , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "The Executioner - Cleveland Pipeline #30",
        "Authors": "By Don Pendleton",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Lead to Succeed: 10 Traits of Great Leadership in Business and Life",
        "Authors": "By Reynolds, Bill and Pitino, Rick",
        "Description": "Learn how to be a leader from one of sports' greatest teachers, Rick Pitino.As Rick Pitino says, great leaders aren't born great; they learn great leadership along the path of life. From the time Pitino first became a coach at twenty-four, he has been a student of leadership in all its forms, studying how great leaders from legendary coaches to American presidents to world humanitarians are able to inspire and motivate others. He discovered that all leaders, on the court and off, in business, politics, or civil rights, have certain qualities in common; these leaders share key traits that make people want to listen to them and follow them.Now, in Lead to Succeed, Rick Pitino shares the ten traits of great leadership he discovered and has cultivated in himself, and shows readers how they, too, can become leaders in their business and personal lives. As the former coach of the Kentucky Wildcats who turned the team around from probation status to a 1996 NCAA championship, Pitino relates stories of this experience, and other leadership lessons from his career.When Rick Pitino joined the Boston Celtics in 1997, he took on the biggest challenge of his professional life, becoming not only head coach but also president of the Celtics. In addition to coaching professional athletes with multimillion-dollar contracts, he was assuming a leadership role of an organization saddled with salary cap problems, limited talent, misfortune in the draft lottery, and bombarded by adversity on all sides. Facing these adversities, Pitino has relied on a leadership strategy based on his years of learning from leaders around him and from his own mistakes and successes.Leading isn't about being a dictator; nor is it about people-pleasing. As Pitino shows in Lead to Succeed, leadership is about communication, consistency, and selflessness. In addition to illustrating how these traits apply in a variety of business situations, Pitino addresses these issues: How you can be an effective business leader and still be honest When it's best not to delegate How the past can hurt you How to get your team out of a slumpWhile Pitino has had great success with his players, he has also convinced thousands of people in companies across America that his leadership message applies in the workplace as well. Lead to Succeed is for anyone who wants to inspire and motivate others--be it your employees or colleagues, or members of an organization you belong to, or your family. A perfect book for executives, managers, and sports fans, Lead to Succeed can make great leadership within reach.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Emma (Wordsworth Classics)",
        "Authors": "By Austen, Jane",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Robert W. Service: Best Tales Of The Yukon",
        "Authors": "By Service, Robert W.",
        "Description": "Verses chronicling the Klondike gold rush and immortalizing the colorful characters of the Yukon Territory, chosen from the author's earlier collections \"The spell of the Yukon\" and \"Ballads of a Cheechako\".",
        "Category": "",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "When You Lose a Loved One",
        "Authors": "By Allen, Charles Livingstone",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "Corduroy's Easter Party",
        "Authors": "By Freeman, Don, McCue, Lisa (ILT), and Grosset & Dunlap (COR)",
        "Description": "What better time for Corduroy and friends to throw a party? They've got their Easter candy, they've bought their Easter hats,  and they've dyed their Easter eggs. Now they are just waiting on one special long-eared guest. Will the Easter bunny show?",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Elegy for Iris",
        "Authors": "By Bayley, John",
        "Description": "With remarkable tenderness, John Bayley recreates his passionate love affair with Iris Murdoch--world-renowned writer and philosopher, and his wife of forty-two years--and poignantly describes the dimming of her brilliance due to Alzheimer's disease. Elegy for Iris is a story about the ephemeral beauty of youth and the sobering reality of what it means to grow old, but its ultimate power is that Bayley discovers great hope and joy in his celebration of Iris's life and their love. In its grasp of life's frailty and its portrayal of one of the great literary romances of this century,Elegy for Iris is a mesmerizing work of art that will be read for generations.With remarkable tenderness, John Bayley recreates his passionate love affair with Iris Murdoch--world-renowned writer and philosopher, and his wife of forty-two years--and poignantly describes the dimming of her brilliance due to Alzheimer's disease. Elegy for Iris is a story about the ephemeral beauty of youth and the sobering reality of what it means to grow old, but its ultimate power is that Bayley discovers great hope and joy in his celebration of Iris's life and their love. In its grasp of life's frailty and its portrayal of one of the great literary romances of this century,Elegy for Iris is a mesmerizing work of art that will be read for generations.",
        "Category": " Fiction , Media Tie-In",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "God's Promises for the Graduate",
        "Authors": "By Countryman, Jack",
        "Description": "With this book you will honor your high school and college graduates and you will equip them for life. Students will find passages on a variety of topics including: What to do when you are walking far from God; What to do when you are all alone; and What you can do to please God. There is also a special section of passages about God's plan for salvation.",
        "Category": " Religion , Biblical Reference , Quotations",
        "Publisher": "Word Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Your Gut Feelings: A Complete Guide to Living Better with Intestinal Problems",
        "Authors": "By Janowitz, Henry D., M.D.",
        "Description": "",
        "Category": "",
        "Publisher": "Consumers Union",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Arthritis: Questions You Have...Answers You Need",
        "Authors": "By Moyer, Ellen",
        "Description": "",
        "Category": " Medical , Rheumatology",
        "Publisher": "Peoples Medical Society",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Hallmark Keepsake Ornaments (A Collector's Guide: 1973 - 1993 - The First Twenty Years)",
        "Authors": "By Scroggins, Clara Johnson",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark",
        "Price Starting With ($)": "8.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "MLA Handbook for Writers of Research Papers",
        "Authors": "By Gibaldi, Joseph",
        "Description": "Deals with writing, documenting sources, preparing manuscripts, and constructing bibliographical entries",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Modern Language Assn of Amer",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Animal Husbandry",
        "Authors": "By Zigman, Laura",
        "Description": "New cow...Ray makes the move. Jane feels the rush. Ray says the L-word. Jane breaks her lease. Then suddenly, inexplicably, he dumps her. Just. Like. That....old cow.Now black is the only color in Jane's closet and Kleenex is clinging to her nose. Why did it happen? How could it have happened? Moo.Jane is going to get an answer. Not from Ray. Not from her best friends, David and Joan. But from an astounding new discovery of her own: The Old-Cow-New-Cow theory. Forced to move into the apartment of a womanizing alpha male named Eddie, Jane is seeing the world of men and women in a brilliant new light. And when she takes her Old-Cow-New-Cow theory public, it will change her career and her whole life. Unless, of course, she's got it all wrong....",
        "Category": " Fiction , Women",
        "Publisher": "Dial Press Trade Paperback",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Suicide Blonde",
        "Authors": "By Steinke, Darcey",
        "Description": "Suicide Blonde is the dark, intense, erotic story of a young woman's sexual and psychological odyssey. Set In San Francisco's demimonde of sexually ambiguous, bourbon-drinking, drug-taking outsiders, the novel involves themes of identity, the past's impingement on the present, and sexuality as a common, and now tainted, language.Jesse is a beautiful twenty-nine-year-old woman adrift in a world of confused and forbidden desire, desperately trying to sustain a connection to her bisexual boyfriend, Bell. She becomes the caretaker and confidante to Madame Pig, a besotted, grotesque recluse who lives on memories - or are they fantasies? and red wine. Then Jesse meets Madison - Pig's daughter or lover or both - who uses others' desires for her own purposes and who will take them both beyond any boundaries.Combining the dangerous sexuality of Mary Gaitskill's Bad Behavior and the dark lyricism of Jayne Anne Phillips's Black Tickets, Suicide Blonde is one of the most startling and original novels to appear in years.",
        "Category": " Fiction , Literary",
        "Publisher": "Atlantic Monthly Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Your First Financial Steps/Managing Your Money When You're Just Starting Out",
        "Authors": "By Dunnan, Nancy",
        "Description": "A practical handbook for young people just starting out provides a detailed outline of money-management skills and financial-planning strategies, covering such areas as credit, banking, housing, shopping, insurance, budgets, and more. Original. Tour.",
        "Category": " Business & Economics , General",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Catching Alice: A Novel",
        "Authors": "By Naylor, Clare",
        "Description": "After losing a job, boyfriend, and apartment all within one kick-me-when-I'm-down week, Alice Lewis desperately needs a break. So when an old pal sweeps into London and offers her escape, Alice jumps at the chance--and onto the next plane to Los Angeles, the city of . . . yeah, right. L.A. turns out to be a little less \"angelic\" than the down-to-earth English girl anticipated. For one, there's the new nine-to-five: the unbelievably glamorous, frenzied chore of coddling (doing PR for) the stars--not to mention the bevy of gorgeous, stick-thin models who suddenly appear in Alice's orbit and the suntan/convertible lifestyle that taunts her pasty-white self (starting with her thighs). And just when she thinks her new life couldn't get any more surreal, Alice acquires that most American of accessories: her very own stalker. While the B-list actresses grumble how unfair it is that Alice gets a stalker and they don't, Alice tries to figure out who the mystery man leaving her poems and flowers could be. Is it Charlie, the slick but twisted talent agent? Or Paddy, the hot Irish director who has eyes for any breathing woman? Or maybe it's Tommy, the unbelievably beautiful and totally wasted movie star? Because if truth be told, Alice doesn't think it's all that strange, this stalker business. In fact, she's pretty sure it's downright romantic . . .",
        "Category": " Fiction , Women",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Take Care of Your Skin",
        "Authors": "By Brumberg, Elaine",
        "Description": "Offers advice on caring for this precious external organ--the skin--including purchasing tips on the proper cosmetics and creams",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "What Would Jesus Do?",
        "Authors": "By Morris, Deborah and Sheldon, Garrett W.",
        "Description": "Retells the classic story of people who apply the basic teachings of Christianity to their own actions.",
        "Category": " Religion , Christianity , General",
        "Publisher": "B & H Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "In Country",
        "Authors": "By Mason, Bobbie Ann",
        "Description": "In the summer of 1984, the war in Vietnam comes home to Sam Hughes, whose father was killed there before she was born:  The soldier-boy in the picture never changed. In a way that made him dependable. But he seemed so innocent.  \"Astronauts have been to the moon,\" she blurted out to the picture. \"You missed Watergate. I was in the second grade.\"  She stared at the picture, squinting her eyes, as if she expected it to come to life. But Dwayne had died with his secrets. Emmett was walking around with his. Anyone who survived Vietnam seemed to regard it as something personal and embarrassing. Granddad had said they were embarrassed that they lost the war, but Emmett said they were embarrassed that they were still alive. \"I guess you're not embarrassed,\" she said to the picture.",
        "Category": "",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Laughter in Appalachia: A Festival of Southern Mountain Humor",
        "Authors": "By Jones, Loyal and Wheeler, Billy Edd",
        "Description": "As longtime fans of and contributors to Appalachian lore, Jones and Wheeler collected the material for this popular and timeless volume at the Festival of Appalachian Humor sponsored by the Appalachian Center at Berea College.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "August House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Teenage Romance:  Or How to Die of Embarrassment",
        "Authors": "By Ephron, Delia",
        "Description": "Provides an entertaining and sympathetic look at the painful pleasures of adolescent rites of passage, accompanied by the delightful drawings of Edward Koren",
        "Category": " Humor , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "Brightness Falls",
        "Authors": "By McInerney, Jay",
        "Description": "Combining the lyrical observation of F. Scott Fitzgerald with the laser-bright social satire of Evelyn Waugh, Jay McInerney gives us a novel that is stunningly accomplished and profoundly affecting. As he maps the fault lines spreading through the once-impenetrable marriage of Russell and Corrine Calloway and chronicles Russell's wildly ambitious scheme to seize control of the publishing house at which he works, Jay McInerney creates an elegy for New York in the 1980s. From the literary chimeras and corporate raiders to those dispossessed by the pandemonium of money and power, Brightness Falls captures a rash era at its moment of reckoning and gives reality back to a time that now seems decidedly unreal.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Inventing the Abbots and Other Stories",
        "Authors": "By Miller, Sue",
        "Description": "Sue Miller&#39;s stories from a chapter in the moral history of our time  Like Sue Miller&#39;s bestselling novels, this collection of short stories explores the treacherously shifting ground of erotic and family relationships with deftness and depth. The title story is about a young man who takes up successively with three daughters of the most fashionable family in town. In other stories, whose characters range from a young girl in the first blush of sexual curiosity to a stricken dowager whose seizures release a brutal and sometimes obscene candor, Sue Miller presents a compelling gallery of contemporary men and women with hungry hearts and dismayed consciences.",
        "Category": " Fiction , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Flinch: A Novel",
        "Authors": "By Ferrigno, Robert",
        "Description": "Frightening, feral, and funny, Flinch is a fast-paced noir set amid the frenzied freak show of Southern California. Tabloid journalist Jimmy Gage and his plastic-surgeon brother, Jonathan, have long had a twisted and sometimes nearly fatal rivalry, but the ante was upped when Jonathan recently married Jimmy’s ex. So when Jimmy begins to suspect that Jonathan is the serial killer known as The Eggman, he’s neither surprised nor displeased. What ensues is this harried and hard-edged whodunnit that involves everything from petty porn stars to WWF wannabes to gut-wrenchingly gruesome gangsters and gang lords.  Flinch is an intricately plotted whirlwind of a tale that will grip you until the very last page.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Vintage Crime/Black Lizard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Complete Book of Zingers (Complete Book Of... (Tyndale House Publishers))",
        "Authors": "By Pentz, Croft M.",
        "Description": "Volumes in the “Complete Book of” series are an excellent resource for any home library or for pastors and lay leaders to use for sermon preparation, small group, and Sunday school. The Complete Book of Zingers is a collection of amusing one-sentence sermons, proverbs, adages, illustrations, dictums, and truisms.",
        "Category": " Humor , Topic , Religion",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "When the Troops Are Tired!: 8 Miraculous Energizers to Tap into",
        "Authors": "By Mains, David R.",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Mainstay Church Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Unofficial Nurse's Handbook",
        "Authors": "By Mintzer, Richard and Schroeder, Nina",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Dave's Way",
        "Authors": "By Thomas, R. David",
        "Description": "The founder of Wendy's International uses anecdotes to reveal the secrets behind his success, offering his marketing and management principles and discussing the connection between family values and business strength. Reprint.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "A Cold Peace: America, Japan, Germany, and the Struggle for Supremacy (Twentieth Century Fund)",
        "Authors": "By Garten, Jeffrey E.",
        "Description": "No issue may be more crucial to America's standing in the world than its widening competition with Japan and Germany, a struggle rooted in the three nations' potentially irreconcilable yet deeply held cultural and political traditions. In a powerful analysis drawn from two decades of high-level experience in both government and business, Jeffrey E. Garten shows that the greatest threat to America's national security may well emerge from our reluctance to recognize how the global rules of the game have changed and our failure to adopt a new mind-set not only toward Japan and Germany but toward ourselves as well.",
        "Category": " Social Science , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Two-Hour Vests",
        "Authors": "By Ransome, Roger",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Sterling/Chapelle",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Legacy (Forgotten Realms: Legacy of the Drow)",
        "Authors": "By Salvatore, R. A.",
        "Description": "An aging knight takes in a waif who has proclaimed herself his squire and a young man who dreams of becoming a mage, and together the two apprentices confront a dragon who is determined to destroy the knight's good name. Original.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Wizards of the Coast",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Legal guide for the visual artist",
        "Authors": "By Crawford, Tad",
        "Description": "Painters, illustrators, photographers, and other visual artists are advised on the copyright laws, contracts, sales by galleries and agents, leases, income tax, and wills",
        "Category": "",
        "Publisher": "Distributor to the trade in the United States and Canada, North Light Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Adventures with Julia",
        "Authors": "By Denning, Candace",
        "Description": "",
        "Category": "",
        "Publisher": "North Point Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Thirty Seconds",
        "Authors": "By Arlen, Michael J",
        "Description": "In this tour de force, Arlen focuses on the people, extraordinary processes, and lunacies involved in the making of one thirty-second television commercial",
        "Category": " Performing Arts , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.81",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "Ten Indians",
        "Authors": "By Bell, Madison Smartt",
        "Description": "When child psychologist Mike Devlin opens a Tae Kwon Do school near the Baltimore housing projects, the brutality of the streets, a series of violent deaths, and deadly misunderstandings shock him into seeing how minimal his influence in life has been. Reprint. Tour.",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Partners All -- Place All! Forty-four Enjoyable Square and Folk Dancesfor Everyone",
        "Authors": "By Kirkell, Miriam H. and Irma K. Schaffnit",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1949"
        }
    },
    {
        "Title": "You're Pregnant!! : A Guide for the Longest Nine Months of Your Life",
        "Authors": "By Hammer, Kathryn",
        "Description": "A humorous look at pregnancy covers conception, choice of obstetrician, childbirth methods, physical changes during pregnancy, discomforts, safety precautions, exercise, old wives' tales, and childbirth classes",
        "Category": " Humor , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "God's Message of Christmas Love",
        "Authors": "By Peterson, Eugene H.",
        "Description": "A wonderful book for families to enjoy together at Christmas time, this one-of-a-kind Christmas story is taken from the reader-friendly, accessible text ofThe Message paraphrase of the Bible. The events of the birth of Christ-from the prophetic foretelling of the birth to the blessing from Simeon and the visit of the Magi-are arranged chronologically for the most complete retelling of this glorious event. The joyful Christmas story and inspiring quotes from Dr. Eugene Peterson will be woven throughout beautiful four-color art to make this a memorable Christmas gift that families will treasure.",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The Divine Adventure: Inspirations for the Journey (Women of Faith (Zondervan))",
        "Authors": "By Gibbs, Terri",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "They Shoot Canoes, Don't They?",
        "Authors": "By McManus, Patrick F.",
        "Description": "With tongue pressed firmly in cheek and a gentle but penetrating eye for human foibles, Patrick F. McManus celebrates the hidden pleasures, unappreciated lore, and opportunities for disaster to be found in the recreations of camping, hunting, and fishing in his hilarious collection They Shoot Canoes, Don’t They?Gathered here for the reader’s edification are such treasures as the true but little known story of the discovery of the efficacy of live bait by Genghis Khan’s chef, an examination of the precarious and perhaps fanatical expertise required for ice fishing, and a consideration of the circumstances that can cause a deer to ride a bicycle. Among additional topics explored are The Crouch Hop and Other Useful Outdoor Steps, The Sensuous Angler, and Psychic Powers for Outdoorsmen. Included, too, is The Hunter’s Dictionary, an invaluable lexicon that helps the novice sportsman understand such arcane terminology as “Ooooooeee-ah-ah-ah! (If there’s one thing I hate, it’s putting on cold, wet pants in the morning)” and “Baff mast pime ig bead feas mid miff pife! (That’s the last time I try to eat peas in the dark with my hunting knife!)” The author’s appreciation of outdoor life began in his early boyhood, when he absorbed a wealth of improbable information imparted by the old woodsman Rancid Crabtree, “who bathed only on leap years.” Young McManus also enjoyed special adventures with his ill-remembered sidekick, Retch Sweeney, and another boon companion of days gone by, the loquacious family dog, Strange, whose exploits as a hunter were limited to assaulting stray chickens and on one memorable occasion a skunk. “McManus here follows up A Fine and Pleasant Misery with a collection of sketches that launches him into the front ranks of outdoor humorists.”—Library Journal",
        "Category": " Humor , Form , Essays",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "The Law of Similars: A Novel",
        "Authors": "By Bohjalian, Christopher A.",
        "Description": "Two years after his wife's sudden, accidental death, a Vermont deputy state prosecutor, Leland Fowler, finds that the stress of raising their small daughter alone has left him with a chronic sore throat. Desperate to rid himself of a malady that has somehow managed to elude conventional medicine, Leland turns to homeopath Carissa Lake - who cures both his sore throat and the aching loneliness at the root of his symptoms.Just days after Leland realizes he has fallen in love with the first woman who has mattered to him since his wife, one of Carissa's asthma patients falls into an allergy-induced coma. When Carissa comes under investigation, straight-arrow Leland is faced with a moral and ethical dilemma of enormous proportions.Set against the ongoing clash between conventional and alternative medicine - between what we know science can offer and the miracles that always seem to be just beyond our reach - The Law of Similars is a haunting and deeply atmospheric tale.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "A Century Of Women: The Most Influential Events in Twentieth-Century Women's History",
        "Authors": "By Felder, Deborah G.",
        "Description": "A general reader's guide to such events as the formation of the National Women's Trade Union League, Amelia Earhart's solo flight across the Atlantic, the invention of the bikini, Ellen DeGeneres' sitcom character's de-closeting, and the release of the American Association of University Women's report \"How Schools Shortchange Girls.\" Felder is the author of 11 books, including  The 100 Most Influential Women of All Time . Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Citadel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Choice of Eddie Franks",
        "Authors": "By Freemantle, Brian",
        "Description": "Eddie Franks faces a difficult choice when he learns that the financial backers his brother-in-law recommended for his hotels turn out to be members of organized crime",
        "Category": " Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "A Shortcut Through Time: The Path to the Quantum Computer",
        "Authors": "By Johnson, George",
        "Description": "Answering a colleague's challenge to write a short book explaining the complex science of quantum computing, Johnson offers a clear analysis of the emerging technology for a general audience interested in science. Johnson, a science writer for the New York Times, explains the quantum theory that makes the computer a reality and projects future applications in code breaking, solving previously unsolvable math equations, and understanding the mysterious behavior of certain protein molecules. Annotation (c) Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Science , Physics , Quantum Theory",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Lady and the Tramp (Disney's wonderful world of reading)",
        "Authors": "By Disney, Walt",
        "Description": "When mean Aunt Sara swings a broom at her, Lady runs away from home and meets a big, friendly-looking dog named Tramp.",
        "Category": "",
        "Publisher": "Random House~childrens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Language of Names: What We Call Ourselves and Why It Matters",
        "Authors": "By Kaplan, Justin and Bernays, Anne",
        "Description": "Why are we so often annoyed when somebody gets our name wrong? Because our sense of self is involved, and our names touch on every aspect of our lives. Prospective parents pore over baby-naming books, believing that the right choice will set their infant on the right track. Immigrants change their names to assimilate into American society; blacks to recover their African roots or to establish an Islamic identity; movie stars to conform to Hollywood images of WASP-ness, high society, or exoticism.Drawing on social and literary history, psychology and anthropology, anecdotes, and life stories, Pulitzer Prize-winning biographer Justin Kaplan and celebrated novelist Anne Bernays have created a fascinating account of names and naming in contemporary society that touches on class structure, ethnic and religious practices, manners, and everyday life. Their primary focus is the United States, which from its beginnings has been conspicuously preoccupied with identity, self-definition, and self-invention while sharing the concerns of other societies distant in time and place.",
        "Category": " Language Arts & Disciplines , Linguistics , Semantics",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Your Guide to Creativity",
        "Authors": "By Jo-Ann Stores (EDT)",
        "Description": "A comprehensive reference for everything creative about crafts, home decorating, and sewing.More than 150 techniques on everything from arranging blooms to designing draperies to creating an heirloom quilt.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Jo-Ann",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Vital Signs",
        "Authors": "By Cook, Robin",
        "Description": "When Marissa Blumenthal, a successful epidemiologist and happily married woman, discovers that she cannot conceive, her obsession with getting pregnant leads her to investigate the baby-making business",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Putman",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    }
]