[
    {
        "Title": "Accomplice to Evil: Iran and the War Against the West",
        "Authors": "By Ledeen, Michael A.",
        "Description": "From Accomplice to Evil: “The world is simmering in the familiar rhetoric and actions of movements and regimes—from Hezbollah and al Qaeda to the Iranian Khomeinists and the Saudi Wahhabis—who swear to destroy us and others like us, and we are repeating the errors of the recent past. Like their 20th-century predecessors, they openly proclaim their intentions, and carry them out whenever and wherever they can. Like our 20th-century predecessors, we rarely take them seriously or act accordingly.” Acknowledging the existence and actions of evil enemies means accepting that we are at war, and then designing and con duct - ing a strategy to win. Accomplice to Evil takes a com pre hensive look at the errors we have made in the past when dealing with a mounting enemy force, why we’ve refused to acknowledge the implications of a rising evil, and how we can defeat the forces that threaten us today.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Truman Talley Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Complete Book of Arts and Crafts",
        "Authors": "By Purney, Dawn (EDT)",
        "Description": "The Complete Book of Arts and Crafts is designed for ages 5 to 9        to reinforce children’s creative minds and motor skills.                                  This 256 page workbook teaches basic skills with classroom-tested        activities.  Motivating lessons guide children through basic concepts        and creative projects.  Including easy-to-follow instructions this        workbook features user friendly format with a special review section.                                  Over 4 million in print!  The best-selling Complete Book series  offers a full complement of instruction, activities, and information about a        single topic or subject area.  Containing over 30 titles and        encompassing preschool to grade 8 this series helps children succeed in        every subject area!",
        "Category": " Juvenile Nonfiction , Art , General",
        "Publisher": "American Education Publishing",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Annual Recipes 2002",
        "Authors": "By Martinusen, Julia",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Annual Recipes 2003",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Smoothies and Juices",
        "Authors": "By Parragon",
        "Description": "",
        "Category": "",
        "Publisher": "Love Food / Parragon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Nessie the Loch Ness Monster",
        "Authors": "By Brassey, Richard",
        "Description": "This book contains facts (more or less true) about the Loch Ness Monster, her alleged arrival in the loch, and what people have seenor thought they have seen.",
        "Category": " Juvenile Fiction , Social Issues , Adolescence",
        "Publisher": "Dolphin Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "The Nuclear Age: Timeframe Ad 1950-1990",
        "Authors": "By john wills",
        "Description": "Examines the progress of world affairs from the beginning of the Cold War to the present day",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The Colonial Overlords: TimeFrame AD 1850-1900",
        "Authors": "By Editors of Time-Life Books",
        "Description": "Surveys the major events of the latter part of the nineteenth century, including the British raj in India, the unification of Germany, the colonization of America, and more",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "My First Bible",
        "Authors": "By Ottaviani, Ettorina",
        "Description": "Best-loved Bible Stories- from creation to the resurrection- are presented on tow levels.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Pauline Books & Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Latin American Spanish: Lonely Planet Phrasebook",
        "Authors": "By Lonely Planet Publications",
        "Description": "",
        "Category": " Reference , Directories",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Humanities",
        "Authors": "By Dudley, Louise, Faricy, Austin, and Rice, James G.",
        "Description": "Sculpture, painting, literature, music, dance, and architecture are considered in this survey of the arts designed to develop the reader's appreciation of the humanities",
        "Category": " Education , General",
        "Publisher": "Mcgraw-Hill College",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Merry Month of May",
        "Authors": "By Jones, James",
        "Description": "",
        "Category": "",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Totally Amazing Plants",
        "Authors": "By Kespert, Deborah, Hillyard, Julia, and Peters, Andrew",
        "Description": "",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "I Wonder Why Triceratops Had Horns: and Other Questions about Dinosaurs",
        "Authors": "By Kenyon, Tony (ILT), Theodorou, Rod, and Forsey, Chris",
        "Description": "Browsers and young students alike will enjoy these lively question and answer books with their unique mix of realistic illustration and engaging cartoons. The enticing questions will amaze, amuse and inspire, while the highly visual format encourages kids to keep reading.",
        "Category": " Juvenile Nonfiction , Animals , Dinosaurs & Prehistoric Creatures",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Chocolate Delights (Creative Cuisine)",
        "Authors": "By Gill, Cathy",
        "Description": "Shares recipes for cakes, fruit desserts, ice creams, parfaits, sauces, fondues, pies, crepes, omelets, souffles, puddings, tortes, cheesecakes, trifles, pastries, fudge, and cookies which feature chocolate",
        "Category": " Cooking , Courses & Dishes , Chocolate",
        "Publisher": "HP Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "I Will Lift Up Mine Eyes: Inspiring Words of Comfort and Hope",
        "Authors": "By Bishop, Bette",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Universe Alternatives: Emerging Concepts of Size, Age, Structure and Behavior",
        "Authors": "By Farmer, Billy L.",
        "Description": "",
        "Category": " Philosophy , Metaphysics",
        "Publisher": "B L Farmer",
        "Price Starting With ($)": "7.7",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Saint Kateri Tekakwitha: The Lily of the Mohawks",
        "Authors": "By Lovasik, Lawrence",
        "Description": "",
        "Category": " Religion , Christian Education , Children & Youth",
        "Publisher": "Catholic Book Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "God Is Back: How the Global Revival of Faith Is Changing the World",
        "Authors": "By Micklethwait, John and Wooldridge, Adrian",
        "Description": "On the street and in the corridors of power, religion is surging worldwide. From Russia to Turkey to India, nations that swore off faith in the last century--or even tried to stamp it out--are now run by avowedly religious leaders. This book examines this new world, from exorcisms in Säao Paulo to religious skirmishing in Nigeria, to televangelism in California and house churches in China. Since the Enlightenment, intellectuals have assumed that modernization would kill religion--and that religious America is an oddity. As these authors argue, religion and modernity can thrive together, and America is becoming the norm. The failure of communism and the rise of globalism helped spark the global revival, but, above all, 21st century religion is being fueled by a very American emphasis on competition and a customer-driven approach to salvation, and its destabilizing effects can already be seen far from Iraq or the World Trade Center.--From publisher description.",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Penguin Press HC, The",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Breathing the Fire",
        "Authors": "By Dozier, Kimberly",
        "Description": "A CBS News correspondent describes her recovery from critical injuries sustained in a Baghdad bombing that killed her two crew members as well as an Army officer and an interpreter, and offers her insights into reporting from a war zone.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Promise: God's Purpose and Plan for When Life Hurts",
        "Authors": "By Morris, Jonathan",
        "Description": "A media analyst and Catholic priest describes his international travels in search of understanding God's role in human suffering, a spiritual journey during which he struggled to understand why a benevolent God allows harrowing pain and composed six principles for staying true to one's faith. Reprint. 20,000 first printing.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The Shyness Solution: Operator's Manual",
        "Authors": "By Gillet, Catherine",
        "Description": "",
        "Category": "",
        "Publisher": "Borders",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "How to Deal With Your Acting-Up Teenager: Practical Help for Desperate Parents",
        "Authors": "By Bayard, Robert T. and Bayard, Jean",
        "Description": "An outstandingly courageous, honest and original approach to teenage acting-out. This book might save your family's sanity. -Louise Bates Ames, Gesell Institute of Human Development",
        "Category": " Family & Relationships , Life Stages , Teenagers",
        "Publisher": "M. Evans & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Birth Order Book, The: Why You Are the Way You Are",
        "Authors": "By Leman, Kevin",
        "Description": "Dr. Leman's ever popular book on birth order is ready for a new generation of readers.With insight and wit, Dr. Leman offers readers a fascinating and often funny look at how birth order affects personality, marriage and relationships, parenting style, career, and children. Whether at home or on the job, birth order powerfully influences the way people interact with others.This is a great book for anyone who wants to learn more about how they react to their world. Dr. Leman even shows readers how to overcome ingrained tendencies they never thought they'd be rid of, all by focusing on their birth order.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Revell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Cooking Know-How: Be a Better Cook with Hundreds of Easy Techniques, Step-by-Step Photos, and Ideas for Over 500 Great Meals",
        "Authors": "By Weinstein, Bruce, Scarbrough, Mark, and Schaeffer, Lucy (PHT)",
        "Description": "Welcome to a whole new kind of cookbook.\"Knowing how to cook has challenged lots of men. Women, too. What most people learn is a specific recipe: how to make this pasta sauce, or that loaf of bread. What about learning how to cook in general? And not just the 'how' but the 'how come?' That requires a technique book.\"What you'll find in this book is an alphabetical list of sixty-five recipe-driven, technique-centered explications that build out into hundreds of dishes.\"Armed with the knowledge of the simple mechanics of a dish, the five or so steps it takes to make it, you can walk into the market, find what's fresh (or on special), bring it home, and have dinner on the table without any worries, any overly romantic pretensions, or any cookbooks piled on the floor: fresh every time—and your way, too.\"—from the Introduction\"The recipes are structured without being fussy and the majority are relatively easy. This is a welcome rarity, imparting a useful, innovative framework as well as the confidence to depart from it.\"—Publishers Weekly",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "London (EYEWITNESS TRAVEL GUIDE)",
        "Authors": "By Leapman, Michael",
        "Description": "Jam-packed with thousands of words and hundreds of photos, maps, sketches all in good color. The bird's-eye and cut away views are particularly attractive and useful. This crowded book will help prepare the visitor for the crowds of London. Very well done. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "DK Travel",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Bed And Breakfast Ireland",
        "Authors": "By Dillard, Elsie and Causin, Susan",
        "Description": "When the Irish turn to a guidebook, Bed and Breakfast Ireland is the one they choose. With nearly half a million copies sold, Bed and Breakfast Ireland has been fully revised and updated for this fifth edition. The authors have undertaken extensive trips, south to north, east to west, to find over 400 of the best bed-and-breakfast accommodations in Ireland, from guests houses, small hotels, country mansions, private homes, and farmhouses. Informative, personable descriptions and practical information (including contact listings and websites) are accompanied by helpful maps. Compact, comprehensive, and charming, Bed and Breakfast Ireland will help make any Irish holiday a trip to remember.",
        "Category": " Travel , Food, Lodging & Transportation , Bed & Breakfast",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Small Pieces Loosely Joined: A Unified Theory Of The Web",
        "Authors": "By Weinberger, David",
        "Description": "The Web has not been hyped enough. That's the startling thesis of this one-of-a-kind book that's sure to become a classic work of social commentary. Just as Marshall McLuhan forever altered our view of broadcast media, Weinberger shows that the new medium of the Web is not only altering social institutions such as business and government but, more important, is transforming bedrock concepts of our culture such as space, time, the public, and even reality itself.Weinberger introduces us to denizens of this new world, among them Zannah, whose online diary turns self-revelation into play; Tim Bray, whose map of the Web reveals what's at the heart of the new Web space; and Danny Yee and Claudiu Popa, part of the new breed of Web experts we trust despite their lack of qualifications. Through stories of life on the Web, an insightful take on some familiar (and some unfamiliar) Web sites, and a wicked sense of humor, Weinberger puts the Web into the social and intellectual context we need to begin assessing its true impact on our lives. The irony, according to Weinberger, is that this new technology is more in tune with our authentic selves than is the modern world. Funny, provocative, and ultimately hopeful, Small Pieces Loosely Joined makes us look at the Web--and at life--in a new light.From Small Pieces Loosely Joined:The Web has sent a jolt through our culture, zapping our economy, our ideas about the sharing of creative works, and possibly even institutions such as religion and government. Why? How do we explain the lightning charge of the Web? If it has fallen short of our initial hopes and fears about its transformational powers, why did it excite those hopes and fears in the first place? Why did this technology hit our culture like a bolt from Zeus?Suppose--just suppose--that the Web is a new world we're just beginning to inhabit...If the Web is changing bedrock concepts such as space, matter, time, perfection, public, knowledge, and morality--each a chapter of this book--no wonder we're so damn confused. That's as it should be. The Web is enabling us to rediscover what we've always known about being human: we are connected creatures in a connected world about which we care passionately...If this is true, then for all of the over-heated, exaggerated, manic-depressive coverage of the Web, we'd have to conclude that the Web in fact has not been hyped enough.",
        "Category": " Technology & Engineering , Social Aspects",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Maui Revealed: The Ultimate Guidebook, Second Edition",
        "Authors": "By Doughty, Andrew, Friedman, Harriett, and Doughy, Andrew",
        "Description": "Introduces Hawaiian history and culture, and evaluates places to see, amusements, outdoor activities, restaurants, and accomodations on the island of Maui.",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Wizard Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Ghost Towns: How They Were Born, How They Lived, and How They Died",
        "Authors": "By Robotham, Tom",
        "Description": "Recounts the quick births and deaths of \"ghost towns,\" legendary phenomena of the American West, and captures the American spirit with telling photographs and an in-depth analysis of the history of these towns.",
        "Category": "",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "The World of Turtles and Tortoises",
        "Authors": "By Lehrer, John",
        "Description": "A strongly pictorial (hundreds of color photos showing indifferent color rendition) popular book. For hobbyists and the public library. Published by Tetra Press, distributed by Voyageur Press. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Pets , Reptiles, Amphibians & Terrariums",
        "Publisher": "Tetra Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Favorite Brand Name Old-Fashioned Holiday Recipes",
        "Authors": "By Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "7.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Marketing: Real People, Real Choices (4th Edition)",
        "Authors": "By Solomon, Michael R., Marshall, Greg W., and Stuart, Elnora W.",
        "Description": "",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Birds at Night",
        "Authors": "By Roma Gans",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Y. Crowell Company, New York",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "100 Best One-Dish Meals (Good Housekeeping)",
        "Authors": "By Anne Wright, From the Editors of Good Housekeeping",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Hearst",
        "Price Starting With ($)": "5.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Best Ever Pasta",
        "Authors": "By Sara Hesketh Richard Green",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Favorite Brand Name Best Loved Recipes of All Time",
        "Authors": "By Intl, Publications",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Night Journal",
        "Authors": "By Crook, Elizabeth",
        "Description": "A brilliantly imagined, lavish, and transporting novel of a young woman's search for the truth about her family's mythic past  Meg Mabry has spent her life with her back turned to her legendary family legacy. In the 1890s her great-grandmother Hannah Bass composed starkly revealing diaries of her life on the southwestern frontier, first as a Harvey Girl at the glamorous Montezuma Resort in New Mexico and later as the wife of brilliant, and often-absent, railway engineer Eliott Bass. A generation later, Hannah's daughter, Claudia Bass, renowned historian known to all as Bassie, staked her academic career and reputation on these vibrant accounts, editing and publishing them to great acclaim. Thanks to the journals and to the industry Bassie created around them, Hannah would forever be one of the most romantic and famous figures of southwestern history.  Meg, however-Bassie's granddaughter-finds the family lore oppressive. When an excavation on the old Bass family property beckons a now-elderly and viper-tongued Bassie back to the fabled land of her childhood, Meg only grudgingly consents to accompany her. Determined not to live under the shadow of her ancestry, Meg has never even read the journals. But when an unexpected discovery casts doubt on the history recorded in their pages and harbored in Bassie's memories, Meg finally succumbs to the allure of her great grandmother's story and ventures even deeper into Hannah's life to unlock the mystery at the journal's core.  Reminiscent of Carol Shields's The Stone Diaries and the novels of Anita Shreve, The Night Journal is an enthralling tale in which Indian ruins, majestic desert hotels, and the hardship and boldness of frontier life fit seamlessly with a modern-day story of coming to terms with loss, family secrets, and shattering truths that lie shrouded in memory.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Quotations For Public Speakers",
        "Authors": "By Torricelli, Robert G. (EDT)",
        "Description": "Compiles over 2,000 quotations by almost 1,000 authors on more than fifty subjects including age and aging, education, friendship, idealism, unity, society, race and ethnicity, and leadership.",
        "Category": " Reference , Quotations",
        "Publisher": "Rutgers University Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Fodor's Escape to the American Desert, 1st Edition (Fodor's Escape Guides (1))",
        "Authors": "By Karnow, Catherine (PHT) and Lansing, David",
        "Description": "Fodor's Escape to the American Desert will inspire and guide you as you plan your American Desert getaway explore sagebrush canyons and ghost towns or leave your footprints in a sea of pure sand. Each of the 17 experiences and sights it highlights are illustrated in 135 luscious full-color photographs. The planning section tells you all about costs, lodging options, how to get there, and more, and a detailed map shows you what's where.  Escape to the American Desert is lovely enough to treasure as a dream book, yet durable enough to withstand the rigors of travel, so keep this book by your bedside to sweeten your dreams, or pop it into your tote bag when you hit the road.  And get ready for the trip of a lifetime.",
        "Category": " Travel , United States , West , General",
        "Publisher": "Fodor's Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Jesus: The Great Debate",
        "Authors": "By Jeffrey, Grant R.",
        "Description": "JESUS- The Great DebateThe Question is… Who do you say that I am?An insightful new release addressing the identity of Jesus from a knowledgeable, well researched perspective.“Who do you say that I am?” It’s a question that has stirred great debate concerning the identity of Jesus in universities, churches, and most of all, in the hearts of millions. JESUS The Great Debate explored the criticism of the skeptics, such as the Jesus Seminar, a group of liberal scholars who deny that Jesus performed miracles and rose from the dead. Fascinating new scientific evidence suggests the Shroud of Turin may prove to be the actual burial cloth of Christ. Find out why many of the ancient Jews rejected Jesus despite their prophecies that revealed He was the true Messiah. Read the censored passages about Jesus of Nazareth hidden in the Jewish Talmud and Targums. Explore the astonishing discoveries of early Christian tombs. Uncover the truth about Jesus regarding His mysterious birth, His miracles, and His remarkable resurrection. “This comprehensive study of evidence about Jesus provides compelling proof to both skeptics and believers that He is the true Messiah.”",
        "Category": " Religion , Biblical Commentary , New Testament",
        "Publisher": "WaterBrook",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Rational Unified Process",
        "Authors": "By Kruchten, Philippe",
        "Description": "An introduction to the software development process which provides a disciplined approach to assigning, managing, and completing tasks within a software development organization.  The author, the lead architect of the product, looks at software development best practices, iterative development, and numerous workflows within the process such as modeling, testing, deployment, and implementation. Each of the workflow chapters covers the purpose of the workflow, the work products and roles of the process, and tool support. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Computers , General",
        "Publisher": "Addison-Wesley Pub (Sd)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "JOHN WESLEY'S AWAKENING.",
        "Authors": "By Joy, James Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Methodist Book Concern",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1938"
        }
    },
    {
        "Title": "Modern American Memoirs",
        "Authors": "By Dillard, Annie (EDT) and Conley, Cort (EDT)",
        "Description": "In Modern American Memoirs, two very discerning writers and readers have selected samples from 35 of the finest memoirs written in this century, including contributions by such diverse writers as Margaret Mead, Malcolm X, Maxine Hong Kingston, Loren Eisely, and Zora Neale Hurston. Chosen for their value as excellent examples of the art of biography as well as for their superb writing, the excerpts present a broad range of American life, and offer vivid insight into the real-life events that shaped their authors. Here, readers can learn about the time when Harry Crews, playing as a boy, fell into a vat of boiling water with a dead hog; Chris Offutt joined the circus and watched a tattooed woman swallow a fluorescent light; and Frank Conroy practiced yo-yo tricks.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The New American Heart Association Cookbook: 25th Anniversary Edition",
        "Authors": "By American Heart Association (EDT)",
        "Description": "Thoroughly revised and expanded, an anniversary edition of the classic heart-healthy cookbook presents more than six hundred kitchen-tested recipes, complete with nutritional analyses, as well as tips on shopping for, storing, and cooking food, reading labels, and more. Reprint. 75,000 first printing.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Easy Entertaining",
        "Authors": "By n/a",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "41.9",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Dancing Bones: Living Lively in the Valley (Women of Faith (Zondervan))",
        "Authors": "By Clairmont, Patsy",
        "Description": "We all want to live on a peaceful mountaintop where we can look down on the world below without getting hurt. With her trademark humor and style, Patsy Clairmont uses the story of \"dancing bones\" in Ezekiel to remind us that life in the valley can be pretty breathtaking, too. It's often in the valley that we learn and love the most. Rather than running from our troubles, Patsy says true \"valley girls\" find grace, freedom, and a sense of humor in the midst of turmoil.",
        "Category": " Religion , Christianity , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "100 Best Chicken Recipes",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "13: Thirteen Stories That Capture the Agony and Ecstasy of Being Thirteen",
        "Authors": "By Howe, James (EDT)",
        "Description": "\"If thirteen is supposed to be an unlucky number...you would think a civilized society could come up with a way for us to skip it.\" -- from \"What's the Worst That Could Happen?\" by Bruce Coville   No one will want to skip any of the twelve short stories and one poem that make up this collection by some of the most celebrated contemporary writers of teen fiction. The big bar mitzvah that goes suddenly, wildly, hilariously out of control. A first kiss -- and a realization about one's sexual orientation. A crush on a girl that ends up putting the boy who likes her in the hospital. A pair of sneakers a kid has to have. By turns funny and sad, wrenching and poignant, the moments large and small described in these stories capture perfectly the agony and ecstasy of being thirteen.",
        "Category": " Young Adult Fiction , Social Themes , General",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Joy of Grilling",
        "Authors": "By Famularo, Joe",
        "Description": "Useful information about grilling accompanies a large collection of recipes for basic marinades, vegetables, sauces, seafood, and grilled beef, pork, lamb, veal, venison, sausages, poultry, and game",
        "Category": " Cooking , Methods , Special Appliances",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Thoughts on Success: Thoughts and Reflections From History's Great Thinkers",
        "Authors": "By Triumph Books",
        "Description": "With words of wisdom filling each page, this collection of thoughts represents diverse perspectives on the subject of success and is culled from world leaders throughout history—heads of state, captains of industry, philosophers, military leaders, and theologians. The book is compiled by the editors of a magazine that millions of business leaders look to for insight into the world of business—and into the business of life—and this timeless series reflects the much-respected Forbes philosophy on life and leadership.",
        "Category": " Philosophy , Free Will & Determinism",
        "Publisher": "Triumph Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "La Sainte-Chapelle de Paris (édition anglaise). Palais de la Cité, Paris (Itinéraires) (French Edition)",
        "Authors": "By Finance, Laurence de",
        "Description": "",
        "Category": "",
        "Publisher": "PATRIMOINE",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Just Don't Fall: How I Grew Up, Conquered Illness, and Made It Down the Mountain",
        "Authors": "By Sundquist, Josh",
        "Description": "Read Josh Sundquist's posts on the Penguin Blog.       One moment Josh Sundquist was your typical energetic and inquisitive nine year- old boy.  The next, his entire life   changed when he was diagnosed with Ewing's Sarcoma, a particularly virulent cancer strain that would eventually   claim Josh's left leg. Told in a wide-eyed, winning, heartbreaking voice, Just Don't Fall is the story of the   boy Josh was and of the young man he became. His story begins in a small, close-knit Southern town, where his   father-an aspiring pastor questioning his faith, and his mother-- homeschooling an ever- growing brood of   children-struggle to make ends meet. Josh journeys through a dizzying array of hospitals and eventually lands at a   pivotal place: the nearby mountain, where he makes his first attempt to ski. It is on the slopes, and later,   on the race course, that Josh's world bursts wide open in a way no one could have ever anticipated. The inspiration   to ski, however, and to become a champion, is not all that Josh has to contend with- there is adolescence to   navigate, the transition from homeschool to public high school, and girls. There is an increasingly turbulent and   difficult home life, with another cancer scare, a wayward brother, and dwindling finances to pay for training. Finally,   there is the wild, bumpy road to the Paralympics in Turin, with a misanthropic coach, training in the Rockies, and a   timeless friendship with a charismatic, imposing Brooklyn homeboy named Ralph. Through it all, Josh is   forced to question his abilities, his sanity, his will, his faith in himself, and his faith in God. Because of, not despite,   these myriad obstacles in his path, Josh is able to achieve a genuine grace: the grace to risk failure and to succeed.    It is the grace of a young boy becoming a man and of a champion realizing his greatest dream.  Josh Sundquist   shows us with charm, humility and remarkable strength that even if we fall, this inner grace can lift us up and carry   us over the many mountains we all must face.",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Ocean of Words Army Stories",
        "Authors": "By Jin, Ha",
        "Description": "Winner of the PEN/Hemingway AwardThe place is the chilly border between Russia and China. The time is the early 1970s when the two giants were poised on the brink of war. And the characters in this thrilling collection of stories are Chinese soldiers who must constantly scrutinize the enemy even as they themselves are watched for signs of the fatal disease of bourgeois liberalism.In Ocean of Words, the Chinese writer Ha Jin explores the predicament of these simple, barely literate men with breathtaking concision and humanity. From amorous telegraphers to a pugnacious militiaman, from an inscrutable Russian prisoner to an effeminate but enthusiastic recruit, Ha Jin's characters possess a depth and liveliness that suggest Isaac Babel's Cossacks and Tim O'Brien's GIs. Ocean of Words is a triumphant volume, poignant, hilarious, and harrowing.\"A compelling collection of stories, powerful in their unity of theme and rich in their diversity of styles.\"--New York Times Book Review\"Extraordinary...[These stories are shot through with wit and offer glimpses of human motivation that defy retelling...Read them all.\"--Boston Globe\"An exceptional new talent, capable of wringing rich surprises out of austere materials.\"--Portland Oregonian",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Love is the Target: An Answer for Troubled Americans, Today",
        "Authors": "By Fettig, Art",
        "Description": "",
        "Category": "",
        "Publisher": "Graphic Impressions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "For the Love of Cats",
        "Authors": "By Gizzi, Irene, Shojai, Amy",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Best Ever Vegetarian",
        "Authors": "By n/a",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "DK First Dictionary",
        "Authors": "By Dignen, Sheila and Greenwood, Elinor (EDT)",
        "Description": "Bringing the amazing world of words to children ages five and older. With over 700 illustrations designed to attract young children and 4,000 age-appropriate vocabulary words, the DK First Dictionary sets a new standard in linguistic reference for children six and up. Many entries include opposites, similar words, and word origins, alongside phonetic spellings and easy-to-follow definitions. Word Detective\" games and \"Word Banks\" help children expand their vocabulary while having fun.\"",
        "Category": " Juvenile Nonfiction , Reference , Dictionaries",
        "Publisher": "DK Children",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "365 Easy Soup Recipes: Simple, Delicious Soups & Stews to Warm the Heart",
        "Authors": "By Cookbook Resources",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Soups & Stews",
        "Publisher": "Cookbook Resources(TX)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Rainbow High",
        "Authors": "By Sanchez, Alex",
        "Description": "Jason Carrillo, the best-looking athlete in school, has had his eyes on the prize from day one: a scholarship for college. But then his eyes turn to love -- and Kyle.  Kyle Meeks, swim team star and all-around good guy, is finally in the relationship he wanted. Being in love feels so good, in fact, that he can't imagine giving it up to go to Princeton. Something he's worked for his entire life.  Nelson Glassman, outgoing and defiant, might be HIV positive. Jeremy, the boy he loves, is HIV positive. Although Nelson fears testing positive, if he is infected Jeremy might stop protecting him and pushing him away. They can be together.  High shool's almost over. Graduation is ahead. Life's a bowl of cherries, right? Right...",
        "Category": " Young Adult Fiction , LGBT",
        "Publisher": "S&S Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Shocking Secrets of American History: 115 Surprising and Amusing Tales",
        "Authors": "By Bill Coate",
        "Description": "",
        "Category": "",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Little Boys Bible Christmas Storybook",
        "Authors": "By Larsen, Carolyn, Turk, Caron (ILT), and Turk, Caron",
        "Description": "Retells the story of Jesus' early life, through his boyhood visit to the Temple, with an account of the birth of John the Baptist, and provides advice for boys and their mothers on the lessons these stories have for Christian men.",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "You Know You're in Massachusetts When...: 101 Quintessential Places, People, Events, Customs, Lingo, and Eats of the Bay State (You Know You're In Series)",
        "Authors": "By Harris, Patricia and Lyon, David",
        "Description": "A celebration for residents and a field guide for the uninitiated, this delightful book celebrates 101 things that make Massachusetts special—from frappes to the Freedom Trail, singing beaches to Samuel Adams. Humorous entries will have readers of all ages laughing out loud as they learn the Bay State’s most fascinating facts. You know you're in Massachusetts when...* Your state song was written by an aging hippie* You see whales in the rocks* \"Gawkablockas\" are a regular highway occurrence* Grandma is out to pasture* And more!",
        "Category": " Reference , Trivia",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "How to be a Hero to Your Kids",
        "Authors": "By McDowell, Josh and Day, Dick",
        "Description": "You don't have to be a super-parent to be a hero to your kids. All it takes is love, motivation and a workable plan. Josh McDowell and Dick Day offer a six-point, biblically-based plan for positive parenting that will set you on the path to being a hero to your child.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Plymouth Colony (We the People: Exploration and Colonization)",
        "Authors": "By Santella, Andrew",
        "Description": "Describes the reasons that the Pilgrims traveled to the New World, their voyage on the Mayflower, the hardships of their first winter in the Plymouth settlement, and the harvest celebration remembered as the first Thanksgiving.",
        "Category": " Juvenile Nonfiction , History , United States , Colonial & Revolutionary Periods",
        "Publisher": "Compass Point Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Ultimate Golfer",
        "Authors": "By Morrison, Ian and Bradbeer, Richard",
        "Description": "A guide to golf features sound advice on choosing equipment and practical pointers on the proper grip, stance, alignment, teeing off, playing bunkers and fairways, rules of the game, and golf etiquette.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "7.42",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Goosebumps: Night of the Living Dummy II",
        "Authors": "By Stine, R. L.",
        "Description": "They're baa-ack! Make way for the bestselling children's series of all time! With a fresh new look, GOOSEBUMPS is set to scare a whole new generation of kids.  So reader beware--you're in for a scare!He's still walking.He's still stalking.Amy's ventriloquist dummy, Dennis, keeps losing his head -- for real.  So Amy begs her family for a new dummy.  That's when her dad finds Slappy in a local pawnshop.  Slappy's kind of ugly, but at least his head stays on!  And besides, Amy's having fun practicing her new routine.  It's like this dummy knows what she's thinking.  Like he can move on his own.  And it's great - until Slappy starts a routine of his own.  A nasty, horrible routine.  And Amy can't control him....",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Scholastic Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Stretching&Toning for Flexibility&Definition: A Step-by-step Guide Develop Your",
        "Authors": "By Melissa Cosby",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes&Noble Inc.",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Lighting & Electricity (FIX-IT-YOURSELF)",
        "Authors": "By Constable, George (EDT)",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "F My Life: It's Funny, It's True, Except When It Happens to You",
        "Authors": "By Valette, Maxime",
        "Description": "Today, my boss fired me via text message. I don’t have a text messaging plan. I paid 25 cents to get fired.Your girlfriend dumped you, your car broke down, your boss passed you up for the big promotion. Life’s not fair, but there is one sure-fire way to ease your pain–laughing at someone else who had an even worse day than you did. Enter the devastatingly funny world of F My Life, where calamity is comedy. Covering every disastrous pratfall in love, work, family-life, and more, F My Life proffers other people’s ruinous, real-life happenings to brighten your gloomiest day: someone getting dumped through a greeting card, ignored at their birthday party, or insulted by their own grandmother. Spanning everything from ironic twists of fate to down-right shameful moments, F My Life’s squirm-inducing stories are schadenfreude at its finest. So today, take solace in knowing that at least you’re not that guy. There now, don’t you feel better?Today, my boyfriend broke up with me. I cried and told him that I loved him. He gave me a quarter and told me to call someone who cared. I threw the quarter in his face and ran. I waited for the bus, but when I got on, I realized I was 25 cents short of the fare. I walked home in the rain. Today, my mom walked in on me looking at a 1978 Playboy. She asked if I found it in the basement. I said yes. Then I realized she was the centerfold. Today, I got in line at the grocery store. The woman in front of me looked right at me, turned to her friend, and said “That reminds me, I forgot to get acne cream.”",
        "Category": " Humor , Form , Anecdotes & Quotations",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "The Silver Sword (Puffin Modern Classics)",
        "Authors": "By Ian Serraillier~Piers Sandford",
        "Description": "",
        "Category": "",
        "Publisher": "PENGUIN BOOKS INDIA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Feng Shui Detective",
        "Authors": "By Vittachi, Nury",
        "Description": "Mr. Wong is a feng shui consultant, but his cases tend to involve a lot more than just interior decoration. You see, Wong specializes in a certain type of problem premises: crime scenes. He and his brash teenage Aussie-American ex-pat intern (think an Asian Sherlock Holmes paired up with Kelly Osbourne) travel around Singapore solving crimes while trying to decipher each other's language and behavior. His latest case involves a mysterious young woman who, according to a psychic reading, is doomed to die. Wong's desperate efforts to save her eventually lead him and his sidekick to Sydney where the story climaxes at the Opera House, a building known for its appalling feng shui. A delightful combination of crafty plotting, quirky humor, and Asian philosophy, the Feng Shui Detective is an investigator like no other!",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Everyday Encouragement (Spiritual Refreshment for Women)",
        "Authors": "By McQuade, Pamela",
        "Description": "These are just some of the topics covered in Everyday Encouragement, a faith-strengthening volume no woman should be without. This portable book contains over 200 powerful daily messages accompanied by a related scripture reading, providing food for the faithful, nourishment for the nurturer, wisdom for the woman. It's affordable enough for you to buy two - one for you and another as a gift to encourage a friend.",
        "Category": " Religion , Inspirational",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Leadership 101: Inspirational Quotes & Insights for Leaders (101 Series)",
        "Authors": "By Maxwell, John C.",
        "Description": "",
        "Category": "",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "365 Day Brighteners - Whispered Words of Encouragement",
        "Authors": "By dayspring",
        "Description": "",
        "Category": "",
        "Publisher": "Dayspring Cards",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Last Dance (The Soul Survivor Series)",
        "Authors": "By LaHaye, Tim F. and DeMoss, Bob",
        "Description": "Spring is about to give way to summer and love is in the air. It's the weekend after Memorial Day and the students of Huntingdon Valley High School are anxiously awaiting their prom. Heather Barnes has found the guy of her dreams, John Knox, a senior at a nearby high school whom she met in a Christian chat room. Although Heather has never actually \"met\" John in person, she plans to go to the prom with him against the advice of her best friend, Jodi Adams. Soon, Heather will discover John's true identity. Can Jodi, Bruce, and Kat rescue Heather before it's too late or will the prom be her last dance?",
        "Category": " Fiction , Religious",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Wisdom of the Buddha: The Unabridged Dhammapada (Dover Thrift Editions: Religion)",
        "Authors": "By Muller, F. Max (EDT)",
        "Description": "Few of the sacred texts of the world's great religions present their wisdom with the clear simplicity of the verses of the Buddhist Dhammapada, or Path to Virtue. Its direct style, clarity, and beauty place it at the forefront of Buddhist sacred literature, and its noble intent raises it to the highest level of humanity's spiritual guides. Easily accessible to any reader, the Dhammapada offers a wealth of wisdom for the novice, as well as the most ardent and experienced of spiritual seekers.Gathered by Buddhist masters into related groups — \"On Earnestness,\" \"Flowers,\" \"The Fool,\" \"The Wise Man,\" \"Happiness,\" \"Pleasure\" — these ancient texts transcend the limitations of time, tradition, and culture to express the ethical principle underlying all wise and compassionate philosophy and conduct. Here are the Four Truths that reveal the nature of the world and our lot in it; here also is the Eightfold Path, the way to enlightenment, incorporating the means to overcome the essential suffering revealed by the Four Truths as the essence of life. The Dhammapada serves as a coherent summation of the necessities for following the Eightfold Path as well as an encouraging and thought-provoking resource to consult along the way.Expressed with great beauty and translated with painstaking scholarship, this classic guide is certain to stimulate, challenge, and inspire students of religion and philosophy as well as all who thirst for enlightenment.",
        "Category": " Young Adult Nonfiction , Philosophy",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Father Ike's Stories for Children: Teaching Christian Values Through Animal Stories",
        "Authors": "By Powers, Isaias",
        "Description": "",
        "Category": "",
        "Publisher": "Twenty Third Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "The Girl of His Dreams",
        "Authors": "By Leon, Donna",
        "Description": "Donna Leon’s Commissario Guido Brunetti mysteries have won legions of fans for their evocative portraits of Venetian life. In her novels, home-cooked food, family, renaissance art, Italian history, and local politics play as central a role as an unsolved crime. The Girl of His Dreams opens with a major event in Brunetti’s family, and keeps the theme of family close to the fore. When a friend of Guido Brunetti’s brother, a priest recently returned from years of missionary work in Africa, calls on the Commissario with a request, Brunetti suspects the man has hidden motives. An American-style Christian sect has begun meeting in private homes in the city, and it’s possible the priest is merely apprehensive of the competition. Nevertheless, Brunetti and his wife, Paola, decide to go undercover. But when a girl’s body is found floating in a canal, Brunetti must put everything aside to investigate the secretive world of her people, the gypsies, who exist on the fringes of society. Thought provoking, eye opening, and profoundly moving, The Girl of His Dreams is classic Donna Leon—and a spectacular, heart-wrenching addition to the series.   “A showcase of nuanced characterization, acute observation and seamless plotting.”—The Washington Post",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Would You Rather...?",
        "Authors": "By Fields, Doug",
        "Description": "Ask away . . . and get your students talking with these provocative questions. Would You Rather . . .? gives you 465 stimulating either-or questions that will get your students talking, laughing, debating, and thinking. Questions like Would You Rather . . . watch a soap opera or make fun of one? . . . be gossiped about or lied to? . . .get shot from a cannon or walk a high wire? . . . make a child cry or kick a puppy? . . . attend the Last Supper or discover Jesus' empty tomb? You can use these questions anywhere, anytime -- when you want to break the ice, spark a discussion, build community, get kids to wrestle with spiritual issues, or just have fun. And the convenient size makes it easy to stick in your pocket or in the glove compartment of your car. This is one resource you'll want for every member of your ministry team!",
        "Category": " Religion , Christian Ministry , Youth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Beanie Mania Guidebook: Your Guide to Collecting Beanie Babies",
        "Authors": "By Phillips, Becky and Estenssoro, Becky",
        "Description": "",
        "Category": " Antiques & Collectibles , Teddy Bears & Stuffed Animals",
        "Publisher": "Dinomates",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Mr. Tickle (Mr. Men and Little Miss)",
        "Authors": "By Hargreaves, Roger",
        "Description": "You'll laugh until it hurts when Mr. Tickle goes on a terrific tickling spree!Back to the Mr. Men & Little Miss microsite.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Mr. Happy (Mr. Men and Little Miss)",
        "Authors": "By Hargreaves, Roger",
        "Description": "They're back!  Rediscover the zaniest characters you've ever met in this best-selling series which has sold millions worldwide.  Bright and charming, with easily recognizable characters and a small take-along format,  Mr. Men and Little Miss  books are easy enough for young readers, witty enough for humor-prone adults, and highly collectible for one and all. Also check your local listings to view the Mr. Men & Little Miss TV show.Back to the Mr. Men & Little Miss microsite.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Greatest Christmas Ever: A Treasury of Inspirational Ideas & Insights for an Unforgettable Christmas",
        "Authors": "By Author Not Indicated",
        "Description": "",
        "Category": "",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Little Miss Naughty (Mr. Men and Little Miss)",
        "Authors": "By Hargreaves, Roger (ILT)",
        "Description": "Mr. Men and Little Miss?Get ready for the second invasion of Little Miss and Little Mr. Men!  That's right - those zany, pint-sized characters are back. Easy enough for young readers and witty enough for adults!Little Miss Naughty terrorizes the neighborhood until she meets her match -- Mr. Impossible!Back to the Mr. Men & Little Miss microsite.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Mr. Sneeze (Mr. Men and Little Miss)",
        "Authors": "By Hargreaves, Roger",
        "Description": "Poor Mr. Sneeze-he lives in Coldland, where everyone has a cold! He's tired of sneezing all the time, so he goes on a journey to try to find some relief.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "TOY STORY/TOY STORY",
        "Authors": "By Depken, Kristen L.",
        "Description": "Buzz, Woody, Jessie, Bullseye, and the rest of the toys are back! This Deluxe Pictureback features two toy stories, plus more than 50 stickers—all just in time for the re-release of Toy Story and Toy Story 2 on DVD!",
        "Category": " Juvenile Fiction , Toys, Dolls & Puppets",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Baby Touch and Feel: Animals",
        "Authors": "By Dorling Kindersley, Inc. (COR)",
        "Description": "A small touch and feel book full of cuddly bunnies and other soft animals, this is a gift your little one is sure to adore.This USA Today bestselling board book encourages tiny fingers to explore and develop fine motor skills while building an early language foundation. Babies will meet adorable puppies, kittens, penguins, and other animals throughout the pages of the book.Filled with real-life animal photographs featuring touch-and-feel textures that help children develop their knowledge while increasing their use of senses, Baby Touch and Feel: Animals is the perfect size for small hands. Its padded cover can withstand biting and throwing while its thick sturdy board pages won't tear. Your baby can practice animal recognition and perfect animal noises while touching the novelty textures on the pages.With more than one million copies sold, Baby Touch and Feel: Animals is the perfect book for your child's bookshelf.Series description: Baby Touch and Feel books are the perfect series for the very youngest readers. These small, padded books excite babies and toddlers with their foil and touch-and-feel covers. Each book in this affordable series contains twelve vibrant interior pages with bold, engaging images. Containing large word labels, each page has foil or glitter to behold or a texture to touch. These safe novelty textures intrigue babies and are perfect for little fingers to feel. The Baby Touch and Feel series encourages sensory development, language skills, and early reading skills while teaching colors, shapes, patterns, opposites, and more.",
        "Category": " Juvenile Fiction , Concepts , Senses & Sensation",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Code of the Executive: Forty-Seven Ancient Samurai Principles Essential for Twenty-First Century Leadership Success",
        "Authors": "By Schmincke, Don",
        "Description": "More than a thousand years ago, a group of business executives developed a set of principles for organizational leadership in a competitive market. Those executives were the samurai of ninth-century Japan, and their rigid code of ethics, known as bushido, was one of the most effective frameworks for management in history.The Code of the Executive is business adviser Don Schmincke's modern interpretation of the Code of the Samurai—ancient wisdom written for today's corporate warriors. These principles provide a dynamic system of practical and moral training for effective leadership. In addition to interactive strategies for relating to the business world, this philosophy provides at its core a guide to the inner development necessary for consistent and long-term success.A terrific gift for a friend, relative, new graduate, or business associate, The Code of the Executive is filled with relevant wisdom and offers an enlightened path to business fulfillment.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "American Family of the Colonial Era Paper Dolls in Full Color (Dover Paper Dolls)",
        "Authors": "By Tierney, Tom",
        "Description": "Spanning three generations, an American colonial family of eight is shown in period attire in a variety of situations as they live out the drama of the American Revolution and its aftermath.The 32 authentic costumes are further enhanced by Tom Tierney's well-researched and scrupulously accurate text. Together they offer fashion and costume historians a precise, full-color view of prevailing fashions and trends of the late eighteenth century. Paper doll enthusiasts of all ages will delight in these finely rendered figures in typical Colonial raiment, while aficionados of Americana will follow with rapt attention this sartorial record of one family's progress through pre- and post-Revolution to a final frontier expedition.",
        "Category": " Juvenile Nonfiction , History , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Penny from Heaven",
        "Authors": "By Holm, Jennifer L.",
        "Description": "Newbery Honor–winning, New York Times–bestselling, and as full of fun and adventure as it is of deeper family issues--now with striking new cover art!    School’s out for summer, and Penny and her cousin Frankie have big plans to eat lots of butter pecan ice cream, swim at the local pool, and cheer on their favorite baseball team—the Brooklyn Dodgers! But sometimes things don’t go according to plan. Penny’s mom doesn’t want her to swim because she’s afraid Penny will get polio. Frankie is constantly getting into trouble, and Penny feels caught between the two sides of her family. But even if the summer doesn’t exactly start as planned . . . things can work out in the most unexpected ways!    Set just after World War II, this thought-provoking novel also highlights the prejudice Penny’s Italian American family must confront because people of Italian descent were “the enemy” not long ago.    Inspired by three-time Newbery Honor winner Jennifer Holm’s own Italian American family, Penny from Heaven is a story about families—about the things that tear them apart and the things that bring them back together.   Includes an author’s note with photographs and background on World War II, internment camps, and 1950s America, as well as additional resources and websites.  \"Holm's deft storytelling is at once rosy, rounded, and realistic.\" --San Francisco Chronicle",
        "Category": " Juvenile Fiction , Social Themes , Prejudice & Racism",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "The Remarkable Journey of Prince Jen",
        "Authors": "By Alexander, Lloyd",
        "Description": "On a pilgrimage to the great court of Yuan-Min, Prince Jen carries six gifts--a sword, a saddle, a flute, a bowl, a paint box, and a kite--and it is not until he loses the sword to Natha Yellow Scarf that he realizes the true potential of the gifts",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Spot's First Songs",
        "Authors": "By Eric Hill",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Dolphins (Our Wild World)",
        "Authors": "By McGee, John F. (ILT) and Vogel, Julia",
        "Description": "Where the animal lives, what it eats, when it sleeps, how it raises its young and much more.— Over 30 vivid, full color photos and illustration.— Sidebar Fun Facts, an index and a list of Internet Sites.",
        "Category": " Juvenile Nonfiction , Animals , Mammals",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Windsor Castle - English",
        "Authors": "By MacKworth-Young, Robin",
        "Description": "The historic fortress of Windsor Castle has been home to the sovereigns of England for over 900 years. This beautiful souvenir guide takes you on a room by room guided tour of the castle and chapel. Look out for more Pitkin Guides on the very best of British history, heritage and travel.",
        "Category": " Travel , Reference",
        "Publisher": "Pitkin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Transformers Revenge of the Fallen: Jumbo Coloring & Activity Book (Based on the new movie) by Unknown (2009) Paperback",
        "Authors": "By unknown",
        "Description": "",
        "Category": " Juvenile Fiction , Activity Books , General",
        "Publisher": "Bendon Publishing International, Inc.",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Marie Curie: A Brilliant Life (Snapshots: Images of People and Places in History)",
        "Authors": "By MacLeod, Elizabeth",
        "Description": "As a poor student in Paris, Marie Curie piled clothes --- and furniture --- on top of herself to keep warm at night. But Marie went on to become the first woman to win a Nobel Prize --- and also the first person to win this award twice. Marie Curie's discoveries in radiation changed the world. She became one of the most important women in science and her research is still important to scientists and doctors today. Radiation is used as a treatment for cancer and to produce electricity, kill organisms that spoil food and detect smoke in homes. This book in the Snapshots: Images of People and Places in History series introduces one of the most important women in science and her inspiring life.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Science & Technology",
        "Publisher": "Kids Can Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Helen Keller: A Determined Life (Snapshots: Images of People and Places in History)",
        "Authors": "By MacLeod, Elizabeth",
        "Description": "Imagine living in total silence and darkness. That's what Helen Keller's world was like after a childhood illness left her deaf and blind. Unable to express herself, she threw tantrums that earned her the nickname ?Little Bronco.? But Helen's teacher Annie Sullivan found the key to communicating with her. Only then was the little girl able to experience fully the world around her. Helen went on to become the first deaf and blind college graduate in the United States and worked all her life helping to educate others about people with disabilities.Using photographs, quotes, letters and drawings, this biography in the Snapshots: Images of People and Places in History series introduces young readers to Helen Keller. Also included are a timeline of her life and a list of places to visit to learn more about this inspirational woman.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , General",
        "Publisher": "Kids Can Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Windsor Castle:  Official Guide 1997",
        "Authors": "By john-martin-robinson",
        "Description": "",
        "Category": "",
        "Publisher": "The Royal Collection",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Sacrifice (Abram's Daughters, Book #3)",
        "Authors": "By Lewis, Beverly",
        "Description": "When Sadie Ebersol abandons the Amish community with her sister Leah's beloved Jonas, the family of four sisters is thrown into turmoil, forcing Leah to make difficult choices between her happiness and her loyalty to those closest to her. Simultaneous.",
        "Category": " Fiction , Religious",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    }
]