[
    {
        "Title": "Picasso at the Lapin Agile and Other Plays",
        "Authors": "By Martin, Steve",
        "Description": "Steve Martin is one of America's most treasured actors, having appeared in some of the most popular moves of our time. He is also an accomplished screenwriter who has in the past few years turned his hand to writing plays. The results, collected here, hilariously explore serious questions of love, happiness and the meaning of life; they are rich with equal parts of pain and slapstick humour, torment and wit.",
        "Category": " Drama , American , General",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Lost Harbor: The Controversy over Drake's California Anchorage",
        "Authors": "By Hanna, Warren L.",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Univ of California Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "We Grew It, Let's Eat It!",
        "Authors": "By Kenin, Justine and Lettenberger, Becky (PHT)",
        "Description": "DC twins Annie and Veda learn about the White House veggie garden and want to grow fruits and vegetables, too. But how can you do that if you live in an apartment? Watch the twins and senior gardener Ida work and play their way through planting, tending, and harvesting in a neighborhood community garden. Then comes the fun of preparing and eating simple, tasty, homegrown food!",
        "Category": " Juvenile Nonfiction , Gardening",
        "Publisher": "Tenley Circle Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Better Homes & Gardens Silly Snacks",
        "Authors": "By et al Darling",
        "Description": "",
        "Category": "",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Walls and Molding: How to Care for Old and Historic Wood and Plaster (Respectful Rehabilitation)",
        "Authors": "By Shivers, Natalie W",
        "Description": "",
        "Category": "",
        "Publisher": "Preservation Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "The Judas syndrome",
        "Authors": "By Farrell, James",
        "Description": "",
        "Category": "",
        "Publisher": "Fulton-Hall",
        "Price Starting With ($)": "14.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Critiques and Essays in Criticism, 1920-1948: Representing the Achievement of Modern British and American Critics.",
        "Authors": "By Robert Wooster. Stallman",
        "Description": "",
        "Category": "",
        "Publisher": "The Ronald Press Company",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1949"
        }
    },
    {
        "Title": "Chinese Love Pavilion",
        "Authors": "By Paul Scott",
        "Description": "",
        "Category": "",
        "Publisher": "Granada",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Understanding the Economy",
        "Authors": "By Alfred L. Malabre",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "10.6",
        "Publish Date": {
            "Month": "July",
            "Year": "1977"
        }
    },
    {
        "Title": "Arab Economic Integration: Between Hope and Reality",
        "Authors": "By Galal, Ahmed (EDT) and Hoekman, Bernard M. (EDT)",
        "Description": "A Brookings Institution Press and the Egyptian Center for Economic Studies (ECES) publicationImproving the economic performance of Arab countries is now more critical than ever. The region faces high population growth rates, rising unemployment, and modest economic growth coupled with increasingly intense competition from emerging markets in eastern Europe, Latin America, and Asia. Meeting these challenges requires finding ways to overcome political obstacles that impede socially beneficial economic reforms. Despite fifty years of repeated attempts at Arab economic integration, the results in terms of intraregional trade and investment flows have been very modest. This book explains why and discusses possible ways forward. The authors draw especially on the success of the European Union to assess the scope of Arab economic integration as an instrument for narrowing the persistent gap between the region¡¯s economic potential and its performance.",
        "Category": " Business & Economics , International , Economics",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Under Whatever Sky",
        "Authors": "By edman, irwin",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "Wolfgang Puck's Modern French Cooking for the American Kitchen",
        "Authors": "By Puck, Wolfgang",
        "Description": "The chef of Los Angeles's Ma Maison restaurant offers more than 200 recipes, based on la nouvelle cuisine, adapted to American ingredients and methods, and includes tips on presentation and wine and seasonal menus",
        "Category": " Cooking , Regional & Ethnic , French",
        "Publisher": "Houghton Mifflin (P)",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "What Mrs. McGillicuddy Saw",
        "Authors": "By Christie, Agatha, Illustrated by Cover Art",
        "Description": "",
        "Category": "",
        "Publisher": "N . Y.: Pocket, 1970",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Complete Idiot's Guide to Publishing Magazine Articles",
        "Authors": "By Bykofsky, Sheree, Sander, Jennifer Basye, and Rominger, Lynne",
        "Description": "You’re no idiot, of course. You have a reporter’s eye, a poet’s touch, and you absolutely love to write. Stories, journal entries, letters to the editor—you name it, you know you can write it. But when it comes to selling your ideas to magazines, newspapers and web sites, you feel like the less said, the better. Seeing your words and wisdom printed in black and white seems like a lot more trouble than it’s worth.    Don’t write yourself off just yet! The Complete Idiot’s Guide® to Publishing Magazine Articles will help get you where you belong—in print. In this Complete Idiot’s Guide®, you get answers to all your questions:",
        "Category": " Language Arts & Disciplines , Publishing",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "120 Diseases: The Essential Guide to More Than 120 Medical Conditions, Syndromes and Diseases",
        "Authors": "By peter-abrahams",
        "Description": "",
        "Category": "",
        "Publisher": "Amber Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Crisis in the classroom;: The remaking of American education",
        "Authors": "By Silberman, Charles E.",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Men's Health Total-Body Health & Fitness Guide 2010",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale",
        "Price Starting With ($)": "8.78",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Boy Scout Requirements 1969",
        "Authors": "By Boy Scouts of America",
        "Description": "",
        "Category": "",
        "Publisher": "Boy Scouts of America",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "James Stewart: A Biography",
        "Authors": "By Dewey, Donald",
        "Description": "In the most penetrating and in-depth biography yet written about the beloved screen icon, award-winning author Donald Dewey delves beneath the persona into the usually unremarked turmoil of the actor's private life and behind the earnest Capraesque image so often accepted as the Stewart identity. He draws upon extensive research and nearly two hundred interviews with childhood neighbors, fellow workers, old loves, airmen who flew with Stewart during World War II, as well as with close and estranged family members and friends.This riveting biography follows Stewart from his hometown of Indiana, Pennsylvania, and a childhood shaped by a strong-willed father, to the fateful encounter at Princeton University with actress Margaret Sullavan, to his first professional theatrical experiences on Cape Cod, and the forging of a remarkable life-long friendship with Henry Fonda in New York, to his unexpected stardom at MGM.During WWII, Stewart rushed to enlist in the Army Air Corps, and details of his heroic military record are disclosed here for the first time.Dewey explores the craft behind a trademark Stewart performance, and discusses in detail each of the more than seventy-five movies in Stewart's filmography.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Turner Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Origins of Tolkien's Middle-earth For Dummies",
        "Authors": "By Harvey, Greg and Siewers, Alfred (FRW)",
        "Description": "J.R.R. Tolkien's novels of Middle-earth – The Hobbit, The Lord of the Rings trilogy, and The Silmarillian – have become some of the most famous, and most beloved, literary works of the twentieth century. And the Lord of the Rings films by director Peter Jackson have re-ignited interest in Tolkien and his works, as well as introduced his stories to a new generation of fans.  Even if you've never read the novels and have only seen the films, you know that the world of Middle-earth is a complicated one. Tolkien took great care in representing this world, from creating new languages to including very particular cultural details that add to the richness of the world's fabric. Many other books have been written about Tolkien and his works, but none have come close to providing the kind of reference needed to comprehend the world of Middle-earth. That's what veteran Dummies author and unabashed Tolkien fan Greg Harvey attempts to do in The Origins of Tolkien's Middle-earth For Dummies. As the author says in his introduction to the book, this is not an encyclopedia or quick guide to all the diverse beings, languages, and history that make up Tolkien's Middle-earth. Nor is it a set of plot outlines for the novels. Rather, what you'll find in The Origins of Tolkien's Middle-earth For Dummies is a basic guide to some of the possible linguistic and mythological origins of Middle-earth, plus a rudimentary analysis of its many themes and lessons for our world. This book can help enrich your reading (or re-reading) of Tolkien's novels, and it will challenge you to think about the themes inherent in Tolkien's Middle-earth and their implications in your own life. Here's just a sampling of the topics you'll find covered in The Origins of Tolkien's Middle-earth For Dummies:  Exploring the main themes in Tolkien's works, including immortality and death; the heroic quest; love; fate and free will; and faith and redemption Investigating the diverse lands of Middle-earth – including the Shire, Gondor, and Mordor – and their significance Examining the different cultures of Middle-earth, such as Hobbits, Elves, Men, and those wily Wizards Touring the history of Middle-earth Understanding Tolkien's creation of new languages to enrich the story of Middle-earth Top Ten lists on the battles in the War of the Ring, online resources, and the ways the films differ from the novels  So, whether you're reading Tolkien's novels or watching the films for the first time, or you've been a fan for many years and are looking for a new take on Tolkien's works, The Origins of Tolkien's Middle-earth For Dummies can help you enhance your reading or viewing experience for years to come.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Wiley Publishing",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Great Feuds In History - Ten Struggles That Shaped The World",
        "Authors": "By Evans, Colin",
        "Description": "",
        "Category": "",
        "Publisher": "Fall River Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Devil In Massachusetts (Anchor Book A682)",
        "Authors": "By Starkey, Marion L.",
        "Description": "",
        "Category": "",
        "Publisher": "Anchor Books Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Black Holes",
        "Authors": "By John G. Taylor",
        "Description": "",
        "Category": "",
        "Publisher": "Avon Books, 1973",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Perspective on the Nature of Geography",
        "Authors": "By Hartshorne, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "6.34",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "As the Crow Flies: Through the Seasons",
        "Authors": "By Miller, Elinor",
        "Description": "",
        "Category": "",
        "Publisher": "the Author",
        "Price Starting With ($)": "12.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Math Skillbuilders (Grades 1 - 2) (Step Ahead)",
        "Authors": "By Golden Books",
        "Description": "Get a head start on being smart with this deluxe Step Ahead workbook, complete with over 70 colorful stickers!   You and your child will discover the joy of learning at home with this illustrated activity book. Carefully planned by first and second grade teachers to complement the school curriculum, it provides positive learning experiences through a variety of appealing activities, including:  • Learning about measurement• Practicing adding and subtracting • Learning about time",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Pittsburgh: The Story of an American City",
        "Authors": "By Lorant, Stefan",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Company, Inc c1964",
        "Price Starting With ($)": "32.37",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "A Curable Romantic",
        "Authors": "By Skibell, Joseph",
        "Description": "I fell in love with Emma Eckstein the moment I saw her from the fourth gallery of the Carl Theater, and this was also the night I met Sigmund Freud.” So goes the life, times, and loves of Dr. Jakob Sammelsohn, a fairly incurable romantic venturing optimistically through modern history. In this inventive and satiric tour de force, Joseph Skibell, award-winning author of A Blessing on the Moon, presents a picaresque novel of exile that could spring only from the imagination of a virtuoso.",
        "Category": " Fiction , Jewish",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Master Index: An Illustrated Guide (The Civil War)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "George Washington, the Father of our Country;",
        "Authors": "By Koral, Bella",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1954"
        }
    },
    {
        "Title": "All-Time Favorite 30-Minute Meals (Southern Living)",
        "Authors": "By Liles, Jean Wickstrom (EDT)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Lonely Planet Jordan",
        "Authors": "By Greenway, Paul and Ham, Anthony",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Lonely Planet Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Union Ghosts",
        "Authors": "By Crites, Susan",
        "Description": "",
        "Category": "",
        "Publisher": "Butternut Pubns",
        "Price Starting With ($)": "6.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Postwar German Literature: a Critical Introoduction",
        "Authors": "By Peter Demetz",
        "Description": "",
        "Category": "",
        "Publisher": "Pegasus",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The Rough Guide to Jordan",
        "Authors": "By Teller, Matthew",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Rough Guides",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Random House Webster's School and Office Thesaurus Revised and Updated",
        "Authors": "By O'Connor, Joyce (EDT) and Pearsons, Enid (EDT)",
        "Description": "This updated thesaurus is an indispensable reference tool for the novice and the experienced wordsmith alike. Here is a quick, simple way to a richer vocabulary. Always find just the right word, whether for a personal letter, a term paper, a business report, a work of fiction, or e-mail.Authoritative and Comprehensive:-- The hundreds of thousands of synonyms and antonyms from the renowned Random House College Thesaurus, expanded and updated-- Over 11,000 main entries-- Over 400 synonym studies, at important entries like beat, goodness, modest, and revenge.-- A special New-Words section, with an inside look at the latest, most current vocabularyEasy To Use and Portable:-- An A-Z format as familiar as your family dictionary-- Usage labels, language labels, and parts of speech clearly marked-- Words grouped together by meanings, fields of interest, and usage levels-- Clean, readable type-- More accessible than ever in this new paperback edition",
        "Category": " Reference , Dictionaries",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Western Garden Problem Solver",
        "Authors": "By",
        "Description": "Examines some of the most common garden pests and plant diseases found in Western gardens, and offers advice on damage control",
        "Category": " Gardening , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "6.38",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Modern Prints and Drawings",
        "Authors": "By SACHS, PAUL J.",
        "Description": "",
        "Category": "",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1954"
        }
    },
    {
        "Title": "The magazine: Everything you need to know to make it in the magazine business",
        "Authors": "By Mogel, Leonard",
        "Description": "The publisher of National Lampoon and Heavy Metal discusses the pros and cons of starting your own magazine, from raising seed money and attracting advertisers to editing, printing, and promotion",
        "Category": "",
        "Publisher": "Globe Pequot Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Froggy Eats Out",
        "Authors": "By Remkiewicz, Frank (ILT) and London, Jonathan",
        "Description": "It's a special occasion, so Froggy and his parents are going to eat dinner in a fancy restaurant. When they arrive at the restaurant, Froggy's mom has a few rules for him: \"Be neat, be quiet, and don't put your feet on the table.\" But it's so hard for Froggy to sit still. He fidgets, he squirms, and he sssllluuuurrrrpppps his spaghetti. Then he spots Frogilina across the restaurant-now it's impossible for Froggy to follow the rules!",
        "Category": " Juvenile Fiction , Social Themes , Manners & Etiquette",
        "Publisher": "PUFFIN BOOKS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Delphi",
        "Authors": "By Manolis Andronicos",
        "Description": "",
        "Category": "",
        "Publisher": "Ekdotike Athenon",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Frostfire (Kyndred, Book 3)",
        "Authors": "By Viehl, Lynn",
        "Description": "A genetically enhanced Kindred who can read and control the minds of animals, Lilah, after rescuing a group of kids from a wayward bear, is kidnapped, along with a critically wounded soldier from Afghanistan, by a biotech company willing to murder to acquire superhuman DNA. Original.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Memoir of an Alcoholic American Spy",
        "Authors": "By Anderson, Allen",
        "Description": "",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Arbor Books",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Abraham Lincoln The War Years; Volume Four",
        "Authors": "By Sandburg, Carl",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace* Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1939"
        }
    },
    {
        "Title": "How Your Church Family Works: Understanding Congregations as Emotional Systems (Church Leader's Core Library)",
        "Authors": "By Steinke, Peter L.",
        "Description": "Drawing on the work of Bowen, Friedman, and his own many years' counseling experience, Peter Steinke shows how to recognize and deal with the emotional roots of such issues as church conflict, leadership roles, congregational change, irresponsible behavior, and the effect of family of origin on current relationships. Discover why working relationships may be \"stuck\" in certain behaviors. Psychologically sound, theologically grounded, and practically illustrated with case studies,How Your Church Family Works will help you better understand how your congregation works and how to keep it healthy. Featuring a new preface and a fresh redesign, the book is a classic work by one of the most respected names in congregational consulting.",
        "Category": " Religion , Reference",
        "Publisher": "Alban Institute",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Citrus County",
        "Authors": "By Brandon, John",
        "Description": "There shouldn’t be a Citrus County. Teenage romance should be difficult, but not this difficult. Boys like Toby should cause trouble but not this much. The moon should glow gently over children safe in their beds. Uncles in their rockers should be kind. Teachers should guide and inspire. Manatees should laze and palm trees sway and snakes keep to their shady spots under the azalea thickets. The air shouldn’t smell like a swamp. The stars should twinkle. Shelby should be her own hero, the first hero of Citrus County. She should rescue her sister from underground, rescue Toby from his life. Her destiny should be a hero’s destiny.",
        "Category": " Fiction , Literary",
        "Publisher": "McSweeney's",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Sir Fartsalot Hunts the Booger",
        "Authors": "By Gilpin, Stephen (ILT) and Bolger, Kevin",
        "Description": "Things really stink in the Kingdom of Armpit. King Reginald the Not Very Realistic has had it up to here with his practical joker of a son Prince Harry. Even Sir Bedwetter can?t take the prince?s Royal Clowning Around! Enter Sir Fartsalot?the bravest, boldest, er, most potent knight in all the land! He?s on a quest to solve the riddle of the Foul West Wind?a ghastly odor that turns up whenever danger is lurking. Prince Harry decides to play the biggest, boogeriest prank of all time! He convinces Sir Fartsalot that The Booger, a frightful and repulsive villain, is on the prowl. But when a real Booger turns up, Harry, Sir Fartsalot and the knight?s old buddy Sir Knotaclew must set out on a hilarious quest to rid the world of the Snotty Scoundrel, once and for all!",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Razorbill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "As You Like It (Bantam Classic)",
        "Authors": "By Shakespeare, William and Bevington, David (EDT)",
        "Description": "This wisely funny comedy, which contains some of Shakespeare’s loveliest poetry, contrasts a court’s world of envy and rivalry with a forest’s world of compassion and harmony. In the Forest of Arden, the banished young heroine, Rosalind, disguised as a gentleman farmer, encounters an extraordinary assemblage of characters, including a fool, a malcontent traveler, her own banished father, and the banished young man she loves. Romantic happiness triumphs, even as we laugh at the excesses of love, at the ways of court and countryside, indeed, at everything, in this masterpiece of comic writing.Each Edition Includes:• Comprehensive explanatory notes • Vivid introductions and the most up-to-date scholarship • Clear, modernized spelling and punctuation, enabling contemporary readers to understand the Elizabethan English• Completely updated, detailed bibliographies and performance histories • An interpretive essay on film adaptations of the play, along with an extensive filmography",
        "Category": " Drama , Shakespeare",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "A Wrinkle in Time (A Wrinkle in Time Quintet)",
        "Authors": "By L'Engle, Madeleine",
        "Description": "Madeleine L'Engle's ground-breaking science fiction and fantasy classic, soon to be a major motion picture.It was a dark and stormy night; Meg Murry, her small brother Charles Wallace, and her mother had come down to the kitchen for a midnight snack when they were upset by the arrival of a most disturbing stranger.\"Wild nights are my glory,\" the unearthly stranger told them. \"I just got caught in a downdraft and blown off course. Let me sit down for a moment, and then I'll be on my way. Speaking of ways, by the way, there is such a thing as a tesseract.\"A tesseract (in case the reader doesn't know) is a wrinkle in time. To tell more would rob the reader of the enjoyment of Miss L'Engle's unusual book. A Wrinkle in Time, winner of the Newbery Medal in 1963, is the story of the adventures in space and time of Meg, Charles Wallace, and Calvin O'Keefe (athlete, student, and one of the most popular boys in high school). They are in search of Meg's father, a scientist who disappeared while engaged in secret work for the government on the tesseract problem.A Wrinkle in Time is the winner of the 1963 Newbery Medal. It is the first book in The Time Quintet, which consists of A Wrinkle in Time, A Wind in the Door, A Swiftly Tilting Planet, Many Waters, and An Acceptable Time.A Wrinkle in Time is soon to be a movie from Disney, directed by Ava DuVernay, starring Storm Reid, Oprah Winfrey, Reese Witherspoon and Mindy Kaling.This title has Common Core connections.Books by Madeleine L'EngleA Wrinkle in Time QuintetA Wrinkle in TimeA Wind in the DoorA Swiftly Tilting PlanetMany WatersAn Acceptable TimeA Wrinkle in Time: The GraphicNovel by Madeleine L'Engle; adapted & illustrated by HopeLarson: A graphic novel adaptation of Madeleine L'Engle's ground-breakingscience fiction and fantasy classic.Intergalactic P.S. 3 by Madeleine L'Engle; illustrated by Hope Larson: Astandalone story set in the world of A Wrinkle in Time!The Austin Family ChroniclesMeet the Austins (Volume 1) The Moon by Night (Volume 2) The Young Unicorns (Volume 3)A Ring of Endless Light (Volume 4) A Newbery Honor book!Troubling a Star (Volume 5)The Polly O'Keefe booksThe Arm of the StarfishDragons in the WatersA House Like a LotusAnd Both Were YoungCamillaThe Joys of Love",
        "Category": " Young Adult Fiction , Science Fiction , General",
        "Publisher": "Square Fish",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "A Wind in the Door (A Wrinkle in Time Quintet)",
        "Authors": "By L'Engle, Madeleine",
        "Description": "It is November. When Meg comes home from school, Charles Wallace tells her he saw dragons in the twin's vegetable garden.  That night Meg, Calvin and C.W. go to the vegetable garden to meet the Teacher (Blajeny) who explains that what they are seeing isn't a dragon at all, but a cherubim named Proginoskes.  It turns out that C.W. is ill and that  Blajeny and Proginoskes are there to make him well – by making him well, they will keep the balance of the universe in check and save it from the evil Echthros.  Meg, Calvin and Mr. Jenkins (grade school principal) must travel inside C.W. to have this battle and save Charles' life as well as the balance of the universe.",
        "Category": " Young Adult Fiction , Science Fiction , General",
        "Publisher": "Square Fish",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "McCloud's Woman (McCloud Brothers)",
        "Authors": "By Rice, Patricia",
        "Description": "From the remarkably talented Patricia Rice comes a new novel about passion and dreams, old insecurities and new outlooks, and finally finding the truth of one’s heart. . . .A lot has happened to Mara Simon since she was a teenager. And although on the inside she’s still the sweet, sensitive girl she was back then, the face she shows the world is that of a beautiful, high-powered Hollywood producer with a movie to make and a schedule to keep. She can’t let the fact that Tim McCloud, her first and only love, has turned up on her set rattle her.  With so much riding on the success of this film, all she can do is ignore the way his presence makes her rethink everything she thought she wanted out of life and turns her steely façade to jelly.Tim McCloud didn’t even recognize her when she walked into his office.  The girl he knew had been replaced with a sizzling bombshell. Underneath the paint and glitter Tim sees that the girl he used to love has become a woman with an incredible mind and a loving heart.  Their goals are wildly different but he can’t ignore the fact that her presence makes him rethink everything he thought he wanted out of life.   Now, to win her back, he must show her the difference between Hollywood artifice and real happiness. . . .",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Highland Enchantment (Highland Brides)",
        "Authors": "By Greiman, Lois",
        "Description": "A chance meeting with her childhood sweetheart Liam, a poor orphan, brings a forbidden love to Rachel Forbes, the daughter of a powerful Scottish laird, but the difference between their stations could threaten a lifetime of love. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Contemporary Issues in Curriculum (3rd Edition)",
        "Authors": "By Ornstein, Allan C. (EDT), Behar-Horenstein, Linda S. (EDT), and Pajak, Edward (EDT)",
        "Description": "Curriculum and philosophy. Philosophy as a basis for curriculum decisions / Allan C. Ornstein -- Goals and objectives / Ronald S. Brandt and Ralph W. Tyler -- Alternative curriculum conceptions and designs / M. Frances Klein -- A pedagogy of possibility / Peter McLaren -- Art and imagination / Maxine Greene -- There's too much to teach / Jane Roland Martin -- Curriculum and teaching. Teaching themes of care / Nel Noddings -- The heart of a teacher / Parker J. Palmer -- Critical issues in teaching / AllenC. Ornstein -- Productive teachers / Herbert J. Wahlberg -- Knowledge and teaching / Lee S. Schulman -- Beyond anxiety and nostalgia / Andy Hargreaves -- Curriculum and learning. Grappling / Theodore R. Sizer and Nancy Faust Sizer -- Critical thinking - what can it be? / Matthew Lipman -- Creating creative minds / Robert J. Sternberg and Todd I. Lubart -- The cognitive-developmental approach to moral education / Alfie Kohn -- Assessment, student confidence, and school success / Richard J. Stiggins -- Curriculum and instruction. The search for methods of instruction / Benjamin S. Bloom -- A new look at school failure and school success / William Glasser -- What does it mean to say that a school is doing well? / Elliot w. Eisner -- Teaching and teacher accountability / Allan C. Ornstein -- Realizing the promise of standards-based education / Michael J. Schmoker and Robert J. Marzano -- Educating the net generation / Don Tapscott -- Curriculum and supervision. Teacher learning that supports student learning/ Linda Darling-Hammond -- The politics of virtue : a new framework for school leadership / Thomas J. Sergiovanni -- Five models of staff development for teachers / Dennis Sparks and Susan Loucks-Horsley -- The evolution of peer coaching / Beverly Showers and Bruce Joyce -- Results-oriented professional development / Thomas R. Guskey -- Clinical supervision and psychological functions / Edward F. Pajak -- Curriculum and policy. Educational demographics : what teachers should know / Harold Hodgkinson -- Creating school, family, and community partnerships / Joyce L. Epstein -- Challenges for educators : lesbian, gay, and bisexual families / James T. Sears -- Limiting students' school success and life chances / Jeannie S. Oakes -- The costs of sustaining educational change through comprehensive school reform / Allan Odden -- Dichotomizing educational reform / Carl D. Glickman.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Moon Handbooks Chile",
        "Authors": "By Bernhardson, Wayne",
        "Description": "",
        "Category": " Travel , South America , General",
        "Publisher": "Moon Travel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Michelin Green Guide: Provence",
        "Authors": "By",
        "Description": "",
        "Category": " Travel , Europe , General",
        "Publisher": "Michelin Travel Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "It Can Happen to Anybody",
        "Authors": "By bixler, r",
        "Description": "",
        "Category": "",
        "Publisher": "Whitaker Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The versatiles;: A study of supporting character actors and actresses in the American motion picture, 1930-1955,",
        "Authors": "By Twomey, Alfred E",
        "Description": "",
        "Category": "",
        "Publisher": "A. S. Barnes",
        "Price Starting With ($)": "5.28",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Oriental Rugs",
        "Authors": "By Mumford, L. K.",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Rick Steves' French, Italian & German Phrase Book and Dictionary (Rick Steves Language Series)",
        "Authors": "By Steves, Rick",
        "Description": "",
        "Category": " Travel , Reference",
        "Publisher": "John Muir Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "1861-1865 The Adventure of the Civil War Told in Pictures",
        "Authors": "By Irving Werstein",
        "Description": "",
        "Category": "",
        "Publisher": "Pageant Books",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "The Machinery of Nature",
        "Authors": "By Ehrlich, Paul R.",
        "Description": "This explanation of ecology, written specifically for nonscientists emphasizes the relationships of living things and their environment and the delicate balance of natural ecosystems",
        "Category": " Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "Timeline of Kings & Queens : From Charlemagne to Elizabeth II",
        "Authors": "By Kerr, Gordon",
        "Description": "",
        "Category": "",
        "Publisher": "Canary Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Building a Contagious Church",
        "Authors": "By Mittelberg, Mark",
        "Description": "Discover A Proven Approach to Raising Your Church’s Evangelistic TemperatureEvangelism. It’s one of the highest values in the church. So why do so few churches put real time, money, and effort into it? Maybe it’s because we don’t understand the evangelistic potential of the church well enough to get excited about it.Building a Contagious Church will change that.This provocative book dispels outdated preconceptions and reveals evangelism as it really can be, radiant with the color and potential of the body of Christ and pulsing with the power of God. What’s more, it walks you through a 6-Stage Process for taking your church beyond mere talk to infectious energy, action, and lasting commitment. Think it can’t happen? Get ready for the surprise of your life! You and your church are about to become contagious!Most church leaders would agree there’s nothing more important than evangelism—after all, eternities hang in the balance! Yet eighty-six percent of pastors admit that their church falls far short when it comes to actually doing something about it. Perhaps your church is like that, but you’re unsure of what to do.That’s about to change. If you long to infect your church with Great Commission fever, then challenge every member of your leadership team to read this book! Building a Contagious Church will help you customize an evangelistic strategy that really works—not just for a while, but for the long haul.Developed by one of today’s foremost leaders, educators, and practitioners of evangelism—the principal author of the highly effective Becoming a Contagious Christian curriculum—this book’s revolutionary insights have proved themselves time and again in all kinds of settings. So dare to get excited! This dynamic, highly adaptable approach is created to work not for some other church, but for your church. If you’re ready for your leaders, members, and ministries to become fervent about reaching lost people for Christ and effective at doing so, Mark Mittelberg describes in detail how you can tailor-make:A Contagious Plan—Define the what, why, and how of your church’s outreach to people in the neighborhoods all around you. A Contagious Change Process—Follow a 6-Stage Process that will help you raise the evangelistic temperature of your church, starting with the hearts of the leaders Contagious Diversity—Learn to maximize outreach to all kinds of non-Christians by developing ministries and events around the six different evangelism styles. Contagious Ministry—Find out how to unleash the kind of genuine, empowered ministry in your church that will impact your community—and your world.“It doesn’t matter whether your church is large or small, old or new, urban or suburban, upscale or downscale, high church or low church,” says Mittelberg. “Regardless of where you’re starting from, I’m confident that in the power of the Holy Spirit, you can take significant steps toward making your ministry more outwardly focused and evangelistically fruitful.”Get ready for a revolution in how your people view and do evangelism. And prepare for the joyous adventure of aligning yourselves with God’s agenda of reaching and transforming human hearts.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "From the Holy Mountain: A Journey among the Christians of the Middle East",
        "Authors": "By Dalrymple, William",
        "Description": "In 587 a.d., two monks set off on an extraordinary journey that would take them in an arc across the entire Byzantine world, from the shores of the Bosphorus to the sand dunes of Egypt. On the way John Moschos and his pupil Sophronius the Sophist stayed in caves, monasteries, and remote hermitages, collecting the wisdom of the stylites and the desert fathers before their fragile world finally shattered under the great eruption of Islam. More than a thousand years later, using Moschos's writings as his guide, William Dalrymple sets off to retrace their footsteps and composes \"an evensong for a dying civilization\" --Kirkus Reviews, starred review",
        "Category": " Travel , Middle East , General",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Aching for Always",
        "Authors": "By Cready, Gwyn",
        "Description": "RITA Award–winning author Gwyn Cready continues the “sexy fun” (BookPage) of her charming time-travel adventures with a high-spirited tale of a modern-day mapmaker and the eighteenth-century English navy captain she can’t resist.Ambitious and feisty Josephine “Joss” O’Malley has spent years fighting to keep her mother’s map-making company alive. Just when she finds herself considering taking a risky next step with bad-boy entrepreneur Rogan Reynolds— whose generosity has helped keep the business afloat—Joss meets dark and mysterious Hugh Hawksmoor. Hugh’s deft touch and old-world seduction stir Joss’s desires like a storm at sea, and she has no clue that he has sailed three hundred years into the future to avenge the death of his brother at the hands of her father. Or that she holds the key to a map that will help him undo the destructive changes her father wrought in the past. When Hugh lures Joss into a treacherous journey through time, there’s not a twenty-first-century trick that can save her. But when she applies her own instincts to a course she thought was set, she discovers that the high seas hold some scandalous surprises.",
        "Category": " Fiction , Romance , Time Travel",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Stupid Sock Creatures: Making Quirky, Lovable Figures from Cast-off Socks",
        "Authors": "By Murphy, John",
        "Description": "",
        "Category": "",
        "Publisher": "Union Square & Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Royal Westminster",
        "Authors": "By Hunting, Penelope",
        "Description": "",
        "Category": "",
        "Publisher": "RICS.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "A Redneck Bites the Big Apple",
        "Authors": "By Whaley, Bo",
        "Description": "Provides a humorous look at New York and its people as seen through the eyes of the author, a Georgia boy, during his six years there",
        "Category": " Humor , General",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "7.0",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Letters to Our Daughters: Mothers' Words of Love",
        "Authors": "By Van Raden, Kristine (EDT) and Davis, Molly (EDT)",
        "Description": "Collects over 40 mothers' letters written to their daughters speaking with love, admiration, grief, gratitude, regret, and amazement about the struggles and joy of motherhood.  Tear- jerking text and inspiring, b&w photographs. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Social Science , Sociology , Marriage & Family",
        "Publisher": "Beyond Words Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Lord, Make My Life a Miracle!",
        "Authors": "By Ortlund, Raymond C.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Gospel Light Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1974"
        }
    },
    {
        "Title": "Collins Complete Works of William Shakespeare",
        "Authors": "By Shakespeare, William, Alexander, Peter (editor)",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins, Glascow",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Wild Dogs: The Wolves, Coyotes, and Foxes of North America",
        "Authors": "By Bauer, Erwin A and Bauer, Peggy (PHT)",
        "Description": "Describes the habitat, behavior, and characteristics of gray wolves, red wolves, coyotes, and red, gray, and Arctic foxes",
        "Category": " Nature , Animals , Mammals",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "My Truck is Stuck!",
        "Authors": "By Lewis, Kevin and Kirk, Daniel (ILT)",
        "Description": "My Truck Is Stuck.  Rotten luck.  Can't go!  My truck is stuck.  Tug and tow.  Two engines roar.  But the truck won't go.  Not one inch more. Does anyone know how to make my stuck truck go?  In this lyrical read-aloud, young drivers are introduced to the ins and outs of hauling, beeping, and repairing -- get ready for a fun ride!",
        "Category": " Juvenile Fiction , Transportation , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Pirates (Crabapples)",
        "Authors": "By Kalman, Bobbie and Nickles, Greg",
        "Description": "Presents information about pirates in the seventeenth and eighteenth centuries including their names, ships, crews, clothing, flags, weapons, and life at sea. Suggests games and activities.",
        "Category": " Juvenile Nonfiction , People & Places , General",
        "Publisher": "Crabtree Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Just Enough Portuguese",
        "Authors": "By Ellis, D. L. and McLaughlin, K. Sandeman",
        "Description": "Each book in this series provides just the right phrases to get by and be easily understood in everyday situations in foreign countries.  Travelers will appreciate these essential phrases for crossing borders; changing money; asking directions; meeting people; and finding accommodations, the post office, telephones, shopping areas, and transportation.",
        "Category": " Foreign Language Study , Portuguese",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Of Men and Mountains",
        "Authors": "By William O. Douglas",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Brothers",
        "Price Starting With ($)": "19.25",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "Agnes. The flood of '72",
        "Authors": "By Rodgers, Al",
        "Description": "",
        "Category": "",
        "Publisher": "Markey Graphics",
        "Price Starting With ($)": "12.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Titanic Disaster: As Reported in the British National Press, April-July 1912",
        "Authors": "By Bryceson, Dave",
        "Description": "At 46,328 tons, the RMS Titanic was the largest ship afloat in 1912 and also the largest moving object ever made by man. It was also the most luxurious, boasting many features unheard of in oceangoing liners. It was considered \"unsinkable.\" On the morning of Wednesday, April 10, 1912, the pride of the White Star Line slowly began its journey into infamy. On the evening of Monday the 15th, strange, unbelievable rumors began their spread, chiefly around Belfast, Liverpool, Southampton, and London, cities having links to the new, great, and powerful Atlantic liner. How could anything have gone wrong? Surely it was impossible.The newspaper headlines the following morning were to shake the whole of Britain, and indeed the world, with the news that tragedy had befallen the Titanic. With many, often conflicting, reports over the next months, the full story of the disaster slowly unfolded in subsequent editions of the press. The dramatic reports from the British press are presented here in full: accounts from the first headlines to the end of the first inquiry, followed by eager readers around the world. These stories and photographs combine in a book that will appeal to general readers and Titanic followers alike.",
        "Category": " Transportation , Ships & Shipbuilding , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Sizzle: A Novel (Buchanan-Renard)",
        "Authors": "By Garwood, Julie",
        "Description": "#1 New York Times bestselling author Julie Garwood’s trademark mix of dazzling love stories, unforgettable characters, and riveting suspense never fails to keep readers turning the pages late into the night. In red-hot Sizzle, she turns up the heat even higher.  Lyra Prescott, a Los Angeles film student, is closing in on graduation and dives into work on her final filmmaking assignment: a documentary transformed by a twist of fate into a real-life horror film. While working on her project, a rash of mysterious incidents convince Lyra that she’s trapped in a sinister scenario headed for a violent ending. Running scared, she turns to her best friend, Sidney Buchanan, whose connections bring devilishly handsome FBI agent Sam Kincaid into Lyra’s life. As the noose of intrigue tightens, the passion between Lyra and Sam escalates with dangerous intensity. With the rugged FBI agent beside her, Lyra must learn to let down her defenses and follow her heart—even if that leads to deadly peril. “Sizzle most satisfying . . . If a book has Julie Garwood’s name on it, it’s guaranteed to be a meticulously written, well thought-out, and thoroughly engaging story.”—Sun Journal",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Spring of Violence",
        "Authors": "By Shannon, Dell",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "It's About Home: Creating a Place to Cherish",
        "Authors": "By Clairmont, Patsy and Grant, Janet Kobobel",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Vine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Civil War Memories",
        "Authors": "By Joshi, S. T. (EDT)",
        "Description": "Civil War Memories is a collection of nineteen stories of the Civil War written in the late 1800's, giving them a ring of authenticity. The voices are both Northern and Southern, male and female, angry and melancholy, serious and comic; but they all treat the Civil War as a watershed in American history and in the lives of those who lived through it.",
        "Category": " Fiction , War & Military",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Fifty Great American Short Stories",
        "Authors": "By Crane, Milton (EDT)",
        "Description": "A brilliant, far-reaching collection of stories from Washington Irving to John Updike.The Classic StoriesEdgar Allan Poe’s Ms. Found in a Bottle, Bret Harte’s The Outcasts of Poker Flat, Sherwood Anderson’s Death in the Woods, Stephen Vincent Benét’s By the Waters of BabylonThe Great WritersMelville, James, Dreiser, Faulkner, Hemingway, Steinbeck, McCullersThe Little-Known MasterpiecesEdith Wharton’s The Dilettante, Finley Peter Dunne’s Mr. Dooley on the Popularity of Fireman, Charles M. Flandrau’s A Dead Issue, James Reid Parker’s The Archimandrite's Niece",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "The Black Tower",
        "Authors": "By James, P.D.",
        "Description": "",
        "Category": "",
        "Publisher": "Popular Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Shipwrecks: Diving the graveyard of the Atlantic",
        "Authors": "By Farb, Roderick M",
        "Description": "",
        "Category": "",
        "Publisher": "Menasha Ridge Press",
        "Price Starting With ($)": "5.01",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The gift of encouragement: How to be a warm shoulder in a cold world (Heart issues)",
        "Authors": "By Gloria Chisholm",
        "Description": "",
        "Category": "",
        "Publisher": "Aglow Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Road to the White House 2004: The Politics of Presidential Elections (with InfoTrac)",
        "Authors": "By Wayne, Stephen J.",
        "Description": "This textbook begins with an historical overview of the system of presidential election, and then proceeds to trace out every step in the process nomination, campaigning, and the election itself. Issues like campaign finance, and strategic, tactical, organizational, and media aspects are addressed along the way. Prospects for reform are also briefly discussed.  Wayne teaches government at Georgetown University. Annotation (c) Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , General",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Noah's Ark (Hanna-Barbera's the Greatest Adventure Stories from the Bible)",
        "Authors": "By Benagh, Christine L. and Bullock, Harvey",
        "Description": "Three friends travel back in time where they meet Noah, who is in the process of building an ark and gathering two of every kind of animal",
        "Category": "",
        "Publisher": "Abingdon Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "The Travels of Paul",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "5304258",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "For People Who Don't Hear the Music Anymore",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Word Music",
        "Price Starting With ($)": "7.02",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Automotive Tune-Ups for Beginners",
        "Authors": "By Edmonds, I. G.",
        "Description": "Clearly describes tools and procedures for setting the timing, adjusting the carburetor, and servicing the battery, coil, distributer, and other components of an internal combustion engine",
        "Category": " Technology & Engineering , General",
        "Publisher": "Macrae Smith Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1974"
        }
    },
    {
        "Title": "Clean Energy Common Sense: An American Call to Action on Global Climate Change",
        "Authors": "By Beinecke, Frances and Deans, Bob",
        "Description": "Inspired by Thomas Paine's classic, Common Sense, Frances Beinecke provides a concise account of what is at stake in the climate change debate. The impact of global climate change extends beyond environmental destruction. She challenges all Americans to demand a clean and sustainable energy future before it is too late. Doing so will help put Americans back to work, reduce our reliance on foreign oil, and create a healthier planet, for ourselves and our children.",
        "Category": " Political Science , Public Policy , Environmental Policy",
        "Publisher": "Rowman & Littlefield Publisher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Avaryan Rising Trilogy: The Hall of the Mountain King,the Lady of Han-gilen, a Fall of Princess (Avaryan Rising, 1-3)",
        "Authors": "By Judith Tarr",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "8.39",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Weight Loss Cure They Don't Want You to Know About",
        "Authors": "By Trudeau, Kevin",
        "Description": "An absolute cure for obesity was discovered almost fifty years ago by a British medical doctor. Tens of thousands of people used this simple, inexpensive, safe medical treatment and achieved miraculous, fast, and permanent weight loss. Stubborn area fat deposits melted away. Body reshaping of the hips, thighs, buttocks, and waist was so dramatic it appeared as if the patients received liposuction! Amazingly, this medical breakthrough has been debunked, discredited, and suppressed by the American Medical Association, the Food and Drug Administration, and other medical establishments throughout the world. Now, for the first time in fifty years, this revolutionary breakthrough discovery, which permanently cures the condition of obesity, is being released to the public.The main problems that overweight people deal with are massive, intense, constant physical hunger; food cravings and uncontrollable urges to eat when not hungry; low metabolism; and an abnormally high amount of fat stored in stubborn secure problem areas such as the hips, thighs, buttocks, and waist. This ?weight loss cure protocol” has been proven to be virtually 100% successful in correcting these conditions, thus curing the individual of obesity for life! Read the fascinating true story of how this discovery was made and, more importantly, how this miracle weight loss breakthrough has been hidden from the public so that drug companies can make billions of dollars selling their expensive drug treatments and surgical procedures for obesity. You’ll be amazed to read how the food manufacturers actually have a financial incentive to make you fat! This is the book that answers all the questions about why people today are continually getting fatter and fatter. The good news is this book gives you the cure that can solve your overweight condition once and for all.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Alliance Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Federal Benefits for Veterans, Dependents and Survivors, 2010",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "United States Dept. of Veterans Affairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Patsy Says",
        "Authors": "By Tryon, Leslie",
        "Description": "They are rude and impolite! Something has to be done about the behavior of the children in Ms. Klingensmith's first-grade class or the Open House on Friday, when all the parents come to visit, will be a disaster. And who better than Patsy Pig to teach these young ones about their manners? So each day Patsy visits the class with yet more instructions on how to be the perfect little angels she knows they can be. But does anyone listen to what Patsy says?  Leslie Tryon returns to the Pleasant Valley Elementary School, home of Patsy's dear friend, the famous Albert, and offers young readers a riotous look at their own capacity to be naughty or nice.",
        "Category": " Juvenile Fiction , Animals , Pigs",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Table Graces for the Family",
        "Authors": "By Marjorie Ingzel",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson and Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Silence of the Grave (Reykjavik Murder Mysteries, No. 2)",
        "Authors": "By Indridason, Arnaldur",
        "Description": "Winner of the CWA Gold Dagger AwardInspector Erlendur returns in this gripping Icelandic thriller When a skeleton is discovered half-buried in a construction site outside of Reykjavík, Inspector Erlendur finds himself knee-deep in both a crime scene and an archeological dig. Bone by bone, the body is unearthed, and the brutalizing history of a family who lived near the building site comes to light along with it. Was the skeleton a man or a woman, a victim or a killer, and is this a simple case of murder or a long-concealed act of justice? As Erlendur tries to crack this cold case, he must also save his drug-addicted daughter from self destruction and somehow glue his hopelessly fractured family back together.Like the chilly Nordic mysteries of Henning Mankell and Karen Fossum, Arnaldur Indridason delivers a stark police procedural full of humanity and pathos, a classic noir from a very cold place.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Picador",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Tainted (Blood Lily Chronicles, Book 1)",
        "Authors": "By Kenner, Julie",
        "Description": "View our feature on Julie Kenner’s Tainted.    Lily Carlyle has lied, cheated, and stolen her way through life. But in death, she'll really get to be bad... When her little sister is brutalized, a vengeful Lily determines to exact her own justice. She succeeds at the cost of her own life, but as she lies dying, she is given a second chance. Lily can earn her way into Paradise by becoming an assassin for the forces of good. It's the job Lily believes she can really get into--but she doesn't realize that she may not be able to get out.    Read Julie Kenner's posts on the Penguin Blog.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Grandma s Baking and More",
        "Authors": "By Publication International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    }
]