[
    {
        "Title": "Don't Take It Out on Your Kids",
        "Authors": "By Kersey, Katharine C.",
        "Description": "Discusses the role of parents and teachers, argues that positive rather than negative discipline should be used with children, and provides practical examples",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "My Friend the Enemy",
        "Authors": "By Cheaney, J. B.",
        "Description": "Hating the Japanese was simple before she met Sogoji.Pearl Harbor was bombed on Hazel Anderson’s birthday and she’s been on the lookout for enemies ever since. She scours the skies above Mount Hood with her binoculars, hoping to make some crucial observation, or uncover the hideout of enemy spies. But what she discovers instead is a 15-year-old orphan, hiding out, trying to avoid being sent to an internment camp. Sogoji was born in America. He’s eager to help Hazel with the war effort. Is this lonely boy really the enemy?In this thought-provoking story of patriotism, loyalty, and belonging, Hazel must decide what it means to be a true American, and a true friend.From the Hardcover edition.",
        "Category": " Juvenile Fiction , People & Places , United States , Asian American",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Believe It: Bible Basics That Won't Break Your Brain : Incredible Readable Rhymes",
        "Authors": "By James Stephen",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Standard Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Magnetic Therapy Facts",
        "Authors": "By Dr. George McDermott",
        "Description": "",
        "Category": "",
        "Publisher": "Scott & McDermott Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Swiss Drawings: Masterpieces of Five Centuries",
        "Authors": "By Hugelshofer, Walter",
        "Description": "",
        "Category": "",
        "Publisher": "Smithsonian Institution Press",
        "Price Starting With ($)": "6.9",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Marley Goes to School",
        "Authors": "By Grogan, John and Cowdrey, Richard (ILT)",
        "Description": "It's the first day of school, and Cassie is all set to go. So is her dog, Marley! Although he's told to stay, Marley digs a tunnel out of the backyard and sniffs his way to school. As he roams the halls looking for Cassie, he finds trouble instead. From wolfing down hot dogs in the cafeteria to setting free a bunch of mice in science class, Marley won't stop until he locates his best friend. This lovable and rowdy dog may not be much of an academic, but he's full of school spirit! Packed with action and hilarious Marley bad-boy antics, this follow-up to the bestselling Bad Dog, Marley! and A Very Marley Christmas will leave readers howling for more. Awooo!",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Angel Behind the Rocking Chair: Stories of Hope in Unexpected Places",
        "Authors": "By Vredevelt, Pam",
        "Description": "After the loss of her first baby and the birth of a fourth child with Down Syndrome, Pam Vredevelt felt that she had fallen from God's grasp. As she was soon to discover, however, God was just beginning to hold her tight and lead the way out of her endless pit of despair. With humor and touching insight, Pam unveils her struggle to emerge from darkness into the light in this paperback release of her popular work. Many have been touched by the same anguish; Pam shares their stories and how the supernatural touch of God sustained them through the darkest days of life.From the Trade Paperback edition.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "TransFormers Animated Decepticons",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Bendon Publishing",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Expecting 411: Clear Answers & Smart Advice for Your Pregnancy",
        "Authors": "By Hakakha, Michele, M.D. and Brown, Ari, M.D.",
        "Description": "Congratulations! You’re pregnant! Now, where do you turn to for the best advice? What if you could bottle the wisdom of all those women who came before you—and combine it with the solid medical advice from a renowned Beverly Hills’ OB/GYN and nationally known pediatrician? Expecting 411 is the answer: smart, up-to-date and refreshingly free of paranoia, this is the book you’ll turn to for quick answers to your most pressing questions.",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Windsor Peak Press",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Look and Find Cars",
        "Authors": "By Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Agenda for a New Economy: From Phantom Wealth to Real Wealth",
        "Authors": "By Korten, David C.",
        "Description": "Nearly two years after the economic meltdown, joblessness and foreclosures are still endemic, Wall Street executives are once again getting massive bonuses, and our leaders in Washington lack the will to make desperately needed fundamental changes to the economy. Change will have to come from below. Agenda for a New Economy is the handbook for that revolution. In this revised and updated edition David Korten has fleshed out his vision of the alternative to the corporate Wall Street economy: a Main Street economy based on locally owned, community-oriented “living enterprises” whose success is measured as much by their positive impact on people and the environment as by their positive balance sheet.  We will lose nothing in the process because, as Korten ably demonstrates, the supposed services Wall Street offers are simply a con game. And Korten now offers more in-depth advice on how to mount a grassroots campaign to bring about an economy based on shared prosperity, ecological stewardship, and citizen democracy.",
        "Category": " Political Science , Political Economy",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Hope When the World Falls Apart: Daniel and Revelation's Message of Hope",
        "Authors": "By Burrill, Russell",
        "Description": "",
        "Category": "",
        "Publisher": "Seminars Unlimited",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Aztec, Inca & Maya (Eyewitness books)",
        "Authors": "By Baquedano, Elizabeth and Zabe, Michel (PHT)",
        "Description": "Full-color photos. Unravel the remarkable mysteries of the ancient peoples who built great palaces and pyramids, and developed an accurate calendar and a knowledge of astronomy without the benefit of telescopes or written language.",
        "Category": "",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Super Friends: Going Bananas (DC Super Friends) (Step into Reading)",
        "Authors": "By Tanguay, David (ILT), Harper, Benjamin, Doescher, Erik (ILT), and Decarlo, Mike (ILT)",
        "Description": "DC★Super Friends are big heroes for little boys!Gorilla Grodd is on the loose and causing mayhem everywhere he goes. It’s up to Superman, along with Batman and the rest of the Super Friends, to put an end to all the problems this irate primate is causing.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "The New York Times Book of the Civil War",
        "Authors": "By Keylin",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Ayer Co Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "Hotel For Dogs Movie Novelization",
        "Authors": "By David, Erica (ADP)",
        "Description": "Based on Lois Duncan's 1971 children's book, Hotel For Dogs, this live-action movie stars Emma Roberts, Jake T. Austin, Lisa Kudrow, Kevin Dillon, and Don Cheadle in a comedic adventure that shows how far love and imagination can take you. When 16-year-old Andi and her younger brother, Bruce, find themselves in a foster home with a strict \"no pets\" policy, the siblings have to find a new home for their dog, Friday. The kids stumble into an abandoned hotel and begin transforming it into something truly magical: a home for their dog, as well as all the stray dogs in the neighborhood! But the hotel soon arouses the suspicions of the police who want to know--who let the dogs in?",
        "Category": " Juvenile Fiction , Family , Adoption",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "The Times Atlas of World History",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Hammond, Inc.",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "God Loves Me Baby Bible",
        "Authors": "By Beck, Susan Elizabeth and Oostema, Gloria (ILT)",
        "Description": "It’s never too early for babies and toddlers to learn that - \"God loves me!\" The God Loves Me Baby Bible contains simple, rhyming verses about Bible characters and God's love for his children. Each page features delightful illustrations by artist Gloria Oostema.",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Zonderkidz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Arithmetricks: 50 Easy Ways to Add, Subtract, Multiply, and Divide Without a Calculator",
        "Authors": "By Julius, Edward H.",
        "Description": "Become a mental-math master and astound your friends, family, and teachers with . . . \"A fascinating and useful book. I recommend it.\"—Jaime Escalante (of Stand and Deliver fame) Hiram W. Johnson High School \"...will fascinate students of all ages. A resource 'must' for all math programs.\"—Howard Wang, Founding Director of Sierra Canyon College Preparatory School \"The tips and tricks were really cool.\"—Liz Matthews, age 12, Anacapa Middle School Packed with 50 tricks and tips that let you add, subtract, multiply, and divide in a flash, makes math easier and more fun than you've ever imagined. You won't need a calculator, or in many cases even a pencil, to come up with the correct answers. Just a few simple shortcuts will have you solving basic problems in record time. Will not only amaze you, it will also help you at school and in your daily life. Most of all, you'll have plenty of fun along the way!",
        "Category": " Juvenile Nonfiction , Mathematics , Arithmetic",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Ice Goddess (John Eagle, Expeditor, Book 7)",
        "Authors": "By Paul Edwards",
        "Description": "",
        "Category": "",
        "Publisher": "Pyramid",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1974"
        }
    },
    {
        "Title": "Pompeii: Guide to the Excavations by M. A. Bonaventura (2002-05-04)",
        "Authors": "By M. A. Bonaventura",
        "Description": "",
        "Category": "",
        "Publisher": "Lozzi Roma",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The holocaust auction",
        "Authors": "By Paul Edwards",
        "Description": "",
        "Category": "",
        "Publisher": "Pyramid",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Discovery Plus: Knights and Battles",
        "Authors": "By Tames, Richard",
        "Description": "Introduces the society and culture of the Middle Ages, describes the way of life of the various classes and the factors that led to the end of the epoch, and details the training, equipment, beliefs, and activities of medieval knights.",
        "Category": " Juvenile Nonfiction , Activity Books",
        "Publisher": "Silver Dolphin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "24-Hour Knitting Projects",
        "Authors": "By Weiss, Rita",
        "Description": "",
        "Category": " Crafts & Hobbies , Needlework , Knitting",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "24-Hour Sewing Projects",
        "Authors": "By Linda Causee",
        "Description": "",
        "Category": "",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "What is Easter?",
        "Authors": "By Wummer, Amy (ILT) and Adams, Michelle Medlock",
        "Description": "Rhyming text introduces readers to the true meaning of Easter, celebrating the resurrection of Jesus.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "WorthyKids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Impressionist and Post-Impressionist Masterpieces",
        "Authors": "By Musee, D'Orsay, Lacambre, Genevieve, and Musee Du Jeu De Paume (France)  Impressionist Masterpieces at the Jeu (COR)",
        "Description": "Illustrates and describes the background of each painting",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "She Touched the World: Laura Bridgman, Deaf-Blind Pioneer",
        "Authors": "By Alexander, Robert and Alexander, Sally Hobart",
        "Description": "When she was just two years old, Laura Bridgman lost her sight, her hearing, and most of her senses of smell and taste. At the time, no one believed a child with such severe disabilities could be taught to communicate, much less lead a full and productive life. But then a progressive doctor, who had just opened the country’s first school for the blind in Boston, took her in. Laura learned to communicate, read, and write—and eventually even to teach. By the age of 12, she was world famous.Audiences flocked to see her, and she was loved and admired by children everywhere. This fascinating and moving biography shows how Laura Bridgman paved the way for future generations of children with disabilities, making possible important advances in the way they would be educated. As a blind person with some hearing loss, Sally Hobart Alexander lends a unique and intimate perspective to this inspiring account. At last, the story of Laura Bridgman can find its long-deserved place alongside those of Louis Braille and Helen Keller.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "HABITATION OF DRAGONS : A BOOK OF HOPE ABOUT LIVING AS A CHRISTIAN",
        "Authors": "By Keith Miller",
        "Description": "",
        "Category": "",
        "Publisher": "Word Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "A Keepsake Christmas",
        "Authors": "By Gray, Alice and Wales, Susan",
        "Description": "Christmas is an enduring celebration that unites generations. We share so much of ourselves and our memories during the holiday festivities, and A Keepsake Christmas is designed to help capture that loving nostalgia. This gift book is fashioned for those of us who, especially during the Christmas season, long to weave our relationships into a richly textured fabric of love and community, creating the kind of sanctuary in our homes that expresses the love in our hearts.In their warm, personal style, Alice and Susan have created a collection holiday stories, poignant quotes, poems, vignettes, and favorite carols dispersed throughout the text that are cozy as candlelight.",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Into His Arms",
        "Authors": "By Broower, Sigmund",
        "Description": "With Into His Arms we see Jesus with the innocence and wonder of the children who met him on his journeys. And through their eyes, all of us learn again the joy of being welcomed home into his arms. In the tradition of the best-sellingThe Carpenter's Cloth—a classic gift book that has already become a devotional study for many—author Sigmund Brouwer takes us on another journey with the man of Galilee.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Eleanor of Aquitaine and The Four kings (A Vintage Book)",
        "Authors": "By Kelly, Amy R",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "Daily Light on the Daily Path: Inspirational Thoughts for Every Day",
        "Authors": "By Inspirational Press",
        "Description": "",
        "Category": "",
        "Publisher": "Bbs Pub Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Endless Summer: The Boys Next Door; Endless Summer (Romantic Comedies (Paperback))",
        "Authors": "By Echols, Jennifer",
        "Description": "Two irresistible boys. One unforgettable summer.  Lori can’t wait for her summer at the lake. She loves wakeboarding and hanging with her friends—including the two hotties next door. With the Vader brothers, she's always been just one of the guys. Now that she’s turning sixteen, she wants to be seen as one of the girls, especially in the eyes of Sean, the older brother. But that’s not going to happen—not if the younger brother, Adam, can help it.Lori plans to make Sean jealous by spending time with Adam. Adam has plans of his own for Lori. As the air heats up, so does this love triangle. Will Lori’s romantic summer melt into one hot mess?",
        "Category": " Young Adult Fiction , Humorous , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Two",
        "Authors": "By Christenson, Evelyn",
        "Description": "",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Scripture Pr Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "Totally Disgusting!",
        "Authors": "By Wallace, Bill and Morrill, Leslie H. (ILT)",
        "Description": "Ugh! What kind of a name is Mewkiss? The kitten loves his person, Jessica, but he had hoped for a name like Fearless or Ratkiller. It's hard to be brave with such a totally disgusting name. Even Barkus, a know-nothing puppy, calls Mewkiss a coward.Mewkiss has to be brave, because a family of rats has taken up residence in the basement where Jessica and her brother have a playhouse. And they're planning to attack Jessica! How is a cat named Mewkiss going to find the courage to protect the person he loves?",
        "Category": " Juvenile Fiction , Social Themes , Self-Esteem & Self-Reliance",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Fight for Life #1 (Vet Volunteers)",
        "Authors": "By Anderson, Laurie Halse",
        "Description": "Maggie’s grandmother runs an animal clinic, Dr. Mac’s Place, so Maggie knows her way around animals who are in danger. When she learns that the abused and sick puppies flooding the clinic are from an illegal puppy mill, she knows that she has to find out who’s running it, where it is—and save the rest of the dogs!",
        "Category": " Juvenile Fiction , Family , Multigenerational",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Creative Socials and Special Events",
        "Authors": "By Yaconelli, Mike and Rice, Wayne",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "What's Left?: A New Democratic Vision for America",
        "Authors": "By McElvaine, Robert",
        "Description": "What's Left? offers Democrats, liberals, and progressives alike a groundbreaking new vision of the American landscape. It provides a brilliant synthesis of the best thinking of today's Democratic leaders and a clear program for recapturing the hearts - and votes - of the American public.What's Left? is based on Robert McElvaine's interviews with some of the most influential figures in American politics: Paul Begala, David Bonior, Dale Bumpers, James Carville, Bill Clinton, Mario Cuomo, Tom Daschle, Rosa DeLauro, Christopher Dodd, Chaka Fattah, Barney Frank, Dick Gephardt, Jesse Jackson, Marcy Kaptur, Joe Kennedy, Madeline Kunin, Patsy Mink, Eleanor Holmes Norton, Richard Riley, Bernie Sanders, Paul Simon, George Stephanopoulos, Nydia Velazquez, Paul Wellstone, and many others.It offers McElvaine's personal perspective on contemporary American politics, and a compelling new agenda for American society.",
        "Category": " Political Science , General",
        "Publisher": "Adams Media Corp",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Deep-Sea Countdown (The Backyardigans)",
        "Authors": "By McGee, Warner (ILT) and Spelvin, Justin",
        "Description": "The Backyardigans set off on an amazing adventure through the deep sea and on the way they encounter ten glowing jellyfish, nine coral fans, eight large tentacles, and more, in a counting board book with soft, padded covers.",
        "Category": " Juvenile Fiction , Concepts , Counting & Numbers",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "My Very First Book of Words",
        "Authors": "By Carle, Eric",
        "Description": "In My Very First Book of Words, children can match the picture in the bottom half with the word in the top half. Which one is the car? Which one is the fish? Only you can match them. Children will love solving the puzzles of these clever, vibrant books.",
        "Category": " Juvenile Fiction , Concepts , Words",
        "Publisher": "World of Eric Carle",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Zelda the Zebra (Zoo Babies)",
        "Authors": "By Irvine, G.",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "A Century of Ambivalence: The Jews of Russia and the Soviet Union, 1881 to the Present",
        "Authors": "By Gitelman, Zvi Y.",
        "Description": "A popular history of Soviet Jewry is complemented by a photographic survey of Soviet Jewish life",
        "Category": " History , Jewish",
        "Publisher": "Schocken",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Rx For Worry: A Thankful Heart",
        "Authors": "By Gills, James P.",
        "Description": "Do not worry about your life, what you will eat or drink; or about your body, what you will wear...Who of you by worrying can add a single hour to his life? -Matthew 6:25, 27.Jesus gives us a clear command about worry: Don't do it. Yet worry is a highly contagious disease in many lives. It can seem unstoppable. But there is a cure: being thankful.Many people think of worry as worrying about the future, and thankfulness as being thankful for the past. This book joins the two together. Help against worry is found in being thankful for our present relationship with God and being thankful that He is in control of the future.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Creation House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Ideals Festive Party Cookbook",
        "Authors": "By Flanzer, Sally Manesberg",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Publishing Corporation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Christopher Columbus (Cornerstones of Freedom Second Series)",
        "Authors": "By Stein, R. Conrad",
        "Description": "Describes the voyages and discoveries of Columbus and their aftermath",
        "Category": " History , General",
        "Publisher": "Childrens Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Crown Treasury of Relevant Quotations",
        "Authors": "By Murphy, Edward F",
        "Description": "",
        "Category": "",
        "Publisher": "Outlet",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "November",
            "Year": "1978"
        }
    },
    {
        "Title": "Secret Child",
        "Authors": "By Major, Ann",
        "Description": "Determined to track down his wife, who cruelly betrayed him and now, he believes, passes herself off as supermodel Mischief Jones, Jack West finally captures the woman he seeks, only to find a seductress who leaves him with more questions. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Home Library Chicken Cookbook",
        "Authors": "By Blacker, Maryanne (EDT)",
        "Description": "Gathers chicken and poultry recipes for soups, appetizers, main dishes, lunches, and barbeques",
        "Category": " Cooking , General",
        "Publisher": "Graphic Arts Center Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Chicken and Other Poultry (Grill by the Book)",
        "Authors": "By Sunset Books (EDT), Sunset Books (COR), Di Vecchio, Jerry Anne (EDT), Hughes, Betty (EDT), and Weber (Firm) (COR)",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Poultry",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Quick Short Chicken",
        "Authors": "By Confident Cooking",
        "Description": "",
        "Category": "",
        "Publisher": "Bay Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "What Should I Eat?: A Complete Guide to the New Food Pyramid",
        "Authors": "By D'Elgin, Tershia",
        "Description": "The must-have guide to the first revision of the food pyramid in over 13 years! For the first time in more than a decade, the U.S. Department of Agriculture has revised the Food Pyramid–the government’s official recommendations concerning the nutrients our bodies require and the proportion of each we need to stay healthy. The new guidelines, called My Pyramid, have been significantly adjusted to reflect the latest scientific research on nutrition.  They are also very confusing!  What Should I Eat? helps clarify My Pyramid’s vast and complicated information and tells you exactly what you need to know in order to benefit from the new nutritional guidelines.  Moreover, this essential manual will show you how to tailor My Pyramid for your specific health and fitness needs.  You will learn how to• Best meet the requirements of each food group• Eyeball portion sizes (What does an ounce look like?)• Gauge nutrition requirements for both women and men• Pack maximum nutrition into every meal• Make smart choices in restaurants• Incorporate exercise into your busy scheduleWith tips for shopping, storage, and cooking, and suggestions for seeking nutritional supplements and professional care, What Should I Eat? is your ultimate roadmap to a long and healthy life.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Screenwriting",
        "Authors": "By Press, Skip",
        "Description": "This guide is for anyone who has ever thought of screenwriting.  Written by someone who has \"been there, done that,\" and lived to tell the tale, it reveals the most popular genres, explains how stories need to be structured for feature films and TV movies, offers the freshest look at workshops and online classes, and disusses how to set up a step-by-step path to success.",
        "Category": " Performing Arts , Television , Screenwriting",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Best Dives of the Caribbean",
        "Authors": "By Huber, Joyce and Huber, Jon",
        "Description": "",
        "Category": " Travel , Caribbean & West Indies",
        "Publisher": "Hunter Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Encyclopedia of Cults and New Religions: Jehovah's Witnesses, Mormonism, Mind Sciences, Baha'I, Zen, Unitarianism (In Defense of the Faith Series, 2)",
        "Authors": "By Ankerberg, John and Weldon, John",
        "Description": "A resource for Christian ministers, teachers, and students provides brief profiles of more than thirty Eastern and Western religious traditions, summarizing each group's beliefs and contrasting them with traditional biblical teachings.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "The Leadership Challenge Workbook",
        "Authors": "By Kouzes, James M. and Posner, Barry Z.",
        "Description": "Based on Jim Kouzes and Barry Posner's classic book The Leadership Challenge, this Workbook will be your hands-on guide for improving your ability to put into action the Five Practices of Exemplary Leadership® model and become a leader who Models the Way, Inspires a Shared Vision, Challenges the Process, Enables Others to Act, and Encourages the Heart. The Workbook's easy-to-use worksheets make efficient planning simple and practical and supports your success in three ways: Reflection: Think about your approach to leadership and become more conscious about how well you engage in each of the Practices.Application: Apply the Practices and commitments to all your projects.Implications: Record what you've learned about yourself, your team, your organization, and your project.Develop your leadership potential with The Leadership Challenge Workbook!",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Pfeiffer",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Better Homes and Gardens Cooking Chinese (Better homes and gardens books)",
        "Authors": "By",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Three Comedies if American Family Life",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Washington Square",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Discover Your Child's Learning Style: Children Learn in Unique Ways - Here's the Key to Every Child's Learning Success",
        "Authors": "By Willis, Mariaemma and Kindle Hodson, Victoria",
        "Description": "Help Your Child Discover the Joy of LearningDoes your child learn best in the morning, afternoon, or evening? Does his reading comprehension increase or decrease when music is played in the background? Does she prefer to study alone or with others? According to nationally respected educators Mariaemma Willis and Victoria Kindle Hodson, our children process information in a multitude of unique ways. What works best for one child is often counterproductive for others. By trying to force all children into the same learning mode we unfairly short-circuit their education as well as their intellectual development. Discover Your Child's Learning Style shows you how to assess and nurture your child's individual learning potential based on his or her talents, interests, disposition, preferred environment, and more. Inside is a step-by-step program of self-awareness tests that guide you to a better understanding of your child's unique strengths and weaknesses, goals and interests, and inner peace. You'll discover how to create the right atmosphere for learning in the home. Most important, you'll help your child excel not only in school but in life as well. \"An excellent tool for discovering how a student learns best. Teaching children according to how they learn ensures optimum education for all; it's an approach that could help make remedial literacy programs obsolete!\"—Patricia Flanigan, California State Library Literacy Task Force \"Essential for any parent or teacher who works with children.\"—Suzanne Lopez, psychotherapist and author of Get Smart with Your Heart \"A powerful tool for increasing your child's self-esteem. At last, there is a simple solution for every child to become a winner.\"—Nancy L. Chaconas, M.A., educator, author of HELP-Esteem \"Parents who understand the principles in this book will be better parents!\"—Richard and Linda Eyre, authors of Teaching Your Children Values",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Crown Publishing Group, a division of Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "God's Little Devotional for Couples (God's Little Devotional Book Series)",
        "Authors": "By Honor Books",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "My Lady's Pleasure",
        "Authors": "By Justiss, Julia",
        "Description": "",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Music Box",
        "Authors": "By Kane, Andrea",
        "Description": "Gabrielle Denning, the sheltered ward of Lady Nevon, grew up in an almost magical place, an estate where society's outcasts were treasured and the ruling spirit was love. It almost made her forget the terrifying night when an unexplained fire killed her parents, leaving her with only a music box to remember them by. But her idyllic world is about to change, as the bastard son of Lady Nevon's brother maneuvers his carriage up the manor's drive.  Outcast by his titled father, Bryce Lyndley has nonetheless flourished, becoming a renowned barrister ruled entirely by his principles. The meeting to which he has been summoned at Nevon Manor, however, could transform his life -- and warm his heart. Amid unfolding secrets, his life and Gaby's will touch, awakening emotions as profound as the richest symphony. But if happiness is to be theirs, Bryce and Gaby must uncover mystery from long ago, reawakened by the haunting notes of Gaby's music box...or lose all they cherish to treachery, heartbreak, and a murderer's nefarious plan.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Early American Women: A Documentary History, 1600-1900",
        "Authors": "By Woloch, Nancy (EDT)",
        "Description": "",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Wadsworth Pub Co",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "A Newbery Christmas",
        "Authors": "By Greenberg, Martin Harry and Waugh, Charles G.",
        "Description": "A collection of stories about Christmas, by Newbery Award-winning authors such as Eleanor Estes, E.L. Konigsburg, Madeleine L'Engle, and Katherine Paterson.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Tracey's Tough Choice (Cover Kids)",
        "Authors": "By Weyn, Suzanne",
        "Description": "Twelve-year-old Tracey's life with her divorced mother seems perfectly balanced with her growing career as a model, until the father she has never known seeks her out and she is faced with a difficult decision.",
        "Category": "",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Andie's Risky Business (Riding Academy)",
        "Authors": "By Hart, Alison",
        "Description": "Starting her own business in order to raise funds to buy a horse, Andie enlists the help of her roommates, making them unwilling employees for horse grooming, laundry, and midnight delivery services. Original.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Teen Girl's Gotta-Have-It Guide to Money: \"Getting Smart About Making It, Saving It, and Spending It!\"",
        "Authors": "By Blatt, Jessica, Frenette, Cynthia (ILT), and Paladino, Variny",
        "Description": "A guide about personal finance for teenage girls provides tips and advice for how to make, save, invest, and spend money wisely.",
        "Category": " Young Adult Nonfiction , Business & Economics",
        "Publisher": "Watson-Guptill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Sleepless in Scotland",
        "Authors": "By Karen Hawkins",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Favorite Meat Dishes (Recipes of the World)",
        "Authors": "By n/a",
        "Description": "",
        "Category": "",
        "Publisher": "International Masters Publisher's",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Music comes to America",
        "Authors": "By Ewen, David.",
        "Description": "",
        "Category": "",
        "Publisher": "Allen, Towne & Heath Inc.",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "365 Art & Craft Activities",
        "Authors": "By Hoppert, Rita",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Pubns Intl Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Who Wrote Shakespeare?",
        "Authors": "By Michell, John F.",
        "Description": "Was the most famous poet and writer of all time a fraud and a plagiarist? Was Shakespeare the 'upstart crow' described by Greene as strutting in borrowed feathers, or Jonson's 'Poet-Ape' who patched plays together from others' work? Was his name merely a pseudonym for a well-known contemporary figure?These questions have been furiously debated ever since the eighteenth century, when the writing styles of Marlowe and other playwrights were discerned in plays such as Titus Andronicus. The orthodox view is that the author of the works of Shakespeare was, of course, the actor and businessman of Stratford-upon-Avon. But the known facts about this man are surprisingly meagre, and contrast puzzlingly with the learned, courtly philosopher revealed in the Sonnets and plays - the universal genius and supreme stylist.Respected scholars and obsessive eccentrics have devoted years to the search for evidence, and many different theories have been put forward. Some believe that the great lawyer Francis Bacon may have used the name of an obscure actor to disseminate his philosophy. Many others, including Freud, see the Earl of Oxford mirrored in Hamlet. Yet others suggest that Marlowe was not killed, as thought, in a drunken brawl, nor even in a secret service execution, but lived on to write secretly as Shakespeare.John Michell's enthralling investigation of the many claims and counter-claims reads like a series of detective stories. He lays out the evidence and the arguments for the various candidates, not forgetting Shakespeare himself, and provides a drily humorous commentary on the research and prejudices of their champions while adding new insights of his own. By the end of the book, even the most faithful disciples of the Bard will find themselves questioning 'Who Wrote Shakespeare?'",
        "Category": " Literary Criticism , Shakespeare",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Rollback (Sci Fi Essential Books)",
        "Authors": "By Sawyer, Robert J.",
        "Description": "Dr. Sarah Halifax decoded the first-ever radio transmission received from aliens. Thirty-eight years later, a second message is received and Sarah, now 87, may hold the key to deciphering this one, too . . . if she lives long enough.      A wealthy industrialist offers to pay for Sarah to have a rollback—a hugely expensive experimental rejuvenation procedure. She accepts on condition that Don, her husband of sixty years, gets a rollback, too. The process works for Don, making him physically twenty-five again. But in a tragic twist, the rollback fails for Sarah, leaving her in her eighties.       While Don tries to deal with his newfound youth and the suddenly vast age gap between him and his wife, Sarah struggles to do again what she’d done once before: figure out what a signal from the stars contains. Exploring morals and ethics on both human and cosmic scales, Rollback is the big new SF novel for 2007 by Hugo and Nebula Award-winner Robert J. Sawyer.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "12.55",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Coping with Lyme Disease: A Practical Guide to Dealing with Diagnosis and Treatment",
        "Authors": "By Lang, Denise V., Liegner, Kenneth B., M.D., and McDonnell, Mary (FRW)",
        "Description": "Now completely revised and updated-the bible for the thousands who contract Lyme disease each yearLyme disease, transmitted through the bite of a tick, is one of our nation's fastest-growing epidemics. Since Coping with Lyme Disease was first published in 1993, the number of sufferers afflicted by this debilitating condition has grown alarmingly.Every chapter has been thoroughly revised and new information about the long-term neurological effects of Lyme disease and congential and chronic versions of the illness has been added.This comprehensive guide includes- basic prevention tips- a detailed catalog of the physical and psychological symptoms to look for- a complete look at the medical and home care options and insurance policies available to patients- a special discussion of Lyme's effects on women, children, and the elderly- an expanded resource guide, with listings of news publications, state-by-state support groups, and special family servicesThis fully updated third edition informs readers of the latest medical findings in diagnosing and treating Lyme disease-providing crucial information about newly discovered Lyme-related illnesses, electromagnetic procedures, clinical and antibiotic therapies, and curative nutritional products now on the market. A longtime bestseller, this authoritative book is an essential tool for all Lyme disease sufferers.",
        "Category": " Health & Fitness , Diseases , General",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Soccer: How to Play the Game: The Official Playing and Coaching Manual of the United States Soccer Federation",
        "Authors": "By Herbst, Dan and Howe, Bobby (EDT)",
        "Description": "The official playing and coaching manual for youth soccer of the United States Soccer Federation.The definitive playing and coaching manual for youth soccer. Compiled by the coaching, educational and technical staff of U.S. Soccer, this book offers extensive information on all aspects of the game, technique, tactics, laws, prevention and care of injury, coaching preparation, organizational structure, model training sessions, and more than 100 practice games suitable for developing aspects of every player's game.Features numerous games for developing dribbling * passing * finishing * heading * defending * goalkeeping, as well as games specifically for young beginners * games to teach tactics * overall soccer decision-making.Extensive technique section offers detailed pointers on dribbling and turning moves * shielding * passing * receiving * drives * chips, bending the ball and volleys * heading * marking * tackling * goalkeeping catches * dives and saves.Tactical chapters offer detailed information on fundamental attacking tactics * defensive principles * restart tactics for defensive and offensive success.Model training sections construct excellent practice sessions, from warmup through cool down exercises * useful for all coaches as a guide to improving performance * efficiency * enjoyment of training.",
        "Category": " Sports & Recreation , Soccer",
        "Publisher": "Universe",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Love's Little Instruction Book: Romance Hints for Lovers of All Ages",
        "Authors": "By Pigeon, Annie",
        "Description": "From a renowned humorist comes a charming book that offers a wealth of advice for lovers of all ages, including sending flowers, putting the toilet seat down, leaving a romantic message on the answering machine, and much more. Reissue.",
        "Category": " Humor , General",
        "Publisher": "Pinnacle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Tennis Lover's Book of Wisdom",
        "Authors": "By Freeman, Criswell (EDT)",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Walnut Grove",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The Cobweb Confession (4) (Third-Grade Detectives)",
        "Authors": "By Murdocca, Sal (ILT) and Stanley, George Edward",
        "Description": "CREEPY, CRAWLY CRITTERS -- YUCK!  Poor Todd. First he has to give up his room for an old friend of his father's who's visiting. Then his valuable baseball card collection is stolen. Now Mr. Merlin says the class is going to be studying spiders. Todd hates spiders.  But then Mr. Merlin tells the Third-Grade Detectives that a spider's web may help catch the thief. Maybe spiders aren't so bad after all.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Fireplaces and wood stoves (Home repair and improvement)",
        "Authors": "By Time-Life Books Editors",
        "Description": "",
        "Category": "",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Snow Happy To Be Here",
        "Authors": "By Cheryl Hawkinson",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Polar Bear Horizon - a Smithsonian Oceanic Collection Book",
        "Authors": "By Halfman, Janet and Chesterman, Adrian (ILT)",
        "Description": "In the warmth of spring, a polar bear awakens and begins to teach her cubs what they need to know to survive in the harsh conditions of the north coast of Alaska, on the Arctic Ocean.",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "Soundprint",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Pelican's Catch - a Smithsonian Oceanic Collection Book",
        "Authors": "By Dacey, Bob (ILT), Bandelin, Debra (ILT), and Halfmann, Janet",
        "Description": "Brown Pelican, who lives on a mangrove island off the coast of Puerto Rico, learns how to fish and take care of herself. Includes facts about brown pelicans.",
        "Category": " Juvenile Fiction , Animals , Birds",
        "Publisher": "Soundprint",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Little Walrus Warning (Smithsonian Oceanic Collection)",
        "Authors": "By Young, Carol and Stuart, Walter (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , Animals , Marine Life",
        "Publisher": "Soundprints Corp Audio",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Dolphin's First Day: The Story of a Bottlenose Dolphin (Smithsonian Oceanic Collection)",
        "Authors": "By Zoehfeld, Kathleen Weidner and Petruccio, Steven James (ILT)",
        "Description": "Describes a baby dolphin's experiences during his first day in the ocean",
        "Category": " Juvenile Fiction , Animals , Marine Life",
        "Publisher": "Soundprints",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Too Good To Be Leftovers Cookbook",
        "Authors": "By Avon",
        "Description": "",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Y Tu Spanish 1: 1989",
        "Authors": "By Jarvis, Gilbert A., Jarvis",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Aftermath: An Anthology",
        "Authors": "By Axler, James",
        "Description": "Features The Mars Agenda, in which a small group of men and women, after a nuclear firestorm, roam the Deathlands and become caught in the middle of a new war, and Iceblood, in which Kane and his Outlander companions search for the Chintamani stone to destroy Earth's enemies. Original.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Gold Eagle",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Monkey Bridge",
        "Authors": "By Cao, Lan",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Penguin",
        "Price Starting With ($)": "6.32",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Declaration of Independence and the Constitution of theUnitedStates",
        "Authors": "By Jefferson, Thomas",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Artemis Fowl Files, The Ultimate Guide to the Series",
        "Authors": "By Colfer, Eoin",
        "Description": "The Artemis Fowl Files  is comprised of two original stories: “LEPrecon”: the story of Fairy Police Captain Holly Short’s move from Traffic to Recon following her initiation into the Fairy Police; and “The Seventh Dwarf”, featuring Mulch, Butler, and Artemis himself.EXTRAS INCLUDE: •  “Behind-the-scenes” interviews with major characters including: Artemis, Holly, Foaly, Mulch, and Eoin   Colfer himself•  Coded section from the Fairy Book for kids to translate•  A section for Fairy Spotters including the different categories of Fairy and their physical characteristics and personality traits, including: Elves, Trolls, Sprites, Pixies Goblins, Dwarves and Centaurs•  Technical diagrams of Foaly’s inventions",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Hyperion Book",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Global Warning: Are We on the Brink of World War III?",
        "Authors": "By LaHaye, Tim F. and Hindson, Ed",
        "Description": "Combines ancient Bible prophecies with current events to reveal the signs that serve as a global warning that predicts the end of the world.",
        "Category": " Religion , Biblical Studies , Prophecy",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Annie, Bea, and Chi Chi Dolares: A School Day Alphabet",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "6.92",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Healing Foods for Special Diets",
        "Authors": "By Scott, Jill",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "8.6",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Dr. A's Habits of Health: The Path to Permanent Weight Control & Optimal Health",
        "Authors": "By Andersen, Wayne Scott",
        "Description": "Go from surviving to thriving! If you've ever tried to lose weight only to gain it back, Dr. A's Habits of Health offers a life-changing breakthrough that shows you not only how to reach and maintain your healthy weight, but how to create a life of renewed vibrancy, health, and spirit all under the easy-to-follow guidance of one of America s most esteemed and compassionate practitioners of weight loss and optimal health. Join thousands of people worldwide who've gone from discouragement to confidence, from depletion to unimaginable vitality and discover how you can live better, happier, and healthier into your eighties, nineties, and beyond",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Habits of Health Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Halloween: Bewitching Treats, Eats, Costumes and Decorations",
        "Authors": "By Lorenz Editors",
        "Description": "Everything you need for a fabulous Halloween party to include recipes, costumes, decorations and games for the whole family.",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Anness",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Song of Wild Laughter",
        "Authors": "By Couffer, Jack",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Lady's Big Surprise (Book 1 in The Lucky Foot Stable Series)",
        "Authors": "By Dawson, JoAnn S.",
        "Description": "",
        "Category": " Juvenile Fiction , Animals , Horses",
        "Publisher": "F.T. Richards Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Star of Wonder (Book 2 in The Lucky Foot Stable Series)",
        "Authors": "By Dawson, JoAnn S.",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "F.T. Richards Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Incredible Optical Illusions",
        "Authors": "By Rodgers, Nigel",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Rest of Your Life, The",
        "Authors": "By Morley, Patrick M.",
        "Description": "",
        "Category": " Religion , Ethics",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    }
]