[
    {
        "Title": "The Untamed Bride (Black Cobra Quartet, 1)",
        "Authors": "By Laurens, Stephanie",
        "Description": "The first book in a brand-new series, The Black Cobra Quartet, from New York Times and USA Today bestselling romance author Stephanie Laurens, The Untamed Bride is the story of a bold, beautiful woman with a scandalous past and a battle-hardened, sinfully wealthy, completely unstoppable man who must join forces to fight a deadly foe known only as the Black Cobra—and who must also confront the dangers of the heart . . .",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Secrets of the Kingdom: The Inside Story of the Secret Saudi-U.S. Connection",
        "Authors": "By Posner, Gerald L.",
        "Description": "In a thought-provoking study of the secret alliance between the United States and the ruling family of Saudi Arabia, the best-selling author of Why America Slept reveals intimate details of the impact of the Saudis on American businesses and politics, including terrorism within Saudi Arabia, big oil interests, covert military plans, and more. 100,000 first printing.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Krondor: Tear of the Gods (Riftwar Legacy)",
        "Authors": "By Feist, Raymond E.",
        "Description": "The vile sorcerer Sidi plans to strike the kingdom a fatal blow, setting the murderous pirate Bear upon the high seas in pursuit of the vessel that is transporting Midkemia's most holy object; the Tear of the Gods. From this miraculous stone all magic power is believed to flow. And if the Tear becomes the mage's trinket, the future will hold only terror, death and unending night. For Squire James, Lieutenant William, and the able magician Jazhara, the race is on to rescue the remarkable artifact. For all manner of dark creatures are gathering with one unspeakable purpose: to breed the chaos that will hasten the destruction of Squire James and his brave companions . . . and bring about the total corruption of the Tear of the Gods.",
        "Category": " Fiction , Literary",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Hands-Off Cooking: Low-Supervision, High-Flavor Meals for Busy People",
        "Authors": "By Rolke, Ann Martin",
        "Description": "Perfect for today's hectic lifestyles, this quick-and-easy cookbook will help home cooks free up extra time without sacrificing great homemade meals. Distinctively different, this cookbook features dishes that can be prepared fast and left unattended while the cook answers an e-mail, spends time with the kids (or the guests), or simply relaxes. More than 100 delicious recipes include everything from main dishes and sides to breads and desserts. There are recipes for the crock-pot, stovetop, and oven. Unlike typical \"quick\" dishes, these emphasize freshness and flavor and avoid highly processed foods. With Hands-Off Techniques, Stress Savers, Eye Appeal ideas, useful tips on ingredients and equipment, plus timesaving recipes, Hands-Off Cooking is the cookbook busy people can't wait to get their hands on.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Take a Thief (Valdemar)",
        "Authors": "By Lackey, Mercedes",
        "Description": "Mercedes Lackey's triumphant return to the best-selling world of Valdemar, Take a Thief reveals the untold story of Skif--a popular character from Lackey's first published novel, Arrows of the Queen.Skif was an orphan who would have died from malnutrition and exposure if he had never met Deke the pickpocket.  By the time he was twelve, Skif was an accomplished cat burglar.  But it wasn't until he decided to steal a finely tacked-out white horse, which was, oddly enough, standing unattended in the street, that this young thief discovered that the tables could turn on him--and that he himself could be stolen!",
        "Category": " Fiction , Fantasy , Historical",
        "Publisher": "DAW",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Fabric of America: How Our Borders and Boundaries Shaped the Country and Forged Our National Identity",
        "Authors": "By Linklater, Andro",
        "Description": "With the same mix of compelling narrative history and captivating historical argument that made his previous book, Measuring America, such a success, Andro Linklater relates in fascinating detail how, the borders and boundaries that formed states and a nation inspired the sense of identity that has have ever since been central to the American experiment.Linklater opens with America's greatest surveyor, Andrew Ellicott, measuring the contentious boundary between Pennsylvania and Virginia in the summer of 1784; and he ends standing at the yellow line dividing the United States and Mexico at Tijuana. In between, he chronicles the evolving shape of the nation, physically and psychologically. As Americans pushed westward in the course of the nineteenth century, the borders and boundaries established by surveyors like Ellicott created property, uniting people in a desire for the government and laws that would protect it. Challenging Frederick Jackson Turner's famed frontier thesis, Linklater argues that we are , thus, defined not by open spaces but by boundaries. \"What Americanized the immigrants was not the frontier experience\" Linklater writes, \"but the fact that it took place inside the United States frontier.\" Those same borders had the ability to divide as well as unite, as the great battle over internal boundaries during the Civil War would show. By century's end, however, we were spreading U.S. power beyond our borders, an act that, seen through Linklater's eyes, offers an intriguing perspective on our role in the world today.Linklater's great achievement is to weave these provocative arguments into a dramatic storyline, wherein the actions of Ellicott, Thomas Jefferson, the treasonous general James Wilkinson, Abraham Lincoln and Stephen Douglas, and numerous hitherto invisible settlers, all illuminate the shaping of the nation. This brilliant book will alter forever readers' perception of America and what it means to be an American.",
        "Category": " History , United States , General",
        "Publisher": "Walker Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "After You've Blown It: Reconnecting with God and Others (LifeChange Books)",
        "Authors": "By Lutzer, Erwin W.",
        "Description": "YOU CAN START OVER AGAIN Many Christians become so discouraged because of their sins and failures that they give up on ever having fellowship with God again. They also fear that their broken relationships will never heal. For everyone who has wished for a fresh beginning, here is good news. This gentle, affirming book emphasises how much God wants his wandering children to return to him. Award-winning author and pastor Erwin Lutzer provides solutions to common questions about how to reconnect with God and with those we are estranged from. Thanks to God’s grace, it is never too late to do what’s right.  In this powerful, practical book, bestselling author Erwin Lutzer shows you how to clear your conscience and reestablish broken relationships. Worthy or not, you can know real, lasting peace - and the assurance that God still has a plan for your life.Story Behind the BookThe idea for this book came to me when speaking at Promise Keepers. There were many men who came to faith in Christ, but then failed in their walk the next week or the next month. So they assumed that this new life was not for them; they thought that God was so angry with their failure, they might just as well live on the fringes of the Christian faith, rather than making it the core of their lives. This is a message of grace, not only in establishing our relationship with God, but in reconciling with those we have wronged, or who have wronged us.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Experiencing God's Peace: Philippians (A Woman After God's Own Heart®)",
        "Authors": "By George, Elizabeth",
        "Description": "Highlighting the presence of God's perfect peace, Elizabeth George helps women know God's perfect peace in every circumstance in their lives. They will discover how to respond to the needs of others; mature in Christ; and overcome anxiety. The \"heart response\" sections help readers grasp Paul's teachings and focus on God's loving provisions.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "How to Drive Your Competition Crazy: Creating Disruption for Fun and Profit",
        "Authors": "By Kawasaki, Guy, Moreno, Michele, and Kot, Rick (EDT)",
        "Description": "Offers irreverent, unconventional, and extreme strategies in sales, marketing, production, and human resources to make one's company more competitive",
        "Category": " Business & Economics , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The new complete English springer spaniel",
        "Authors": "By Goodall, Charles S",
        "Description": "",
        "Category": "",
        "Publisher": "*Howell Book House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Encouraging the Artist in Yourself (Even If It's Been a Long, Long Time)",
        "Authors": "By Warner, Sally",
        "Description": "Suggests projects to encourage involvement in drawing, painting, collage, printmaking, and sculpture",
        "Category": " Art , Study & Teaching",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Research Design: Qualitative and Quantitative Approaches",
        "Authors": "By Creswell, John W.",
        "Description": "This book provides the basis for deciding whether to use a qualitative or quantitative approach for the design of a research study and how to write up the results of a study for a journal article or dissertation.  Addressing these issues, the author offers a guide to the major design decisions, such as deciding upon a paradigm, stating the purpose of the study, identifying the research questions and hypotheses, using theory and defining and stating the significance of the study.",
        "Category": " Social Science , Research",
        "Publisher": "SAGE Publications, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Back to the Moon",
        "Authors": "By Hickam, Homer H.",
        "Description": "The shuttle is hijacked. Now the countdown to adventure begins....In his #1 New York Times bestselling memoir, October Sky, real-life NASA engineer Homer Hickam captured the excitement of America's first space ventures. Now, in this no-holds-barred joyride of a thriller, he straps us into the cockpit of the space shuttle Columbia as a renegade rocket man hijacks the shuttle—and blasts off on a Mach-speed chase into space....Jack Medaris is a man haunted by his past and driven by a dream: He's risking everything to \"borrow\" the Columbia—and pilot it to the moon. He didn't plan on an unexpected passenger, beautiful celebrity daredevil and scientist Penny High Eagle. To Penny, this hijacking will test every bit of her mettle as an adventurer—and as a woman. To Jack, the mission is a personal quest—to return to the moon and bring back what America left behind, something so explosive, it could change the future of the world. Now, as the U.S. government scrambles to the chase, and as deadly forces are deployed from earth to stop them, a man and a woman find their fates inextricably entwined. And in the savage emptiness of deep space, their only hope is to join forces to reach the lunar surface. Then comes the hard part. Getting home alive.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Island Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Golden Days: Memories of a Golden Retriever",
        "Authors": "By VANDERBILT, Arthur",
        "Description": "She had golden eyelashes, a fondness for Vermont cheddar, and a worn-out slipper she brought to those she felt sure needed it. From the time she was an eight-week-old puppy, Amy put herself in charge of the Vanderbilt family. She accompanied her human pack on sun-filled sailing expeditions on Cape Cod Bay, long beach walks, and brisk surf swims, and led them on uncountable jaunts of adventure and discovery. And on those rare occasions when Amy had to be left behind, she would lapse into a sulk worthy of the best Hollywood leading ladies.Tenderly told, with absorbing asides on the picturesque coastal landscape of Cape Cod, Golden Days is the story of a unique friendship that illustrates the invaluable lessons of life and love only a dog can teach us about ourselves and the world we share.",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Far Side Gallery 5",
        "Authors": "By Larson, Gary",
        "Description": "",
        "Category": "",
        "Publisher": "Andrews Mcmeel",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "English Grammar for Students of Spanish",
        "Authors": "By Spinelli, Emily",
        "Description": "ENGLISH GRAMMAR FOR STUDENTS OF SPANISH explains the grammatical terms that are in Spanish textbooks and shows students how they relate to English grammar. Once students have understood the terms and concepts in their own language, it is easier for them to understand their textbook. With simple explanations and numerous examples, this brief handbook compares English and Spanish grammar and points out the similarities and differences.",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Heinle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Jiffy Phrasebook Italian",
        "Authors": "By Langenscheidt",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Langenscheidt Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Christmas: The Miracle of God with Us",
        "Authors": "By billy-graham-max-lucado",
        "Description": "",
        "Category": "",
        "Publisher": "Nelson, Thomas, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Dwarf Rabbits: How to Take Care of Them and Understand Them (Complete Pet Owner's Manual)",
        "Authors": "By Wegler, Monika",
        "Description": "Includes information on selecting, feeding, breeding, and caring for dwarf rabbits",
        "Category": " Pets , Rabbits, Mice, Hamsters, Guinea Pigs, etc.",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Why I Love Grandpa: 100 Reasons",
        "Authors": "By Lang, Gregory E. and Lang, Meagan",
        "Description": "With touching photographs of grandfathers and grandchildren of various ages and races, Why I Love Grandpa gives 100 reasons why grandfathers are truly special. In Why I Love Grandpa, best-selling author Gregory E. Lang and his daughter, Meagan, celebrate the importance of a grandfather in his grandchildren's lives, each reflecting on memories of their own grandfathers. A grandfather's position in the family is honored and almost sacred. With touching photographs of grandfathers and grandchildren of various backgrounds and ages, Why I Love Grandpa gives 100 reasons why grandfathers are truly special.",
        "Category": " Family & Relationships , Parenting , Grandparenting",
        "Publisher": "Cumberland House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Pets Welcome: Mid-Atlantic and Chesapeake Edition : A Guide to Hotel, Inns and Resorts That Welcome You and Your Pet",
        "Authors": "By Fish, Kathleen DeVanna, Fish, Robert, and Four Paws Press (EDT)",
        "Description": "",
        "Category": " Pets , General",
        "Publisher": "Four Paws Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "A Chosen Faith: An Introduction to Unitarian Universalism",
        "Authors": "By Buehrens, John A. and Church, Forrest",
        "Description": "For those contemplating religious choices, Unitarian Universalism offers an appealing alternative to religious denominations that stress theological creeds over individual conviction and belief. In this new edition of the classic introductory text on Unitarian Universalism, which includes a revealing, entertaining foreword by best-selling author Robert Fulghum (All I Really Need to Know I Learned in Kindergarten, It Was on Fire When I Lay Down on It), a new preface by UU moderator Denise Davidoff, and two new chapters by the authors, John Buehrens and Forrest Church explore the many sources of the living tradition of their chosen faith.",
        "Category": " Religion , Christianity , Protestant",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Adopting Cats and Kittens: A Care and Training Guide",
        "Authors": "By Jankowski, Connie",
        "Description": "That there is a tremendous overpopulation of cats in the United States is both common knowledge and a matter of grave concern. For many who would acquire a new pet, adoption is viewed as the most responsible means of finding the right cat. However, it is important to understand that if you decide to open your home to a stray or adopt from a shelter, an extra measure of patience, love and understanding is essential. Adopting Cats and Kittens: A Care and Training Guide reflects the special circumstances that surround the \"\"recycled\"\" cat and helps the new owner provide the cat with the secure, nurturing environment every pet deserves. This book offers sensible guidance on what your new cat needs to be happy and healthy and what to do to keep from contributing to the pet population explosion. Adopting Cats and Kittens is a book with a mission and a message of hope and concern for all who love cats and seek an end to their cruel treatment and abuse.",
        "Category": " Pets , Cats , General",
        "Publisher": "*Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Peter Pan in Kensington Gardens",
        "Authors": "By Barrie, J. M.",
        "Description": "",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Crown Pub",
        "Price Starting With ($)": "32.37",
        "Publish Date": {
            "Month": "September",
            "Year": "1977"
        }
    },
    {
        "Title": "Revolving pictures: A reproduction from an antique book",
        "Authors": "By Ernest Nister",
        "Description": "",
        "Category": "",
        "Publisher": "Collins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Oswald Jacoby on Poker",
        "Authors": "By Jacoby",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday, Doran & Company, inc.",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1944"
        }
    },
    {
        "Title": "Caught In Crystal",
        "Authors": "By Wrede, Patricia C.",
        "Description": "Kayl, a widowed innkeeper, finds her past returning to haunt her, when she is asked by the Sisterhood of Stars to take up, once again, her sword to battle an evil force emanating from the Twisted Tower in the Windhome Mountains",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "18.77",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Casual Outdoor Dining (Williams-Sonoma Lifestyles , Vol 9, No 20)",
        "Authors": "By Williams, Chuck, Williams, Chuck (EDT), Eskite, Richard (PHT), Brennan, Georgeanne, and Eskite, Richard",
        "Description": "Casual Outdoor Dining celebrates the pleasures of eating alfresco. From first course to last, the dishes combine seasonal ingredients with simplicity and ease, delivering all the best elements for a perfect outdoor menu. Each recipe is accompanied by an evocative full-color photograph and features invaluable tips on preparation, cooking, and storage. The opening pages are packed with ideas on how to create a memorable dining scene, cook and serve outdoor meals with style, and plan menus. An illustrated glossary describes more than 50 essential ingredients.",
        "Category": " Cooking , Methods , Outdoor",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "12.96",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "The Best Book of Ponies",
        "Authors": "By Budd, Jackie",
        "Description": "Saddle up and get ready to head down the trail with dozens of adorable ponies in this information-packed picture book. A foal trotting alongside its mother and the exciting action of ponies jumping at a show are some of the large, colorful scenes for doting pony enthusiasts to pore over. The complete pony universe is covered - the markings, the breeds, making friends with your pony, daily tasks in the stable, and learning to ride. The text, especially geared to 5-to-8 year olds, is complemented by detailed illustrations and informative captions. Activities such as grooming a pony and putting on a bridle are explained with clear, step-by-step instructions. A reference section at the back of the book includes an illustrated glossary and a comprehensive index. This pony-packed book makes a perfect gift for the young equestrian.",
        "Category": " Juvenile Nonfiction , Animals , Horses",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "The Alamo : Long Barrack Museum",
        "Authors": "By Daughters Of The Republic Of Texas (compiled by)",
        "Description": "",
        "Category": "",
        "Publisher": "Taylor Publishing Co.",
        "Price Starting With ($)": "17.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Maran Illustrated Dog Training",
        "Authors": "By Marangraphics Development Group",
        "Description": "Produced by the award-winning maranGraphics Group, Maran's Illustrated Guide to Dog Training is a valuable resource to a wide range of readers - from individuals picking up their first puppy to those who are looking to eliminate their pet's annoying behaviors. Instead of describing the myriad ways to perform each task, Maran's Illustrated Guide to Dog Training shows you the best way, while the full-color photographs and clear, step-by-step instructions walk you through each task from beginning to end. Thorough topic introductions and useful tips provide additional information and advice to help enhance your dog training experience. Maran's Illustrated Guide to Dog Training is packed with essential information for teaching simple commands and performing the most impressive tricks. Maran's Illustrated Guide to Dog Training costs less than the price of one private training lesson, and will be a permanent resource that can be accessed at any time.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Cengage Learning PTR",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Making It Easy",
        "Authors": "By Darling, Jennifer Dorland (EDT)",
        "Description": "• Savory recipes that can be prepared with little time and effort, yet with fabulous results.• Delicious meals for busy families or impromptu crowds.• Dozens of irresistible appetizers, main dishes, sides, and desserts for any occasion.• Great tips and shortcuts for faster meal planning and preparation.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Food Network Kitchens",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Simple 1-2-3 Cooking For Kids - Favorite Brand Name Series",
        "Authors": "By Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "6.33",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Tell Me About It (So Little Time)",
        "Authors": "By Stine, Megan, Olsen, Ashley, and Olsen, Mary-Kate",
        "Description": "Get invited to the party of the century.Sneak out of the house after curfew.Cover for your friend when her parents ask questions.Don't get caught!Chloe and Riley Carlson ... So much to do ... So little time.",
        "Category": " Young Adult Fiction , Media Tie-In",
        "Publisher": "Harper Entertainment",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Starstruck Summer (Lucy Russell : Centerstage, No 3)",
        "Authors": "By Thompson, Joan",
        "Description": "When Lucy's friend Jason, a teenage television star, joins the local theater company where she is on an internship for the summer, a romantic comedy comes to life behind the scenes, and heads for a disastrous finish. Original.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Camelot",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "KJV Gift and Award Bible",
        "Authors": "By Thomas Nelson",
        "Description": "The most attractive and readable Bible for awards and gifts on the market.",
        "Category": " Bibles , King James Version , General",
        "Publisher": "World Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "The Sin Bearer",
        "Authors": "By Taylor, Tom",
        "Description": "Abiel Ben Heled, a successful Jewish shipmaster, faces a devastating storm when he agrees to follow the orders of a Roman centurion and transport a shipload of slaves",
        "Category": " Fiction , Historical",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "Dark Fire",
        "Authors": "By Lowell, Elizabeth",
        "Description": "Cynthia Ryan makes her way through the dangerous Andean Cloud Forest with the help of guide Trace Rawlings--a callous man she despises--and as they forage deeper into the forest, she can no longer deny the passion that flares between them. Reissue.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Granite Man",
        "Authors": "By Lowell, Elizabeth",
        "Description": "Returning to her sprawling Colorado ranch with nothing but her battered car and a treasure map, Mariah MacKenzie encounters prospecting partner Cash McQueen, an argumentative, burly type who becomes all too aware of Mariah's innocence. Reissue.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "in the line of duty: the service and sacrifice of america's finest",
        "Authors": "By Clark, Constance",
        "Description": "",
        "Category": "",
        "Publisher": "Potomac Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "New Adventures of Mary-Kate & Ashley #22: The Case of the High Seas Secret: The Case of the High Seas Secret",
        "Authors": "By Olsen, Ashley, Olsen, Mary-Kate, and Leonhardt, Alice",
        "Description": "Trenchcoat TwinsCase Report...fromMary-Kate & AshleyOlsen and Olsen ahoy! Ashley and I set sail on a fantastic cruise vacation -- our whole family. The Ocean Queen had everything: pools, water slides, a video game arcade, even a Super Scavenger Hunt for the kids!But this cruise wasn't all smooth sailing. Someone was stealing the prizes for the Super Scavenger Hunt! Could we get to the bottom of this case --before the fun took a dive?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "HarperEntertainment",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Nightlife (Cal Leandros)",
        "Authors": "By Thurman, Rob",
        "Description": "“There are monsters among us. There always have been and there always will be. I’ve known that ever since I can remember, just like I’ve always known I was one……Well, half of one, anyway.”Welcome to the Big Apple. There’s a troll under the Brooklyn Bridge, a boggle in Central Park, and a beautiful vampire in a penthouse on the Upper East Side—and that’s only the beginning. Of course, most humans are oblivious to the preternatural nightlife around them, but Cal Leandros is only half-human.His father’s dark lineage is the stuff of nightmares—and he and his entire otherworldly race are after Cal. Why? Cal hasn’t exactly wanted to stick around long enough to find out.He and his half-brother Niko have managed to stay a step ahead for three years, but now Cal’s dad has found them again. And Cal is about to learn why they want him, why they’ve always wanted him…for he is the key to unleashing their hell on earth. The fate of the human world will be decided in the fight of Cal’s life…",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Next President",
        "Authors": "By Flynn, Joseph",
        "Description": "Joseph Flynn's critically acclaimed novel Digger was a People magazine Page-Turner of the Week and was hailed by The Denver Post as being \"as clever as...any John Grisham work.\" Now, with The Next President, he has set a new benchmark for suspense. This is no simple cat-and-mouse story, but a nonstop thriller in which you'll never guess who's the cat and who's the mouse until the shattering conclusion.J. D. Cade was trained to kill by his country. To kill without leaving the slightest suspicion as to who pulled the trigger. He did his duty and put the past behind him. Or so he thought. Now someone is blackmailing him to use his deadly skills one more time. Someone is using his only son as a pawn to force him to do what he swore he'd never do again: kill a human being. And this time the target is Franklin Delano Rawley-the first African-American on the verge of becoming the president of the United States. As J. D. penetrates the inner circle of the Rawley campaign and gets to know the man he must kill, the more he realizes how difficult it will be to pull the trigger. But in order to spare Rawley's life while saving his own son, J. D. must somehow find out who is behind the conspiracy that could change the fate of a nation. It won't be easy. J. D.'s every move is being watched by his blackmailer. He has already drawn the attention of a suspicious Secret Service agent. And he has met an old army \"friend\" working in the Rawley campaign. Just as troubling is J. D.'s attraction to Rawley's beautiful campaign manager. If J. D. does have to kill the candidate, he will have to betray her, too.Time is running out. When J. D. finally pulls the trigger, who will live and who will die? Rawley? J. D.'s son? Or J. D. himself? And who will be the next president? You won't find out until the explosive conclusion of Joseph Flynn's totally unique thriller, one that defies you to guess the answers.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "George Anderson's Lessons from the Light: Extraordinary Messages of Comfort and Hope from the Other Side",
        "Authors": "By Anderson, George and Barone, Andrew",
        "Description": "George Anderson—the world’s premier medium—offers a personal, first-hand glimpse of the Other Side and brings a message of hope and love for all, based on the illuminating lessons of his life’s work.In his years working with bereaved families to communicate with lost loved ones, George Anderson has earned an international reputation for his astonishing abilities. Now, for the first time, Anderson offers a vivid and intimate account of his spiritual communications. He explains what it’s like to be a psychic, what he experiences, and what it means. He directly answers the many questions most commonly asked of him. He also shares moving, inspirational, and reassuring readings that illuminate the meaning of life, the reality of the afterlife, the importance of spirituality, and our bond to the souls in the hereafter. They are messages that not only enlighten us about what awaits, but also teach us how to fulfill our significant roles here on earth and in life. They are messages of hope and love as extraordinarily beautiful as they are eternal.",
        "Category": " Religion , Inspirational",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "New Complete Home Landscaping",
        "Authors": "By Erler, Catriona Tudor",
        "Description": "New Complete Home Landscaping is an updated, expanded edition of Creative Homeowner's award-winning comprehensive book on landscaping for the home. It covers every aspect of home landscaping, from design principles to construction projects; plant selection to plant care. The book consists of three parts, Part One: Preparing to Landscape explains how to design and create a landscape. Part Two: Setting the Stage shows how to build such features as paths, ponds, walls, decks, and watering systems. Part Three: Planting and Growing describes how to select, plant, and care for flowers, trees, shrubs, ground covers, and lawns.",
        "Category": " Gardening , Landscape",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Papering and Painting : The Essential Guide to Home Decorating",
        "Authors": "By Time-Life Books, Cassell, Julian, and Parham, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "TIME LIFE BOOKS @",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "HTML Goodies (2nd Edition)",
        "Authors": "By Burns, Joe",
        "Description": "HTML Goodies, Second Edition  is based on the most popular tutorials at HTMLGoodies.com. It starts with a series of short primers teaching the basics of building Web pages, then continues with detailed tutorials covering  Linking  Adding images  Using Tables and Frames  Working with Style Sheets  Later chapters move beyond HTML, demonstrating how to add sound or video, JavaScript and CGI programming to Web pages.  The book finishes with a series of useful appendices you can refer to for quick reference.",
        "Category": " Computers , Programming Languages , HTML",
        "Publisher": "Que Publishing",
        "Price Starting With ($)": "6.58",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Gratins: Savory and Sweet Recipes from Oven to Table",
        "Authors": "By Moore, Paul (PHT), Salter, Tina, and Jacobes, Catherine (CON)",
        "Description": "Presents over fifty recipes for these baked dishes with a creamy interior and a crisp topping, in both sweet and savory varieties, using readily available ingredients and scant preparation time.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Israel--America's key to survival",
        "Authors": "By Evans, Mike",
        "Description": "",
        "Category": "",
        "Publisher": "Logos International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "13 French Science-Fiction Stories",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Relaxing into Clear Seeing: Interactive Tools in the Service of Self-Awakening",
        "Authors": "By Ardagh, Arjuna N.",
        "Description": "",
        "Category": " Body, Mind & Spirit , Mindfulness & Meditation",
        "Publisher": "Self X Press",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Sour Puss (A Mrs. Murphy Mystery)",
        "Authors": "By Rita Mae Brown",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Millionaires Handbook: How You Can Protect A Multi-Million Dollar Cash Prize",
        "Authors": "By Arthur M. Hiller",
        "Description": "",
        "Category": "",
        "Publisher": "Hiller",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Disney's Treasury of Children's Classics",
        "Authors": "By Ingoglia, Gina and Geis, Darlene",
        "Description": "",
        "Category": " Juvenile Nonfiction , Architecture",
        "Publisher": "Disney Editions",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Just a French Major from the Bronx",
        "Authors": "By Gary Trudeau",
        "Description": "",
        "Category": "",
        "Publisher": "Popular Library, 1972",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Band Saw Projects",
        "Authors": "By Crabb, Tom",
        "Description": "Offers advice on working with a band saw and shows how to make double-walled vessels, vases, breadbaskets, baskets, tankards, chests, bowls, and boxes",
        "Category": " Technology & Engineering , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Gambling Nevada Style",
        "Authors": "By Lemmel, Maurice",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Everyman's Judaica: An Encyclopedic Dictionary",
        "Authors": "By Geoffrey (Ed.) Wigoder",
        "Description": "",
        "Category": "",
        "Publisher": "Keter Pub. House Jerusalem",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Study Guide to accompany Managerial Accounting: Tools for Business Decision Making, 3rd Edition",
        "Authors": "By Kimmel, Paul D., Weygandt, Jerry J., Kieso, Donald E., and Kieso, Douglas W., Ph.D.",
        "Description": "Work more effectively and gauge your progress as you go along! This Study Guide is designed to accompany Weygandt’s Managerial Accounting: Tools for Business Decision Making, 3rd Edition. Each chapter of the study guide includes a chapter overview, review of study objectives, problems, true/false questions, multiple choice questions, and solutions. Each question is identified by a corresponding text study objective.    Weygandt’s Managerial Accounting: Tools for Business Decision Making, 3rd Edition gives students the tools they need to succeed, whether as accountants or in other career paths. With a framework in decision-making, it covers all the necessary techniques and concepts for a one semester, undergraduate managerial accounting course. Many students in this course are not accounting majors and will need to understand the big picture of accounting. Therefore, this text provides them with a pedagogy that helps to build their decision-making skills and to understand how to use accounting information to make quality business decisions in whatever major or career they choose.",
        "Category": " Business & Economics , Accounting , Managerial",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Pearl Jinx",
        "Authors": "By Hill, Sandra",
        "Description": "The Jinx Inc. treasure-hunting company has a new mission - to find the 'cave pearls' rumoured to exist in the bottom-most cavity of an ancient cave. But first, mission leader Caleb Peach has to find an expert consultant. An ex-Navy SEAL, Caleb is used to getting his man but Dr Claire Cassidy, archaeologist extraordinaire, is proving hard to pin down. Only after he tracks her down on her fishing holiday and proves that Jinx Inc. is an upstanding, responsible company does the she sign on the dotted line. The attraction is immediate but Caleb and Claire are very different people. He's buttoned up and goes by the book and still carries a lot of bitterness because of a painful past. She's a free spirit and truly self-sufficient and independent, yet she's not opposed to the possibility of love in her life.With Claire's help, along with the assistance of Cajun Healer, Tante Lulu, Caleb and his family reconcile. At about the ame time, adventure and hilarity abound as the crew of Jinx Inc. begin the search for and find the fabled cave pearls.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Man Against Tomorrow",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Avon 1278",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Bonnie Prince Charlie",
        "Authors": "By Mclaren, Moray",
        "Description": "",
        "Category": "",
        "Publisher": "Marboro Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "The Patio Garden",
        "Authors": "By Evans, Hazel",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "6 + 1 Traits of Writing: The Complete Guide, Grades 3 and Up",
        "Authors": "By Culham, Ruth",
        "Description": "Ideas, Organization, Voice, Word Choice, Sentence Fluency, Conventions, and Presentation. Look at good writing in any genre, and you'll find these traits. Think of them as the fuel that stokes the engine of writing. With this book, teachers will learn how to assess student work for these traits and plan instruction. And they'll be amazed at how the writing in their classroom improves. Includes scoring guides, focus lessons, and activities for teaching each trait. For use with Grades 3 & Up.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Scholastic Professional Books",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Perfect Drink: Refreshing Smoothies and Cocktails for All Occasions",
        "Authors": "By Frances Mayfield",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Book Publishing",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Practical Thai Cooking",
        "Authors": "By Schmitz, Puangkram C. and Worman, Michael J.",
        "Description": "Presents recipes from Thailand for foods such as cucumber salad, sour prawn soup, fried fish balls, chicken curry, and fried rice",
        "Category": " Cooking , Regional & Ethnic , Thai",
        "Publisher": "Kodansha USA Inc",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Good-bye Tonsils! (Picture Puffin Books)",
        "Authors": "By Mets, Marilyn (ILT), Hatkoff, Craig, and Hatkoff, Juliana Lee",
        "Description": "There's only one way to make Juliana's nonstop sore throats go away, and that's to remove her tonsils. Dr. Ward and Juliana's  parents help Juliana understand what will happen when she's in the hospital. By the time she has her surgery, she knows just what to expect. And when she returns to school, Juliana tells her friends, \"The worst thing about having your tonsils out is that you can only do it once!\"",
        "Category": " Juvenile Fiction , Social Themes , New Experience",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Make It in Minutes: Party Favors & Hostess Gifts",
        "Authors": "By Phillips, Roxi",
        "Description": "It’s always nice to thank your guests with a memorable take-home gift?or give your hostess a thoughtful token of appreciation. From coaster sets to personalized votives, this charming volume presents 40 quick yet creative projects that say ?thank you” beautifully. There are ideas for baby showers (a diaper-shaped goodie cup), girl’s night out (scented soap tied up with ribbons and herbs), children’s birthday parties, weddings, and more. With choices that include handmade note cards packaged with a holder and pen, a goodie-filled ?pamper yourself” basket, and a mini-vase made from a glass tube, all the hottest crafting categories are fully represented.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Union Square & Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Silent Night: Midnight in Death/Unexpected Gift/Christmas Promise/Berry Merry Christmas (Christmas Anthology)",
        "Authors": "By Robb, J. D., Holmes, Dee, Cross, Claire, Robb, J. D. (EDT), and Plunkett, Susan",
        "Description": "'Tis the season for passion and intrigue in these four festive Christmas novellas by four outstanding authors—including a Lieutenant Eve Dallas story from #1 New York Times bestselling author J. D. Robb.In J. D. Robb's \"Midnight in Death,\" Lieutenant Eve Dallas must postpone her first Christmas with her new husband, Roarke, to hunt for an escaped serial killer—but she and Roarke still manage to find ways to celebrate.Susan Plunkett's \"Christmas Promises\" brings a woman and her ex-fiance together after four long years as they search for a missing child—and make up for the broken promises of Christmases past.In Dee Holmes's \"The Unexpected Gift,\" Sabrina McKay and her five-year-old son are coping with the first Christmas since her divorce when her son finds a \"body\" in the yard—and unexpectedly they rediscover the true spirit of the holidays.In Claire Cross's \"A Berry Merry Christmas,\" a mysterious nanny has a special message to deliver to a young orphan and her uncle who long to feel the joy of Christmas in their hearts once again.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Broker: A Novel (John Grisham)",
        "Authors": "By Grisham, John and Boutsikaris, Dennis (NRT)",
        "Description": "In his final hours in the Oval Office, the outgoing President grants a controversial last-minute pardon to Joel Backman, a notorious Washington power broker who has spent the last six years hidden away in a federal prison. What no one knows is that the President issues the pardon only after receiving enormous pressure from the CIA. It seems Backman, in his power broker heyday, may have obtained secrets that compromise the world’s most sophisticated satellite surveillance system.Backman is quietly smuggled out of the country in a military cargo plane, given a new name, a new identity, and a new home in Italy. Eventually, after he has settled into his new life, the CIA will leak his whereabouts to the Israelis, the Russians, the Chinese, and the Saudis. Then the CIA will do what it does best: sit back and watch. The question is not whether Backman will survive—there is no chance of that. The question the CIA needs answered is, who will kill him?",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Random House Audio",
        "Price Starting With ($)": "9.73",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Prairie Storm:  Town Called Hope #3 (Heartquest)",
        "Authors": "By Palmer, Catherine",
        "Description": "Prairie Storm, by award-winning author Catherine Palmer, is the third book in the series A Town Called Hope. Continuing the saga of the Kansas town, Palmer teaches readers that God's wonderful plan for each of us includes peace and healing, even amidst the storms of life. A must-have for all Palmer fans as well as for anyone whose faith has been challenged by adversity.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Prairie Fire: A Town Called Hope #2 (Heartquest)",
        "Authors": "By Palmer, Catherine",
        "Description": "1998 HOLT Medallion finalist! / 1998 finalist for Romantic Times Reviewers Choice!The fictional town of Hope discovers the importance of forgiveness, overcoming prejudice, and the dangers of keeping unhealthy family secrets.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Don't You Know There's a War On?",
        "Authors": "By Avi",
        "Description": "World War II is on everyone's mind and in every headline, and Howie Crispers has a hunch that his school principal is a spy. With a little snooping around, Howie finds out something even more alarming. Principal Lomister may not be a spy, but he is plotting to get rid of Howie's favorite teacher. Howie's dad is fighting Nazis overseas, and his mom is working hard to support the war effort, so Miss Gossim is the only person Howie can depend on. With the help of his friends, and a plan worthy of radio show superhero Captain Midnight, Howie intends to save Miss Gossim!",
        "Category": " Juvenile Fiction , Historical , Military & Wars",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Stretching For Fitness, Health & Performance: The Complete Handbook for All Ages & Fitness Levels",
        "Authors": "By Oswald, Christopher A. and Bacso, Stanley N.",
        "Description": "Need to stay loose and limber? Find it tough to keep those muscles and joints healthy, pain-free, and working well? This is the user-friendly manual that will protect you from injury-whatever your fitness level or age. Designed for everyday use as well as for sports, and written by two chiropractors, it supplies all the basic and advanced concepts of stretching for optimal performance. By following these explicit movement by movement instructions, with hundreds of accompanying photos, you can:* prevent on-the-job muscle strain and backaches from heavy physical labor.* drain emotional stress from a tense body.* find ideal stretching routines for plane, car, or office.* improve your performance in every sport.* get a good stretch in the morning bath or shower--in only 10 minutes!* sneak in quick stretches during the day to rejuvenate your system.* follow programs for everyone from senior citizens to active athletes to even the youngest infants.Complete sections on anatomical structure and photos of several nonprofessionals doing the stretches will inspire you to get out there and do it right.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Complete Book of Pastry",
        "Authors": "By Clayton, Bernard",
        "Description": "An extensive collection of international pastry recipes, with complete instructions for various appetizers, entrees, and desserts, and drawings to illustrate pastry shapes and techniques",
        "Category": " Cooking , Courses & Dishes , Pastry",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Southern Living Homestyle Cooking",
        "Authors": "By Gunter, Julie Fisher (EDT)",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "More Clue Mysteries: 15 Whodunits To Solve In Minutes",
        "Authors": "By Cameron, Vicki and Tappin, Nigel",
        "Description": "Starring familiar characters from the classic 1949 board game, these stories give readers an opportunity to sleuth out the culprit among Colonel Mustard, Professor Plum, Mrs. Patricia Peacock, and the others in all manner of fun-to-solve intrigues.",
        "Category": " Games , General",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The New Atlas of Human Anatomy",
        "Authors": "By Walker, Richard (CON) and McCracken, Thomas (EDT)",
        "Description": "Offers anatomically correct, three-dimensional, computer generated images of the human anatomy, and includes explanations and descriptions of the body's parts, systems, and functions.",
        "Category": " Reference , Atlases",
        "Publisher": "Metro Books",
        "Price Starting With ($)": "7.54",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Will the Real Me Please Stand Up? (So We Can All Get to Know You! : 25 Guidelines for Good Communication)",
        "Authors": "By Powell, John and Brady, Loretta",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Thomas More Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Slightly Shady (Lavinia Lake and Tobias March)",
        "Authors": "By Quick, Amanda",
        "Description": "Amanda Quick's trademark is a bestselling combination of suspense, passion, and sparkling wit in historical tales alight with intrigue. Now she serves up the most tantalizing novel of her career as an enterprising woman allies herself with a mysterious spy, only to be caught up in a torrid brew of treachery–and temptation....SLIGHTLY SHADYFrom the moment the stranger burst into her antiquities shop in Rome, Lavinia Lake knew he was nothing but trouble. He said he was in pursuit of a killer. He swore he was only trying to save her. Yet Lavinia was convinced that Mr. Tobias March was bent instead on destroying her. When the self-described spy hustled her all the way back to England, Lavinia vowed she would find a way to repay him in full. She never dreamed that Mr. March had in fact been telling the truth, that he had been hired to track down a powerful villain. And just as his investigation was heating up, he found it complicated by the most ungovernable, exasperating–and slightly shady–woman he had ever met. Lavinia most certainly never dreamed they would meet again, forced into partnership under shocking circumstances–or that their fiery disputes would spark a sizzling desire as overwhelming as the danger they faced....",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Pojo's Yu Gi Oh trainers guide 2006",
        "Authors": "By Anon",
        "Description": "",
        "Category": "",
        "Publisher": "Triumph Entertainment",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Imperial Surprises: A Pop-Up Book of Fabergé Masterpieces",
        "Authors": "By Kelly, Margaret",
        "Description": "A unique pop-up book, full of inventive paper engineering, offers exquisitely rendered replicas of the elegant bejeweled Faberge+a7 eggs, which open up to reveal hidden surprises and were once Easter gifts for the Russian nobility. BOMC Div.",
        "Category": " Art , Techniques , Pastel Drawing",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Nixon Memo: Political Respectability, Russia, and the Press",
        "Authors": "By Kalb, Marvin L.",
        "Description": "An absorbing example of political journalism, The Nixon Memo is a case study of Richard Nixon's relentless quest for political rehabilitation. At issue is the key role of this former president of the United States (best known for his involvement in the famous \"watergate\" scandal) in the post-cold war debate about aiding Russia in its uncertain revolution.The story begins on March 10, 1992. Nixon had written a private memo critical of president George Bush's policy toward Russia. The memo leaked and exploded on the front page of The New York Times. Why would Nixon attack Bush, a fellow party member fighting for re-election? Why on an issue of foreign affairs, which was Bush's strength? The questions are as intriguing as the answers, and distinguished journalist and scholar Marvin Kalb offers a suspenseful, eye-opening account of how our conventional wisdom on United States foreign policy is shaped by the insider's game of press/politics.This story of Nixon's Machiavellian efforts to pressure the White House, by way of the press, into helping Boris Yeltsin and Russia sheds new light on the inner workings of the world inside the government of the United States. Marvin Kalb read the documents behind the Nixon memo and interviewed scores of journalists, scholars, and officials in and from Washington and Moscow. Drawing on his years of experience as a diplomatic correspondent, he identifies and illuminates the intersection of press and politics in the fashioning of public policy.\"An absorbing and often compelling argument that Richard Nixon directed his own political rehabilitation on the world stage, using presidents, lesser politicians, and the press as his supporting cast. This is a first-class job of unraveling a complex and usually unseen tapestry.\"--Ted Koppel\"With Marvin Kalb's captivating account, Richard Nixon continues to fascinate us even in death.\"--Al Hunt",
        "Category": " Political Science , General",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Great Desserts Cookbook",
        "Authors": "By",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Amer Express Pub Co",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "May I Please Have a Cookie? (Scholastic Readers, Level 1)",
        "Authors": "By Morris, Jennifer E. and Morris, J. E.",
        "Description": "In this Level 1 Scholastic Reader, Alfie learns that the best way to get a delicious cookie is to say please!Alfie loves his mommy's cookies, and he wants one more than anything! But grabbing for one, fishing for one, and dressing up as a cookie inspector don't seem to work. His mommy says there is a better way. What is it? Beginning readers will learn proper manners with Alfie as his mommy teaches him to say the magic words.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Flat Belly Diet! Pocket Guide: Introducing the EASIEST, BUDGET-MAXIMIZING Eating Plan Yet",
        "Authors": "By Vaccariello, Liz",
        "Description": "A quick and handy guide to smart eating choices from the diet that's transforming America belly by belly.All across America, people are changing their bodies—and their lives—thanks to the Flat Belly Diet! Now, making the best choices for a flat belly in the supermarket, at home, in a restaurant, or anywhere is even easier with the Flat Belly Diet! Pocket Guide by Liz Vaccariello. This handy and user-friendly book provides at-a-glance information such as: -a complete 28-day meal plan featuring all-new on-the-go recipes -corresponding shopping lists specially designed to maximize your shopping dollar-lists of serving sizes and calorie counts to help you make MUFA meals you love -best meal choices at the vending machine, the airport, popular restaurants, and more-pantry staples and Flat Belly Diet–friendly brands Including 90 all-new quick meal and snack pack recipes, each tested for time and taste, and created by a registered dietitian in response to questions from real dieters, the Flat Belly Diet! Pocket Guide is both an easy introduction to the diet for those who have yet to try it and an essential companion for the thousands who already swear by it.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Warrior Soul: The Memoir of a Navy Seal",
        "Authors": "By Pfarrer, Chuck",
        "Description": "“Since the first navy frogmen crawled onto the beaches of Normandy, no SEAL has ever surrendered,” writes Chuck Pfarrer. “No SEAL has ever been captured, and not one teammate or body has ever been left in the field. This  legacy of valor is unmatched in modern warfare.”Warrior Soul is a book about the warrior spirit, and it takes the reader all over the world. Former Navy SEAL Chuck Pfarrer recounts some of his most dangerous assignments: On a clandestine reconnaissance mission on the Mosquito Coast, his recon team plays a deadly game of cat and mouse with a Nicaraguan patrol boat. Cut off on the streets of Beirut, the author’s SEAL detachment must battle snipers on the Green Line. In the mid-Atlantic, Pfarrer’s unit attempts to retrieve—or destroy—the booster section of a Trident ballistic missile before it can be recovered by a Russian spy trawler. On a runway in Sicily, his assault element surrounds an Egyptian airliner carrying the Achille Lauro hijackers.These are only a few of the riveting stories of combat patrol, reconnaissance missions, counter-terrorist operations, tragedies, and victories in Warrior Soul that illustrate the SEAL maxim “The person who will not be defeated cannot be defeated.”",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Presidio Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Scarlet and Black",
        "Authors": "By Stendhal",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Walt Disney's Cinderella (a Little Golden Book)",
        "Authors": "By Dias, Ron (ILT) and Lorencz, Bill (ILT)",
        "Description": "The most beloved princess movie of all time—Disney's Cinderella—is retold in the classic Little Golden Book format. It's perfect for Disney Princess fans ages 2-5, and available just in time for the movie's Diamond Edition DVD and Blu-ray release in fall 2012.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Aristotle and an Aardvark Go To Washington: Understanding Political Doublespeak Through Philosophy and Jokes",
        "Authors": "By Cathcart, Thomas and Klein, Daniel",
        "Description": "Thomas Cathcart and Daniel Klein, authors of the national bestseller Plato and a Platypus Walk into a Bar, aren’t falling for any election year claptrap—and they don’t want their readers to either! In Aristotle and an Aardvark Go to Washington, our two favorite philosopher-comedians return just in time to save us from the double-speak, flim-flam, and alternate reality of politics in America. Deploying jokes and cartoon as well as the occasional insight from Aristotle and his peers, Cathcart and Klein explain what politicos are up to when they state: “The absence of evidence is not the evidence of absence.” (Donald Rumsfeld), “It depends on what the meaning of the word ‘is’ is.” (Bill Clinton), or even, “We hold these truths to be self-evident…” (Thomas Jefferson, et al). Drawing from the pronouncements of everyone from Caesar to Condoleeza Rice, Genghis Kahn to Hillary Clinton, and Adolf Hitler to Al Sharpton. Cathcart and Klein help us learn to identify tricks such as “The Texas Sharpshooter Fallacy” (non causa pro causa) and the “The Fallacy Fallacy” (argumentum and logicam). Aristotle and an Aardvark is for anyone who ever felt like the politicos and pundits were speaking Greek. At least Cathcart and Klein provide the Latin name for it (raudatio publica)!",
        "Category": " Philosophy , Political",
        "Publisher": "Abrams Image",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "150 Years of Photo Journalism (Vol 2)",
        "Authors": "By Hopkinson, Amanda",
        "Description": "",
        "Category": "",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "9.66",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Taste of Home:Casseroles: A Collection of Over 440 One-Pot Recipes - Straight from the Kitchens of Taste of Home Readers",
        "Authors": "By Lloyd, Heidi Reuter (EDT)",
        "Description": "Featuring more than four hundred easy-to-prepare, one-dish meals for the entire family, a brightly illustrated cookbook includes dishes for breakfast, lunch, dinner, dessert, side dishes, pot-luck dinners, and special occasions, along with suggestions for variations and substitutions, money- and time-saving tips, cooking hints, and more.",
        "Category": " Cooking , Courses & Dishes , Casseroles",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Precision bidding and precision play",
        "Authors": "By Reese, Terence",
        "Description": "",
        "Category": "",
        "Publisher": "Cornerstone Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Decision in Philadelphia: The Constitutional Convention of 1787",
        "Authors": "By Collier, James Lincoln and Collier, Christopher",
        "Description": "Includes a complete copy of the Constitution.Fifty-five men met in Philadelphia in 1787 to write a document that would create a country and change a world. Here is a remarkable rendering of that fateful time, told with humanity and humor. \"The best popular history of the Constitutional Convention available.\"--Library Journal",
        "Category": " History , United States , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Navy Brides: Navy Wife\\Navy Blues\\Navy Brat",
        "Authors": "By Macomber, Debbie",
        "Description": "Navy Brides by Debbie Macomber released on Mar 29, 2005 is available now for purchase.",
        "Category": " Fiction , Romance , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Inside My Heart",
        "Authors": "By Mcgraw, Robin",
        "Description": "I believe we were put on this earth to enjoy lives of joy and abundance, and that is what I want for you and for me. It's not my intention to give people advice on how to solve their problems (I leave that to my husband). But I've had my share of struggles over the years, and I know a thing or two about what has worked for me. I have chosen to be an active participant in my life rather than a spectator, and in so doing I have chosen how to be a woman, how to be a wife, and how to be a mother in ways that are uniquely my own. I offer the stories of these choices as evidence of the power of sheer determination, will, and faith in God.You've seen her on television with her husband, Dr. Phil. But now it's time for a heart-to-heart conversation with Robin McGraw. In Inside My Heart, Robin speaks woman to woman, inspiring you to embrace and celebrate the many roles you play and encouraging you to make deliberate choices that lead to a richer, happier, and more meaningful life. She shares with you the life-changing moments of her childhood years, dating and marrying Dr. Phil McGraw, raising two sons, and asserting herself as a woman in a man's world to show you that you have the power to make choices in your life. In fact, she's convinced that you must choose to go after the life you want.With a deep and abiding faith in God, Robin McGraw shares her story so you too can make choices that reflect your own heart's truest priorities and highest goals.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Thomas Nelson Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2012"
        }
    },
    {
        "Title": "The Color Kittens",
        "Authors": "By Brown, Margaret Wise",
        "Description": "",
        "Category": "",
        "Publisher": "Western Pub. Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "1:33 In Memoriam: John F. Kennedy",
        "Authors": "By Henderson, Bruce & Summerlin, Sam",
        "Description": "",
        "Category": "",
        "Publisher": "Cowles",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Christmas Wedding Belles (Harlequin Historical)",
        "Authors": "By Jarrett, Miranda, Cornick, Nicola, and McPhee, Margaret",
        "Description": "The Pirate's Kiss by Nicola CornickFamous and feared pirate Daniel de Lancey is master and commander of the Defiance. Only one woman makes him want to swap danger for desire, sea for seduction.… And with one  Christmas kiss, he will make Lucinda his bride!A Smuggler's Tale by Margaret McPheeMasquerading as a smuggler, society's handsome bad boy, Lord  Jack Holberton, finds himself protecting young Miss Linden's honor, despite his reputation. But will this rake keep his twelfth-night promise and return to claim her as his own?The Sailor's Bride by Miranda JarrettWar-ravaged Lieutenant Lord James Richardson is about to put in to Naples after a victorious sea battle that has made him a hero but has left its mark on his soul. Young and innocent, Abigail Layton is just the woman to heal his hardened heart.…",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin Historical",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Wanted",
        "Authors": "By Hino, Matsuri",
        "Description": "In the Mediterranean at end of the 17th century, former songstress Armeria disguises herself as a boy and boards the ship of the pirate Skulls--the man who kidnapped Luce, her first love. Captain Skulls is arrogant, violent, and a skirt chaser! And unfortunately for Armeria, he discovers she's a woman...",
        "Category": " Comics & Graphic Novels , Manga , General",
        "Publisher": "VIZ Media LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    }
]