[
    {
        "Title": "Billy Graham: God's Ambassador A Lifelong Mission Of Giving Hope To The World",
        "Authors": "By Hagee, John and Bus, Russ",
        "Description": "Billy Graham: God's Ambassador is a retrospective on the remarkable life and career of this living legend, witnessed and compiled by his longtime photographer, Russ Busby.  The photos, many of them never before published, follow Billy's life from his childhood in North Carolina, to the development and growth of his ministry, to the enormously popular crusades that swept six continents, to his most recent reflections from home.  Throughout, there emerges an intimate and unique portrait of a man who dedicated his life to the Gospel and became one of the century's most influential figures.",
        "Category": " Religion , Christianity , History",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Richard Simmons Farewell to Fat Cookbook",
        "Authors": "By Simmons, Richard, Morice, Winifred, and Ouellette, Ed",
        "Description": "This is not a weight-loss book, but rather a collection of wonderfully delicious recipes to prepare every day in your own kitchen. Simmons has trimmed the fat from these down-home favorites, and throughout the book Richard shares his \"Farewell To Fat\" wisdom, which has helped so many people to get down the pounds - millions, in fact.Before Simmons jumps into his favorite subject, the recipes, he tells all in chapter 1, \"Welcome to My Kitchen.\" Here he describes the six basic kinds of eaters (he's two of them); the Three Fat Sisters; his Holy Trinity (Sacred Fat, Sacred Sweet, and Sacred Salt); the Portion Patrol; deciphering the new food labels; how to use fresh spices; what basic kitchen equipment you need; and much, much more.And then there's the food. These are recipes steeped in American tradition - dishes passed on from one generation to another, and now updated with flavorful twists from Richard's own kitchen. The recipes are easy to fix; and each one includes preparation time, a nutrition analysis with the percentage of calories from fat, and Richard's personal anecdotes about the food.Throughout the book, Simmons offers easy-to-understand tips and special \"tricks\" for making everyday food fit into a healthy life plan - no complicated calculations or exotic foods, just Richard at his fun-loving best showing you how to eat well using food you already know. He tells you, among other things, how to get the fat out of food, the most effective low-fat cooking techniques, how to meet the butcher, what to do with leftover potato cooking water, and the secret of the special Simmons Roasted Garlic Potion.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "GT Publishing Corporation",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "New Garden Book",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "All aspects of home landscaping and gardening are illustrated and described for the amateur gardener",
        "Category": " Gardening , General",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "In Search of America",
        "Authors": "By Jennings, Peter and Brewster, Todd",
        "Description": "In an innovative blend of history and eyewitness journalism, the authors of The Century search the twenty-first century for evidence that the words, principles, and ideas of the founding fathers are still alive and well in America. 750,000 first printing.",
        "Category": " Social Science , Customs & Traditions",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "11.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "puttin' on the Paint",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": "",
        "Publisher": "unknown",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Garden Pools: Fountains & Waterfalls",
        "Authors": "By Sunset Magazine & Book Editors",
        "Description": "",
        "Category": "",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Fix It, Please",
        "Authors": "By Weiss, Ellen",
        "Description": "With all the characters of Sesame Street wanting their broken things fixed, Luis, who runs the Fix-it Shop, doesn't have time to work on his broken clock.",
        "Category": "",
        "Publisher": "Western Publishing Company, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Healing Your Sexual Self",
        "Authors": "By Woititz, Janet Geringer",
        "Description": "A sensitive guide provides a path toward personal change for the better by learning to identify and put to rest the anxieties that stem from destructive sexual experiences",
        "Category": " Medical , General",
        "Publisher": "Hci",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Little People Big Book About Things We Ride",
        "Authors": "By Jane Stine, Wendy Wax Editors Christopher Medina",
        "Description": "A collection of original stories, essays, poems, questions and answers, activities, and games about various forms of transportation.",
        "Category": "",
        "Publisher": "Time-Life for Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Havana Run: A John Deal Novel",
        "Authors": "By Standiford, Les and Standiford, John",
        "Description": "John Deal has spent much of his adult life trying to rebuild the Miami construction firm that his late father ruined. When the possibility of a major project in post-normalized Cuba arises, he can't help but be intrigued-only to find that he's been lured to Havana for another, far more dangerous purpose: to help spring an American prisoner from a Castro jail. Deal wants nothing to do with it, until he discovers who it is: a man closer to him than he could possibly have imagined, and the holder of secrets-secrets which more than one group would kill for . . . and soon do.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Wild Women: Crusaders, Curmudgeons, and Completely Corsetless Ladies in the Otherwise Virtuous Victorian Era",
        "Authors": "By Stephens, Autumn",
        "Description": "A fascinating and sometimes humorous glimpse into the lives of 150, 19th-century American women who refused to whittle themselves down to the Victorian model of proper womanhood. 50-black-and-white photos.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Conari Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Get Out of the Alphabet Number 2: Wacky Wednesday Puzzle Poems",
        "Authors": "By Dakos, Kalli and Graham, Jenny (ILT)",
        "Description": "The members of Ms. Churn's class take turns creating silly poems by mixing up the letters of the alphabet and numbers.",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Fighter Wing: A Guided Tour of an Airforce Combat Wing (Tom Clancy's Military Referenc)",
        "Authors": "By Clancy, Tom",
        "Description": "Now, for the first time, an insider's look at an Air Force combat wing -- the  planes, the technology, and the people . . . with Tom Clancy as your guide.Tom Clancy's previous explorations of America's armed forces, Submarine  and Armored Cav, revealed exclusive, never-before-seen information an the  people and technology that protect our nation. Now, the acclaimed author of Clear  and Present Danger and Debt of Honor takes to the skies with the U. S.  Air Force's elite: the Fighter Wing. With his compelling style and unerring eye for detail, Clancy captures the thrill of  takeoff, the drama of the dogfight, and the relentless dangers our fighter pilots face every  day of their lives . . . showing readers what it really means to be the best of the  best.Fighter Wing includes:Detailed analyses of the Air Force's premier fighter planes, including the F-15  EagleExclusive photographs, illustrations, and diagramsAn insider's look at the people behind the planes and weaponsCombat strategies and training techniques used by the U. S. Air Force",
        "Category": " History , Military , Aviation",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Little People: Big Book About the Sea                                                     Activity Book About the Sea",
        "Authors": "By",
        "Description": "An illustrated collection of stories, essays, songs, poems, activities, and games featuring the sea and its inhabitants.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Babes in Toyland",
        "Authors": "By James Howe",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Samurai Selling: The Ancient Art of Service in Sales",
        "Authors": "By Bockmon, Marc, Laughlin, Chuck, and Sage, Karen",
        "Description": "Samurai Selling is a unique guide for the modern salesperson.  The code of the ancient Japanese samurai is grounded in service and personal character.  Samurai Selling shows sales professionals how to apply the code of the samurai, so that whether you sell cars, real estate, office products, or personal home products, you have fresh and powerful techniques to win life-long customers.Samurai Selling tells stories of the ancient samurai and relates them to today's competitive sales climate.  Based on a proven seminar which the authors have taught to thousands of managers and sales professionals, the book is filled with practical tips, examples, and exercises that will hone your selling skills and improve your customer service.",
        "Category": " Business & Economics , Customer Relations",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Feast of Fools",
        "Authors": "By Cox, Harvey Gallagher",
        "Description": "",
        "Category": "",
        "Publisher": "Harpercollins (paper)",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "To Make the Bitter Sweet",
        "Authors": "By Dunaway, Patricia",
        "Description": "Adam Jarrett, a doctor who moves to Texas's Big Thicket area during a turn of the century oil boom, finds himself in conflict with the herbal treatments of a gifted local midwife",
        "Category": " Fiction , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "The Canadian Bomber Contract",
        "Authors": "By Philip Atlee",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Physical Geography: A Landscape Appreciation",
        "Authors": "By McKnight, Tom L.",
        "Description": "New edition of a physical geography textbook for undergraduates built around the theme of landscape appreciation.  Covers insolation and temperature, climatic zones and types, terrestrial flora and fauna, fluvial processes, coastal processes, and glacial modifications of terrain.  Includes many color photographs and diagrams.  Appends information on map projections and symbols, meteorological tables, and soil taxonomy. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Science , Earth Sciences , Geography",
        "Publisher": "Prentice Hall College Div",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Most Glorious Fourth (Vicksburg and Gettysburg, July 4th, 1863)",
        "Authors": "By Schultz, Duane P.",
        "Description": "The story of the Independence Day that turned the tide of the Civil War. July 4, 1863, was a  glorious day for the Union cause. It saw the  surrender of Vicksburg and the retreat of  General Lee's Army of Northern Virginia after a crushing defeat at Gettysburg. In interweaving  the narratives of these two storied battles,  Duane Schultz has presented a compelling  blow-by-blow account of what is arguably the  most pivotal point of the entire conflict. All  the players are brought to life here, whether it is Lincoln agonizing in the telegraph office  while he waits for news from Generals Grant and  Meade, General Pete Longstreet trying to cajole  Lee into revising his plan of attack, or the  women of the towns of Vicksburg and Gettysburg  coming under fire and tending to the legions of  wounded. We see a nation in the midst of its  greatest convulsion, and we see that, while the  \"Glorious Fourth\" dashed the greatest  hopes of the Confederacy, the war was far from  over.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Rodale's No-Fail Flower Garden: How to Plan, Plant and Grow a Beautiful, Easy-Care Garden",
        "Authors": "By Ellis, Barbara W. (EDT), Rodale Press (COR), and Benjamin, Joan (EDT)",
        "Description": "Provides simple tips and plant lists full of information on designing and creating low-maintenance gardens, in an authoritative reference featuring more than two hundred photographs and illustrations and fifteen garden designs. Organic Gardening Bk Club.",
        "Category": " Gardening , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "History of modern art: painting, sculpture, architecture",
        "Authors": "By Arnason, H. Harvard",
        "Description": "",
        "Category": "",
        "Publisher": "H. N. Abrams",
        "Price Starting With ($)": "10.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Cottage Book",
        "Authors": "By Sexton, Richard",
        "Description": "Small space? No problem - big style on a small scale awaits at every turn in The Cottage Book. Islands of pastoral bliss nestled in the urban landscape, the cottages of the San Francisco Bay Area have an aesthetic all their own, but one that works well just about anywhere. Richard Sexton's classic book in these irrestible hideaways is now back in stock featuring a new cover. In these colorful pages we visit timeless rustic retreats by Bernard Maybeck, chic city homes on a small scale, flower-strewn cottages tucked into sunny nooks, house-boat cottages, and a number of \"shacks\" turned upscale simple. A successful case for small is beautiful, here is ample inspiration for creating comfort and style when spaces is a a premium - including lots of great ideas for apartment dwellers.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Portfolio Of Bedroom Ideas",
        "Authors": "By Portfolio Ideas Series",
        "Description": "",
        "Category": "",
        "Publisher": "Cowles Creative Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Internet Detectives: Cyber Feud (Internet Detectives)",
        "Authors": "By Coleman, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "PAN MACMILLAN",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Six Degrees of Kevin Bacon",
        "Authors": "By Fass, Craig, Ginelli, Mike, and Turtle, Brian",
        "Description": "Describes a trivia game in which actors' appearances in movies are linked to the movies of Kevin Bacon",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Carriers: A Novel",
        "Authors": "By Lynch, Patrick",
        "Description": "In the heart of the rain forest, something deadly is stirring. Older than life itself, it feeds on the living, silently, mercilessly, with a speed and fatality matched only by the terror of its gruesome symptoms.Patrick Lynch's Carriers captures this fear, and presents a world where the war between mankind and nature makes any victory for science temporary at best. When a plague-like outbreak strikes Indonesia and a team of American biological-warfare experts are brought in to discover its source, they find only corpses and riddles without answers - until Holly Becker arrives. She's come to the jungle to find her two young daughters, likely victims of the terrible plague, and in her quest may lie the secret to the terror that threatens to engulf them all.",
        "Category": " Fiction , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Blacker Than a Thousand Midnights",
        "Authors": "By Straight, Susan",
        "Description": "Named one of the outstanding novels of 1992 by Publishers Weekly, The New York Times Book Review, and USA Today, I Been in Sorrow's Kitchen and Licked Out All the Pots established Susan Straight as one of America's foremost chroniclers of African-American life. In Blacker Than a Thousand Midnights, she fulfills the promise of the earlier book, and reintroduces readers to the inhabitants of fictional Rio Seco, California.This is the story of Darnell Tucker, and black firefighter and workingman trying to work the toughest turf of all: the straight and narrow. As his friends disappear around him - victims of the streets, of police dogs, of drugs, of an addiction to cheap thrills and guns - Darnell struggles to establish his own business, facing a thousand midnights before he's home free, with a job that supports his young family.Yet even as he gains a tentative sense of self, Darnell Tucker is drawn to the destructive beauty of fires, and to the wilder, untamed forces beyond the structure of domesticity. This search for balance in a dangerous world propels the quiet heroism of a beautifully evoked and very moving story.",
        "Category": " Fiction , African American , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Gift of a Letter: Giving the Gift of Ourselves-- Add Richness and Grace to Your Life Through the Art of Letter-writing",
        "Authors": "By Stoddard, Alexandra",
        "Description": "This enchanting book is dedicated to one of the most intimate and touching of human experiences -- the letter. With charm, grace, and enthusiasm, Alexandra Stoddard describes the art and the pleasure of writing letters and the surprising joy it can bring to writer and recipient alike. A letter that takes only a few minutes to write may be treasured for years. Its contents are a true expression of heart, mind, and spirit. Brimming with anecdotes and ways to bring letters into your life, Gift of a Letter inspires and satisfies.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Dell Publishing Group, Inc.",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Control Your Destiny or Someone Else Will",
        "Authors": "By Tichy, Noel M. and Sherman, Stratford",
        "Description": "The Six Rules Jack Welch Lives By: Control your destiny or someone else will. Face reality as it is, not as it was or as you wish it were. Be candid with everyone. Don't manage, lead. Change before you have to. If you don't have a competitive advantage, don't compete.",
        "Category": " Business & Economics , Corporate & Business History",
        "Publisher": "HarperPb",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Meant to Be: The True Story of a Son Who Discovers He Is His Mother's Deepest Secret",
        "Authors": "By Anderson, Walter",
        "Description": "Published to strong reviews and major media attention, this heartfelt and inspirational rags-to-riches memoir by the highly regarded CEO of Parade Publications tells the emotional story of how he came to terms with an identity and a family that he never knew he had until he reached middle age.Meant To Be begins when Anderson, a 21-year-old Marine returns from service to say goodbye to his dying father and tries to find the answer to a question that has inexplicably haunted him from his earliest years: Was the alcoholic, abusive man who has so tormented him in his childhood his real father? Shockingly, the answer turns out to be \"No.\" Unbeknown to him, at least until that point, his mother, a German Protestant, fell in love during World War II with a Russian Jew and bore his child. Anderson learns this information as a young man but he and his mother keep this secret for another 35 years, until the day Anderson—now an unusually successful publishing executive—meets an unknown brother who, it turns out, has lived a nearly parallel life. Meant To Be is a love story, a journey of self-discovery and spirituality, and a provocative challenge to common notions about the role of heredity in our lives.",
        "Category": " Psychology , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Tenor of Love: A Novel",
        "Authors": "By Di Michele, Mary",
        "Description": "A NOVEL OF PASSION AND BETRAYAL, ART AND AMBITION BASED ON THE LIFE OF ONE OF THE GREATEST OPERA SINGERS OF ALL TIME  One summer day in 1897, a young singer, Enrico Caruso, arrives at the home of the Giachetti family. He has come to Livorno to sing on the summer stage with Ada Giachetti, a famous and beautiful soprano. Ada's mother offers him a spare room, and before Ada herself has a chance to meet the unknown tenor, her younger sister, Rina, arrives home from the market and falls fatefully in love.  With the help of singing lessons from Ada, Caruso wins the leading role in Puccini's new opera La Bohème. Although Caruso loves Rina, it is Ada he adores, and they soon become lovers. Heartbroken, Rina becomes an opera singer too, hoping to take her sister's place. For decades, the two sisters are locked in a struggle to be the star on Caruso's stage and in his bed, while Caruso's voice grows more and more unimaginably beautiful.  But as his relations with the two sisters break down in scandal and tragedy, the now world-famous Caruso builds a new life for himself as the star of the Metropolitan Opera in New York. There, far from the drama and passion of Caruso's Tuscan life, a shy young American woman will win his heart and, taking the greatest leap of faith of all, supplant Ada and Rina as his one true love.",
        "Category": " Fiction , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "True State of the Planet",
        "Authors": "By Bailey, Ronald (EDT) and Competitive Enterprise Institute (COR)",
        "Description": "In the 25 years since the first Earth Day in 1970, the environmental movement has spawned a new generation of scientists asking vital questions about the true state and fate of the planet. But, surprisingly, some of their answers -- and even the questions themselves -- contradict the movement's deepest beliefs. Why are reserves of oil, precious metals, and other natural resources more plentiful than ever before? Why has the population growth of the twentieth century brought rising standards of living for nearly all? In The True State of the Planet ten premier scholars shatter the myths of overpopulation, food, global warming, and pesticides, while redirecting environmentalists' concerns to the far more urgent problems of fisheries, fresh water, and third-world pollution -- and the political causes behind them.",
        "Category": " Science , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Natural Care Library Kava: Safe and Effective Self-Care for Cramps, Respiratory Problems and Stress",
        "Authors": "By Pedersen, Stephanie",
        "Description": "Discusses the use of kava to help treat anxiety, back pain, depression, muscle cramps, stress, tension headaches, and other common ailments.",
        "Category": " Health & Fitness , Herbal Medications",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Soul Signs: Harness the Power of Your Sun Sign and Become the Person You Were Meant to Be",
        "Authors": "By Eichenbaum, Diane",
        "Description": "HOW YOUR SUN SIGN REVEALS YOUR PERSONAL PATH TO FULFILLMENT, GROWTH, AND HAPPINESS  Most astrology books see personality as destiny, but in Soul Signs, expert astrologer and teacher Diane Eichenbaum shows you how your birth sign reveals your personal path to spiritual and psychological transformation.  Your sun sign both describes your basic nature and holds the key to the lessons you must learn in this lifetime. For each sign of the zodiac, Eichenbaum reveals the way your sign empowers you, the weaknesses that sabotage your best intentions, and the repeating patterns of challenges and confrontations you will face. She explains the three healing steps to change specific to your birth sign, and shows you how to apply them in real life situations, giving you the right tools to make the right choice at every crossroads. And of course, she tells you which celebrities share your sign and its gifts. With enlightening information about your ascendant, moon, and opposite sign, Soul Signs will enable you to see beyond old self-limiting beliefs and embrace the power that is your birthright.",
        "Category": " Body, Mind & Spirit , Astrology , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Extreme Success: The 7-Part Program That Shows You How to Succeed Without Struggle",
        "Authors": "By Carlson, Richard (FRW) and Fettke, Rich",
        "Description": "SUCCESS WITHOUT STRUGGLE!  Have you tried to follow the old rules for success and found that they don't work anymore? Have you already achieved professional and personal success but secretly fear that you have accomplished everything that you ever will? Do you have a cherished dream that you want to realize? If so, read on. Extreme Success can be yours!  In this life-changing book, sought-after personal coach and extreme athlete Rich Fettke doesn't just lead us down the path to success, he shows us that it can be easier and, yes, more fun. By applying the lessons he has learned from extreme sports in his seven-part program, he shows us that learning to take risks is as important as doing your homework. Using quizzes, captivating stories, and specific step-by-step strategies, he explains how you can:   CREATE YOUR OWN \"LUCK\"  DEVELOP THE COURAGE FOR CHANGE  USE PARTNERSHIPS AND ALLIANCES TO EXPAND POSSIBILITIES  MAKE FEAR YOUR FRIEND  GET -- AND STAY -- IN THE ZONE  AND MUCH MORE!",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Halos",
        "Authors": "By Heitzmann, Kristen",
        "Description": "It was the halo that caught her heart between beats and made her pause to take notice. When Alessi Moore drives her red Mustang convertible into town, she wonders if this could be the place she was meant to find, a place to settle down. But when her convertible and all she owns is stolen, she is filled with doubt.",
        "Category": " Fiction , Westerns",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Pajama Game",
        "Authors": "By Olson, Eugenie Seifer",
        "Description": "When Moxie Brecker chose her kicky nickname back in college, it suited her perfectly. But now she feels it's one big misnomer. After graduation, she set out to command her own seventh-grade science class and was stunned to find the job too challenging. She didn't have the energy necessary to get a roomful of pre-teens excited about atoms, and she never felt like herself, so she handed in her chalk and lesson plans. Stumped about where to turn next, she followed the advice of her best friend Gerard and took a job folding underthings at the chain lingerie store in the mall.She's got plenty at home to distract her, including her neighbor, Steven Tyler (no, not that Stephen Tyler) and the kindly septuagenarian Joe, who runs the joke shop downstairs, but she spends her days languishing in the store. Though she feels tired and just out of it physically, she still gets bored steaming peignoir sets, protecting the thong table from shoplifters, and readjusting bras straps for hours on end. Maybe that's why, when a handsome guy named Allan starts hanging around the store for little chats, Moxie sees hope on the horizon. Maybe, just maybe, her employee discount won't go to waste for much longer…",
        "Category": " Fiction , Romance , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Incas: Book One: The Puma's Shadow",
        "Authors": "By Gilly, Alex and Daniel, Antoine B.",
        "Description": "A sweeping tale of splendor and savagery unfolds as an ancient Incan civilization is haunted by omens, shaken by civil war, shattered by European conquest...and transformed through the power of destined love.  Since childhood Anamaya has lived as a captive, waiting to learn how and when she will be offered as a sacrifice. But when the dying emperor, Huayna Capec, summons her, she is granted destiny, not death. Her eyes, as blue as the sacred waters of Lake Titicaca, are a powerful sign that she was sent by Quilla, the Moon Goddess, to ensure the emperor's passage to the Other World -- and she is entrusted with the emperor's last words: the secrets of the past and the future of the Incan empire.  Anamaya's new role as guardian of the emperor's Sacred-Double plunges her into the intrigues of Incan politics, the complexities of war...and the passions of a handsome Spanish nobleman, Gabriel Montelucar y Flores -- a stranger marked with the puma, a symbol of Incan spirituality and power. Traveling with the great conquistador Don Francisco Pizarro, Gabriel hungers for grand adventure, exotic wonders, great wealth, and a new life. The entwined fate he discovers with Anamaya will change both of their worlds forever.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "And If You Play Golf, You're My Friend: Furthur Reflections of a Grown Caddie",
        "Authors": "By Penick, Harvey, Shrake, Bud, and Shrake, Edwin",
        "Description": "Another round of inspiration and instruction.When Harvey Penick signed copies of his now classic first book, Harvey Penick's Little Red Book, Bud Shrake, his coauthor, noticed that he often inscribed them with the line “To my fried and pupil.” When Shrake asked him why, Penick replied “Well, if you read my book, you're my pupil, and if you play golf, you're my friend.” Taking up where the Little Red Book left off, this is the second dose of Penick's singular brand of wit and wisdom, full of the simple and easy-to-understand lessons on golf that Penick is known and admired for. Like its predecessor, And If You Play Golf, You're My Friend is rich with Penick's great love of the game, a love that he delighted in sharing with golfers of all ages and levels of ability.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Are You Really Going to Eat That?",
        "Authors": "By Walsh, Robb",
        "Description": "A two-time James Beard award winner recounts his travels throughout America and to such parts of the world as Thailand, Nova Scotia, and Mexico, presenting a collection of essays and recipes that offer insight into the cultures behind various multicultural cuisines. 35,000 first printing.",
        "Category": " Cooking , Essays",
        "Publisher": "Counterpoint",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Trump: How to Get Rich",
        "Authors": "By Trump, Donald and McIver, Meredith",
        "Description": "First he made five billion dollars.Then he made The Apprentice.Now The Donald shows you how to make a fortune, Trump style.HOW TO GET RICHReal estate titan, bestselling author, and TV impresario Donald J. Trump reveals the secrets of his success in this candid and unprecedented book of business wisdom and advice. Over the years, everyone has urged Trump to write on this subject, but it wasn’t until NBC and executive producer Mark Burnett asked him to star in The Apprentice that he realized just how hungry people are to learn how great personal wealth is created and first-class businesses are run. Thousands applied to be Trump’s apprentice, and millions have been watching the program, making it the highest rated debut of the season.In Trump: How To Get Rich, Trump tells all–about the lessons learned from The Apprentice, his real estate empire, his position as head of the 20,000-member Trump Organization, and his most important role, as a father who has successfully taught his children the value of money and hard work.With his characteristic brass and smarts, Trump offers insights on how to• invest wisely• impress the boss and get a raise• manage a business efficiently• hire, motivate, and fire employees• negotiate anything• maintain the quality of your brand• think big and live largePlus, The Donald tells all on the art of the hair!With his luxury buildings, award-winning golf courses, high-stakes casinos, and glamorous beauty pageants, Donald J. Trump is one of a kind in American business. Every day, he lives the American dream. Now he shows you how it’s done, in this rollicking, inspirational, and illuminating behind-the-scenes story of invaluable lessons and rich rewards.",
        "Category": " Business & Economics , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Framing a Life: A Family Memoir",
        "Authors": "By Whitney, Catherine and Ferraro, Geraldine A.",
        "Description": "Framing a Life is Geraldine Ferraro's touching memoir of her Italian American family. Like the frame on which her mother once crocheted beads to make a living, Framing a Life draws together a tapestry of immigrant family stories both past and present. Beginning with the arrival of her grandmother Maria Giuseppa Caputo on these shores in 1890, the author takes us on a grand journey that includes her own vice presidential nomination in 1984 and brings us to the present day, spanning a total of five generations.  In the immigrant ghettoes of New York's Lower East Side and Italian Harlem, Maria Giuseppa raised ten children, one of whom was Gerry's mother, Antonetta Corierri. The young Antonetta was forced to leave school after the eighth grade to work as a crochet beader in a garment factory, but she had aspirations to lead a better life. She fulfilled this goal when she married Dominick Ferraro, an up-and-coming Italian immigrant, and they opened a restaurant and store in Newburgh, New York. But her fortunes took a tragic turn when Dominick died suddenly of a heart attack. Determined not to let her dreams of a better life for her son and daughter die with her husband, Antonetta moved to the Bronx and returned to crochet beading to put Carl and Gerry through school. Once, observing Gerry's poor crocheting skills, Antonetta warned her, \"Get an education or you'll starve to death!\" Gerry took heed, becoming a teacher before she turned her attention to the law and to politics.  Antonetta Ferraro's single-mindedness paid off in the ultimate immigrant success story. Geraldine Ferraro, whose grandmother could not read or write and whose mother left school at age fourteen, rose to become a symbol of the American dream -- for all immigrants and for all women.  Throughout Gerry's runs for office, including her vice presidential campaign with Walter Mondale in 1984, Antonetta was a constant presence by her daughter's side. She lived to see one of Gerry's daughters receive an MBA from Harvard but passed away before the other daughter became a doctor.  In Framing a Life Geraldine Ferraro leads us along her family tree, from her Italian roots to the branches that stretch into the future. Throughout, she draws parallels between her own and other immigrant families and the basic values, including religion and the importance of education, that unite them. She notes that contemporary immigrants from Asia and Latin America are no different from our country's European forebears in their circumstances and their dreams of a better life. No matter where one's family originated, Ferraro's story has resonance for us all.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "A Cat on Stage Left: An Alice Nestleton Mystery",
        "Authors": "By Adamson, Lydia",
        "Description": "Alice has her suspicions when a woman named Mary Singer offers to pay her $2,500 to board a cat named Dante. With her bank account nearly bare, Alice says yes. No sooner does Mary arrive in a luxurious limo to drop off her pet than she is shoved out of the car - and shot to death right in front of Alice's horrified eyes.And the cat in the carrier? It's just a stuffed toy.With the police baffled, Alice feels duty-bound to lend a hand. She joins up with a neighbor of the dead woman, a hard-bitten old pulp writer named Sam Tully, the current caretaker of Mary Singer's pet, an exotic Bengal cat known as Pickles.Aided by Tully, Alice is stunned to discover that Mary Singer's past eerily intersects with her own. Now all Alice has to do is stay alive long enough to let the cat out of the bag.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "THEIR EYES MEETING THE WORLD",
        "Authors": "By Coles, Robert and Sartor, Margaret",
        "Description": "\"When I recall all those pictures I have seen drawn (and discussed), I am reminded, yet again, how earnestly and strenuously children struggle to comprehend the world, to seek out its beauties and mysteries and terrors.\"For more than three decades, the renowned child psychiatrist Robert Coles has investigated the inner lives of children through their expressive words and pictures. His beautiful and revealing new book - his first devoted entirely to children's drawings - distills his insights into the ways children from all over the world disclose their deepest convictions, feelings, and dreams with crayon, paint, and pencil.The fifty full-color drawings in Their Eyes Meeting the World were created by boys and girls under ten from richly diverse backgrounds. Here is artwork by children urban and rural, Christian and Jewish and Muslim, children from the United States and from various other nations. In the company of Dr. Coles, we meet Helen, a ten-year-old dying of leukemia, and Ruby, the sole black child in a newly desegregated school. These are children who draw with profound seriousness and passion, and from their pictures Dr. Coles sensitively interprets what matters most in their lives, always attentive to the influence of race, class, region, and historical moment. Most important, he uses the visual worlds children represent to gain entry into their moral, religious, and spiritual lives.It was the poet-physician William Carlos Williams who offered the wisdom that guides Robert Coles's observations of children. \"Look at them, looking,\" he gently advised, \"their eyes meeting the world.\" In place of abstract analysis, Dr. Coles relies on the concreteness of art; he demonstrates with empathy and respect how eloquently children can use color and form to speak from the heart, mind, and soul.",
        "Category": " Psychology , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Wine for Women: A Guide to Buying, Pairing, and Sharing Wine",
        "Authors": "By Sbrocco, Leslie",
        "Description": "\"Wine is not to fear or revere, but to enjoy,\" says Leslie Sbrocco, wine expert. And that's exactly what she shows you how to do in Wine for Women, the first wine book written exclusively for women -- the majority of wine consumers.In Wine for Women, Leslie Sbrocco scraps the stuffy wine-speak and deals with what women really want to know about wine. The book includes shopping guides with hundreds of recommended wines, quick ideas for wine-friendly meals, and creative tips for sharing wine with family and friends.Organized into easy-to-manage sections, Wine for Women appeals to all levels of wine lovers. From Sauvignon Blanc to Chenin Blanc, Merlot to Malbec, and pink wines to dessert wines, Leslie Sbrocco makes her enormous knowledge of wine entertaining enough for the serious wine lover and accessible enough so any novice can feel like an expert.Each chapter focuses on a different variety of wine, and covers what Leslie calls the big three -- how to buy, pair, and share wine. You'll learn how to make smart buying decisions in stores and restaurants. Leslie also gives you practical advice for pairing wine and food and offers insights on entertaining with wine, whether you're having an informal picnic or planning the most formal of weddings. Confused between Chardonnay and Champagne? Think little black dress versus sequins. And Pinot Gris? Think your wine wardrobe's basic jeans. With her relaxed, friendly approach, Leslie makes it easy to understand the differences between wines and encourages women to explore and enjoy wine in their everyday lives.Keep Wine for Women in your kitchen. Bring it into your living room. Refer to it before you hit the wine shop, or when you just want an excuse to read, relax, and have a sip of something that's really you.",
        "Category": " Cooking , Beverages , Alcoholic , General",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Meet Mr. and Mrs. Green",
        "Authors": "By Baker, Keith",
        "Description": "Mr. and Mrs. Green are ready for some fun, and you're invited! Come along as they go camping, eat stacks of pancakes, and try their luck at the County Fair. (Snow cones, anyone?) Whatever the Greens are up to, it's sure to be an adventure, because life with these two is always full of surprises--not to mention chocolate bars, marshmallows, and rainbow sprinkles!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Harcourt Paperbacks",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Listening to Nature: How to Deepen Your Awareness of Nature",
        "Authors": "By Hendrickson, John (PHT) and Cornell, Joseph",
        "Description": "",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Dawn Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Success the Glenn Bland Method",
        "Authors": "By Bland",
        "Description": "",
        "Category": "",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "Laurel Lees Journal",
        "Authors": "By Lee, Laurel",
        "Description": "",
        "Category": "",
        "Publisher": "Christian Herald",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Living More Simply",
        "Authors": "By Sider, Ronald J.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Intervarsity Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1980"
        }
    },
    {
        "Title": "Gaia Atlas of Future Worlds, The",
        "Authors": "By Myers, Norman",
        "Description": "Examines the coming changes--environmental, political, and social--and discusses how they will interact and how we should react to them",
        "Category": " Social Science , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "6.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Preparing for Adolescence",
        "Authors": "By Dobson, James C.",
        "Description": "",
        "Category": "",
        "Publisher": "Gospel Light Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1978"
        }
    },
    {
        "Title": "Power of the Cross",
        "Authors": "By LaHaye, Tim F.",
        "Description": "Many people think of the cross as an image that represents what Christ did for us in the past. Yet best-selling author Dr. Tim LaHaye says the cross is vitally significant not just to history, but to our lives today. In this not-to-be-missed study, readers will discover the amazing method God has used to prove His existence-the very method He is using to reach the world today. First God used creation, then revelation, and then Jesus Christ to reveal Himself. Today He reveals Himself by transforming lives-the lives we live and the lives of those around us. Every story of transformation is unique, yet all have one thing in common: the transformation begins at the foot of the cross.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Chalktown: A Novel",
        "Authors": "By Haynes, Melinda",
        "Description": "In sparsely populated George County, Mississippi, along a quiet dirt road lined by sharecropper houses, lies Chalktown, a small village of folks who communicate mostly through the chalkboards set up in the front yards of their houses. Down the road lives the Sheehand family: sixteen-year-old Hezekiah, his older sister, Arena, his mentally disabled younger brother, Yellababy, and their disaffected and often cruel mother, Susan Blair, whose husband has abandoned both the house and the family. One day, with Yellababy strapped to his back, Hez sets out for Chalktown, determined to plumb its mysteries, or perhaps just to get away from his shabby home's oppressive atmosphere. And, on that same spring day, the family he's left behind will confront a tragedy that at once erases Hez's bitter past and paves the way for a hopeful future.",
        "Category": " Fiction , Literary",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Working at Home While the Kids Are There, Too",
        "Authors": "By Oberlin, Loriann Hoff",
        "Description": "Discusses choosing a home-based career, lauching a business, choosing a workspace, promoting a business, choosing childcare, and involving older children",
        "Category": " Business & Economics , Labor",
        "Publisher": "Career Pr Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Weight Training-P1 (Steps to Success Activity Series)",
        "Authors": "By Baechle, Thomas R. and Groves, Barney R.",
        "Description": "Introduces fundamentals of safety and technique, tells how to plan and evaluate a workout, and discusses exercise selection, training loads and sets, frequency, and program variation",
        "Category": " Sports & Recreation , General",
        "Publisher": "Wiley-Blackwell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Foods for Common Ailments",
        "Authors": "By Stanway, Penny",
        "Description": "Stresses the importance of a balanced diet, and suggests how to alleviate common health problems by eating certain foods and avoiding others",
        "Category": " Health & Fitness , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Midnight Partner, The",
        "Authors": "By Davis, Bart",
        "Description": "Sex is the most powerful force in my life. And to think I knew almost nothing about sex until a few days ago when I started a new life.That was the enigmatic message Jack Murphy left behind before taking a dive into his empty swimming pool. Officially the police are calling it a suicide. But his scriptwriting partner, Phillie Liebowitz, knew Jack better than that. And when you think your partner has been murdered, the script says you do something about it.Phillie had known for years about Jack's sexual conquests, the steady parade of bored housewives and lonely divorcees. After all, infidelity wasn't that unusual in their charmed Long Island circle. But nothing prepared Phillie for the dark trail of illicit relationships he uncovers when he begins to retrace Jack's last - and most powerful - sexual odyssey. Nothing prepared Phillie either for the onslaught of violent crime and painful betrayal unleashed by his search. Suddenly he is risking everything to find a killer.Phillie used to be faithful - faithful was what he did best. His life was devoted to his suburban values: his kids, his debts, his partner; and most impressively his wife. But the natural rhythm of Phillie's life is beating out of sync. Every bond that he once held sacred, every commitment that kept him in check, is about to be broken.",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "HOW DID THIS HAPPEN? Terrorism and the New War",
        "Authors": "By Rose, Gideon (EDT) and Hoge, James F., Jr. (EDT)",
        "Description": "In the aftermath of the terrorist attack on September 11, one question has been on everyone's mind: \"How did this happen?\" This book seeks to answer this question in all its critical aspects--the motives and actions of the terrorists, the status of the U.S. military, the context of the Middle East, bioterrorism, airport security, diplomatic pressures--and to provide readers with perspective, information, and sound interpretation. The editors of Foreign Affairs have brought together noted experts whose insights make the events of that terrible day more understandable, even as we steel ourselves for the conflicts ahead.",
        "Category": " Political Science , Political Freedom",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "A Positive Plan For Creating More Calm Less Stress",
        "Authors": "By Miller, Calvin, Peterson, Eugene H., and Ladd, Karol",
        "Description": "Busy. Hurried! FRAZZLED!!! A mom's life is anything but tranquil. With multiple responsibilities as caretaker, taxi driver, short-order cook, and domestic servant, what most women need in life is more calm-and less stress!More Calm, Less Stress provides that positive, biblically-based plan to help women realistically create an atmosphere of peace that she and her family so desperately need. The five delightful and doable action steps help mothers make their home a positive place to live.This is the first book in the Positive Plan series that will also include:A Positive Plan for Creating More Fun, Less Whining (June 2006) A Positive Plan for Creating More Love, Less Anger (June 2007)",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Ultimate Horse Book",
        "Authors": "By Hartley Edwards, Elwyn, Langrish, Bob (PHT), and Langrish, Bob",
        "Description": "Shows various breeds of horses from around the world, traces the history of the horse, and discusses health care, feeding, saddles, training, riding, breeding, and competitions",
        "Category": " Pets , Horses",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Everything College Survival (Everything Series)",
        "Authors": "By Rich, Jason",
        "Description": "Provides advice on such things as budgeting money, managing time, choosing a course of study, and other essential skills of survival for someone leaving home for the first time and venturing off to college. Original. IP.",
        "Category": " Education , Student Life & Student Affairs",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "97 Ways to Make a Dog Smile",
        "Authors": "By Langbehn, Jenny, Doyle, Pat (PHT), and Doyle, Pat",
        "Description": "It really works! Lower Ear Noogies. The Thumper. Lazy Man's Tetherball. Bobbing for Treats. The Hansel and Gretel: for an afternoon of fun, scamper about the house leaving a trail of plain popped popcorn in your wake.   97 Ways to Make a Dog Smile is a gift of pure pleasure for dogs and the owners who love them. Created by Jenny Langbehn, a veterinary nurse who really knows what makes dogs happy, it combines the creative gift of touch--unexpected ways to rub, massage, scratch, tickle, and knead--with imaginative play scenarios that are just loopy enough to ensure that your dog will be amused, whether he's laughing with you or at you. And to heighten the pleasure of both reader and dog, adorable full-color photographs of smiling dogs accompany each entry. Just look at those dogs (you might say), what a tail-wagging, chop-licking, howling good time they're having. And see if your dog doesn't agree.  Try In a Nutshell, the classic sleight-of-hand game, by hiding a treat under one of three plastic cups. The Lawrence Welk--dogs love to chase soap bubbles even more than toddlers do. Get fit while playing. Or use Subliminal Advertising, which works by sneaking a favorite word like cookie into an otherwise boring rant. You'll be surprised by how closely your dog pays attention to what you say, and how broad the smile will be when he hears that special word. Just be sure to have said cookie on hand.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Headache Relief",
        "Authors": "By Rapoport, Alan M. and Sheftell, Fred D.",
        "Description": "Presents information on the latest diagnostic tests and cures for headaches and discusses types of headaches, biofeedback, relaxation techniques, and diet and exercise",
        "Category": " Medical , Pain Medicine",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "The Everything Bridge Book: Easy-to-Follow Instructions to Have You Playing in No Time",
        "Authors": "By Manley, Brent and Mueller, Richard",
        "Description": "Offers techniques for learning the fundamentals of the popular card game, including advice on keeping score, communicating with your partner, and differentiating between good and bad hands.",
        "Category": " Games & Activities , Card Games , Bridge",
        "Publisher": "Everything",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Man in the Box",
        "Authors": "By Moran, Thomas",
        "Description": "Niki Lukasser can no longer deny the impact on her sheltered teenage world of World War II when the Jewish doctor who had saved her life years before comes seeking refuge with her family in Austria. Reprint.",
        "Category": " Fiction , General",
        "Publisher": "Riverhead Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Red and Purple on My Feet (Child's Steps to Jesus)",
        "Authors": "By Carlyle, Linda P.",
        "Description": "",
        "Category": "",
        "Publisher": "Pacific Pr Pub Assn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Gifted",
        "Authors": "By Blackstock, Terri",
        "Description": "Three friends whose lives needed a jolt...An earthquake that struck without warning...A supernatural gifting of mysterious powers...The Gifted is one of Terri Blackstock's most intriguing novels.  A massive natural disaster leads to an even more earth-shaking supernatural transformation in the lives of three friends who have no idea why they've been spared or infused with these distinct gifts.One thing is certain...the earthquake was just the warm-up for what lies ahead.",
        "Category": " Fiction , Religious",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Forensic Science of C.S.I.",
        "Authors": "By Ramsland, Katherine M.",
        "Description": "The CBS television show, \"C.S.I.: Crime Scene Investigation,\" has captured audiences - and ratings - with its unflinchingly realistic details of forensic science, tools, and technology. This fascinating new book - written by an acclaimed biographer with a master's degree in forensic psychology - goes behind the crime-solving techniques dramatized on the TV show to examine the reality of these cutting-edge procedures.From DNA typing and ballistics, to bitemark and blood pattern analysis, here are detailed accounts of the actual techniques used in today's crime investigations. Prominent experts in the field offer rare glimpses into cases ranging from missing persons to murder.For fans of the television show, as well as true crime buffs and science readers - this is the real thing.",
        "Category": " Science , Life Sciences , Biophysics",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Passion Dream Book: A Novel",
        "Authors": "By Otto, Whitney",
        "Description": "Fellow artists Romy March and Augustine Marks migrate from place to place, separately and together, united by their constant love for each other, in a story that moves from the Italian Renaissance and the life of Romy's ancestor to the early twentieth century. 100,000 first printing. $75,000 ad/promo. Tour.",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "The Unifying Force (Star Wars: The New Jedi Order, Book 19)",
        "Authors": "By Luceno, James",
        "Description": "**CONTAINS A BONUS CD-ROM!**At long last, the New York Times bestselling series that launched the Star Wars saga into the next generation and into thrilling new territory reaches its spectacular finale. Side by side, Luke Skywalker, Han Solo, Leia Organa Solo, their children, and their comrades in the Galactic Alliance rally for their last stand against the enemy that threatens not only the galaxy, but the Force itself.The Galactic Alliance’s hard-won success in countering the Yuuzhan Vong onslaught has proven all too brief—and the tide has turned once more to the invaders’ advantage. Having overcome the sabotage strategies of the Jedi and their allies, the marauding aliens have pushed deeper into the galaxy and subjugated more worlds in their ruthless quest for domination. Coruscant has been remade into a Yuuzhan Vong stronghold. The remnants of the resistance are struggling to form a united front. Luke, Mara, and Jacen are missing in action. Clearly the stage is set for endgame. Now, as Han and Leia receive the chilling news that hundreds of high-ranking Galactic Alliance prisoners face slaughter in a sacrifice to the enemy’s bloodthirsty gods, Luke and his team try desperately to convince the living world of Zonama Sekot to join the Jedi’s final campaign against the Yuuzhan Vong. Yet even as they speak, a lone space station is all that stands between Alliance headquarters on Mon Calamari . . . and wave after wave of ferocious enemy forces waging their most decisive assault.At the same time, the Jedi’s alliances throughout the galaxy are being tested—and the chances of victory jeopardized—by rogue factions determined to deploy the lethal weapon that will exterminate the Yuuzhan Vong . . . and perhaps countless other species. And among the Yuuzhan Vong themselves, the threat of revolt has reached a boiling point—as the oppressed underclass and powerful officials alike fear their Supreme Overlord’s mad actions will provoke the wrath of the gods.Ultimately, for both the forces of invasion and resistance, too much has been sacrificed —and too much is at stake—to ever turn back. And now, nothing can stand in the way of seizing victory . . . or facing annihilation.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "LucasBooks",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Market-driven Health Care: Who Wins, Who Loses In The Transforation Of America's Largest Service Industry",
        "Authors": "By Herzlinger, Regina E.",
        "Description": "What happens when the demanding consumers who nearly brought the U.S. automobile industry to its knees focus the same kinds of pressure on the industry that represents one-seventh of the U.S. economy—health care? The health organizations that combine quality, convenience, information, choices, and lower costs will be the winners in this revolution. Regina Herzlinger, chaired professor at the Harvard Business School, distills the facts from the noise surrounding the one industry whose measures of success are life and death. In a thoroughly readable, anecdotal style, she pinpoints the drivers of change—the savvy consumer, the cost-conscious payer, and the rapidly improving technology—that will revolutionize the American health-care system. This is a must-read for those in every corner of the immense health-care web. With its strong narrative style, this is a book that will be read and talked about by everyone concerned about the future of American health care.",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Cold Iron: A Henri Castang Mystery",
        "Authors": "By Freeling, Nicolas",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "The Middle Mind: Why Americans Don't Think for Themselves",
        "Authors": "By White, Curtis",
        "Description": "What do George W. Bush, the Ivory Tower, Steven Spielberg, and Terri Gross have in common?Does a political scandal make for good news copy?Does network programming allow us to unwind from a day's work?Does the art at the local museum make for pleasant cocktail conversation?An unflinching and wry look at the dumbing down of the American imagination.      In this groundbreaking and incisive exploration, acclaimed social critic Curtis White describes an all-encompassing and little-noticed force taking over our culture and our lives. White calls this force the Middle Mind -- the current failure of the American imagination in the media, politics, education, art, technology, and religion.The Middle Mind is pragmatic, plainspoken, populist, contemptuous of the right's narrowness, and incredulous before the left's convolutions. It wants to protect the Arctic National Wildlife Refuge, and has bought an SUV with the intent of visiting it. It even understands in some indistinct way how that very SUV spells the Arctic's doom.      The Middle Mind is not about left or right, highbrow or lowbrow, academia or pop culture; in fact, it pervades society without discrimination. The danger is not in a specific point of view, but rather in how the Middle Mind thrives in the common ground of unquestioned mediocrity. All we seem to ask about the culture we experience is whether it's entertaining.       White argues that we have forgotten how to read, to watch, to think for ourselves. Because it is neutral, widespread, and easily digestible, the Middle Mind has lulled the American imagination to sleep. As we sit comfortably amused and distracted, just outside the door there is an immediate crisis of a nation blindly following the path of least resistance. Irreverent, provocative, and far-reaching, White presents a clear vision of this dangerous mindset that threatens America's intellectual and cultural freedoms, concluding with an imperative to reawaken and unleash the once powerful American imagination.",
        "Category": " Political Science , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Getting a Life: Stories",
        "Authors": "By Simpson, Helen",
        "Description": "Set against the backdrop of modern-day London, a collection of nine entertaining short stories captures the joys, tribulations, triumphs, and annoyances of domestic life as it explores the worlds of two female teachers exchanging drunken confidences at a small cafT, a teenage poetry lover who resolves to build a future far different from her career-oriented mother, and others. 12,500 first printing.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Different Kind of Healing",
        "Authors": "By Goldberg, Philip and Janiger, Oscar",
        "Description": "",
        "Category": "",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Ring Bells! Sing Songs! Broadway Musicals of the 1930's",
        "Authors": "By Green, Stanley",
        "Description": "",
        "Category": "",
        "Publisher": "Galahad Books",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Vegetarian Times Complete Cookbook",
        "Authors": "By Vegetarian Times Magazine (EDT) and Moll, Lucy (EDT)",
        "Description": "Vegetarian Times Complete Cookbook is your definitive cookbook for vegetarians with more than six hundred delicious recipes, including vegetarian classics, meatless variations of American favorites, international dishes, healthful desserts, and more--plus, tips on cooking techniques, types of vegetarian diets, and health concerns",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Geographic Information Systems: An Introduction",
        "Authors": "By Star, Jeffrey and Estes, John",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Shape of Wars to Come",
        "Authors": "By Baker, David",
        "Description": "",
        "Category": "",
        "Publisher": "Stein and Day",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Gift of Jazzy",
        "Authors": "By Adams, Cindy Heller",
        "Description": "After New York Post columnist Cindy Adams lost her husband Joey to cancer, finding companionship again was the last thing on her mind. But one day, a visit from a friend brought just that, in the form Cindy least expected: a tiny dog. Cindy Adams brings her famous wit, smarts and taste for celebrity gossip to a wry and touching story of the bond between a dog and its unlikely owner.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Mind Over Golf: How to Use Your Head to Lower Your Score: How to Use Your Head to Lower Your Score",
        "Authors": "By Coop, Richard H. and Fields, Bill",
        "Description": "Mind Over Golf Whether you struggle to break 100 or consistently break par, you've already discovered that golf is the most mentally demanding of all sports. Dr. Richard Coop, one of the foremost sports psychologists in the country, has developed a unique mental approach to the game, helping both skilled pros and beginning amateurs alike to play better. Mind Over Golf examines all the demanding psychological challenges of golf and explains in detail how to conquer them. Golfers have discovered that there are ways to lower their scores that go beyond getting tips on their swing and stance. In order to play better, you have to find the key that allows your natural athletic ability to come to the fore, without being impeded by anxiety about making a poor shot. By following Dr. Coop's principles and ideas you'll be in the strongest possible position, both physically and mentally, to put your best swing on each shot. As Payne Stewart says in his foreword to Mind Over Golf, \"\"Not everyone can swing like a tour pro, but most everyone has it within himself or herself to think like one, and Dr. Coop lays the foundation for that within these pages.\"\" Visit us online at http://www.mcp.com/mgr/macmillan",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Odd Thomas",
        "Authors": "By Koontz, Dean R.",
        "Description": "Now a major motion picture starring Anton Yelchin, Willem Dafoe, and Addison Timlin, and directed by Stephen Sommers“The dead don't talk. I don't know why.”  But they do try to communicate, with a  short-order cook in a small desert town serving as their reluctant confidant. Odd  Thomas thinks of himself as an ordinary guy, if possessed of a certain measure of  talent at the Pico Mundo Grill and rapturously in love with the most beautiful girl  in the world, Stormy Llewellyn.  Maybe he has a gift, maybe it’s a curse, Odd has  never been sure, but he tries to do his best by the silent souls who seek him out.  Sometimes they want justice, and Odd’s otherworldly tips to Pico Mundo's sympathetic  police chief, Wyatt Porter, can solve a crime. Occasionally they can prevent one.  But this time it's different.  A mysterious man comes to town with a voracious appetite,  a filing cabinet stuffed with information on the world's worst killers, and a pack  of hyena-like shades following him wherever he goes. Who the man is and what he wants,  not even Odd’s deceased informants can tell him. His most ominous clue is a page  ripped from a day-by-day calendar for August 15.    Today is August 14.  In less  than twenty-four hours, Pico Mundo will awaken to a day of catastrophe.  As evil  coils under the searing desert sun, Odd travels through the shifting prisms of his  world, struggling to avert a looming cataclysm with the aid of his soul mate and  an unlikely community of allies that includes the King of Rock 'n' Roll. His account  of two shattering days when past and present, fate and destiny converge is the stuff  of our worst nightmares—and a testament by which to live: sanely if not safely, with  courage, humor, and a full heart that even in the darkness must persevere.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "The Faith of the American Soldier",
        "Authors": "By Mansfield, Stephen",
        "Description": "An exploration of the major wars in U.S. history as seen through the religious faith of the men and women serving in the military.  Since men and women in battle not only face the prospect of their own deaths but also must fashion a moral rationale for killing, the battlefield is often a place of tremendous religious transformation.  Do men and women at war revert to the faith of their youth or do they gravitate to the spirituality around them? Do they lose all faith in the face of horror, or do they piece together an informal faith that simply gets them through the fight? Are they better warriors and do they experience less post-traumatic stress if they believe their war is righteous and that they are agents of good? These are the questions Stephen Mansfield addresses in The Faith of the American Soldier.  The book opens with the core question which lies at the heart of the matter: what happens religiously to America's warriors when they go to battle, and what impact does this have on the nation's conduct of war? Mansfield surveys America's wars from a theological perspective in order to understand the theological framing and religious rationale for each, where they came from, and what effect they had on behavior on the battlefield.  Mansfield examines the religious nature of the warrior ethic today. There is a new generation on the battlefield now, one raised with less religious training and less connection to history than any that has come before. Soldiers are left to their own religious choices to frame their moral perspectives on war, on killing, and on the possibility of death. Mansfield explores these choices through the lens of his deep respect for the military-he comes from a long line of U.S. Army officers-and from his background as a Ph.D. in American history, and his more than twenty years' experience as a pastor.",
        "Category": " Religion , Faith",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Women Pray: Voices through the Ages, from Many Faiths, Cultures, and Traditions",
        "Authors": "By Furlong, Monica (EDT)",
        "Description": "The distinctive voices of women at prayer throughout the ages and around the world—compiled by the biographer of Therese of Lisieux.This beautiful book celebrates the rich variety of ways women around the world have called out to the Divine—with words of joy, praise, gratitude, wonder, petition, longing, and even anger—from the ancient world up to our own day. The prayers come from women of nearly every religious or spiritual tradition East and West, including ancient Greeks, Australian Aboriginals, medieval Christian mystics, Native Americans, Jewish poets, and Buddhist nuns. Together they provide an eloquent expression of women's inner lives that will resonate with modern readers, both women and men. Monica Furlong's intriguing commentary and insights make this a book to treasure and share.",
        "Category": " Religion , Prayerbooks , General",
        "Publisher": "SkyLight Paths",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "High-Tech Careers for Low-Tech People, Second Edition",
        "Authors": "By Schaffer, William A.",
        "Description": "It's no secret that the high-tech industry is one of the most vital segments of our economy. Now, is it fair that just because you preferred reading Shakespeare in college to studying microprocessors you should miss out on a high-paying job in this industry? Enter William Schaffer, a manager at Sun Microsystems and a self-confessed former technophobe who's convinced that even if you think Wintel is a glass cleaner, there's still hope. In clear, concise language, the author demystifies the industry for the uninitiated, discusses the jobs that are available to those without a background in technology, and details successful strategies for getting hired. Over 100 interviews from industry insiders round out the book, making this one-of-a-kind resource truly indispensable for anyone eager to take advantage of the limitless opportunities in technology.",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Yellow Wind: With a New Afterword by the Author",
        "Authors": "By Grossman, David",
        "Description": "With a new introduction by the author.The Israeli novelist David Grossman's impassioned account of what he observed on the West Bank in early 1987--not only the misery of the Palestinian refugees and their deep-seated hatred of the Israelis but also the cost of occupation for both occupier and occupied--is an intimate and urgent moral report on one of the great tragedies of our time. The Yellow Wind caused a sensation upon its original publication. Now with a new introduction by the author, it is essential reading for anyone who seeks a deeper understanding of Israel today.",
        "Category": " History , General",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "6.27",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Sotheby's Guide to American Folk Art",
        "Authors": "By Oak, Jacquelyn and Higgins, James Allen",
        "Description": "Discusses finding and purchasing sculptures, paintings, textiles, furniture, and decorative objects, and explains how to evaluate the quality and value of individual pieces",
        "Category": " Art , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Lizzie Borden:  A Dance of Death",
        "Authors": "By De Mille, Agnes",
        "Description": "",
        "Category": "",
        "Publisher": "Atlantic/Little, Brown",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Midas Touch: Understanding the Dynamic New Money Societies Around Us",
        "Authors": "By Sampson, Anthony",
        "Description": "Bestselling author Sampson ( The Money lenders ) describes the divorce of money from manufacturing actual goods and the globalization of wealth during the boom of the 1980s. His focus is on attitudes rather than economics on who has the money and how they use it. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Business & Economics , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Omens of Millennium: The Gnosis of Angels, Dreams, and Resurrection",
        "Authors": "By Bloom, Harold",
        "Description": "In this commanding and impassioned inquiry, Harold Bloom draws on a lifelong study of religion and, in particular, of Gnosticism, the knowing that God is not an external force but resides within each on of us. Through the ancient literatures of Jewish Kabbalah, Christian Gnosticism, and Muslim Shiite Sufism, he reveals to us the angels not as the kitschy cherubs we know today, but as magnificent, terrifying, sublime beings who have always played a central role in Western culture. He allows us to feel their splendor, and to experience the powerful role that dreams and near-death experiences have held throughout the centuries. And in the dazzling final chapter, he delivers a Gnostic sermon in which he urges us toward transcendence.",
        "Category": " Religion , General",
        "Publisher": "Riverhead Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Management Accounting (3rd Edition)",
        "Authors": "By Kaplan, Robert S., Atkinson, Anthony A. (EDT), Banker, Rajiv D., and Young, S. Mark",
        "Description": "Unique in approach, this book provides a balanced, cohesive integration of management and accounting that has been noticeably missing from current books. This book uses an activity-based cost management system to show how business managers use management accounting information to solve problems and manage activities within an organization. Readers learn how to design and operate information systems that create value for their organizations. The entire book blends contemporary theory and the latest research in management accounting with practical applications and actual company experiences.  The book provides a framework for management accounting and control systems, cost management concepts and cost behavior, traditional and activity based cost management systems and the different uses for management accounting information.  For controllers and individuals in finance or accounting functions.",
        "Category": " Business & Economics , Accounting , Managerial",
        "Publisher": "Pearson Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Outlaw School",
        "Authors": "By Ore, Rebecca",
        "Description": "Nominated for the 2000 James Tiptree Jr. Memorial AwardIn as gray, industro-technical future of protective shackles and slowed ideas, Jayne wants to be respectable and conform.  But conformity means accepting a limited destiny and the hollow entertainments that are brutally enforced as \"news\".  And to be respectable, she must gain back her virginity and give up an eye.  Jayne's life is out of control-her reality has teeth and educational drugs and binding tools- and the only cures for her growing dissatisfaction  with a bleak, repressive status quo seem to be madness or legal suicide. Or rebellion.  Jayne cannot, will not, be rehabilitated. So instead, she will live her life between lines, illegally encouraging the otherness of the lowly, the renegades, the crazies, the virtual whores, as she dedicates herself to the dangerous cause of outlaw education. There are many pitfalls built into the road Jayne has chosen to walk: failure, betrayal, terror, arrest, cyberia. But her courage and determination could be the catalyst for a new future.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Matters of State: A Political Excursion",
        "Authors": "By Hamburger, Philip",
        "Description": "A collection of essays on American political life that Hamberger originally wrote for  The New Yorker  magazine and other publications between 1946 and 1996. Among his topics are the Truman inauguration, Joseph McCarthy, the Kennedy election, Nixon's second inauguration, a Roosevelt retrospective from 1983, and Clinton. There is no index or bibliography. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " History , United States , 20th Century",
        "Publisher": "Counterpoint",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Southampton Row (Charlotte & Thomas Pitt Novels)",
        "Authors": "By Perry, Anne",
        "Description": "It's 1892, and an election is just days away. With Lord Salisbury's future looking uncertain, the political climate is perfect for an evil man with selfish ambitions to put himself forward as a Tory candidate. That man is Charles Voisey, whom Thomas Pitt recently defeated.Despite being thanked by Queen Victoria herself for the courage and loyalty he showed in the Whitechapel case, Pitt has been demoted from his position as Superintendent of Bow Street police to work in Special Branch: a mark of revenge by the Inner Circle. And now, Pitt's first case is to obtain every piece of information he can that might stop Voisey winning his Tory seat and beginning the climb to a power which would corrupt the justiciary of the land.Within hours of beginning his investigation into Voisey's affairs, Pitt is commanded by his superior to go to Southampton Row, where the murder of a famous medium, Maude Lamont, has been reported. Totally bewildered as to why this should be related to his task with Special Branch, Pitt arrives at the house. The murder was grotesque - and personal. Who were Maude Lamont's clients the night she died? Who had she claimed to call up from the past? And what had they revealed that had ended in murder?As a link is revealed between the spiritualist and the political figures Pitt is investigating, the whispers of scandal, violence and assault grow louder. And with his wife, Charlotte, hiding for safety with their children in the country, Pitt must turn to his sister-in-law Emily for help in solving one of his most high profile cases yet.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "How to Do Your Best on Tests (School Survival Guide)",
        "Authors": "By Gilbert, Sara D.",
        "Description": "This invaluable guide to studying covers everything students need to know about tests, including how to study for quizzes, tests, and exams and how to prepare for all the major standardized tests -- from the CAT to the Stanford Achievement Tests. Crammed with practical tips and sound advice -- plus a wide range of sample questions -- How To Do Your Best on Tests helps students approach every test with confidence.",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "Collins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Movie Business Book: Second Edition",
        "Authors": "By Squire, Jason E. (EDT)",
        "Description": "Behind the glitter of Hollywood lies a high-powered, multibillion-dollar business whose workings are known only to industry insiders.In The Movie Business Book, forty of Hollywood's most celebrated producers, directors, screenwriters, agents, lawyers, marketers, distributors, exhibitors, and deal makers reveal the secrets of their trade in personal accounts that are both highly informative and wonderfully entertaining.This new edition -- fully revised and updated for the movie industry of the '90s -- includes such unique perspectives as David Puttnam on producers, Sydney Pollack on directors, Henry Jaglom on independent filmmaking, Mike Medavoy on studio management, Richard Childs on home video, Martin Polon on new technology, and thirty-four more.",
        "Category": " Performing Arts , Film , Reference",
        "Publisher": "Fireside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "I Am Not a Crook",
        "Authors": "By Buchwald, Art",
        "Description": "Collected articles provide a witty and perceptive analysis of the Watergate scandal",
        "Category": "",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1974"
        }
    }
]