[
    {
        "Title": "Harm's Way (Alan Gregory)",
        "Authors": "By White, Stephen",
        "Description": "In this novel of \"fascinating psychological suspense\" (San Francisco Chronicle), Dr. Alan Gregory follows a trail of harrowing secrets, naked violence, and hidden shame into the haunted heart of a friend he thought he knew. And now, what Alan still doesn't know might kill him.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Unearned Pleasures and Other Stories",
        "Authors": "By Hegi, Ursula",
        "Description": "In this stunning collection of stories, bestselling author Ursula Hegi focuses on the problems of love -- familial, parental, conjugal, and emergent. With compassion and her \"unfailing immediacy of language,\" she raises the struggles of her characters to a plane of recognition that enables them to transcend despair. Life and death, age and youth, attained hopes and unearned pleasures, provide the human settings for a brilliant exploration of life at its most pointed and significant.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Renato's Luck: A Novel",
        "Authors": "By Shapiro, Jeff",
        "Description": "Renato Tizzoni, a waterworks man in the beautiful Tuscan village of Sant'Angelo D'Asso, has an infectious zest for life. But recently his rich and vibrant world has lost its piquancy. His best friend has died; his lovestruck teenaged daughter has become a sullen stranger; and even his passionate marriage is showing signs of cooling. To make matters worse, his beloved town is about to change dramatically. Prompted by a dream, Renato resolves to rediscover the flavor of life through a trip to Rome. But his fellow townspeople want in on the journey, and before long, Renato finds himself at the Vatican on behalf of all of them. There, as luck would have it, he finds a way to save his marriage, his family, and even his village.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Great White Lie: Dishonesty, Waste, and Incompetence in the Medical Community",
        "Authors": "By Bogdanich, Walt",
        "Description": "A journalist offers a frightening portrayal of American hospitals, revealing tales of critical nursing shortages, botched surgeries, false billings, forced labor, bureaucratic incompetence, and inadequate care",
        "Category": " Social Science , General",
        "Publisher": "Touchstone Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Three Fates",
        "Authors": "By Roberts, Nora",
        "Description": "A century after a priceless family heirloom is stolen and separated from its set of three, the original owner's great-great-grandchildren embark on a mission to recover the treasure and make their fortune, but their quest is thwarted by a fierce female professor of Greek mythology, a bold exotic dancer, a sexy security expert, and a woman who will let nothing stand in her way of acquiring the Three Fates. 550,000 first printing.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Carl Sandburg: Selected Poems",
        "Authors": "By Sandburg, Carl",
        "Description": "When Illinois-born Carl Sandburg was awarded the Pulitzer Prize for poetry in 1951, it was the crowning achievement of his nearly half century career as a poet.  At the time he was one of America's most popular living poets. His work embodied the American experience and spoke deeply to the hearts of the very people who inspired his greatest poems. For them, Sandburg symbolized America's innate integrity and boundless promise.  This volume contains the poems upon which Sandburg built his reputation and career.  The four poems selected from his rarely reprinted first collection, In Reckless Ecstasy, provide a fascinating glimpse into his developing talent.  They show him slowly breaking free of traditional verse forms toward his own voice.   This book features a deluxe cover, ribbon marker, top stain, and decorative endpapers with nameplates.",
        "Category": " Poetry , American , General",
        "Publisher": "Gramercy Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Simon & Schuster's Guide to Dogs",
        "Authors": "By Pugnetti, Gino and Schuler, Elizabeth Meriwether",
        "Description": "With more than 250,000 copies in print, Simon & Schuster's Guide to Dogs is the best guide available -- whether you need a dog book for general identification or to select the breed that is most suitable for you. With more than 320 breeds of dogs described and illustrated in full color, this book provides quick access to essential information on physical and psychological characteristics and care required. The entries for each breed give details on weight, height, markings, and type of coat, as well as information on personality traits, origins, uses, and care. Each entry also features easy-to-read visual symbols that indicate, for example, whether a breed of dog is good with children or has a tendency to bite, whether a breed is well- suited as a hunting dog or a guard dog, whether the dog needs to be kept outdoors or indoors or can live happily in the city, and much more.Filled with useful information and illustrated throughout, Simon & Schuster's Guide to Dogs is a valuable reference to the world of canines.",
        "Category": " Nature , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1980"
        }
    },
    {
        "Title": "The Advocate's Devil",
        "Authors": "By Dershowitz, Alan M.",
        "Description": "From the legal tactician who has represented such famous clients as Mike Tyson, O.J. Simpson, and Michael Milken, comes a novel that goes far beyond the limits of the courtroom thriller to probe our deepest fears and asks the controversial legal question--What do you do if you are a defense attorney who suspects your client is guilty and dangerous?",
        "Category": " Fiction , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "A Literary Christmas: Great Contemporary Christmas Stories",
        "Authors": "By Golden, Lilly (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Atlantic Monthly Pr",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Seven Sisters",
        "Authors": "By Drabble, Margaret.",
        "Description": "When circumstances compel her to start over late in her life, Candida Wilton moves from a beautiful Georgian house in lovely Suffolk to a two-room, walk-up flat in a run-down building in central London--and begins to pour her soul into a diary. Candida is not exactly destitute. So, is the move perversity, she wonders, a survival test, or is she punishing herself? How will she adjust to this shabby, menacing, but curiously appealing city? What can happen, at her age, to change her life?  In a voice that is pitch-perfect, Candida describes her health club, her social circle, and her attempts at risk-taking in her new life. She begins friendships of sorts with other women-widowed, divorced, never married, women straddled between generations. And then there is a surprise pension-fund windfall . . .  A beautifully rendered story, this is Margaret Drabble at her novelistic best.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "A New Owner's Guide to Maltese",
        "Authors": "By Abbott, Vicki",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The Swiss Family Robinson (Puffin Classics)",
        "Authors": "By Wyss          , Johann David and Kingston, W H G",
        "Description": "Shipwrecked on a tropical island, a Swiss minister, his wife, and four sons struggle to survive until they can be rescued",
        "Category": " Young Adult Fiction , Classics",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "St. John's Wort: Nature's Blues Buster",
        "Authors": "By Cass, Hyla",
        "Description": "Explains the properties of hypericum, commonly known as St. John's wort, an herb known for alleviating mild to moderate depression with few side effects",
        "Category": " Health & Fitness , Herbal Medications",
        "Publisher": "Avery Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Last of the Mohicans (Wordsworth Classics)",
        "Authors": "By Cooper, James Fenimore",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Frommer's Irreverent Guide to Paris (Irreverent Guides)",
        "Authors": "By Lobrano, Alexander F. and Ellison, Heidi",
        "Description": "Offers candid information on hotels, restaurants, shopping areas, nightlife, and entertainment in Paris, and describes the city's unique diversions.",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Washington: The Indispensable Man",
        "Authors": "By Flexner, James Thomas",
        "Description": "",
        "Category": "",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "The Borrowers Afloat",
        "Authors": "By NORTON, MARY, Krush, Beth, Krush, Joe, and Krush, Joe (ILT)",
        "Description": "Uprooted once again, the little people journey down a drain, live briefly in a teakettle, and are swept away in a flood. “As irresistible as its predecessors.”--Booklist",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Odyssey Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Baby Space: Finding, Furnishing, Decorating, and Equipping a Place for Your Newborn",
        "Authors": "By Liman, Ellen",
        "Description": "An illustrated handbook for parents-to-be offers practical ideas, advice, and projects to ehop prepare a space for a newborn baby, with ingenious suggestions on childproofing the home, decorating with fabric, recycling old furniture, selecting equipment, and more. Reprint. 15,000 first printing.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The WALL STREET JOURNAL GUIDE TO PLANNING YOUR FINANCIAL FUTURE REVISED",
        "Authors": "By Morris, Virginia B., Morris, Kenneth M., and Siegel, Alan M.",
        "Description": "A revamped, updated guide to retirement planning clearly explains the elements of pensions, Social Security, estate planning, salary reduction plans, IRAs, and similar topics and provides information on recent changes in the tax law. Original. 75,000 first printing.",
        "Category": " Business & Economics , Personal Finance , Retirement Planning",
        "Publisher": "Fireside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "What if Someone I know Is Gay?: Answers to Questions about Gay and Lesbian People (Plugged In)",
        "Authors": "By Marcus, Eric",
        "Description": "Offers no-nonsense answers to a full range of questions children might ask about gay people, whether those questions concern a friend, a beloved aunt or uncle, or themselves. Simultaneous.",
        "Category": " Social Science , LGBT Studies , Lesbian Studies",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Johns Hopkins Atlas of Human Functional Anatomy",
        "Authors": "By Schlossberg, Professor Leon, Zuidema MD, Dr. George D.",
        "Description": "",
        "Category": "",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "1980"
        }
    },
    {
        "Title": "The Yeast Connection: A Medical Breakthrough",
        "Authors": "By Crook, William G.",
        "Description": "An in-depth guide on how to suspect, identify, and over-come those health problems in people of all ages and sexes that can be traced to sensitivity to the yeast germ candida albicans. The Yeast Connection also includes:1. Easy-to-follow diet instructions;2. Information about labratory studies and tests, prescription and nonprescription medications, and treatment with candida vaccines; 3. A discussion of the yeast connection to AIDS, suicidal depression, and sexual dysfunction;4. Recommendations for vitamins, minerals, vegetable oils, garlic, and Lactobacillus acidophilus;5. MUCH, MUCH MORE! Yeast-connected health problems can be traced from the following symptoms:-Fatigue-Irritability-Premenstrual syndrome (PMS)-Digestive disorders-Muscle pain-Short attention span-Headache-Memory loss-Vaginitis-Skin problems-Impotence-Hyperactivity-Depression-Hypoglycemia-Menustral problems-Urinary disorders-Respiratory problems-Learning difficulties",
        "Category": " Health & Fitness , Reference",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Wolf Tower: The Claidi Journals I (Claidi Journals (Paperback))",
        "Authors": "By Lee, Tanith",
        "Description": "Cladi, a sixteen year old orphan, and handmaiden to a cruel royal family, is looking for a chance at freedom, and thinks she's found it when she helps a hansome and mysterious prisoner escape, but uncovers a conspiracy plot in the process, and must act quickly to avert it. Reprint.",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "To Boredom and Back",
        "Authors": "By Axtell, Kent",
        "Description": "",
        "Category": "",
        "Publisher": "Spring Arbor Distributors",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "The Ground Beneath Her Feet: A Novel",
        "Authors": "By Rushdie, Salman",
        "Description": "Salman Rushdie's most ambitious and accomplished novel, sure to be hailed as his masterpiece.At the beginning of this stunning novel, Vina Apsara, a famous and much-loved singer, is caught up in a devastating earthquake and never seen again by human eyes. This is her story, and that of Ormus Cama, the lover who finds, loses, seeks, and again finds her, over and over, throughout his own extraordinary life in music.  Their epic romance is narrated by Ormus's childhood friend and Vina's sometime lover, her \"back-door man,\" the photographer Rai, whose astonishing voice, filled with stories, images, myths, anger, wisdom, humor, and love, is perhaps the book's true hero. Telling the story of Ormus and Vina, he finds that he is also revealing his own truths: his human failings, his immortal longings. He is a man caught up in the loves and quarrels of the age's goddesses and gods, but dares to have ambitions of his own. And lives to tell the tale.Around these three, the uncertain world itself is beginning to tremble and break. Cracks and tears have begun to appear in the fabric of the real. There are glimpses of abysses below the surfaces of things. The Ground Beneath Her Feet is Salman Rushdie's most gripping novel and his boldest imaginative act, a vision of our shaken, mutating times, an engagement with the whole of what is and what might be, an account of the intimate, flawed encounter between the East and the West, a brilliant remaking of the myth of Orpheus, a novel of high (and low) comedy, high (and low) passions, high (and low) culture. It is a tale of love, death, and rock 'n' roll.",
        "Category": " Fiction , Literary",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Rory and Ita",
        "Authors": "By Doyle, Roddy",
        "Description": "Novelist Roddy Doyle, with his legendary skill in illuminating ordinary experience, here shares the story of his parents' lives, largely in their own words.  Born in 1923 and 1925, respectively, married in 1951, Rory and Ita Doyle remember the details of their Dublin childhoods and their life together-the people and the politics, the joys and the losses-and show us the transformation of the intensely Catholic society of their youth into the vibrant modern Ireland of today. By turns poignant, wry, hilarious, and sweet but never sentimental, Rory & Ita is an account of the moments that make up two intertwined lives and a book of tremendous warmth and humanity. It offers a whole new look at Doyle's heritage and source of inspiration.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Heart of the Sky: Travel Among the Maya",
        "Authors": "By Canby, Peter",
        "Description": "A look at Mayas as they still live today in villages throughout Mexico and South America discusses the religious rituals they still practice, the impact of modern war on the Guatemalan Maya, the effect of modern evangelism on Mayan religion, and more.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "How to Dunk a Doughnut: The Science of Everyday Life",
        "Authors": "By Fisher, Len",
        "Description": "Praised as ?the man who put the fun into physics? by the International Herald Tribune, Dr. Len Fisher has written an exceedingly lively and entertaining book on the science of everyday life. Following the routine of a normal day, Fisher shows how the seemingly mundane can provide insight into the most profound scientific questions. He explores the art and science of dunking, how to boil the perfect egg, how to tally a supermarket bill, the science behind hand tools, the secrets of haute cuisine, catching a ball and throwing a boomerang, bath (or beer) foam, the physics of sex and much more. With wit and aplomb, How to Dunk a Doughnut uses easy-to-digest concepts and a sense of humor to show nonscientists what science is really all about.",
        "Category": " Science , Physics , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Look Away",
        "Authors": "By Coyle, Harold",
        "Description": "At the heart of the story are two brothers, sons of a prosperous New Jersey businessman whose growing wealth and power are dependent on his ability to avoid choosing sides as the issue of states' rights threatens to divide the nation. James and Kevin Bannon, who have always shielded each other from their father's tyrannical outbursts, see their fierce loyalty abruptly shattered by their rivalry over a woman ... and her shocking, violent death. James is sent to VMI (Virginia Military Institute) to make something of himself, while Kevin attends college in the North. Soon they will find themselves on opposite sides in every great action of the war, with a stunning conclusion at the Battle of Gettysburg.",
        "Category": " Fiction , Historical",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Mary is Missing (Sweet Valley Twins, No. 36)",
        "Authors": "By Pascal, Francine and Suzanne, Jamie",
        "Description": "When their friend Mary does not show up for school for three days, the twins suspect foul play, and their investigation and a mysterious phone message lead them to an old house harboring shadowy figures",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Stop Spitting at Your Brother! Life Lessons of a Rocky Mountain Llama",
        "Authors": "By White-Crane, Diane (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Aspentree Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "The Care and Keeping of Friends (American Girl Library)",
        "Authors": "By Westcott, Nadine Bernard (ILT)",
        "Description": "Offers things to consider and suggestions on how to go about making new friends",
        "Category": " Juvenile Nonfiction , Social Topics , Friendship",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Schrodinger's Baby: A Novel",
        "Authors": "By McGregor, H. R. (EDT)",
        "Description": "Nihilistic Petruchio. Rational Juliet. Kerry the Temptress. A reckless student house in Glasgow, Scotland, where beds are shared as freely as drugs, liquor and cigarettes. It's all fun and games until Juliet finds a corpse under the stair case - which promptly disappears.The quantum theory of Schrodinger's cat has always appealed to Juliet's scientific mind. A cat, locked in a box with a radioactive atom and a vial of poison gas has a fifty-fifty chance of emerging alive. Until the door is opened, the cat inhabits both states of \"alive\" and \"dead.\" Does our perception of the cat determine its fate? Polar opposites, Juliet understands, can coexist: life and death, good and evil, truth and lies. Juliet starts to wonder if the body she spotted was ever really there. And the closer she comes to finding out, the more rapidly her roommates' lives begin to deteriorate. Finally, Juliet realizes that the truth she is looking for might better have been left in the grave.",
        "Category": " Fiction , Literary",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Exploring Great Inventions (Eyes on Adventure)",
        "Authors": "By Philip Koslow",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Great events (Eyes on America)",
        "Authors": "By Christopher, Tracy",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Bats (Eyes on Nature)",
        "Authors": "By Celia Bland",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Whales & Dolphins (Eyes on Nature)",
        "Authors": "By Ericson, Anton",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Wild Bears -Level 1 (See More Readers)",
        "Authors": "By Simon, Seymour",
        "Description": "Some bears are large and dangerous. Others are small and love to eat honey. In this concise introduction to the species, readers will find facts about all of their favorite bears, from the super-scary to cuddly and cute!",
        "Category": " Juvenile Nonfiction , Science & Nature , Anatomy & Physiology",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Making Money in Cyberspace",
        "Authors": "By Edwards, Sarah, Edwards, Paul, and Rohrbough, Linda",
        "Description": "The self-employment gurus of the Working from Home book series extend their mission to the online domain. Includes case studies, a listing of 125-plus Internet businesses, and a glossary for deciphering jargon such as \"trolling for newbies.\" No bibliography. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Computers , Internet , General",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Liturgical Foundations of Social Policy in the Catholic & Jewish Traditions",
        "Authors": "By Polish, Daniel F. and Fisher, Eugene J.",
        "Description": "",
        "Category": "",
        "Publisher": "Notre Dame/London: Univ. of Notre Dame Pr. c",
        "Price Starting With ($)": "5.9",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Writing: The Story of Alphabets and Scripts",
        "Authors": "By Jean, Georges",
        "Description": "Looks at the origins of writing, discusses cuniform and hieroglyphics, and traces the development of typography and printing",
        "Category": " Literary Collections , Letters",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The Menopause Bible: The Complete Practical Guide to Managing Your Menopause",
        "Authors": "By Phillips, Robin N., M.D. (EDT)",
        "Description": "An illustrated and comprehensive handbook for women on coping physically, mentally and emotionally with \"the change\".    The hormonal changes in women during menopause have a dramatic impact on physical, mental, and emotional health. Although menopause is universal for women, no two go through it the same way.    The Menopause Bible is a contemporary reference book that explains what it is, what happens, what can be done to minimize its effects, and how to maintain optimal health. The book is designed to help all women whether choosing a drug-free transition or medical intervention.    The book covers every aspect of menopause:  Why and how menopause occurs  Symptoms of menopause  Specific related health issues such as osteoporosis  Sexual health and techniques  Drug and            alternative treatments  Positive impact of proper diet and exercise  Regular health monitoring.    In-depth and up-to-date information on the controversial hormone replacement therapy (HRT) includes the risk factors, who can benefit, recommended monitoring procedures, and courses of treatment. While women with menopausal difficulties were once treated solely with HRT, now there are a number of options, including alternative treatments such as herbal replacement supplements.    Illustrated with full-color anatomical drawings and helpful photographs, The Menopause Bible enables a woman to take active control of her overall health at a critical time in her life.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Complete Stenciling Handbook",
        "Authors": "By Buckingham, Sandra",
        "Description": "Praise for the hardcover edition:  \"The ultimate reference for stenciling.\"  - Booklist    With the simple stencil -- a template that lets you easily create a painted shape on a surface and allows you to repeat the exact pattern wherever and as often as you wish -- you can transform and beautify just about any surface from boxes to walls to floors.    The Complete Stenciling Handbook is a compendium of the latest techniques, tools, equipment and materials. The book presents innovative methods and products that have taken stenciling from a rustic craft to a breathtaking art form. The book features a wide range of step-by-step projects illustrated with color photographs.    Buckingham comprehensively covers the materials needed for successful stenciling projects and explains the qualities of a variety of media such as            the differences between latex and oil paints. Clear, easy-to-read text simplifies the often confusing world of materials such as additives, matting agents, glazes, stains, thinners, finish coats and more. The book also includes instructions about when and how to use applicators such as brushes, rollers, sponges and airbrushes.    Creative topics with step-by-step instructions cover:  Shading and paint effects  Traditional borders and all-over patterns  Freeform stenciling and projection stenciling  Imitation textiles  Architectural elements, fake marquetry  Floor treatments, glass and ceramic tiles  Lettering and stenciling on fabric and paper.    The Complete Stenciling Handbook is the best and most comprehensive guide for crafters from             beginner to advanced.",
        "Category": " Crafts & Hobbies , Stenciling",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Sports: The Complete Visual Reference",
        "Authors": "By Fortin, Francois",
        "Description": "Sports is a comprehensive reference to 125 amateur and professional sports, featuring classic Olympic athletic events (track and field, aquatics, gymnastics, combat sports, and equestrian events), as well as team, individual and motor sports (boxing, hockey, tennis, skiing, soccer, basketball, and Formula 1).     With one thousand annotated illustrations and four hundred color photographs, this book explains the games' history, rules, strategies, facilities and equipment. In addition, there are highlights of the greatest players from the past and present, analyses of changes in technology and comparisons of performance over the years.     The presentation of the information is fascinating for browsers and fans. How big is a soccer pitch? What are the four types of tennis court surface? How do you throw the hammer? It is all here, plus three indices (terms, symbols and illustrations).              Athlete profiles that list physical and mental requirements for each sport are invaluable guides for young athletes choosing a sport.    For a full table of contents and sample page spreads, visit: fireflybooks.com/books/sports.html",
        "Category": " Sports & Recreation , Reference",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "7.72",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Fat Free Living Super Cookbook",
        "Authors": "By Steinback, Jyl",
        "Description": "This easy-to-use, informative cookbook for the health conscious '90s features over 400 totally new recipes, all created with the help of nutritionists and fitness experts, and all with less than one gram of fat per serving. Includes a two-week menu plan, shopping lists on every page, and information on nutritional content and dietary food exchanges.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Land Girls: A Spirited Novel of Love and Friendship",
        "Authors": "By Huth, Angela",
        "Description": "In rural World War II England, three very different young women from very different backgrounds find themselves thrown together, sharing an attic bedroom and laying the foundations for a friendship that would last a lifetime. Land Girls is the intelligent and often heartbreaking account of their first summer together. With wit and charm, Angela Huth has created a novel of delicate passions, richly observed.",
        "Category": " Fiction , Historical",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The Borrowers",
        "Authors": "By NORTON, MARY, Krush, Beth (ILT), and Krush, Joe (ILT)",
        "Description": "This is the classic story--read and loved by children all over the world--of Pod, Homily, and their daughter, Arrietty, who live under the kitchen floor in a quiet, half-empty house and get their livelihood by borrowing from the “human beans.” “Delectable fantasy.”--Booklist",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Mansfield Park (Wordsworth Classics)",
        "Authors": "By Austen, Jane",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Jerry Graham's more Bay Area backroads",
        "Authors": "By Graham, Jerry",
        "Description": "Suggests car trips in the nineteen counties around San Francisco, describes points of interest, and recommends restaurants and lodgings",
        "Category": "",
        "Publisher": "Perennial Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "First Coming (Library of Contemporary Thought)",
        "Authors": "By Feinstein, John",
        "Description": "THE LIBRARY OF CONTEMPORARY THOUGHT\"The Masters elevated Tiger Woods to a level of fame that perhaps no athlete outside of Muhammed Ali had ever achieved. People who knew absolutely nothing about golf, cared not at all about the sport, stopped to watch Tiger play. . . . He signed endorsement contracts for staggering amounts of money. He blew off the president of the United States and Rachel Robinson, the widow of the century's most important athlete--and made no apologies for it. He didn't have to. He was Tiger. They weren't.\"--from The First Coming",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Essential Jack Russell Terrier",
        "Authors": "By Stockdale, Renee (EDT) and Howell Book House (COR)",
        "Description": "A low priced, paperback book on Jack Russell Terrier care filled with gorgeous four colour photographs incorporated in a beautiful design.THE ESSENTIAL GUIDES have all of the information that the new or experienced pet owner needs for a successful relationship with his or her pet.  Packed with interesting sidebars, the books discuss bringing your new pet home; the optimal way to feed your pet; and how to properly groom your pet.  Also included are comprehensive chapters on health care and how to train your pet like an expert; as well as a special chapter filled with fun facts about your specific pet.The many fun and descriptive photos in THE ESSENTIAL GUIDES are taken by a professional photographer, and each book contains perforated fact cards with lots of helpful pet care tips for your convenience.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Is It Time To Make A Change?: Positive Thoughts for When Life Presents You With a New Direction - Special Edition (Self-Help & Recovery)",
        "Authors": "By Beisser, Deanna",
        "Description": "In this candid and upbeat first collection of her work, Deanna Beisser gives new meaning to the statement, \"Anything is possible.\" Her words capture all the doubts, fears, and excitement that occur whenever a life change is contemplated. Yet her refreshingly down-to-earth attitude and life-only-happens-once-so-enjoy-it! philosophy are quick to put the reader at ease. In short, this is a book about letting your life be the wonderful adventure it is meant to be.The opportunity to redirect your life's path and begin anew exists every day. The only person holding you back is you, and the only way your life is going to change is when you decide it is. Whether it's a little motivation you need or a reminder of the power you have within you to make things happen, this book is the perfect place to start. After that, it's up to you, because...\"Life makes no guarantees as to what you'll have. It just gives you time to make choices, and to take chances, and to discover whatever secrets might come your way.\"  - Deanna Beisser",
        "Category": " Poetry , General",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Parents Are Teachers, Too: Enriching Your Child's First Six Years (Little Hands(r))",
        "Authors": "By Jones, Claudia",
        "Description": "",
        "Category": " Education , Parent Participation",
        "Publisher": "WorthyKids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Man With a Squirrel",
        "Authors": "By Kilmer, Nicholas",
        "Description": "In Nicholas Kilmer's sequel to Harmony in Flesh and Black, the debut of his mystery series set in the Boston art world, we're reacquainted with the passionate non-collector Fred Taylor. Fred, prowling the antique and jumble shops of Boston's Charles Street, enters one of his old haunts - Oona's - which is run by an unflappable, seen-it-all proprietress as honest about her wares as she is ruthless in her pricing and secretive about acquisitions. Oona offers Fred a painting, the image of a common gray squirrel on a chain, which he discovers has been cut from a larger canvas.Believing it to be the work of an important eighteenth-century American master, he snaps up the fragment for his employer, the eccentric Beacon Hill art collector Clayton Reed. Then he sets out to find the remainder of the painting and its origins.Fred's quest, with assistance from his lover, Molly Riley, crosses and ultimately blocks the path of Dr. Eunice Cover-Hoover, whose specialty is deprogramming former members of satanic cults. Molly, pursuing her own agenda, becomes entangles with this adept psychologist - and, shortly, murder, mayhem, and other forms of vandalism join the violence already done to the painting.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "18.77",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Fit or Fat?",
        "Authors": "By Bailey, Covert",
        "Description": "This new look at aerobics supplies the needed information to help one lose weight and stay fit with a twelve-minute exercise plan",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Wwjd?: The Question Everyone Is Asking",
        "Authors": "By Bickel, Bruce and Jantz, Stan",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Bob Siemon Design",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Loving God: New Edition with Study Guide",
        "Authors": "By Colson, Charles",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Simply Flowers: Practical Advice and Beautiful Ideas for Creating Flower-Filled Rooms",
        "Authors": "By Ohrbach, Barbara Milo and Hall, John (PHT)",
        "Description": "\"When you bring flowers into your home and your life, you surround your family and friends with natural beauty that creates a climate of well-being and continuity.\"Barbara Milo Ohrbach, author of nine books, including the best-selling The Scented Room, now celebrates the joy of flowers in her gorgeously photographed new book, Simply Flowers.Ms. Ohrbach brings her creative approach and exquisite taste to arranging fresh flowers, providing all the basics you will need to effortlessly decorate and beautify your home with flowers, from simple country baskets spilling with vibrant wild flowers to stylish arrangements of carefully chosen blossoms.Filled with practical advice and innovative ideas, including handy lists of botanicals, Simply Flowers is a very personal and imaginative book that takes the mystery out of flower arranging, making it easy and enjoyable. Ms. Ohrbach offers important tips on selecting and cutting flowers, and how to keep them looking fresh and beautiful for as long as possible; choosing the proper vase to complement your bouquet; finding the perfect place for your flowers; clever ways of mixing fruits and vegetables with botanicals; and simple arrangements that are especially quick to make when you're pressed for time. She discusses forcing bulbs and branches; using silk flowers and house plants; and ways to use ribbons and fabrics that will turn your flowers into charming and welcome gifts.Readers with green thumbs (and even those without) will find helpful suggestions for planning their own cutting gardens or window boxes. And for anyone who likes to entertain, there are easy ideas for inventive table decorations.At the end of her book, Ms. Ohrbach shares the sources she has relied on over the years for cut flowers and arrangements, books on flowers and gardening, and catalogues for bulbs, seeds, plants, and tools and accessories.Whether you're a practiced hand at flower arranging, new to the art, or someone who just has a passion for flower-filled rooms, Simply Flowers will be a perennial inspiration.",
        "Category": " Gardening , Flowers , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Mouse on the Mile (The Green Mile, Part 2)",
        "Authors": "By King, Stephen",
        "Description": "",
        "Category": " Fiction , Horror",
        "Publisher": "New Amer Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Coffey on the Mile (Green Mile)",
        "Authors": "By King, Stephen",
        "Description": "",
        "Category": " Fiction , Horror",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Living History: A Memoir",
        "Authors": "By Herzog, Chaim",
        "Description": "Born during the Irish revolution to Ireland's chief rabbi, Chaim Herzog spent his formative years in Dublin's Irish-Jewish ghetto before being sent to school in Palestine. An officer in the British army during World War II, he helped to liberate the German concentration camps and was one of the first Allied witnesses to the atrocities of the Holocaust.Herzog returned to Palestine as a Zionist dedicated to the formation of the State of Israel. Through his eyes we see that process: from his days in the underground movement to his rise to the rank of general in the Israeli army and his involvement in creating Israel's superb intelligence agency. In the turbulent 1970s Herzog was appointed Israel's ambassador to the United Nations, never shrinking from the fight even when it seemed the entire world was against him and his country. And in 1983 he achieved his greatest success when he was elected president of Israel, a position he held for ten years.As soldier, politician, journalist, leader, or observer, Herzog has been present at almost all the great and tragic events in Israeli history. He has fought in too many of its wars and can explain all too clearly what it's like to live in constant expectation of terrorist attacks. He can place the relationship between Israel and the PLO into historical context and tell us what it was like to deal personally with Yasir Arafat. He describes lunch with the queen of England, negotiating with Ronald Reagan, and his final conversation with Yitzhak Rabin, shortly before the prime minister's assassination.",
        "Category": " History , Middle East , Israel & Palestine",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "To Listen to a Child: Understanding the Normal Problems of Growing Up",
        "Authors": "By Brazelton, T. Berry",
        "Description": "Fears, feeding, and sleep problems, croup and tantrums, stomachaches, asthma: these are some of the problems that every parent worries about at one time or another. According to Dr. Brazelton, most of these are a normal part of growing up. Only if parents add their own anxieties to the child's natural drive toward master will these \"normal problems\" become laden with guilt and tension and deepen into chronic issues. If parents can learn to listen, to hear the stress that may lie behind psychosomatic complaints, they can not only remove some of the excess pressures, but also help their children toward self-understanding.",
        "Category": " Psychology , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Runner's Complete Medical Guide",
        "Authors": "By Mangi, Richard",
        "Description": "Beginning with the causes of injury, the author describes how to diagnose and treat each problem and includes 65 illustrations detailing structure, injuries, and rehabilitation",
        "Category": " Health & Fitness , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1979"
        }
    },
    {
        "Title": "Oracles of Nostradamus",
        "Authors": "By Ward, Charles A.",
        "Description": "",
        "Category": "",
        "Publisher": "Hippocrene Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "The New American Landscape Gardener: A Guide to Beautiful Backyards & Sensational Surroundings",
        "Authors": "By Leighton, Phebe and Simonds, Calvin",
        "Description": "Gives advice on designing a garden, suggests solutions to common landscaping problems, and recommends useful plants",
        "Category": " Gardening , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Confessions of an S.O.B.",
        "Authors": "By Neuharth, Al",
        "Description": "",
        "Category": " Language Arts & Disciplines , Journalism",
        "Publisher": "Doubleday Business",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Finishing touches: Handmade, inexpensive ways to make a house a home",
        "Authors": "By Kramer, Jack",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "With God By Your Side\u0085 You Never Have To Be Alone: A Blue Mountain Arts Collection",
        "Authors": "By Morris, Gary (EDT)",
        "Description": "\"You are not alone. You never have been, and you never will be. God has been with you every step of the way. Where the path leads, He is lighting lamps to guide you.\"  - Alin AustinThis collection has touched the hearts and souls of readers around the world with its simple, everlasting truth: God is always there for you. These pages hold a beautiful affirmation that life's obstacles are also a part of God's wonderful plan, and that He never gives any heart a burden greater than it can bear. With insight and understanding, the authors gathered here share their messages of hope, reassurance, and faith in the ultimate triumph God helps us to achieve over any hardship, unhappiness, or trial we may face.Anyone who opens this volume will discover a source of comfort, reassurance, and inspiration that will help to sustain, enlighten, and encourage them on their journey. As a motivational gift or a valuable addition to any personal library, this book can be turned to time after time in years to come as a lasting reminder that you never have to be alone... with God by your side.\"God understands. He is your provider -- today, tomorrow, and always. And He loves you. Cast all of your cares on Him... and believe.\"  - Linda E. Knight",
        "Category": " Poetry , Subjects & Themes , Inspirational & Religious",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Annuals (Time-Life Gardener's Guide)",
        "Authors": "By Time-Life Books",
        "Description": "Shows and describes the care requirements of one hundred and fifty popular annuals, and offers advice on planning a flower garden, sowing seeds, and using fertilizers",
        "Category": " Gardening , Flowers , Annuals",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "All About Houseplants",
        "Authors": "By Lipanovich, Marianne (EDT)",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Easiest Flowers to Grow (Ortho Books)",
        "Authors": "By Goldenberg, Janet",
        "Description": "",
        "Category": " Gardening , Flowers , General",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Ideas for Great Windows & Doors",
        "Authors": "By Sunset and Atkinson, Scott (EDT)",
        "Description": "Describes window and door types and deciding where to locate them in the home, shows the various options in the setting of actual rooms, and discusses shopping and installation",
        "Category": " House & Home , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Chicken Soup for Little Souls The Never-Forgotten Doll (Chicken Soup for the Soul)",
        "Authors": "By McCourt, Lisa, Young, Mary O'Keefe (ILT), and Canfield, Jack",
        "Description": "Miss Maggie, the best babysitter ever, tells Ellie,",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Hci",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Bigger Secrets: More Than 125 Things They Prayed You'd Never Find Out",
        "Authors": "By Poundstone, William",
        "Description": "A compilation of important and banal inside information such as the secret recipe for Oysters Rockefeller and the phone company's own unlisted numbers",
        "Category": " Humor , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Modern Baptists",
        "Authors": "By Wilcox, James",
        "Description": "Bobby Pickens's secure, carefree bachelor existence is thrown into turmoil when his half brother, F.X., an ex-con, ex-actor, and three-times ex-husband, moves into his small-town Louisiana home",
        "Category": " Fiction , Humorous , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "A Woman's Life: The Story of an Ordinary American and Her Extraordinary Generation",
        "Authors": "By Cheever, Susan",
        "Description": "Examines the life and times of forty-five-year-old Linda Green, a typical suburban wife and mother, and shows how her story reflects and informs the story of her generation",
        "Category": " Social Science , General",
        "Publisher": "Quill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Miracle Life of Edgar Mint: A Novel",
        "Authors": "By Udall, Brady",
        "Description": "If I could tell you only one thing about my life it would be this: when I was seven years old the mailman ran over my head.  As formative events go, nothing else comes close. With these words Edgar Mint, half-Apache and mostly orphaned, makes his unshakable claim on our attention. In the course of Brady Udall’s high-spirited, inexhaustibly inventive novel, Edgar survives not just this bizarre accident, but a hellish boarding school for Native American orphans, a well-meaning but wildly dysfunctional Mormon foster-family, and the loss of most of the illusions that are supposed to make life bearable. What persists is Edgar’s innate goodness, his belief in the redeeming power of language, and his determination to find and forgive the man who almost killed him. The Miracle Life of Edgar Mint is a miracle of storytelling, bursting with heartache and hilarity and inhabited by characters as outsized as the landscape of the American West.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Last Orders",
        "Authors": "By Swift, Graham",
        "Description": "Four men gather in a London pub. They have taken it upon themselves to carry out the last orders of Jack Dodds, master butcher, and deliver his ashes to the sea. As they drive towards the fulfillment of their mission, their errand becomes an extraordinary journey into their collective and individual pasts. Braiding these men's voices, and that of Jack's widow, into a choir of sorrow and resentment, passion and regret, Swift creates a testament to a changing England and to enduring mortality. \"Swift has involved us in real, lived lives...Quietly, but with conviction, he seeks to affirm the values of decency, loyalty, love.\"--New York Review of Books\"A beautiful book...a novel that speaks profoundly of human need and tenderness. Even the most cynical will be warmed by it.\"--San Francisco Chronicle",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Blue Rise (Penguin Contemporary American Fiction Series)",
        "Authors": "By Hill, Rebecca",
        "Description": "With a failing marriage and her own identity wavering between contemporary womanhood and her traditional southern-family upbringing, Jeannine Lewis returns to her home in Blue Rise, Mississippi, to sort out her life",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "An OCEAN IN IOWA: A NOVEL",
        "Authors": "By Hedges, Peter",
        "Description": "In a small town in Iowa, Scotty Ocean has announced that seven is going to be his year. It does turn out to be his year, but not quite the one he had imagined. It is the year his mother abandons the family. At first, Scotty does astonishing things to get her to return. When he realizes she won't be coming back, he decides he must replace her. And when that proves impossible, he takes the dramatic step of trying to remain seven forever.  Funny, sad, and constantly surprising, An Ocean in Iowa explores the fragile contracts between parents and children and what it really means to grow up.",
        "Category": " Fiction , Literary",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Cutting Hill: A Chronicle of a Family Farm",
        "Authors": "By Pistorius, Alan",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Moon Over Minneapolis",
        "Authors": "By Weldon, Fay",
        "Description": "A collection of stories featuring women who must make difficult choices includes \"Subject to Diary\" and \"Pumpkin Pie.\" By the author of The Life and Loves of a She-Devil. Original. 35,000 first printing. Tour.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Touched by Angels",
        "Authors": "By Macomber, Debbie",
        "Description": "“Debbie Macomber writes characters that are as warm and funny as your best friends.”—Susan Wiggs “Debbie Macomber’s name on a book is a guarantee of warm-hearted, endearing romance that will captivate and charm her legions of readers.”—Jayne Ann Krentz#1 New York Times bestselling author Debbie Macomber—winner of numerous accolades and honors, including the Romance Writers of America’s Nora Roberts Lifetime Achievement Award—writes romance novels that warm the heart and lift the spirit like none other. In Touched by Angels, the beloved author of Mrs. Miracle showcases three of her most popular characters: the well-meaning if somewhat dizzy heavenly helpers, Shirley, Goodness, and Mercy. Macomber’s delightful angelic trio alights in New York City in Touched by Angels, and before they re-enter the Pearly Gates, they need to answer the prayers of a troubled school teacher, a shy and lonely young woman, and a wannabe Broadway actress a long way from home.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2011"
        }
    },
    {
        "Title": "When Your Baby Dies: Through Miscarriage or Stillbirth (Hope and Healing Series)",
        "Authors": "By Gamino, Louis A. and Cooney, Ann T.",
        "Description": "",
        "Category": " Self-help , Death, Grief, Bereavement",
        "Publisher": "Augsburg Fortress Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Youngest Science: Notes of a Medicine-Watcher",
        "Authors": "By Thomas, Lewis",
        "Description": "The eminent physician-essayist combines an account of his life as a physician, researcher, and administrator with meditations on the practice and promise of medicine",
        "Category": " Medical , Physicians",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "Box Socials: A Novel",
        "Authors": "By Kinsella, W. P.",
        "Description": "“A whimsical portrait of 1940s-era small-town life, crowded with everything from owl-calling contests to raucous, five-day Ukrainian weddings. It's a delightful comic ramble, written in quirky, digressive style. . . . Richly textured.”—Los Angeles TimesHere's the story of how Truckbox Al McClintock, a small-town greaser whose claim to fame was hitting a baseball clean across the Pembina River, almost got a tryout with the genuine St. Louis Cardinals—but instead ended up batting against Bob Feller of Cleveland Indian Fame in Renfrew Park, Edmonton, Alberta. Along the way to Al's moment of truth at the plate, we learn about the bizarre, touchingly hilarious lives and loves of just about anyone who ever passed through New Oslo, Fark, or Venusberg.Full of the crackle of down-home folk tales, by turn randy, riveting, and heart-breaking, Box Socials is the triumph of Kinsella's career.Praise for Box Socials“Wonderful . . . Charming and funny . . . If you've never been to a box social, go to this one.”—Fannie Flagg, The New York Times Book Review“A sweeping comic work . . . Welcome to the seductively poetic fictional world of W.P. Kinsella.”—People“A story filled with nostalgia about a time when the game was played on real grass and was called on account of darkness. . . . A down-home style that resembles the humorous voice of Garrison Keillor.”—The New York Times",
        "Category": " Fiction , Sports",
        "Publisher": "Random House Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Very Old Bones (Contemporary American Fiction)",
        "Authors": "By Kennedy, William",
        "Description": "For William Kennedy fans, Albany conjures up a tapestry of great beauty and complexity in which the lives of an Irish American family are woven. Earlier Albany novels, including Ironweed, a Pulitzer Prize-winner, whetted our appetites. Now Very Old Bones treats us to one last look at the odd and turbulent Phelans, circa 1958. Stretching the boundaries of life as the Phelans know it, this powerful work flows back and forth in time, riding on the melody of its language. Its great theme is the promise of redemption for those who seek it.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "The Prostate: A Guide for Men and the Women Who Love Them (A Johns Hopkins Press Health Book)",
        "Authors": "By Walsh, Patrick C. and Worthington, Janet Farrar",
        "Description": "Discusses risk factors for prostate cancer, explains how it is diagnosed and treated, and discusses other prostate disorders",
        "Category": " Health & Fitness , Men's Health",
        "Publisher": "Johns Hopkins University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Where Does a Mother Go to Resign?",
        "Authors": "By Johnson, Barbara E.",
        "Description": "The author recounts how faith enabled her to face her husband's injury in an automobile accident, the deaths of two sons, and the discovery that her third son was homosexual",
        "Category": "",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Discover Zen: A Practical Guide to Personal Serenity",
        "Authors": "By Fontana, David",
        "Description": "The latest title in our highly successful mind, body and spirit series, Discover Zen is a beautifully illustrated and inspiring guide to this ancient Asian philosophy. The straightforward text and over 30 step-by-step exercises guide the reader thorough classic Zen practices, such as meditation and understanding koans (puzzling parables) as well as sensuous rituals like creating a Zen rock garden, writing haiku poetry, or performing a tea ceremony. Delicate illustrations and quotations from the great Zen masters encourage contemplation. Although it is a movement of Buddhism, Zen principles are complementary to any system of belief. Zen techniques offer a respite from the stress of daily life, provide a healthy outlet for emotions, and promote spiritual growth and understanding. By teaching us to live in the moment, Zen infuses serenity into every aspect of life.",
        "Category": " Self-help , Meditations",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The Dick Cheney Code: A Parody",
        "Authors": "By Beard, Henry",
        "Description": "A bestselling, Harvard-bred humorist plans to knock out a slapdash, quick-buck parody of a wildly successful, head-spinning, clue-laden thriller in a flagrant attempt to cash in on the publishing sensation of the decade, but the tousle-haired satirist's sleazy scheme goes awry when his two heroes -- beautiful, brilliant Sandra Damsel and brawny, brainy Professor William Franklin -- stumble on an explosive and frankly preposterous centuries-old secret that plunges them into a puzzle-packed, plot-crammed, prose-swollen Washington intrigue whose flabbergasting finale will determine the outcome of the 2004 presidential election.  Cryptic praise for The Dick Cheney Code  \"1, 1!\" (highest rating) -- The Fibonacci Report  \"Hysterical! Lacey shirt!\" -- Anagram Monthly  \"I laughed so hard I xxxxxx in my pants!\" -- Redacter's Digest  \"I bend over double! I hold my sides! I tickle my ribs! I slap my thighs!\" -- Mime Magazine  \"Three syllables, sounds like: Upper arm? Broken arm? Broken bone? Radius? Humerus? HUMOROUS!\" -- Charade Magazine  \"Too funny for words!\" (9 letters, starting with P, ending in S) -- Acrostic Review",
        "Category": " Humor , Topic , Political",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Field & Stream The Complete Hunter",
        "Authors": "By Robinson, Jerome B., Field & Stream (EDT), Painter, Doug, Bourjaily, Phil, Tarrant, William, and McIntyre, Thomas",
        "Description": "The Field & Stream: The Complete Hunter is a book intended for hunters with any level of experience. The editors and writers of America's most popular outdoor magazine bring their experience to this book. The Complete Hunter covers the topics hunters want to know about most, including: the best way to hunt white-tailed deer; how to choose bowhunting gear that's right for you; care and safety for your firearm; how to hunt turkeys, including Eastern, Rio Grande, and Osceola birds; the best methods for hunting pheasants, grouse, doves, quail, and other upland birds; and, how to hit your mark in all shooting sports, including trap, skeet, and sporting clays. Whether you're picking up a bow and arrow for the first time, or a seasoned hunter looking to refresh your skills, you'll find it all in The Complete Hunter. In addition there are photographs and illustrations throughout the book that make learning and improving as easy as possible.",
        "Category": " Sports & Recreation , Hunting",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "6.85",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Water, Carry Me",
        "Authors": "By Moran, Thomas",
        "Description": "In the story of a young woman's betrayal, set against the beauty and violence of a divided Ireland, Una Moss, a medical student orphaned as a little girl and raised in a small village by her grandfather, finds herself ill-prepared for the harsh realities of romance, until Aiden Ferrel arrives to change her life forever. Reprint.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Riverhead Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "May It Please the Court: The Most Significant Oral Arguments Made Before the Supreme Court Since 1955",
        "Authors": "By Irons, Peter H. and Guitton, Stephanie (EDT)",
        "Description": "Until The New Press first published May It Please the Court in 1993, few Americans knew that every case argued before the Supreme Court since 1955 had been recorded. The original book-and-tape set was a revelation to readers and reviewers, quickly becoming a bestseller and garnering praise across the nation.May It Please the Court includes both live recordings and transcripts of oral arguments in twenty-three of the most significant cases argued before the Supreme Court in the second half of the twentiethcentury. This edition makes the recordings available on an MP3 audio CD. Through the voices of some of the nation’s most important lawyers and justices, including Thurgood Marshall, Archibald Cox, and Earl Warren, it offers a chance to hear firsthand our justice system at work, in the highest court of the land.Cases included: Gideon v. Wainwright (right to counsel) Abington School District v. Schempp (school prayer)Miranda v. Arizona (“the right to remain silent”) Roe v. Wade (abortion rights)Edwards v. Aguillard (teaching “creationism”) Regents v. Bakke (reverse discrimination)Wisconsin v. Yoder (compulsory schooling for the Amish) Tinker v. Des Moines (Vietnam protest in schools)Texas v. Johnson (flag burning) New York Times v. United States (Pentagon Papers)Cox v. Louisiana (civil rights demonstrations) Communist Party v. Subversive Activities Control Board (freedom of association)Terry v. Ohio (“stop and frisk” by police) Gregg v. Georgia (capital punishment)Cooper v. Aaron (Little Rock school desegregation) Heart of Atlanta Motel v. United States (public accommodations)Palmer v. Thompson (swimming pool integration) Loving v. Virginia (interracial marriage)San Antonio v. Rodriguez (equal funding for public schools) Bowers v. Hardwick (homosexual rights)Baker v. Carr (“one person, one vote”) United States v. Nixon (Watergate tapes)DeShaney v. Winnebago County (child abuse)",
        "Category": " Law , Legal History",
        "Publisher": "The New Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Gray's Fish Cookbook: A Menu Cookbook",
        "Authors": "By Gray, Rebecca",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Seafood",
        "Publisher": "Gsj Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Dog People: Writers and Artists on Canine Companionship",
        "Authors": "By Rosen, Michael J. (EDT), Butler, Amy (ILT), and Butler, David (ILT)",
        "Description": "As Edward Albee puts it in this timeless collection of pieces about dogs, there are \"those of us who feel incomplete withoutt the company of a dog or two.\" Those same people will feel incomplete without this book, now in paperback. Along with portraits of dogs are ruminations by such dog-devoted authors as Anne Beattie, Nancy Friday, and Jane Smiley. Daniel Pinkwater describes the joys of strolling with his ever-willing-to-walk dog and Danny Shanahan explains \"how to read your dog,\" complete with sketches. These, together with the work of forty artists, including William Wegman's photographs of famous Fay and Jamie Wyeth's dog paintings, give voice and image to the powerful, undiluted emotions that human beings experience when dogs are among them.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Artisan",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Mom Economy: The Mothers's Guide to Getting Family-Friendly Work",
        "Authors": "By Wilcox, Elizabeth and Berger, Elizabeth, M.D. (FRW)",
        "Description": "The Mom Economy offers hands-on exercises; guidance from career counselors, psychologists, and human resource professionals; and valuable advice from more than 100 working mothers with family-friendly employment, in an indispensable guide that can help women:  ? Know what they must earn ? Understand how employer-sponsored benefits may help ? Evaluate employers ? Negotiate for flextime, part-time, or telecommuting ? Establish a network ? and more  A large majority of women work today-but in many cases, it's still up to them to negotiate terms of employment that suit their lifestyles and allow them to meet their kid's needs. This practical volume helps moms get what they need most from the workplace-and find the work that works for them.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Moments of Truth",
        "Authors": "By Carlzon, Jan and Peters, Tom (FRW)",
        "Description": "The president and CEO of Scandinavia Airlines details how to restructure an organization so that customer needs take priority, how to best utilize employees who deal directly with customers, and how to increase employee motivation",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Free Legal Help",
        "Authors": "By Lesko, Matthew and Naprawa, Andrew",
        "Description": "",
        "Category": " Law , Legal Services",
        "Publisher": "Information USA, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Bred Any Good Rooks",
        "Authors": "By Charlton, James",
        "Description": "Collects puns, shaggy dogs, spoonerisms, and malappopriate stories by such distinguished writers as Stephen King, Peter Straub, Roy Blount, Jr., Isaac Asimov, John D. MacDonald, Willard Espy, and Annie Dillard",
        "Category": "",
        "Publisher": "Main Street Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    }
]