[
    {
        "Title": "Discipleship : Living for Christ in the Daily Grind",
        "Authors": "By Arnold, Heini and Arnold, J. Heinrich",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Plough Pub House",
        "Price Starting With ($)": "5.46",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Meet Diego! (DORA THE EXPLORER)",
        "Authors": "By Valdes, Leslie and Hall, Susan T. (ILT)",
        "Description": "Meet Diego, Dora's cool cousin! Diego can talk to animals, and he rescues them when they're in danger. But when Baby Jaguar cries for help, can Diego get to him before he plunges into the waterfall? Find out in this exciting adventure!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Together Forever",
        "Authors": "By Richfield, Lew and Richfield, Gloria",
        "Description": "Have you ever looked at a happily married couple and wished they could tell you the secret to their success? Drs. Lew and Gloria Richfield are marriage and family therapists who have been married to each other for almost fifty years, and this book presents their professional and personal secrets to a lasting and fulfilling marriage.Together Forever! was written for the millions of men and women who want to keep their marriages vital for their lifetimes. Written simply and to the point, Together Forever! covers the multitude of interactions couples face daily, such as:*       talking about feelings*       making decisions*       coping with personality differences*       fighting*       keeping romance and sex aliveThe Richfields present 125 keys to a good marriage--sound psychological principles distilled through years of experience into practical, realistic advice. These keys give couples the tools they need to get through the inevitable rough spots, enabling them to feel stronger in their marriages and united in the joy a lasting marriage brings.",
        "Category": " Family & Relationships , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "American Heritage Dictionary: Third Edition",
        "Authors": "By Houghton Mifflin Company",
        "Description": "The latest edition of a perennial best-seller offers more information, more new words, and more illustrations than ever before, along with guidance on correct usage, useful examples, clear definitions, and much more. Reprint.",
        "Category": "",
        "Publisher": "Delta",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "The Grace Awakening (Swindoll Bible Study Guide)",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Insight for Living",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Who's in Charge? a Positive Parenting Approach to Disciplining Children",
        "Authors": "By Peters, Ruth A.",
        "Description": "",
        "Category": " Self-help , General",
        "Publisher": "Lindsay Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "China Cry: The Nora Lam Story",
        "Authors": "By Lam, Nora and Schneider, Richard H.",
        "Description": "Tells the true story of the love, courage, and struggles of one woman, Nora Lam, whose Christian faith led her to make the ultimate choice between life and death",
        "Category": " Religion , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Showers in Season (Seasons Series #2)",
        "Authors": "By Blackstock, Terri and Lahaye, Beverly",
        "Description": "A sequel to  Seasons Under Heaven  rejoins the denizens of Cedar Circle, a cul-de-sac full of life's dramas, as the Sullivan's cope with the upcoming birth of a Down Syndrome child, the Dodds recover from their son's illness, and much more.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Simply Handmade: Gifts to Make (365 Beautifully Easy Ideas)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Better Homes and Gardens Books",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Devil in Love",
        "Authors": "By Barbara Cartland",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Bar Cookies A to Z",
        "Authors": "By Simmons, Marie and Anderson, Susan Marie (PHT)",
        "Description": "In this tempting collection, Marie Simmons brings together 50 recipes for North America's favorite kind of cookie-each one inventive enough for the most daring baker, yet simple enough to ensure the beginner perfect results. The most comprehensive book of bar cookie available, it includes all the traditional offerings, like brownies, hermits, fig bars, peanut-butter-chocolate bars and jam bars as well as delightfully sophisticated treats like: --Lemon Love Notes --Chocolate-Frosted Chocolate Espresso Bars --Toffee-Fudge Crunch Bars --White & Bittersweet Chocolate Chunk Bars",
        "Category": " Cooking , Courses & Dishes , Cookies",
        "Publisher": "Chapters Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Social Work Treatment 4th Edition",
        "Authors": "By Turner, Francis Joseph (EDT)",
        "Description": "Written by leading practitioners and educators in the field, Social Work Treatment: Interlocking Theoretical Approaches, Fourth Edition is the standard text on theories of social work and a trusted reference book for social work practitioners. In this updated edition, Francis Turner introduces exciting new theoretical systems that have gained importance since the 1980s, including Aboriginal theory, Narrative, Hypnosis, Constructivism, and Empowerment theory. Twenty chapters from the previous edition have been completely revised and expanded, to reflect the influence of new ideas and clinical experience in social work practice. An exceptionally strong group of distinguished contributors to past editions and writers new to this volume together examine the full range of therapeutic approaches - including psychoanalysis, ego psychology, cognitive, crisis intervention, client-centered theory, feminist theory, meditation, transactional analysis, systems theory, task-centered social work, and neurolinguistics.Social Work Treatment makes the range of theories upon which current practice is built fully available, providing professionals with ready access to the theoretical diversity and richness that is the mark of contemporary social work practice. It enables social work students at all levels - bachelor, masters and doctoral - to learn and integrate ongoing theoretical developments in the field, which ultimately ensures a client's optimum service.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Private Patient",
        "Authors": "By James, P. D.",
        "Description": "Cheverell Manor is a lovely old house in deepest Dorset, now a private clinic belonging to the famous plastic surgeon George Chandler-Powell. When investigative journalist Rhoda Gradwyn arrived there one late autumn afternoon, scheduled to have a disfiguring and long-standing facial scar removed, she had every expectation of a successful operation and a pleasant week recuperating.Two days later she was dead, the victim of murder.To Commander Adam Dalgliesh, who with his team is called in to investigate the case, the mystery at first seems absolute. Few things about it make sense. Yet as the detectives begin probing the lives and backgrounds of those connected with the dead woman—the surgeon, members of the manor staff, close acquaintances—suspects multiply all too rapidly. New confusions arise, including strange historical overtones of madness and a lynching 350 years in the past. Then there is a second murder, and Dalgliesh finds himself confronted by issues even more challenging than innocence or guilt.P. D. James has gained an enviable reputation for creating detective stories of uncommon depth and intricacy, combined with the sort of humanity and perceptiveness found only in the finest novelists. The Private Patient ranks among her very best.",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Garden of Shadows (Dollanganger, No. 5)",
        "Authors": "By V. C. Andrews",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Fable II Signature Series Guide",
        "Authors": "By Walsh, Doug",
        "Description": "Good or Evil?     Answer the Call! Change the World!  Jump into a world where decisions have repercussions and your choices change the world. Save the innocents or kill them? Deliver the expensive weapon or keep it for yourself? These things matter and your choices will reshape the future of Albion!     Albion Atlas  Towns, Tombs, Caves, and Countrysides: Albion is filled with plenty of places for a Hero to relax, cavort, fight, and thrive, but there’s more to living than combat. Each town has its own economy and real estate. Complete listings of available Jobs and Pub Games in the region.     Every Hidden Item  Discover all the Gargoyles, Dig Spots, Dive Spots, Demon Doors, and Chests! They’re all clearly marked in the Atlas!     Complete Quest Guide  All Quests: An abundance of quests awaits your Hero’s attention and they’re all covered in detail. The strategy provided offers the best tips and tricks to finish every quest to your satisfaction and even indicates when a quest may not of interest to your Hero.     Good vs. Evil  Fable II allows you to choose your own path through the world. Our walkthrough provides a complete breakdown explaining the ramifications of your choices and how to follow the course you’ve selected.     Exclusive Foldout  More than a normal poster, this provides a complete list of all the Achievements that Fable II has to offer and how to get them. This isn’t just some listing! Strategy is provided for every Achievement!     And Much More!    “Happily Ever After” Diary  Item and Weapon Lists  Developer Tips  Expert Boss Strategy  Platform: Xbox 360Genre: Role-Playing Game",
        "Category": " Games , Video & Electronic",
        "Publisher": "BRADY GAMES",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Halo 3: The Official Strategy Guide",
        "Authors": "By Piggyback",
        "Description": "·Detailed annotated maps for all levels·Learn how to dominate multiplayer matches with information on weapon locations and expert tips·Learn about every enemy, vehicle and weapon — their strengths and weaknesses and how you can exploit them·Confidently navigate the huge Campaign mode with our exclusive maps and step-by-step walkthrough·Complete list of all Achievements and how to unlock each onePacked with tips, tactics and techniques direct from Bungie",
        "Category": " Games , Video & Electronic",
        "Publisher": "Prima Games",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Vagabond of Space (Perry Rhodan #93)",
        "Authors": "By Clark Darlton",
        "Description": "",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "7.55",
        "Publish Date": {
            "Month": "April",
            "Year": "1976"
        }
    },
    {
        "Title": "Hot Gimmick, Vol. 7",
        "Authors": "By Aihara, Miki, Rolf, Pookie, and Aihara, Miki (ILT)",
        "Description": "In company-owned rabbit-hutch apartments live tenants who can't afford to live anywhere else, and the apartment complex in which high-school girl Hatsumi Narita lives is ruled over by the rumour mongering, self-righteous Mrs. Tachibana. Get on Tachibana's bad side, and life becomes hell. When Hatsumi has to buy a pregnancy test because her popular sister Akane is late, Mrs. Tachibana's son, Ryoki, who used to bully Hatsumi as a kid, promises not to tell the world about Hatsumi's secret, only if she becomes his slave. Suddenly Azusa, Hatsumi's protector in their youth, reappears to save her again! He's moving back into the neighbourhood! Despite the budding romance between Hatsumi and Azusa, Ryoki has control over her through the secret that could ruin the lives of everyone in Hatsumi's family, and he hasn't forgotten who his slave is!   But she says he's just a friend...Well that's not how Ryoki feels. His New Year's fete with our hapless heroine Hatsumi didn't go according to plan, so childhood bully/potential boyfriend Ryoki hightails it back home in a huff. Luckily, Hatsumi's heavenly older brother Shinogu is there to give her a lift back to civilization. A botched burglary at the Narita household leaves Hatsumi panicky and, in an act that goes way against character, Ryoki lends her a hand, but their affections do not go unseen. Will Hatsumi and Ryoki's feelings be able to survive the harsh scrutiny of company-housing life?",
        "Category": " Comics & Graphic Novels , Manga , General",
        "Publisher": "VIZ Media LLC",
        "Price Starting With ($)": "5.03",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Self-Esteem: A Proven Program of Cognitive Techniques for Assessing, Improving, and Maintaining Your Self-Esteem",
        "Authors": "By McKay, Matthew, Fanning, Patrick",
        "Description": "",
        "Category": "",
        "Publisher": "New Harbinger Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "The Shield of Achilles: War, Peace, and the Course of History",
        "Authors": "By Bobbitt, Philip",
        "Description": "\"We are at a moment in world affairs when the essential ideas that govern statecraft must change. For five centuries it has taken the resources of a state to destroy another state . . . This is no longer true, owing to advances in international telecommunications, rapid computation, and weapons of mass destruction. The change in statecraft that will accompany these developments will be as profound as any that the State has thus far undergone.\"—from the PrologueThe Shield of Achilles is a classic inquiry into the nature of the State, its origin in war, and its drive for peace and legitimacy. Philip Bobbitt, a professor of constitutional law and a historian of nuclear strategy, has served in the White House, the Senate, the State Department, and the National Security Council in both Democratic and Republican administrations, and here he brings his formidable experience and analytical gifts to bear on our changing world. Many have observed that the nation-state is dying, yet others have noted that the power of the State has never been greater. Bobbitt reconciles this paradox and introduces the idea of the market-state, which is already replacing its predecessor. Along the way he treats such themes as the Long War (which began in 1914 and ended in 1990). He explains the relation of violence to legitimacy, and the role of key individuals in fates that are partially—but only partially—determined.This book anticipates the coalitional war against terrorism and lays out alternative futures for the world. Bobbitt shows how nations might avoid the great power confrontations that have a potential for limitless destruction, and he traces the origin and evolution of the State to such wars and the peace conferences that forged their outcomes into law, from Augsburg to Westphalia to Utrecht to Vienna to Versailles.The author paints a powerful portrait of the ever-changing interrelatedness of our world, and he uses his expertise in law and strategy to discern the paths that statehood will follow in the coming years and decades. Timely and perceptive, The Shield of Achilles will change the way we think about the world.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Knopf",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Lost in a Good Book (A Thursday Next Novel)",
        "Authors": "By Fforde, Jasper",
        "Description": "The second installment in Jasper Fforde’s New York Times bestselling series follows literary detective Thursday Next on another adventure in her alternate reality of literature-obsessed England—from the author of Early RiserThe inventive, exuberant, and totally original literary fun that began with The Eyre Affair continues with New York Times bestselling author Jasper Fforde’s magnificent second adventure starring the resourceful, fearless literary sleuth Thursday Next. When Landen, the love of her life, is eradicated by the corrupt multinational Goliath Corporation, Thursday must moonlight as a Prose Resource Operative of Jurisfiction—the police force inside the BookWorld. She is apprenticed to the man-hating Miss Havisham from Dickens’s Great Expectations, who grudgingly shows Thursday the ropes. And she gains just enough skill to get herself in a real mess entering the pages of Poe’s “The Raven.” What she really wants is to get Landen back. But this latest mission is not without further complications. Along with jumping into the works of Kafka and Austen, and even Beatrix Potter’s The Tale of the Flopsy Bunnies, Thursday finds herself the target of a series of potentially lethal coincidences, the authenticator of a newly discovered play by the Bard himself, and the only one who can prevent an unidentifiable pink sludge from engulfing all life on Earth. It’s another genre-bending blend of crime fiction, fantasy, and top-drawer literary entertainment for fans of Douglas Adams and P. G. Wodehouse. Thursday’s zany investigations continue with The Well of Lost Plots.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "One Way 2 Play!",
        "Authors": "By Shealy, Dal and Springle, Pat",
        "Description": "",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "When No Gets You Nowhere: Teaching Your Toddler and Child Self-Control",
        "Authors": "By Brenner, Mark L.",
        "Description": "",
        "Category": " Family & Relationships , Life Stages , Infants & Toddlers",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Italian Step-by-Step",
        "Authors": "By Berlitz, Charles",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Wynwood",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "New Moon (The Twilight Saga)",
        "Authors": "By Meyer, Stephenie",
        "Description": "With 160 million copies of the Twilight Saga sold worldwide, this addictive love story between a teenage girl and a vampire redefined romance for a generation. For readers hungry for more, here is book two. p.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Helvetica} p.p2 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Helvetica; min-height: 13.0px} span.s1 {font-kerning: none} For Bella Swan, there is one thing more important than life itself: Edward Cullen. But being in love with a vampire is even more dangerous than Bella could ever have imagined. Edward has already rescued Bella from the clutches of one evil vampire, but now, as their daring relationship threatens all that is near and dear to them, they realize their troubles may be just beginning.Bella and Edward face a devastating separation, the mysterious appearance of dangerous wolves roaming the forest in Forks, a terrifying threat of revenge from a female vampire and a deliciously sinister encounter with Italy's reigning royal family of vampires, the Volturi.Passionate, riveting, and full of surprising twists and turns, this vampire love saga is well on its way to literary immortality.\"People do not want to just read Meyer's books; they want to climb inside them and live there.\"-Time\"A literary phenomenon.\"-The New York Times",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Little Brown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Building Quality Software",
        "Authors": "By Glass, Robert L.",
        "Description": "This book gets at the essence of software quality based on the  premise that quality is at heart a technical problem, and that  management's job is to create a facilitating environment. It fully  explains the quality techniques available to the dedicated  technologist, the ways that management can facilitate quality, and  offers case studies. For software programmers and managers. KEY  FEATURES: • features case studies of how companies and  governments have met the challenges of building quality software.  • includes a recommendations section, in which the whole of the  book is distilled into a set of project-dependent quality approach  recommendations.",
        "Category": " Computers , Software Development & Engineering , General",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Give Your ADD Teen a Chance: A Guide for Parents of Teenagers With Attention Deficit Disorder",
        "Authors": "By Weiss, Lynn",
        "Description": "Expert help for parents of ADD teens. Determine which issues are caused by “normal” teenage development and which are caused by ADD. This book examines the academic challenges ADD teens face, offering tips for  success at school and guidelines for discipline, guidance, and responsibility.",
        "Category": " Family & Relationships , Life Stages , Teenagers",
        "Publisher": "Navpress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Prayer: A Holy Occupation (OSWALD CHAMBERS LIBRARY)",
        "Authors": "By Chambers, Oswald",
        "Description": "&#147;You ask and do not receive, because you ask with wrong motives” (James 4:3).  What might the right motives be? In Prayer: A Holy Occupation Oswald Chambers shares his heart’s desires in prayer to help you: know Jesus better, to discern His will, and to make Christ’s will your own.  This is not merely a &#147;pray harder” book, but editor Julie Ackerman Link has carefully selected a collection of Oswald Chamber’s insights to enrich your prayer life. As the author of the all-time bestselling devotional, My Utmost for His Highest, Chambers brings you a treasure-trove of wisdom and insight.",
        "Category": " Religion , Prayer",
        "Publisher": "Discovery House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Consultant's Guide to Proposal Writing: How to Satisfy Your Client and Double Your Income",
        "Authors": "By Holtz, Herman",
        "Description": "From Herman Holtz, America's foremost expert on consulting, here's a complete guide to marketing your consulting services The Consultant's Guide to Proposal Writing Second Edition This updated edition has answers to all the questions that arise during the process of developing a proposal--where to begin, how it should look, what to include, and what to leave out. It emphasizes practical, \"how-to\" advice on.* How to sell to the biggest customer of all, the government (see page 275)* How to avoid some common errors in proposals (see page 22)* Do you have to be the low bidder? (see page 131 for some surprising answers)* How to safeguard your proposal against piracy (see page 113)* Why clients want proposals, and what they look for in a proposal (see page 117)* How to solve proposal production problems (see page 254)* How other consultants devise winning strategies (see page 40)* How to copyright your proposal--instantly and at no cost (see page 113)* How to develop cost strategies (see page 43), technical strategies (see page 118), presentation strategies (see page 186), and competitor strategies (see page 193)* How to find the keys to creativity (see page 138)* How to solve the problem of page-limited proposals (see page 257)* How to produce graphics at virtually no cost (see page 211)* How to make the bid/no-bid analysis and decision (see page 90)",
        "Category": " Business & Economics , Consulting",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Three to Get Deadly (Stephanie Plum, No. 3) (Stephanie Plum Novels)",
        "Authors": "By Evanovich, Janet",
        "Description": "Janet Evanovich's Stephanie Plum Novels Are\"Suspenseful.\"---Los Angeles Times\"Terrific.\"---San Francisco Chronicle\"Irresistible.\"---Kirkus Reviews\"Thrilling.\"---The Midwest Book Review\"Hilariously Funny.\"---USA Today\"A blast of fresh air.\"---The Washington Post\"Inventive and fast-paced.\"---The San Diego Union-Tribune\"Superb.\"---Detroit Free PressIn Three to Get Deadly, a \"saintly\" old candy store owner is on the lam---and bounty hunter extraordinaire Stephanie Plum is on the case. As the body count rises, Stephanie finds herself dealing with dead drug dealers and slippery fugitives on the chase of her life. And with the help of eccentric friends and family, Steph must see to it that this case doesn't end up being her last. . . .",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Engaging The Enemy",
        "Authors": "By Roberts, Nora",
        "Description": "The New York Times best-selling author presents two full-length novels of desire and destiny in one volume, including A Will and a Way, in which Pandora McVie is forced live with her adversary, and co-beneficiary, Michael Donohue to fulfill her uncle's last wishes. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Love, From the Fifth Grade Celebrity (Casey, Tracey, & Company)",
        "Authors": "By Giff, Patricia Reilly",
        "Description": "Casey, Tracy, and their companions come face-to-face with the feeling and understandings of fifth-grade jealousies and fears, in a humorous story by the creator of the Polk Street School series. Reissue.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Managing Your Money (3rd Edition)",
        "Authors": "By Heady, Robert K.",
        "Description": "Offers advice on creating a long-term financial plan, shopping for insurance and mortgages, managing credit card debt, and establishing a good credit rating.",
        "Category": " Business & Economics , Personal Finance , Money Management",
        "Publisher": "Alpha",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Like Dandelion Dust",
        "Authors": "By Kingsbury, Karen",
        "Description": "Enjoying an idyllic life with their adopted four-year-old son Joey in a small town outside Atlanta, Jack and Molly Campbell are stunned when Joey's biological father, recently released from prison, demands the return of his son, forcing the grieving Campbells into a potentially desperate situation. Reader's Guide included. Original. 100,000 first printing.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Center Street",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "NIV Mens Devotional Bible, Compact",
        "Authors": "By Zondervan",
        "Description": "Whether you&apos;re a father, grandfather, single, or married, the NIV Men&apos;s Devotional Bible is written for you. It will encourage your personal relationship with God and increase your understanding of how he works in your life. Each weekday you read a brief devotional message together with a nearby Scripture passage. On the weekend, you&apos;ll find 'Weekending,' which combines a short, reflective devotion with Scripture readings for Saturday and Sunday. The NIV Men&apos;s Devotional Bible contains 52 weeks of devotions -- an entire year that will challenge you, deepen your understanding of God, and help you serve him more faithfully. The NIV Men&apos;s Devotional Bible draws on the rich insights of over 100 contributors from all ages and walks of life. You&apos;ll sit down with such classic writers as Deitrich Bonhoeffer, C.S. Lewis and A.W. Tozer. And you&apos;ll savor the contemporary insight of Charles Colson, James Dobson, Chuck Swindoll, Ben Carson, Dave Dravecky, Charles Stanley, Bill Hybels, Tom Landry, and Phillip Yancey. Day by day, they&apos;ll help you see what it means to be a man of God today. The topics are as broad as the issues facing godly men today. Commitment. Anger. Disappointment. Fatherhood. Friendship. Money. Stress. Integrity. Servanthood. Work. Worship the NIV Men&apos;s Devotional Bible prepares you to live as a man of courage and vision. The NIV Men&apos;s Devotional Bible prepares you to live as a man of courage and vision. The NIV Men&apos;s Devotional Bible features the complete text of the New International Version, today&apos;s most popular modern translation, known for its accuracy and readability. The NIV Men&apos;s Devotional Bible -- a Bible for, by, and about today&apos;s man. A Bible for you.",
        "Category": " Bibles , New International Version , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "100.98",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Parenting the Strong-Willed Child: The Clinically Proven Five-Week Program for Parents of Two- to Six-Year-Olds [Revised and Updated Edition]",
        "Authors": "By Forehand, Rex L. and Long, Nicholas James",
        "Description": "The bestselling five-week program to improving the disruptive child's behavior--now updated and revisedBased on more than 40 years of collective research, parents and longtime child behavior experts Dr. Rex Forehand and Dr. Nicholas Long have devised a program to help you find positive and manageable solutions to your child's difficult behavior. Now in a revised and updated edition, Parenting the Strong-Willed Child  is a self-guided program for managing disruptive young children based on a clinical treatment program.This hands-on guide provides you with a step-by-step, five-week program toward improving your child's behavior as well as the entire family's relationship. Providing you with the necessary tools for successfully managing the difficult child, the book covers specific factors that cause or contribute to a child's disruptive behavior; ways to develop a more positive atmosphere in your family and home; actual reports by parents of difficult children; strategies for managing specific behavior problems; how to tell if your child might have ADHD; and more.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "National Audubon Society Pocket Guide to Familiar Reptiles and Amphibians (National Audubon Society Pocket Guides)",
        "Authors": "By Behler, John",
        "Description": "A portable, comprehensive field guide--brimming with concise descriptions and stunning color photographs, and designed to fit into your back pocket--from the go-to reference source for over 18 million nature lovers.This streamlined volume contains an easy-to-use field guide identifying the most frequently encountered reptiles and amphibians in North America. Packed with information, it includes detailed photographs and diagrams, specific descriptions of each species' traits, and a glossary of terms. Whether your home is in a remote countryside or in a populous city, you will derive hours of pleasure observing and learning about all aspects of our cold-blooded brethren. The National Audubon Society Pocket Guide to Familiar Reptiles and Amphibians is an excellent and convenient reference guide to accompany any lizard-lover.",
        "Category": " Nature , Animals , Reptiles & Amphibians",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Free and Clear: God's Roadmap to Debt-Free Living",
        "Authors": "By Dayton, Howard",
        "Description": "Overwhelmed with debt? There is hope and freedom for you no matter how  big your problem. Skyrocketing debt has crippled and divided millions in this age  of rampant credit, interest-only mortgages, and record loan defaults. The way out  from under debt burdens is not a declaration of bankruptcy, but surrender to the  Word of God. Becoming debt-free may seem an impossible dream for many, but it is  actually an attainable goal according to Howard Dayton, cofounder of Crown Financial  Ministries. He overcame his own struggle with debt by applying God's principles  to managing his finances, principles he lays out in this practical, encouraging,  never-give-up book.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Jacob's Ladder: A Story of Virginia During the Civil War",
        "Authors": "By McCaig, Donald",
        "Description": "Follows the fates of Duncan Gatewood--heir to a southern plantation, and Maggie--a mulatto slave, from their forbidden love in antebellum Virginia through the years of the Civil War.",
        "Category": " Fiction , Historical",
        "Publisher": "Macmillan Audio",
        "Price Starting With ($)": "14.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Lessons from the Nordstrom Way: How Companies are Emulating the #1 Customer Service Company",
        "Authors": "By Spector, Robert",
        "Description": "Praise for Lessons from the Nordstrom Wa \"Lessons from the Nordstrom Way is a blueprint for providing superior customer service. There are lessons here for people in every industry.\" ?Barry Sternlicht, Chairman and CEO, Starwood Hotels & Resorts Worldwide, Inc \"Robert Spector?s book is chock-full of insights on how you can give great customer service?no matter what business you?re in. This stuff makes sense. You?ll read it and immediately ask yourself,?now why did I never think of that??\"?Roy H. Williams, bestselling author of The Wizard of Ad \"At Continental, we learned that you must trust your people to do a good job. Robert Spector shows that entrusting and empowering your employees are essential ingredients for a corporate culture of great customer service.\"?Gordon Bethune, Chairman and CEO, Continental Airline",
        "Category": " Business & Economics , Customer Relations",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Quick and Easy Way to Getting Thin & Healthy",
        "Authors": "By Colton, Katherine",
        "Description": "",
        "Category": "",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Household Hints and Tips",
        "Authors": "By Kent, Cassandra",
        "Description": "Provides more than two thousand ingenious and practical solutions to problems around the home, offering detailed instructions, valuable information, and hundreds of illustrations covering home maintenance, security, repair, cleaning, and much more.",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Dk Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "On Writing Well: An Informal Guide to Writing Nonfiction (Revised)",
        "Authors": "By Zinsser, William Knowlton",
        "Description": "Describes the principles for writing good nonfiction and discusses the development of individuality and confidence",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Darwin's Black Box: The Biochemical Challenge to Evolution",
        "Authors": "By Behe, Michael J.",
        "Description": "Virtually all serious scientists accept the truth of Darwin's theory of evolution. While the fight for its acceptance has been a long and difficult one, after a century of struggle among the cognoscenti the battle is over. Biologists are now confident that their remaining questions, such as how life on Earth began, or how the Cambrian explosion could have produced so many new species in such a short time, will be found to have Darwinian answers. They, like most of the rest of us, accept Darwin's theory to be true.  But should we? What would happen if we found something that radically challenged the now-accepted wisdom? In Darwin's Black Box, Michael Behe argues that evidence of evolution's limits has been right under our noses -- but it is so small that we have only recently been able to see it. The field of biochemistry, begun when Watson and Crick discovered the double-helical shape of DNA, has unlocked the secrets of the cell. There, biochemists have unexpectedly discovered a world of Lilliputian complexity. As Belie engagingly demonstrates, using the examples of vision, bloodclotting, cellular transport, and more, the biochemical world comprises an arsenal of chemical machines, made up of finely calibrated, interdependent parts. For Darwinian evolution to be true, there must have been a series of mutations, each of which produced its own working machine, that led to the complexity we can now see. The more complex and interdependent each machine's parts are shown to be, the harder it is to envision Darwin's gradualistic paths, Behe surveys the professional science literature and shows that it is completely silent on the subject, stymied by the elegance of the foundation of life. Could it be that there is some greater force at work? Michael Behe is not a creationist. He believes in the scientific method, and he does not look to religious dogma for answers to these questions. But he argues persuasively that biochemical machines must have been designed -- either by God, or by some other higher intelligence. For decades science has been frustrated, trying to reconcile the astonishing discoveries of modern biochemistry to a nineteenth-century theory that cannot accommodate them. With the publication of Darwin's Black Box, it is time for scientists to allow themselves to consider exciting new possibilities, and for the rest of us to watch closely.",
        "Category": " Science , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Wars of the Roses",
        "Authors": "By Weir, Alison and Kirkham, Phebe (EDT)",
        "Description": "Lancaster and York. For much of the fifteenth century, these two families were locked in battle for control of the English throne. Kings were murdered and deposed. Armies marched on London. Old noble names were ruined while rising dynasties seized power and lands. The war between the royal houses of Lancaster and York, the most complex in English history, profoundly altered the course of the monarchy. Alison Weir, one of the foremost authorities on British history, brings brilliantly to life both the war itself and the larger-tha-life figures who fought it on the great stage of England. The Wars of the Roses is history at its very best—swift and compelling, rich in character, pageantry, and drama, and vivid in its re-creation of an astonishing period of history.",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Baedeker's Caribbean including Bermuda (Baedeker guides)",
        "Authors": "By Baedeker, Jarrold, Baedeker",
        "Description": "Surveys hotels, restaurants, special events, nightlife, sports, sights, and attractions in the region",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Baedeker's Italy",
        "Authors": "By Baedeker, Jarrold, Baedeker, Karl",
        "Description": "A city-by-city description of the sights and tourist attractions of Italy, including Sicily and Sardinia, is accompanied by street maps and advice on travel and accommodations",
        "Category": "",
        "Publisher": "ARCO",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "Gettysburg: The Place, the Battles, the Outcome",
        "Authors": "By Storrick, W. C.",
        "Description": "",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Barnes and Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Betrayers",
        "Authors": "By Hamilton, Donald",
        "Description": "",
        "Category": "",
        "Publisher": "Gold Medal/Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Technical Communication (8th Edition)",
        "Authors": "By Lannon, John M.",
        "Description": "Technical Communication, Eighth Edition (formerly Technical Writing), is a comprehensive yet flexible introduction to technical and professional communication for students of all majors. Rhetorical principles are explained, illustrated, and applied to an array of documents from brief memos and electronic mail to formal reports, oral presentations, and proposals.",
        "Category": " Technology & Engineering , Technical Writing",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Strangers Among Us : How Latino Immigration is Transforming America",
        "Authors": "By Suro, Roberto",
        "Description": "The author, an American journalist who is himself the son of Latino immigrants, examines the history of Latino immigration to the US, the vast transformations it is producing in American society, and the challenges it will present for decades to come. He tells the stories of large Latino communities in a chronological narrative that starts with Puerto Rican migration to Harlem in the 1950s and continues through the migration of Central Americans to California in the 1990s. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Social Science , Ethnic Studies , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Shave the Whales",
        "Authors": "By Adams, Scott",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Who Moved the Stone?",
        "Authors": "By Morrison, Frank",
        "Description": "\"I owe Morison a great debt of gratitude. Who Moved the Stone? was an important early link in a long chain of evidence that God used to bring me into his kingdom. Morison’s stirring intellectual exploration of the historical record proved to be an excellent starting point for my spiritual investigation.\" --From the foreword by Lee Strobel English journalist Frank Morison had a tremendous drive to learn of Christ. The strangeness of the Resurrection story had captured his attention, and, influenced by skeptic thinkers at the turn of the century, he set out to prove that the story of Christ’s Resurrection was only a myth. His probings, however, led him to discover the validity of the biblical record in a moving, personal way. Who Moved the Stone? is considered by many to be a classic apologetic on the subject of the Resurrection. Morison includes a vivid and poignant account of Christ’s betrayal, trial, and death as a backdrop to his retelling of the climactic Resurrection itself. Among the chapter titles are: * The Book That Refused to Be Written * The Real Case Against the Prisoner * What Happened Before Midnight on Thursday * Between Sunset and Dawn * The Witness of the Great Stone * Some Realities of That Far-off Morning Who Moved the Stone? is a well-researched book that is as fascinating in its appeal to reason as it is accurate to the truthfulness of the Resurrection.",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Understanding the New Testament",
        "Authors": "By Kee, Howard Clark, Young, Franklin Woodrow",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "A Dictionary of Modern Legal Usage (Oxford Paperbacks)",
        "Authors": "By Garner, Bryan A.",
        "Description": "The need for clarity and precision in legal writing has become increasingly apparent in recent years.  Until this award-winning book appeared, the unwieldy body of legal language had not been collected or scrutinized in any systematic way.      Far more than a typical law dictionary, A Dictionary of Modern Legal Usage is the first and only comprehensive guide to style and usage for the legal writer. Bryan A. Garner, an editor, academic, and practicing lawyer has written an accessible, authoritative, and up-to-date guide that will help anyone in the legal thicket write better, including lawyers, judges, students, journalists, and those who work in other fields concerned with law (among them medicine, business, and finance).      At once scholarly and entertaining, the alphabetical entries define and distinguish between commonly misused words; explain standard usages that other reference works ignore; and cumulatively provide an unparalleled guide to legal style.  On virtually every page, the volume contains sparkling essays on such topics as metaphors, sexism, cliches, Latinisms, danglers, split infinitives, and purple prose.  It also brims with actual illustrations from judicial opinions, statutes, briefs, and law review articles.      Already viewed as the classic book in its field, A Dictionary of Modern Legal Usage fills an important gap in legal reference literature.",
        "Category": " Reference , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "What Should I Believe?: Is There Really a God... And Does He Care about Me?",
        "Authors": "By Smouse, Phil A.",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Santa's Favorite Cookies: Sweet Treats For The Christmas Season",
        "Authors": "By Ltd. Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Question of Hu",
        "Authors": "By Spence, Jonathan D.",
        "Description": "This lively and elegant book by the acclaimed historian Jonathan D. Spence reconstructs an extraordinary episode in the early intercourse between Europe and China. It is the story of John Hu, a lowly but devout Chinese Catholic, who in 1722 accompanied a Jesuit missionary on a journey to France--a journey that ended with Hu's confinement in a lunatic asylum. At once a triumph of historical detective work and a gripping narrative, The Question of Hu deftly probes the collision of tw ocultures, with their different definitions of faith, madness, and moral obligation.",
        "Category": " History , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "The Best American Mystery Stories 1997",
        "Authors": "By Penzler, Otto (EDT) and Parker, Robert B. (EDT)",
        "Description": "For many years, some of the most vital, creative, and exciting fiction published in America has been in the field of mystery, crime, and suspense. Now Robert B. Parker and Otto Penzler - both Edgar winners - have assembled the best that 1996 had to offer: twenty terrific, titillating tales from such masters of the genre as Elmore Leonard, Elizabeth George, James Crumley, Jonathan Kellerman, and Andrew Klavan, newcomers such as Brad Watson, and well-known literary writers such as Joyce Carol Oates and Michael Malone.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "God Allows U-Turns a Woman's Journey: True Stories of Hope and Healing",
        "Authors": "By Bottke, Allison and Hutchings, Cheryll",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Promise Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Agent of the Terran Empire",
        "Authors": "By Poul Anderson",
        "Description": "",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "CliffsNotes on Shakespeare's Macbeth (Cliffsnotes Literature Guides)",
        "Authors": "By Went, Alex",
        "Description": "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background. The latest generation of titles in this series also feature glossaries and visual elements that complement the classic, familiar format.Packed with action and vivid portrayal of human relationships, Shakespeare&#39;s Macbeth traces the bloody climb to power and tragic ruin of a fate-plagued king. Count on CliffNotes on Macbeth to carry you through the rise and fall of a cast of characters that includes a cruel and ambitious warrior, his wicked wife, and a trio of witches who have wormed their way into audiences&#39; hearts since William Shakespeare first presented their prophecies about 300 years ago.Show your classmates—and your grade-granting teacher—that you&#39;re in the know with English literature. You can&#39;t miss with scene summaries, plot explorations, language simplification, and insights into the author&#39;s life and times. Other features that help you study includeA brief synopsis of the playA character map to help you see relationships among the charactersCritical essays on major themes and stage productionsAn interactive quiz to test your knowledgeEssay topics and practice projectsClassic literature or modern-day treasure—you&#39;ll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Literary Criticism , Reference",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Supreme Court Under Marshall and Taney (American History Series)",
        "Authors": "By Newmyer, R. Kent",
        "Description": "",
        "Category": "",
        "Publisher": "Harlan Davidson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "Write Papers (Ron Fry's How to Study Program)",
        "Authors": "By Fry, Ron",
        "Description": "Includes hints, advice, and techniques for choosing a topic, taking notes, writing preliminary and final drafts, and polishing the finished paper",
        "Category": "",
        "Publisher": "Career Pr Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Great Soccer Drills : The Baffled Parent's Guide",
        "Authors": "By Quinn, Ron and Fleck, Tom",
        "Description": "A PAPERBACK ORIGINALA games-based alternative to tedious rote exercises, guaranteed to keep practices fun, engaging, and productiveGreat Soccer Drills provides soccer coaches with a great way to make every soccer practice active, fun, and productive. Coaches get 125 games guaranteed to keep kids moving and excited while teaching them basic skills, sharpening their reflexes, and building their confidence and decision-making ability. Written by two of North America's foremost names in youth soccer coaching, it also includes guidelines on how to create just the right blend of drills to hold the attention of six- to twelve-year-old players.Great Soccer Drills can be used in conjunction with the bestselling Coaching Youth Soccer: A Baffled Parent's Guide or as an excellent stand-alone resource for spicing up any practice.",
        "Category": " Sports & Recreation , Soccer",
        "Publisher": "International Marine/Ragged Mountain Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Clear and Effective Legal Writing",
        "Authors": "By Charrow, Veda R., Erhardt, Myra K., and Charrow, Robert P.",
        "Description": "",
        "Category": "",
        "Publisher": "Little Brown & Co Law & Business",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Encyclopedia of the Harley Davidson: The Ultimate Guide to the World's Most Popular Motorcycle",
        "Authors": "By Henshaw, Peter",
        "Description": "The most popular brand of motorcycle gets its own treatment. The history, vision and scope of this magnificent bike is given a thorough and vigorous tribute with beautiful full-color photos throughout.",
        "Category": " Transportation , Motorcycles , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "10.34",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "One Last Little Peek, 1980-1995: The Final Strips, the Special Hits, the Inside Tips",
        "Authors": "By Breathed, Berke",
        "Description": "The Pulitzer Prize-winning cartoonist's final collection of cartoons from his off-the-wall, and recently discontinued, series, \"Outland,\" features previously uncollected color strips, as well as a selection of the artist's all-time favorites. Original.",
        "Category": " Humor , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Guide to the Battle of Gettysburg (U.S. Army War College Guides to Civil War Battles)",
        "Authors": "By Luvaas, Jay",
        "Description": "",
        "Category": " History , Reference",
        "Publisher": "Univ Pr of Kansas",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Political Writings of Thomas Jefferson (Monticello Monograph Series)",
        "Authors": "By Jefferson, Thomas and Peterson, Merrill D. (EDT)",
        "Description": "Thomas Jefferson's greatest impact on society came from his involvement in politics--as a writer and thinker, and as governor, congressman, ambassador, cabinet member, vice-president, and president. In this volume, editor Merrill D. Peterson has gleaned Jefferson's basic ideas on politics and produced a book containing the core of our third president's political thought. These ideas form a creed that still gives the United States of America a unique place in the history of nations and makes Jefferson one of the foremost advocates of human liberty.",
        "Category": " Political Science , History & Theory",
        "Publisher": "University of Virginia Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The approach to kings",
        "Authors": "By Anderson, Patrick",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "34.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The King and I, Vocal Selection",
        "Authors": "By Richard Rodgers, Oscar Hammerstein II",
        "Description": "",
        "Category": "",
        "Publisher": "Williamson Music",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "Feng Shui Food",
        "Authors": "By Brown, Simon and Brow, Simon",
        "Description": "By applying the ancient Chinese philosophy of feng shui to the American kitchen, the author shows how food can promote health and happiness by outlining menu plans and offering tips and advice for planning weddings, children's parties, family dinners, and open-air feasts.",
        "Category": " Cooking , Specific Ingredients , Natural Foods",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Vegetable Cook Book",
        "Authors": "By Sunset Books",
        "Description": "Provides guidelines to the selection and preparation of the vegetables found in the United States and includes numerous recipes for hot and cold dishes",
        "Category": " Cooking , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "April",
            "Year": "1983"
        }
    },
    {
        "Title": "God Was in This Place & I, i Did Not Know: Finding Self, Spirituality and Ultimate Meaning (Kushner)",
        "Authors": "By Kushner, Lawrence",
        "Description": "Selected as a Union of American Hebrew                 Congregations (UAHC) “Significant Jewish                 Book”                Jacob was running away from home. One                 night he lay down in the wilderness to sleep and had one of the                 great mystical experiences of Western religion. He dreamed                 there was a ladder, with angels ascending and descending,                 stretched between heaven and earth. For thousands of years,                 people have tried to overhear what the messengers came down to                 tell Jacob, and us.              Now in a daring blend of scholarship and                 imagination, psychology and history, Lawrence Kushner gathers                 an inspiring range of interpretations of Genesis 28:16 given by                 sages, from Shmuel bar Nachmani in third-century Palestine to                 Hannah Rachel Werbermacher of Ludomir who lived in Poland two                 hundred years ago. Through a fascinating new literary genre and                 Kushner’s creative reconstruction of the teachers’                 lives and times, we enter the study halls and sit at the feet                 of these spiritual masters to learn what each discovered about                 God’s Self and ourselves as they ascend and descend                 Jacob’s ladder.              In this illuminating journey, our                 spiritual guides ask and answer the fundamental questions of                 human experience: Who am I? Who is God? What is God’s                 role in history? What is the nature of evil? How should I                 relate to God and other people? Could the universe really have                 a self?              Rabbi Lawrence Kushner brilliantly                 reclaims a millennium of Jewish spirituality for contemporary                 seekers of all faiths and backgrounds. God Was in This Place & I, i Did Not Know is about God and about you; it is about                 discovering God’s place in the universe, and yours.",
        "Category": " Religion , Devotional",
        "Publisher": "Jewish Lights",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Quantum Theory (Dover Books on Physics)",
        "Authors": "By Bohm, David",
        "Description": "This superb text by David Bohm, formerly Princeton University and Emeritus Professor of Theoretical Physics at Birkbeck College, University of London, provides a formulation of the quantum theory in terms of qualitative and imaginative concepts that have evolved outside and beyond classical theory. Although it presents the main ideas of quantum theory essentially in nonmathematical terms, it follows these with a broad range of specific applications that are worked out in considerable mathematical detail. Addressed primarily to advanced undergraduate students, the text begins with a study of the physical formulation of the quantum theory, from its origin and early development through an analysis of wave vs. particle properties of matter. In Part II, Professor Bohm addresses the mathematical formulation of the quantum theory, examining wave functions, operators, Schrödinger's equation, fluctuations, correlations, and eigenfunctions.Part III takes up applications to simple systems and further extensions of quantum theory formulation, including matrix formulation and spin and angular momentum. Parts IV and V explore the methods of approximate solution of Schrödinger's equation and the theory of scattering. In Part VI, the process of measurement is examined along with the relationship between quantum and classical concepts.Throughout the text, Professor Bohm places strong emphasis on showing how the quantum theory can be developed in a natural way, starting from the previously existing classical theory and going step by step through the experimental facts and theoretical lines of reasoning which led to replacement of the classical theory by the quantum theory.",
        "Category": " Science , Physics , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "7.39",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "He Walked Among Us: Evidence for the Historical Jesus",
        "Authors": "By McDowell, Josh and Wilson, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Abraham Lincoln",
        "Authors": "By Thomas, Benjamin",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Revelation of John, Vol. 1: Chapters 1 to 5 (The Daily Study Bible Series, Revised Edition)",
        "Authors": "By Barclay, William (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Westminster John Knox Pr",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "When God When?",
        "Authors": "By Meyer, Joyce",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Harrison House Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Abraham Lincoln: The Prairie Years and The War Years",
        "Authors": "By Sandburg, Carl",
        "Description": "Originally published in six volumes, Sandburg’s Abraham Lincoln was called “the greatest historical biography of our generation.” Sandburg distilled this work into one volume that became the definitive life of Lincoln. Index; photographs.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1974"
        }
    },
    {
        "Title": "The Mormon Mirage: A Former Mormon Tells Why She Left the Church",
        "Authors": "By Scott, Latayne C.",
        "Description": "A former Mormon, now Christian, compares the beliefs of Mormonism and Christianity and explains why she converted",
        "Category": " Religion , Cults",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1979"
        }
    },
    {
        "Title": "Panini, Bruschetta, Crostini: Sandwiches, Italian Style",
        "Authors": "By LA Place, Viana",
        "Description": "Move over pasta and pizza, here come panini, bruschetta, and crostini! The world of sandwiches, Italian style. These heavenly bread-based creations include recipes for breakfast, lunch, and dinner, antipasti, party foods, and delicious desserts and indulgences for any time of the day.",
        "Category": " Cooking , Courses & Dishes , Bread",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "1,001 Things You Always Wanted to Know About the Bible, But Never Thought to Ask",
        "Authors": "By Lang, J. Stephen",
        "Description": "With 1,001 Things You Always Wanted to Know About the Bible but Never Thought   to Ask discover how the Bible has impacted language, U.S. history, worship,   music, art, literature, movies, and theater; how the Bible was passed down to   us; plus every key person, place, event, and idea in the Bible. Best-selling   Bible trivia author J. Stephen Lang's intriguing tidbits will leave you yearning   to know more about the world's most fascinating book. Whether you are a seasoned   Bible student or just getting started, you will enjoy readying 1,001 Things   You Always Wanted to Know About the Bible but Never Thought to Ask.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Negotiating For Dummies (For Dummies Series)",
        "Authors": "By Donaldson, Michael C. and Donaldson, Mimi",
        "Description": "Unless you live alone in a cave, you spend a good part of each day negotiating – with your boss, your staff, your vendors, or clients, with your spouse, your kids, and even your neighbor with the rambunctious rottweiler. Negotiating is all about getting what you want in life. And whether it’s closing a multimillion-dollar deal, buying a home, or debating body-piercings with your teenager, the basic negotiating skills required are always the same.  You’d be surprised how quickly you can master those skills, with the right coach to guide you, and you’d be amazed at how you’re life can be transformed once you do.Get ready to be transformed. Negotiating For Dummies offers a new approach to getting what you want in life, based on personal integrity and persuasion, not tricks and coercion. In plain English, master negotiators Michael and Mimi Donaldson explain the six steps to successful negotiations and arm you with tested-in-the-trenches techniques that help you:Get people to do what you want without threats or deceitAlways negotiate from a position of strengthAchieve win-win results in every negotiationBuild trust, goodwill, and mutual respectCommunicate more clearly and effectivelyAdvance your careerReduce stress in your everyday lifeStop spinning your wheels in endless debate and miscommunication. Discover how much easier and more rewarding life can be once you’ve mastered the simple, easy-to-master methods for:Identifying your values and creating a mission statementDeveloping a plan based on thorough research and putting it into actionSetting limits and sticking to themMaintaining your emotional distanceFine-tuning your listening skillsCommunicating clearly and handling hot -button issues with graceReading signs of resistance and receptivityDressing for successMonitoring and controlling your body languageClosing the dealHow well you do, how happy you are , and whether you get what you want, or get passed over, have a lot to do with how good a negotiator you are. Let Negotiating For Dummies show you how to become a master negotiator.",
        "Category": " Business & Economics , Negotiating",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "The Age of Napoleon (American Heritage Library)",
        "Authors": "By Herold, J. Christopher",
        "Description": "Called an \"outstanding work of popular history\" by The New York Times, this book is the biography of an enigmatic and legendary personality, as well as the portrait of an entire age. The author explores relevant political, cultural, military, commercial, and social history.",
        "Category": "",
        "Publisher": "Amer Heritage Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Visions of the Children: The Apparitions of the Blessed Mother at Medjugorje",
        "Authors": "By Connell, Janice T.",
        "Description": "The classic account of the appearances of the Blessed Mother at Medjugorje--now updated for the milleniumLike Lourdes and Fatima before it, Medjugorje has become a holy site for worshippers around the world, a place that will be remembered long after the twentieth century recedes into history.In this edition, Janice Connell presents a new intruduction that places Medjugorje in the context of the millennium and suggests that the Blessed Mother's final appearance on Earth may indeed be at this small mountain village.  The author tells what has happened to the six apparitioners since the book was first published, and the Blessed Mother's monthly messages have been updated through 1997.  There is also a new list of Marian Centers across the nation.The Visions of the Children features exclusive conversations with the six apparitioners who have been receiving, for more than fifteen years, visions and messages of the Virgin Mary, including extraordinary secrets about the final chapter in the history of the world.  This book not only tells of the need for love and spiritual awakening, but casts a powerful perspective on the wholescale devastation in Bosnia during the last few years.",
        "Category": " Religion , Spirituality",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "If the Stars Are Gods",
        "Authors": "By Gregory Benford, Gordon Eklund",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1978"
        }
    },
    {
        "Title": "Luther the Reformer",
        "Authors": "By Kittelson, James M.",
        "Description": "",
        "Category": "",
        "Publisher": "Augsburg Fortress Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Writing the Novel: From Plot to Print",
        "Authors": "By Block, Lawrence",
        "Description": "Offers aspiring novelists guidelines for developing plot ideas, characters, and the story line as well as rewriting the manuscript, finding a literary agent, and getting works published",
        "Category": " Reference , Writing Skills",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "The Delivery Man: A Novel",
        "Authors": "By McGinniss, Joe, Jr.",
        "Description": "The Delivery Man is a thrilling and astonishing debut—a scary, fast-paced, and illuminating portrait of the MySpace generation. It is a love story set against the surreal excess of Las Vegas—and the artificial suburbs, gated communities, and freeways that surround it—where broken lives come to seek new beginnings and casinos feed the lust of tourists and residents alike. Ultrasophisticated local kids grow up fast and burn out early.After attending college in New York, Chase returns to Vegas and is drawn into the lucrative but dangerous world of a teenage call-girl service with his childhood friend Michele, a beautiful Salvadoran immigrant with whom he shares a tragic past. Over the course of one extraordinary summer they will confront the violence and emptiness at the heart of the city and their generation.At once stark and electrically atmospheric, horrifying and hopeful, The Delivery Man is an ambitious literary novel as well as a fast and absorbing page-turner—and a powerful indictment of a society in which personal responsibility has been abandoned, lust is increasingly mistaken for love, and innocence is an anachronism.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Grove/Atlantic, Black Cat",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "One Nation, After All : What Americans Really Think About God, Country, Family, Racism, Welfare, Immigration, Homosexuality, Work, The Right, The Left and Each Other",
        "Authors": "By Wolfe, Alan",
        "Description": "Concluding that all cultural divides are exaggerated, this monumental critique of American culture finds a remarkable uniformity of opinion among middle class Americans on a wide variety of supposedly divisive issues. Reprint.",
        "Category": " Political Science , Public Policy , Social Policy",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "More Than Courage (Coyle, Harold)",
        "Authors": "By Coyle, Harold",
        "Description": "Courage is often enough to drive a soldier forward, to cause him to climb out of his foxhole and face enemy fire. But it takes something else, something more than courage to keep HIM going when every instinct, every shred of reason dictates that he do otherwise.This hard truth becomes self-evident when the men belonging to Recon Team Kilo, a Special Forces A team operating deep in hostile territory, is overwhelmed by indigenous forces. Stripped of their leadership and unit cohesion, the survivors struggle to stay faithful to a code of conduct in the face of brutal imprisonment and an uncertain future. Isolated from their brethren, each man is forced to rely upon his own skills and strengths. Some rise to the occasion with a defiance that is unnerving to their captors and some draw upon an inner grace that sees them through their darkest hours. Others, alone and suffering, find themselves wavering as they are hammered by an unending drumbeat of depraved cruelty.The challenges faced by those selected to rescue the men of Recon Team Kilo are no less daunting, the catalysts that propel them and see them through any diverse. For Robert Delmont, Special Ops Plans Officer, a compelling need for atonement colors his recommendations. He steers the Army's senior leadership toward a course of action that allows him to become an active participant.Courage is not a factor for the commander of the unit selected to execute Delmont's plan. A dedicated professional, Lieutenant Colonel Harry Shaddock has no doubt that the men under his command will follow him anywhere--even into an operation designed to save fellow soldiers while putting his own in harm's way.While Dermont, Shaddock, and other members of the armed forces bend their collective efforts to save the survivors of Recon Team Kilo, the families of those men must endure a trial no less daunting. They must find a way to deal with their fears and their emotions as they stand on the sidelines watching their loved ones killed off, one by one, by a ruthless foe in a contest that demands more of them than any had imagined. In order to triumph, all must reach out and draw upon something within, something more than courage.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Deeper Than the Darkness",
        "Authors": "By Greg Benford",
        "Description": "",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Irish Wit and Wisdom",
        "Authors": "By Kelly, Joan Larson",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Peter Pauper Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "The Shooters",
        "Authors": "By Metz, Leon Claire",
        "Description": "With a scholar's authority and a storyteller's passion, Leon Metz chronicles the lives of famous gunfighters like Billy the Kid, Wyatt Earp, and Wild Bill Hickok, as well as lesser-known desperadoes who left just as many corpses and whiskey bottles in their wake. Rich in detail, and woven with wit and insight, these fascinating portraits reveal the Shooters as they really lived, fought, and died.",
        "Category": " Social Science , Media Studies",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "World Without End: A Novel (Kingsbridge)",
        "Authors": "By Follett, Ken",
        "Description": "#1 New York Times BestsellerIn 1989, Ken Follett astonished the literary world with The Pillars of the Earth, a sweeping epic novel set in twelfth-century England centered on the building of a cathedral and many of the hundreds of lives it affected. Critics were overwhelmed''it will hold you, fascinate you, surround you' (Chicago Tribune)'and readers everywhere hoped for a sequel. Look out for the next book in this series, A Column of Fire, available now.World Without End takes place in the same town of Kingsbridge, two centuries after the townspeople finished building the exquisite Gothic cathedral that was at the heart of The Pillars of the Earth. The cathedral and the priory are again at the center of a web of love and hate, greed and pride, ambition and revenge, but this sequel stands on its own. This time the men and women of an extraordinary cast of characters find themselves at a crossroads of new ideas'about medicine, commerce, architecture, and justice. In a world where proponents of the old ways fiercely battle those with progressive minds, the intrigue and tension quickly reach a boiling point against the devastating backdrop of the greatest natural disaster ever to strike the human race'the Black Death. Three years in the writing and nearly eighteen years since its predecessor, World Without End breathes new life into the epic historical novel and once again shows that Ken Follett is a masterful author writing at the top of his craft.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Microsoft® Windows® Command-Line Administrator's Pocket Consultant (Pro - Administrator's PC)",
        "Authors": "By Stanek, William R., DelRe, Martin (EDT), Woolley, Valerie (EDT), and Johnson, Jim (EDT)",
        "Description": "Portable and precise, this pocket-sized guide delivers ready answers for managing Microsoft Windows Server 2003 and Windows XP from the command line. Zero in on core command-line tools and techniques—learning timesaving ways to extend your operational efficiency and reach over multiple domains and networks. With its quick-reference tables, lists, and step-by-step instructions, this book delivers the fast, accurate information you need to get the job done—whether you’re at your desk or in the field! Get fast facts to:Create and use command-line scriptsPerform multiple, complex operations by grouping commandsRun commands, scripts, and programs on a scheduled basisUse event-logging tools to monitor and fine-tune system performanceGain control over disks beyond what you can do from the GUIAdminister Active Directory users and groups, computer accounts, and domainsMaintain network printers and print services Configure, manage, and troubleshoot TCP/IP networking servicesGet tips for using command-line related Resource Kit tools",
        "Category": " Computers , Operating Systems , Windows Desktop",
        "Publisher": "Microsoft Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Data Mining Techniques: For Marketing, Sales, and Customer Support",
        "Authors": "By Berry, Michael J. A. and Linoff, Gordon S.",
        "Description": "Who will remain a loyal customer and who won't?  What kind of marketing approach is most likely to increase sales?  What can customer buying patterns tell us about improving our inventory control?  What type of credit approval process will work best for us and our customers?  The answers to these and all your crucial business questions lie buried in your company's information systems. This book supplies you with powerful tools for mining them.  Data Mining Techniques thoroughly acquaints you with the new generation of data mining tools and techniques and shows you how to use them to make better business decisions. One of the first practical guides to mining business data, it describes techniques for detecting customer behavior patterns useful in formulating marketing, sales, and customer support strategies. While database analysts will find more than enough technical information to satisfy their curiosity, technically savvy business and marketing managers will find the coverage eminently accessible. Here's your chance to learn all about: * How leading companies across North America are using data mining to beat the competition * How each tool works, and how to pick the right one for the job * Seven powerful techniques -cluster detection, memory-based reasoning, market basket analysis, genetic algorithms, link analysis, decision trees, and neural nets * How to prepare data sources for data mining, and how to evaluate and use the results you get  Data Mining Techniques shows you how to quickly and easily tap the gold mine of business solutions lying dormant in your information systems.",
        "Category": " Computers , Databases , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.86",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Word Smart, 4th Edition (Smart Guides)",
        "Authors": "By Robinson, Adam",
        "Description": "Knowing which words to use and how to use them is key to communicating accurately and effectively. That’s why more than one million people have used this book to improve their vocabularies. To find out which words you absolutely need to know, The Princeton Review researched the vocabularies of educated adults by analyzing major newspapers and books and focusing on the words that people misunderstand or misuse. We also examined the SAT and other standardized tests to determine which words are tested most frequently.All of the entries in Word Smart, 4th Edition are necessary for an impressive vocabulary, and learning and using these words effectively can help you to get better grades, score higher on tests, and communicate more confidently at work.",
        "Category": " Study Aids , General",
        "Publisher": "Princeton Review",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    }
]