[
    {
        "Title": "The Sweep of America History (Volume 2)",
        "Authors": "By Gustav L. Seligmann, Jr. Robert R. jones",
        "Description": "",
        "Category": "",
        "Publisher": "John Wiley & Sons, Inc.",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "My Friend Gorilla",
        "Authors": "By Morozumi, Atsuko",
        "Description": "The son of a zookeeper who has brought a gorilla home to live with his family is at first afraid of the beast, but they soon become friends. Unfortunately, when it starts to get cold, the gorilla must go home to Africa.",
        "Category": " Juvenile Fiction , Animals , Apes, Monkeys, etc.",
        "Publisher": "Farrar, Straus and Giroux (BYR)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "The Unwanted: A Memoir of Childhood",
        "Authors": "By Nguyen, Kien",
        "Description": "A story of hope, a story of survival, and an incredible journey of escape, 'The Unwanted' is the only memoir by an Amerasian who stayed behind in Vietnam after the fall of Saigon and who is now living in America.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Lies Across America: What Our Historic Sites Get Wrong",
        "Authors": "By Loewen, James W.",
        "Description": "The fabulous sequel to the bestselling, award-winning \"Lies My Teacher Told Me.\" James Loewen's last book, Lies My Teacher Told Me, a debunking of the twelve leading high-school American history textbooks, won the American Book Award, the AESA Critics' Choice Award, and the Oliver Cromwell Cox Award for Anti-Racist Scholarship. It has sold more than a quarter-million copies in its various editions. Now, using the same irrepressibly honest approach and the same subversive take on all things bogus and misinformative, Loewen has identified a whole new arena for his one-of-a-kind inquiries into the way we tell our country's story. Lies Across America looks at more than one hundred sites where history is told on the landscape, including historical markers, monuments, outdoor museums, historic houses, forts, and ships. Loewen uses his investigation of these public versions of history, often literally written in stone, to correct historical interpretations that are profoundly wrong, to tell neglected but important stories about the American past, and, most importantly, to raise questions about what we as a nation choose to commemorate and how. Lies Across America offers startling revelations about sites we think we know: Valley Forge, Abraham Lincoln's log cabin, the Intrepid. It also tells of new sites, events, and individuals that should be commemorated on the landscape but aren't: a tombstone with a story to tell in Mississippi, a spy in the Confederate White House, the unforeseen fallout from the first nuclear missile test, the reverse underground railway, a modern \"sundown\" town (blacks can work there, but they'd better leave before the sun sets). It asks why, across our landscape, Indians are consistently \"savage,\" tribal names are wrong and derogatory, whites \"discover\" everything, and the term \"massacre\" is a one-way street; why war museums have selective memories, guides at FDR's family mansion in Hyde Park are \"specifically forbidden\" to talk about Roosevelt's mistress, and James Buchanan's house makes no mention of the fact that he was gay. It muses about the Civil War mare in Kentucky who got an extra body part, the Polynesian King made to look like a Roman emperor on monuments in Hawaii, and the statue of a conquistador in New Mexico who lost his foot. This book is a reality check for anyone who has ever sought to learn about America through our public sites and markers. It is destined to change the way we see our country. Lies Across America includes: - Sites from all fifty states plus the District of Columbia, organized geographically, west to east - Introductory essays on: the role that monuments, markers, and other historic sites play in our society; how historic markers get on the landscape in the first place; what historic markers say about the era they commemorate versus the era in which they were erected; the visual symbolism of monuments and memorials; the way historical markers are revised over time (including natural forces, spray paint, and dynamite) - A list of twenty candidates for \"toppling\"--markers so distorting or inaccurate they should be removed or rewritten immediately -Forty black-and-white photos of notably interesting and/or awful markers",
        "Category": " History , United States , General",
        "Publisher": "New Press, The",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Media Monopoly: With a New Preface on the Internet and Telecommunications Cartels",
        "Authors": "By Bagdikian, Ben H.",
        "Description": "When the first edition of The Media Monopoly was published in 1983, critics called Ben Bagdikian's warnings about the chilling effects of corporate ownership and mass advertising on the nation's news \"alarmist.\" Since then, the number of corporations controlling most of America's daily newspapers, magazines, radio, television, books, and movies has dropped from fifty to ten to six. This edition features a dramatic new preface, detailing the media landscape as we enter the twenty-first century, and includes an entirely new examination of the implications of new technologies.",
        "Category": " Social Science , Media Studies",
        "Publisher": "Beacon Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Magic of Disney Storybook Collection (Disney Storybook Collections)",
        "Authors": "By Disney Book Group",
        "Description": "Celebrate the wonderful world of Disney with the newest edition to our ever-popular storybook collection series. Set sail with Mickey and Minnie, watch Goofy save the day on a camping trip, join Donald on his search for the best birthday present ever for Daisy Duck, and more! This charming collection, illustrated with beautiful art from the Disney archives, is certain to be a hit with Disney fans ages one to one hundred and one!",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Air Force - A pictorial history of American airpower",
        "Authors": "By Caidin, Martin",
        "Description": "",
        "Category": "",
        "Publisher": "Rinehart",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Objection!: How High-Priced Defense Attorneys, Celebrity Defendants, and a 24/7 Media Have Hijacked Our Criminal",
        "Authors": "By Grace, Nancy and Clehane, Diane",
        "Description": "Court TV host Nancy Grace presents her case in this behind-the-scenes look at the high-profile cases everyone is talking about ancy Grace is a name millions of Americans recognize from her regular appearances on Court TV and Larry King Live. Legions of loyal fans tune in for her opinions on today's high-profile cases and her expert commentary on the challenges facing the American judicial system. Now, in Objection!, she makes her case for what's wrong with the legal system and what can be done about it.",
        "Category": " Law , Media & the Law",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Silver Wings: A History of the United States Air Force",
        "Authors": "By Boyne, Walter J.",
        "Description": "Silver Wings is a thoroughly refreshing, lively, and informative history of the United States Air Force. But Walter Boyne's account is by no means history in the conventional sense. Rather than setting forth a traditional catalog of equipment, well-known campaigns, and famous pilots, Boyne chronicles the colorful inside story of the events and the men and women who shaped the Air Force into the most powerful military force in history.Boyne offers a new perspective on how the USAF grew and gradually expanded the concept of air power to that of space power. He traces the earliest days of aviation history from Civil War ballooning, through the initial establishment of the Aeronautics Division of the Signal Corps in 1907, to its rapid growth in World War I, its fight for survival during the Depression, its triumphant expansion and achievement of airpower during World War II, and its spectacular successes in recent decades.Boyne draws upon more than fifty years of research and forty years of flying experience to give depth and dimension to his story. And with a novelist's flair for storytelling, he brings to life the rogues, unsung heroes, feuds, fiascoes, and triumphs of the Air Force. Emphasis is given to the less-well-known, interesting sidelights. For example, in his account of Billy Mitchell's demonstration that airplanes could sink U.S. battleships - which stunned and infuriated American admirals - Boyne reveals the political intrigue behind the affair and its repercussions.Wonderfully informative captions accompany hundreds of photos by the premier aviation photographers and artists, as well as vintage photos from Air Force archives. Boyne uses the photos to help tell the amazing parallel story of the development of technology, from the first fragile Wright biplanes to the Northrop B-2 and the dazzling hightech Stealth fighters.Silver Wings honors the devotion of thousands of people who did their jobs without concern for recognition or reward. Anyone who served, the families of those who served, history buffs, and all proud Americans will find in this book reminders of that service - sometimes nostalgic, sometimes amusing, at other times poignant, but always fascinating.",
        "Category": " Political Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "American Museum Guides: Sciences",
        "Authors": "By Hoffman, Paul",
        "Description": "Indicates which United States museums have the finest collections of American, ancient, Asian, European, and modern art, and describes the location, admission, and hours for each institution",
        "Category": " Business & Economics , Museum Administration & Museology",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "International Business: Environments and Operations",
        "Authors": "By Daniels, John D. and Radebaugh, Lee H.",
        "Description": "Covers human and cultural environments facing business, international trade theory, government influence on trade, international business diplomacy, multinational accounting and tax functions, and multinational ownership and collective bargaining. This 7th edition includes expanded coverage of trading patterns, regional trade in North America, and the role of financial institutions in foreign-exchange trading, as well as case histories on companies such as Euro Disney and Blockbuster Video. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "7.17",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "How many hills to Hillsboro?",
        "Authors": "By Bauer, Fred",
        "Description": "",
        "Category": "",
        "Publisher": "Hewitt House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Sahara Special",
        "Authors": "By Codell, Esme Raji",
        "Description": "Sahara Jones is going into fifth grade-again. Although she won't be \"Sahara Special\" anymore (special needs, that is), she doesn't expect this year to be any better than last year. Fifth grade is going to be different, though, because Sahara's class is getting a new teacher: Miss Pointy. From her eggplant-colored lipstick to the strange subjects she teaches, like \"Puzzling\" and \"Time Travel,\" she is like no other teacher Sahara has ever known. With Miss Pointy's help, Sahara just might find a way to redefine special for herself.The latest chapter in her book unfolds when her mother insists that she be taken out of special Ed. So Sahara is facing fifth grade in the regular classroom, again. But why even try to do the work, Sahara wonders, if everything just winds up in the counselor's file?Enter Miss Pointy, the new fifth-grade teacher. With her eggplant-colored lipstick, and strange subjects such as \"Puzzling\" and \"Time Travel,\" she's like no other teacher Sahara has ever known. Through Miss Pointy's unusual teaching, storytelling, and quiet support, Sahara finds the courage to overcome her fears and prove which file shows her true self.",
        "Category": " Juvenile Fiction , Social Themes , Self-Esteem & Self-Reliance",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Carlson Wades's Natural Foods Crockery Cookbook",
        "Authors": "By Wade, Carlson",
        "Description": "",
        "Category": "",
        "Publisher": "Weathervane Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Darkness And The Dawn",
        "Authors": "By Swindoll, Charles R.",
        "Description": "The two most significant events in human history are the death and resurrection of Jesus Christ.  And no one can uncover their meaning for today quite like Charles Swindoll.  From the poignant interactions of The Last Supper, through the despairing events of Gethsemane and the seven last words of Jesus on the Cross, Dr. Swindoll challenges readers with a new perspective on the atoning work of Christ.  And in Part Two of this inspirational work, the secret of how the resurrection of Jesus enables Christians to live triumphantly is revealed in a clear yet surprising way.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "My Season on the Brink: A Father's Seven Weeks As a Little League Manager",
        "Authors": "By Brown, Paul B.",
        "Description": "Recounting his stormy tenure as coach of the Holmdel Athletic Association league's baseball team for children ages 6 to 8, a New Jersey family man discusses his adventures with lively kids and unpredictable parents. National ad/promo.",
        "Category": " Sports & Recreation , Essays",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "As Ever",
        "Authors": "By Weinburger, Jane",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Windswept House",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "A Love Story",
        "Authors": "By Millner, Denene and Chiles, Nick",
        "Description": "The Essence bestselling authors of Love Don't Live Here Anymore put a sexy new spin on modern romance.Aaron and his best friend Nina have been soulmates since childhood. They believe the reason their friendship has lasted is because they never crossed the line and fell in love. But this summer, Aaron and Nina are taking their friendship where it's never gone before, proving that romance is sweeter, sexier, and scarier when the stakes are sky high.",
        "Category": " Fiction , Romance , Erotica",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Greater Washington area bicycle atlas",
        "Authors": "By Moskowitz, Ken",
        "Description": "",
        "Category": "",
        "Publisher": "Potomac Area Council, American Youth Hostels",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Golf Handbook: The Complete Guide to the Greatest Game",
        "Authors": "By Saunders, Vivien",
        "Description": "In The Golf Handbook, golf pro Vivien Saunders starts by teaching the basic stance, grip, and swing that first-time players need in order to enjoy the game. The instruction progresses as the golfer's skill level does, and every shot on the course from the drive to the sand wedge, from putting to hitting out of the rough is taught in detail. The Golf Handbook's clear diagrams and easy-to-use tips make it the ideal guide for any player, from weekend duffer to low handicapper.  But The Golf Handbook isn't just about technique; it also addresses key questions about tactical play, fitness, and equipment. Plus, it's a great read, with sections on the history of golf, the greatest players of the game, and the famous courses where every golfer dreams of testing his or her skill, made complete with photographs.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Summer Stargazing: A Practical Guide for Recreational Astronomers",
        "Authors": "By Dickinson, Terence",
        "Description": "An abundantly illustrated guide to the year's best stargazing season.    \"Summer brings with it fine stargazing weather; it also happens to be the time of the year when our galaxy, the Milky Way, arches high across the sky.\"  -- Terence Dickinson    The cool, clear nights from May to October offer astronomers the best opportunities for stargazing. Few sights in nature can compare with the splendor of a dazzling star-filled sky.     Summer Stargazing captures the grandeur of the universe with down-to-earth simplicity. All that is needed is a reasonably dark night sky, a pair of binoculars or a simple telescope, and this book.     The book features everything else the amateur astronomer needs, including easy-to-use color star charts that cover the entire North American sky for one year and photographic-quality            charts for this main stargazing season.     With Summer Stargazing, astronomers can delve into the majesty of the starry night to explore:   Planets of the Solar System   Galaxies   Remote star-forming nebulas   Glittering star dusters and more.     Helpful advice is given for safely viewing special phenomena such as eclipses and auroras.     Summer Stargazing is both a stargazing guide and a pictorial celebration of the summer night sky.",
        "Category": " Nature , Sky Observation",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Rambling Raft",
        "Authors": "By Lockhart, Lynne N. and Lockhart, Barbara M.",
        "Description": "A blue and yellow raft, destined to be a birthday present for a little boy, is instead used by various seashore creatures when the raft falls out of the back of a truck",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Other, Non-Religious",
        "Publisher": "Schiffer Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Lassie, Come Home (Grosset Grow Up)",
        "Authors": "By Knight, Eric",
        "Description": "",
        "Category": "",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "12.12",
        "Publish Date": {
            "Month": "June",
            "Year": "1954"
        }
    },
    {
        "Title": "Natural Gardening (Nature Company Guides)",
        "Authors": "By Wasowski, Sally, Turner, R. G., Jr. (EDT), Glasener, Erica, Scott, Jane, Knopf, Jim, Keator, Glenn, and Boring, John Kadel (EDT)",
        "Description": "A richly illustrated, informative guide to gardening explains how to create a welcoming habitat for a wide variety of wild creatures through the use of an environmentally friendly collection of native vegetation.",
        "Category": " Gardening , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Making Beautiful Banners: More Than 70 Festive Designs to Decorate Your Home",
        "Authors": "By Webster, Barbara",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Stopping Cancer Before It Starts: The American Institute for Cancer Research's Program for Cancer Prevention",
        "Authors": "By American Institute for Cancer Research",
        "Description": "Research shows an undeniable link between diet and cancer. In fact, 60 to 70 percent of cancers can be prevented by making the right choices about food, exercise, and tobacco use. Stopping Cancer Before It Starts tells you how to make simple changes in your everyday life that can radically reduce the risk of cancer.PART I: WHAT YOU NEED TO KNOW ABOUT CANCER* Separates popular myths from facts and statistics* Explains how simple lifestyle changes could prevent an estimated 375,000 cancer cases in the U.S. annually* Describes how one simple dietary adjustment could reduce cancer rates by 20 percent* Examines the most common types of cancer-from lung cancer to breast cancer-and shows the influence of diet and lifestyle factors on themPART II: CREATING A MORE CANCER-RESISTANT YOU* Shows you how to analyze your cancer risk* Reveals how lifestyle choices affect cancer* Examines the relationship between excess calorie intake and increased cancer riskPART III: THE BEST NUTRITION FOR CANCER PREVENTION* Gives the \"how, what, and why\" to eat for cancer prevention* Offers the most current information on vitamins, minerals, and other dietary supplementsPART IV: RECIPES AND MENUS* Offers dozens of healthy and savory recipes* Includes simple menus that require little time or planningStopping Cancer Before It Starts provides the facts you need to make the right choices to prevent cancer.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Golden Guides from St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Complete Guide to Needlework",
        "Authors": "By Reader's Digest Association",
        "Description": "More than twenty-six hundred drawings and photographs and clearly presented directions provide an understanding of the techniques involved in numerous traditional needlework crafts, including embroidery, quilting, applique, macrame, knitting, and rug hooking",
        "Category": " Crafts & Hobbies , Needlework , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Basic Book of Antiques & Collectibles",
        "Authors": "By Michael, George",
        "Description": "Guides the novice in the identification, judging, collecting, appreciation, and care of all types of antiques and collectibles for enjoyment and investment",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Wallace-Homestead Book Co",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Schoolhouse Applique: Reverse Techniques and More",
        "Authors": "By Patera, Charlotte",
        "Description": "",
        "Category": " Crafts & Hobbies , Applique",
        "Publisher": "C & T Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Lovely Bones",
        "Authors": "By Sebold, Alice",
        "Description": "Once in a generation a novel comes along that taps a vein of universal human experience, resonating with readers of all ages. THE LOVELY BONES is such a book -- a #1 bestseller celebrated at once for its artistry, for its luminous clarity of emotion, and for its astonishing power to lay claim to the hearts of millions of readers around the world.\"My name was Salmon, like the fish; first name, Susie. I was fourteen when I was murdered on December 6, 1973.\"So begins the story of Susie Salmon, who is adjusting to her new home in heaven, a place that is not at all what she expected, even as she is watching life on earth continue without her -- her friends trading rumors about her disappearance, her killer trying to cover his tracks, her grief-stricken family unraveling. Out of unspeakable tragedy and loss, THE LOVELY BONES succeeds, miraculously, in building a tale filled with hope, humor, suspense, even joy.",
        "Category": " Fiction , Literary",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Family Fun Vacation Guide: Mid-Atlantic (Family Fun Vacation Guides)",
        "Authors": "By Powers, Alice Lecesse, Weldon-Siviy, Denise, Mintzer, Rich, and Gallaro, Elisa",
        "Description": "Meet the new pandas at the National Zoo in Washington, D.C. Chill out at a Delaware beach. See the dinosaurs at the Museum of National History in New York City Build a rocket at the NASA/Goddard Space Flight Center in Greenbelt, Maryland. Visit George Washington's home at Mount Vernon, VA.",
        "Category": " Travel , Special Interest , Family",
        "Publisher": "Disney Editions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Um, Like... OM: A Girl Goddess's Guide to Yoga",
        "Authors": "By Peterson, Stacy (ILT) and Cooper, Evan",
        "Description": "The perfect primer for yoga enthusiasts, Um, Like... OM goes above and beyond teaching the technique of yoga: it reveals how yoga can help teenage girls face any challenge that comes their way, from dealing with difficult parents to break-ups to the pressure to conform. Written in a hip and empathetic voice by a yoga practitioner who knows all about the ups and downs of the teenage years, this book also provides tips and tricks on how girls can tell their inner critic to take a hike and embrace the girl goddess within. Packed with illustrated yoga poses, real-life teen stories, inspiring quotations, sidebars with FYIs (``Fun Yoga Information''), book and music recommendations, and a glossary, Um, Like... OM is the ultimate guide to yoga-and life-for teens.",
        "Category": " Young Adult Nonfiction , Sports & Recreation , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Whole-Brain Thinking: Working from Both Sides of the Brain to Achieve Peak Job Performance",
        "Authors": "By Wonder, Jacquelyn and Donovan, Priscilla",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Quill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Why Forgive?",
        "Authors": "By Arnold, Johann Christoph",
        "Description": "A guide to the difficult process of forgiveness honestly discusses the importance of this virtue and reveals the role \"holding on\" to bitterness and rage plays in bigotry, crime, and war. $50,000 ad/promo.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Plough Pub House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Lucky Man: A Memoir",
        "Authors": "By Fox, Michael J.",
        "Description": "A funny, highly personal, gorgeously written account of what it's like to be a 30-year-old man who is told he has an 80-year-old's disease. \"Life is great. Sometimes, though, you just have to put up with a little more crap.\" --Michael J. Fox In September 1998, Michael J. Fox stunned the world by announcing he had been diagnosed with Parkinson's disease--a degenerative neurological condition. In fact, he had been secretly fighting it for seven years. The worldwide response was staggering. Fortunately, he had accepted the diagnosis and by the time the public started grieving for him, he had stopped grieving for himself. Now, with the same passion, humor, and energy that Fox has invested in his dozens of performances over the last 18 years, he tells the story of his life, his career, and his campaign to find a cure for Parkinson's. Combining his trademark ironic sensibility and keen sense of the absurd, he recounts his life--from his childhood in a small town in western Canada to his meteoric rise in film and television which made him a worldwide celebrity. Most importantly however, he writes of the last 10 years, during which--with the unswerving support of his wife, family, and friends--he has dealt with his illness. He talks about what Parkinson's has given him: the chance to appreciate a wonderful life and career, and the opportunity to help search for a cure and spread public awareness of the disease. He is a very lucky man, indeed. The Michael J. Fox FoundationMichael J. Fox is donating the profits from his book to the Michael J. Fox Foundation for Parkinson's Research, which is dedicated to fast-forwarding the cure for Parkinson's disease. The Foundation will move aggressively to identify the most promising research and raise the funds to assure that a cure is found for the millions of people living with this disorder. The Foundation's web site, MichaelJFox.org, carries the latest pertinent information about Parkinson's disease, including:  A detailed description of Parkinson's disease How you can help find the cure Public Services Announcements that are aired on network and cable television stations across the country to increase awareness Upcoming related Parkinson's disease events and meetings Updates on recent research and developments",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Native North American Literary Companion",
        "Authors": "By Witalec, Janet",
        "Description": "",
        "Category": "",
        "Publisher": "Visible Ink Press",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Streamside Reflections: Fly Fishing for Trout and Salmon",
        "Authors": "By Meyers, Steven",
        "Description": "",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Thunder Bay Pr",
        "Price Starting With ($)": "7.72",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Earth Again Redeemed",
        "Authors": "By Martin Green",
        "Description": "",
        "Category": "",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "9.48",
        "Publish Date": {
            "Month": "March",
            "Year": "1977"
        }
    },
    {
        "Title": "The Father Connection: How You Can Make the Difference in Your Child's Self-Esteem and Sense of Purpose",
        "Authors": "By McDowell, Josh",
        "Description": "“As a young father I was running scared . . . I feared the culture would capture my kids . . . but I figured if I could find the ultimate model of fatherhood and then emulate that model, I had a fighting chance.”  Updated and redesigned for a new generation of dads, Josh McDowell’s ECPA Gold Medallion Award winner The Father Connection looks at ten parenting qualities inspired by the ultimate model of fatherhood. Embracing these godly characteristics will make all the difference in a child, boosting self-esteem and sense of purpose, helping him or her to:  • Feel loved and secure • Develop a reputation of integrity • Know their dad keeps his promises • Stand up to unhealthy peer pressure • Avoid drug and alcohol abuse • Save sex until marriage • Desire their father’s counsel • Admit when they’re wrong • Come to their dad in times of trouble or hurt • Admire and respect their father as their parent",
        "Category": " Religion , Christian Living , Men's Interests",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Indoor Garden Book",
        "Authors": "By Brookes, John",
        "Description": "",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "The Perennial Garden: Color Harmonies Through the Seasons",
        "Authors": "By Cox, Jeff and Cox, Marilyn",
        "Description": "A hands-on guide to growing perennials with an easy-to-use chart of details on culture, bloom color, and use for over 300 plants. Includes keys for successful perennial gardening, creating a garden that blooms in all seasons, turning any property into a living work of art, and more.",
        "Category": " Gardening , Flowers , Perennials",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Making Pet Houses, Carriers & Other Projects",
        "Authors": "By Self, Charles R.",
        "Description": "Provides instructions for building doghouses, cat playhouses, rabbit hutches, pet carriers and sleeping boxes, and other equipment for pets",
        "Category": " Technology & Engineering , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Corduroy",
        "Authors": "By Freeman, Don",
        "Description": "A picture book classic! One of School Library Journal’s \"Top 100 Picture Books\" of all time (2012) One of the National Education Association’s \"Teachers' Top 100 Books for Children.\"Don Freeman's classic character, Corduroy, is even more popular today then he was when he first came on the scene in 1968. This story of a small teddy bear waiting on a department store shelf for a child’s friendship has appealed to young readers generation after generation.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1976"
        }
    },
    {
        "Title": "Life's Little Pleasures: A Perfect Day",
        "Authors": "By Ryland Peters & Small (COR)",
        "Description": "",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Ryland Peters & Small",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Soul Matters For Men",
        "Authors": "By Mark Gilroy Communications",
        "Description": "Soul Matters for Men tackles 40 of the crucial life issues you face as a man, weaving together poignant personal reflection questions, inspirational quotes, real life stories, God's promises, brief-but hard-hitting- Bible studies, practical life application ideas, and prayer starters to help you to discover for yourself how to let your soul take flight and soar!Topics include: Integrity in the Workplace; Anger Management; Raising Children; Wisdom; Mentorship; Spiritual Warfare; Working with Difficult People; Growing Stronger through Adversity; Facing an Uncertain Future; and more!",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Beyond Blame",
        "Authors": "By Williams, Armstrong",
        "Description": "The statistics are familiar - young black men are being murdered in the streets by the thousands and being jailed by the tens of thousands; millions more will father children and then abandon them. While pundits and political leaders publicly wring their hands about these alarming trends, most retire at the end of the day to their comfortable suburban homes, secure in the belief that it will never happen to their children.Armstrong Williams, a nationally-syndicated radio and television host, sets a higher standard for himself. Through his shows, and in his personal life as well, Armstrong lives his own rhetoric of individual empowerment, hard work, faith, and social responsibility. This book, Beyond Blame, is the direct result of a hard-headed dialogue with a young man he calls \"Brad Howard,\" a twenty-seven-year-old drug dealer, murderer, and father of three small daughters who, in his desperation to leave the streets behind, sought Armstrong's help.Armstrong, raised on a farm and more accustomed to Washington's corridors of power than to the urban ghetto culture, must first bridge the gap between his own world and Brad's - where women are mere playthings for the amusement of pimps and hustlers, where drug money pays for Caribbean vacations or the assassination of rivals, and where individual responsibility takes a back seat to hedonism.It's not enough, Armstrong exhorts Brad, simply to \"give up\" hustling. Instead, Brad must exorcise the world-view that allowed him to fall into degradation in the first place. The ethic of entitlement and false pride, hammered into young men and women by our educational institutions, popular culture, and political leaders, is only partially to blame for Brad's plight. For in the end, it was Brad's own decisions that led to his degenerate life - quite literally, Brad's finger was on the trigger.In order to do right, Armstrong maintains, you must learn to think right. Drawing on his own unapologetic Christianity, he provides lessons in faith - a faith that will give Brad the strength to take responsibility for his actions, for the future of his children, and for his community.Beyond Blame's greatest lesson is that America's urban crime problem cannot be solved by social scientists, politicians, or platitudes. Armstrong provides a powerful reminder that each of us has the duty to get his hands dirty, to actively and aggressively take up the cause of the Brad Howards of the world - not as a social experiment, but because we are, indeed, our brother's keeper.",
        "Category": " Social Science , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Terrorism and Tyranny: Trampling Freedom, Justice and Peace to Rid the World of Evil",
        "Authors": "By Bovard, James",
        "Description": "\"The war on terrorism is the first political growth industry of the new Millennium.\"  So begins Jim Bovard's newest and, in some ways, most provocative book as he casts yet another jaundiced eye on Washington and the motives behind protecting \"the homeland\" and prosecuting a wildly unpopular war with Iraq. For James Bovard, as always, it all comes down to a trampling of personal liberty and an end to privacy as we know it. From airport security follies that protect no one to increased surveillance of individuals and skyrocketing numbers of detainees, the war on terrorism is taking a toll on individual liberty and no one tells the whole grisly story better than Bovard. \"The war on terrorism is the first political growth industry of the new Millennium.\"  So begins Jim Bovard's newest and, in some ways, most provocative book as he casts yet another jaundiced eye on Washington and the motives behind protecting \"the homeland\" and prosecuting a wildly unpopular war with Iraq. For James Bovard, as always, it all comes down to a trampling of personal liberty and an end to privacy as we know it. From airport security follies that protect no one to increased surveillance of individuals and skyrocketing numbers of detainees, the war on terrorism is taking a toll on individual liberty and no one tells the whole grisly story better than Bovard.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Palgrave Macmillan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Laying Down the Law: The 25 Laws of Parenting",
        "Authors": "By Peters, Ruth",
        "Description": "25 no-nonsense rules that teach your kids values and discipline from the inside out NBC Today show expert Dr. Ruth Peters shares her best and newest advice for helping families restore order and keep the peace with proven, painless methods that once and for all get your children to: * Understand and follow your family's values * Do their work when and how YOU want it done-- without whining* Follow your rules, even when their friends don't * Develop compassion and empathy Now, you'll know: * When snooping in their rooms is okay-- and how to do it * When making peace is the WORST thing you can do * The 5 questions you must ask your teenager every time he leaves the house * Why your kids should earn their privileges-- and how to get them to",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Regiment of Women",
        "Authors": "By Berger, Thomas",
        "Description": "Living in the ecologically-destroyed twenty-first century, George Cornell, like all other men, dresses and acts like a woman and tries to cope with feminine militancy",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Chaucer: A Bibliographical Introduction (Toronto Medieval Texts and Translations)",
        "Authors": "By Leyerle, John and Quick, Anne",
        "Description": "More than 900 entries, carefully selected, organized, and annotated, and accompanied by informative background material, make this volume a unique and indispensable guide to Chaucer and related studies.The entries are divided into three categories. The first includes materials necessary for the study of Chaucer’s works: complete editions, facsimiles, studies of manuscripts, canon, and dating, works on the poet’s life, language, and learning, and his sources and influences. The second section covers Chaucer’s works. The third contains a selection of secondary works which provide information on the age and the culture in which Chaucer lived; music, the visual arts, economics and politics, rhetoric and poetics, and sciences among the subjects included.Most entries listed are in English, but a few essential studies in French and German are included. Items have been selected not only on the basis of quality but also for importance in the history of scholarship, variety of approach, and specific usefulness to students and beginners.",
        "Category": " Literary Criticism , Medieval",
        "Publisher": "University of Toronto Press, Scholarly Publishing Division",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "February",
            "Year": "2015"
        }
    },
    {
        "Title": "Everything on a Waffle (Newbery Honor Book)",
        "Authors": "By Horvath, Polly",
        "Description": "By the author of The Trolls, a National Book Award Finalist.My name is Primrose Squarp. I am eleven years old. I have hair the color of carrots in apricot glaze (recipe to follow), skin fair and clear where it isn't freckled, and eyes like summer storms.Readers will know right from the start that the narrator of Everything on a Waffle is going to tell her story straight and pull no punches. Primrose's parents have been lost at sea, but she believes without an iota of doubt that they are still alive, somewhere. She moves in with her Uncle Jack, but feels generally friendless. Her only real refuge is a local restaurant called The Girl on the Red Swing, where the owner, Miss Bowzer, serves everything on waffles -- except advice and good sense, which come free of charge and are always reliable.Food in general plays an important role in Primrose's journey toward peace and understanding (a recipe dictated in her unmistakable voice is appended to each chapter), and readers will eagerly cheer her on through this funny, bittersweet novel.Newbery Honor Book By the author of The Trolls, a National Book Award Finalist.My name is Primrose Squarp. I am eleven years old. I have hair the color of carrots in apricot glaze (recipe to follow), skin fair and clear where it isn't freckled, and eyes like summer storms.Readers will know right from the start that the narrator of Everything on a Waffle is going to tell her story straight and pull no punches. Primrose's parents have been lost at sea, but she believes without an iota of doubt that they are still alive, somewhere. She moves in with her Uncle Jack, but feels generally friendless. Her only real refuge is a local restaurant called The Girl on the Red Swing, where the owner, Miss Bowzer, serves everything on waffles -- except advice and good sense, which come free of charge and are always reliable.Food in general plays an important role in Primrose's journey toward peace and understanding (a recipe dictated in her unmistakable voice is appended to each chapter), and readers will eagerly cheer her on through this funny, bittersweet novel.Newbery Honor Book",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Farrar, Straus and Giroux (BYR)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Maryland Real Estate: Practice & Law, 10th Edition",
        "Authors": "By White, Donald Allen",
        "Description": "",
        "Category": " Law , Real Estate",
        "Publisher": "Dearborn Real Estate Education",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "The Bubba Gump Shrimp Co. Cookbook: Recipes and Reflections from FORREST GUMP",
        "Authors": "By Groom, Winston",
        "Description": "Forrest Gump stepped out of the pages of Winston Groom’s novel, up onto the silver screen, and into the hearts of more than 30 million Americans. If you’re lucky, you count yourself among them. Now you can open to any page... and just like Forrest’s mama said about life... “You never know what you’re gonna get.” There are shrimp kabobs, shrimp creole, shrimp gumbo, shrimp cocktail... over 75 recipes all told, and every mouth-watering one of them heaven-sent. And speaking of heaven, Forrest wanted to remember his mama with these recipes, and his best friend, Bubba, too. And he didn’t want Li’l Forrest to grow up without knowing the Gump family shrimp secrets. These recipes are so downright delicious, you’ll know that “miracles do happen every day.” Forrest Gump has never been a man to complicate things... he’s a simple man, but one who “knows what love is.” Try some of the shrimp recipes in this book, and you’ll know what he means. Forrest’s mama loved the South, and its magazine, Southern Living®. “They just have a way with food,” she used to say. Try these shrimp fixings, all tested in the Southern Living kitchens, and you’ll say his mama was right every time. Even if the President of the United States knocks on your door, you’ll have the very thing to put on his plate. Tell him Forrest Gump said to say hello... and to remember his own mama.",
        "Category": " Cooking , Specific Ingredients , Seafood",
        "Publisher": "TI Inc. Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Four Seasons with the Bread Machine Baker",
        "Authors": "By Harbison, Elizabeth",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Bread",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Better Homes and Gardens Step-By-Step Successful Gardening: Ornamental Grasses",
        "Authors": "By Loewer, H. Peter",
        "Description": "Shows how to design a landscape featuring ornamental grasses, describes the most popular varieties, and offers advice on planting, weeding, mulching, and grooming",
        "Category": " Gardening , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "The Fun Way to Serious Bridge",
        "Authors": "By Lampert, Harry",
        "Description": "The Fun Way To Serious Bridge is for anyone who wants to learn and understand the fundamentals of the mind-stimulating and challenging game of bridge -- and enjoy every minute of it! Harry Lampert combines his skills as a bridge player and teacher with his artistic talents to bring you a totally new FUN way to learn the game. The magic of his superb cartoons and simple, informative language will help you to absorb the principles of serious contract bridge -- and remember them. You'll laugh and learn every step of the way from opening bids to strip and end plays. Whether novice or seasoned social player, this unique book will make good bridge a simple \"trick.\" You'll learn all about:  * Opening bids, suit bids, response and no trump bids, and how to force bids * Competition and the reasons and ways behind it * Big hand bidding such as Blackwood Convention, grand slam force and Gerber Convention * Patterns of play including how tricks are won, the finesse, establishing a long suit, when to pull and delay trumps and entries. * Defensive and advanced play -- plus much more!",
        "Category": " Games , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Baby's First Bible",
        "Authors": "By Maclean, Moira (ILT), Maclean, Colin, Maclean, Colin (ILT), and Maclean, Moira",
        "Description": "A book with a handle and a clasp so it can be carried like a purse introduces the Bible stories of the creation, Noah's ark, Moses, David, and Daniel, and events from the life of Jesus",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Chess For Beginners",
        "Authors": "By Horowitz, I. A",
        "Description": "In this book, I. A. Horowitz, Chess Editor of the New York Times and former U.S. Open Champion, applies some of the ideas and convictions acquired from thirty-five years of playing, teaching and analyzing the royal game. He emphasizes the tactical aspects of the game: how to recognize the big chance and hit hard when it occurs. He also stresses the ideas and methods in opening play, rather than the routine memorizing of variations that takes the joy out of chess for so many beginners.  When you have completed this book, you will be able to play chess with pleasure and some ability.",
        "Category": " Games , Chess",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1971"
        }
    },
    {
        "Title": "What to Expect When the New Baby Comes Home (What to Expect Kids)",
        "Authors": "By Murkoff, Heidi Eisenberg and Rader, Laura (ILT)",
        "Description": "Growing Up Just Got Easier...With the help of Angus, the lovable Answer Dog, best-selling author Heidi Murkoff extends a hand to children and parents as they tackle life's first experiences together.   Congratulations! The new baby you've spent the last nine months preparing for has finally arrived. Although you may be prepared and thrilled, what about your older child? As your preschooler makes the transition from only child to older sibling, he or she will be excited, curious, and somewhat anxious about the little bundle you've brought home. We're here to help you answer your child's questions about what new babies look like, what they do and don't do, and what having one around the house will really be like.Have fun!Heidi and Angus",
        "Category": " Juvenile Nonfiction , Family , New Baby",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Polly Clingerman's Dinner Companion: Glorious, Easy Meals in Less Than an Hour",
        "Authors": "By Clingerman, Polly",
        "Description": "",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Amer Cooking Guild",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Oh Bother!: Pooh's Book About Trying New Things",
        "Authors": "By Milne, A. A., Kurtz, John (ILT), and Marshall, Hallie",
        "Description": "As magical and timeless as the Hundred-Acre Wood may be, it is also a place of exploration and discovery. For Pooh and his friends to learn and grow, they must try new things. And trying something new can be difficult, even a little scary. Trying new things is often hard for children - and for adults, too. But trying something new with Winnie the Pooh always makes theh worries and bothers seem less threatening.",
        "Category": " Juvenile Fiction , Social Themes , New Experience",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Last Amateurs",
        "Authors": "By Feinstein, John",
        "Description": "Like millions who love college basketball, John Feinstein was first drawn to the game because of its intensity, speed and intelligence. Like many others, he felt that the vast sums of money involved in NCAA basketball had turned the sport into a division of the NBA, rather than the beloved amateur sport it once was. He went in search of college basketball played with the passion and integrity it once inspired, and found the Patriot League. As one of the NCAA's smallest leagues, none of these teams leaves college early to join the NBA and none of these coaches gets national recognition or endorsement contracts. The young men on these teams are playing for the love of the sport, of competition and of their schools. John Feinstein spent a season with these players, uncovering the drama of their daily lives and the passions that drive them to commit hundreds of hours to basketball even when there is no chance of a professional future. He offers a look at American sport at its purest.",
        "Category": " Sports & Recreation , Basketball",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Heart of the Home: Notes From a Vineyard Kitchen",
        "Authors": "By Branch, Susan",
        "Description": "With an emphasis on simple preparation and fresh foods, Susan Branch has created the perfect combination of illustration and prose and a celebration of food sure to become a classic of homespun delights. Susan Branch wrote the book completely written by hand and illustrated it with charming and beautiful color watercolors. Ribbon marker.",
        "Category": " Cooking , Reference",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Invitation to Joy: A Personal Story.",
        "Authors": "By Whitney, Eleanor Searle",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "26.96",
        "Publish Date": {
            "Month": "July",
            "Year": "1971"
        }
    },
    {
        "Title": "Rama: A Legend",
        "Authors": "By Highwater, Jamake, Valmiki, and Glancey, Kelli (ILT)",
        "Description": "In a story based on the great Indian and Southeast Asian epic, the Ramayana, Prince Rama falls in love with Sita, a beautiful nature goddess, but when a jealous queen forces him from his throne, Rama, Sita, and his brother Laksmana must battle the evil King Ravana.",
        "Category": " Young Adult Fiction , People & Places , United States , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Country Diary Book of Crafts",
        "Authors": "By Mitchell, Annette",
        "Description": "",
        "Category": "",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Wreaths of All Sorts",
        "Authors": "By Reppert, Bertha",
        "Description": "",
        "Category": "",
        "Publisher": "Remembrance Pr",
        "Price Starting With ($)": "8.98",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Peregrine",
        "Authors": "By Bayer, William",
        "Description": "Circling high over Rockefeller Center is a peregrine falcon, the most awesome of the flying predators. She awaits a signal from her falconer. It is given: the bird attacks, plummeting from the sky at nearly 200 miles an hour, striking a young woman and killing her instantly.So begins Peregrine, a chilling tale of obsession.By chance, newscaster Pamela Barrett witnesses the slaying. Her impassioned account of it on television that evening thrills the falconer, a brilliant madman who identifies with his deadly bird. He becomes fascinated with Pam and enmeshes her in a bizarre and deadly scheme even as she finds herself drawn to him by an erotic need she doesn't understand. As killing follows killing, the police and the media engage in cutthroat competition to find the murderer. Two falcons fight to the death above Central Park. Call girls, rich eccentrics, dealers in the black market for rare birds--all play their roles in this study of secret passion, desire, fulfillment, and ecstasy.At the publisher's request, this title is being sold without Digital Rights Management software (DRM) applied.",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "Complete Book of Birdhouses and Feeders",
        "Authors": "By Russo, Monica and Dewire, Robert",
        "Description": "Line drawings supplement detailed descriptions of birds which will accept bird boxes, platforms, or trellises",
        "Category": " Technology & Engineering , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Painting Rooms: How to Choose and and Use Paint Like an Expert",
        "Authors": "By Ostrow, Judy",
        "Description": "This hands-on guide explores the wide range of paint and special-effects products available today—and offers a step-by-step guide to choosing, mixing, and using them for a variety of home decorating purposes. Here is practical advice on everything from preparing surfaces to choosing colors and equipment; from understanding paint properties to mastering painting techniques.",
        "Category": " House & Home , Decorating & Furnishings",
        "Publisher": "Quarry Books",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Education in a New Era",
        "Authors": "By Brandt, Ronald S.",
        "Description": "",
        "Category": " Reference , Yearbooks & Annuals",
        "Publisher": "Assn for Supervision & Curriculum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Wars and Peace: The Memoir of an American Family",
        "Authors": "By Quirk, Rory F.",
        "Description": "Tells a very American story of an ordinary family in extraordinary times, through their wartime letters. Letters document James and Elizabeth Quirk's struggles during WWII as he spends four years in the Army in Europe, only to return and be sent to the Korean battlefront a few years later. James later became the first publisher of  TV Guide , but at a cost to their post-war dream of reunion. When their son Rory goes to Vietnam, the dream runs out, in a stunning and unexpected way. Rory Quirk is an attorney and a writer. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Presidio Press",
        "Price Starting With ($)": "7.37",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Feasts: Menus for Home-Cooked Celebrations",
        "Authors": "By Newman, Leslie",
        "Description": "Offers recipes and advice on cooking for a crowd, featuring food that is simple to cook, good to eat, and stretches the budget",
        "Category": " Cooking , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "The Master of the Game",
        "Authors": "By Talbott, Strobe",
        "Description": "Combines an account of the career of veteran arms-control negotiator, Paul Nitze, with an account of arms-control diplomacy during Nitze's career and the negotiations that continue",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The International Dolls House Book",
        "Authors": "By S. F. King",
        "Description": "",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "The Collectors Encyclopedia of Roseville Pottery: Second Series: 2 (2nd Series)",
        "Authors": "By Huxford, Bob and Huxford, Sharon",
        "Description": "",
        "Category": " Antiques & Collectibles , Pottery & Ceramics",
        "Publisher": "Collector Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1980"
        }
    },
    {
        "Title": "General methods for solving physics problems",
        "Authors": "By Belikov, B. S",
        "Description": "",
        "Category": "",
        "Publisher": "Mir Publishers",
        "Price Starting With ($)": "31.31",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Complete Idiot's Guide to Fishing Basics (The Complete Idiot's Guide)",
        "Authors": "By Toth, Mike",
        "Description": "You're no idiot, of course.  You manage complicated projects at work, tackle home renovation projects without fear, and even manage to help your kids put together award-winning science projects.  But when it comes to tossing a fishing line into the water, you're not sure whether you're more likely to land the catach of the day or be the catch of the day.  Don't hang up your waders yet!  The Complete Idiot's Guide to Fishing Basics helps you build the skills you need to become a savvy, more successful angler.  Feel confident about planning your next fishing trip, even if you'll be trying out new equipment or fishing for a new species.  In this Complete Idiot's Guide, you get:",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Complete Outdoors Encyclopedia (An Outdoor Life Book)",
        "Authors": "By Sparano, Vin T",
        "Description": "",
        "Category": "",
        "Publisher": "Outdoor Life/ Harper & Row",
        "Price Starting With ($)": "8.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Giving Good Weight",
        "Authors": "By McPhee, John A.",
        "Description": "\"You people come into the market—the Greenmarket, in the open air under the down pouring sun—and you slit the tomatoes with your fingernails. With your thumbs, you excavate the cheese. You choose your stringbeans one at a time. You pulp the nectarines and rape the sweet corn. You are something wonderful, you are—people of the city—and we, who are almost without exception strangers here, are as absorbed with you as you seem to be with the numbers on our hanging scales.\" So opens the title piece in this collection of John McPhee's classic essays, grouped here with four others, including \"Brigade de Cuisine,\" a profile of an artistic and extraordinary chef; \"The Keel of Lake Dickey,\" in which a journey down the whitewater of a wild river ends in the shadow of a huge projected dam; a report on plans for the construction of nuclear power plants that would float in the ocean; and a pinball shoot-out between two prizewinning journalists.",
        "Category": " Literary Collections , Essays",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "8.47",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "Don't Mess with My Money: The Dolans' No-Nonsense Lifetime Money Plan",
        "Authors": "By Dolan, Ken and Dolan, Daria",
        "Description": "From radio's most trusted advisers, the kind of insider's advice that some experts don't want you to know about -- how to manage your money and build a firm financial foundation that will withstand the inevitable surprises life throws your way.With their long-running #1 rated personal finance radio show, Ken and Daria Dolan are America's \"First Family of Finance.\" Armed with more than forty years of experience, they have helped tens of thousands of people plan for the future, survive difficult financial times, and cope with unexpected life challenges and emergencies. In Don't Mess with My Money, they draw on a lifetime of personal experience, as well as the tips and strategies from their legion of listeners, to write a candid, tell-it-like-it-is lifetime money guide. Why? Because the people they talk to every day need it.In the wake of 9/11, and in the aftermath of a yearlong recession and a seemingly endless series of admissions of corporate chicanery and deceit, people across America have begged for trustworthy help in righting their finances, and for someone to tell them what the real deal is. In Don't Mess with My Money, the Dolans pull back the veil of secrecy and reveal the loopholes, double-talk, and insider secrets that some Wall Street analysts and banks, insurance companies, car dealers, and financial advisers try to keep hidden. The Dolans explain how to avoid getting ripped off, how to get out of debt, how to organize your finances and safeguard your money from layoffs, illness, retirement, and death. They talk about: • How to prepare yourself for unemployment, divorce, and the death of a spouse • The three words you must utter the next time you buy a new car • How to invest without losing your shirt • The ins and outs of estate planning and retirement • What you must know about the biggest investment you'll ever make--your homeAs all of us are aware, life is uncertain. We need to prepare for the unexpected, from job layoffs and salary freezes to the death of a loved one. In this practical, no-nonsense guide, the Dolans provide the essential information you need to know to gain control over your financial lives and your future.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Doubleday Business",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Bech: A book",
        "Authors": "By Updike, John",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Closers",
        "Authors": "By Connelly, Michael",
        "Description": "In Los Angeles in 1988, a sixteen-year-old girl disappeared from her home and was later found dead of a gunshot wound to the chest. The death appeared at first to be a suicide - but some of the evidence contradicted that scenario, and detectives came to believe this was in fact a murder. Despite a by-the-book investigation, no one was ever charged.Now Detective Harry Bosch is back with the LAPD with the sole mission of closing unsolved cases, and this girl's death is the first he's given. A DNA match makes the case very much alive again, and it turns out to be anything but cold. The ripples from this death have destroyed at least two other lives, and everywhere he probes, Bosch finds hot grief, hot rage, and a bottomless well of betrayal and malice.And it's not just the girl's family and friends whose lives Bosch is stirring up afresh. With each new development, Harry Bosch finds increasing resistance from within the police force itself. Old enemies are close at hand. Even as he pushes relentlessly to find the truth, Bosch has to wonder if this assignment was intended to be his last. Digging up the past may heal old wounds - or it may expose new, searing ones.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Marrying Game: A Novel",
        "Authors": "By Saunders, Kate",
        "Description": "Like Louisa May Alcott's classic Little Women, The Marrying Game opens on Christmas Eve, with four sisters at home worrying about money.  The setting is present-day England, and the girls' father, an eccentric aristocrat, has just died, leaving the Hasty family so impoverished that they are about to lose their splendid but crumbling house. So the two oldest sisters--Rufa, tall, elegant, and too serious for her own good; and Nancy, a gorgeous, irreverent redhead who relishes her work as a part-time barmaid in the local pub--decide that the way to redeem the family fortunes is to marry money. Surely it can't be that hard to find two very rich men and make the men fall in love with them. Thus begins a gloriously modern story that makes us genuinely care about the whole Hasty family. As Rufa and Nancy set out to blaze a trail through London society, they find that nothing in The Marrying Game turns out quite the way they've planned. Like Louisa May Alcott's classic Little Women, The Marrying Game opens on Christmas Eve, with four sisters at home worrying about money.  The setting is present-day England, and the girls' father, an eccentric aristocrat, has just died, leaving the Hasty family so impoverished that they are about to lose their splendid but crumbling house. So the two oldest sisters--Rufa, tall, elegant, and too serious for her own good; and Nancy, a gorgeous, irreverent redhead who relishes her work as a part-time barmaid in the local pub--decide that the way to redeem the family fortunes is to marry money. Surely it can't be that hard to find two very rich men and make the men fall in love with them. Thus begins a gloriously modern story that makes us genuinely care about the whole Hasty family. As Rufa and Nancy set out to blaze a trail through London society, they find that nothing in The Marrying Game turns out quite the way they've planned.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Please don't shoot my dog: The autobiography of Jackie Cooper",
        "Authors": "By Cooper, Jackie and Kleiner, Dick",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow & Company, Inc.",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Aircraft (Rand Mcnally Factbooks)",
        "Authors": "By Maynard, Christopher and Paton, John",
        "Description": "Presents the history of flying machines from the simple attempts at the end of the nineteenth century to the supersonic transport and military aircraft of today.",
        "Category": " Juvenile Nonfiction , Technology , General",
        "Publisher": "Checkerboard Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Station Gehenna",
        "Authors": "By Weiner, Andrew",
        "Description": "",
        "Category": "",
        "Publisher": "Congdon & Weed in association with Davis Publications",
        "Price Starting With ($)": "15.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Mary Engelbreit'S Home Companion Book",
        "Authors": "By Engelbreit, Mary",
        "Description": "Presents a beautifully illustrated guide to home decorating inspired by Engelbreit's enchanting artwork and nostalgic themes, with detailed instructions on how to create a variety of projects--including room decor and accessories--for the home.",
        "Category": " House & Home , Decorating",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Theater: A Crash Course (Crash Course (Watson-Guptill))",
        "Authors": "By Graham, Rob",
        "Description": "",
        "Category": " Performing Arts , Theater , General",
        "Publisher": "Watson-Guptill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The History of the World Series: The Complete Chronology of America's Greatest Sports Tradition",
        "Authors": "By Schoor, Gene",
        "Description": "Uses photopraphs, statistics, and interviews to document all of the World Series games up to the earthquake series of 1989",
        "Category": " Sports & Recreation , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "The Beat Vision: A Primary Sourcebook",
        "Authors": "By Knight, Arthur and Kit Knight (eds)",
        "Description": "",
        "Category": "",
        "Publisher": "Paragon House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Do You Know the Real You?: More Than 66 Ways to Understand Your Personality (Compass)",
        "Authors": "By Gordon, Claire",
        "Description": "In Do You Know the Real You? psychology expert Claire Gordon offers revealing exercises and quizzes to help you pinpoint your strengths and use them more effectively in every area of your life. From your career and friendships to romantic relationships and beyond, this beautifully packaged, practical book of self-discovery assesses how your own unique traits affect how you interact in the world and explains how to overcome your weaknesses.Do You Know the Real You? includes revealing selftests to help readers discover and maximize their natural strengths answering such questions as:How well do you know yourself?Are you confrontational?Are you sensitive?In your day-to-day life, do you like to be the star attraction or do you prefer a more supporting role?Do you trust easily?Are you a realist or an idealist?",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Bike Book",
        "Authors": "By Hughes, Tim",
        "Description": "A guide to biking discusses choosing a bicycle, clothing, and equipment, bike safety and maintenance, and bicycle sports",
        "Category": " Sports & Recreation , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Thomas Jefferson's Flower Garden at Monticello, 3rd ed",
        "Authors": "By Betts, Edwin Morris",
        "Description": "The restoration of the flower gardens at Monticello in 1941, sponsored by the Garden Club of Virginia, was the result of Edwin Betts's scholarly research and Hazlehurst Perkins's practical gardening skills. Thomas Jefferson's Flower Garden at Monticello presents the evolution of Jefferson's ornamental gardening efforts with an analysis of the flower gardens as they were planned, planted, and ultimately restored.No early American gardens were as well-documented as those at Monticello, which became an experimental station, a botanic garden of new and unusual plants from around the world. Betts and Perkins communicate here the nature and sources of Jefferson's intelligent venture into ornamental gardening.The third edition includes a revised plant list, annotation of the more than 100 species cultivated in the flower garden, and new illustrations.",
        "Category": " Architecture , Landscape",
        "Publisher": "University of Virginia Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1971"
        }
    },
    {
        "Title": "From Approximately Coast to Coast...It's the Bob and Ray Show",
        "Authors": "By Elliott, Bob and Goulding, Ray",
        "Description": "Scripts from Bob and Ray's television and radio programs poke fun at news shows, soap operas, and American society",
        "Category": " Performing Arts , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Healthy Holidays: Total Health Entertaining All Year Round",
        "Authors": "By Henner, Marilu and Henner, Lorin",
        "Description": "Holidays can be healthy!Maintaining a healthy lifestyle is tough enough, but when special occasions roll around most people throw up their hands and dive into the Super Bowl snacks, Fourth of July hot dogs, Halloween treats, and New Year’s champagne -- knowing they'll regret it later. In Healthy Holidays, actress and healthy living expert Marilu Henner offers another choice. Here Marilu shows us how easy and fun it is to prepare healthy meals for family and friends for special occasions and holidays year-round.  As in her other bestselling health books, Marilu throws out the red meat, dairy, and refined sugar and fills the kitchen with the freshest fruits, vegetables, grains, soy, seafood, poultry, and \"legal\" sugars. But denying ourselves is not on the agenda: Start the year right with delicious New Year's Day recipes, such as Asian Grilled Salmon and Sautéed Asparagus with Shallots -- and pamper your guests with a spa party. Enjoy a romantic Valentine's Day with Honey-Baked Chicken, Warm Wild Mushroom Salad -- and Cupid's Chocolate Cake, made with healthy sugars to keep you in the mood.  For a delicious Fourth of July picnic, pack some of these treats: Sugar Snap Pea and Cucumber Salad, Curried Tuna Salad, and Blueberry Cobbler with a Cornmeal Crust. Prepare a mouthwatering feast for Thanksgiving that gives a healthy start for the holiday season -- including Roast Turkey, Henner Holiday Dressing, Pecan Sweet Potatoes, and Pilgrim Pumpkin Pie.Along with hundreds of healthy recipes Healthy Holidays offers dozens of creative twists on our favorite celebrations: For exercise on Saint Patrick's Day -- learn Irish step dancing! Act out a juicy scene with your partner for the Academy Awards. Throw a grab-bag Halloween party, and laugh as your husband ends up as Little Bo Peep. Explore the eight traditional themes of Hanukkah as an opportunity to incorporate healthy habits that could change your life. Learn the three habits that will keep your Christmas healthy -- and fill out the Henner Family Christmas Survey with your family!Healthy Holidays is your complete holiday planning resource for great celebrations the healthy way.",
        "Category": " Cooking , Holiday",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Quick, Call Me a Taxi (My First Jokes and Riddles)",
        "Authors": "By Ziegler, Judy",
        "Description": "Animals act out jokes and riddles such as \"What looks like half a grapefruit?  The other half\" and \"What do pigs write letters with?  Pig pens\"",
        "Category": " Fiction , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Frozen in Time: The Greatest Moments at the Winter Olympics",
        "Authors": "By Greenspan, Bud",
        "Description": "Pays tribute to athletes of the Winter Olympics with 56 profiles of medal-winning men and women from around the world who have competed since 1924. Each profile recounts memorable moments of the competition, with many quotes from athletes, and each contains a color or b&w photo. Includes statistics. No index. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Sports & Recreation , General",
        "Publisher": "General Pub Group",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Dead Sea Scrolls Deception",
        "Authors": "By Baigent, Michael and Leigh, Richard",
        "Description": "The oldest Biblical manuscripts in existence, the Dead Sea Scrolls were found in caves near Jerusalem in 1947, only to be kept a tightly held secret for nearly fifty more years, until the Huntington Library unleashed a storm of controversy in 1991 by releasing copies of the Scrolls. In this gripping investigation authors Baigent and Leigh set out to discover how a small coterie of orthodox biblical scholars gained control over the Scrolls, allowing access to no outsiders and issuing a strict \"consensus\" interpretation. The authors' questions begin in Israel, then lead them to the corridors of the Vatican and into the offices of the Inquisition. With the help of independent scholars, historical research, and careful analysis of available texts, the authors reveal what was at stake for these orthodox guardians: The Scrolls present startling insights into early Christianity -- insights that challenge the Church's version of the \"facts.\" More than just a dramatic exposé of the intrigues surrounding these priceless documents, The Dead Sea Scrolls Deception presents nothing less than a new, highly significant perspective on Christianity.",
        "Category": " Religion , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Doorways to Christian Growth",
        "Authors": "By McMakin, Jacqueline",
        "Description": "",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Winston Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    }
]