[
    {
        "Title": "The Dashwood Sisters' Secrets of Love",
        "Authors": "By Rushton, Rosie",
        "Description": "The Walker sisters have always lived a privileged life in their beloved Holly House in Sussex. Even though their father, Max Walker, has left the family to live with his new macrobiotic-food-obsessed trophy wife, Pandora, he has always doted on his girls. But then one day, reality crashes down around them when Max has a heart attack and passes away, uncovering the truth that he was knee deep in debt. The Walkers discover that their home is actually in Pandora's name and she decides she wants it back. So the family has to uproot their lives and move to the seaside town of Norfolk in an old cottage. What happens then.?",
        "Category": " Young Adult Fiction , Social Themes , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "A Boy Aware: On Being Fifteen : The Selected Poems",
        "Authors": "By Dilenschneider, Geoffrey",
        "Description": "",
        "Category": " Poetry , Inspirational & Religious",
        "Publisher": "New Millenium",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Beautiful Game: Sixteen Girls and the Soccer Season That Changed Everything",
        "Authors": "By Littman, Jonathan",
        "Description": "Once nobody noticed Santa Rosa's Thunder. They were a ragtag team of girls who wanted to play soccer, and no one took them seriously. Their male coach expected little from his \"ladies, \" and their mediocre performance convinced them he was right.Then a kind of miracle happened. Emiria Salzmann, Thunder's new coach, a top player herself, knew what it took to win--discipline, relentless drills, thigh-burning sprints, and an inspired passing game. The girls hated it, but their coach never let up. Tough and determined, she showed them what it felt like to be winners--and they loved it. As the momentum grew with a string of victories, the girls thrived on the competition, believing they had the right stuff to become champions.They were right! With spirits soaring, Thunder won its league on the last day of the season and headed for the state cup, emerging not just as powerful athletes but as strong, confident, emotionally healthy human beings--champions in the game of soccer, and in the game of life.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "It Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Living the Simple Life: A Guide to Scaling Down and Enjoying More",
        "Authors": "By ST. James Elaine",
        "Description": "If you've thought about simplifying, but don't know where to begin, LIVING THE SIMPLE LIFE is the blueprint you need. And if you've already started to simplify, it will give you new insights and ideas for what to do next on your journey to a more balanced, peaceful life.In these pages, you'll discover how simplifying your life will:  Give you more time to play and relax  Make you more productive at work  Unleash your creativity and open up new possiblities  Free up time for you to face the challenges you've been avoidingScale down. Enjoy More.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Little Scarlet: An Easy Rawlins Mystery",
        "Authors": "By Mosley, Walter",
        "Description": "Easy Rawlins returns to solve a mystery set amid the flames of the hottest summer L.A. has ever seen.Just after devastating riots tear through Los Angeles in 1965 - when anger is high and fear still smolders everywhere - the police turn up at Easy Rawlins's doorstep. He expects the worst, as usual. But they've come to ask for his help.A man was wrenched from his car by a mob at the riots' peak and escaped into a nearby apartment building. Soon afterward, a redheaded woman known as Little Scarlet was found dead in that building - and the fleeing man is the obvious suspect. But the man has vanished.The police fear that their presence in certain neighborhoods could spark a new inferno, so they ask Easy Rawlins to see what he can discover. The vanished man is the key, but he is only the beginning. Easy enlists the help of his longtime friend Mouse to break through the shroud. And what Easy finds is a killer whose rage, like that which burned in the city for weeks, is intrinsically woven around deep-set passions - feelings echoed within Easy himself.Rawlins's hunt for the killer reveals a new city emerging from the ashes, with the promise of a new life for Easy, Mouse, and his old friends Jackson Blue and Jewelle.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Quilt",
        "Authors": "By Jonas, Ann",
        "Description": "The young narrator's new quilt is made from her baby pajamas, her first curtains, her crib sheets, an old shirt, and other odds and ends and is so fanciful that it begins to look like a town",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Puffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Coping with Lymphedema",
        "Authors": "By Swirsky, Joan and Nannery, Diane Sackett",
        "Description": "An estimated 100 million people around the world suffer from this lifelong condition, a result of damage to the lymphatic system. It causes extreme swelling of a limb or other part of the body along with pain, immobility, disfigurement, an increased susceptibility to infection, and a variety of other symptoms that make many people feel self-conscious and depressed.",
        "Category": " Medical , Endocrinology & Metabolism",
        "Publisher": "Avery Publishing Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Smart About the First Ladies: Smart About History",
        "Authors": "By Weber, Jill (ILT), Regan, Dana (ILT), Buller, Jon, Schade, Susan, and Warner, Sally (ILT)",
        "Description": "For every president, there has been a first lady, sometimes two. Who were these women? How has the job of First Lady (unpaid and unelected) changed over time? The Smart About format proves just right for covering history in an easy, appealing way.",
        "Category": " Juvenile Nonfiction , History , United States , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Civil War Sub: the Mystery of the Hunley: The Mystery of the Hunley (Penguin Young Readers, Level 4)",
        "Authors": "By Sofo, Frank (ILT) and Jerome, Kate Boehm",
        "Description": "In 1864, during the Civil War, the C.S.S. Hunley became the first submarine in the world to sink an enemy ship. The Hunley and its crew mysteriously vanished. What happened on that cold winter night? After over a century, scientists finally have some of the answers.",
        "Category": " Juvenile Nonfiction , Social Science , Archaeology",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Out of the Dark (W.I.T.C.H. Chapter Book #8)",
        "Authors": "By Komorn, Julie",
        "Description": "Will, Irma, Taranee, Cornelia, and Hay Lin (W.i.t.c.h.) are five ordinary friends with an extraordinary secret: they each have the power to control a natural element-air, water, fire, earth, and finally, the mysterious \"Heart of Candracar.\" The girls use their powers to guard against evil and to uncover the truth behind mysterious portals leading to other worlds. Between school, family, and a new interest in boys, these girls had enough to worry about! But now they have the secret to turn into a group of friends with special powers . . . destined to fight the evil Prince Phobos in the magic world of Metamoor.W.i.t.c.h. combines fashion and fantasy, magic and middle school, heroism and humor, friendship and family, teamwork and transformation, in a wholesome mix proven to charm the tween girl market.Introducing a hybrid format that combines four-color comics with a traditional chapter book format.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Hyperion Book",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Inside Cuba Today",
        "Authors": "By Ward, Fred",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1979"
        }
    },
    {
        "Title": "Oracle Web Applications: PL/SQL Developer's Intro: Developer's Introduction",
        "Authors": "By Odewahn, Andrew",
        "Description": "This compact guide provides the jump-start Oracle developers need to make the transition from traditional programming to the development of useful Web applications for Oracle8i. Even readers who start out knowing nothing about HTML, PL/SQL, or Oracle's other tools will learn how to create simple Web applications in a matter of days. The book focuses on Oracle8i, but also covers Web development for earlier Oracle versions (Oracle8 and Oracle7).Background:The explosion in the use of the Internet and the Web has resulted in a whole new way of doing business. Developers who only yesterday were using COBOL to write accounts payable systems are now being asked to create a broad range of new Internet-based applications ranging from electronic commerce (e-commerce) Web sites to internal data warehouses to enterprise resource planning (ERP) systems. Unfortunately, the filesystem architectures of most Web systems aren't up to the task. The new breed of Web applications -- which are quickly becoming critical resources that companies need to survive -- demand a platform that provides production-quality tools for content management, application development, and application integration. And current Web techniques are inadequate in many ways.Oracle8i, Oracle's \"Internet database,\" gives Web developers a way to build Web technology on top of a relational database, rather than on a traditional filesystem. With Oracle8i, companies can apply well understood, reliable, production-quality database methodologies to Web content management. Oracle8i also supports a wide variety of application development platforms and tools that are tightly integrated to the core database. Finally, Oracle8i supports technologies that help companies tie their Web-based applications into legacy applications.There is a lot to learn in Oracle8i. Not only does it enhance basic database features, it introduces Java and a variety of Web development tools. Oracle8i provides a soup-to-nuts platform for Web site and Web application development that extends traditional database concepts to Web content. It replaces the traditional filesystem used by most Web servers with a database management system.Many users are intimidated by the vast array of new technologies in Oracle8i. And yet, they are under pressure to use these technologies to build complex Web applications right now. This book gives such users a way to start using Oracle8i immediately to create useful Web applications. It is a concise, easy-to-read guide to the basic technologies developers need to understand in order to build Web applications.Contains:The book describes the following Web development tools:PL/SQL-- a structured programming language that combines procedural constructs and standard SQL. It offers such features as cursors, loops, conditional and sequential control statements, exception handlers, records, tables, and constructs for developing modular code (functions, procedures, and packages). PL/SQL Toolkit -- a set of PL/SQL packages supplied by Oracle for use in developing Web applications.HTML -- an ASCII-based markup language used to create Web pages.WebDB -- A software system for building, monitoring, and creating content-driven Web sites; it allows users to use a Web browser to access and store information in the Oracle8i database.Oracle Application Server (OAS) -- an extensible Web server that uses plug-in programs called cartridges to allow database-integrated Web systems to be developed in a variety of languages (e.g., PL/SQL, Java, Perl).XML -- An emerging standard for creating self-describing documents. It is similar to HTML but allows you to create your own markup tags. XML is expected to be a key technology in electronic commerce systems.The book also presents several fully realized sample Web applications that w",
        "Category": " Computers , Database Management , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "On Our Way to Beautiful: A Family Memoir",
        "Authors": "By Young, Yolanda",
        "Description": "Yolanda Young grew up in the rambunctious but God-fearing town of Shreveport, Louisiana, where people prayed as hard as they gambled and loved as hard as they fought. Her neighborhood’s unpaved streets were lined with shotgun shacks, but lack of money didn’t stop her family from teaching her bedrock values.In this warm and heartfelt memoir, Yolanda Young unfolds stories of innocence and experience, wisdom and redemption, tragedy and deliverance: the strong lessons on which her life and her faith are based.  Bracing, funny, and always uplifting, On Our Way to Beautiful will resonate with readers looking for stories of inspiration and faith told with wit and verve. It marks the debut of a fresh new voice of startling wisdom.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Nature by design (Knowing nature)",
        "Authors": "By Brooks, Bruce",
        "Description": "",
        "Category": "",
        "Publisher": "Farrar Straus Giroux in association with Thirteen/WNET",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "America's Cup 1987: The Official Record",
        "Authors": "By Ross, Bob, Fisher, Bob, and Royal Perth Yacht Club (Perth, W. A.) (COR)",
        "Description": "Shows how America recaptured the title to yachting's premier competition and reveals the punishing realities of the victory over Australia",
        "Category": "",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "7.31",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Timelines of War: A Chronology of Warfare from 100,000 Bc to the Present",
        "Authors": "By Franck, Irene M. and Brownstone, David",
        "Description": "War continues to be one of humankind's most enduring activities. We celebrate the end of the Cold War and the emergence of a new world order - and then see the explosion of civil wars in Bosnia and Georgia, the resurgent conflicts in Angola and Rwanda, growing insurrection in northern India, and the ever-present threat of war around the globe.Timelines of War is the first-ever chronology of all of the wars, revolutions, battles, leaders, and weapons that have played such an enormous role in human history. From the rise of Assyria, the siege of Troy, and the century-long Chinese-Hun war two thousand years ago to the massive world wars, revolutions, and superpower conflicts that have plagued our century; from Caesar and Genghis Khan to Napoleon and Schwarzkopf; and from the invention of the slingshot to the creation of the atom bomb, this magnificent volume displays, at a glance, significant world events and war-related developments from 100,000 BC to the present day.Organized in an easy-to-follow format that allows readers to link or compare events and people across Europe, the Middle East, Africa, North and South America, Asia, and the Pacific in any given period, Timelines of War is a sweeping overview of history that highlights fascinating developments in military science and technology as well as important landmarks in the quest for peace.Unparalleled in both its vast scope and precise detail - and containing extensive chronologies of major modern conflicts like the American Civil War and World War II - Timelines of War presents a remarkable panorama of human history, both at war and at peace.",
        "Category": " History , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "7.64",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Abs Diet Eat Right Every Time Guide",
        "Authors": "By Zinczenko, David and Spiker, Ted",
        "Description": "Smart Eating Choices – Made Simple! TENS OF THOUSANDS OF AMERICANS HAVE CHANGED THEIR BODIES – AND THEIR LIVES – with the help of The Abs Diet, the New York Times bestseller from David Zinczenko, editor-in-chief of Men's Health magazine.The principles of The Abs Diet are simple: Eat more healthy food – six delicious meals a day – and crowd out the bad stuff that's making you fat. The Abs Diet has been proven to strip off 10, 15, even 20 pounds of flab – from your belly first – in six weeks or less.Now, Zinczenko makes eating smart and healthy easy with this eye opening portable weight-loss manual, THE ABS DIET EAT RIGHT EVERY TIME GUIDE. This on-the-go guide pinpoints the foods you should choose to burn away belly fat no matter where you are – at home, in the supermarket, even at the fast-food counter. And it reveals the hidden killers that are adding inches to your waistline and taking years off your life!Discover these amazing weight-loss secrets: Should you toast a bagel or an English muffin? Did you know that making the wrong choice will cost you 150 extra calories? What's healthier – a bean burrito or a taco salad? Would you believe the healthy salad will pile 130 more calories onto your plate? Which will make you fatter – a Whopper or a Big Mac? You'll be stunned to discover the shocking truth! Learn why a hot fudge sundae is a treat you should eat, why potato chips are better for you than french fries, and why Swiss cheese is three times healthier than Cheddar. You don't have time for complicated plans or fancy recipes. In THE ABS DIET EAT RIGHT EVERY TIME GUIDE, Zinczenko tells you how to strip away belly fat in every situation – from the frozen food aisle to the deli, from a five-star restaurant to the drive-thru. On-the-go eating doesn't have to end up on your gut.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "A Cry from the Dark: A Novel of Suspense",
        "Authors": "By Barnard, Robert",
        "Description": "Master of mystery Robert Barnard, internationally acclaimed for his suspenseful, witty literary gems, cleverly mixes past and present in A Cry from the Dark, an intriguing tour de force sweeping from 1930s Australia to contemporary London. Bettina Whitelaw has come a long way from her childhood in the little outback town of Bundaroo, Australia. Many years have passed, a lifetime really, but she's never forgotten what happened there on the evening that changed her life forever.How could she forget the school dance, her taunting classmates, dancing with the strange but brilliant English boy, Hughie Naismyth? How could she forget what happened next, when, overheated and exhilarated by the music and the moment, she wandered off alone into a secluded, wooded area? Now a renowned, elderly author living in London's elegant Holland Park, Bettina faces a flood of memories as she works on her memoirs, even though her focus is more on the frightening things that are happening today. Someone has recently entered her home and gone through her desk. The intruder is clearly not an ordinary burglar. It must be someone she knows. She's been a little lax in handing out keys, so the suspects are many -- her nephew, Mark; her agent, Clare; her friends, Peter or Katie. Or it could be someone else.What does Bettina possess that this person would want to steal? A puzzle that at first seems mildly disturbing soon turns deadly serious. Someone is willing to kill -- but why? Does the answer rest in Bundaroo or nearer to home? A Cry from the Dark shows us vintage Robert Barnard as he slyly lays the clues that lead to his trademark surprise -- and poignant -- ending.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Four Spirits",
        "Authors": "By Naslund, Sena Jeter",
        "Description": "From the acclaimed author of the national bestseller Ahab's Wife comes an inspiring, brilliantly rendered new novel of the awakening conscience of the South and of an entire nation.Written with the same scope and emotional depth as her previous award-winning novel, Four Spirits is set in Sena Jeter Naslund's home city of Birmingham, Alabama, a city that in the 1960s was known as Bombingham. Naslund brings to life this tumultuous time, weaving together the lives of blacks and whites, civil rights advocates and racists, and the events of peaceful protest and violent repression, to create a tapestry of American social transformation.Stella Silver is an idealistic, young white college student brought up by her genteel, mannered aunts. She first witnesses the events of the freedom movement from a safe distance but, along with her friend Cat Cartwright, is soon drawn into the mounting conflagration. Stella's and Cat's lives are forever altered by their new friendships with other committed freedom fighters.A student at a black college, Christine Taylor is inspired to action by the examples of Rosa Parks, Martin Luther King Jr., and the Reverend Fred Shuttlesworth. She courageously struggles to balance her family responsibilities, education, and work with the passions and dangers of the demonstrations. Her friend Gloria Callahan, a gifted young cellist and descendant of a runaway slave, tries to move beyond her personal shyness and family coziness to enter a wider circle, including blacks and whites, men and women, all involved with the protests. Lionel Parrish, teacher, preacher, and peddler of funeral insurance, battles his own demons of lust and self-preservation, while New York activist Jonathan Green gives up a promising career as a pianist to work for racial justice in the South.These characters all add their voices to the chorus that makes up this symphony of innocent children and the mythic elderly, the devoutly religious and the skeptical humanist, the wealthy and the poor, the city and the country. Poignant and evocative, rich in historical detail, and filled with the humanity that is the hallmark of Naslund's fiction, Four Spirits is a compelling tale that transcends tragedy and evokes redemptive triumph.",
        "Category": " Fiction , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Accidental Immigrant: America Observed",
        "Authors": "By Bouchier, David",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Mid Atlantic Productions",
        "Price Starting With ($)": "8.02",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "As the Romans Do: An American Family's Italian Odyssey",
        "Authors": "By Epstein, Alan",
        "Description": "A celebration of the character and style of one of the world's most spectacular cities! This vibrant insider's view of the most mature city on earth is the perfect companion for anyone who loves anything Italian. In 1995, after a twenty-year love affair with Italy, Alan Epstein fulfilled his dream to live in Rome. In As the Romans Do, he celebrates the spirit of this stylish, dramatic, ancient city that formed the hub of a far-flung empire and introduced the Mediterranean culture to the rest of the world. He also reveals today's Roman men and women in all their appealing contradictions: their gregarious caffe culture; inborn artistic flair; passionate appreciation of good food; instinctive mistrust of technology; showy sex appeal; ingrained charm and expressiveness; surprisingly unusual attitudes toward marriage and religion; and much, much more.",
        "Category": " Travel , Europe , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Civility",
        "Authors": "By Carter, Stephen L.",
        "Description": "A leading intellectual and scholar considers the causes and nature of the moral crisis in America today and offers ways in which families, individuals, and politicians can improve the country by adhering to basic principles of civility. Reprint. 35,000 first printing.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Bible Stories for Adults",
        "Authors": "By Morrow, James",
        "Description": "Morrow unabashedly delves into matters both sacred and secular in this collection of short stories buoyed by his deliciously irreverent wit. Among the dozen selections is the Nebula Award-winning “Bible Stories for Adults, No. 17: The Deluge.”",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Wild Magic: Book Two Of Fool's Gold (Fools Gold, 2)",
        "Authors": "By Fisher, Jude",
        "Description": "As magic returns to Elda, the rival lands of Istria and Eyra once again find themselves moving toward war, swordmaker Katla Aransen finds her ability to commune with the earth strenthening, and Katla's father Aran sets off on an expedition to the far north.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "DAW Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "You Don't Have to Be Rich: Comfort, Happiness, and Financial Security on Your Own Terms",
        "Authors": "By Chatzky, Jean Sherman",
        "Description": "One of America's most popular personal finance experts reveals how you can become happier at any income level through better money management  Millions of Americans have turned to Jean Chatzky for financial advice, thanks to her weekly appearances on NBC's Today and her column in Money magazine. Now, in You Don't Have to Be Rich, she analyzes the results of a unique survey in which she questioned 1,500 Americans about their financial attitudes and behaviors. She looks at how much money people actually do need to guarantee a happy, comfortable life. And gets down to the nitty-gritty, isolating behaviors that-if adopted-can significantly improve a life.  The results of this proprietary survey-conducted with the help of the Roper Center-are remarkable. Chatzky found that while a certain amount of money buys comfort, money can't make you happy-at least not in the way most people believe it can. But it can make you miserable, if you're managing it wrong. That's why it's time to make a change.  In her frank, engaging style, Chatzky explains how to \"own your money\" to create a happy and comfortable life. She outlines the financial habits of happy people and shows how anyone can be a part of this group, no matter what they earn. Filled with fresh insights and real life examples, You Don't Have to Be Rich reaffirms that finances don't have to be a source of stress and that living within your means can be extremely rewarding.",
        "Category": " Business & Economics , Personal Finance , Budgeting",
        "Publisher": "Portfolio Hardcover",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Wedding Dress",
        "Authors": "By Gibson, Clare",
        "Description": "No other garment is lavished with as much tought and attention as the dress a bride wears on her wedding day. This sentimental treasury of wedding gowns throughout history is a joyous source of inspiration, with sumptuous, full-color photographs that reveal every breathtaking detail. From the traditional to the sleekly contemporary, from elegant to girlishly innocent, from homespun to royally splendid, each wedding dress in these pages is simply unforgettable. It's the perfect gift for an engagement or bridal shower!",
        "Category": " Crafts & Hobbies , Fashion",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Love and Terror",
        "Authors": "By Herrick, William",
        "Description": "The story of the lives and disillusionment of three revolutionaries is told through a terrorist's notebook and interviews with a nameless journalist",
        "Category": " Fiction , General",
        "Publisher": "New Directions Publishing Corporation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "God and Ronald Reagan: A Spiritual Life",
        "Authors": "By Kengor, Paul",
        "Description": "Ronald Reagan is hailed today for a presidency that restored optimism to America, engendered years of economic prosperity, and helped bring about the fall of the Soviet Union. Yet until now little attention has been paid to the role Reagan's personal spirituality played in his political career, shaping his ideas, bolstering his resolve, and ultimately compelling him to confront the brutal -- and, not coincidentally, atheistic -- Soviet empire.In this groundbreaking book, political historian Paul Kengor draws upon Reagan's legacy of speeches and correspondence, and the memories of those who knew him well, to reveal a man whose Christian faith remained deep and consistent throughout his more than six decades in public life. Raised in the Disciples of Christ Church by a devout mother with a passionate missionary streak, Reagan embraced the church after reading a Christian novel at the age of eleven. A devoted Sunday-school teacher, he absorbed the church's model of \"practical Christianity\" and strived to achieve it in every stage of his life.But it was in his lifelong battle against communism -- first in Hollywood, then on the political stage -- that Reagan's Christian beliefs had their most profound effect. Appalled by the religious repression and state-mandated atheism of Bolshevik Marxism, Reagan felt called by a sense of personal mission to confront the USSR. Inspired by influences as diverse as C.S. Lewis, Whittaker Chambers, and Aleksandr Solzhenitsyn, he waged an openly spiritual campaign against communism, insisting that religious freedom was the bedrock of personal liberty. \"The source of our strength in the quest for human freedom is not material, but spiritual,\" he said in his Evil Empire address. \"And because it knows no limitation, it must terrify and ultimately triumph over those who would enslave their fellow man.\"From a church classroom in 1920s Dixon, Illinois, to his triumphant mission to Moscow in 1988, Ronald Reagan was both political leader and spiritual crusader. God and Ronald Reagan deepens immeasurably our understanding of how these twin missions shaped his presidency -- and changed the world.",
        "Category": " Political Science , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Shield of the Republic: The United States Navy in an Era of Cold War and Violent Peace 1945-1962",
        "Authors": "By Isenberg, Michael T.",
        "Description": "Michael T. Isenberg has chronicled, in the first of a projected two-volume study, the historic institution of the United States Navy in the Cold War era. Shield of the Republic, a definitive work on the era, demonstrates both a narrative sweep and a command of style that are rare in works of modern history.The overarching themes of the book are the emergence of the two superpower nations between 1945 and 1962 and an examination of the technologies that rang down the curtain on the Mahanian age of sail. At the conclusion of World War II, naval leaders confronted a drastically redrawn world and, like the rest of the American people, found the adjustment to the bitter, suspicion-riddled years of the 1950s to be both challenging and unsettling.The Korean War, fought largely with World War II equipment, settled much of the debate over what new naval roles and capacities were to be, and emphasized the nature of Pax Americana, which, whatever else the phrase implied, meant American naval hegemony on the oceans of the world, a military dominance that came to its bone-chilling conclusion during the Cuban Missile Crisis of 1962.Shield of the Republic is the epic story of these dramatic seventeen years following the Japanese surrender, a time when the Navy struggled to find its strategic footing in the shadow of the atomic bomb, on the slippery ground of interservice rivalry, and amid the frightening realities of superpower conflict. Naval leaders, from the flinty Ernest King to the brilliant Forrest Sherman to the hard-driving Arleigh Burke, battled to keep their beloved service on an even keel while changing its makeup to meet the numerous and unexpected problems of the new era.Unlike many naval histories that consider the Navy merely as an adjunct of American international relations, Shield of the Republic examines the Navy from the inside out and from the keel plates up. Particular attention is paid the rapid and bewildering acceleration of naval technology, from the lurking nuclear ballistic missile submarine to the missile-firing destroyer to the marvels of supersonic jet aircraft, and it is in these descriptions where Isenberg's language soars. The men who worked with these technological wonders receive full treatment, from the youngest boot to the saltiest admiral, from the women who were for decades relegated to support positions, to the most powerful political leaders, like Harry Truman (who liked sailors but distrusted most admirals), and John Kennedy (whose much-vaunted wartime naval adventures were a bit short of what they were cooked up to be).And wherever the bows of the Cold War Navy cut water, they invariably brought with them American economic imperialism - the self-assurance of the only nation to emerge practically unscathed from World War II. The unique global reach of this Cold War Navy meant that the first taste of Americanism which many foreigners ever had often came in Navy blue and gold.Using the Navy as a fitting symbol for American foreign policy during these years, Michael T. Isenberg has created a sweeping saga, an enduring work, that will be appreciated both by naval experts and by general readers alike.",
        "Category": " Political Science , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "The Garden Design Book",
        "Authors": "By Merser, Cheryl and Garden Design Magazine (EDT)",
        "Description": "For years Garden Design magazine has been bringing its unique vision of the garden to a smart, savvy readership through its lush, arrestingly beautiful photography and thought-provoking, informative articles. Now Garden Design captures this wisdom and style in a book that delights the senses and enriches the mind. This book of visions for the new gardener. The man or woman who --  like most of us -- longs to create a special place within the world of nature.Step-by-step, from essential design elements to offbeat flourishes, from the all-important conception of an overarching design plan (the hallmark of a successful garden, be it minimal and Japanese in style or an exuberant English countryside profusion of color and shape) to the basics of planting and cultivating, from the habits and personalities of both rare and common plants to suggestions on the best ways to make the most of limited growing space (crucial to land-deprived city dwellers). Cheryl Merser and the editors of Garden Design magazine explain the new garden: What is it, exactly? And what makes it grow?From first seed to first frost -- season after season -- The Garden Design Book takes us through the sometimes complex, sometimes blessedly simple, but always rewarding experience that is gardening.",
        "Category": " Gardening , Garden Design",
        "Publisher": "Harper Design",
        "Price Starting With ($)": "8.74",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Reader's Digest Complete Guide to the Bible: An Illustrated Book-by-Book Companion to the Scriptures",
        "Authors": "By Reader's Digest Association (EDT)",
        "Description": "Gathers background information about each chapter of the Bible, explains unfamiliar words and phrases, and includes a timeline of Biblical events",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Flower Arranging",
        "Authors": "By Newdick, Jane and Sutherland, Neil",
        "Description": "A guide to creating English-style floral arrangements for all occasions",
        "Category": "",
        "Publisher": "Portland House",
        "Price Starting With ($)": "8.43",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Prescription for Nutritional Healing: The A-to-Z Guide to Supplements",
        "Authors": "By Balch, Phyllis A. and Balch, James F., M.D.",
        "Description": "Prescription for Nutritional Healing, now in its third edition, has long been America's bestselling book on natural health, with nearly 6 million copies in print. Prescription for Nutritional Healing: The A-to-Z Guide to Supplements draws on that respected resource to present authoritative information about some three hundred fifty of the most important supplements available today in a handy, pocket-sized format. Revised and expanded from the first edition, which sold nearly 400,000 copies, it covers how these supplements work, how to use them, and what to look for when choosing supplement products. Here is a straightforward, easty-to-understand guide to vitamins, minerals, amino acids, enzymes, antioxidants, phytochemicals, herbs, and more.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Avery Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Chesapeake: A Portrait of the Bay Country (Photography)",
        "Authors": "By James A Warner",
        "Description": "",
        "Category": "",
        "Publisher": "E.R. Hostetter",
        "Price Starting With ($)": "26.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Focus on the Family Complete Book of Baby and Child Care",
        "Authors": "By Reisser, Paul C.",
        "Description": "An extensive child-care volume with full-color illustrations, photos, and foreword by Dr. James Dobson. Developed and approved by the Physicians Resource Council, this volume covers everything from preparing for parenthood to your child's adolescent years. It also addresses special topics such as child abuse, discipline, and caregivers. A thorough medical reference section includes information on orthopedics, emergency care, and first aid. From a source they can trust, parents will find sound advice and peace of mind throughout the development of their children. “I'm particularly excited to be able to introduce you to this wonderful new offering. This book is chocked full of practical, specific guidance on every aspect of the child-rearing process. This well-researched volume offers detailed advice from more than 50 of the country's most highly respected physicians and medical authorities. Some have appeared as guests on theFocus on the Family broadcast, and all are members of Focus' prestigious Physicians Resource Council.” —From the foreword by Dr. James Dobson.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "8.04",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Waterland",
        "Authors": "By Swift, Graham",
        "Description": "Set in the bleak Fen Country of East Anglia, and spanning some 240 years in the lives of its haunted narrator and his ancestors, Waterland is a book that takes in eels and incest, ale-making and madness, the heartless sweep of history and a family romance as tormented as any in Greek tragedy.\"Waterland, like the Hardy novels, carries with all else a profound knowledge of a people, a place, and their interweaving.... Swift tells his tale with wonderful contemporary verve and verbal felicity.... A fine and original work.\"--Los Angeles Times",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Samurai Girl: Real Bout High School, Book 5",
        "Authors": "By Saiga, Reiji, Inoue, Sora, and Kennedy, Ai",
        "Description": "Ryoko Mitsurugi, the Samurai Girl, is the top fighter and the most popular girl at her martial arts high school until bad boy Shizuma Kusanagi transfers in from Kansai and turns the school into a non-stop battleground.",
        "Category": " Young Adult Fiction , Comics & Graphic Novels , General",
        "Publisher": "Tokyopop",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "The Ralph Nader Reader",
        "Authors": "By Nader, Ralph",
        "Description": "Four generations of Americans have come to associate Ralph Nader with the political issues that have defined our age, be it car safety in the 1960s or the anti-WTO demonstrations that recently shut down Seattle. His work has successfully shaped the Left, increased government accountability, made possible new laws, and served as a powerful check against abuses of corporate power. In this landmark collection, the essays that reveal the intellectual, social, and political underpinnings of this legendary citizen advocate are brought together for the first time.In The Ralph Nader Reader, we follow the trajectory of Nader's concerns from 1956 to the present and his personal evolution from consumer advocate to presidential candidate. The result is a monumental book, an invaluable resource for anyone interested in a unique vision of democracy that places citizenship over consumerism, communities over corporations, and public interest over private power.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Using Microsoft Word and Excel in Office 97 (SPECIAL EDITION USING)",
        "Authors": "By Person, Ron, Winter, Rick, and Tidrow, Rob",
        "Description": "Offers in-depth coverage of intermediate and advanced features of Word and Excel, for those already familiar with these programs. Material is arranged by task, with sections on editing and printing tools, mail merging, using tables and lists, inserting graphics, and Word's advanced editing features. Other subjects are working with Excel spreadsheets and charts, manipulating Excel data, integrating Word and Excel, and using Word and Excel files on the Internet. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Computers , Enterprise Applications , General",
        "Publisher": "Que Pub",
        "Price Starting With ($)": "9.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Chronicles of the Cursed Sword, Vol. 2",
        "Authors": "By Beop-Ryong, Yuy",
        "Description": "Rey Yan, a warrior who carries a powerful demonic sword, the sorceress Shyao, and King Jaryoon travel to the capital to learn why Jaryoon's brother, Emperor Moosungje, has suddenly led his once-peaceful country into war against his neighbors.",
        "Category": " Young Adult Fiction , Comics & Graphic Novels , General",
        "Publisher": "Tokyopop",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Madame Hillary: The Dark Road to the White House",
        "Authors": "By Tyrrell, R. Emmett, Jr. and Davis, Mark W.",
        "Description": "Tyrrell (editor-in-chief,  American Spectator ) and Bush speechwriter Davis, comparing the New York senator and former first lady to Madame Mao, warn that Hillary Clinton is plotting to (re)take the White House in order to complete the 1960s left-wing radical conquest of all of America's institutions. She, along with husband Bill, \"controls an enormous personal and political machine\" which they use to control the Democratic Party as their \"personal prefecture.\" Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , American Government , Legislative Branch",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Travel Team",
        "Authors": "By Lupica, Mike",
        "Description": "The #1 Bestseller! Twelve-year-old Danny Walker may be the smallest kid on the basketball court -- but don't tell him that. Because no one plays with more heart or court sense. But none of that matters when he is cut from his local travel team, the very same team his father led to national prominence as a boy. Danny's father, still smarting from his own troubles, knows Danny isn't the only kid who was cut for the wrong reason, and together, this washed-up former player and a bunch of never-say-die kids prove that the heart simply cannot be measured. For fans of The Bad News Bears, Hoosiers, the Mighty Ducks, and Mike Lupica's other New York Times bestselling novels Heat, The Underdogs, and Million-Dollar Throw, here is a book that proves that when the game knocks you down, champions stand tall.",
        "Category": " Juvenile Fiction , Family , Multigenerational",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Flavor of the Week",
        "Authors": "By Shaw, Tucker",
        "Description": "Cyril Bartholomew isn't exactly everyone's idea of a dream date he's a little on the heavy side.  Not that he gets pushed around or anything, but it does cause him to keep one very important secret from everyone:  he loves to cook.  The only person who knows this secret is Cyril's best friend, Chris.  Chris is just about the opposite of Cyril-a track star and really attractive in a cool, rebellious way.   Cyril isn't at all jealous of Chris, though…until the day that Chris decides he is interested in Rose Mulligan, Cyril's lab partner. Flavor of the Week is a classic love triangle between three very unclassic teens, with lots of delicious food courses in between.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Disney Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Miriam's Song: A Memoir",
        "Authors": "By Mathabane, Mark",
        "Description": "The powerful memoir of a young black woman coming of age in South Africa amid the violence of apartheid, beautifully written by her brother, the bestselling author of Kaffir Boy.  Mark Mathabane first came to prominence with the publication of Kaffir Boy, which became a New York Times bestseller.  His story of growing up in South Africa was one of the most riveting accounts of life under apartheid. Mathabane's newest book, Miriam's Song, is the story of Mark's sister, who was left behind in South Africa. It is the gripping tale of a woman -- representative of an entire generation -- who came of age amid the violence and rebellion of the 1980s and finally saw the destruction of apartheid and the birth of a new and democratic South Africa.  Mathabane writes in Miriam's voice, based on stories she told him, but he has re-created her unforgettable experience as only someone who also lived through it could. The immediacy of the hardships that brother and sister endured -- from daily school beatings to near-overwhelming poverty -- is balanced by the beauty of their childhood observations and the true affection that they have for each other. Miriam emerges as both an innocent child drawn into the war against apartheid and a strong woman forever changed by the struggles, brutality, and politics of the world around her; Mark emerges once more as a writer of extraordinary ability, sensitivity, and insight.  Miriam's Song is memoir writing at its finest. With its courage, determination, resilience, hope, and faith, it is a truly inspirational story, spectacularly told.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Young children and their drawings",
        "Authors": "By Di Leo, Joseph H.",
        "Description": "",
        "Category": "",
        "Publisher": "Brunner/Mazel",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Month-by-month File-folder Word Walls: 26 Reproducible Patterns for Vocabulary-Building Word Walls That Help Kids Become Better Readers, Writers, and Spellers",
        "Authors": "By Spann, Mary Beth",
        "Description": "Build reading and writing skills with instant patterns for 26 easy-to-make portable word walls?on favorite topics around the year, such as back-to-school, pilgrims, 100th Day, baby animals, butterflies, and more! Just paste these adorable patterns onto file folders and fill them with words! Students will turn to these irresistible learning tools again and again for reading, writing, and spelling help. A great way to boost kids’ vocabulary?independently! For use with Grades PreK-2.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "6.19",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "A Guide to Reading the Entire Bible in One Year",
        "Authors": "By Garrison, Webb B.",
        "Description": "",
        "Category": "",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Good Faith",
        "Authors": "By Smiley, Jane",
        "Description": "And is Felicity - winning, free-spirited (and already married) - really the one he's been waiting for?From the Pulitzer Prize-winning author of A Thousand Acres, Good Faith is a masterly novel about some very American seductions: money, sex and real estate.",
        "Category": " Fiction , General",
        "Publisher": "Faber & Faber Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Living Textures: A Creative Guide to Combining Colors and Textures in the Home",
        "Authors": "By Sorrell, Katherine",
        "Description": "Luxurious silks. Rich red stained glass. Natural oak. Burnished brass. Whether it's hushed hues and cool Carrara or dynamic density and vibrant verdigris, contemporary interior design is about texture. The feel of a room is just as important as the look of it, and knowing how to blend the right combination of materials is key to achieving this delicate balance. Living Textures is an inspiring guide to designing a practical and beautiful interior space without the help (and cost) of a decorator. Get the creative juices flowing with two great books in one: a main book filled with expert advice and detailed full-color spreads, and a swatch book of 600 varying textures to choose from. Both books are easily removable?just toss in a tote for quick fabric decisions on the fly or stow both securely together in the case. The two books work jointly in an utterly approachable way to answer the what, where, and most importantly, how of achieving gorgeous results for every room in the house. From walls to sofa to floor, weaving texture and life into a room has never been easier with the help of this one-stop resource for decorating.",
        "Category": " House & Home , Decorating & Furnishings",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "I Am David",
        "Authors": "By Holm, Anne and Kingsland, L. W.",
        "Description": "David's entire twelve-year life has been spent in a grisly prison camp in Eastern Europe. He knows nothing of the outside world. But when he is given the chance to escape, he seizes it. With his vengeful enemies hot on his heels, David struggles to cope in this strange new world, where his only resources are a compass, a few crusts of bread, his two aching feet, and some vague advice to seek refuge in Denmark. Is that enough to survive? David's extraordinary odyssey is dramatically chronicled in Anne Holm's classic about the meaning of freedom and the power of hope.",
        "Category": " Juvenile Fiction , Social Themes , Runaways",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Perreaus and Mrs. Rudd: Forgery and Betrayal in Eighteenth-Century London",
        "Authors": "By Andrew, Donna T. and McGowen, Randall",
        "Description": "The Perreaus and Mrs. Rudd tells the remarkable story of a complex forgery uncovered in London in 1775. Like the trials of Martin Guerre and O.J. Simpson, the Perreau-Rudd case—filled with scandal, deceit, and mystery—preoccupied a public hungry for sensationalism. Peopled with such familiar figures as John Wilkes, King George III, Lord Mansfield, and James Boswell, this story reveals the deep anxieties of this period of English capitalism. The case acts as a prism that reveals the hopes, fears, and prejudices of that society. Above all, this episode presents a parable of the 1770s, when London was the center of European finance and national politics, of fashionable life and tell-all journalism, of empire achieved and empire lost. The crime, a hanging offense, came to light with the arrest of identical twin brothers, Robert and Daniel Perreau, after the former was detained trying to negotiate a forged bond. At their arraignment they both accused Daniel's mistress, Margaret Caroline Rudd, of being responsible for the crime. The brothers' trials coincided with the first reports of bloodshed in the American colonies at Lexington and Concord and successfully competed for space in the newspapers. From March until the following January, people could talk of little other than the fate of the Perreaus and the impending trial of Mrs. Rudd. The participants told wildly different tales and offered strikingly different portraits of themselves. The press was filled with letters from concerned or angry correspondents. The public, deeply divided over who was guilty, was troubled by evidence that suggested not only that fair might be foul, but that it might not be possible to decide which was which. While the decade of the 1770s has most frequently been studied in relation to imperial concerns and their impact upon the political institutions of the day, this book draws a different portrait of the period, making a cause célèbre its point of entry. Exhaustively researched and brilliantly presented, it offers both a vivid panorama of London and a gauge for tracking the shifting social currents of the period.",
        "Category": " History , Europe , General",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Terror and Liberalism",
        "Authors": "By Berman, Paul",
        "Description": "A manifesto for an aggressive liberal response to terrorist attacks. One of our most brilliant public intellectuals, Paul Berman has spent his career writing on revolutionary movements and their totalitarian aspects. Here he argues that, in the terror war, we are not facing a battle of the West against Islama clash of civilizations. We are facing, instead, the same battle that tore apart Europe during most of the twentieth century, only in a new version. It is the clash of liberalism and its enemiesthe battle between freedom and totalitarianism that arose in Europe many years ago and spread to the Muslim world. The author considers the wars against fascism and communism from the past, and draws cautionary lessons. But he also draws from those past experiences a liberal program for the presenta program that departs in fundamental respects from the policies of the Bush administration.",
        "Category": " Political Science , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Don't Look Back",
        "Authors": "By Fossum, Karin and David, Felicity",
        "Description": "Meet Inspector Sejer: smart and enigmatic, tough but fair. At the foot of the imposing Kollen Mountain lies a small, idyllic village, where neighbors know neighbors and children play happily in the streets. But when the body of a teenage girl is found by the lake at the mountaintop, the town's tranquility is shattered forever. Annie was strong, intelligent, and loved by everyone. What went so terribly wrong? Doggedly, yet subtly, Inspector Sejer uncovers layer upon layer of distrust and lies beneath the town's seemingly perfect façade. Critically acclaimed across Europe, Karin Fossum's Inspector Sejer novels are masterfully constructed, psychologically convincing, and compulsively readable. They evoke a world that is at once profoundly disturbing and terrifyingly familiar.",
        "Category": " Fiction , Literary",
        "Publisher": "HarperVia",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Double-Digit Growth: How Great Companies Achieve It--No Matter What",
        "Authors": "By Treacy, Michael",
        "Description": "The bestselling author of The Discipline of Market Leaders reveals how companies can achieve sustained growth.  In their 1995 blockbuster The Discipline of Market Leaders, Michael Treacy and Fred Wiersema explained how great companies dominated their markets by offering superior value propositions. Now Treacy is back with an equally groundbreaking book-revealing how great companies master growth each year and how all businesses can identify and exploit opportunities for increased revenues, gross margins, and profits.  Treacy's main point is simple-it really is possible to grow your business by 10 percent or more, year after year, in good times and bad, without cheating. Great companies already know how to do it, and the rest of us can learn their strategies and do the same thing. Using case studies from industry leaders such as Dell Computer, Home Depot, and GE, he shows the five steps that are imperative to ensure growth:  ? keep the growth you have already earned ? look for growth where it's likely to be found ? take business from your competitors  Treacy believes that any business can grow at a consistent double-digit rate, and with Double-Digit Growth, managers and investors now have the tools to achieve that lofty goal and maintain corporate success.",
        "Category": " Business & Economics , Management",
        "Publisher": "Portfolio Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "A Question of Loyalty: Gen. Billy Mitchell and the Court-Martial That Gripped the Nation",
        "Authors": "By Waller, Douglas C.",
        "Description": "It had all the ingredients of a movie drama:a scandal that grips Washington and touches the White House; bitter battles and backroom intrigue at the highest levels of the U.S. military; glamorous women who make or break the careers of powerful men; a high-stakes trial with a celebrity defendant who captures the nation's attention ...A Question of Loyalty plunges into the seven-week Washington trial of Gen. William \"Billy\" Mitchell, the hero of the U.S. Army Air Service during World War I and the man who proved in 1921 that planes could sink a battleship. In 1925 Mitchell was frustrated by the slow pace of aviation development, and he sparked a political firestorm, accusing the army and navy high commands, and by inference the president, of treason and criminal negligence in the way they conducted national defense. He was put on trial for insubordination in a spectacular court-martial that became a national obsession during the Roaring Twenties.Douglas Waller has crafted a compelling new biography of the daring Billy Mitchell, a larger-than-life figure remembered as much for his outspokenness as for his innovations in the use of airpower. Waller has uncovered a trove of new letters, diaries, and confidential documents that have enabled him to capture in detail the drama of the court and to build a rich and revealing biography of Mitchell, one of the army's most controversial and flamboyant generals.Born to a millionaire Midwest family at the end of the 1870s, Mitchell joined the military at the age of eighteen and became one of its rising stars. During World War I, he led the largest armada of airplanes ever to attack an enemy force and returned to the United States a dashing young general with a chest full of medals and a radical vision of airpower as the only decisive instrument for future wars. But as the military shrank in the postwar years, Mitchell became increasingly impatient and vocal, lashing out at bureaucratic enemies he accused of impeding airpower's progress. After a tragic airship accident that shocked the nation, he publicly blasted the War and Navy Departments for their handling of aviation and was put on trial for it.A Question of Loyalty is a story about Washington politics, about love and betrayal, about heroes in battle, about determined lawyers and powerful military men pitted against one another in a courtroom.",
        "Category": " History , Military , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Breaking New Ground: American Women 1800-1848 (Young Oxford History of Women in the United States)",
        "Authors": "By Goldberg, Michael L.",
        "Description": "At the beginning of the 19th century, the Industrial Revolution lured many Americans from farms to the cities, creating new opportunities and new limitations for women. Some women were forced to look for work in the few occupations open to them, while others became full-time homemakers. Americans constructed new ways of thinking about the \"proper roles\" of women and men, with women as the moral educators in the private sphere of home and church while men participated in the public sphere of business and politics. By 1848, with the first women's rights convention at Seneca Falls, some women were exposing how these conditions and ideas kept them from achieving their highest potential. Even before this revolutionary event, women mill workers, African-American slaves, and others were resisting their oppressive conditions in a variety of ways. Michael Goldberg shows readers how women began to understand their ability to influence events through education, religion, and anti-slavery societies, and he discusses the hopes and concerns about marriage and courtship of both slave and free women, and how changes in personal relationships reflected changes in society at large. Emma Willard, one of the earliest proponents of expanded female education, Margaret Fuller, abolitionists Angelina and Sarah Grimkï¿½, Mother Seton, Lucy Stone, Harriet Beecher Stowe, and Lydia Maria Child are but a few who left their marks as women began breaking new ground.",
        "Category": " Young Adult Nonfiction , History , United States , 19th Century",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Karoo Boy",
        "Authors": "By Blacklaws, Troy",
        "Description": "After a freak accident, Douglas's twin brother is dead, and his family's fragmentation begins. His mother packs up their home in Cape Town and takes him to a tiny backwater town in the semi-desert Karoo region, where she withdraws into her painting. Douglas, a city kid in an insular community, makes only two friends: a beautiful girl named Marika, with her adventurous spirit and tyrannical father; and an old garage worker named Moses, with his junkyard Volvo and dreams of driving away to Cape Town.  Against the backdrop of the bitter conflict of 1970s South Africa, Douglas develops a clearer insight into himself and his place in the world, a world where dreams and reality meet in a surprising twist. Blazing with color and light, Karoo Boy offers a sensuous and lyrical evocation of South Africa that leaves a lasting impression and ultimately ends on a note of hope.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Sex, Lies, and the Media",
        "Authors": "By Everson, Eva Marie and Everson, Jessica",
        "Description": "This book is an essential resource in helping your children develop healthy, godly attitudes toward sexuality in an age when sex is a marketing tool for everything from clothing to toothpaste. Gleaning from interviews with various youth culture authorities, movie reviewers, youth pastors from across the nation, and teens themselves, the authors have created an informative book to educate and help  you guide your children through today's maze of sexual confusion. This book is peppered with statistics, teen language and context, and facts about the media's promotion of sexual freedom that destroys the sanctity that makes marital sex a special gift from God.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "David C. Cook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Once Upon a Marigold",
        "Authors": "By Ferris, Jean",
        "Description": "In the style of The Princess Bride, a hilarious and clever tale follows Christian, who, while spying on the royal family, saves the life of Princess Marigold and falls madly in love with her, but a devious plot devised by her own mother, the Queen, to take over the kingdom threatens to destroy them. Jr Lib Guild. An ALA Notable Children's Book & Best Book for Young Adults. Reprint.",
        "Category": " Juvenile Fiction , Royalty",
        "Publisher": "Harcourt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Harrap's Spanish and English Dictionary",
        "Authors": "By Harraps",
        "Description": "For study, travel, or work--Harrap's is the only Spanish-English dictionary you'll need!Harrap's Spanish and English Dictionary successfully combines comprehensive coverage with clear presentation. Here you will find more than 115,000 references and 170,000 translations, as well as colloquial and idiomatic language, Spanish verb tables, a detailed grammar summary, and a guide to written communication.In addition, Harrap's Spanish and English Dictionary helps you gain a full understanding of Spanish and the Spanish-speaking world with:An extensive 100-page guide to all aspects of Spanish grammar Spanish verb tables that cross-reference to each verb entry to show correct conjugation Terms from specialized fields such as the media, education, science, finance, and the militaryThorough coverage of the Spanish used in Mexico, Central and South America, and the CaribbeanGreat for school or the workplace, Harrap's Spanish and English Dictionary is the only reference you need to navigate easily between Spanish and English.",
        "Category": " Reference , Dictionaries",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Statistics for the Utterly Confused (Utterly Confused Series)",
        "Authors": "By Jaisingh, Lloyd R.",
        "Description": "Statistics for the Utterly Confused is your user-friendly introduction to elementary statistics, designed especially for non-math majors  Required courses in statistics are cause for alarm among more than 500,000 undergraduates in such disciplines as nursing, allied health, pre-law, pre-medicine, business administration, and criminal justice. This super-accessible book demystifies the dreaded subject for non-math majors.  Statistics for the Utterly Confusedprovides a logical, step-by-step approach to introductory statistics, stripping away confusing material and clarifying key concepts without long, theoretical discussion and includes:   Handy icons throughout the text offer easy visual aids  500 self-testing questions  Technology Corner sections explain the latest software  Provides more than 200 examples and solved problems",
        "Category": " Mathematics , Probability & Statistics , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Les Bijoux, Vol. 2",
        "Authors": "By Jo, Eun-Ha and Sang-Sun, Park (ILT)",
        "Description": "",
        "Category": " Comics & Graphic Novels , Manga , General",
        "Publisher": "Tokyopop",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Art of Creative Living: Making Every Day a Radiant Masterpiece",
        "Authors": "By Kinkade, Thomas and Proctor, Pam",
        "Description": "\"Artist Thomas Kinkade reveals how the creative process can provide a path to greater spiritual awareness\"--Provided by the publisher.",
        "Category": " Religion , Inspirational",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Oriental Antiques and Art: An Identification and Value Guide",
        "Authors": "By Andacht, Sandra",
        "Description": "Shows and describes examples of oriental porcelain, pottery, cloisonne, furniture, netsuke, ceramics, lacquer, carpets, and wood-block prints, and lists current prices",
        "Category": " Antiques & Collectibles , Art",
        "Publisher": "Wallace-Homestead Book Co",
        "Price Starting With ($)": "5.81",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Speaking Silences: Stillness and Voice in Modern Thought and Jewish Tradition",
        "Authors": "By Ettin, Andrew Vogel",
        "Description": "Language and silence have usually been understood as opposites and assigned different values, but which one is positive and which negative? Ranging widely across time and languages, Andrew Vogel Ettin explores the ways in which various biblical and traditional works as well as modern and contemporary texts- Jewish and non-Jewish, religious and literary- treat the nature of silence and speech and the tension between them. He situates this tension at the heart of the creative process and argues that language and silence need each other and contribute to the power and meaning of one another.Speaking Silence is a broadly interdisciplinary work that will appeal to scholars and readers interested in modern and contemporary literature, Jewish studies, religion and literature, and aesthetics.",
        "Category": " Literary Criticism , Semiotics & Theory",
        "Publisher": "University of Virginia Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Reading Comprehension Grade 1 (Learn on the Go)",
        "Authors": "By Learning Horizons",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Learning Horizons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Forever: A Novel",
        "Authors": "By Hamill, Pete",
        "Description": "This widely acclaimed bestseller is the magical, epic tale of an extraordinary man who arrives in New York in 1740 and remains... forever. Through the eyes of Cormac O'Connor--granted immortality as long as he never leaves the island of Manhattan--we watch New York grow from a tiny settlement on the tip of an untamed wilderness to the thriving metropolis of today. And through Cormac's remarkable adventures in both love and war, we come to know the city's buried secrets--the way it has been shaped by greed, race, and waves of immigration, by the unleashing of enormous human energies, and, above all, by hope.",
        "Category": " Fiction , Literary",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "From the Field",
        "Authors": "By McCarry, Charles (EDT)",
        "Description": "A selection of articles and other writings from the one-hundred-year history of National Geographic includes contributions by Theodore Roosevelt, Charles Lindbergh, Joseph Conrad, Amelia Earhart, Jane Goodall, and Sir Edmund Hillary",
        "Category": " Literary Criticism , General",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.77",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Samurai Girl: Real Bout High School, Book 3",
        "Authors": "By Saiga, Reiji and Inoue, Sora (ILT)",
        "Description": "Ryoko Mitsurugi, the Samurai Girl, is the top fighter and the most popular girl at her martial arts high school until bad boy Shizuma Kusanagi transfers in from Kansai and turns the school into a non-stop battleground.",
        "Category": " Young Adult Fiction , Comics & Graphic Novels , General",
        "Publisher": "Tokyopop",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Strong Women, Strong Bones: Everything you Need to Know to Prevent, Treat, and Beat Osteoporosis",
        "Authors": "By Nelson, Miriam E. and Wernick, Sarah",
        "Description": "Based on the latest scientific information and including practical advice on the best nutrition, exercise and medications, a women's guide to the prevention and treatment of osteoporosis offers a self-test to assess risk factors, tips on supplements beyond calcium, tips on nutrition and exercise programs, and more. Reprint.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Barbie - A Touch Of Velvet",
        "Authors": "By Adams, Isobel",
        "Description": "Barbie shows off her favorite velvety evening gowns and accessories.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.98",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Hilary Duff: All Access",
        "Authors": "By Rettenmund, Matthew and Munyan, Keith (PHT)",
        "Description": "Fans can finally have the most thorough book on everything Hilary. This scrapbook of her path to stardom and her current musical and on-screen successes is a teen and \"tween\" must-have, loaded with new candid, concert, and studio photos. This exclusive and long-awaited book includes:  - An extensive biography of Hilary's climb to success including her family, her move to Los Angeles and her earliest acting auditions - Insider tips on how to get Hilary's look with advice on fashion, hair, and make-up - Revealing interviews with Hilary - Sidebars dishing the scoop on her co-stars - Fun, interactive quizzes - Horoscopes predicting what Hilary will have in store for the future - Information on Hilary's favorite charity, Kids With a Cause - A-to-Z Hilary, a database of terms, quotes and faves that are so Duff",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Big Killing (Bruce Medway Mysteries, No. 2)",
        "Authors": "By Wilson, Robert",
        "Description": "In this second novel of the Bruce Medway series, our hero, a go-between and \"fixer\" for traders in steamy West Africa, smells trouble when a porn merchant asks him to deliver a video at a secret location. Things look up, though, when he's hired to act as minder to Ron Collins, a spoiled playboy looking for diamonds in the Ivory Coast. Medway thinks this could be the answer to his cashflow crisis. But when the video delivery leads to a shootout and the discovery of a mutilated body, he wants out. Obligations keep Medway fixed in the Ivory Coast and he is soon caught up in a terrifying cycle of violence. Unless he can get to the bottom of the mystery, Medway knows that for the savage killer out there in the African night, he is the next target.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Never Coming To A Theater Near You",
        "Authors": "By Turan, Kenneth",
        "Description": "It is in the nature of today's movie business that while Hollywood blockbusters invade every megaplex, smaller, quality films often don't get screen time. Fans of finer films have to count on catching up with them on video and DVD, but even the most hard-core devotees have trouble  remembering what sounded good when a film was originally released. Never Coming to a Theater Near You will remedy that situation.    This selection of renowned film critic Kenneth  Turan's absorbing and illuminating reviews, now revised and updated to factor in the tests of time, point viewers toward the films they can't quite remember, but should not miss.    Moviegoers know they can trust Turan's impeccable  taste. His eclectic selection represents the kind of sophisticated, adult, and entertaining films intelligent viewers are hungry for. More importantly, Turan shows readers what makes these unusual films so great, revealing how talented filmmakers and actors have managed to create the wonderful highs we experience in front of the  silver screen.",
        "Category": " Performing Arts , Film , Guides & Reviews",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Book of Dressings and Marinades",
        "Authors": "By Murfitt, Janice and Grater, Paul (PHT)",
        "Description": "Collects over one hundred recipes for dressings, including yogurt-, sour cream-, oil-and-vinegar-, and soft cheese-based concoctions, plus a variety of marinades for meat, fish, poultry, vegetables,and fruit",
        "Category": " Cooking , Methods , General",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "12.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Orchestra",
        "Authors": "By Hurd, Michael",
        "Description": "An illustrated history of the orchestra's evolution from the chamber music groups of the sixteenth century to the modern symphony orchestra assesses the influence of the great composers and conductors and includes a comprehensive musical gazetteer",
        "Category": " Music , General",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "A Taste of Hawaii: New Cooking from the Crossroads of the Pacific",
        "Authors": "By Josselin, Jean-Marie, Masuda, Coco (ILT), and Jacobs, Martin",
        "Description": "A cookbook filled with recipes from these ethnically diverse islands includes instructions for preparing Polynesian, Portuguese, Chinese, Japanese, Filipino, and Vietnamese cuisine--Hawaiian style.",
        "Category": " Cooking , Regional & Ethnic , American , Western States",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "The Ortho Book of Gardening Basics",
        "Authors": "By Rae, Norm (EDT)",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "8.46",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "The Nonexistent Knight and The Cloven Viscount",
        "Authors": "By Calvino, Italo",
        "Description": "Two novellas: the first, a parody of medieval knighthood told by a nun; the second, a fantasy about a nobleman bisected into his good and evil halves. “Bravura pieces... executed with brilliance and brio”(Chicago Tribune). Translated by Archibald Colquhoun. A Helen and Kurt Wolff Book",
        "Category": " Fiction , General",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1977"
        }
    },
    {
        "Title": "Classic American Quilts",
        "Authors": "By Woodard, Thomas K. and Greenstein, B.",
        "Description": "Collects 30 examples of American quilting, showing its diversity, ingenuity, and durability as an art form",
        "Category": "",
        "Publisher": "Portland House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "The Impressionists: A Retrospective",
        "Authors": "By Kapos, Martha",
        "Description": "",
        "Category": "",
        "Publisher": "Hugh Lauter Levin Associates",
        "Price Starting With ($)": "9.92",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Gentle Closings: How To Say Goodbye To Someone You Love",
        "Authors": "By Menten, Theodore",
        "Description": "Collects stories of people facing the death of a loved one, and shows how they pushed aside despair to rejoice in shared memories and confront death with warmth, frankness, and even humor",
        "Category": " Psychology , General",
        "Publisher": "Running Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "A Wizard Alone: The Sixth Book in the Young Wizards Series",
        "Authors": "By Duane, Diane",
        "Description": "While Nita grieves over her mother's death, Kit tackles a challenge as dangerous as it is strange: Rescue a young wizard who has vanished on his first assignment. This new wizard is unlike any other--he's autistic and he's a magical prodigy. His power is enormous. Now Kit and his dog, Ponch, must track down the missing boy before the Lone Power finds him.",
        "Category": " Young Adult Fiction , Fantasy , Wizards & Witches",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Doomed Queen Anne: A Young Royals Book (3)",
        "Authors": "By Meyer, Carolyn",
        "Description": "Though born without great beauty, wealth, or title, Anne Boleyn blossomed into a captivating woman. She used her wiles to win the heart of England&#39;s most powerful man, King Henry VIII, and persuade him to defy everyone--including his own wife—to make her his new queen. But Anne&#39;s ambition was her fatal flaw. This is the true story of the girl everyone loved to hate. Carolyn Meyer&#39;s engrossing third novel in the award-winning Young Royals series tells Anne&#39;s fascinating story in her own voice—from her life as an awkward girl to the dramatic moments before her death.",
        "Category": " Young Adult Fiction , Historical , Renaissance",
        "Publisher": "CY",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Flow of Art: Essays and Criticisms (Henry McBride Series in Modernism and Modernity)",
        "Authors": "By Rich, Daniel Catton and McBride, Henry",
        "Description": "",
        "Category": " Art , Criticism & Theory",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "8.11",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Yale Younger Poets Anthology (Yale Series of Younger Poets)",
        "Authors": "By Bradley, George",
        "Description": "In 1919 Yale University Press inaugurated the Yale Series of Younger Poets, designed to \"afford a public medium for the work of young men and women who have not yet secured a wide public recognition.\" This anthology of the longest-running poetry series in the United States tells the story of American poetry in this century. At first a forum for a conservative taste in parochial college verse, the Younger Poets Series soon opened up to unconventional but profound young talents from across the country?such as James Agee, Muriel Rukeyser, Margaret Walker, William Meredith, Adrienne Rich, John Ashbery, John Hollander, James Tate, Carolyn Forché, and Robert Hass. This anthology includes poems from the first book by each of the 92 winners of the annual Younger Poets contest.The selections are accompanied by an introduction by George Bradley, the 1986 winner of the contest. Bradley charts the course of the series under the aegis of such contest judges as Stephen Vincent Benét, W. H. Auden, and James Merrill, lacing his narrative with anecdotes about the judges and winners. He also establishes the series’ vital role in the development of American poetry and American publishing. The anthology is divided into two sections: \"The Early Years,\" which briefly presents the first 31 winners of the contest, and \"The Modern Series,\" which gives ample room to display the early work of some of America's finest poets. All poets are introduced by a biographical headnote, and in the second section Bradley has added a brief commentary directing the reader to the salient features of each poet's work.",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Sacred Rage: The Wrath of Militant Islam",
        "Authors": "By Wright, Robin",
        "Description": "For a generation, Muslim extremists have targeted Americans in an escalation of terror that culminated in the September 11 attacks. Our shared confusion -- Who are the attackers? Why are we targets? -- is cleared away in a book as dramatic as it is authoritative.  Updated with new chapters on Afghanistan and the the broader Islamic movement, Sacred Rage combines Robin Wright's extraordinary reportage on the Islamic world with an historian's grasp of context to explain the roots, the motives, and the goals of the Islamic resurgence. Wright talked to terrorists, militant religious leaders, and fighters from Beirut to Islamabad and Kabul. Their voices of rage reverberate here -- right up to the attacks in New York and Washington.  Across continents extends a challenge we fail to understand at our peril. Sacred Rage now casts light on the war being fought in the shadows.",
        "Category": " Religion , Islam , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Faith Fox: A Novel",
        "Authors": "By Gardam, Jane",
        "Description": "Faith Fox has led a life full of heartbreak and abandonment, lacking in simplicity and love?and she’s not even one week old. She has suffered the unexpected and inexplicable loss of her mother in childbirth; her father, an overworked doctor grown callous with stress, has neither the ability nor the interest to take on the difficult task of raising his child alone; her grandmother, Thomasina, has decided to abscond to Egypt with a retired general rather than acknowledge and accept the loss of her daughter, whom she loved so distressingly well. And so Faith finds herself improbably at the rearing of her father’s brother, Jack, an ascetic priest whose current endeavor is an occult ?experimental community” comprised mainly of expatriate Tibetans. What ensues is a brilliant comedy of manners that revives the tradition begun by Jane Austen?an endlessly charming passage through the North and South of England that finally gives a major and lavishly gifted award-winning British writer the American readership she so richly deserves.",
        "Category": " Fiction , Literary",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Journey to the Centre of the Earth",
        "Authors": "By Verne, Jules",
        "Description": "The intrepid Professor Lindenbrock embarks upon the strangest expedition of the nineteenth century: a journey down an extinct Icelandic volcano to the Earth's very core. In his quest to penetrate the planet's primordial secrets, the geologist - together with his quaking nephew Axel and their devoted guide, Hans - discovers an astonishing subterranean menagerie of prehistoric proportions. Verne's imaginative tale is at once the ultimate science fiction adventure and a reflection on the perfectibility of human understanding and the psychology of the questor.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1965"
        }
    },
    {
        "Title": "2004 NFL Record & Fact Book (Official NFL Record & Fact Book)",
        "Authors": "By NFL (EDT)",
        "Description": "Gathers records and statistics, summarizes each game of the season, and lists the current schedule",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Sports Illustrated",
        "Price Starting With ($)": "6.03",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "More Prayers on My Pillow: Words of Comfort and Hope for Girls on the Journey to Self",
        "Authors": "By Straus, Celia",
        "Description": "Designed to provide guidance for young teenage girls, a new collection of 150 inspirational prayers, reflections, meditations, and other words of wisdom celebrates the gift of life and shares thoughts on loneliness, values,  fear, self-respect, courage, and honesty for young girls on the edge of womanhood.  By the author of Prayers on My Pillow. 35,000 first printing.",
        "Category": " Religion , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Local News: Stories",
        "Authors": "By Soto, Gary",
        "Description": "In thirteen stories full of wit and energy, Gary Soto illuminates the ordinary lives of young people. Meet Angel, who would rather fork over twenty bucks than have photos of his naked body plastered all over school; Philip, who discovers he has a \"mechanical mind,\" whatever that means; Estela, known as Stinger, who rules José's heart and the racquetball court; and many other kids, all of them with problems as big as only a preteen can make them. Funny, touching, and wholly original, Local News is Gary Soto in top form.",
        "Category": " Juvenile Fiction , Social Themes , Adolescence & Coming of Age",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "A Year in the Garden: Four Seasons of Texture, Color, and Beauty",
        "Authors": "By James, Theodore and Haralambou, Harry (PHT)",
        "Description": "Americans today hunger for a return to the comfort and loveliness of hearth, home, and garden. With A Year in the Garden they can find that all year-round. This exquisite visual study of the home garden's seasonal evolution, stands alone in its balance of design, practicality, and cultural roots. Its anecdotal text and hands-on guidance to seasonal plant, color, and texture combinations are peppered with the history-from Tuscan to English-of this overarching approach. Veteran or novice, active gardener or aficionado can reach at any time for this key to all of nature's glorious variety-season after season.",
        "Category": " Gardening , General",
        "Publisher": "Studio",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Count Us In: Growing Up with Down Syndrome",
        "Authors": "By Kingsley, Jason and Levitz, Mitchell",
        "Description": "Two young men with Down syndrome talk frankly about careers, friendships, school, sex, marriage, politics, and independence. Recipient of seven national awards, including the EDI Award from the National Easter Seal Society. Foreword by Joan Ganz Cooney.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Prince Charming Isn't Coming: How Women Get Smart About Money",
        "Authors": "By Stanny, Barbara",
        "Description": "A guide for women explains how to get smart about money by sharing the practical advice and insights that financially successful women use to get ahead. Reprint. Tour.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Generation Kill: Devil Dogs, Iceman, Captain America, and the New Face of American War",
        "Authors": "By Wright, Evan",
        "Description": "Based on Evan Wright's National Magazine Award-winning story in Rolling Stone, this is the raw, firsthand account of the 2003 Iraq invasion that inspired the HBO® original mini-series.Within hours of 9/11, America’s war on terrorism fell to those like the twenty-three Marines of the First Recon Battalion, the first generation dispatched into open-ended combat since Vietnam. They were a new pop-culture breed of American warrior unrecognizable to their forebears—soldiers raised on hip hop, video games and The Real World. Cocky, brave, headstrong, wary and mostly unprepared for the physical, emotional and moral horrors ahead, the “First Suicide Battalion” would spearhead the blitzkrieg on Iraq, and fight against the hardest resistance Saddam had to offer.Hailed as “one of the best books to come out of the Iraq war”(Financial Times), Generation Kill is the funny, frightening, and profane firsthand account of these remarkable men, of the personal toll of victory, and of the randomness, brutality and camaraderie of a new American War.",
        "Category": " History , Military , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Skipping Towards Gomorrah: The Seven Deadly Sins and the Pursuit of Happiness in America",
        "Authors": "By Savage, Dan",
        "Description": "Dan Savage is irreverent, irrepressible, and opinionated. He's held his own on Politically Incorrect, told tales on This American Life, continues to write a beloved nationally syndicated column-and he's had it up to here (my hand is higher than my head) with the moral, conservative scolds who proclaim America is slouching towards Gomorrah (to use Robert Bork's phrase). Are we really that bad?  Yes, we are! And in Skipping Towards Gomorrah, Dan Savage eviscerates those cynics as he commits each of the Seven Deadly Sins himself (or tries to) and finds those everyday Americans who take particular delight in their sinful pursuits. Among them:  Greed: Gamblers reveal secrets behind outrageous fortune. Lust: \"We're swingers!\"-you won't believe who's doing it. Gluttony: Dan meets gluttons with attitude at a pro-fat conference. Sloth: Leave it to Dan to find a way to celebrate this sin that will get him in trouble with his mother. Anger: Texans shoot off some rounds and then listen to Dan fire off on his own about guns, control, and the Second Amendment. Envy: Meet the rich-then be glad you're not one of them. Pride: You'll never look at a gay pride parade the same way again.  Couple all this sinning with a unique history of the Seven Deadly Sins, a new interpretation of the biblical stories of Sodom and Gomorrah, and enough Bork, Bennett, Buchanan, et al, bashing to more than make up for their incessant carping, and you've got the most provocative book of the fall.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Accounting for Managers (Briefcase Books Series)",
        "Authors": "By Webster, William H.",
        "Description": "Translated into 16 languages! The reader-friendly, icon-rich Briefcase Books series is must reading for all managers at every level.All managers, whether brand new to their positions or well-established in the organizational hierarchy, can use a little \"brushing up\" now and then. The skills-based Briefcase Books series is filled with ideas and strategies to help managers become more capable, efficient, effective, and valuable to their organizations.While they don't need the knowledge of a CPA, all managers must still have a basic understanding of how money is tracked and accounted for in an organization.Using the sidebars and down-to-earth style that has become the Briefcase Books trademark, Accounting for Managers defines essential terms--from general ledger to chart of accounts--and, more importantly, discusses their applications in everyday business. It also introduces managers to popular accounting software programs and their use in tracking and allocating funds in the organization.",
        "Category": " Business & Economics , Accounting , Managerial",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "The Mammoth Book of Eyewitness Battles: Eyewitness Accounts of History's Greatest Battles, from Thermopyle to the Gulf War",
        "Authors": "By Lawrence, Richard Russell (EDT)",
        "Description": "This book is a rousing collection of eyewitness accounts detailing 150 of the most crucial battles in the past 2,500 years of world history. From the Spartan defeat of the Athenians at Delion, recounted in 424 b.c. by Thucydides, to a fighter pilot’s firsthand account of an air attack by a squadron of Tornados on Iraq in Operation Desert Storm, with dramatic immediacy this stirring Mammoth volume chronicles 25 centuries of military history in the words of the hoplites, knights, musketeers, foot soldiers, cavalrymen, and bombardiers who fought them. Drawn from the reports both of commanding officers and of rank-and-file soldiers in the presentation of critical battles in such military conflicts as the Crusades, the Hundred Years War, the American War for Independence and Civil War, and World Wars I and II, the book’s selections provide both an overview of what happened and a vivid picture of what it was like in the trenches or on the field when it happened. Where it happened ranges from Antioch to Agincourt to Austerlitz to Antietam, from Bunker Hill to San Juan Hill, from the Crimea to the Somme, from Crecy to Coruna to Khe Sanh in Vietnam. Throughout, editor Richard Lawrence places the eyewitness accounts in a narrative context and includes more than 50 maps that situate the battles and the fields where this volume’s officers and infantrymen momentously made history.",
        "Category": " History , Military , General",
        "Publisher": "Carroll & Graf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "How to Behave So Your Preschooler Will, Too!",
        "Authors": "By Severe, Sal",
        "Description": "Dr. Sal Severe established himself as a leading childcare and parenting expert with his phenomenally successful How to Behave So Your Children Will, Too! Now he focuses on raising children between the ages of three and six. Based on Dr. Severe’s philosophy that children’s behavior often reflects that of their parents, this book teaches readers how to better handle a host of issues, from fussing at bedtime and temper tantrums to toilet training and sibling rivalry. Instead of focusing on what children do wrong, Severe teaches parents what they can do right by emphasizing the positive, being consistent, and being more patient. Filled with checklists, an extensive resource guide to books that parents can read with their preschoolers, and plenty of inspiration, this goldmine of helpful advice is certain to become a bible for stressed-out parents everywhere.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    }
]