[
    {
        "Title": "101 Stocking Stuffers",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Henry and Mudge and Mrs. Hopper's House (22) (Henry & Mudge)",
        "Authors": "By Rylant, Cynthia, Stevenson, Sucie (ILT), and Bracken, Carolyn (ILT)",
        "Description": "A Special Valentine's Day for Henry and Mudge  Henry's mother and father are going to a Valentine's Day Sweetheart Dance, and Henry and Mudge are staying with Mrs. Hopper across the street. Henry's never been in Mrs. Hopper's scary, old stone house with its droopy trees and dark windows and gargoyle on the door. But inside, Henry discovers a houseful of surprises -- a grand piano, a room full of costumes, and eleven cats for Mudge to play with!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "How to Draw Cartoons for Comic Strips (Christopher Hart's How To Draw)",
        "Authors": "By Hart, Christopher",
        "Description": "Here is a comprehensive approach to drawing comic-strip characters in an appealing  contemporary style featuring large-format reproductions that can be easily copied.  A wide range of drawings depicting people of all ages as well as such animals as  cats,dogs, birds, and fish show you how to capture the personality, mood, and character  of a subject. The 275 drawings illustrate head and body construction, how to draw  facial features and expressions, how to use action lines to depict body language,  how to draw hands and feet, and ways to convey emotion and age. The author also offers  valuable tips on developing a comic strip. He shows you how to place subjects within  panels; make a layout; master reverse angles, medium shots, and close-ups; establish  lights and darks; and utilize dialogue balloons. Beginning and intermediate artists—from  the younger audiences attracted to animation to more sophisticated artist who enjoy  New Yorker-type spot cartoons—will find the book of great interest.",
        "Category": " Art , Techniques , General",
        "Publisher": "Watson-Guptill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Horned Dinosaur: Triceratops (I Love Dinosaurs) (A Golden Look-Look Book)",
        "Authors": "By Berenstain, Michael",
        "Description": "Explains theories of how the dinosaur triceratops must have lived",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Magnificent Voyagers: The U.S. Exploring Expedition, 1838-1842",
        "Authors": "By Viola, Herman J.",
        "Description": "History of the expedition that surveyed 280 islands, mapped 800 miles of the Oregon coast, explored the Antarctic coast, and collected specimens from all parts of the globe",
        "Category": "",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "15.18",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "Mac OS X Tiger: Missing Manual",
        "Authors": "By Pogue, David",
        "Description": "You can set your watch to it: As soon as Apple comes out with another version of Mac OS X, David Pogue hits the streets with another meticulous Missing Manual to cover it with a wealth of detail. The new Mac OS X 10.4, better known as Tiger, is faster than its predecessors, but nothing's too fast for Pogue and Mac OS X: The Missing Manual. There are many reasons why this is the most popular computer book of all time.With its hallmark objectivity, the Tiger Edition thoroughly explores the latest features to grace the Mac OS. Which ones work well and which do not? What should you look for? This book tackles Spotlight, an enhanced search feature that helps you find anything on your computer; iChat AV for videoconferencing; Automator for automating repetitive, manual or batch tasks; and  the hundreds of smaller tweaks and changes, good and bad, that Apple's marketing never bothers to mention.Mac OS X: The Missing Manual, Tiger Edition is the authoritative book that's ideal for every user, including people coming to the Mac for the first time. Our guide offers an ideal introduction that demystifies the Dock, the unfamiliar Mac OS X folder structure, and the entirely new Mail application. There are also mini-manuals on iLife applications such as iMovie, iDVD, and iPhoto, those much-heralded digital media programs, and a tutorial for Safari, Mac's own web browser. And plenty more: learn to configure Mac OS X using the System Preferences application, keep your Mac secure with FileVault, and learn about Tiger's enhanced Firewall capabilities. If you're so inclined, this Missing Manual also offers an easy introduction to the Terminal application for issuing basic Unix commands. There's something new on practically every page, and David Pogue brings his celebrated wit and expertise to every one of them. Mac's brought a new cat to town and we have a great new way to tame it.",
        "Category": " Computers , Hardware , Personal Computers , Macintosh",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Beginning Visual C++ 6",
        "Authors": "By Horton, Ivor",
        "Description": "",
        "Category": " Computers , Programming Languages , C",
        "Publisher": "Wrox Press",
        "Price Starting With ($)": "8.82",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Biochemistry (The Jones and Bartlett Series in Biology)",
        "Authors": "By Abeles, Robert H., Frey, Perry A., and Jencks, William P.",
        "Description": "",
        "Category": " Science , Life Sciences , Biochemistry",
        "Publisher": "Jones & Bartlett Learning",
        "Price Starting With ($)": "9.5",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The Pleasure of Gardening Courtyards and Containers",
        "Authors": "By McAffer, Susan",
        "Description": "Discusses designs for courtyard and patio gardens, recommends plants for courtyards and containers, and offers advice on maintenance",
        "Category": " Gardening , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "The First Ladies cook book: Favorite recipes of all the Presidents of the United States",
        "Authors": "By Klapthor, Margaret Brown",
        "Description": "",
        "Category": "",
        "Publisher": "Parents' Magazine Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "France in Mind: An Anthology: From Henry James, Edith Wharton, Gertrude Stein, and Ernest Hemingway to Peter Mayle and Adam Gopnik--A Feast of British and American Writers Celebrate France",
        "Authors": "By Powers, Alice Leccese",
        "Description": "In her third literary Baedeker, Alice Leccese Powers–editor of Italy in Mind and Ireland in Mind–explores France through the senses and sensibilities of thirty-three British and American authors.The food and the people, the culture and viniculture, the architecture and the  expatriates, the pleasures (and frustrations) of France are  described by intrepid travelers who also happen to be brilliant essayists, poets, and novelists. From Gertrude Stein’s Paris to Ezra Pound’s Pyrenees; from Tobias Smollett, who grumbled, to Peter Mayle, who settled in; and from Edith Wharton on falling in love to David Sedaris on falling over French grammar–here is France in all its splendor in the words of some of the best and most entertaining writers in the English language.  Henry Adams • James Baldwin • Elizabeth Bishop • Mary Blume • James Fenimore Cooper • Charles Dickens • Lawrence Durrell • Lawrence Ferlinghetti • M. F. K. Fisher • F. Scott Fitzgerald • Janet Flanner • Adam Gopnik • Joanne Harris • Ernest Hemingway • Washington Irving • Henry James • Thomas Jefferson • Stanley Karnow • Peter Mayle • Mary McCarthy • Jan Morris • Ezra Pound • David Sedaris • Tobias Smollett • Gertrude Stein • Robert Louis Stevenson • Paul Theroux • Gillian Tindall • Calvin Trillin • Mark Twain • Edith Wharton • Richard Wilbur • William Carlos Williams",
        "Category": " Travel , Europe , France",
        "Publisher": "Vintage",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "French Lessons: Adventures with Knife, Fork, and Corkscrew",
        "Authors": "By Mayle, Peter",
        "Description": "A delightful, delicious, and best-selling account of the gustatory pleasures to be found throughout France, from the beloved author of A Year in Provence. The French celebrate food and drink more than any other people, and Peter Mayle shows us just how contagious their enthusiasm can be. We visit the Foire aux Escargots. We attend a truly French marathon, where the beverage of choice is Château Lafite-Rothschild rather than Gatorade. We search out the most pungent cheese in France, and eavesdrop on a heated debate on the perfect way to prepare an omelet. We even attend a Catholic mass in the village of Richerenches, a sacred event at which thanks are given for the aromatic, mysterious, and breathtakingly expensive black truffle. With Mayle as our charming guide, we come away satisfied (if a little hungry), and with a sudden desire to book a flight to France at once.",
        "Category": " Travel , Food, Lodging & Transportation , Restaurants",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Weight Watchers Make It in Minutes: Easy Recipes in 15, 20, and 30 Minutes",
        "Authors": "By Weight Watchers International (EDT)",
        "Description": "The most trusted name in weight loss makes healthy eating fast and delicious. Perfect for everyone who thought they were too busy\" to cook healthy food, these meals are ready in 15, 20, or 30 minutes -- just pick the time frame that fits your schedule. The wide range of recipes will please everyone, from fussy kids to gourmets. Sample Pierogies with Creamy Mushroom and Sherry Sauce, Berries and Cream Blintzes, Pepper-Crusted Flank Steak with Cucumber Relish, Cuban Sandwiches, Easy Paella, Tuna Panzanella and Wild Mushroom Risotto.\"",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Encore Provence-New Adventrues in the South of France",
        "Authors": "By Mayle, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Alfred A Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Nancy Drew 33: The Witch Tree Symbol",
        "Authors": "By Keene, Carolyn",
        "Description": "When a neighbor asks Nancy Drew to accompany her to an old uninhabited mansion, a new mystery opens ups, and danger lurks on the second floor. Nancy finds a witch tree symbol that leads her to Pennsylvania Dutch country in pursuit of a cunning and ruthless thief.The friendly welcome the young detective and her friends receive from the Amish people soon changes to hostility when it is rumored that Nancy is a witch! Superstition helps her adversary in his attempt to get her off his trail, but Nancy does not give up. Persistently she uncovers one clue after another.Nancy’s intelligence and sleuthing ability finally lead to the fascinating solution of this puzzling case.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "8.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "The Secret in the Old Attic (Nancy Drew, Book 21)",
        "Authors": "By Keene, Carolyn",
        "Description": "Nancy Drew races against time to unravel the clues in a dead man’s letters. If she succeeds, Philip March and his little granddaughter can be saved from financial ruin. Following obscure clues, Nancy undertakes a search for some unpublished musical manuscripts which she believes are hidden in the dark, cluttered attic of the rundown March mansion. But someone else wants them enough to put many frightening obstacles in Nancy’s way. Will she outwit a trio of ruthless thieves and solves the Marches’ problems?",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "The Cat Who Cried for Help: Attitudes, Emotions, and the Psychology of Cats",
        "Authors": "By Dodman, Nicholas H.",
        "Description": "The Cat Who Cried for Help shows how minor adjustments in diet, exercise regimen, and environment can effect dramatic breakthroughs in resolving almost any feline problem. From cat panic attacks to eating disorders, from litterbox aversion to depression and a wide range of feline phobias, Dr. Dodman has successfully treated and resolved these and many other heretofore untreatable behaviors.Inside, you'll meet Ashley, the boss-cat who literally bites the hand that feeds him; Jonathan, the binge-eater; Rubles, the Abyssinian Jekyll and Hyde, pussycat one minute, man-eating tiger the next; and Thomas, the cat who cried for help - a little too loudly. Dr. Dodman's techniques are based on the most up-to-date research in pharmacology and feline behaviorism. Yet the primary objective of his treatments is to respect and protect the qualities of independence and dignity fundamental to a cat's nature.Including descriptions of symptoms, treatment options, and tips on prevention, The Cat Who Cried for Help provides everything you need to know to ensure both you and your feline friend a long, happy, and healthy relationship.",
        "Category": " Pets , Cats , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Word On Finances",
        "Authors": "By Burkett, Larry",
        "Description": "Every Bible verse on finances, all in one bookIn a world of shifting economic realities, few financial equations last very long. In the marketplace, countless writers, analysts, and con artists clamor for the public ear. Whose voice can we trust? Which financial principles will stand the test of time?The Word on Finances sorts through the clamor of advice, plans, and ideas to bring us back to the final word we most need to hear: God's.Author Larry Burkett has organized an invaluable collection of relevant Scriptures into one easy-to-reference volume. Topically arrangedNew American Standard Bible passages and a concordance focus attention on 70 areas of finance and stewardship, all grouped under 8 headings:Right attitudesWrong attitudesCredit Giving and providingGod's blessings and cursesInvestingWork and WagesGovernmentBorrowing, bribery, planning, saving, taxes, and more-if the Bible mentions it, it's in this book. With Burkett's practical wisdom opening each topical selection,The Word on Finances is a go-to guide for spending money wisely and in a way that honors God.",
        "Category": " Religion , Biblical Reference , General",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Rich Part of Life: A Novel",
        "Authors": "By Kokoris, Jim",
        "Description": "Teddy Pappas is an eleven-year-old boy forced into maturity before his time. He lives with his younger brother and their eccentric Civil War historian father, a man more comfortable with discussing Confederate footwear than what kind of day his sons had. Their lives have been quiet for a year since the real lifeblood of their household, Teddy's mother, died in a tragic car accident. On the one-year anniversary of her death, Teddy's stoic father plays his wife's favorite lottery numbers in a tender, uncharacteristic act. When it turns out that the family holds the $190 million winning ticket, their world is instantly transformed.Seemingly overnight, a host of colorful characters demands their attention, including Teddy's hilarious aunt and uncle, a beautiful divorcée, a desperate former soap opera star, and a menacing stranger who threatens the very core of the family. As events spiral out of control, the family struggles to discover what \"the rich part of life\" really is.Featuring a unique father-child bond, Jim Kokoris's moving first novel is flavored with the rich characterizations and poignant charm of early John Irving. Creating the perfect balance of humor and pathos, Kokoris takes us on an unforgettable journey through the ups and downs of this revelation of unexpected wealth.",
        "Category": " Fiction , Literary",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "6.15",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Can You Relate?: Book 1",
        "Authors": "By Bendel, Michael",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Everglory Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "My Friends' Beliefs: A Young Reader's Guide to World Religions",
        "Authors": "By Ward, Hiley H.",
        "Description": "Do you wonder what goes on inside a church, a temple, or a mosque? Do you find it strange that some of your friends worship on Saturday and others on Sunday? Why are young Buddhist's heads shaved? What do you suppose is meant by \"speaking in tongues\"?Worshipers tread many different paths in their search for peace, love and eternal happiness. This book will tell you about the most familiar paths or faiths, and about some of the lesser-known faiths, too.",
        "Category": " Young Adult Nonfiction , Religion , General",
        "Publisher": "Walker Childrens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "5-HTP: The Natural Way to Overcome Depression, Obesity, and Insomnia",
        "Authors": "By Murray, Michael T.",
        "Description": "The most authoritative and comprehensive guide to realizing the amazing health benefits of 5-HTPWritten by one of America's leading naturopathic doctors, 5-HTP explains how this natural amino acid can safely and effectively regulate low serotonin levels, which have been linked to depression, obesity, insomnia, migraines, and anxiety.5-HTP is also a powerful antioxidant that can protect the body from free-radical damage, reducing the risk of serious illnesses such as cancer. 5-HTP has already helped thousands, and Dr. Murray, citing extensive scientific studies and case histories, shows how this groundbreaking supplement can help you.",
        "Category": " Health & Fitness , Diet & Nutrition , Vitamins",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Year's Best Science Fiction, Thirteenth Annual Collection",
        "Authors": "By Dozois, Gardner R. (EDT)",
        "Description": "The thirteenth volume of this popular annual collection offers tales by such famed writers as Pat Cadigan, Greg Egan, Ursula K. Le Guin, Brian Stableford, Ian MacLeod, and Nancy Kress.",
        "Category": " Fiction , Science Fiction , Collections & Anthologies",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Drive to the East (Settling Accounts Trilogy, Book 2)",
        "Authors": "By Turtledove, Harry",
        "Description": "Harry Turtledove–the master of alternate history–has recast the tumultuous twentieth century and created an epic that is powerful, bold, and as convincing as it is provocative. In Drive to the East he continues his saga of warfare that has divided a nation and now threatens the entire world.In 1914, the First World War ignited a brutal conflict in North America, with the United States finally defeating the Confederate States. In 1917, The Great War ended and an era of simmering hatred began, fueled by the despotism of a few and the sacrifice of many. Now it’s 1942. The USA and CSA are locked in a tangle of jagged, blood-soaked battle lines, modern weaponry, desperate strategies, and the kind of violence that only the damned could conjure up–for their enemies and themselves.In Richmond, Confederate president and dictator Jake Featherston is shocked by what his own aircraft have done in Philadelphia–killing U.S. president Al Smith in a barrage of bombs. Featherston presses ahead with a secret plan carried out on the dusty plains of Texas, where a so-called detention camp hides a far more evil purpose. As the untested U.S. vice president takes over for Smith, the United States face a furious thrust by the Confederate army, pressing inexorably into Pennsylvania. But with the industrial heartland under siege, Canada in revolt, and U.S. naval ships fighting against the Japanese in the Sandwich Islands, the most dangerous place in the world may be overlooked.",
        "Category": " Fiction , Alternative History",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "The Mystery of the Tolling Bell (Nancy Drew Mystery Stories, No 23)",
        "Authors": "By Keene, Carolyn",
        "Description": "Nancy becomes involved in another mystery when she accepts an invitation from Mrs. Chantrey, a client of Mr. Drew, to vacation at her cottage in a picturesque seaside town. Carson Drew has promised to join his daughter, but fails to arrive. The alarming disappearance of Mr. Drew and the odd circumstances surrounding his rescue are only the start of a series of highly dangerous adventures for Nancy and her friends Bess and George. Mrs. Chantrey’s story about a nearby Cliffside cave reputedly inhabited by a ghost intrigues Nancy and she decides to investigate. Several frightened townspeople claim to have seen an apparition and heard the weird sounds of a tolling bell just before water rushes from the cave. Will Nancy discover the true cause of these mysterious occurences?",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1946"
        }
    },
    {
        "Title": "Love Lies Bleeding",
        "Authors": "By Crispin, Edmund",
        "Description": "With the customary mixture of wit and comic social comment, Oxford don Gervase Fen investigates the bizarre and ominous events going on at a girls' high school and a neighboring boys' public school",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "July",
            "Year": "1982"
        }
    },
    {
        "Title": "Whisper in the Gloom: A Nigel Strangeways Mystery",
        "Authors": "By Blake, Nicholas",
        "Description": "Nigel Strangeways and Scotland Yard come to the assistance of a group of boys in possession of a mysterious, message given to one of the boys in the park by a dying stranger",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Mystery of Crocodile Island (Nancy Drew, No. 55)",
        "Authors": "By Keene, Carolyn",
        "Description": "In a response to a friend’s call for help, Nancy’s father, a lawyer, asks her to travel to mysterious Crocodile Island with her friends Bes and George to study the reptiles and try to uncover a group of suspected poachers.Upon their arrival in Florida, the girls are kidnapped but cleverly escape to pursue their detective work. Dangers mount as they cope with reptiles, enemy boats, and exciting chases after the men who are responsible for a sinister racket that involves many unsuspecting victims. In the end, Nancy makes a bold move to untangle the mass of clues, but she and Ned become imprisoned in the enemy’s submarine and are held for ransom!",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "6.23",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Nancy Drew 34: the Hidden Window Mystery",
        "Authors": "By Keene, Carolyn",
        "Description": "A magazine article offering a large reward to anyone who can find a missing medieval stained-glass window intrigues Nancy. She asks Bess and George to join her on a search in Charlottesville, Virginia. Before the three friends leave River Heights, their adversary tries to get them to postpone the trip. But no luck. Nancy is determined to carry through her plans.During the girls' investigation of old southern mansions, they encounter a ghost who turns the tables and makes them disappear. Eerie sounds come from a beautiful estate that is surrounded by a high brick wall. Why will the owner allow no one to enter?",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "The Phantom of Pine Hill",
        "Authors": "By Keene, Carolyn",
        "Description": "When Nancy Drew and her two close friends arrive for the Emerson University June Week celebration and learn there has been a mix-up in their motel reservations, the confusion leads to a baffling mystery.Uncle John Rorick, a descendant of the early settlers of the town of Emerson, invites the three girls to be his guests at his historic mansion on Pine Hill. Shortly after their arrival, he tells them about the phantom who haunts the mansion’s library. Uncle John also relates the weird family saga of a lost French wedding gown and valuable gifts which went to the bottom of a nearby cove in the sinking of the Lucy Belle a hundred years before. Could there possibly be some connection between the phantom and the old ship disaster? Nancy wonders.In between enjoying the university’s June Week boat races, river pageant, and fraternity dances, Nancy and her friends work diligently to solve the mystery of Pine Hill and to find the long-lost wedding treasures.",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1964"
        }
    },
    {
        "Title": "Ware Hawk (Witch World: Estcarp Cycle, No. 7)",
        "Authors": "By Norton, Andre",
        "Description": "Haunted by a recurring dream, Tirtha returns to Hawkholme, the ruined stronghold that had been her family's home for generations, accompanied by the Falconer, whose Eyrie had been destroyed by the Witch Women",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Simply Handmade: 365 Easy Gifts & Decorations You Can Make",
        "Authors": "By Better Homes and Gardens Books (EDT) and Dahlstrom, Carol Field (EDT)",
        "Description": "Provides ideas for a host of diverse crafts and creative projects, including window treatments, decorative lampshades, seasonal presents, and do-it-yourself gifts. 35,000 first printing. Crafter's Choice Main.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Damiano's Lute",
        "Authors": "By Macavoy, R.A.",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "48.71",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Priscilla Hauser's Decorative Painting 1-2-3",
        "Authors": "By Hauser, Priscilla",
        "Description": "Enjoy your own personal decorative painting workshop with the world-recognized master of the form. Through her media appearances and seminars, Priscilla Hauser has become the craft's ambassador and a much sought-after teacher. If you don't have five days to attend her class, do the book version of her \"quick-fix\" program at your convenience. Try Hauser's unique approach to brush strokes and proper preparation of surfaces, and learn her distinctive pen-and-ink and fabric painting techniques. Then you're ready for 14 charming projects that take just a few hours to complete, including Fish on a Tin Tub, Sunflowers Coat Rack, Blueberries Ensemble, Garden Window, Ladybug Garden Set, Seashells Headboard, Leaf Bordered Picture Frame, and Woodland Ferns Table. A Main Selection of the Crafter's Choice Book Club.",
        "Category": " Crafts & Hobbies , Painting",
        "Publisher": "ing",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Yard & Garden Projects: Easy, Step-By-Step Plans and Designs for Beautiful Outdoor Spaces (Time Life How-To Series.)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Time Life Custom Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Raphael",
        "Authors": "By R.A. MacAvoy",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "48.71",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Quick From Scratch Pasta Cookbook",
        "Authors": "By Food & Wine Magazine",
        "Description": "\"This...gives me more serving ideas than I thought possible...each dish is temptingly illustrated.\"--Jacques Pépin. Versatile and sure to please, pasta is also one of the fastest meals to prepare. From updates of traditional Italian, Asian, and American recipes to innovative combinations, these dishes will delight and surprise. Try a quick version of that old favorite, macaroni and cheese. Or, dig into boldly flavored Baked Ziti with Pesto, piquant Curried Chicken with Apple over Vermicelli, refreshing Rotelle and Shrimp with Yogurt Dill Dressing, and a summery Spaghetti with Tomatoes, Black Olives, Garlic, and Feta Cheese. There's a handy pasta wheel for easy substitutions, ideas for customizing each recipe, indexes of seasonal and vegetarian pasta, and clever, delectable ways to use leftovers. Wine suggestions, too! 9 X 10.  All in Color",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "American Express",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Dr. Jekyll and Mr. Holmes",
        "Authors": "By Estleman, Loren D.",
        "Description": "At the request of Queen Victoria and aided by Dr. Watson, Sherlock Holmes uses his expertise as a chemist to explain a mysterious gap in Robert Louis Stevenson's account of Dr. Jekyll and Mr. Hyde",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "August",
            "Year": "1980"
        }
    },
    {
        "Title": "Simply Salmon",
        "Authors": "By Peterson, James",
        "Description": "Detailed instructions for preparing sixty-five delicious salmon dishes--including Poached Whole Salmon with Tarragon Butter, Salmon Tacos, and Salmon and Basil Ravioli--are accompanied by step-by-step photographs and tips on selecting salmon in the supermarket and the proper techniques for cleaning, boning, curing, and slicing the fish. BOMC.",
        "Category": " Cooking , Specific Ingredients , Seafood",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Shattered Dreams: God's Unexpected Pathway to Joy",
        "Authors": "By Crabb, Lawrence J.",
        "Description": "If God loves me, why does life hurt so much?“A new way to live is available to us,” writes widely respected author and counselor Larry Crabb, “a way that leads to a joy-filled encounter with Christ, to a life-arousing community with others, and to a powerful transformation of our interior worlds that makes us more like Jesus.”You’ll see how God moves you from shattered dreams to better dreams  to the highest dream– and the joy that comes from dreaming it.This is a book that will...draw you to your closest Friend,help you discover your deepest spiritual desires,point you to your greatest hope,help you face your deepest pain,and invite you to your highest joy.Join Larry Crabb on a life-changing adventure of encountering God in the midst of life’s most difficult times. And learn to live beyond your Shattered Dreams.",
        "Category": " Religion , Christianity , Literature & the Arts",
        "Publisher": "WaterBrook Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Out of the Ashes (Tom Clancy's Op-Center)",
        "Authors": "By Clancy, Tom (CRT), Couch, Dick, Galdorisi, George, and Pieczenik, Steve R. (CRT)",
        "Description": "Tom Clancy's Op-Center is back with this new thriller written by the New York Times bestselling authors of Tom Clancy's ACT OF VALOR and featuring a chilling, ripped-from-the-headlines scenario.Before 9/11 America was protected by a covert force known as the National Crisis Management Center. Commonly known as Op-Center, this silent, secret mantel guarded the American people and protected the country from enemies. The charter was top secret and Director Paul Hood reported directly to the president. Op-Center used undercover operatives with SWAT capabilities to diffuse crises around the world, and they were tops in their field. But after the World Trade Center disaster, in the interest of streamlining, OP-Center was disbanded—leaving the country in terrible danger.But when terrorists detonate bombs in sports stadiums around the country leaving men, women and children dead or mutilated, the President executes an emergency order to bring back Op-Center—an Op-Center capable of dealing with the high tech crises of the 21st Century, and there is a lethal one brewing in the Middle East. A renegade Saudi Prince with ambitions of controlling the world's oil supply has an ingenious plot to manipulate America into attacking Syria and launching a war against Iran. Next, they would ignite a sleeper cell to attack the America homeland, resulting in a bloodbath unlike any other. Only the men and women of Op-Center, using sophisticated technology, realize what is about to be unleashed. Only they have the courage to issue a warning no one wants to hear. But will anyone believe them?",
        "Category": " Fiction , Thrillers , Military",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2014"
        }
    },
    {
        "Title": "Cellfood: Vital Cellular Nutrition for the New Millennium",
        "Authors": "By Dyer, Dr. David S.",
        "Description": "",
        "Category": "",
        "Publisher": "Feedback Books, Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "In Depth: Essayists for Our Time",
        "Authors": "By Klaus, Carl H.",
        "Description": "IN DEPTH offers writing instructors a wide-ranging collection of outstanding essayists and essays.",
        "Category": " Education , Higher",
        "Publisher": "Harcourt College Pub",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Maximum Energy",
        "Authors": "By Broer, Ted",
        "Description": "30 days to improve your energy level and general health...no matter how you feel today!\"I don't believe in diets, and I am not going to tell you to give up everything you like to eat-just the things that can kill you before your time,\" says Broer. God created your body to operate at maximum energy and efficency levels, but these levels vary according to your lifestyle and by what you eat and drink each day.Living healthier is about more than getting exercise and taking vitamins. Ted Broer addresses a variety of lifestyle essentials, including pure water, natural fiber, antioxidants, essential fats, sleeping habits, deep breathing, sunshine and fresh air, and learning how to relax.Maximum Energy is about following ten strategies, discovering healthy solutions, and experiencing more energy than ever before!Ted Broer says, \"It is amazing to see what a difference just a few quality choices can make.\"",
        "Category": " Health & Fitness , General",
        "Publisher": "Creation House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Favorite Recipes The Costco Way - Delicious Dishes Using Costco Products",
        "Authors": "By Editorial Director Tim Talevich",
        "Description": "",
        "Category": "",
        "Publisher": "Costco Wholesale",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Marathon: You Can Do It!",
        "Authors": "By Galloway, Jeff and Wills, David (FRW)",
        "Description": "Marathon running is a sport that many consider too daunting, better in the viewing than the doing. Olympian Jeff Galloway dispels such notions in a book that takes the mystery ? and misery ? out of distance running. Marathon! shows how just about anyone can run a marathon and, given the right attitude and training, finish the race. Galloway has designed a low-mileage marathon training program that has been used by over 10,000 people with a 98 percent success rate. The book includes the latest information on workouts, form innovations, pace charts, prediction tables, and motivation strategies.",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "Shelter Publications",
        "Price Starting With ($)": "5.93",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "When Mothers Pray: Bringing God's Power and Blessing to Your Children's Lives",
        "Authors": "By Fuller, Cheri",
        "Description": "When Mothers Pray is a book of hope, inspiration, and stories that will revitalize the prayer life of readers. Many women experience hopelessness when they pray for their children and see no discernible results -- yet praying is one of the most vital things we can do for our kids. Now with a lovely new contemporary cover, this bestselling book offers encouragement and a larger perspective as moms from around the world share their own personal stories, struggles, and ultimate victories. Women will find new motivation to refresh their prayer lives -- and to make a difference in the lives of their children as they intercede for them.",
        "Category": " Religion , Prayerbooks , Christian",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Freedom's Ransom (Freedom Series, Book 4)",
        "Authors": "By McCaffrey, Anne",
        "Description": "Finally, Botany is free. The colonists of Freedom's Landing, who were dropped on this world as terrified slaves of the alien Catteni, have become an independent people. They raise their own food, make their own clothes, dispense justice when necessary, and care for an ever-increasing number of children. They've even found themselves in a position to help the survivors of Earth and Barevi, worlds battered by Catteni raids until natural resources are in desperately short supply. To a hungry man on Earth, a roasted Botany \"rock-squat\" makes a fine meal, no matter how funny-looking he might once have found that little bird.But Botany can't provide everything. Solar cells, communications equipment, spare tires, even the simplest battery - all of this technology is required if this is to become a fully functioning world, and none of it is easy to make. Kris Bjornson and her beloved Zainal know that the warehouses of Barevi are full of the things they need, all looted from Earth during the war. But the Barevi merchants won't just give it back; some kind of interstellar trade must be developed.The oddest commodities turn out to be the ones that work. For some reason the fierce Catteni become easily addicted to a good cup of coffee, and are prepared to do a great deal to get it. And, the colonists discover, the Catteni have their own kinds of vanity - which like all vanities can be catered to at a high price. Quick thinking and the willingness to do whatever it takes are the colonists' tactics, as they work to position their little world as an equal partner among the interstellar powers.",
        "Category": " Fiction , Literary",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Blessing of the Animals: True Stories of Ginny, the Dog Who Rescues Cats",
        "Authors": "By Gonzalez, Philip and Fleischer, Leonore",
        "Description": "Many thousands of readers shared the joy of The Dog Who Rescues Cats, the amazing true story of Philip Gonzalez and his miracle dog, Ginny. Millions more watched their story on television news and talk shows. Since their first book, Philip and Ginny have been hard at work, carrying out their most incredible rescues - and their lives have changed in wonderful ways. The Blessing of the Animals is the story of their remarkable successes, from the back alleys of their Long Island cat-feeding stations to the backstage corridors of the Sally Jessy Raphael show. Philip and Ginny have become the world's most popular cat-rescue team.When Philip adopted Ginny from a local animal shelter, he knew right away that she was no ordinary dog. Ginny's amazing sixth sense enabled her to sniff out abandoned and disabled cats, and before long Philip had devoted his life to rescuing and caring for cats in need. Today they feed over one hundred outdoor cats and have brought twenty into their own home; one is blind, one is deaf, one has no rear paws, but they are all part of the family. Since The Dog Who Rescues Cats, Philip and Ginny's rescues have grown even more heroic. There was Beige, a frightened stray stranded in a flooded lot after the blizzard of '96; two kittens plucked from the backseat of an abandoned car; and Chairman, a tiny kitten whom Ginny sniffed out in a carton full of broken glass. On national television Sally Jessy Raphael called Ginny \"a true hero\" and gave her a medal. One TV reporter said, \"She's the Pied Piper of sick and disabled cats,\" and another noted, \"You might call her the Mother Teresa of the cat world.\" The Blessing of the Animals is the second volume in a heartwarming, remarkable story.",
        "Category": " Pets , Cats , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Stronger Faster: Workday Workouts That Build Maximum Muscle in Minimum Time (Men's Health Life Improvement Guides)",
        "Authors": "By Men's Health Books (COR), Kirchheimer, Sid, and Kaufman, Brian",
        "Description": "A workout book for busy men features a ten-minute routine for developing abdominal muscles, ways to save time during workouts, time-saving tips from celebrities, and exercises and stretches that can be done in an office. Original. 25,000 first printing.",
        "Category": " Health & Fitness , Men's Health",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "The Art of Celebration: Twentieth-Century Painting, Literature, Sculpture, Photography, and",
        "Authors": "By Appel, Alfred",
        "Description": "In a detailed and often startlingly close-up consideration of 122 works of art, here beautifully reproduced, many in full color, Alfred Appel explains, interprets, reveals - and throws a whole new light on - the art of the twentieth century. His wide-ranging commentary accompanying each work, from Mondrian's pulsating abstractions to Brancusi's soaring sculptures and Calder's Thirteen Spines, illuminates a whole network of cultural connections, from the literary to the aesthetic to the political.Appel champions the restorative, uplifting forces found in the works of such twentieth-century artists as Matisse, Lachaise, Paul Klee, Walker Evans, Joyce, Chagall, Stravinsky, Nabokov, Russell Lee, Leger, Milhaud (some of whom came to America to escape Hitler and quickly caught the native upbeat beat) . . .Their works have often portrayed the commonplace: cars, gasoline stations, roadside diners, electric signs, movies, radios, skyscrapers . . . celebrating - even through war in Europe and depression at home - the advances in technology, the new look of the cities . . .Appel discusses how their art stimulates and quickens the pulse, and how - with its folk images of the new, willed \"primitivism,\" in part inspired by the tribal art of Africa and Oceania - it projects optimism, humor, energy.Full of ideas and brilliant critical insights, this is a book at once idiosyncratic, authoritative, and fun to look at and to read.",
        "Category": " Art , History , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Break in the Circle",
        "Authors": "By Loraine, Philip",
        "Description": "",
        "Category": "",
        "Publisher": "M.S. Mill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "Incubus Dreams (Anita Blake, Vampire Hunter, Book 12)",
        "Authors": "By Hamilton, Laurell K.",
        "Description": "In her role as consort of Jean-Claude, the seductive Master Vampire of the City, Anita Blake is faced with a dangerous conflict of interest--and her struggle to control her fierce desires--when she is called in to assist with the search for a vampire serial killer preying on strippers. Reprint.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Memorial Hall Murder: A Homer Kelly Mystery",
        "Authors": "By Langton, Jane",
        "Description": "After a bomb blast in Harvard's Memorial Hall and the discovery of a headless body, obviously belonging to unconventional and popular Professor Hamilton Dow, dauntless detective Homer Kelly, on campus at the time, takes charge of an investigation",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "Emily Dickinson Is Dead: A Homer Kelly Mystery",
        "Authors": "By Langton, Jane",
        "Description": "When Winifred Gaw is discovered murdered in Emily Dickinson's bedroom, Horace Kelly decides to investigate the baffling crime",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "A Star Shone",
        "Authors": "By Trent, Robbie",
        "Description": "",
        "Category": "",
        "Publisher": "Westminster Press",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1948"
        }
    },
    {
        "Title": "Mulch Ado About Nothing (Jane Jeffry Mysteries, No. 12)",
        "Authors": "By Churchill, Jill",
        "Description": "No one could ever accuse Jane Jeffry or her equally green-thumbless best friend Shelly Nowack of being modern reicarnations of Luther Burbank.  Their ineptitude in all things vegatative has inspired them to sign up for a botany class at the local community center, even though the gods of gardening seem to be warning Jane to steer clear.Jane trips on a curb and badly bangs up her foot, but his gamely hobbles to class on crutches and in a cast, only to learn that the glamorous and celebrated microbiologist teacher, Julie Jackson, has been beaten into a coma by a person or persons unknown.  But the class must go on, even though the substitute teacher, Dr. Stewart Eastman, is the arrogant creator of his patented plant species and more interested in his personal ambition to achieve botanical fame and fortune than imparting knowledge or a love of gardening.  He's propaganding only his ego and his latest floral coup.When a murder occurs, there's and abundant crop of suspects in the class,  Is the perp who plants a body in Dr. Eastman's compost pile the conspiracy nut Ursula Appledorn, who's' convinced that they are being stalked by a cabal involving the U.S. Department of Agriculture, Queen Elizabeth, and the French Dauphin? Or maybe the obsessively tidy computer nerd Charles Jones? Or the milquetoast widoer Arnold Waring? Perhaps it's the terrifying knowledgeable Miss Martha Winstead with her strong opinions on gardening?Jane's beau, police detective Mel VanDyne, who admits to a secret longing to drive dieselpowered earth-moving equipment, is on the case, but hasn't seen the gardens the classmates have created -- wherein flourishes the floral clue to the grimy crime.  Jane's afraid he'll pluck out the wrong suspect.And Jane, her nuisance injury ignored, is willing to get her gardening gloves, and Shelly's as well, dirty to uneath the gardener who's responsible for one bashing and one buried.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Say You Love Me",
        "Authors": "By Lindsey, Johanna",
        "Description": "Her parents' deaths left Kelsey Langton penniless - and responsible for the safety and well-being of her younger sister, Jean. Now circumstance and human frailty have conspired to leave them homeless as well, unless Kelsey can avert the disaster. But she knows only one way to rescue Jean's home, future and honor - and it means sacrificing her own. Kelsey must allow herself to be sold at auction.With fear and trepidation she enters the House of Eros - resigned to becoming the plaything of some well-heeled gentleman. And Lord Derek Malory is the highest bidder - a dashing rakehell from a family of charming London rogues. Enchanted by the stunning, dark-haired maid with flashing bright eyes, he purchases her for his mistress - and sweeps Kelsey into a world of astonishing family secrets, perilous rivalries and unconventional loyalties.But Lord Derek is unaware of the true worth of the prize he has so frivolously acquired - never imagining that the proud, spirited miss is a highborn lady blessed with grace, wit and intelligence as well as beauty. And he certainly never expected that he would fall in love with her.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Angel (Wyoming-Western Series, 3)",
        "Authors": "By Lindsey, Johanna",
        "Description": "Hoping to cool off a twenty-five-year-old feud between two neighboring families, Cassie Stuart only succeeds in pouring kerosene on the flames. Both sides have warned her to get out of Texas pronto. . .or they will burn her father's ranch to the ground. What Cassie needs is a peacemaker but she ends up with a widow-maker instead.  He is called Angel , a ruggedly handsome hired gun with eyes as black as sin. Unwanted and unwelcomed by his ungrateful employer, he would just as soon leave Cassie to fend for herself. But a stubborn sense of duty , and a desire to taste the sweetness of her kiss steels Angel's resolve to make Cassie want him, come hell or high water. . .and for more than his gun alone.",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "First, Best And Only",
        "Authors": "By Delinsky, Barbara",
        "Description": "When CEO Marni Lange is finally persuaded to be the cover model for her company's magazine, the photographer turns out to be Brian Webster, her first and best lover, who rekindles the flame of their long-smoldering passion and helps Marni overcome the ghosts of the past that threaten to tear them apart. Reissue.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Mira",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Cottage: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "™In her fifty-fourth bestselling novel, Danielle Steel weaves a compelling story  of fame and friendship, charmed lives and private struggles...and of three very different  men whose lives converge and collide at The Cottage.  On a sunny day in Hollywood,  a gleaming Rolls-Royce convertible pulls through the gates of the magnificent estate  known as The Cottage. Modeled after the “cottages” of Newport, Rhode Island, the  spacious, elegant property, sitting on fourteen acres of lush Bel Air, fits its owner  to a T. For the man behind the wheel of the Rolls is Hollywood’s ageless wonder,  Cooper Winslow. A star of the silver screen for decades, a man whose allure to women  is the stuff of legend, Coop exudes grace, charm, and old-fashioned style. But today  Coop Winslow is in for a major surprise. He’s broke. And with no major roles coming  his way, Coop is faced with the heartbreaking prospect of selling his beloved home  of forty years, or at least renting out the gatehouse and part of the main house.  A huge blow to Coop, whose debonair attitude allows him to escape reality much of  the time.   His new tenants, Mark Friedman and Jimmy O’Connor, are busy coping with  problems of their own. Mark’s wife of sixteen years just walked out, and Jimmy recently  lost his own wife to a devastating illness. But everything changes when Mark’s teenage  son and daughter move in. Suddenly, The Cottage is transformed, with music blasting  from every corner, teenagers on skateboards crashing into vintage cars, and a never-ending  parade of young starlets streaming in and out to visit Coop.   But amid all the noise  and the chaos, something unexpected is happening.  Three men who never would have  met are becoming friends...and each man finds himself changing in surprising ways,  Coop most of all. Because beneath the dazzle and flash, the impeccably tailored suits  and the sheer bravado, is a man trying to keep control of his carefully ordered world—a  world that is becoming more and more unpredictable with each passing day.   First,  a tabloid scandal erupts, threatening Coop’s budding romance with a wealthy debutante....A  stranger approaches Coop with stunning news....A devastating accident almost claims  the life of one of the housemates....And in the midst of it all, The Cottage welcomes  a new houseguest with a secret of her own, who will change Coop’s life in unexpected  ways.  Because among the people who share his cottage and his life, Coop Winslow– loner, bachelor, movie star–may find the rarest of all opportunities: a chance to  build a happiness he could never have dreamed of on his own, and to become the kind  of human being he has never been.   Against a glittering backdrop of celebrity and  glamour, Danielle Steel digs deeper to tell a story of friendship and love, tragedy  and second chances...of the choices and unexpected turns of fate that can shape characters  and lives.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "A Midnight Clear",
        "Authors": "By Stone, Katherine",
        "Description": "Here is an original contemporary romance by Katherine Stone, one of the best-loved and bestselling authors working in the genre today. Katherine Stone's most recent paperback, Bed of Roses, has over 263,000 copies in print.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Bloody Bones (Anita Blake, Vampire Hunter, Book 5)",
        "Authors": "By Hamilton, Laurell K.",
        "Description": "Hired to exhume two-hundred-year-old graves in the wake of a land dispute, Anita Blake becomes involved in local murders involving three dead teenagers and a bloodless corpse that makes her suspect that an evil force is preying upon the town",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Testimony of the Spade.",
        "Authors": "By BIBBY, Geoffrey.",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "Prayers and Graces for a Small Child",
        "Authors": "By Mary Alice Jones, Kate Smallwood",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "The virgin diplomats",
        "Authors": "By Bendiner, Elmer",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf; [distributed by Random House]",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Last Juror",
        "Authors": "By Grisham, John",
        "Description": "In 1970, Willie Traynor came to Mississippi in a Triumph Spitfire and a fog of vague ambitions. Within a year, the twenty-three-year-old college dropout found himself the owner of Ford County’s only newspaper, famous for its well-crafted obituaries. While the rest of America was in the grips of social turmoil, Willie’s adopted town of Clanton lived on the edge of another age, until the brutal murder of a young mother rocked the sleepy community—and thrust Willie into the center of a storm. Daring to report the true horrors of the crime, Willie made as many friends as enemies in Clanton—and over the next decade he would take stances, break barriers, and sometimes wonder how he had gotten there in the first place. But he could never escape the crime that had shattered his innocence or the criminal whose evil had left an indelible stain. Because as the ghosts of the South’s past gather around Willie, as issues of race and justice swirl around Clanton, men and women who served on a jury nine years ago are starting to die one by one—as a killer exacts the ultimate revenge. . . .",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Cyber Way",
        "Authors": "By Foster, Alan Dean",
        "Description": "A routine murder investigation leads Detective Vernon Moody to an enigmatic Navaho sand painting that has mystical properties and connections to an incomprehensibly powerful alien data base",
        "Category": " Fiction , Science Fiction , Adventure",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Deep as the Marrow",
        "Authors": "By Wilson, F. Paul",
        "Description": "When the president of the United States decides to back the legalization of marijuana, organized crime decides he must die. But for them to succeed, he must die without blame on them. So they are going to make his friend--his personal physician--kill him.First, the kidnap the doctor's daughter.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Wicked Promise",
        "Authors": "By Martin, Kat",
        "Description": "A Lady's Desperate ChoiceWhen the loathsome Lord Bascomb tries to force her into marriage, Elizabeth Woolcot, against her will, must applea to her influential guardian.  Nicholas Warring, known as the Wicked Early, is a darkly handsom charasmatic figure--with the power to save her but a past that could put her reputation dangerously at risk.  A ruthless womanizer, he has also been convicted of murder--and barely escaped hanging.A rogue's tainted honorElizabth can't help her attraction to the man who haunts her dreams--nor he his hunger for her.  But she knows it can never be.  For Nicholas is a married man.  Then a heinous crime shatters their lives--and Nick is the natural suspect.  Elizabeth wants to believe in his innocence more than life and love itself--but can she trust a man who has killed before?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Devil's Cure : A Novel",
        "Authors": "By Oppel, Kenneth",
        "Description": "One man's blood could hold the key to curing cancer. That man is a death row killer. And he'll kill again rather than give it to you. How badly do you want it?David Haines sits on death row, imprisoned for murdering leading research doctors in the name of God. Meanwhile, the brilliant oncologist Dr. Laura Donaldson battles a disease that kills just as ruthlessly, and in an ironic twist of fate, Laura discovers that the murderer may hold within him the cure for cancer. When she unwittingly helps Haines escape from prison, she and FBI agent Kevin Sheldrake--a man with his own demons to overcome--embark on a terrifying manhunt that takes them across the country and deep into their own troubled pasts. For both Laura and Kevin it is imperative that the killer be brought back alive--but Haines would sooner kill himself and everyone else rather than offer his precious blood for medical science.Kenneth Oppel brilliantly entwines three compelling characters in this masterfully paced thriller that moves seamlessly between the worlds of science and religion. The Devil's Cure will keep readers on the edge of their seats.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Free Choice for Workers: A History of the Right to Work Movement",
        "Authors": "By Leef, George C.",
        "Description": "",
        "Category": " Political Science , Labor & Industrial Relations",
        "Publisher": "Jameson Books Inc.",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Deja Dead (Temperance Brennan Novels)",
        "Authors": "By Reichs, Kathy",
        "Description": "See where the smash #1 New York Times bestselling Temperance Brennan “cleverly plotted and expertly maintained” (The New York Times) series all began with Deja Dead, the first installment from forensic anthropologist and internationally bestselling thriller writer Kathy Reichs.Her life is devoted to justice—for those she never even knew. In the year since Temperance Brennan left behind a shaky marriage in North Carolina, work has often preempted her weekend plans to explore Quebec. When a female corpse is discovered meticulously dismembered and stashed in trash bags, Temperance detects an alarming pattern—and she plunges into a harrowing search for a killer. But her investigation is about to place those closest to her—her best friend and her own daughter—in mortal danger...",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Pocket Star Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Lincoln Lawyer (A Lincoln Lawyer Novel, 1)",
        "Authors": "By Connelly, Michael",
        "Description": "This #1 bestselling legal thriller from Michael Connelly is a stunning display of novelistic mastery - as human, as gripping, and as whiplash-surprising as any novel yet from the writer Publishers Weekly has called \"today's Dostoevsky of crime literature.\"Mickey Haller is a Lincoln Lawyer, a criminal defense attorney who operates out of the backseat of his Lincoln Town Car, traveling between the far-flung courthouses of Los Angeles to defend clients of every kind. Bikers, con artists, drunk drivers, drug dealers - they're all on Mickey Haller's client list. For him, the law is rarely about guilt or innocence, it's about negotiation and manipulation. Sometimes it's even about justice.A Beverly Hills playboy arrested for attacking a woman he picked up in a bar chooses Haller to defend him, and Mickey has his first high-paying client in years. It is a defense attorney's dream, what they call a franchise case. And as the evidence stacks up, Haller comes to believe this may be the easiest case of his career.  Then someone close to him is murdered and Haller discovers that his search for innocence has brought him face-to-face with evil as pure as a flame. To escape without being burned, he must deploy every tactic, feint, and instinct in his arsenal - this time to save his own life.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Keeper of the Wayward Flower",
        "Authors": "By Ackerman, William L., Ph.D.",
        "Description": "",
        "Category": " Fiction , Romance , General",
        "Publisher": "Amer Literary Pr",
        "Price Starting With ($)": "7.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Omicron Legion",
        "Authors": "By Land, Jon",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The List of Seven",
        "Authors": "By Frost, Mark",
        "Description": "Dark BrotherhoodAs the city of London slumbers, there are those in its midst who conspire to rule the world through the darkest and most nefarious means. These seven, seated in positions of extraordinary power and influence, marshal forces from the far side to aid them in their fiendish endeavor.Force of OneIn the aftermath of a bloody séance and a terrifying supernatural contact, a courageous young doctor finds himself drawn into a malevolent conspiracy beyond human comprehension.All or NothingThe future is not safe, as a thousand-year reign of pure evil is about to begin, unless a small group of stalwart champions can unravel the unspeakable mysteries behind a crime far more terrible than murder.",
        "Category": " Fiction , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Maybe You Should Write a Book",
        "Authors": "By Daigh, Ralph",
        "Description": "The aspiring writer is provided with encouragement and advice from such best-selling authors as James Michener, Isaac Asimov, and Joyce Carol Oats and with complete information on today's publishing business",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "Uncommon Valor, Common Virtue",
        "Authors": "By Buell, Hal",
        "Description": "It remains the U.S. Marine Corps.' bloodiest battle. Fifty years later, it is A.P. photographer Joe Rosenthal's Pulitzer-winning photo of Marines raising the American flag on Mt. Suribachi that keeps the memory of Iwo Jima alive.  Uncommon Valor, Common Virtue is a full account of the battle itself and of Rosenthal's ten days on Iwo Jima as Marines fought against a murderous Japanese onslaught. It recounts the enduring legacy of \"the photograph\"-most recently in the historic picture of three firemen raising the American flag at the site of the World Trade Center, recalling Rosenthal's timeless image of steely resolve in the face of tyranny.",
        "Category": " Photography , History",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Dark Victory (Star Trek)",
        "Authors": "By Shatner, William",
        "Description": "The Mirror Universe is a dark and twisted reflection of our own, where all that is noble and compassionate is instead cruel and barbaric. Now our universe has been invaded by that other reality's most feared tyrant: the dreaded Emperor Tiberius, the Mirror Universe counterpart of James T. Kirk. Just as Kirk survived his own era to live into the 24th century, so has Tiberius returned from the past to menace a new generation of Starfleet heroes.  And only Kirk can stop him.  With Spock, McCoy, and Spotty at his side, and teamed Jean-Luc Picard and the valiant crew of the U.S.S. Enterprise? NCC-1701-E, Kirk is propelled into his most personal and dangerous mission yet as he fights to uncover the secret of Tiberius' return and learn the terrible truth behind the madman's nightmarish plans for the Federation.  But how can he defeat an enemy who knows Kirk's mind as well as he knows his own?",
        "Category": " Fiction , Science Fiction , Space Opera",
        "Publisher": "Star Trek",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Great Battles of the Civil War [ILLUSTRATED]",
        "Authors": "By Martin Graham, George Skoch",
        "Description": "",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Infection (Star Trek The Next Generation: Double Helix, Book 1)",
        "Authors": "By Betancourt, John",
        "Description": "Like the twisted strands of mutant chromosomes, an insidious alien conspiracy winds its way through the entire Alpha Quadrant, just as it stretches across several years of Starfleet history -- beginning near the very start of Captain Picard's command of the Starship Enterprise?!  It is only the first year of the U.S.S. Enterprise?-D's ongoing mission when a virulent epidemic strikes the populace of Archaria III, endangering the lives of thousands and provoking acts of mob violence against those believed responsible for the spread of the disease. While Data and Natasha Yar team up to uncover the true origins of the virus, Dr. Crusher finds that the implacable sickness resists all her efforts to find a cure. The desperate quest for a cure becomes even more urgent when Deanna Troi succumbs to the dreaded plague...again and again.",
        "Category": " Fiction , Science Fiction , Space Opera",
        "Publisher": "Star Trek",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Song and Dance: The Musicals of Broadway",
        "Authors": "By Sennett, Ted",
        "Description": "",
        "Category": " Music , General",
        "Publisher": "Metro Books",
        "Price Starting With ($)": "6.92",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Skinnybones",
        "Authors": "By Park, Barbara",
        "Description": "If you thought Junie B. Jones was FUNNY—catch more laughs from New York Times bestselling author Barbara Park with Skinnybones! Just right for fans of Diary of a Wimpy Kid and I Funny, Skinnybones has been a kid and teacher favorite for almost thirty years and has sold over 1 MILLION copies!   Play ball??? Alex Frankovitch is the smallest, second-worst kid on his team. But he has a MAJOR-LEAGUE-sized mouth. And it gets him into MAJOR-LEAGUE trouble! Even Alex knows he’s gone too far when he brags his way into a pitching contest with T.J. Stoner, the best player—and BIGGEST jerk—in the whole school (and maybe the whole world!). Can Alex talk his way out this mess? Or is he in for the GRAND SLAM of all humiliations? Find out in the award-winning, laugh-out-loud novel from the New York Times bestselling author of Junie B. Jones!   “Park is one of the funniest writers around. Skinnybones equals tickled funnybones.” —Booklist   “Hilarious! Even if you don’t know center field from first base this story will keep you laughing.” —Children’s Book Review Service   “Park writes…in a way that touches reality, but makes the reader double over with laughter.” —Chicago Sun-Times",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Healthy House Plants",
        "Authors": "By Herwig, Rob",
        "Description": "Informative descriptions for over five hundred common and exotic houseplants indicate sun, temperature, water, humidity, and soil requirements and are supplemented by hundreds of color photographs and charts grouping plants with similar characteristics",
        "Category": " Gardening , General",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Fire in Heaven: A Novel",
        "Authors": "By Bosse, Malcolm",
        "Description": "In 1948 Philip Embree travels to Burma and Thailand to repay emotional debts and again becomes involved with Vera Rogacheva, former mistress of General Tang, and the woman Embree loves",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Troubled Crusade: American Education, 1945-1980",
        "Authors": "By Ravitch, Diane",
        "Description": "This widely praised history of the controversies that have beset American schools and universities since World War II is essential reading for anyone who wants to understand the condition of American education today.",
        "Category": " Education , History",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Skyguide: A Field Guide to the Heavens",
        "Authors": "By Chartrand, Mark",
        "Description": "Provides detailed quadrant maps of the seasonal skies, clearly illustrated constellation charts, and up-to-date information on planets, comets, nebulae, and other stellar objects",
        "Category": " Juvenile Nonfiction , Science & Nature , Astronomy",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "The Digital Architect: A Common-Sense Guide to Using Computer Technology in Design Practice",
        "Authors": "By Sanders, Ken",
        "Description": "Written by an architect for design professionals, The Digital Architect is a gold mine of commonsense advice and guidance on the realities of using computer technology in design practice. Ken Sanders, AIA, takes you beyond the hyperbole to discover the practical reality of using computers today. He explains their strengths and weaknesses; what these tools do and what they don't do; and how they can be used strategically and tactically to improve quality, productivity, and profits in design firms of all sizes. Drawing on his own experiences and those of colleagues from across the nation whose comments appear throughout, he provides a wealth of valuable insights and advice on: Choosing technology that leverages your professional value Integrating technology seamlessly into your firm Implementing cost-effective technology training and education Managing the digital office, including liability, privacy, and security issues Organizing the knowledge base of your firm Using the Internet's World Wide Web as a global information resource Hardware platforms, operating systems, and networks Software tools and applications, including CAD, word processing, spreadsheets, multimedia, visualization, animation, virtual reality, on-line services, and more The latest releases of major software products, including Windows 95TM and AutoCAD(r) Release 13(r) The only guide of its kind, The Digital Architect is a valuable tool for architects, engineers, designers, and all those who participate in creating the built environment.",
        "Category": " Computers , CAD-CAM",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "The Accomplice",
        "Authors": "By Ironside, Elizabeth",
        "Description": "Jean Loftus has lived at Ashe House for more than 40 years. Its tidy contours, the soft colors of the garden, speak to an orderly, gracious, supremely English life. But when workmen unearth a skeleton from that garden, the skeletons from Jean's past begin rising to the surface. The life they speak of?a childhood in Revolutionary Russia, chaotic years as a refugee between the two world wars?was neither orderly nor English. Zita Daunsey, Jean's neighbor in this cozy Sussex town, would like to help Jean protect her secrets. But this task is made more difficult with the sudden arrival of a mysterious, aggressively inquisitive Russian student. What aging sin is Jean so anxious to conceal? And at what point does Zita become an accomplice to it?",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Felony & Mayhem Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Business Communication Today",
        "Authors": "By Bovee, Courtland L., Thill, John V., and Schatzman, Barbara E.",
        "Description": "This best-selling book brings all the pieces of business communication together to give learners a realistic understanding of the fundamental concepts involved .It powerfully demonstrates how to communicate effectively through real-world company examples and real-life business situations. Readers will learn the concepts behind effective communication while developing and refining their skills to compete more successfully in today's job market  A seven-part organization covers: understanding the foundations of business communication; applying the three-step writing process; writing letters, memos, e-mail, and other brief messages; finding and communicating information; planning, writing, and completing reports and proposals; designing and delivering oral presentations; and writing employment messages and interviewing for jobs.  For corporate business communication trainers.",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "8.05",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Australia Travel Guide",
        "Authors": "By Sunset Books",
        "Description": "Offers practical planning tips for travel in each state and territory of Australia, with information on transportation, accomodations, and the country's unique attractions",
        "Category": " Travel , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Sunset Remodeling With Tile Step By Step (Sunset building and remodeling design books)",
        "Authors": "By Books, Sunset",
        "Description": "",
        "Category": "",
        "Publisher": "Sunset Books Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Night And Low-Light Photography: A Complete Guide",
        "Authors": "By Wilson, Peter and Gibbons, Bob",
        "Description": "\"Clearly explained solutions to problem lighting situations from rock concerts to sunsets. Desirable for all public libraries. Highly recommended.\"--LJ.    192 pages (45 in color), 43 b/w photos, 7 1/2 x 9 3/4.",
        "Category": " Photography , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Write it Down, Make it Happen: Knowing What You Want - and Getting It!",
        "Authors": "By Henriette Anne Klauser",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Graveyard Game",
        "Authors": "By Baker, Kage",
        "Description": "You wouldn't take Lewis for an immortal cyborg: he looks like a dapper character from a Noel Coward play. And Joseph-short and stocky in his Armani suit, with a neatly trimmed black mustache and beard that give him a cheerfully villainous look-you'd never guess that his parents drew the Neolithic cave paintings in the Cèvennes. But what are these two operatives of the Company doing in an amusement arcade in San Francisco in 1996? They're looking for Mendoza, fellow cyborg of Dr. Zeus Incorporated who has been banished Back Way Back. They're also trying to solve the mystery of her impossibly reappearing English mortal lover. Soon they will begin uncovering some extremely hush-hush stuff about what the Company has been doing with the cyborgs it no longer wants in the field. With this fourth book in the Company series, Kage Baker once again takes the reader on a wry, intelligent, and absorbing journey into the future and the past.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "13.17",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Skies Over Sweetwater",
        "Authors": "By Moberg, Julia",
        "Description": "Fictionalized history of the Women Airforce Pilots (WASP) of WWII - the first women in history trained to fly American military aircraft. Still in their teens, these courageous pioneers, heroes in their own right, left their homes to serve their country doing what they loved to do--fly! Their story inspires us all to follow our dreams and find our own place in the world through courage, integrity, and passion. Readers of all ages will love the WASP's story of achievement, friendship, and patriotism.",
        "Category": " Juvenile Fiction , People & Places , General",
        "Publisher": "Keene Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Hamsters: How to Take Care of Them and Understand Them",
        "Authors": "By Vriends, Matthew M. and Von Frisch, Otto",
        "Description": "Describes the characteristics, and behavior of hamsters, and includes information on their selection and care",
        "Category": " Pets , Reference",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Three Priests in April",
        "Authors": "By Stepanchev, Stephen",
        "Description": "",
        "Category": "",
        "Publisher": "Contemporary Poetry, 1956",
        "Price Starting With ($)": "8.85",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "The Green Pharmacy: New Discoveries in Herbal Remedies for Common Diseases and Conditions from the World's Foremost Authority on Healing Herbs",
        "Authors": "By Duke, James A.",
        "Description": "Thousands of safe, natural remedies lie untapped in jungles, forests and herbal gardens throughout the world. Now, in Green Pharmacy by James A. Duke (with illustrations by Peggy Kessler Duke), America's foremost authority on medicinal plants and herbs shares his knowledge of these hidden reserves of healing power.* For Arthritis: A new, all-natural remedy that can cut pain in half.* For Back Pain: A fruit that has anti-inflammatory properties to produce long-term relief.* For Your Heart: An herb that opens up clogged arteries and lowers blood pressure, with none of the side effects of prescription drugs.* For High Cholesterol: A tasty grain that has three times more cholesterol-lowering power than oat bran.* For Migraines: An herb that has the power to eliminate the blurred vision and debilitating pain of these monster headaches.* For Mood Swings: A common food that shares the power of Prozac to boost the brain's level of \"feel-good\" serotonin.* For Osteoporosis: A prime plant source of calcium that vastly enhances protection against bone depletion.* For Wrinkles: An herbal lotion that has the skin-clearing, wrinkle-reversing power of alpha hydroxy acid but costs only pennies.And much more-- over 120 conditions in all!",
        "Category": " Health & Fitness , Herbal Medications",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    }
]