[
    {
        "Title": "Saying Grace",
        "Authors": "By Gutcheon, Beth",
        "Description": "Rue Shaw has everything--a much loved child, a solid marriage, and a job she loves. Saying Grace takes place in Rue's mid-life, when her daughter is leaving home, her parents are failing, her husband is restless and the school she has built is being buffeted by changes in society that affect us all. Funny, rich in detail and finally stunning, this novel presents a portrait of a tight-knit community in jeopardy, and of a charming woman whose most human failing is that she wants things to stay the same.  Saying Grace is about the fragility of human happiness and the strength of convictions, about keeping faith as a couple whether it keeps one safe or not. Beth Gutcheon has a gift for creating a world in microcosm and capturing the grace in the rhythms of everyday life.",
        "Category": " Fiction , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Congress and Its Members",
        "Authors": "By Davidson, Roger H. and Oleszek, Walter J.",
        "Description": "",
        "Category": "",
        "Publisher": "Congressional Quarterly Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Fast Vegetarian Feasts",
        "Authors": "By Shulman, Martha Rose",
        "Description": "",
        "Category": "",
        "Publisher": "Dial Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1982"
        }
    },
    {
        "Title": "History's Trickiest Questions: 450 Questions That Will Stump, Amuse, and Surprise (Owl Books)",
        "Authors": "By Kuttner, Paul",
        "Description": "Collects questions and answers about history, in such categories as World War II and the Nazis, the political world, religion, and places",
        "Category": " History , United States , General",
        "Publisher": "Owlet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "The Double-edged Sword: How Character Makes And Ruins Presidents, From Washington To Clinton",
        "Authors": "By Shogan, Robert",
        "Description": "Ever since the Founding Fathers’ faith in George Washington led them to create the presidency, the issue of character has been inextricably linked to the Oval Office. The American people have always expected their presidents to serve not only as political leaders but also role models of personal behavior, setting standards for raising their children. But as the new millennium nears, character and values have taken on a significance never contemplated by Washington and the Founding Fathers. In the second half of the twentieth century, with the enfeeblement of traditional political institutions, and the explosion of electronic media, John F. Kennedy used his character to cross a new frontier into the era of the personal presidency. Democrat Kennedy blazed a trail in image manipulation which Republican Ronald Reagan carried to new heights. Then came Clinton. No president before him has been so calculating and determined in exploiting his personal life and values; yet no chief executive in modern times has been so reviled and condemned because of his personal behavior.The Double-Edged Sword: How Character Makes and Ruins Presidents, from Washington to Clinton rebuts the claim put forward by Clinton and his supporters that a President’s private life can be separated from his performance in office. By examining the morality of some of our most prominent and influential Executive Chiefs—from the birth of the Republic and the launch of the New Deal to Watergate and the Clinton presidency—Robert Shogan illustrates how the so-called character issue, and the intertwined issue of values, are linked to the political process and governance. Based on extensive research as well as interviews with politicians and journalists, the book looks at how the strengths and weaknesses of character help shape presidential performance for good and for ill. It shows how presidents and their rivals on the political stage use the public’s perceptions of presidential character to manipulate political audiences—namely, the press and the electorate. Ultimately, the book demonstrates that presidential character is a double-edged sword—a weapon that can discredit a president and destroy his credibility, but also a weapon that he can use to define himself and mobilize support—in sum, the ultimate weapon in modern American politics.",
        "Category": " Psychology , Applied Psychology",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Emily Post on Entertaining",
        "Authors": "By Elizabeth L. Post",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "You Own the Power: Stories And Exercises To Inspire And Unleash The Force Within",
        "Authors": "By Altea, Rosemary",
        "Description": "This New York Times--bestselling author, known to millions worldwide as \"the Voice of the Spirit World,\" presents a how-to book featuring stories and exercises designed to help readers raise their level of sensitivity.You already own the power to give healing, to tap your creativity, to become more intuitive. Have you longed to communicate with your loved ones who have passed over into the spirit world? You were born with the power-it's your birthright. But how do you access it?Now Rosemary Altea shows you how. In her first work of self-help, the New York Times--bestselling author of The Eagle and the Rose and Proud Spirit offers tested and proven exercises that focus on relaxation, visualization, and positive thinking as well as savoring our senses, developing intuition, and becoming aware of energy.Woven in with this rich \"how-to\" tapestry are miraculous stories of the spirit world: the time Rosemary spoke to one of the victims of TWA Flight 800; her chilling conversation with two brothers who died in a Nazi concentration camp; and much more. You already own the power to give healing, to tap your creativity, to become more intuitive. Have you longed to communicate with your loved ones who have passed over into the spirit world? You were born with the power-it's your birthright. But how do you access it?Now Rosemary Altea shows you how. In her first work of self-help, the New York Times--bestselling author of The Eagle and the Rose and Proud Spirit offers tested and proven exercises that focus on relaxation, visualization, and positive thinking as well as savoring our senses, developing intuition, and becoming aware of energy.Woven in with this rich \"how-to\" tapestry are miraculous stories of the spirit world: the time Rosemary spoke to one of the victims of TWA Flight 800; her chilling conversation with two brothers who died in a Nazi concentration camp; and much more.You already own the power to give healing, to tap your creativity, to become more intuitive. Have you longed to communicate with your loved ones who have passed over into the spirit world? You were born with the power-it's your birthright. But how do you access it?Now Rosemary Altea shows you how. In her first work of self-help, the New York Times--bestselling author of The Eagle and the Rose and Proud Spirit offers tested and proven exercises that focus on relaxation, visualization, and positive thinking as well as savoring our senses, developing intuition, and becoming aware of energy.Woven in with this rich \"how-to\" tapestry are miraculous stories of the spirit world: the time Rosemary spoke to one of the victims of TWA Flight 800; her chilling conversation with two brothers who died in a Nazi concentration camp; and much more.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Creative Explosion: An Inquiry into the Origins of Art and Religion",
        "Authors": "By Pfeiffer, John E.",
        "Description": "An analysis of the origins of the prehistoric cave paintings and sculptures of Europe examines the link between art, creativity, religion and ritual, and group solidarity",
        "Category": "",
        "Publisher": "Horizon Book Promotions",
        "Price Starting With ($)": "5.02",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Wendell Minor: Twenty-Five Years Of Book Cover Art",
        "Authors": "By Minor, Wendell, Minor, Florence Friedmann, Greenstein, Ruth, and McCullough, David G.",
        "Description": "This one-of-a-kind retrospective brings together a rich selection of pieces from Wendell Minor's extraordinary body of jacket art, coupled with lively commentary from authors and others in publishing on the relationship between a book's cover and what is inside. The volume includes over one hundred full-color reproductions of artwork from the jackets of best-selling books.",
        "Category": " Art , Individual Artists , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Negotiate to Close: How to Make More Successful Deals",
        "Authors": "By Karrass, Gary",
        "Description": "Explains the strategies, tactics, and techniques of negotiation, covering diverse types of negotiation situations, the goals of buyers, the power of taking risks, how to make concessions the smart way, how to negotiate within your own organization, and more",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Rodale's Naturally Delicious Desserts and Snacks",
        "Authors": "By Martin, Faye",
        "Description": "Tips on using such sugar substitutes as honey, molasses, and fruit juices, and details on the cooking characteristics of whole-grain flours supplement over three hundred recipes calling for the use of natural ingredients",
        "Category": " Cooking , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "Finding the Freedom of Self-Control",
        "Authors": "By Backus, William D.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "The Pudgy Where Is Your Nose? Book (Pudgy Board Books)",
        "Authors": "By Rader, Laura (ILT)",
        "Description": "Where is   your nose… your eyes… your ears? Young children can play along with the simple,   interactive text, pointing to different parts of their bodies as they turn the   pages of this fun and sturdy book.",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "The Mad Dog 100: The Greatest Sports Arguments of All Time",
        "Authors": "By Russo, Christopher and St. John, Allen",
        "Description": "THE ESSENTIAL BOOK FOR ANY SPORTS FAN, FROM ONE OF THE REIGNING KINGS OF SPORTS TALK RADIO, CHRISTOPHER “MAD DOG” RUSSOWhich was the greater achievement, Ted Williams’s .406 season or Joe DiMaggio’s 56-game hitting streak?Who’d be left standing in a battle between Joe Louis and Mohammed Ali?Which NBA team was the greatest of all time—the ’66–’67 Celtics?  The ’71–’72 Lakers?  What about the ’95–’96 Bulls?Who would dominate the ultimate Pebble Beach showdown—Ben Hogan or Tiger Woods?Who was the most important athlete of the twentieth century?You’re a sports fan.  You love a good argument and you’ll defend your position as fervently as Michael Jordan at crunch time.  You’ll analyze games and terrible calls, throw out stats to prove a point, and heatedly debate whether a player is an overachiever—or merely overpaid.  Now, in his long-awaited and completely original book, Christopher “Mad Dog” Russo sets up and breaks down the one hundred greatest sports arguments of all time.  In classic Mad Dog style, each chapter tackles a classic sports debate and takes sides with the clear, step-by-step opinions that have made Russo one of the top radio personalities in the country.  The Mad Dog 100 covers it all: from baseball (Who really should go to Cooperstown?), to basketball (Chamberlain, Russell, or Shaq: who’s the NBA’s most dominant center ever?), to football (Who is the greatest NFL quarterback ever?), to hockey (What are the greatest hockey dynasties of all time?)—and is a catch-all of other crucial modern-day sports questions like: Is instant replay really worth it?  What’s the true role of performance-enhancing drugs?  Are salary caps really necessary?Whether you’re reading The Mad Dog 100 or debating these sports arguments with friends, this is the definitive companion for any self-respecting sports fan.",
        "Category": " Sports & Recreation , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Getting Together: Building a Relationship That Gets to Yes",
        "Authors": "By Fisher, Roger",
        "Description": "Examines the various types of relationships and explains and illustrates strategies for fruitfully maintaining those relationships without crisis and regardless of changes",
        "Category": " Business & Economics , Motivational",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Biting the Moon",
        "Authors": "By Grimes, Martha",
        "Description": "She does not know who she is, where she's from, how she got here. She wakes one morning in a bed-and-breakfast alone. She is told by the owner she came in \"dead asleep\" with her father.But she knows the man is not her father. She takes her backpack, bedroll, and the wad of money she finds in his jacket and heads for the mountains, seeing in their bleak and towering landscape some kind of safety.Months later, she walks down from the mountains and into the life of fourteen-year-old Mary Dark Hope. Bound by their lack of family, their murky pasts, their affinity for animals, they set out to find the man who abducted her. Whitewater rafting, canned hunts, molestation, and murder - all move toward an inevitable and harrowing confrontation.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Another World",
        "Authors": "By Barker, Pat",
        "Description": "During the hazy Newcastle summer, Nick's grandfather Geordie lies dying. A proud, resilient man, he has long outlived his peers but not his memories of the trenches where he saw his brother die. Now, on his own deathbed, Geordie starts to relive the horrors of his youth.Meanwhile, at Lob's Hill, on the other side of the city, Nick and his pregnant wife, Fran, are failing to keep the peace in their increasingly fractious home. In an effort to unite the family, Fran persuades the children to help her redecorate the shabby living room. Gradually, as they peel the old wallpaper away, a vigorous and obscene drawing of an Edwardian family is revealed. The portrait is an exercise in hate: it lays bare the history of their home and casts a terrifying shadow over the family.As events at Lob's Hill unfold, Nick begins to learn his grandfather's buried secrets and comes to understand the power of old wounds to leak into the present.",
        "Category": " Fiction , Literary",
        "Publisher": "Farrar Straus Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The First Heroes: The Extraordinary Story of the Doolittle Raid--America's First World War II Vict ory",
        "Authors": "By Nelson, Craig",
        "Description": "Immediately after Japan's attack on Pearl Harbor, President Franklin D. Roosevelt sought to restore the honor of the United States with a dramatic act of vengeance: a retaliatory bombing raid on Tokyo. On April 18, 1942, eighty brave young men, led by the famous daredevil Jimmy Doolittle, took off from a navy carrier in the mid-Pacific on what everyone regarded as a suicide mission but instead became a resounding American victory and helped turn the tide of the war. The First Heroes is the story of that mission. Meticulously researched and based on interviews with twenty of the surviving Tokyo Raiders, this is a true account that almost defies belief, a tremendous human drama of great personal courage, and a powerful reminder that ordinary people, when faced with extraordinary circumstances, can rise to the challenge of history.",
        "Category": " History , Military , World War II",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Osteoporosis Solution",
        "Authors": "By Germano, Carl, Cabot, William, and Turner, Lisa",
        "Description": "A thorough guide to osteoporosis, a debilitating ailment affecting millions of Americans, presents new information on how to prevent and treat the illness, explaining how nutritional therapies, especially the use of ipriflavone and isoflavones, can reduce bone loss without detrimental side effects. Reprint.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Hot Chocolate for the Mystical Soul: 101 True Stories of Angels, Miracles, and Healings",
        "Authors": "By Ford, Arielle",
        "Description": "“Like a box of supernatural bonbons—once you start, it's hard to stop.”—BooklistThis enchanting book is perfect for those who love magic and mystery, and who know that an unseen, loving presence is watching over us. This is an inspiring collection of mystical experiences involving angels, miracles, near-death experiences, divine interventions, animal experiences, personal transformations, and miraculous healings. The storytellers come from all walks of life—doctors, lawyers, actors, musicians, mailmen, teachers, and others—and include familiar figures, such as Neal Donald Walsch, Judith Orloff, M.D., and Joan Borysenko. With such a wonderful variety of enlightening stories, every reader will find many that will touch them personally.",
        "Category": " Religion , Mysticism",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Where There's A Will: Curtains/The Bad Penny/Identity Crisis/Redemption",
        "Authors": "By Hailstock, Shirley, Lewis, Shelby, Anderson, Bridget, Wlalker, Margie, Hill, Donna (EDT), and Walker, Margie (EDT)",
        "Description": "Four interconnected stories follow sisters Maxine, Morgan, Taylor, and Samantha as they each inherit a case to solve when their father, the founder of Georgia's only African-American-owned PI firm, passes away, forcing them to come to terms with their past and embrace the future. Original. 30,000 first printing.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Zack Files 05: Dr. Jekyll, Orthodontist (The Zack Files)",
        "Authors": "By Davis, Jack E. (ILT) and Greenburg, Dan",
        "Description": "Zack isn't thrilled about having to get a tooth pulled, but a trip to the orthodontist proves a lot hairier than he ever expected. Nice old Dr. Silver has been replaced by the fang- toothed Dr. Jekyll, a mouthwash-guzzling mad scientist whose secret experiments have gone ker-plewy!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Leaking Laffs Between Pampers and Depends",
        "Authors": "By Johnson, Barbara",
        "Description": "Grab your giggle box! Here comes Barbara Johnson with another helping heap of joy for women of all ages, aches, and \"architecture.\"Author Barbara Johnson's encouraging book about a woman's adventures in aging, Living Somewhere Between Estrogen and Death, became the number-one best-selling paperback in the Christian market for the year in which it was published. Soon hordes of happy readers were flooding Barbara's mailbox with their own favorite jokes, touching stories, and hilarious tales of female misadventures.Now Barb has packed that amazing collection of wacky wit into this boisterously funny new book that's full of \"laff leaks\" about every stage of a woman's life?from diapers to dentures. No matter what stage of the \"hormonal cesspool\" you're splashing through, there's something here to touch your heart. You'll love Barb's quirky empty-nest de-cluttering strategies, her joyful insights on stress-soothing, husband-handling, kid-corralling, and parent-parenting in chapters like these:Having a Baby Is Like Writing a Book?Lots of Whining, Begging, and PushingWho Are These Kids, and Why Are They Calling Me Mom?I Finally Got My Head Together?Then My Body Fell ApartWe Started Out With Nothing?and Still Have Most of It LeftLeaking Laffs Between Pampers and Depends is a heart-warming ride over the waves of humor in God's endless sea of love.",
        "Category": " Humor , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Secret of the Shadow: The Power of Owning Your Whole Story",
        "Authors": "By Ford, Debbie",
        "Description": "In The Secret of the Shadow bestselling author Debbie Ford shows us how to rediscover our true essence, which is hidden in the shadows of our own dramatic life stories. In her blockbuster The Dark Side of the Light Chasers Ford introduced us to our \"shadow.\" Now she uncovers our \"Story\", the collection of beliefs, attitudes, and behaviors that prevent us from having all the love, happiness, and success we desire. She guides us to understand that bidden in the shadow of our stories is our magnificence, and our unique gift. The Secret of the Shadow shows that the stories we tell ourselves about our lives do not define who we truly are. In fact, they prevent us from grasping our purpose and potential. When we live in these stories we engage in noisy internal dialogues, self-defeating habits, and abusive behaviors. But once they are understood and processed, our traumas and failures, our pain and our discontent, will take us deep inside and return us to our Divine essence.Our personal dramas contain important information and wisdom that can help us discover our essential selves and true purpose in life. The process of making peace with our stories requires us to identify, understand, accept, and embrace everything in our past that has caused us pain. In order for us to heal, we must stop chasing what Ford calls \"the feel-good moments\" and embark on the extraordinary journey of loving and embracing all that we are. The process outlined in this book offers us a way out of the never-ending cycle of pain and discontent. Whether we suffer from depression, ill health, a sense of unworthiness, arrogance, or low self-esteem, the road to heating is the same. This clear process (including action steps and contemplations in each chapter) will help you to discover your unique purpose and realize the fulfillment of your deepest desires.As we make the inner journey of embracing our story and all its ingredients, we begin to see the life that lies ahead of us, a life that will give us the gift of our eternal selves.",
        "Category": " Self-help , Spiritual",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "A 4th Course of Chicken Soup for the Soul: 101 More Stories to Open the Heart and Rekindle the Spirit",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), McCarty, Meladee (COM), and McCarty, Hanoch (COM)",
        "Description": "NEW YORK TIMES BESTSELLER!The fourth installment in the Chicken Soup for the Soul series promises to be even more popular than its predecessors. The perfect gift for friends, family and business associates is now available in A 4th Course.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Hci",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Presumption of Death",
        "Authors": "By O'Shaughnessy, Perri",
        "Description": "New York Times bestselling author Perri O’Shaughnessy has garnered impressive acclaim for her tough, passionate thrillers set against the lush Lake Tahoe landscape and the world of one remarkable character: Attorney Nina Reilly. In this spellbinding new novel, O’Shaughnessy delves deeper into the heart and psyche of her popular heroine as Nina journeys back to her hometown to heal old wounds, and instead discovers that old secrets can be the deadliest kind....Nina Reilly needs a fresh start.  In three years, she’s taken on some of Lake Tahoe’s most controversial cases and has turned her struggling one-woman law firm into a thriving practice. Now she’s ready to sort out her complex relationship with her boyfriend, Monterey P.I. Paul van Wagoner. So she’s heading to the Carmel Valley, the place where she began her career and where her estranged father lives. It’s also a place of dramatic contradictions and hidden tensions, of new wealth and old families.  And, within days of her arrival, Nina is already feeling the heat, as a case of arson exposes some of the darkest secrets of  her hometown. Two suspicious fires have already raged through the valley this summer, igniting suspicions of arson. When a third blaze ends in a fatality, police zero in on a suspect: Wish, the son of Sandy Whitefeather, Nina’s ex-assistant. The dead man is identified as Wish’s childhood friend, a troubled local auto mechanic who hated the changes wealthy newcomers had brought to the valley. Nina and Paul are certain that there is more to this strange case than meets the eye. As they work together to clear Wish, new, more frightening questions are raised, and another fire is set. And out of the flames a terrifying picture emerges: a community steeped in secrets and rage, a tangled history between two men, and a killer whose motives are dark and wrenching. With the relentless page-turning suspense that has become her trademark, Perri O’Shaughnessy once again demonstrates her talent to enthrall. A haunting tale of crime and punishment, old grudges and second chances, Presumption of Death is suspense fiction at its finest--instantly compelling and utterly impossible to put down.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Clifford the Big Red Dog: Clifford's Manners",
        "Authors": "By Bridwell, Norman and Bridwell, Norman (ILT)",
        "Description": "Clifford, the big red dog, displays his good manners by saying \"please\" and \"thank you,\" waiting his turn, sharing, and being a good sport in games",
        "Category": " Juvenile Fiction , Social Themes , Manners & Etiquette",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Outwit Your Weight: Fat-Proof Your Life With More Than 200 Tips, Tools, & Techniques to Help You Defeat Your Diet Danger Zones",
        "Authors": "By Vantine, Julia and Nonas, Cathy",
        "Description": "Get ready to discover a totally new way to think about weight control-- a system that virtually guarantees success! Years of working with overweight men and women has convinced weight-loss expert Cathy Nonas that there's only one surefire way to lose weight and keep it off. And it isn't dieting. It's learning to use tools-- small, yet ingenious tips, tricks, and techniques that help keep your eating and exercise habits on track-- no matter what diet you're on. Here, Cathy reveals more than 200 tools \"road-tested\" by her thousands of clients that will help you eat smarter, get and stay active, and break through self-destructive thinking patterns and behaviors that have sabotaged your weight-control efforts in the past. You'll also find: * The Eating Assessment Test (EAT), which helps you decipher your eating style and discover the patterns and pitfalls that stand in the way of having a slimmer, healthier body.* The Top 40 Diet Danger Zones-- the traps and pitfalls that typically cause us to abandon our weight-control programs.* Worksheets and quizzes throughout the book that allow you to think about weight loss from your own perspective.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.57",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Knight of the Sacred Lake (Guenevere Novels)",
        "Authors": "By Miles, Rosalind",
        "Description": "As High King and Queen, Arthur and Guenevere reign supreme across the many kingdoms and islands of Great Britain. Reconciled with Arthur, Guenevere secretly mourns the loss of her beloved Lancelot, who has returned to the Sacred Lake of his boyhood, hoping to restore his faith in chivalry in the place where he first learned to be a knight. New knights are sworn to the Round Table, including Arthur's nephews, the cunning Agravain and his heroic brother Gawain. Camelot is reborn in all its glory, and after many years of strife, peace is restored to Guenevere's realm.But betrayal, jealousy, and ancient blood feuds fester unseen. Morgan Le Fay, now the proud possessor of Arthur's only son, Mordred, has become the focus of Merlin's age-old quest to ensure the survival of the house of Pendragon at all costs. And from the east comes the shattering news that Guenevere may have a rival for Lancelot's love. Roman priests threaten the sanctity of the Hallows and the life of the Lady herself. At the center of the storm is Guenevere, a proud and powerful queen torn between her love for her husband, her people, and her knight, Sir Lancelot of the Lake.",
        "Category": " Fiction , Historical",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Never Again?: The Threat of the New Anti-Semitism",
        "Authors": "By Foxman, Abraham",
        "Description": "The ongoing war on terror, instability in the Middle East, and a faltering world economy are capturing headlines everywhere. But through it all runs a disturbing current of which many people are only dimly aware.Anti-Semitism, which had been on the decline worldwide since the end of World War II, has over the past few years made a perilous return. How could the twenty-first century -- the new millennium launched with such optimism just a few short years ago -- have so quickly been marred by the emergence of age-old hatreds, now armed with the powers of global terrorism?As national director of the Anti-Defamation League, Abraham H. Foxman fights against the menace of intolerance every day. As a result of the disturbing events of the last few years, he is convinced that we currently face as great a threat to the safety and security of the Jewish people as we faced in the 1930s. Foxman writes: \"Within living memory, we’ve seen what can happen when a nation or a continent experiences an unrestrained outbreak of anti-Semitism. The Jews of the world -- and all people of goodwill who share their desire for a just and free society -- learned a series of critical lessons from the tragic history of the twentieth century. Today, we understand how important it is to recognize the emergence of new forms of anti-Semitism so that we can warn the world and stave off the worst effects.\"Anti-Semitism remains a pernicious form of ethnic and religious intolerance, with consequences for all of humankind. In communities from the United States to the Middle East, Europe to South Africa and Latin America, Jews are being persecuted in old and new ways. Exploring the history of anti-Semitism and providing the first comprehensive examination of the new rampant anti-Jewish sentiment worldwide, Never Again? offers a crucial discussion of the steps that must be taken to prevent this century from witnessing a replay of the horrors of the last.",
        "Category": " Social Science , Discrimination & Race Relations",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Night of Broken Souls",
        "Authors": "By Monteleone, Thomas F.",
        "Description": "Psychiatrist J. Michael Keating is at work in his plush Manhattan office when a young stranger, Allison Enders, bursts wild-eyed into the room, ready to kill herself rather than endure her recurring nightmares. Keating saves his unexpected \"patient\" and soon discovers that the Enders case is not unique.Around the world, all kinds of people - cabbies, homemakers, even a CIA agent - are suffering from blackouts and nearly identical, vivid nightmares. All their dreams feature concentration camps and the same sadistic psychopath: a man known only as Der Klein Engel, The Little Angel. Keating is appalled, and determined to find the nightmares' terrifying connection to the Holocaust.Keating is even more shocked when an FBI agent tells him that the dreamers are being systematically, horribly murdered. Together with an Orthodox rabbi and agent Brad Stevenson, Keating plunges into the mystery.Incredibly, the broken souls of the Six Million are returning, trying, once again, desperately, to be heard - because somehow The Little Angel is back.Could it be possible that one of history's monsters is bridging the chasm from eternal death? And if so, how many more may follow in his bloodstained path?",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Shout! the Beatles in Their Generation",
        "Authors": "By Norman, Philip",
        "Description": "A fresh look at the story of the Beatles' rise to success and the people who helped them develop their music, image, and style",
        "Category": "",
        "Publisher": "Fireside",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "Develop Your Psychic Skills",
        "Authors": "By Hoffman, Enid",
        "Description": "",
        "Category": " Body, Mind & Spirit , Astrology , General",
        "Publisher": "Para Research",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Use Me: Fiction",
        "Authors": "By Schappell, Elissa",
        "Description": "A debut novel told in ten interconnecting stories captures the most profound moments and experiences in a young woman's life, as she grows from a rebellious suburban adolescent to complex adult in New York City and struggles to establish intimate relationships with the men in her life while maintaining a link with her best friend and sometime competitor. Reprint. 35,000 first printing.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "8.04",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "National Geographic Traveler: Paris",
        "Authors": "By Davidson, Lisa",
        "Description": "Take a tour of Paris guided by National Geographic -- for generations synonymous with the thrill of discovery and exploration. Featured sites include both famous and lesser known places, selected to help you experience the city in a fresh and exciting way.  * In-depth site descriptions and background information * Insightful features on history, culture, and contemporary life * More than 190 vivid color photographs * 20 detailed, full-color maps * Mapped walking tours * Specially commissioned artwork and floor plans * Clear, easy-to-use design * Complete visitor information plus hotels, restaurants, shopping, and entertainment",
        "Category": " Travel , Europe , France",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Marshal Zhukov's greatest battles,",
        "Authors": "By Zhukov, Georgii Konstantinovich",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "7.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Wicked Women 101",
        "Authors": "By Carr, Susanna",
        "Description": "A trio of wild and witty romance novellas chronicles the romantic escapades of three former sorority sisters--Amy Bryce, who is out to escape her reputation as a good girl; codebreaker Jennifer Clark who finds love with fellow agent Bryan Matthews; and former college brainiac Caroline Mitchell--in a collection that includes Six Weeks to Sensuality, Code Pink, and Fantasies Are Forever. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Introduction to French Poetry (Dual-Language) (English and French Edition)",
        "Authors": "By Appelbaum, Stanley (EDT)",
        "Description": "An unusually useful survey of the development of French poetry, this book anthologizes works by France&#39;s finest and most influential poets — 30 in all — from the mid-fifteenth century to our own time. Included are such luminaries as Charles d&#39;Orléans, François Villon, Joachim du Bellay, Ronsard, La Fontaine, Voltaire, Chénier, Hugo, Musset, Gautier, Vigny, Baudelaire, Mallarmé, Verlaine, Rimbaud, Claudel, Valéry, Apollinaire, Perse, Éluard, and Bonnefoy. In addition the work of poets less familiar to the English-speaking world, yet instrumental in the formulation of the French tradition — Scève, Saint-Amant, Malherbe — is here as well. The French texts come from the best critical editions, or in the case of the moderns, those authorized by the poets themselves. Teachers of French will appreciate the clear prose translations on facing pages; the translator does not attempt to be a poet himself, rather to lead the reader to a full appreciation of the poem as it was written. An introductory essay gives as understandable a short summary of the formal aspects of versification as can be found anywhere — the early orthodoxy of rhyme and meter, the gradual introduction of enjambment and metrical variation, through the word games and innovations of Apollinaire and his circle. A biographical and critical essay on each poet and his work not only depicts the poet as an individual but also gives a fine sense of the progressing and changing tradition of French poetry itself. An illustration, usually a portrait of the poet, accompanies each selection. The clarity and comprehensiveness of this attractive anthology (as well as its low cost) make it an ideal volume for an introductory survey of French poetry. For the student just beginning the study of French, this book is good supplementary material; the format of this book makes it easy to experience French poetry and learn vocabulary and grammar at the same time.",
        "Category": " Poetry , European , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Psychology",
        "Authors": "By Johnston, Joni E.",
        "Description": "You're no idiot, of course. You know that id, ego, and superego aren't the names of characters in an intergalactic comic strip and that the Oedipus complex isn't a giant sports arena. But when it comes to understanding the ABCs of psychology, you draw a complete mental blank. Don't develop an inadequacy complex just yet! The Complete Idiot's Guide to Psychology is an easy-to-understand primer to a field that even today remains shrouded in mystery. In this Complete Idiot's Guide, you get:",
        "Category": " Psychology , Reference",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.86",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Herbs for Your Health: A Handy Guide for Knowing and Using 50 Common Herbs",
        "Authors": "By Foster, Steven",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Interweave Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Coastliners: A Novel",
        "Authors": "By Harris, Joanne",
        "Description": "Joanne Harris writes fiction that engages every one of the senses: reviewers called Chocolat \"delectable\" and Five Quarters of the Orange \"sweet and powerful.\" In her new novel, she takes readers to a tiny French island where you can almost taste the salt on your lips.The island, called Le Devin, is shaped somewhat like a sleeping woman. At her head is the village of Les Salants, while the more prosperous village of La Houssinière lies at her feet. You could walk between the towns in an hour, but they could not feel further apart, for between them lie years of animosity. The townspeople of Les Salants say that if you kiss the feet of their patron saint and spit three times, something you've lost will come back to you. And so Madeleine, who grew up on the island, returns after an absence of ten years spent in Paris. She is haunted by this place, and has never been able to feel at home anywhere else.But when she arrives, she will find that her father -- who once built fishing boats that fueled the town's livelihood -- has become even more silent than ever, withdrawing almost completely into an interior world. And his decline seems reflected in the town itself, for when the only beach in Les Salants washed away, all tourism drifted back to La Houssinière.Madeleine herself has been adrift for a long time, yet almost against her will she soon finds herself united with the village's other lost souls is a struggle for survival and salvation.",
        "Category": " Fiction , Literary",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Heir",
        "Authors": "By Lindsey, Johanna",
        "Description": "The many wondrous gifts of Johanna Lindsey—her fiery and endearing characters, her enthralling stories, her ingenious blending of passion, wit, and emotion—are all on glorious display in this  unforgettable tale about an unwanted title and an unexpected love.Has anyone in London ever taken part in the coming-out Season with less enthusiasm than Sabrina? Luckily, the most sought-after lady in the city has agreed to usher this young, lovely country girl through the perils and pitfalls of  her all-important first season.Dashing highlander Duncan MacTavish is even less keen to be in London. Having recently learned he is the sole heir of an English marquis, Duncan is now required to assume his grandfather's title and estates—and to marry Sabrina's ravishing, viper-tongued guide, who has been heard to make scathing  statements in public about her \"Scottish barbarian\" groom-to-be.His unwanted betrothal, however, has brought Duncan into close proximity with the enchanting Sabrina—a kindred spirit whose wit delights him . . . and whose essence is the exquisite stuff of dreams. But duty, station, and a secret that dwells in the lady's past forbid Sabrina's and Duncan's desired union—unless true love can somehow miraculously find a way.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Wedding Pictures A Novel",
        "Authors": "By Carey, Jacqueline and Osborn, Kathy",
        "Description": "Bonnie and Kip just want to get married (maybe). Tansy just can't believe that anyone would want to get married. George and Fay just hope that nobody finds out about their affair. Lorraine, George's wife, just has a strange sinking sensation. Bonnie's mother just wishes the bride would wear a more traditional dress.With a wry sense of humor and an infallible ear for dialogue, Jacqueline Carey captures the obsessions of her generation as they discuss relationships, faith, betrayal, and clothes - all while preparing to attend a rather eventful wedding. New Yorker artist Kathy Osborn combines a detective's eye and an exquisite sensibility in her whimsical paintings, which complement the story by laying bare details that the text keeps secret.A delicious combination of Much Ado about Nothing and an Archie comic book, this urbane, witty novel is perfect for people who can't believe they're finally getting married and for people who swear they'll never get married.",
        "Category": " Fiction , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Omerta (Godfather, Book 3)",
        "Authors": "By Puzo, Mario",
        "Description": "Don Raymonde Aprile is an old man wily enough to retire gracefully from organized crime after a lifetime of ruthless conquest. Having kept his three children at a distance, he's ensured that they are now respectable members of the establishment. To protect them from harm, and to maintain his entree into the legitimate world of international banking, Don Aprile has adopted a \"nephew\" from Sicily, Astorre Viola, whose legal guardian made the unfortunate decision to commit suicide in the trunk of a car.Though Don Aprile's retirement is seen as a business opportunity by his last Mafia rival, Timmona Portella, it is viewed with suspicion by Kurt Cilke, the FBI's special agent in charge of investigating organized crime. Cilke has achieved remarkable success in breaking down the bonds between families, cultivating high-ranking sources who in return for federal protection have violated omerta - Sicilian for \"code of silence,\" the vow among men of honor that, until recently, kept them from betraying their secrets to the authorities.As Cilke and the FBI mount their campaign to wipe out the Mafia once and for all, Astorre Viola and the Apriles find themselves in the midst of one last war, a conflict in which it is hard to distinguish who, if anyone, is on the right side of the law, and whether mercy or vengeance is the best course of action.",
        "Category": " Fiction , Sagas",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Modular Brain",
        "Authors": "By Restak, Richard M.",
        "Description": "Predicts what research may reveal in the next ten years in the field of neuroscience and explains the current modular concept of the brain's organization",
        "Category": " Psychology , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Pursuit of Alice Thrift",
        "Authors": "By Lipman, Elinor",
        "Description": "Workaholic wallflower Alice Thrift, a socially inept surgical intern at a Boston hospital, is pursued romantically by Ray Russo, a social-climbing, somewhat shady purveyor of carnival fudge, until her roommate, nurse Leo Frawley, and neighbor, Dr. Sylvie Schwartz, decide to take on the task of guiding Alice through the social complexities of life. 50,000 first printing.",
        "Category": " Fiction , Family Life",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Falling from Fire",
        "Authors": "By Booth, Teena",
        "Description": "High school freshman Teri Dinsmore is a nobody. Daughter of the oft-married “Best Lookin’ Gal in Town,” younger sister of a popular member of the “rowdies,” her only real friend is the rumpled, eccentric Wesley.Then a fire, indirectly caused by her birthday celebration, burns down her home and sends her family into a tailspin. All of a sudden Teri begins to see herself and her family in a whole new way. At school, everyone knows who Teri is, including Doug, her secret crush. Even Wesley, the most maddening person she knows, is looking at her with a new light in his eye. When her past disappears in the fire, Teri must put the pieces of her life back together, this time in a way that really fits.",
        "Category": " Young Adult Fiction , Social Themes , Self-Esteem & Self-Reliance",
        "Publisher": "Wendy Lamb Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Only Love",
        "Authors": "By Segal, Erich",
        "Description": "Dr. Matthew Hiller is about to face the most difficult moment of his life. The brilliant neurosurgeon's next case is not simply a suffering patient for whom he is the last hope. It is Silvia - his only love.Now married to one of the richest men in the world, Silvia can still evoke the same feelings in him that she did so long ago.Even after all this time, he has not recovered from her unexplained disappearance on the eve of their marriage - and thoughts of her have haunted him ever since.As a doctor, he must try to help her. As a spurned lover - and a married man - he must try to forget the past. And he dares not think about what might happen if he actually succeeds in saving her life...",
        "Category": " Fiction , Literary",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Assertiveness Skills: 12 Action Steps to Create Visibility and Take Charge of Your Life (Communication Series)",
        "Authors": "By Cohen, Gail",
        "Description": "",
        "Category": "",
        "Publisher": "Natl Seminars Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Around the Southern Table",
        "Authors": "By Belk, Sarah",
        "Description": "A compendium of traditional Southern-style cuisine provides some two hundred recipes that emphasize healthful, easy-to-prepare, taste-tempting dishes, accompanied by historical anecdotes, personal stories, and regional quotes",
        "Category": " Cooking , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "A Fortune at Your Feet: How You Can Get Rich, Stay Rich, and Enjoy Being Rich with Creative Real Estate",
        "Authors": "By A. D. Kessler Ph.D.",
        "Description": "",
        "Category": "",
        "Publisher": "Fortune House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Who's Had Who",
        "Authors": "By Curtis, Richard, Fielding, Helen, and Bell, Simon",
        "Description": "",
        "Category": "",
        "Publisher": "qpb",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "World Economy: Trade and Finance",
        "Authors": "By Yarbrough, Beth V. and Yarbrough, Robert M.",
        "Description": "Depth of theoretical content combined with current events and policy debates makes The World Economy: Trade and Finance, 5/e an excellent choice for a broad range of trade and finance courses with an international economic focus. Yarbrough and Yarbrough discuss countries, trade policies, and economic applications with the inclusion of more institutional detail and in-text examples than found in competing textbooks.",
        "Category": " Business & Economics , International , General",
        "Publisher": "South-Western College Pub",
        "Price Starting With ($)": "8.2",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Project Management: A Systems Approach to Planning, Scheduling, and Controlling",
        "Authors": "By Kerzner, Harold",
        "Description": "This text for undergraduate and graduate courses in business and engineering covers basic principles and concepts of project management in depth, with 46 case studies and many sample problems across a range of industries. The structure of the text reflects the importance of behavioral rather than quantitative aspects of project management. Early chapters present core topics and deal with support functions and executive involvement. Later chapters look at quantitative issues such as planning and cost control, and cover more advanced topics such as managing cultural differences, quality management, concurrent engineering, and contracts and procurement. Kerzner teaches systems management at Baldwin-Wallace College. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Technology & Engineering , Industrial Engineering",
        "Publisher": "Wiley",
        "Price Starting With ($)": "8.49",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Babe: The Legend Comes to Life",
        "Authors": "By Creamer, Robert W.",
        "Description": "\"I swing big, with everything I've got. I hit big or I miss big. I like to live as big as I can.\" -- Babe RuthBabe Ruth is without a doubt the most famous character ever produced by the sport of baseball. A legendary player, world-famous for his hitting prowess, he transcended the sport to enter the mainstream of American life as an authentic folk hero.In this extraordinary biography, noted sportswriter Robert W. Creamer reveals the complex man behind the sports legend. From Ruth's early days in a Baltimore orphanage, to the glory days with the Yankees, to his later years, Creamer has drawn a classic portrait of an American original.",
        "Category": " Sports & Recreation , History",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Model Behavior: A Novel and 7 Stories",
        "Authors": "By McInerney, Jay",
        "Description": "Seven pieces of short fiction accompany the title novel about celebrity journalist Connor McKnight, who is forced to confront a suddenly remote, longtime girlfriend, anxieties about his life and career, and confusion over his future. By the author of Bright Lights, Big City. 25,000 first printing. Tour.",
        "Category": " Fiction , Literary",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "In the Spirit: The Inspirational Writings",
        "Authors": "By Taylor, Susan L.",
        "Description": "Twenty-two lifelines to personal growth and fulfillment from the editor in chief of Essence magazine.  When Susan L. Taylor rose to editor in chief of Essence magazine more than a decade ago, she began writing an editorial column in which she shares her thoughts  and feelings about how developing one&#39;s inner awareness ensures the wisdom and clarity needed to create a deeply satisfying and fulfilling life.  The monthly column called \"In the Spirit\" is one of the most popular in the magazine.  Susan L. Taylor connects with the reader in a personal and meaningful way, in a voice that is sisterly, informed, and motivating. She challenges her readers to transcend their fears, to face inevitable challenges in their lives courageously, and to use change as an opportunity to grow. \"We limit ourselves because change may well mean dealing with the disapproval of the very people we rely on for support. Often words of inspiration and motivation, but she also suggests specific methods for working through problems and improving our emotional and spiritual health.  \"We are not powerless spectators of life. We are co-creators with God, and all around is are the gifts, the clay, that we can use to shape our world,\" she says. Susan L. Taylor writes passionately about what she has seen and learned in the course of her travels throughout the United States, Caribbean, and Africa. Her essays have helped many to balance the demanding world of work and business with the personal world of family and friendship. She shares bits of her own life--her loves, her trails, and triumphs--and the lessons she&#39;s learned.  Many of Susan L. Taylor&#39;s readers already collect her editorials and find in them a source of encouragement, self-affirmation, empowerment, and peace of mind. Now they can have new essays and a few previously published favorites elegantly bound in a gift-sized paperback edition to keep for themselves or to give as a gift of love to those who are special to them.",
        "Category": " Religion , Inspirational",
        "Publisher": "HarperPerennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "23 Days in July: Inside the Tour de France and Lance Armstrong's Record-Breaking Victory",
        "Authors": "By Wilcockson, John and Watson, Graham (ILT)",
        "Description": "Taking place over twenty-three days in July and across more than 2,100 miles of smooth blacktop, rough cobblestones, and punishing mountain terrain, the Tour de France is the most grueling sports event in the world. And in 2004, five-time champion Lance Armstrong set out to achieve what no other cyclist in the 100-year history of the race had ever done: win a sixth Tour de France.Armstrong had four serious challengers who wanted nothing more than to deny the man the French call Le Boss from achieving his goal. The major threat among them was the only other former Tour de France champion in last year's race, Germany's Jan Ullrich- The Kaiser. But when the race was over, Lance Armstrong once again wore the yellow jersey of victory.",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Travel Detective: How to Get the Best Service and the Best Deals from Airlines, Hotels, Cruise Ships, and Car Rental Agencies",
        "Authors": "By Greenberg, Peter",
        "Description": "Renowned travel authority and NBC Today show travel editor Peter Greenberg shares his insider secrets.  Americans now travel more than ever before.  Yet as our traveling has increased, the service we receive from airlines, hotels, and other agencies has deteriorated dramatically.  Industry surveys reveal what you already feel: growing dissatisfaction among travelers of every age, income, and education level. We've been abused by the travel experience. Peter Greenberg is here to help. The Travel Detective tells you the things most travel agents can't — or sometimes just won't — tell you.   In his characteristic friendly and conversational tone, Greenberg tells how to find the secret walk-up fares that can save air travelers hundreds, if not thousands of dollars on last minutes flights; which coach seats on which planes are better than first class; the secret rule to know to avoid being bumped from a flight, which cruise ship brochures lie; which credit card companies are fastest — and slowest — to come to your aid in a foreign land, or worse, in the U.S.,; which hotels have the best — and the worst — fire and crime safety records, and how you can protect yourself; how to negotiate the best hotel room deal; which hotels have the worst water pressure in their showers (and better yet, how you can get great water pressure, even at those hotels); and much, much more. Accessible and entertaining, The Travel Detective gives you the information and tools you need to make every trip an affordable pleasure.",
        "Category": " Travel , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Joey Green's Incredible Country Store: Potions, Notions and Elixirs of the Past--and How to Make Them Today",
        "Authors": "By Green, Joey",
        "Description": "To wander through the pages of Joey Green's Incredible Country Store is to experience the innocence and warmth of a bygone era. In this treasury of tips, recipes, and make-it-yourself concoctions, you will discover which country-store gadgets and gizmos have stood the test of time-and which are now collectors' items. You'll find recipes for homemade soaps, candles, perfumes, elixirs, and candies; directions on how to make those wonderful old wooden toys; and illustrations of those confounding brainteaser puzzles from the Ozarks. Some other treats that await you include:- Secret formulas for old-time, brand-name products you can make at home-for just pennies.  Make your own Chanel No. 5, Chap Stick, Play-Dough, Tiger Balm, and more- The history, lore, and strange facts behind famous country-store brands and the stores themselves - Dozens of Joey Green's trademark wacky facts thrown in for good measure--Did you know that Melanie's pregnancy in Gone with the Wind, when calculated by the dates of the Civil War battles mentioned, lasted 21 months? That collectors value some old Cracker Jack prizes as high as $7,000? That originally the cream filling in Oreo cookies was made with pork lard?Crammed with vintage advertisements and 357 photographs of curiosities from the past, Joey Green's Incredible Country Store has irresistible retro appeal-and makes a great gift!",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Traitor",
        "Authors": "By Sherman, Dan",
        "Description": "",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Donald I. Fine",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Family Circle Step-by-step: Tastes of the Mediterranean (Family Circle Step-by-step)",
        "Authors": "By",
        "Description": "This work sets out to bring the taste of the Mediterranean right into the home kitchen. It includes clear step-by-step instructions so the reader can cook with confidence with traditional recipes.",
        "Category": " Cooking , Regional & Ethnic , General",
        "Publisher": "Murdoch Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "He Did This Just For You New Testament With Reflections From Max Lucado",
        "Authors": "By Max Lucado",
        "Description": "The perfect New Testament for seekers or new believers who want to start reading God's Word but are not sure where to begin or are intimidated by the full Bible.  Building on the very successful He Did This Just For You Gospel and He Chose The Nails book by Max Lucado, we're pleased to introduce the He Did This Just For You New Testament.  It includes a 4-page article by Max Lucado which reviews the plan of salvation, discusses one's new life in Christ, and tells readers how to use the features of this New Testament.  And there are 30, two-page reflections from Max Lucado that provide an accessible way to get into the Bible and learn about the Christian faith.",
        "Category": " Bibles , Other Translations , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Pooh's Little Etiquette Book",
        "Authors": "By Milne, A. A., Shepard, Ernest H. (ILT), and France, Melissa Dorfman",
        "Description": "Winnie-the-Pooh knows that five minutes to eleven is when a Smackerel of Something should be served. And he knows the difference between a Proper Tea (which is what you'll get at Owl's house) and a Very Nearly Tea (which is one you forget about afterward). For those less versed in the Right Way of Doing Things comes this whimsical little etiquette book. On topics ranging from Conversation to Eating to Visiting, readers will be treated to - and instructed in - the finer points of life in the Hundred Acre Wood.Did you know that it isn't polite to ask for a bit of bread and honey, but it is perfectly acceptable to look wistfully in the direction of the cupboard? With wry humor and a point of view that could only come from a certain Enchanted Place, this irresistible little book is a must-read for fans of Our Bear. After all, it's the Proper Thing to Do!",
        "Category": " Juvenile Nonfiction , Social Topics , Manners & Etiquette",
        "Publisher": "Dutton Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Azerbaijan miniature (English and Russian Edition)",
        "Authors": "By Kerimov, Kerim",
        "Description": "",
        "Category": "",
        "Publisher": "Baky Ishbig",
        "Price Starting With ($)": "47.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Super Simple Paper Airplanes: Step-by-step Instructions to Make Planes That Really Fly..",
        "Authors": "By Nick Robinson",
        "Description": "",
        "Category": "",
        "Publisher": "Sterling*+ Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The New Paradigm in Business (New Consciousness Reader)",
        "Authors": "By Ray, Michael L. and Rinzler, Alan (EDT)",
        "Description": "Discusses competition, corporate ethics, women in the workplace, the nature of ownership, and the role of business in social change",
        "Category": " Business & Economics , Management",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Journey to Center: Lessons in Unifying Body, Mind, and Spirit",
        "Authors": "By Crum, Thomas F.",
        "Description": "Vital techniques needed to achieve a more relaxed, energized, and integrated approach to our lives.This practical guide introduces readers to the Zen principles Tom Crum has lived by and taught for many years. As a black belt in aikido, a motivational speaker, and an instructor in everything from mathematics to skiing, Crum learned that the key to success in any endeavor is mastering the art of \"centering.\" He teaches here the vital techniques for achieving a more relaxed, energized, and integrated approach to our lives.",
        "Category": " Self-help , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Year of Jubilo: A Novel of the Civil War",
        "Authors": "By Bahr, Howard",
        "Description": "On a spring day in 1865 Gawain Harper trudges toward his home in Cumberland, Mississippi, where three years earlier he had boarded a train carrying the latest enlistees in the Mississippi Infantry. Unmoved by the cause that motivated so many others, he had joined up only when Morgan Rhea's father told Gawain that he would never wed his beloved Morgan unless he did his part in the war effort. Upon his return, he discovers post-war life is far from what he expected. Morgan has indeed waited for him, but before they can marry there are scores to be settled.",
        "Category": " Fiction , Literary",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Long for This World: A Novel",
        "Authors": "By Byers, Michael",
        "Description": "A wise and richly symphonic first novel, Long for This World is a thoroughly contemporary family drama that hinges on a riveting medical dilemma. Dr. Henry Moss is a dedicated geneticist who stumbles upon a possible cure for a disease that causes rapid aging and early death in children. Although his discovery may hold the key to eternal youth, exploiting it is an ethical minefield. Henry must make a painful choice: he can save the life of a critically ill boy he has grown to love — at the cost of his career — or he can sell his findings for a fortune to match the wealth of his dot-com-rich Seattle neighbors. Henry turns to his family for support, and in their intimately detailed lives unfolds a story of unforgettable characters grappling with their own demons.",
        "Category": " Fiction , Literary",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Civil War Women II: Stories by Women About Women (Civil War Series)",
        "Authors": "By Greenberg, Martin Harry (EDT), McSherry, Frank D. (EDT), and Waugh, Charles G. (EDT)",
        "Description": "A collection of stories offers a look at life as a woman during the Civil War, by such writers as Edith Wharton and Louise May Alcott",
        "Category": " Young Adult Fiction , Historical , United States , Civil War Period (1850-1877)",
        "Publisher": "August House Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Five Minute Iliad Other Instant Classics: Great Books For The Short Attention Span",
        "Authors": "By Nagan, Greg",
        "Description": "Was Homer really blind, or was that just his shtick? Was Dante a righty or a lefty? Why aren't there any pictures of Jane Austen in a bikini? What made Oscar so Wilde? How much did Hemingway? These are just some of the many great questions of Western literature ignored in this book.  From the author of A Prairie Home Companion's beloved \"Five-Minute Classics\" comes The Five-Minute Iliad and Other Instant Classics, a witty and profane lampoon of the Western literary canon -- the Spinal Tap of literature.  \"I will never write such wordy trash again,\" Leo Tolstoy said of War and Peace after reading Homer in the original Greek. Tolstoy's pledge inspired humorist Greg Nagan to whet his double-edged verbal sword and offer this gleefully twisted take on what contemporary readings of the Great Books say about our society today.  From The Iliad to On the Road, these fifteen parodies provide a riotous romp through Western civilization (one version of it, anyway) from Homer to Kerouac, from Ancient Greece to Postwar America, from the Lyrical Epic to the Breathless Gush. Nagan's mirthful mayhem will delight those who've read the Great Books, and those who haven't read them will find these literary caricatures entertaining in their own right.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Dostoevsky's Last Night",
        "Authors": "By Rossi, Cristina Peri and Dail, Laura C. (TRN)",
        "Description": "Controlled and devoured by his addiction to gambling, Jorge enlists the help of Lucia, a beautiful analyst, in a battle of wits for his soul",
        "Category": " Fiction , General",
        "Publisher": "Picador USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "The Story of Henri Tod",
        "Authors": "By Buckley, William F.",
        "Description": "Suave CIA agent Blackford Oakes returns to attempt to keep the Soviets from dividing Berlin with the infamous Berlin Wall, in a story of international intrigue, political machinations, and espionage set during the height of the Cold War",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Saint Joan: A Chronicle Play in Six Scenes and an Epilogue (Shaw Library)",
        "Authors": "By Shaw, Bernard and Laurence, Dan H.",
        "Description": "With Saint Joan, Shaw reached the height of his fame as a dramatist. In this play he distilled many of the ideas he had been trying to express in earlier works on the sublects of politics, religion and creative evolution. Fascinated by the story of Joan of Arc, but unhappy with the way she had traditionally been depicted, Shaw wanted to remove 'the whitewash which disfigures her beyond recognition'. He presents a realistic Joan: proud, intolerant, naive, foolhardy, always brave - a rebel who challenged the conventions and values of her day.",
        "Category": " Drama , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The hesitant heart",
        "Authors": "By Edwards, Anne",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Writing themes about literature",
        "Authors": "By Roberts, Edgar V.",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Pillar of the Sky",
        "Authors": "By Holland, Cecelia",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "The Ultimate Frankenstein: New Stories by Some of the World's Leading Authors",
        "Authors": "By Preiss, Byron, Keller, David, Miller, Megan, and Betancourt, John (EDT)",
        "Description": "A collection of stories inspired by Mary Shelley's \"Frankenstein\" includes contributions by Brian Aldiss, Loren D. Estleman, Garfield Reeves-Stevens, S.P. Somtow, Chelsea Quinn Yarbro, and Kurt Vonnegut",
        "Category": " Fiction , Horror",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Air Battle Force",
        "Authors": "By Brown, Dale",
        "Description": "Edge-of-Your-Seat Action from theMaster of High-Flying AdventureDale Brown is the author of fourteen New York Times bestsellers, and now he soars to new heights with this outstanding, realistic thriller of warfare and global politics that rivals any headline we can imagine.On America's newest combat base, U.S. Air Force aerial warfare expert Major General Patrick McLanahan and his crew of daring engineers are devising the air combat unit of the future. Known as Air Battle Force, it can launch concentrated, stealthy, precision-guided firepower to any spot on the globe within hours. And soon McLanahan and his warriors will have their first target.Chased out of Afghanistan, Taliban fighters are planning to invade the neighboring oil-rich Republic of Turkmenistan, an isolated and incredibly wealthy Central Asian state. As unsteady alliances form and forces collide, the impending battle for control of the world's largest oil deposits threatens to tear apart the tenuous peace created by America's victories in Afghanistan. Now it's up to McLanahan and a handful of American commandos half a world away, aided by an untested and unproven force of robotic warplanes, to win a war in which everyone -- even \"friendly\" forces at home -- wants them to fail.Fast. Explosive. Impossible to put down. Air Battle Force is the perfect Dale Brown combination of spellbinding suspense and cutting-edge military technology.",
        "Category": " Fiction , War & Military",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Just Here Trying to Save a Few Lives: Tales of Life and Death from the Er",
        "Authors": "By Grim, Pamela, M.D.",
        "Description": "A real-life physician shares her life-and-death experiences in the emergency room, providing an inside look at what it takes to make split-second, life-and-death decisions in a busy ER, and offers an unflinching and candid study of the demanding, frustrating, and rewarding world of emergency medicine. 65,000 first printing.",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The Monkey's Fist",
        "Authors": "By Pease, William D.",
        "Description": "Returning from William D. Pease's first novel, the much acclaimed Playing the Dozens, Eddie Nickles has just retired after twenty-five years as a Washington, D.C., homicide detective. He doesn't intend to do any freelance work, but when a mysterious businessman comes to his door offering Nickles a lot of money to find the street person who may have been responsible for a double murder in D.C., Eddie accepts the job. He is too good at it, and it almost costs him his life and that of his eighteen-year-old daughter. Now he finds himself enmeshed with Russian \"free market\" mafiosi, ex-KGBers also on the take, street rappers, and a U.S. agency that doesn't exist. A local incident becomes an international chase, with Nickles playing David to the Goliaths who are seeking supremacy in the new world order.",
        "Category": " Fiction , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Moon Music: A Novel",
        "Authors": "By Kellerman, Faye",
        "Description": "“Fascinating....Fast-paced and dynamic.” —Dallas Morning News“Kellerman is taking a big risk here, and I think she pulls it off in fine style.”—Washington PostWith Moon Music, New York Times bestseller Faye Kellerman leaves Los Angeles and heads to stranger territories: “Sin City” Las Vegas, Nevada. Taking a brief hiatus from her mystery series featuring LAPD Homicide Detective Peter Decker and his Orthodox Jewish wife, Rina Lazarus, Kellerman delivers a masterful stand-alone crime novel that crackles with suspense and tantalizes with a touch of the paranormal. The horribly savaged body of a once-beautiful Vegas showgirl is discovered in the desert not far from the world-famous Strip, plunging Detective Sergeant Romulus Poe into the heart of a bizarre, full moon-soaked mystery that could cost him everything he holds dear in life, including his sanity.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "The Burglar Who Traded Ted Williams: A Bernie Rhodenbarr Mystery",
        "Authors": "By Block, Lawrence",
        "Description": "Since we last saw burglar-cum-bookseller Bernie Rhodenbarr - some ten years ago - his creator, Lawrence Block, has gone on to become one of the most respected names in crime fiction. His Matthew Scudder series has won numerous awards, as well as the highest praise from both critics and readers alike. So, how does an author top all that success? By bringing back that infamous burglar, Bernie Rhodenbarr, to burgle once again.Just to update you on Bernie. For nearly a year he's walked the straight and narrow and has coaxed his secondhand bookstore in New York's Greenwich Village into turning a small profit. He's even allowed a cat to move in, and struggled with nocturnal retirement. Then Borden Stoppelgard comes into Bernie's life. Not a nice man. Borden is Bernie's new landlord, and wants to increase the rent by ten thousand dollars - a month! Desperate times call for desperate measures.By chance, or so it seems, Bernie discovers a West Side apartment whose occupants are in Europe, slips inside with his usual finesse, lifts a large sum of untraceable cash with his usual aplomb, and spots a naked dead man in the bathtub. Now, across town another burglary has taken place - at Stoppelgard's brother-in-law's apartment - and what's missing is a million-dollar baseball card collection. Somehow Bernie's been blamed (read: framed) for that crime.Toss in a mysterious woman and a crotchety New York police detective to Bernie's troubles, then mix well for a burglar in big trouble. What's the best way out? Why, to find the baseball cards and steal them back, of course.In The Burglar Who Traded Ted Williams, Lawrence Block once again gives us a riveting story and shows us a great time. It's crime fiction with a laugh track. And while he may be older, he may be wiser, and certainly more skillful, thank goodness he's still a bad boy at heart. Bernie, too. Reason enough for fans to rejoice.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "A Dutton Book",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Falling from Grace: The Experience of Downward Mobility in the American Middle Class",
        "Authors": "By Newman, Katherine S.",
        "Description": "Examines the decreasing likelihood of achieving the American dream, as shifting social and economic conditions force a middle-class loss of earnings and self-respect",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Shell Game: A Novel",
        "Authors": "By Terman, Douglas",
        "Description": "Separated by the Cuban revolution and their love for the same woman, two adopted brothers--George Brocassie, on a mission to Cuba for the CIA, and Julio Alvarez, Castro's top agent and secret KGB mole--play key roles in the Cuban missile crisis",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Bright Star",
        "Authors": "By Stevenson, Robert Louis",
        "Description": "Five years and several billion dollars in the making, Bright Star is a top-secret Defense Department satellite that not only pinpoints enemy ships, tanks, planes, artillery, and missiles but also simultaneously \"paints\" up to a thousand targets, coordinating a multiple-beam high-energy laser attack to enemy forces from the battlefield within minutes. The nation possessing Bright Star will have an impenetrable nuclear umbrella as well as an overwhelming tactical advantage on the battlefield for years to come.When the space shuttle - with Bright Star aboard - mysteriously crashes near the coast of Maine, ex-Navy SEAL Philip Drake is called in to retrieve the satellite before it falls into the hands of the highest bidder in the covert arms market.With high tension and riveting, state-of-the-art action above and beneath the sea, Bright Star fulfills the promise of Stevenson's debut.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Shadowmancer",
        "Authors": "By Taylor, G. P.",
        "Description": "Craving power and wealth, vicar Obadiah Demurral enlists the powers of darkness and uses his powers as a shadowmancer, a sorcerer who commands the souls of the dead, to become all-powerful, and Raphah, a young wizard who has come to reclaim a priceless stolen artifact, is the only one with the hope of defeating Demurral and his demonic forces.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "G.P. Putnam's Sons Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Middle Ages (A Royal History of England)",
        "Authors": "By Fraser, Antonia (EDT), Earle, Peter, and GILLINGHAM, John",
        "Description": "This volume opens with the Norman conquest, William I's bold incursion in 1066 that propelled a new dynasty to the throne of England, and covers three centuries of drama, intrigue, loyalty, betrayal, courage, cowardice, and crime.About the series A Royal History of England:From the beginning of monarchical power in Norman times to the present queen, the British royal family has experienced many scandals, triumphs, and changes in public image, but few of their reigns can be described as uneventful. With contributions by specialist authors and contemporary illustrations of royal heraldry and coats of arms, Antonia Fraser has edited a definitive and entertaining history of one of the most powerful monarchies in the world.",
        "Category": " History , Europe , General",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Ellis Island",
        "Authors": "By Stewart, Fred Mustard",
        "Description": "In the early 1900s, five young men and women make their ways to America from their respective homelands and enter the distinct, but interconnected, segments of American life",
        "Category": " Fiction , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Stereogram",
        "Authors": "By Rheingold, Howard",
        "Description": "A collection of three-dimensional stereogram images encompasses the work of leading contemporary stereo artists, including Christopher Tyler, facts about the development of the technology, and a look at it as an artistic medium. Original. 35,000 first printing.",
        "Category": " Art , Conceptual",
        "Publisher": "VIZ Media LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "All leads negative",
        "Authors": "By Alding, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "16.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Mexican Recipes Traditional Recipes For The Perfect Mexican Feast",
        "Authors": "By marlena-spieler",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Building Wealth: The New Rules for Individuals, Companies and Nations",
        "Authors": "By Thurow, Lester C.",
        "Description": "As we stand on the brink of the new millennium, MIT economist Lester Thurow addresses the critical issue of wealth creation. The result is an essential road map for how individuals, companies, and nations can and must build wealth in a knowledge-based global economy.There is no doubt that we are in the middle of a transition to a knowledge-based economy; breakthrough technologies in microelectronics, biotechnology, new materials, telecommunications, robotics, and computers are fundamentally changing the game of creating wealth. Thanks to the impact of these technologies, new industries (software, gene therapy) are growing explosively and existing industries (banking, retail) are being transformed beyond recognition.Out of these transformations, a new global economy is emerging to replace existing national economies. Almost alone, the American economy seems to be enjoying a period of unprecedented growth.  Is this growth sustainable? Is global integration a boon or a threat to this trend? Will the forces that sparked the Asian meltdown--a crisis that is meticulously evaluated in these pages--provoke a more persistent era of stagnation or worse? Should global integration be slowed? Can it be slowed? What lies ahead in the near future?What skills are needed to succeed in this new economy? What new rules must apply to the creation and protection of new ideas? How are environmental problems such as global warming going to affect wealth creation? How can marketable wealth be rising at ever-faster rates while productivity growth is slowing? How can nations create a social system in which the entrepreneurial spirit can flourish without also creating income and wealth inequalities that threaten the system?In the groundbreaking final chapters of Building Wealth, Professor Thurow turns his attention to the three current major economic sectors of the world: America, East Asia, and Europe. He provides a trenchant analysis of each as a significant competitor in the coming decades, and predicts the likely outcome of the complex forces that are presently shaping global society.",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Secrets of the Whitetail Pros",
        "Authors": "By Gutschow, Gregg",
        "Description": "",
        "Category": "",
        "Publisher": "North American Hunting Club",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Sunset Western Landscaping",
        "Authors": "By Gilsenan, Fiona (EDT) and Brenzel, Kathleen Norris (EDT)",
        "Description": "A companion to the  Western Garden Book . Covers plans, materials, structures, building techniques, and plants as they serve in the design. Abundantly illustrated with color photos and drawings. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Gardening , Regional , General",
        "Publisher": "Sunset Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Storage Book: Over 250 Inspirational Ideas for Creating Stylish Home Storage",
        "Authors": "By Inions, Cynthia",
        "Description": "A full-color guide to arranging storage space offers storage ideas for a wide variety of interiors and issues, providing step-by-step instructions designed to make storage a snap.",
        "Category": " House & Home , Decorating",
        "Publisher": "The Lyons Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "The New York Public Library American History Desk Reference",
        "Authors": "By New York Public Library",
        "Description": "Short topical overviews, easy-reference timelines, and concise biographies enhance this quick-answer American history reference, organized by social and cultural categories, that comes complete with index, various illustrations, and maps.",
        "Category": " History , Reference",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Remains to Be Seen",
        "Authors": "By Butterworth, Michael",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "March",
            "Year": "1976"
        }
    },
    {
        "Title": "Miracle Cures: Dramatic New Scientific Discoveries Revealing the Healing Powers of Herbs, Vitamins, and Other Natural Remedies",
        "Authors": "By Carper, Jean",
        "Description": "Nationally syndicated columnist and America's leading authority on health and nutrition, Jean Carper now turns her attention to the public's increasing demand for medically proven natural cures. The first comprehensive guide to fully document the effectiveness of vitamins, minerals, herbs and other natural substances, Miracle Cures is backed by the latest scientific findings of leading scientific institutions, research centers and medical journals, including the New England Journal of Medicine and the Journal of the American Medical Association.  Written in the same lively style that has made Jean Carper's previous bestsellers so accessible, Miracle Cures also includes awe-inspiring cases of medically verified natural cures. The result is an essential resource for anyone who wants to make informed choices for their health, take charge of their well-being and live longer, healthier lives.",
        "Category": " Health & Fitness , Herbal Medications",
        "Publisher": "Harper",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    }
]