[
    {
        "Title": "The Right Data: The Conservative Guidebook to Busting Liberal Economic Myths",
        "Authors": "By Rubenstein, Edwin S.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Natl Review",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "FIREFALL",
        "Authors": "By Ruggero, Ed",
        "Description": "Fresh from taking on North Korean troops in 38 North Yankee, Major Mark Isen finds himself involved in a lethal post-Cold War operation in politically divided, economically depressed Germany.",
        "Category": " Fiction , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "A Streetcar Named Desire",
        "Authors": "By Williams, Tennessee",
        "Description": "It is a very short list of 20th-century American plays that continue to have the same power and impact as when they first appeared — A Streetcar Named Desire is one of those plays. The story of the fading and desperate Blanche DuBois and how her sensuous and brutal brother-in-law, Stanley Kowalski, pushes her over the edge is now classic. Who better than Arthur Miller, America's elder statesman of the theater (Death of a Salesman, The Crucible, A View from the Bridge, Broken Glass, Resurrection Blues), to write as a witness to the lightning that struck American culture when Williams's singular style of poetic dialogue, violence, compassion, and dramatic sexuality was first encountered in the form of A Streetcar Named Desire? Miller's rich perspective and lucid insights make this a unique and essential new edition of A Streetcar Named Desire. Also included are Williams's essay \"The World I Live In\" and a chronology of the author's life and works.",
        "Category": " Drama , American , General",
        "Publisher": "New Directions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "Creating Memories: Making A Memory Scrapbook for Life's Special Occasions",
        "Authors": "By Mary-Anne Danaher",
        "Description": "",
        "Category": "",
        "Publisher": "Lansdowne Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Christmas Treats: 50 Special Recipes for Delicious Festive Fare (Step-By-Step)",
        "Authors": "By Murfitt, Janice",
        "Description": "Easy-to-follow instructions and photographs accompany a tempting collection of delicious recipes for hors d'oeuvres, canapes, cookies, and chocolates to serve during the holidays or wrap and give as special gifts.",
        "Category": " Cooking , Holiday",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Business Ethics: A Stakeholder and Issues Management Approach",
        "Authors": "By Weiss, Joseph W.",
        "Description": "This text examines the role of ethics in the business world and ethical dilemmas encountered by managers. Ethical decisions do not take place in a vacuum. Many people, all with their own interests and standards, are involved in business encounters every day. \"Stakeholder and Issues Management\" is this text's unique approach to teaching business ethics. It pays special attention to the relationships among the many and varied stakeholders that have roles in business situations. These stakeholders include the market and non-market entities that affect a business. Ethical issues must be addressed by individuals, groups, corporations, and even nations in very different ways, and the consequences differ with each person or group involved. This text gives students practical tools to handle moral dilemmas in the workplace and the world. Topics include risk management, preferential hiring, corporate legitimacy, and moral accountability.",
        "Category": " Business & Economics , Business Ethics",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "I'd Love to Kiss You...",
        "Authors": "By Stine, R.L.",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "A Woman's Place: A Novel",
        "Authors": "By Delinsky, Barbara",
        "Description": "Claire Raphael is a true woman of the nineties. She was the perfect helpmate while her husband, Dennis, built his career and the perfect mother when it came time for their children. She managed all this while transforming a furniture hobby into WickerWise, a thriving business that has grown into a nationally franchised success.Claire has become the primary breadwinner in the family, taking the pressure off Dennis's failing investment company. But Dennis sees things differently. Arriving home one night after a grueling business trip, Claire is served with divorce papers that claim abandonment of Dennis and the children - and he is suing for custody. Her world is shattered.Claire struggles to understand how this could have happened. She had always made her children and husband the priority, devoting more time as a parent than Dennis ever had. Now, with one court document, she has lost custody of her children and is ordered out of her own home until a hearing can be held. Claire hires a tough woman divorce lawyer with an excellent reputation, but even she hints that Dennis has a strong chance of winning.Caught between a vindictive husband and a censorious court, Claire is about to be punished for doing it all and succeeding. She turns to her longtime friend and business partner, Brody Parth. In Brody she finds the understanding and tenderness that are missing from her marriage and the strength she needs to fight for her children and her dignity.",
        "Category": " Fiction , Romance , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Areas of My Expertise",
        "Authors": "By Hodgman, John",
        "Description": "In the great tradition of the American almanac, The Areas of My Expertise is a brilliant and hilarious compendium of handy reference tables, fascinating trivia, and sage wisdom on all topics large and small. Although bestsellers such asPoor Richard’s Almanack and The Book of Lists were certainly valuable, they also were largely true. Here is a different kind of handy desk reference, one in which all of the historical oddities and amazing true facts are sifted through the singular, illuminating imagination of John Hodgman—which is the nice way of saying: He made it all up.John Hodgman brings his considerable expertise to bear in answering all of the questions book buyers have been asking:-What are the mottoes of the 51 United States?THE ANSWER IS PROVIDED-Who were the U.S. presidents who had hooks for hands?THE ANSWER IS PROVIDED-What role does the Yale secret society “Skull and Bones” play in the secret world government?THERE IS NO SECRET WORLD GOVERNMENT-What was the menu at the first Thanksgiving, and did it include eels?Technically, that is two questions, but do not apologize, for John Hodgman shall answer them both... LATER.-Aside from a compendium of fake trivia, what is the best kind of book to write?A SIMPLE TABLE OF THE 55 MOST DRAMATIC LITERARY SITUATIONS PROVIDES THE ANSWER, and John Hodgman is the author of that table.Imagine if The Book of Lists had been rewritten by Peter Cook and Jorge Luis Borges under the pseudonym of “John Hodgman” and then renamedThe Areas of My Expertise, and you will only begin to have a sense of the dizzying, uproarious, sublimely weird, and strangely wise journey that is contained within this book (along with all the pages and words).Perfect for anyone who thirsts for knowledge, and especially for collectors of books of fake trivia, TheAreas of My Expertise offers through absurdity a better understanding of the world we share—and recognizes that while the truth may be stranger than fiction, it is never as strange as lies...or as true.Watch a QuickTime trailer for this book.",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Dutton",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "29 and Counting : A Chick's Guide to Turning 30",
        "Authors": "By Tilsner, Julie",
        "Description": "Just when a woman's learned how to wind her way through a life of temp jobs and commitment-phobic boyfriends, she has to face the biggest nightmare yet--turning 30.  What with everything on that \"To Do Before 30\" list still left undone and and the biological clock ticking all too loudly, even the most sensible chicks come a little unglued when their fourth decade is upon them.Luckily, humor writer Julie Tilsner is here to help.  A Business Week editor who ditched New York City and a successful career for a kibbutz in Israel when the big day closed in on her, Tilsner recounts her experience and those of many other women in this pithy, insightful, and uproarious self-help book.",
        "Category": " Humor , Form , Parodies",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Western Civilization Since 1600",
        "Authors": "By Viault, Birdsall S.",
        "Description": "Surveys the movements, ideas, events, and individuals that have shaped Western history since the seventeenth century",
        "Category": " Study Aids , General",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Competitive Leadership: Twelve Principles for Success",
        "Authors": "By Peterson, James A. and Billick, Brian",
        "Description": "Brian Billick, who guided the Baltimore Ravens to victory in Super Bowl XXXV in only his second year as head coach, quickly earned a reputation as one of the best leaders and motivators in the ranks of the NFL. Creating what many football observers consider the all-time best defense, he led his team to football’s Holy Grail against long odds and a tough series of adversaries. Calling upon the skills that helped lead a professional football team, Billick has created an invaluable resource for business executives who want to focus and energize their employees, team members who want to be more effective contributors to their organizations, and anyone who wants to improve their leadership skills.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Triumph Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Gandhi on Non-Violence: A Selection From the Writings of Mahatma Gandi",
        "Authors": "By Gandhi, Mahatma",
        "Description": "Gandhi's writings on non-violence are reproduced and placed within historical and intellectual contexts",
        "Category": " Philosophy , General",
        "Publisher": "New Directions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1965"
        }
    },
    {
        "Title": "Triumph over Tragedy",
        "Authors": "By Petrocelli, Bobby and Frederick, Chris",
        "Description": "",
        "Category": "",
        "Publisher": "Wrs Pub",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Full House: The Spread of Excellence from Plato to Darwin",
        "Authors": "By Gould, Stephen Jay",
        "Description": "In Full House, Gould corrects the prevalent, anthropocentric view of the world with an eloquent argument for a new paradigm of progress in which variety - not complexity - is the true measure of excellence. In the process, Full House teaches us how to read trends as changes in variation within full systems, rather than as \"things moving somehwere\".",
        "Category": " Nature , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "9.98",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "More of the Worlds Best Dirty Jokes",
        "Authors": "By Sales, Inc. Book",
        "Description": "",
        "Category": "",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "5.91",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "Mathew Brady (American Photography)",
        "Authors": "By Pritzker, Barry",
        "Description": "",
        "Category": "",
        "Publisher": "JG Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Fairies and Elves (The Enchanted World)",
        "Authors": "By THUBRON, Colin",
        "Description": "Recounts legends and folktales from around the world concerning people's encounters with elves and fairies",
        "Category": " Social Science , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "The Country Store: Traditional Food, Country Crafts, Natural Decorations",
        "Authors": "By Donaldson, Stephanie",
        "Description": "",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Lorenz Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "101 Craft Projects Under $10",
        "Authors": "By Editors at Butterick",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Butterick Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Dispatches from the Tenth Circle: The Best of The Onion",
        "Authors": "By Siegel, Robert and Onion Staff (COR)",
        "Description": "“The Onion is laugh-out-loud, go-tell-your-friends, get-angry-you-didn’t-think-of-it funny.”–Conan O’Brien“Outside of maybe Dario Fo, an Italian who few are sure exists, the Onion people make the most consistently perfect and excoriating social commentary we currently have. But will those Nobel bastards honor them, too? Only God, our merciless and just God, knows.”–Dave Eggers“The funniest publication in the United States.”–The New Yorker“This publication is tasteless and destructive to our shared values. Read it for yourself and you’ll see what I mean. Seriously, what else could make me laugh–much less laugh uproariously–while being offended week after week after week?”–Al Gore“The Onion is the funniest thing in news since Dan Rather’s spooky stare.”–Matt Groening“Brutal satire that rushes into the far reaches of race, class, sexuality, and culture where many publications–and critics–fear to tread.”–Chicago Tribune“The Onion, unlike any other entity in our media culture, offers a refreshingly honest look at our complicated life.”–Ken Burns",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "David Letterman's Book of Top Ten Lists: and Wedding Dress Patterns for the Husky Bride",
        "Authors": "By Letterman, David, O'Donnell, Steve, Scheft, Bill, Beckerman, Jon, Burnett, Rob, Cary, Donick, Davis, Jill, Digiorgio, Davey, Drabik, Dave, Gregory, Alex, Harrigan, Matt, Hentemann, Mark, Huyck, Pete, Jacobson, Larry, Rothman, Rodney, Schoenberg, Cliff, Sherrill, Steve, Toplyn, Joe, and Young, Rob",
        "Description": "David Letterman's Book of Top Ten Lists and Zesty Lo-Cal Chicken Recipesby David Letterman and the Late Show with David Letterman WritersIt's like watching TV -- with the added danger of paper cuts!Top Ten Apologies to People Buying This Book:10.      Cheap glue will only hold the thing together for about six days.9.      Some kids sneaked into the printing plant and added the word \"ass\" to a lot  of the lists.8.      It costs about a dime to print one of these babies -- now take a look at the retail price, sucker!7.      We're using the money we make to buy \"little Dutch girl\" outfits for Dave's poodles.6.      The book was hastily assembled overseas by jabbering foreigners who don't give a damn about you or your family.5.      A drunk maintenance guy fell into the press and parts of him appear on pages 68-87.4.      Felt safe making jokes about the Amish on TV; forgot some of them might actually see the book.3.      Dave insisted on writing some of these and we had to play along..2.      There is no remote control. Don't look for one.1.      The book ain't much better than the TV show.",
        "Category": " Humor , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Barefoot in Boogar Hollow Yestiday's Syins to Live By Today",
        "Authors": "By powers, Nick and Wilann",
        "Description": "",
        "Category": "",
        "Publisher": "Country Originals",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Painting and Decorating Furniture",
        "Authors": "By McGraw, Sheila",
        "Description": "\"...quite probably, the best general instructions on furniture decoration that exist.\" - Booklist     Painting and Decorating Furniture is the definitive book on reviving old or unsightly furniture with simple craft techniques. Sheila McGraw shows how to breathe new life and color into old wood, metal or plastic laminate cabinets, desks, dressers, tables, chairs and cushions.    With more than 1,000 step-by-step color photographs to guide the reader, and concise easy-to-follow instructions, the author demonstrates original treatments and techniques, including new stains and faux finishes, decorating with found materials, and inventive uses for fabric, posters and baskets.    Popular treatments such as dragging, smooshing, block printing, metallic leafing, crackled varnish, faux plaster, antiquing, découpage, and other fine art            and furniture finishes enhance furniture with freehand, decorative and folk painting. The stenciling and other projects all include patterns.     With expert descriptions of tools and materials, McGraw generously shares her extensive knowledge and years of experience. Projects are easy-clean-up, fast-drying and use water-based paints and environmentally friendly primers, stains, varnishes and strippers. Painting and Decorating Furniture is fully cross-referenced and indexed. The \"Read This First\" sections prevent mistakes, and complete Materials Lists avoid frustration.    Enormously popular, this new paperback edition of Painting and Decorating Furniture will introduce more buyers to its strong formula of excellent content, beautiful production and indisputable value.",
        "Category": " House & Home , Decorating & Furnishings",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "6.98",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Sos Help for Parents Book",
        "Authors": "By Clark, Lynn F.",
        "Description": "",
        "Category": "",
        "Publisher": "Parents Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Ganwold's Child",
        "Authors": "By Thornley, Diann",
        "Description": "An exciting multivolume saga of worlds at war in space opens in Ganwold's Child. The story starts with a child: Tristan Serege, son of Darcie and Lujan, the heroic leader of the Spherzah, the \"special forces\" of the Unified Worlds.Darcie is taking Tristan to rejoin Lujan in the Enach system when the fierce masuki, nonhuman slavers, attack and capture their transport ship. Darcie escapes with Tristan in a lifepod and touches down on Ganwold, a primitive planet controlled by the Dominion, the long-time enemy of the Unified Worlds. But they have also accidentally jumped more than a year forward in time due to a malfunction in the space drive and cannot expect rescue, so Tristan must grow to young manhood in hiding among the alien ganan.Tristan is barely eighteen when Darcie contracts a lingering, life-threatening illness. To help her, he and his gan \"brother,\" Pulou, go on a quest to seek his father, Lujan. In one of the Dominion colonies, they are captured and turned over to the Sector General, Mordan Renier, who uses Tristan as a bargaining chip in an attempt to invade Sostis, the homeworld he lost years before in the war. General Lujan must combat Renier's impending attack, realizing he could lose the family he's just learned is still alive.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Metropolitan Museum of Art",
        "Authors": "By Hibbard, Howard",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "10.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Life and Times of the Thunderbolt Kid: A Memoir",
        "Authors": "By Bryson, Bill",
        "Description": "From one of the most beloved and bestselling authors in the English language, a vivid, nostalgic, and utterly hilarious memoir of growing up in the 1950sBill Bryson was born in the middle of the American century—1951—in the middle of the United States—Des Moines, Iowa—in the middle of the largest generation in American history—the baby boomers. As one of the best and funniest writers alive, he is perfectly positioned to mine his memories of a totally all-American childhood for 24-carat memoir gold. Like millions of his generational peers, Bill Bryson grew up with a rich fantasy life as a superhero. In his case, he ran around his house and neighborhood with an old football jersey with a thunderbolt on it and a towel about his neck that served as his cape, leaping tall buildings in a single bound and vanquishing awful evildoers (and morons)—in his head—as \"The Thunderbolt Kid.\"  Using this persona as a springboard, Bill Bryson re-creates the life of his family and his native city in the 1950s in all its transcendent normality—a life at once completely familiar to us all and as far away and unreachable as another galaxy. It was, he reminds us, a happy time, when automobiles and televisions and appliances (not to mention nuclear weapons) grew larger and more numerous with each passing year, and DDT, cigarettes, and the fallout from atmospheric testing were considered harmless or even good for you. He brings us into the life of his loving but eccentric family, including affectionate portraits of his father, a gifted sportswriter for the local paper and dedicated practitioner of isometric exercises, and OF his mother, whose job as the home furnishing editor for the same paper left her little time for practicing the domestic arts at home. The many readers of Bill Bryson’s earlier classic, A Walk in the Woods, will greet the reappearance in these pages of the immortal Stephen Katz, seen hijacking literally boxcar loads of beer. He is joined in the Bryson gallery of immortal characters by the demonically clever Willoughby brothers, who apply their scientific skills and can-do attitude to gleefully destructive ends.  Warm and laugh-out-loud funny, and full of his inimitable, pitch-perfect observations, The Life and Times of the Thunderbolt Kid is as wondrous a book as Bill Bryson has ever written.  It will enchant anyone who has ever been young.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Laughing Matters Treasury of American Humor",
        "Authors": "By Shalit, Gene",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "A Short History of Rudeness: Manners, Morals, and Misbehavior in Modern America",
        "Authors": "By Caldwell, Mark",
        "Description": "A respected social critic offers an insightful and amusing exploration of the slow death of manners and the steady triumph of boorishness in America, showing how the decline of manners has a long and socially significant history. 25,000 first printing.",
        "Category": " Reference , Etiquette",
        "Publisher": "Picador USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Last Chance for Our Children: How You Can Help Save Our Schools",
        "Authors": "By Honig, Bill",
        "Description": "A prominent educator explains what is needed in education today and lays out a practical agenda for making our schools work so that every student is challenged to perform to the best of his or her abilities",
        "Category": " Education , General",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Child Research in Psychopharmacology",
        "Authors": "By Fisher, Seymour, ed",
        "Description": "",
        "Category": "",
        "Publisher": "Springfield: Charles C. Thomas",
        "Price Starting With ($)": "29.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "The LowBrow Guide to World History",
        "Authors": "By Michael Powell",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "A Guided Tour of Rene Descartes' Meditations on First Philosophy",
        "Authors": "By Biffle, Christopher",
        "Description": "",
        "Category": " Philosophy , History & Surveys , General",
        "Publisher": "Mayfield Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Hearts: The Art of Making Gifts of Love and Affection",
        "Authors": "By Patterson, Debbie (PHT), Bawden, Juliet, and Patterson, Debbie",
        "Description": "A unique collection of crafts, projects, and recipes--from hand-crafted valentines to hearts-and-flowers salad--shows how to use the symbol of the heart to reach out to loved ones in a special way. 20,000 first printing.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "The fiberworks source book: Your mail order guide to supplies and services for the fiber arts",
        "Authors": "By Bobbi A McRae",
        "Description": "",
        "Category": "",
        "Publisher": "Betterway Publications",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Children's Toys and Furniture",
        "Authors": "By Burch, Monty",
        "Description": "Provides detailed plans and instructions for building blackboards, toys, toy boxes, rocking horses, sleds, cradles, dollhouses, tables, chairs, and sandboxes",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Creative Homeowner Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Sophocles: the Three Theban Plays",
        "Authors": "By Sophocles",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "The News of the Weird",
        "Authors": "By Shepherd, Chuck, Kohut, John J., and Sweet, Roland",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "You Can Make Money from Your Arts and Crafts: The Arts and Crafts Marketing Book (Be You Own Boss)",
        "Authors": "By Long, Steve and Long, Cindy",
        "Description": "Offers advice on insurance, licenses, taxes, credit cards, booth designs, the selling process, mail-order sales, wholesaling, craft shows, and travel",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Mark Pub",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Build Your Own Inexpensive Dollhouse (Dover Woodworking)",
        "Authors": "By Tangerman, E. J.",
        "Description": "Anyone, even a novice woodworker or a child with adult supervision, can build this spacious dollhouse. All it takes is six basic tools (a folding rule, square, saber saw, rasp, sander, and hammer) and a single sheet of 4' x 8' plywood. The finished two-story model measures 36 1/2\" x 26\" (scale 1\" x 1') and boasts six rooms, plus a staircase, windows, shutters, and a front door.The easy-to-follow instructions offer advice on purchasing the appropriate kind of plywood and trimmings and explain exactly how to cut and assemble the pieces. Helpful tips include suggestions on sanding, which pieces to nail first, constructing the roof, and finishing the project with paint or siding.The basic house design is simple, so builders have ample room to refine the house to suit their own preferences. Dozens of diagrams and instructions show how to add optical touches such as dormers, windowpanes, a fireplace, flower boxes, and much more. All instructions are clarified by illustrations — over 40 diagrams and photographs appear throughout the book, showing the dollhouse in various stages of completion.",
        "Category": " Crafts & Hobbies , Toymaking",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "129.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "Rubber Stamp Celebrations: Dazzling Projects from Personal Stamp Exchange",
        "Authors": "By Personal Stamp Exchange",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "My Granddaughter Has Fleas!!: A Cathy Collection (Volume 10)",
        "Authors": "By Guisewite, Cathy",
        "Description": "\"You don't have to be female, young, and unmarried to appreciate the humor of Cathy Guisewite. CartoonCathy suffers and enjoys the hassles of relationships, careers, and an attempt at domesticity. She has a mother to placate. Don't we all? She has problems. Don't we all? But the problems just seem so much easier to face when we peek at Cathy's comic strip.\" --Oakland Press, Pontiac, Mich.\"For many single women, Cathy is like a best friend...No matter what we're going through, it's a safe bet that Cathy's going through it with us.\" --Elkhart (Ind.) Truth\"Her cartoons are enough to make one laugh out loud, as page after page of contradictions and rationalizations capture the life and hard times of the single woman.\" --Lansing (Mich.) State JournalCathy chronicles the demands of a \"thirtysomething\" career woman responding to the complexities and contradictions in our everyday lives. Like so many women, she struggles with frustrations involving the \"four basic guilt groups\"--food, career, mother, and relationships. Always trying to do her best, Cathy finds her alternatives are clearly conflicting: Be aggressive, be submissive; be ambitious, be demure; eat healthy, eat happy; act caring, act nonchalant...No wonder Cathy's confused!",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Rachael Ray Express Lane Meals: What to Keep on Hand, What to Buy Fresh for the Easiest-Ever 30-Minute Meals: A Cookbook",
        "Authors": "By Ray, Rachael",
        "Description": "How can you get a wholesome, delicious dinner on the table without spending time on long lines at the supermarket? Rachael knows how!Her secret weapon is keeping plenty of versatile, flavorful ingredients in the cupboard, fridge, and freezer, combining these staples with just a few fresh items—never more then ten—to create delicious meals for every night of the week. In Express Lane Meals, Rachael provides her personal go-to list of must-have items—so you can do a big shop every week then simply zip  through the Express Lane to make any of these 30-minute meals.She divides the recipes into three categories: “Meals for the Exhausted,” “ Meals for the Not Too Tired,” and “Bring It On! (But, Be Gentle).” No matter which you choose you’ll learn handy tricks and shortcuts to get the most impressive-looking meals on the table in 30 minutes or less. These are Rachael’s quickest and easiest recipes yet and a breeze to shop for—because you shouldn’t have to spend all of the time Rachael saves you in the kitchen standing in line at the grocery store!RACHAEL RAY IS A VERY BUSY LADY . . .And she knows you’re busy, too. But that doesn’t mean you can’t enjoy a delicious, healthy, and home-cooked meal every night of the week. Not when cooking is as simple as this! In Express Lane Meals, Rachael Ray is back and faster than ever! With her latest batch of recipes this beloved Food Network phenomenon takes her 30-Minute Meal concept to the next level, creating recipes based on staples from a well-stocked pantry and just a few fresh items—so few you’ll never be stuck on a long grocery line again.  YUMMO!",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Strongest Tribe: War, Politics, and the Endgame in Iraq",
        "Authors": "By West, Bing",
        "Description": "From a universally respected combat journalist, a gripping history based on five years of front-line reporting about how the war was turned around–and the choice now facing America During the fierce battle for Fallujah, Bing West asked an Iraqi colonel why the archterrorist Abu Musab al-Zarqawi had fled in women’s clothes. The colonel pointed to a Marine patrol walking by and said, “Americans are the strongest tribe.” In Iraq, America made mistake after mistake. Many gave up on the war. Then the war took a sharp U-turn. Two generals–David Petraeus and Raymond Odierno–displayed the leadership America expected. Bringing the reader from the White House to the fighting in the streets, this remarkable narrative explains the turnaround by U.S. forces. In the course of fourteen extended trips over five years, West embedded with more than sixty front-line units, discussing strategy with generals and tactics with corporals. He provides an expert’s account of counterinsurgency, disposing of myths. By describing the characters and combat in city after city, West gives the reader an in-depth understanding that will inform the debate about the war. This is the definitive study of how American soldiers actually fought –a gripping and visceral book that changes the way we think about the war, and essential reading for understanding the next critical steps to be taken.Praise for The Strongest Tribe:\"Balanced, panoramic assessment of the Iraq War by former Marine and Reagan administration veteran West (No True Glory, 2005, etc.), who heralds American soldiers as its unsung heroes amid the “fog of Washington”. . .A timely, eye-opening historical analysis that provides clarity around the difficult choices the next president faces.\" --Kirkus (starred review)\"In this important new chronicle of the war in Iraq, Bing West reveals how America reached the brink of defeat in 2006 and then managed in 2007 to stage a stunning turnaround. With its vivid, on-the-ground reporting, his book is a fitting tribute to the honor, valor, and toughness of our soldiers. Notwithstanding numerous mistakes by their leaders, West shows that their sacrifices have made success possible--as long we do not withdraw prematurely.\" --Senator John S. McCain“Sometimes the best way to support the troops is to criticize the generals.  Bing West does both well in this book, showing a sympathy for our soldiers and Marines, but also a great ear for military truth and a determination to render events accurately.  This is his third and most important book about the Iraq war.  Read it.”-- Thomas E. Ricks, author of FIASCO: The American Military Adventure in Iraq “A brilliant exposition. Based on extensive experience in the war zone, Bing West recounts how Soldiers and Marines showed the President and the Pentagon the way to solve the Iraq insurgency problem. Echoing the admonition that \"all politics are local\", The Strongest Tribe convincingly argues that it was a grass roots strategy developed by on-scene officers who forged ties at the tribal level that brought stability to Iraq's turbulent Anbar Province and provided hope for all Iraq.” -- Lt. Gen. Bernard E. Trainor USMC (Ret.) Co-author of The Generals' War and COBRA II: The Inside Story of the Invation and Occupation of Iraq“Some four decades ago I told Bing West that his book, the Village, would become a classic in counterinsurgency warfare. And so it did. \"The Strongest Tribe\" will surely be West's second classic -  a moving and detailed account of almost six years of war in Iraq.” - Dr. James R. Schlesinger, Director of Central Intelligence Agency, Nixon administration; Secretary of Defense, Ford administration; Chairman, The Mitre Corporation",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "A Killing Cure - One Woman's True Account of sexual and Drug abuse and Near Death at the Hands of Her Psychiatrist",
        "Authors": "By evelyn walker and perry deane young",
        "Description": "",
        "Category": "",
        "Publisher": "Henry Holt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Rachael Ray: Just In Time",
        "Authors": "By Ray, Rachael",
        "Description": "In this irresistible collection Rachael continues to work her 30-minute magic with nearly 100 awesomely delicious brand-new recipes. From pasta to pizzas, soups to sammies, and chicken, fish, and meat, you’ll find a 30-minute-meal to suit every appetite.But what if you don’t have even 30 minutes? No worries, Rachael has you covered with her quickest-ever 15-minute meals. Why order pizza when you can have Provencal Tuna Melts, Italian Surf ‘n Turf Salad- even a fabulous paella- on the table in just 15 minutes? You’ll never reach for the take-out menus again when super speedy Pea and Parsley Soup with Canadian Bacon and Skillet Tamale Pie are the delicious alternatives.And what about those days when you want to slow things down a bit? Rachael’s got the perfect recipes for those times, too. Her 60-minute meals like Paprika Chicken Stew with Potato Pierogies, Chicken, Corn and Tomatillo Lasagna, and Swordfish Rolls with Spaghetti Squash don’t require any more effort from the cook, but they tale advantage of a little extra time in the oven or simmering on the stove to develop those great, deep flavors we all crave on lazy days. Among these dishes are some of Rachael’s “Double Duty Dinners,” recipes that you cook once, serve twice, but look and taste so different that no one will be the wiser (such as Chicken in Creamy Mushroom Sauce with Chive Egg Noodles in which the base magically morphs into Tarragon-Tomato Chicken and Bread Soup another night).You’ll also fine fun Rachael Ray signature meals like:BLD (meals you can eat for breakfast, lunch, or dinner)MYOTO (Make Your Own Take-Out Meals) that feature ethnic flavors but no mystery or fatsDate Night Dinners and Fancy Fake-Outs that are every bit as elegant as the fare from your favorite little bistroThe Kids Will Eat It meals (besides chicken nuggets) that will bring even the pickiest eaters to the tableThis is Rachael’s most versatile book yet, the one that will help you get the very most out of every minute you spend in the kitchen- whether you’re rushing to the beat of the clock or taking advantage of a little extra time to stop and smell the veggies roasting. Either way you’ll be dishing up some of Rachael’s most appealing recipes ever- and all onyour own schedule.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Clarkson Potter Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Computer Literacy For IC3",
        "Authors": "By Preston, John, Preston, Sally, and Ferrett, Robert L.",
        "Description": "Written to provide all readers with an opportunity to learn and demonstrate computer and Internet literacy. Computer Literary for IC3 was written to align with a certification called “Internet and Computing Core Certification (IC3)”. This certification is for users who want to demonstrate critical computer and Internet skills valued in today’s academic and professional environments. The Computer Literacy for IC3 text is written to meet the certification standards and provide readers with a broad understanding of the key components of computer literacy in order to prepare for the exam.This certification has 3 units:• Unit 1: Computing Fundamentals (computer concepts)• Unit 2: Using Productivity Software • Unit 3: Living Online (the Internet) Each of these units is available as a separate Computer Literacy for IC3 text. This text contains:Unit 1: Computing Fundamentals and covers basic computer concepts including computer hardware, computer software, and using an operating system. The second edition of Computer Literacy for IC3 has been revised to keep up with the IC3 program’s evolution, which reflects the recent changes in computers and technology. Instead of publishing one large, comprehensive text, the three units are now available as separate, smaller texts.Identifying Types of Computers (1.1.0); Identifying Computer Components and Their Functions (1.1.0); Maintain Computer Equipment (1.2.0); Identifying Software and Hardware Interaction and Types of Software; Using an Operating System; Using WindowsComputer Literacy for IC3 prepares readers from the IC3 certification, which ensures that students and professionals have all the core skills needed to work in today’s technological environment.",
        "Category": " Computers , Certification Guides , General",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "7.42",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Agent Zigzag: A True Story of Nazi Espionage, Love, and Betrayal",
        "Authors": "By MacIntyre, Ben",
        "Description": "“Ben Macintyre’s rollicking, spellbinding Agent Zigzag blends the spy-versus-spy machinations of John le Carré with the high farce of Evelyn Waugh.”—William Grimes, The New York Times (Editors’ Choice) “Wildly improbable but entirely true . . . [a] compellingly cinematic spy thriller with verve.”—Entertainment WeeklyNAMED ONE OF THE TEN BEST BOOKS OF THE YEAR BY ENTERTAINMENT WEEKLY AND ONE OF THE BEST BOOKS OF THE YEAR BY THE NEW YORK TIMES BOOK REVIEW AND THE WASHINGTON POSTEddie Chapman was a charming criminal, a con man, and a philanderer. He was also one of the most remarkable double agents Britain has ever produced. In 1941, after training as German spy in occupied France, Chapman was parachuted into Britain with a revolver, a wireless, and a cyanide pill, with orders from the Abwehr to blow up an airplane factory. Instead, he contacted M15, the British Secret service, and for the next four years, Chapman worked as a double agent, a lone British spy at the heart of the German Secret Service. Inside the traitor was a man of loyalty; inside the villain was a hero. The problem for Chapman, his spymasters, and his lovers was to know where one persona ended and the other began. Based on recently declassified files, Agent Zigzag tells Chapman’s full story for the first time. It’s a gripping tale of loyalty, love, treachery, espionage, and the thin and shifting line between fidelity and betrayal.",
        "Category": " History , Modern , 20th Century",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Walk-In: A Novel",
        "Authors": "By Berntsen, Gary and Pezzullo, Ralph",
        "Description": "Gary Berntsen, longtime CIA operative and the field commander who cornered Osama Bin Laden in Afghanistan, writing with award-winning novelist Ralph Pezzullo, offers in this edge-of-the-seat thriller a terrifying vision of where the next threat to America may come from. When a highly placed Iranian intelligence operative walks into a U.S. embassy claiming to possess explosive information, counterterrorism officer Matt Freed is dispatched to interview him and is warned of an impending attack on the United States that could kill millions. But is the man’s story precious truth or calculated fiction? Matt isn’t sure, but with a possible catastrophe looming in less than two weeks, his superiors reluctantly prepare for the assault. Matt can’t leave it alone, though. With questions still lingering about what is really going on, he defies his superiors’ orders and launches his own investigation. As the clock ticks down, he searches frantically for the truth at an Afghan prison under siege, an abandoned Uzbekistan bio weapons facility, and a Moscow hospital where an arms dealer is dying of a mysterious disease. Ultimately, Matt’s efforts brand him an out-of-control renegade, and he finds himself left out in the cold. Yet he may be the only one with the knowledge needed to avert unimaginable chaos. From a counterterrorism warrior who has spent a lifetime thwarting those who would do us harm, The Walk-In is an exhilarating plunge into tradecraft and terror.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Way We'll Be: The Zogby Report on the Transformation of the American Dream",
        "Authors": "By Zogby, John",
        "Description": "According to super pollster John Zogby, whom The Washington Post calls “the maverick predictor,” the conventional wisdom about the United States–that we’re isolated from the world, politically fragmented, and inclined toward material pleasure–isn’t just flawed; it may be 180 degrees from the truth. In this far-reaching and illuminating look at contemporary American life, Zogby reveals nothing less than The Way We’ll Be. Drawing on thousands of in-depth surveys conducted especially for the book, Zogby points out where we’re headed–politically, culturally, and spiritually. The American dream is in transition; it is rapidly being redefined by four meta-movements: living with limits as consumers and citizens; embracing diversity of views and ways of life; looking inward to find spiritual comfort; and demanding authenticity from the media, our leaders, and leading institutions. Spearheaded by today’s eighteen-to-twenty-nine-year-olds–the “First Global” generation–Americans are becoming more internationalist, consensus-oriented, and environmentally conscious and less willing to identify themselves by the things they do to earn or spend their money. But this is more than a youth tide. Americans of all ages are moving beyond old divides–red state/blue state, pro-life/pro-choice, beer drinker/wine connoisseur–to form a new national consensus that will shape the nation for decades to come.Zogby’s cogent analysis of the data yields an astonishing perspective on Americans’ thoughts, feelings, and beliefs, now and in coming years. Understanding this emerging reality will be key for• leaders in all fields who want to reach audiences that are more media-savvy, better informed, and more technologically enabled than ever before• individuals in search of rewarding and fulfilling careers in tomorrow’s growth fields• politicians and CEOs looking to marry policies and practices to the rising demand for social responsibility• anyone who wants to market to the emerging new American consensusBeyond telling a fascinating story, the conclusions in this book are a must-read for everyone from Main Street to Madison Avenue to Capitol Hill. Filled with expert analysis and insight from one of today’s most successful predictors and trend spotters, The Way We’ll Be will redefine how we view America’s future.",
        "Category": " Social Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Bridge of Sighs: A Novel (Vintage Contemporaries)",
        "Authors": "By Russo, Richard",
        "Description": "This moving novel follows Louis Charles Lynch (“Lucy”) as he and his wife of forty years are about to embark on a vacation to Italy.   Lucy is sixty years old and has spent his entire life in Thomaston, New York. Like his late, beloved father, Lucy is an optimist, though he’s had plenty of reasons not to be—chief among them his mother, still indomitably alive. Yet it was her shrewdness, combined with that Lynch optimism, that had propelled them years ago to the right side of the tracks and created an “empire” of convenience stores about to be passed on to the next generation. Lucy's oldest friend, once a rival for his wife's affection, leads a life in Venice far removed from Thomaston. In fact, the exact nature of their friendship is one of the many mysteries Lucy hopes to untangle in the “history” he’s writing of his hometown and family. And with his story interspersed with that of Noonan, the native son who’d fled so long ago, the destinies building up around both of them (and Sarah, too) are relentless, constantly surprising, and utterly revealing. Bridge of Sighs, from the beloved Pulitzer Prize-winning author of Empire Falls, is a moving novel about small-town America that expands Russo's widely heralded achievement in ways both familiar and astonishing.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage Contempories",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Yum-o! The Family Cookbook",
        "Authors": "By Ray, Rachael",
        "Description": "No one has helped more families find time to fit home-cooked meals into their daily routines than Rachael Ray.  Now with the help of Yum-o!, the organization she founded to help kids and adults develop a healthier relationship to food and cooking, she has put together the ultimate family cookbook, which includes recipes that both kids and their parents will love cooking–and eating–together!Rachael knows that every family wants to make the best possible food choices–and get the very most out of their food-budget dollars. The recipes here feature more whole grains, use less fat, and make the most of fresh fruits and vegetables so they are as good for you as they are delish, and they’re all quintessential Rachael–fun and creative. You’ll also find notes on how to get even very young kids involved in the cooking process; great ideas for everything from breakfast to the lunchbox to dinner; wholesome snacks; and loads of new double-duty dinners that let you cook once, then eat twice or more. With lots of full-color photos and tons of helpful tips for making mealtime the very best part of the day, Yum-o! is a must-have for every busy family.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "30 More Planes for the Paper Pilot",
        "Authors": "By Vollheim, Peter",
        "Description": "Briefly discusses the basics of aerodynamics and provides complete instructions on how to make and fly paper models of airplanes",
        "Category": " Art , General",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Scented Gifts: From Sachets to Soap, from Gingerbread to Potpourri",
        "Authors": "By Doran, Laura Dover",
        "Description": "A crafter's introduction to the art of aromatherapy offers complete directions on how to create fragrant potpourri, pomanders, candles, sachets, soaps, ornaments, herbal teas, bath oils, and other simple, inexpensive gifts. BOMC Crafter's Choice.",
        "Category": " Crafts & Hobbies , Potpourri",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Stuff White People Like: A Definitive Guide to the Unique Taste of Millions",
        "Authors": "By Lander, Christian",
        "Description": "They love nothing better than sipping free-trade gourmet coffee, leafing through the Sunday New York Times, and listening to David Sedaris on NPR (ideally all at the same time). Apple products, indie music, food co-ops, and vintage T-shirts make them weak in the knees. They believe they’re unique, yet somehow they’re all exactly the same, talking about how they “get” Sarah Silverman’s “subversive” comedy and Wes Anderson’s “droll” films. They’re also down with diversity and up on all the best microbrews, breakfast spots, foreign cinema, and authentic sushi. They’re organic, ironic, and do not own TVs. You know who they are: They’re white people. And they’re here, and you’re gonna have to deal. Fortunately, here’s a book that investigates, explains, and offers advice for finding social success with the Caucasian persuasion. So kick back on your IKEA couch and lose yourself in the ultimate guide to the unbearable whiteness of being.Praise for STUFF WHITE PEOPLE LIKE:“The best of a hilarious Web site: an uncannily accurate catalog of dead-on predilections. The Criterion Collection of classic films? Haircuts with bangs? Expensive fruit juice? ‘Blonde on Blonde’ on the iPod? The author knows who reads The New Yorker and who wears plaid.”–Janet Maslin’s summer picks, CBS.com“The author of \"Stuff White People Like\" skewers the sacred cows of lefty Caucasian culture, from the Prius to David Sedaris. . . . It gently mocks the habits and pretensions of urbane, educated, left-leaning whites, skewering their passion for Barack Obama and public transportation (as long as it's not a bus), their idle threats to move to Canada, and joy in playing children's games as adults. Kickball, anyone?”–Salon.com“A handy reference guide with which you can check just how white you are. Hint: If you like only documentaries and think your child is gifted, you glow in the dark, buddy.”–NY Daily News",
        "Category": " Humor , Topic , Adult",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Why Is God Laughing?: The Path to Joy and Spiritual Optimism",
        "Authors": "By Chopra, Deepak",
        "Description": "In this refreshing new take on spirituality, bestselling author Deepak Chopra uses a fictional tale of a comedian and his unlikely mentor to show us a path back to hope, joy, and even enlightenment—with a lot of laughter along the way.Meet Mickey Fellows. A successful L.A. comedian, he’s just a regular guy, with his fair share of fears, egocentricities, and addictions. After his father’s death, Mickey meets a mysterious stranger named Francisco, who changes his life forever. The two begin an ongoing discussion about the true nature of being. Reluctantly at first, Mickey accepts the stranger’s help and starts to explore his own life in an effort to answer the riddles Francisco poses. Mickey starts to look at those aspects of himself that he has hidden behind a wall of wisecracks all his life. Eventually Mickey realizes that authentic humor opens him up to the power of spirit—allowing him to finally make real connections with people.After taking the reader on a journey with Mickey, Chopra then spells out the lessons that Mickey’s story imparts to us: ten reasons to be optimistic, even in our challenging world. Chopra believes that the healthiest response to life is laughter from the heart, and even in the face of global turmoil, we can cultivate an internal sense of optimism. Rich with humor and practical advice,Why Is God Laughing? shows us without a doubt that there is always a reason to be grateful, that every possibility holds the promise of abundance, and that obstacles are simply opportunities in disguise. In the end, we really don’t need a reason to be happy. The power of happiness lies within each of us, just waiting to be unleashed. And Mickey Fellows’s journey shows us the way.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Fire in the Blood (Vintage International)",
        "Authors": "By Nemirovsky, Irene",
        "Description": "From the celebrated author of the international bestseller Suite Française, a newly discovered novel, a story of passion and long-kept secrets, set against the background of a rural French village in the years before World War II.Written in 1941, Fire in the Blood – only now assembled in its entirety – teems with the intertwined lives of an insular French village in the years before the war, when \"peace\" was less important as a political state than as a coveted personal condition: the untroubled pinnacle of happiness. At the center of the novel is Silvio, who has returned to this small town after years away. As his narration unfolds, we are given an intimate picture of the loves and infidelities, the scandals, the youthful ardor and regrets of age that tie Silvio to the long-guarded secrets of the past.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Chicken Soup for the Soul Celebrates Teachers",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), and Wohlmuth, Sharon J. (COM)",
        "Description": "Everyone can remember a special teacher in his or her life: someone who inspired them to achieve greatness, offered encouragement through difficult times, or simply made learning fun and exciting. The magic of Chicken Soup for the Soul takes an all-new direction in this enchanting collection of stories and accompanying photos that honor and celebrate the teachers and mentors in our lives. Through the artistry of acclaimed photographer Sharon J. Wohlmuth readers are offered a glimpse into the hearts and minds of those who have dedicated their lives to making a difference in the lives of children. These soul-stirring pictures illuminate the teacher-student relationship in a whole new light and make readers feel a part of every moment in these touching stories. The perfect gift for graduation, this delightful book will earn high marks with readers.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Palace Council (Elm Harbor, Book 3)",
        "Authors": "By Carter, Stephen L.",
        "Description": "“Carter twists plotlines like pretzels while wryly skewering America’s wealthy intellectual elite.” —PeopleJohn Grisham called Stephen L. Carter’s first novel, The Emperor of Ocean Park, “beautifully written and cleverly plotted. A rich, complex family saga, one deftly woven through a fine legal thriller.” The Chicago Tribune hailed Carter’s next book, New England White, as “a whodunit with conscience.” Now this best-selling novelist returns with an electrifying political thriller set in the turbulent era of Watergate and Vietnam, giving us one of the most riveting and naked portraits of Nixon ever written.In the summer of 1952, twenty prominent men gather at a secret meeting on Martha’s Vineyard and devise a plot to manipulate the President of the United States. Soon after, the body of one of these men is found by Eddie Wesley, Harlem’s rising literary star. When Eddie’s younger sister mysteriously disappears, Eddie and the woman he loves, Aurelia Treene, are pulled into what becomes a twenty-year search for the truth. As Eddie and Aurelia uncover layer upon layer of intrigue, their odyssey takes them from the wealthy drawing rooms of New York through the shady corners of radical politics, all the way to the Oval Office.Stephen Carter’s novel is as complex as it is suspenseful, and with his unique ability to turn stereotypes inside out, Palace Council is certain to enthrall readers to the very last page.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "A Path Out of the Desert: A Grand Strategy for America in the Middle East",
        "Authors": "By Pollack, Kenneth M.",
        "Description": "“A persuasive but painful solution for dealing with the mess in the Middle East.” –Kirkus The greatest danger to America’s peace and prosperity, notes leading Middle East policy analyst Kenneth M. Pollack, lies in the political repression, economic stagnation, and cultural conflict running rampant in Arab and Muslim nations. By inflaming political unrest and empowering terrorists, these forces pose a direct threat to America’s economy and national security. The impulse for America might be to turn its back on the Middle East in frustration over the George W. Bush administration’s mishandling of the Iraq War and other engagements with Arab and Muslim countries. But such a move, Pollack asserts, will only exacerbate problems. He counters with the idea that we must continue to make the Middle East a priority in our policy, but in a humbler, more humane, more realistic, and more cohesive way. Pollack argues that Washington’s greatest sin in its relations with the Middle East has been its persistent unwillingness to make the sustained and patient effort needed to help the people of the Middle East overcome the crippling societal problems facing their governments and societies. As a result, the United States has never had a workable comprehensive policy in the region, just a skein of half-measures intended either to avoid entanglement or to contain the influence of the Soviet Union.Beyond identifying the stagnation of civic life in Arab and Muslim states and the cumulative effect of our misguided policies, Pollack offers a long-term strategy to ameliorate the political, economic, and social problems that underlie the region’s many crises. Through his suggested policies, America can engage directly with the governments of the Middle East and indirectly with its people by means of cultural exchange, commerce, and other “soft” approaches. He carefully examines each of the region’s most contested areas, including Iraq, Iran, Syria, and Lebanon, as well as the Israeli-Palestinian peace process, and explains how the United States can address each through mutually reinforcing policies. At a time when the nation will be facing critical decisions about our continued presence in Iraq and Afghanistan, A Path Out of the Desert is guaranteed to stimulate debate about America’s humanitarian, diplomatic, and military involvement in the Middle East.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Ripley's Believe it or Not! Souvenir Guidebook",
        "Authors": "By Meyer, Edward",
        "Description": "",
        "Category": "",
        "Publisher": "Ripleys",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "How Did They Do That?",
        "Authors": "By Sutton, Caroline",
        "Description": "The totally satisfying answers to more than 100 questions that drive normal people - not to mention infomaniacs and trivia buffs - crazy.- Questions about matters great and small, from ancient times to yesterday. - Illustrated with illuminating technical drawings and unusual vintage photographs.How did they spend $40 million making Heaven's Gate?How did they decide the length of a mile?How did Beethoven compose when he was deaf?How did they discover the Hope diamond?How did they know the size of the Earth over 1,700 years before anyone sailed around it? How did they set the price of the Louisiana Purchase? How did the FBI devise the \"Ten Most Wanted\" list?How did they decide which horses were Thoroughbreds?How did they pick the Four Hundred?How did they start the  Guiness Book of World Records?How did the Indians decide that cows were sacred?How did they discover penicillin?How did they build the Great Pyramid at Giza?How did they decide how tall to make the Empire State Building?How did they know there was an El Dorado?How did they start the Chicago fire of 1871?How did Hannibal cross the Alps?",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Quill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "The Secular City",
        "Authors": "By Cox, Harvey",
        "Description": "",
        "Category": "",
        "Publisher": "The MacMillan Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Fete Accompli!: The Ultimate Guide To Creative Entertaining",
        "Authors": "By Shriftman, Lara, Harrison, Elizabeth, and Robinovitz, Karen",
        "Description": "Throwing a successful party requires a lot more than a well-stocked bar and good music. As public relations experts whose job it is to produce events that make a lasting impression, Lara Shriftman and Elizabeth Harrison know it’s the details that make the difference. Now you, too, can organize any party, for 10 guests or 1,000, on a budget of $50 or $500,000, from creating the concept right down to saying goodbye at the end of the night. Chic tips, creative ideas, irresistible recipes, and all the countless ingredients that make a party sizzle are at your fingertips in this hip and handy guide to becoming an event planner extraordinaire. You’ll find the experts’ best advice on:Creating a concept and a budget for any kind of partyChoosing the right location, whether you keep it cozy at home, camp out at the beach, or rent a local clubDesigning invitations, from classic to kitschySetting the mood with lighting, music, flowers, furniture, décor, and all the little touches that make a party extra fabStocking a thirst-quenching home bar, whipping up smart cocktails, and thinking of innovative ways to serve it all up in style Whetting the appetites of your guests, using insider secrets from chefs and tips on how to make fast food sophisticated, with sample menus for classic cocktail parties, luncheons, late-night bashes, and moreBeing a flawless host—or guest—with proper etiquette guidelines, gift ideas, Table Setting 101, and the 411 on posing for the cameraProducing a party from beginning to end with colorful case studies and detailed instructions for eight fierce fêtes, such as a Hamptons-style clambake, a Barbie theme party, an Indian dinner on a $200 budget, and a mani-pedi partyRe-creating our favorite drinks and dishes from the best restaurants and bars all over the world, like Nobu, Asia de Cuba, Trader Vic’s, Bungalow 8, the Delano Hotel, and Indochine Getting what you need. There’s a complete resource guide in the back, not to mention savvy tips from Puff Daddy, Russell Simmons, Lara Flynn Boyle, David Copperfield, Hugh Jackman, and Donald Trump.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Last Summer (of You and Me)",
        "Authors": "By Brashares, Ann",
        "Description": "From the author of the multimillion-copy, #1 bestselling series The Sisterhood of the Traveling Pants comes a heartbreaking first adult novel.  Ann Brashares's series, The Sisterhood of the Traveling Pants, has made her one of the most successful contemporary authors, shipping more than 8 million copies over the last five years and winning even more millions of passionate fans. Now, like Judy Blume (Summer Sisters) before her, Brashares turns her spectacular gifts to adult readers. In The Last Summer (of You and Me), Brashares uses her remarkable storytelling, emotional insights, and talent for capturing relationships to weave a rich, textured, mature novel that will resonate as clearly with readers in their forties as in their twenties.  Set on Long Island's Fire Island, The Last Summer (of You and Me) is an enchanting, heartrending page-turner about sisterhood, friendship, love, loss, and growing up. It is the story of a beach community friendship triangle-Riley and Alice, two sisters in their twenties, and Paul, the young man they've grown up with-and what happens one summer when budding love, sexual curiosity, a sudden serious illness, and a deep secret all collide, launching the friends into an adult world from which their summer haven can no longer protect them.  As wise, compelling, and endearing as her Traveling Pants series, and as lyrical, thoughtful, and moving as the best literary women's fiction, this novel is sure to win an entire new generation of adult fans.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Riverhead Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Paint and Color",
        "Authors": "By Hirschman,Jessica Elin",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes Noble",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Drying Flowers",
        "Authors": "By Rogers, Barbara Radcliffe",
        "Description": "",
        "Category": " Crafts & Hobbies , Flower Arranging",
        "Publisher": "Friedman/Fairfax Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Decorating Projects You Can Make",
        "Authors": "By Tincher-Durik, Amy",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corporation",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Black and White and Dead All Over",
        "Authors": "By Darnton, John",
        "Description": "A keenly intelligent, delightfully mordant novel that blends fact and fiction with the same deft hand that was at work in John Darnton’s best-selling Neanderthal.Bad news is brewing in the inner sanctum of the New York Globe, the city’s long-standing newspaper of note, whose back is to the wall. Readership, advertising, and circulation are plummeting—along with the paper’s vaunted standards—and the cost cutters have their knives out. But trouble of a wholly different kind begins one rainy September morning when a powerful editor is found murdered in the newsroom, with the spike that he’d wielded to kill stories hammered into his chest. The problem for Priscilla Bollingsworth, the young, ambitious female NYPD detective assigned to the case—besides the fact that the mayor is breathing down her neck—is that there are too many suspects to choose from.She teams up with Jude Hurley, a clever, rebellious reporter, and together they navigate the ink-infested waters whose denizens include the paper’s resentful old guard, scheming careerists, a bumbling publisher, a steely executive editor, and a rival newspaper tycoon named Lester Moloch. But the waters thicken considerably when more bodies turn up, dead all over.Armed with the firsthand knowledge he has acquired through forty years in journalism, John Darnton conjures up the cynicism and romanticism of the profession and gives us a cunning, pitch-perfect portrait of the declining—if not yet murderous—newspaper industry. Black and White and Dead All Over is a satirical mystery that entertains from first to last.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "The Adventures of Snail at School (I Can Read Level 2)",
        "Authors": "By Stadler, John",
        "Description": "He really does. But something strange happens every time he tries: The water fountain turns into a tidal wave. The fire extinguisher blasts him into space. The music baton becomes a magic wand! Is Snail really helpful? Maybe. Is he good at having adventures? Yes!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Oh, Cats! (My First I Can Read)",
        "Authors": "By Westcott, Nadine Bernard (ILT) and Buck, Nola",
        "Description": "When a young girl spies three cats in her yard, she hopes they will be her playmates! But these frolicking felines have other ideas for fun. Will they ever be her friends?Illustrated with bright, fresh pictures by Nadine Bernard Westcott, Nola Buck's simple text is perfect for emergent readers and cat lovers alike.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Henry Huggins",
        "Authors": "By Cleary, Beverly",
        "Description": "This timeless classic now features a foreword written by New York Times bestselling author Judy Blume, as well as an exclusive interview with Beverly Cleary herself! In the first novel from Newbery Medal–winning author Beverly Cleary, boys and girls alike will be charmed instantly by an average boy whose life is turned upside down when he meets a lovable puppy with a nose for mischief. Just as Henry Huggins is complaining that nothing exciting ever happens, a friendly dog sits down beside him and looks pleadingly at his ice-cream cone. From that moment on, the two are inseparable. But when Ribsy's original owner appears, trying to reclaim his dog, Henry's faced with the possibility of losing his new best friend. Has Klickitat Street seen the last of rambunctious Ribsy?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "First Flight: The Story of Tom Tate and the Wright Brothers (I Can Read Level 4)",
        "Authors": "By Shea, George and Bolognese, Don (ILT)",
        "Description": "This Level Four I Can Read book is a perfect bridge to chapter books for elementary-grade kids—and it introduces the thrilling story of the Wright Brothers, flight pioneers.When Tom Tate hears that Wilbur and Orville Wright are building a flying machine, he can't wait to try it. Tom's dad thinks it's dangerous. Some people think the Wrights are crazy. Can Tom help the brothers get their dream off the ground?\"Children will identify with the spirit of this boy who enthusiastically volunteered to try out the glider when there wasn't enough wind to lift the grown men,\" commented School Library Journal, which also praised the \"carefully researched\" illustrations.First Flight helps build reading confidence and pleasure while engaging young readers with compelling historical fiction.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Inspector Hopper (I Can Read Level 2)",
        "Authors": "By Cushman, Doug",
        "Description": "Private bug on the caseInspector Hopper is a detective with a feel -- and feelers -- for mysteries. With the help of his partner, McBugg, this tiny supersleuth can crack any case!",
        "Category": " Juvenile Fiction , Animals , Insects, Spiders, etc.",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Three by the Sea (Penguin Young Readers, Level 3)",
        "Authors": "By Marshall, James (ILT) and Marshall, Edward",
        "Description": "After a picnic on the beach, Lolly, Sam, and Spider decide to tell spooky stories. Lolly's is an eerie story from her school book. Sam's is suspenseful, with an unexpected ending. But Spider's might be the scariest of them all!",
        "Category": " Juvenile Fiction , Concepts , Counting & Numbers",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Devil May Care (The New James Bond Novel )",
        "Authors": "By Faulks, Sebastian",
        "Description": "Bond is back. With a vengeance. Devil May Care is a masterful continuation of the James Bond legacy–an electrifying new chapter in the life of the most iconic spy of literature and film, written to celebrate the centenary of Ian Fleming’s birth on May 28, 1908.An Algerian drug runner is savagely executed in the desolate outskirts of Paris. This seemingly isolated event leads to the recall of Agent 007 from his sabbatical in Rome and his return to the world of intrigue and danger where he is most at home. The head of MI6, M, assigns him to shadow the mysterious Dr. Julius Gorner, a power-crazed pharmaceutical magnate, whose wealth is exceeded only by his greed. Gorner has lately taken a disquieting interest in opiate derivatives, both legal and illegal, and this urgently bears looking into. Bond finds a willing accomplice in the shape of a glamorous Parisian named Scarlett Papava. He will need her help in a life-and-death struggle with his most dangerous adversary yet, as a chain of events threaten to lead to global catastrophe. A British airliner goes missing over Iraq. The thunder of a coming war echoes in the Middle East. And a tide of lethal narcotics threatens to engulf a Great Britain in the throes of the social upheavals of the late sixties. Picking up where Fleming left off, Sebastian Faulks takes Bond back to the height of the Cold War in a story of almost unbearable pace and tension. Devil May Care not only captures the very essence of Fleming’s original novels but also shows Bond facing dangers with a powerful relevance to our own times.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Around the world in 80 ways",
        "Authors": "By Guggenheim, Hans Georg",
        "Description": "",
        "Category": "",
        "Publisher": "Pomerica Press",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Pirate's Daughter: A Novel",
        "Authors": "By Cezair-Thompson, Margaret",
        "Description": "WINNER OF THE ESSENCE LITERARY AWARD IN FICTIONIn 1946, Hollywood’s most famous swashbuckler, Errol Flynn, arrived in Jamaica in a storm-ravaged boat. After a long and celebrated career on the silver screen, Flynn spent the last years of his life on a small island off the Jamaican coast, where he fell in love with the people, the paradisiacal setting, and the privacy, and brought a touch of Tinseltown glamour to the West Indian community.  Based on those years, The Pirate’s Daughter imagines an affair between the aging matinee star and Ida, a beautiful local girl. Flynn’s affections are unpredictable but that doesn’t stop Ida from dreaming of a life with him, especially after the birth of their daughter, May.Margaret Cezair-Thompson weaves stories of mothers and daughters, fathers and lovers, country and kin, into this compelling, dual-generational coming-of-age tale of two women struggling to find their way in a nation wrestling with its own independence.",
        "Category": " Fiction , Biographical",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Night Villa: A Novel",
        "Authors": "By Goodman, Carol",
        "Description": "An evocative tale of intrigue, romance, and treachery, Carol Goodman’s spellbinding  new novel, The Night Villa, follows the fascinating lives of two remarkable women  centuries apart. The eruption of Italy’s Mount Vesuvius in A.D. 79 buried a city  and its people, their treasures and secrets. Centuries later, echoes of this disaster  resonate with profound consequences in the life of classics professor Sophie Chase.   In the aftermath of a tragic shooting on the University of Texas campus, Sophie  seeks sanctuary on the isle of Capri, immersing herself in her latest scholarly project  alongside her colleagues, her star pupil, and their benefactor, the compelling yet  enigmatic business mogul John Lyros.  Beneath layers of volcanic ash lies the Villa  della Notte–the Night Villa–home to first-century nobles, as well as to the captivating  slave girl at the heart of an ancient controversy. And secreted in a subterranean  labyrinth rests a cache of antique documents believed lost to the ages: a prize too  tantalizing for Sophie to resist. But suspicion, fear, and danger roam the long-untrodden  tunnels and chambers beneath the once sumptuous estate–especially after Sophie sees  the face of her former lover in the darkness, leaving her to wonder if she is chasing  shadows or succumbing to the siren song of the Night Villa. Whatever shocking events  transpired in the face of Vesuvius’s fury have led to deeper, darker machinations  that inexorably draw Sophie into their vortex, rich in stunning revelations and laden  with unseen menace. Praise for The Night Villa “Visit The Night Villa: Carol Goodman’ s luminous prose and superb storytelling will keep you entertained into the late  hours.”—Nancy Pickard “The pleasure of a Carol Goodman novel is in her enviable  command of the classical canon–and the deft way she [writes] a book that’s light  enough for a weekend on the beach but literary enough for a weekend in the Hamptons.”—Chicago Tribune",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Letters to a Young Teacher",
        "Authors": "By Kozol, Jonathan",
        "Description": "This is the book for readers of Jonathan Kozol's previous works on education, including The Shame of the Nation and On Being a Teacher; for readers of memoirs like Frank McCourt's Teacher Man; for new teachers looking for guidance and inspiration; and for educators, administrators, and children's advocates of all levels of experience. From the award-winning author of bestsellers Shame of the Nation, Savage Inequalities, Amazing Grace, Death at an Early Age, and Ordinary Resurrections, Jonathan Kozol's most personally insightful and revealing work to date takes the form of encouraging letters to Francesca, a young classroom teacher, offering advice, personal stories, and a shared sense of outrage at the inadequacies of America's educational system.",
        "Category": " Education , Counseling , Academic Development",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Chessmen",
        "Authors": "By Mackett-Beeson, Alfred Ernest James",
        "Description": "",
        "Category": "",
        "Publisher": "OCTOPUS BOOKS LIMITED",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Why We Hate Us: American Discontent in the New Millennium",
        "Authors": "By Meyer, Dick",
        "Description": "Americans are as safe, well fed, securely sheltered, long-lived, free, and healthy as any human beings who have ever lived on the planet. But we are down on America. So why do we hate us? According to Dick Meyer, the following items on this (much abbreviated) list are some of the contributors to our deep disenchantment with our own culture:Cell-phone talkers broadcasting the intimate details of their lives in public spacesWorship of self-awareness, self-realization, and self-fulfillmentT-shirts that read, “Eat Me”Facebook, MySpace, and kids being taught to market themselvesHigh-level cheating in business and sportsReality television and the cosmetic surgery boomMultinational corporations that claim, “We care about you.”The decline of organic communitiesA line of cosmetics called “S.L.U.T.”The phony red state–blue state divideThe penetration of OmniMarketing into OmniMedia and the insinuation of both into every facet of our livesYou undoubtedly could add to the list with hardly a moment’s thought. In Why We Hate Us, Meyer absolutely nails America’s early-twenty-first-century mood disorder. He points out the most widespread carriers of the why-we-hate-us germs, including the belligerence of partisan politics that perverts our democracy, the decline of once common manners, the vulgarity of Hollywood entertainment, the superficiality and untrustworthiness of the news media, the cult of celebrity, and the disappearance of authentic neighborhoods and voluntary organizations (the kind that have actual meetings where one can hobnob instead of just clicking in an online contribution).Meyer argues—with biting wit and observations that make you want to shout, “Yes! I hate that too!”—that when the social, spiritual, and political turmoil that followed the sixties collided with the technological and media revolution at the turn of the century, something inside us hit overload. American culture no longer reflects our own values. As a result, we are now morally and existentially tired, disoriented, anchorless, and defensive. We hate us and we wonder why.Why We Hate Us reveals why we do and also offers a thoughtful and uplifting prescription for breaking out of our current morass and learning how to hate us less. It is a penetrating but always accessible Culture of Narcissism for a new generation, and it carries forward ideas that resounded with readers in bestsellers such as On Bullshit and Bowling Alone.",
        "Category": " Psychology , Social Psychology",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "So Sexy So Soon: The New Sexualized Childhood and What Parents Can Do to Protect Their Kids",
        "Authors": "By Levin, Diane E. and Kilbourne, Jean",
        "Description": "Thong panties, padded bras, and risqué Halloween costumes for young girls. T-shirts that boast “Chick Magnet” for toddler boys. Sexy content on almost every television channel, as well as in books, movies, video games, and even cartoons. Hot young female pop stars wearing provocative clothing and dancing suggestively while singing songs with sexual and sometimes violent lyrics. These products are marketed aggressively to our children; these stars are held up for our young daughters to emulate–and for our sons to see as objects of desire.Popular culture and technology inundate our children with an onslaught of mixed messages at earlier ages than ever before. Corporations capitalize on this disturbing trend, and without the emotional sophistication to understand what they are doing and seeing, kids are getting into increasing trouble emotionally and socially; some may even to engage in precocious sexual behavior. Parents are left shaking their heads, wondering: How did this happen? What can we do?So Sexy So Soon is an invaluable and practical guide for parents who are fed up, confused, and even scared by what their kids–or their kids’ friends–do and say. Diane E. Levin, Ph.D., and Jean Kilbourne, Ed.D., internationally recognized experts in early childhood development and the impact of the media on children and teens, understand that saying no to commercial culture–TV, movies, toys, Internet access, and video games–isn’t a realistic or viable option for most families. Instead, they offer parents essential, age-appropriate strategies to counter the assault. For instance:• Help your children expand their imaginations by suggesting new ways for them to play with toys–for example, instead of “playing house” with dolls, they might send their toys on a backyard archeological adventure.• Counteract the narrow gender stereotypes in today’s media: ask your son to help you cook; get your daughter outside to play ball.• Share your values and concerns with other adults–relatives, parents of your children’s friends–and agree on how you’ll deal with TV and other media when your children are at one another’s houses.Filled with savvy suggestions, helpful sample dialogues, and poignant true stories from families dealing with these issues, So Sexy So Soon provides parents with the information, skills, and confidence they need to discuss sensitive topics openly and effectively so their kids can just be kids.",
        "Category": " Social Science , Children's Studies",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Gargoyle",
        "Authors": "By Davidson, Andrew",
        "Description": "An extraordinary debut novel of love that survives the fires of hell and transcends the boundaries of timeThe narrator of The Gargoyle is a very contemporary cynic, physically beautiful and sexually adept, who dwells in the moral vacuum that is modern life. As the book opens, he is driving along a dark road when he is distracted by what seems to be a flight of arrows. He crashes into a ravine and suffers horrible burns over much of his body. As he recovers in a burn ward, undergoing the tortures of the damned, he awaits the day when he can leave the hospital and commit carefully planned suicide—for he is now a monster in appearance as well as in soul.A beautiful and compelling, but clearly unhinged, sculptress of gargoyles by the name of Marianne Engel appears at the foot of his bed and insists that they were once lovers in medieval Germany. In her telling, he was a badly injured mercenary and she was a nun and scribe in the famed monastery of Engelthal who nursed him back to health. As she spins their tale in Scheherazade fashion and relates equally mesmerizing stories of deathless love in Japan, Iceland, Italy, and England, he finds himself drawn back to life—and, finally, in love. He is released into Marianne's care and takes up residence in her huge stone house. But all is not well. For one thing, the pull of his past sins becomes ever more powerful as the morphine he is prescribed becomes ever more addictive. For another, Marianne receives word from God that she has only twenty-seven sculptures left to complete—and her time on earth will be finished.Already an international literary sensation, the Gargoyle is an Inferno for our time. It will have you believing in the impossible.",
        "Category": " Fiction , Visionary & Metaphysical",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Chicago Way (Michael Kelly Series)",
        "Authors": "By Harvey, Michael",
        "Description": "Private detective Michael Kelly is hired by his former partner to solve an eight-year old rape and battery case long gone cold.  But when the partner turns up dead, Kelly enlists a team of his savviest colleagues to connect the dots between the recent murder and the cold case it revived: a television reporter whose relationship with Kelly is not strictly professional; his best friend from childhood, a forensic DNA expert; and an old ally from the DA's office. To close the case, Kelly will have to face the mob, a serial killer, his own double-crossing friends, and the mean streets of the city he loves.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Vintage Crime/Black Lizard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Black Wave: A Family's Adventure at Sea and the Disaster That Saved Them",
        "Authors": "By Silverwood, John",
        "Description": "“I told God that if he would let us survive this night, I would make it mean something worthwhile. And then, somehow, I felt calmer than I have ever felt. Unreasonably so. Irrationally so. I looked over the scene of our wrecked life and I smiled–a crazy smile for sure–and I looked through the dark at the mad beauty of it.”–Jean SilverwoodAn exhilarating true-life adventure of one family’s extraordinary sea voyage of self-discovery and survival, tragedy and triumphSuccessful businessman John Silverwood and his wife, Jean, both experienced sailors, decided the time was right to give their four children a taste of thrilling life on the high seas. And indeed their journey aboard the fifty-five-foot catamaran Emerald Jane would have many extraordinary and profound moments, whether it was the peaceful late-night watches John enjoyed under the stunning celestial sky or the elation shared by the whole family at the sight of blissful pods of dolphin and migrating tortoises. John and Jean had hoped to use the trip as a teaching opportunity, with the Emerald Jane as a floating classroom in which to instruct their children in important lessons–not only about the natural world but about the beauty of human life when stripped down to its essence, far from the trappings of civilization. Yet rather than flourishing amid the new freedoms and responsibilities thrust upon them, the children were sometimes confused, frightened, resentful. The two oldest, fourteen-year-old Ben and twelve-year-old Amelia, missed their friends and the comfortable life left behind in San Diego, while the two youngest, Jack, seven, and Camille, three, picked up on the stressful currents running above and below the surface–for throughout the journey, the Silverwood family found its bonds tested as never before. John and Jean, whose marriage had weathered its share of storms, would wonder again if they had taken on too much as the physical, emotional, and financial strains of caring for the expensive catamaran and their children brought old resentments to the surface. John’s dream trip that began on Long Island Sound ended almost two years later as a nightmare in treacherous waters off a remote atoll in French Polynesia, where, in an explosion of awesome violence, the terrifying brunt of the ocean’s anger fell upon the Emerald Jane.Gradually, in the crucible of the sea, a stronger, more closely knit unit was forged. The Silverwoods became a crew. Then they became a family again. But just as it seemed to them that they had mastered every challenge, their world was shattered in a split-second of unimaginable horror. Now their real challenge began, forcing them to fight for their very lives.",
        "Category": " Biography & Autobiography , Adventurers & Explorers",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Up Taught",
        "Authors": "By Ken Macrorie",
        "Description": "",
        "Category": "",
        "Publisher": "Hayden Book Company",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Family Linen",
        "Authors": "By Smith, Lee",
        "Description": "\"Brilliant, haunting, dark, joyous, remarkably compelling...immensely difficult to put down...a master storyteller.\"THE VILLAGE VOICEA childhood memory re-experienced, a funeral that brings about a family reunion, and the excavation of a swimming pool on the site of an old well, uncover family secrets and air the dirty linen in this behind-the-scenes look at life and family, memory and forgetfulness, anger and forgiveness in a small Southern town.\"Falls in line with the best of classical Southern fiction...but Ms. Smith's vision is her own and places her among the best of contemporary Southern writers.\"THE ATLANTA CONSTITUTIONFrom the Paperback edition.",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Laughing Your Way to Good Health",
        "Authors": "By Susan Vass",
        "Description": "",
        "Category": "",
        "Publisher": "HMR Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Ladies of Garrison Gardens: A Novel (Ballantine Reader's Circle)",
        "Authors": "By Shaffer, Louise",
        "Description": "Charles Valley’s legendary dowagers, the three Miss Margarets, have lost one of their own: Peggy Garrison, who married into a huge fortune but was constantly overshadowed by the legacy her husband’s first wife, the great Myrtis Garrison. When Peggy’s will is read, the news of who will take over the Garrison fortune shakes the town to its core. To everyone’s shock, Peggy has left all of the Garrison holdings–the world-famous botanical gardens, the massive resort, and the lovely Garrison “Cottage,” where FDR once visited–to the town’s down-and-out wild child, Laurel Selene McCready.Laurel was like a daughter to Miss Peggy, but the last thing she wants to do is step into Miss Peggy’s shoes as the wealthiest, most powerful person in town, especially since the Garrison fortune never bought Peggy any happiness. On top of that, when Laurel reluctantly explores her hew home, the storied Garrison Cottage, she discovers that mysteries abound when it comes to the great Miss Myrtis. What clues are hidden in an old suitcase containing a child’s dress and sheet music dating back to the Southern Vaudeville circuit? Who is the elderly woman outside Atlanta who has been keeping track of the Garrison estate’s every development via the Charles Valley Gazette? And how will Laurel avoid the fate of her two predecessors whose secrets have far greater implications than Laurel could ever have imagined? Culminating in an unforgettable sleight of hand, proving that behind every great fortune there is a great crime, The Ladies of Garrison Gardens is as page-turning and irresistible as its predecessor.",
        "Category": " Fiction , Women",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Songs Without Words (Vintage Contemporaries)",
        "Authors": "By Packer, Ann",
        "Description": "Liz and Sarabeth were girlhood neighbors in the suburbs of Northern California, brought as close as sisters by the suicide of Sarabeth's mother. In the decades that followed, their relationship remained a source of continuity and strength. But when Liz's adolescent daughter enters dangerous waters, the women's friendship takes a devastating turn, forcing Liz and Sarabeth to question their most deeply held beliefs about their connection. From the bestselling author of The Dive from Clausen's Pier, Songs Without Words is the gripping story of a lifelong friendship pushed to the breaking point.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Oral History",
        "Authors": "By Smith, Lee",
        "Description": "\"Delightful and entertaining.\"PEOPLEWhen Jennifer, a college student, returns to her childhood home of Hoot Owl Holler with a tape recorder, the tales of murder and suicide, incest and blood ties, bring to life a vibrant story of a doomed family that still refuses to give up....\"Deft and assured....[Lee Smith] is nothing less than masterly.\"THE NEW YORK TIMES BOOK REVIEWFrom the Paperback edition.",
        "Category": " Fiction , Sagas",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Grandma knows best, but no one ever listens",
        "Authors": "By McBride, Mary",
        "Description": "Hilarious helpful hints for grandmothers to instruct them how to 'scheme, lie, cheat and threaten so they will be thought of as a sweet darling grandmas' - whilst avoiding baby-sitting duties!",
        "Category": " Family & Relationships , Parenting , Grandparenting",
        "Publisher": "distributed by Simon and Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The War: An Intimate History, 1941-1945",
        "Authors": "By Ward, Geoffrey C. and Burns, Ken",
        "Description": "The vivid voices that speak from these pages are not those of historians or scholars. They are the voices of ordinary men and women who experienced—and helped to win—the most devastating war in history, in which between 50 and 60 million lives were lost.Focusing on the citizens of four towns— Luverne, Minnesota; Sacramento, California; Waterbury, Connecticut; Mobile, Alabama;—The War follows more than forty people from 1941 to 1945. Woven largely from their memories, the compelling, unflinching narrative unfolds month by bloody month, with the outcome always in doubt. All the iconic events are here, from Pearl Harbor to the liberation of the concentration camps—but we also move among prisoners of war and Japanese American internees, defense workers and schoolchildren, and families who struggled simply to stay together while their men were shipped off to Europe, the Pacific, and North Africa.Enriched by maps and hundreds of photographs, including many never published before, this is an intimate, profoundly affecting chronicle of the war that shaped our world.",
        "Category": " History , Military , World War II",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.35",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Homemade: Delicious Foods to Make and Give",
        "Authors": "By Choate, Judith and Hughes, Lyn (PHT)",
        "Description": "Everyone wants to make it homemade. The gift-giver, who would rather offer a more personal present than spend time combing the shops. The food-lover, who adores preparing distinctive, delicious foods in her own kitchen. The crafts-maker, who loves to create, wrap, and decorate truly gorgeous gifts. Now the perfect book for all of them is here: Homemade, the ultimate treasury of food gifts from the heart.Homemade is filled with an incredible variety of easy, irresistible recipes for everything from the perfect little tea cake to bring as a hostess gift to an assortment of fudge that makes a delightful Christmas present. Delicious ideas include:• Unique and luscious baked treats like Hazelnut Pound Cake, Chocolate Butter Balls, and Carrot-Ginger Tea Bread•Jarred delights such as Spiced Candied Nuts and Strawberry-Grand Marnier Jam•Wonderful additions to the food-lover’s pantry, including Provençal Oil, Red Chile Salsa, and Thai Peanut Sauce• Plus chutneys, relishes, and dressings—even snacks and drinksBut Homemade is much more than a collection of recipes. Since a big part of every gift’s appeal is its presentation, author Judith Choate includes plenty of ideas and tips on how to wrap, pack, and ship food gifts with creativity and style. You’ll learn how to cleverly combine food gifts into the perfect package, how to decorate jar tops, where to find beautiful bottles for condiments and flavored oils, and more.Generously illustrated with vibrant full-color photographs, Homemade shows just how easy (and fun) it is to make delectable gifts everyone will be thrilled to receive.“The most precious gift you can give to someone you love may be a copy of this book!” —Chef Alain Sailhac, The French Culinary Institute“This is not merely a collection of recipes; it is an extraordinary celebration of delicious homemade gifts. Judith Choate’s generous nature and love for food infuses every page and compels us to jump into the kitchen and whip up a batch of fudge for a neighbor or friend—just for the sheer pleasure of giving.” —Tish Boyle, food editor of Chocolatier magazine and author of Chocolate Passion",
        "Category": " Cooking , Methods , Canning & Preserving",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "History Of God: The 4000-Year Quest of Judaism, Christianity, and Islam",
        "Authors": "By Armstrong, Karen",
        "Description": "One of England's foremost religious commentators, the author of Beginning the World explores the evolution of the idea and experience of God, from Abraham to the present. 25,000 first printing. $30,000 ad/promo.",
        "Category": " History , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The I of the Storm: Embracing Conflict, Creating Peace",
        "Authors": "By Simmons, Gary",
        "Description": "",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Unity",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Heart of Godly Leadership",
        "Authors": "By Armerding, Hudson T",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Crossway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Erotica Vampirica",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Quality Paperback Book Club",
        "Price Starting With ($)": "55.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    }
]