[
    {
        "Title": "The Sweet Potato Queens: Stuff We Didn't Actually Do, But Could Have, And May Yet",
        "Authors": "By Browne, Jill Conner and Gillespie, Karin (CON)",
        "Description": "\"I have no pride. I tell anything,\" Jill Conner Browne is fond of saying. As Her Royal Highness, Boss Queen of the Sweet Potato Queens®, she has told legions of fans, known as \"SPQ Wannabes,\" her delectable secrets to living, loving -- and eating -- like a queen. In her words, \"More is more.\"   How much more? The #1 New York Times bestselling author of five works of nonfiction now serves up The Sweet Potato Queens' First Big-Ass Novel: Stuff We Didn't Actually Do, but Could Have, and May Yet. The humor in this uproarious coming-of-queen novel is more delicious than a favorite dessert (the Queens favor Chocolate Stuff&#153;, of course).   In Jackson, Mississippi, Mary Bennett, Patsy, Gerald, and Jill are high school classmates whose daily routine is paced like a shuffle through the local red dirt -- until the arrival of a redheaded newcomer banishes monotony forever. With her luxurious mane and voluptuous figure, Tammy Myers aspires to join the silver-spooners, who make things happen in their lives. When Jill convinces Tammy and the others that money might buy a certain kind of good time and that true friendship has no price tag, the \"Sweet Potato Queens\" are born. \"If it ain't fun, we ain't doin' it,\" runs their official club motto, and the Queens are true to their word.   Together, the Queens laugh out loud as they step down the long -- and not altogether pretty -- road toward making their very own queen dust, the sparkle that comes from livin' and lovin' their own lives. The Sweet Potato Queens' First Big-Ass Novel: Stuff We Didn't Actually Do, but Could Have, and May Yet reveals that the journey isn't always easy, but in the company of the Queens, you can sparkle, too.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Apart from the Crowd",
        "Authors": "By McPartlin, Anna",
        "Description": "In a little Irish town like Kenmare, there's no need to worry whether people will discover your secrets. They already have.   For Mary, that means being remembered for her tragic losses, even if she'd rather get on with her life. For her cousin Ivan, as close as a brother, the gossip is all about how his wife took the kids and ran off with her new lover. For Mary's friend Penny, it's an old romance that didn't work out quite right, and a current affair with a bottle of vodka.   Then Sam Sullivan rents the cottage next door to Mary, and within hours the whole town is talking about the film-star-handsome American. When Sam hurts his back while helping his new neighbor and spends the next week confined to a mattress on her floor, gossip runs rampant. But neither Kenmare nor Mary know about the secrets Sam is so successfully hiding....   For Mary's circle of friends, Sam's arrival marks more than one change. And Mary -- whose unlucky history has kept her apart from the crowd much of her life -- has finally found a man with whom she feels she might truly connect. But so long as both are captive to memories they dare not reveal, the past is a barrier that will keep them forever alone.   In this powerful novel, Anna McPartlin perfectly captures the drama, the emotion, and the laughter of a small Irish community, for those who fit in -- and those who don't. Apart from the Crowd mixes wit and insight to create an engrossing tale that will keep you reading to the very last page.",
        "Category": " Fiction , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Growing Up Green: Baby and Child Care: Volume 2 in the Bestselling Green This! Series",
        "Authors": "By Imus, Deirdre",
        "Description": "The essential, parent-friendly guide to raising a healthy child in our increasingly toxic environment.  The second volume in the New York Times bestselling Green This! series, Growing Up Green: Baby and Child Care is a complete guide to raising healthy kids. Environmental activist and children's advocate Deirdre Imus addresses specific issues faced by children in every age group -- from infants to adolescents and beyond. With a focus on preventing rather than treating childhood illnesses, Deirdre concentrates on educating and empowering parents with information such as:   &#149; How to make sure your child is vaccinated safely  &#149; Which plastic bottles and toys are least toxic  &#149; How to lobby for safer school environments and support children's environmental health studies  &#149; Advice from leading \"green\" pediatricians and nationally recognized doctors such as Mehmet C. Oz, M.D.    Chock-full of research and advice, Growing Up Green makes it easy for you to introduce your child to the \"living green\" way of life.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "What Pets Do While You're at Work",
        "Authors": "By West, Bev and Bergund, Jason",
        "Description": "The Unauthorized Album of caught-in-the-act photos your beloved furry ones never meant for you to see, What Pets Do While You're at Work reveals for the first time what your pets are really up to while you're away. And it's not all good clean fun! From an unsupervised canine \"Come Pee in My Pool\" party to channel-surfing fat cats, eloping bulldogs, shopaholic iguanas, and potbelly pigs that slurp their lunch on the rocks, the pets in these pages really don't seem to be missing you much at all.So, in the morning as you head off to work, you'll feel a little less guilty because your pets are not napping or staring, bored, out the window, waiting for you to come home. They are living each moment to the fullest, especially when you're not around!",
        "Category": " Pets , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Melt & Pour Soapmaking",
        "Authors": "By Browning, Marie",
        "Description": "Soaps fragrant with oils or spices, fizzing up the bath, or molded into perfect petals to place in a pretty jar beside the sink. Ones with guardian angels or good luck coins tucked inside. A virtual cornucopia of beautiful soaps will delight your senses with their scents, shapes, and feel. (Of course, they'll get you clean too, oh so gently, but they're almost too attractive to use up!) And, these soaps are easy to make, out of the kindest, chemical-free ingredients. Just take a commercially available glycerine or coconut-oil base, cut it up, and melt in a microwave or double boiler. Pour the liquid into molds to set--and let the real fun begin. Your imagination will go wild with possibilities as you check out different types of aromatic and essential oil (with tips on blending); additives such as almond or beeswax, colorants; and molds for hexagons, delicate shells, and more. Plus: information on hand milling! A Selection of the Crafters Choice Book Club.",
        "Category": " Crafts & Hobbies , Reference",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Little Lady, Big Apple",
        "Authors": "By Browne, Hester",
        "Description": "In Hester Browne's \"deliciously addictive\" (Cosmopolitan) bestseller The Little Lady Agency, Melissa Romney-Jones transformed herself from doormat to diva as Honey, London's premier freelance girlfriend. Now, Melissa is about to take Manhattan, and its clueless bachelors, by storm!  With the Little Lady Agency doing a booming business back home, Melissa joins her dashing American boyfriend, Jonathan Riley, for an extended holiday in Manhattan. But she's soon out of her depth among Jonathan's hard-charging friends and his interfering ex-wife. And while she's all for shopping and sight-seeing, a covert work opportunity is an irresistible temptation -- a project that soon lands her in the tabloids! Now, a hilarious and heartbreaking chain of events may force Melissa to choose between the man she loves and the unique man-handling business into which she has poured her heart and soul....",
        "Category": " Fiction , Romance , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Al Roker's Big Bad Book of Barbecue: 100 Easy Recipes for Backyard Barbecue and Grilling",
        "Authors": "By Roker, Al",
        "Description": "A backyard-loving guy, Al Roker's passionate about firing up all three of his grills at once and cooking everything from Steaks As Big As Your Head and Kansas City-Style Ribs to Grilled Sea Bass.The hundred recipes in this book are casual and simple -- just the way Al likes to cook for his family and friends. Like most of us, Al first learned to grill at the knee of his dad, whose policy was \"the more lighter fluid, the better.\" But a trip to the Memphis in May Barbecue Championship ignited a real passion, and since then Al's grills have rarely grown cold. And while Al does have some hard-and-fast rules, like \"don't keep moving your meat around\" and \"never touch another man's grill,\" his food is simple yet inventive, impressive and delicious.In addition to great stuff for over the fire -- Jerk Chicken, Marinated Pork Tenderloin, Kebabs Cooked Right, New Orleans-Style Barbecued Shrimp, Fish Fillets with Lemon-Parsley Sauce, Turkey on the Grill, and, from \"The Wurst City in the World,\" Sheboygan Bratwurst -- Al Roker's Big Bad Book of Barbecue has something for everyone, including recipes for quick-and-easy starters, marinades, main-dish salads, sides, classic American desserts, cooling drinks, vegetarian dishes, and low-fat fare.So lean back in that lawn chair and have a sip of Lemon-Lime Fizz. Munch on a Spicy Wing or some BBQ Popcorn. That brisket should take care of itself in another hour or so.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Moosewood Restaurant Cooks at Home: Fast and Easy Recipes for Any Day",
        "Authors": "By Moosewood Collective",
        "Description": "Winner of the 1995 James Beard Award for Best Vegetarian CookbookAlthough many people think that cooking without meat means spending more time in the kitchen, the cooks at the world-renowned Moosewood Restaurant know this isn't so. Busy balancing home, work, and other commitments, they've been cooking for family and friends every day of the week for over twenty years. Moosewood Restaurant Cooks at Home is the result of that experience—over 150 carefully honed and tested recipes calling for the best ingredients, accompanied by time-saving tips and planning suggestions, add up to a delicious whole-foods cuisine that is versatile and healthful and can be prepared with a minimum of effort. This book contains dishes full of exciting flavors, sure to please every taste, from savory soups to substantial main-dish salads, from hearty stews to palate-teasing “small dishes.” Sauces, salsas and dressings, and a collection of almost-instant desserts turn the simplest meal into an occasion. Chapters on techniques and menu planning, lists of recipes for special needs, including nondairy and vegan fare and kid-pleasing food, as well as an in-depth guide to stocking the meatless pantry (including a list of recommended convenience foods), make Moosewood Restaurant Cooks at Home the essential companion to everyday cooking.",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.71",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The Diet Detective's Calorie Bargain Bible: More than 1,000 Calorie Bargains in Supermarkets, Kitchens, Offices, Restaurants, the Movies, for Special Occasions, and More",
        "Authors": "By Platkin, Charles Stuart",
        "Description": "THE ULTIMATE DIETER'S REFERENCE GUIDE!   The Diet Detective returns, sharing his secrets for turning your favorite foods into \"Calorie Bargains,\" with his easy-to-follow reference guide for healthy eating.   In The Diet Detective's Count Down, public health advocate Charles Stuart Platkin broke down thousands of popular foods into their \"exercise equivalents\" -- the time it took to walk, run, swim, bike, or dance off their calories. Now, the Diet Detective takes his philosophy one step further -- separating truth from myth, dispelling misconceptions, and giving you the best choices for meals and snacks, anytime, anywhere. From your favorite restaurants to the aisles of the grocery store, no food has escaped Platkin's scrutiny.   We look for bargains everywhere. What if we were as cost conscious about our calorie consumption as we are about our spending? How can we be sure we're making good use of the foods we consume? The answer: Look for Calorie Bargains.   The Diet Detective's Calorie Bargain Bible is the ultimate dieter's reference guide. It's dieting made easy -- with the information that readers crave, can have fun with, and can put into practice immediately.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "The Gun Seller",
        "Authors": "By Laurie, Hugh",
        "Description": "Hugh Laurie concocts an uproarious cocktail of comic zingers and over-the-top action in this \"ripping spoof of the spy genre\" (Vanity Fair) -- the irresistible tale of a former Scots Guard-turned-hired gun, a freelance soldier of fortune who also happens to be one heck of a nice guy.  Cold-blooded murder just isn't Thomas Lang's cup of tea. Offered a bundle to assassinate an American industrialist, he opts to warn the intended victim instead -- a good deed that soon takes a bad turn. Quicker than he can down a shot of his favorite whiskey, Lang is bashing heads with a Buddha statue, matching wits with evil billionaires, and putting his life (among other things) in the hands of a bevy of femmes fatales. Up against rogue CIA agents, wannabe terrorists, and an arms dealer looking to make a high-tech killing, Lang's out to save the leggy lady he has come to love...and prevent an international bloodbath to boot.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Some Assembly Required: A Novel",
        "Authors": "By Bonasia, Lynn Kiele",
        "Description": "Thirty-nine-year-old Rose is content with her safe life: both her job writing manuals for appliances and her long-term boyfriend are reasonably satisfying. But when Mr. Almost Right betrays her, Rose decides there has to be more to it than writing succinct descriptions about how to use the timer on a Pause 'n Serve coffeemaker. Lured by the therapeutic promise of Cape Cod's sand, salt, and waves, Rose abandons her careful past and leaves the city far behind.   Rose wants only to heal her broken heart. But with the help of a few eccentric neighbors, a fulfilling new job as the world's oldest cub reporter, and a compellingly odd new man, she comes to realize that her past is the furthest thing from her mind -- and she may just have stumbled upon her future happiness.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Ultrametabolism: The Simple Plan for Automatic Weight Loss",
        "Authors": "By Hyman, Mark",
        "Description": "Bestselling author, columnist, and physician Mark Hyman, M.D., brings us a science-based, easy-to-follow diet and nutritional plan in UltraMetabolism: The Simple Plan for Automatic Weight Loss.For many, losing weight is a never-ending struggle, especially since our bodies are designed to keep weight on at all costs; it's a matter of survival. But a medical revolution is under way, showing us how to work with our bodies instead of against them to improve nutrition and ignite the natural fat-burning furnaces that lie dormant within us. Drawing on cutting-edge research about nutrigenomics—the science of how food talks to our genes—Dr. Hyman, author of bestsellers including The Blood Sugar Solution, The Ultra-Mind Solution, UltraPrevention, and The UltraSimple Diet has created a method for losing weight by eating the right foods to detox and manage food allergies. Food contains information and instructions for our bodies: eat the right foods and send instructions of weight loss and health; eat the wrong foods and send messages of weight gain and disease. After spending the last ten years conducting pioneering, hands-on research with over two thousand patients at Canyon Ranch, one of the world's leading health resorts, Dr. Hyman has discovered the seven fundamental causes of obesity. He has integrated his years of research into this groundbreaking approach to help you rebalance and stabilize your metabolism to maintain weight loss and enjoy lifelong health. This isn’t a fad diet. Dr. Hyman explains how to customize your personal health and weight-loss program with a streamlined eight-week plan designed to help you lose weight based on your own unique genetic needs. Menus, recipes, and shopping lists, as well as recommendations for vitamins, supplements, and exercise will help you change your lifestyle and be healthy for years to come.",
        "Category": " Health & Fitness , Diet & Nutrition , Weight Loss",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Faith Club: A Muslim, A Christian, A Jew-- Three Women Search for Understanding (English, Arabic and Hebrew Edition)",
        "Authors": "By Idliby, Ranya, Oliver, Suzanne, and Warner, Priscilla",
        "Description": "A groundbreaking book about Americans searching for faith and mutual respect, The Faith Club weaves the story of three women, their three religions, and their urgent quest to understand one another.When an American Muslim woman befriends two other mothers, one Jewish and one Christian, they decide to educate their children about their respective religions. None of them guessed their regular meetings would provide life-changing answers and form bonds that would forever alter their struggles with prejudice, fear, and anger. Personal, powerful, and compelling, The Faith Club forces readers to face the tough questions about their own religions.  Pioneering, timely, deeply thoughtful, and full of hope, The Faith Club’s caring message will resonate with people of all faiths.",
        "Category": " Religion , Comparative Religion",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "12.48",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Happy for No Reason: 7 Steps to Being Happy from the Inside Out",
        "Authors": "By Kline, Carol and Shimoff, Marci",
        "Description": "What would it take to make you happy? A fulfilling career, a big bank account, or the perfect mate? What if it didn't take anything to make you happy? What if you could experience happiness from the inside out -- no matter what's going on in your life?In Happy for No Reason: 7 Steps to Being Happy from the Inside Out, transformational expert Marci Shimoff offers a breakthrough approach to being happy, one that doesn't depend on achievements, goals, money, relationships, or anything else \"out there.\" Most books on happiness tell you to find the things that make you happy and do more of them. Although there's nothing wrong with that, it won't bring you the kind of deep and lasting happiness most people long for -- the kind you'll never lose, no matter what happens in your life. Based on cutting-edge research and knowledge from the world's leading experts in the fields of positive psychology and neurophysiology, plus interviews with 100 truly happy people, this life-changing book provides a powerful, proven 7-step program that will enable you to be happier right now -- no matter where you start.Studies show that each of us has a \"happiness setpoint\" -- a fixed range of happiness we tend to return to throughout our life -- that's approximately 50 percent genetic and 50 percent learned. In the same way you'd crank up the thermostat to get comfortable on a chilly day, you can actually raise your happiness set-point! The holistic 7-step program at the heart of Happy for No Reason encompasses Happiness Habits for all areas of life: personal power, mind, heart, body, soul, purpose, and relationships.In these pages you'll discover moving and remarkable first-person stories of people who have applied these steps to their own lives and have become Happy for No Reason. You'll read phenomenal tales from a former drug dealer turned minister, a hit filmmaker, and a famous actress who escaped a \"family curse,\" as well as stories from doctors, mothers, teachers, and business executives. You'll learn practical strategies that will help you experience happiness from the inside out.You don't have to have happy genes, win the lottery, or lose twenty pounds. By the time you finish this book, you will know how to experience sustained happiness for the rest of your life.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Eye of Jade: A Mei Wang Mystery (Mei Wang Mysteries)",
        "Authors": "By Liang, Diane Wei",
        "Description": "\"Having her own detective agency would give herthe independence she had always longed for. Itwould also give her the chance to show those peoplewho shunned her that she could be successful. Peoplewere getting rich. They owned property, money,business, and cars. With new freedom and opportunitiescame new crimes. There would be much thatshe could do.\"Present day, Beijing. Mei Wang is a modern, independent woman. She has her own apartment. She owns a car. She has her own business with that most modern of commodities -- a male secretary. Her short career with China's prestigious Ministry for Public Security has given her intimate insight into the complicated and arbitrary world of Beijing's law enforcement. But it is her intuition, curiosity, and her uncanny knack for listening to things said -- and unsaid -- that make Mei Beijing's first successful female private investigator.Mei is no stranger to the dark side of China. She was six years old when she last saw her father behind the wire fence of one of Mao's remote labor camps. Perhaps as a result, Mei eschews the power plays and cultural mores -- guanxi -- her sister and mother live by...for better and for worse.Mei's family friend \"Uncle\" Chen hires her to find a Han dynasty jade of great value: he believes the piece was looted from the Luoyang Museum during the Cultural Revolution -- when the Red Guards swarmed the streets, destroying so many traces of the past -- and that it's currently for sale on the black market. The hunt for the eye of jade leads Mei through banquet halls and back alleys, seedy gambling dens and cheap noodle bars near the Forbidden City. Given the jade's provenance and its journey, Mei knows to treat the investigation as a most delicate matter; she cannot know, however, that this case will force her to delve not only into China's brutal history, but also into her family's dark secrets and into her own tragic separation from the man she loved in equal parts.The first novel in an exhilarating new detective series, The Eye of Jade is both a thrilling mystery and a sensual and fascinating journey through modern China.",
        "Category": " Fiction , Political",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Dow Jones-Irwin Guide to Common Stocks",
        "Authors": "By Mader, Chris",
        "Description": "",
        "Category": "",
        "Publisher": "Dow Jones-Irwin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Alexander and the Wonderful, Marvelous, Excellent, Terrific Ninety Days: An Almost Completely Honest Account of What Happened to Our Family When Our ... Came to Live with Us for Three Months",
        "Authors": "By Viorst, Judith and Gibson, Laura (ILT)",
        "Description": "Whatever became of Alexander after that famously bad day? And did you know that Judith Viorst is his mother? And what happens to her passion for household neatness and orderliness, her deep devotion to schedules, her compulsive yearning to offer helpful advice when Alexander -- now grown up, married, and the father of three -- moves his family into his parents' house? What happens is controlled, and sometimes not so controlled, chaos, as lives and routines are turned upside down and the house is overrun with scattered toys, pacifiers, baby bottles, sippy cups, pink-sequined flip-flops, jigsaw puzzles, and fishy crackers.   With her characteristic sparkle and wit, Viorst relates her efforts to (graciously) share space, to become (if only a little bit) more flexible, to (sort of) keep her opinions to herself, and even to eventually figure out how to unlock the safety locks of the baby's (expletives deleted) bouncy seat. She describes how she and her husband, while sometimes longing for the former peace and tranquillity of unravished rooms and quiet dinners for two unaccompanied by cries of \"Oh, yuck!\" survived and relished the extended visit of the Alexander Five. She also opens our eyes to the joys of multigenerational family living and to the unexpected opportunities to grow that life presents -- even under the most unlikely circumstances.  Several generations of readers surely will relate to this funny and loving book, enhanced throughout by Laura Gibson's delightful two-color drawings.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Figs Table: Figs Table",
        "Authors": "By Sampson, Sally and English, Todd",
        "Description": "\"Never trust a round pizza\" -- Todd English  Todd English, the renowned chef who brought you The Olives Table, shares his savory, innovative, Mediterranean-inspired food in this collection of more than 100 home-tested recipes from his award-winning restaurant Figs. At Figs, which was voted Best Italian Restaurant by USA Today and cited by Boston magazine and Zagat's as having the best pizza in Boston, there's something for everyone in the family, from Macaroni Simoni for the kids, to Portobello Mushrooms, Mushroom Purée, and Fontina Cheese Pizza for more sophisticated palates. And no one will turn down a taste of the White-Chocolate Challah Pudding with Caramel Sauce.  Everyone loves pizza, and at Figs, pizza is the main attraction. But that's not all you'll find in these pages. The Figs Table showcases Todd English's trademark style: layering flavors to create bold and soulful food, now available to the home cook. Fennel Watermelon, and Black Olive Salad with Feta Cheese makes a refreshing starter on a hot summer day, while the flavors of Roasted, Fried Pear Quarters with Frisée, Prosciutto, and Balsamic Glaze warm a cool autumn evening. Mushroom Minestrone or Black Bean Chill is filling enough to make a meal. Couscous Carbonara with Country Ham is a new twist on an old favorite; Spaghetti with Hazelnuts and Green Beans makes a simple but elegant supper. And why not try Creamy Cheddar and Spinach Polenta or the Asparagus Butter Risotto with Shrimp as a change from pasta? And of course, there's the pizza: White Bean Hummus and Asiago; Fig and Prosciutto; Clam; Spicy Shrimp Pizza with Caramelized Leeks and Tomato Sauce; Classico; even Kielbasa, Sauerkraut, and Potato Pizza with Dijon Mustard Aloli. And for just a taste of something sweet, try a Cranberry Pecan Biscotti, a slice of Torta Caprese, or the Tiramisu that The Boston Phoenix called \"the best in town.\"  Simple or complex, sweet or savory, any dish from The Figs Table makes any meal special.",
        "Category": " Cooking , Courses & Dishes , Pizza",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Everyday Celebrations: Savoring Food, Family, and Life at Home",
        "Authors": "By Maggipinto, Donata and Ruffenach, France (PHT)",
        "Description": "The closeness of family, the beauty of the seasons, laughter among friends, the festivity of a shared mealwhy wait for the holidays to count our blessings and mark them by rejoicing? Donata Maggipinto, lifestyle contributor for NBC's Today show, reawakens our appreciation for all that has meaning in life in Everyday Celebrations and shares her sensational craft and food recipes to create heartwarming gatherings at home. Whether it's a spring garden celebration with asparagus and basil frittatas or creating bejeweled star ornaments in winter, each thoughtful/creative/clever touch and mmmm-inspiring recipe takes advantage of seasonal ingredients and materials to capture a distinct moment in time. Sparkling with style and great ideas, this entertaining book will make every day a special occasion, and every get-together a celebration.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Life History and the historical Moment",
        "Authors": "By Erikson, Erik H.",
        "Description": "",
        "Category": "",
        "Publisher": "WW Norton & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Spellman Files: Document #1",
        "Authors": "By Lutz, Lisa",
        "Description": "From the award-winning author of The Passenger comes the first novel in the hilarious Spellman Files mystery series featuring Isabel “Izzy” Spellman (part Nancy Drew, part Dirty Harry) and her highly functioning yet supremely dysfunctional family of private investigators.Meet Isabel “Izzy” Spellman, private investigator. This twenty-eight-year-old may have a checkered past littered with romantic mistakes, excessive drinking, and creative vandalism; she may be addicted to Get Smart reruns and prefer entering homes through windows rather than doors—but the upshot is she’s good at her job as a licensed private investigator with her family’s firm, Spellman Investigations. Invading people’s privacy comes naturally to Izzy. In fact, it comes naturally to all the Spellmans. If only they could leave their work at the office. To be a Spellman is to snoop on a Spellman; tail a Spellman; dig up dirt on, blackmail, and wiretap a Spellman. Izzy walks an indistinguishable line between Spellman family member and Spellman employee. Duties include: completing assignments from the bosses, aka Mom and Dad (preferably without scrutiny); appeasing her chronically perfect lawyer brother (often under duress); setting an example for her fourteen-year-old sister, Rae (who’s become addicted to “recreational surveillance”); and tracking down her uncle (who randomly disappears on benders dubbed “Lost Weekends”). But when Izzy’s parents hire Rae to follow her (for the purpose of ascertaining the identity of Izzy’s new boyfriend), Izzy snaps and decides that the only way she will ever be normal is if she gets out of the family business. But there’s a hitch: she must take one last job before they’ll let her go—a fifteen-year-old, ice-cold missing person case. She accepts, only to experience a disappearance far closer to home, which becomes the most important case of her life.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Does Anything Eat Wasps?: And 101 Other Unsettling, Witty Answers to Questions You Never Thought You Wanted to Ask",
        "Authors": "By New Scientist (COR)",
        "Description": "How fat do you have to be to become bulletproof? Why do people have eyebrows? Why do pineapples have spines? How much does a head weigh? What affects the color of earwax? How quickly could I turn into a fossil?     Have you ever thought up a question so completely off-the-wall, so seemingly ridiculous, that you couldn't even find the courage to ask it? Maybe at the sports bar you were transported by the beauty of your beer to wonder, \"How long could I live on beer alone?\" Or, cycling through the park, you mused, \"Did nature invent any wheels?\" Or looking up at the night sky, you had a moment of angst, \"What would happen if the moon suddenly disappeared -- if it were vaporized or stolen by aliens?\"   Full of fun factlets, Does Anything Eat Wasps? is a runaway bestseller around the world. It celebrates the weird and wacky questions -- some trivial, some baffling, all unique -- and their multiple answers culled from \"The Last Word,\" a long-running column in the internationally popular science magazine, New Scientist. Tackling the imponderables of everyday life, sparkling with humor, and bursting with delightful erudition, Does Anything Eat Wasps? is irresistibly entertaining and utterly engrossing.   So, go on. Put away your lab coat and your pencil -- science is fun again.",
        "Category": " Reference , Trivia",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Oscar Wilde and a Death of No Importance: A Mystery (Oscar Wilde Murder Mystery Series)",
        "Authors": "By Brandreth, Gyles",
        "Description": "Lovers of historical mysteries will relish this chilling Victorian tale based on real events and cloaked in authenticity. The first in a series of fiendishly clever historical murder mysteries, it casts British literature’s most fascinating and controversial figure as the lead sleuth.A young artist’s model has been murdered, and legendary wit Oscar Wilde enlists his friends Arthur Conan Doyle and Robert Sherard to help him investigate. But when they arrive at the scene of the crime they find no sign of the gruesome killing—save one small spatter of blood, high on the wall. Set in London, Paris, Oxford, and Edinburgh at the height of Queen Victoria’s reign, here is a gripping eyewitness account of Wilde’s secret involvement in the curious case of Billy Wood, a young man whose brutal murder served as the inspiration for The Picture of Dorian Gray. Told by Wilde’s contemporary—poet Robert Sherard—this novel provides a fascinating and evocative portrait of the great playwright and his own “consulting detective,” Sherlock Holmes creator, Arthur Conan Doyle.",
        "Category": " Fiction , Mystery & Detective , Historical",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Planet India: The Turbulent Rise of the Largest Democracy and the Future of Our World",
        "Authors": "By Kamdar, Mira",
        "Description": "India is everywhere: on magazine covers and cinema marquees, at the gym and in the kitchen, in corporate boardrooms and on Capitol Hill. Through incisive reportage and illuminating analysis, Mira Kamdar explores India's astonishing transformation from a developing country into a global powerhouse. She takes us inside India, reporting on the people, companies, and policies defining the new India and revealing how it will profoundly affect our future -- financially, culturally, politically.   The world's fastest-growing democracy, India has the youngest population on the planet, and a middle class as big as the population of the entire United States. Its market has the potential to become the world's largest. As one film producer told Kamdar when they met in New York, \"Who needs the American audience? There are only 300 million people here.\" Not only is India the ideal market for the next new thing, but with a highly skilled English-speaking workforce, elite educational institutions, and growing foreign investment, India is emerging as an innovator of the technology that is driving the next phase of the global economy.   While India is celebrating its meteoric rise, it is also racing against time to bring the benefits of the twenty-first century to the 800 million Indians who live on less than two dollars per day, to find the sustainable energy to fuel its explosive economic growth, and to navigate international and domestic politics to ensure India's security and its status as a global power. India is the world in microcosm: the challenges it faces are universal -- from combating terrorism, poverty, and disease to protecting the environment and creating jobs. The urgency of these challenges for India is spurring innovative solutions, which will catapult it to the top of the new world order. If India succeeds, it will not only save itself, it will save us all. If it fails, we will all suffer. As goes India, so goes the world.   Mira Kamdar tells the dramatic story of a nation in the midst of redefining itself and our world. Provocative, timely, and essential, Planet India is the groundbreaking book that will convince Americans just how high the stakes are -- what there is to lose, and what there is to gain from India's meteoric rise.    DID YOU KNOW? ? India is the world's fourth-largest economy. ? By 2034, India will be the most populous country on Earth, with 1.6 billion people. ? India's middle class is already larger than the entire population of the United States. ? One out of three of the world's malnourished children live in India. ? India is home to the biggest youth population on earth: 600 million people are under the age of 25. ? 72,000,000 cell phones will be sold in India in 2007. ? India just edged past the United States to become the second-most-preferred destination for foreign direct investment after China. ? In 1991, Indians purchased 150,000 automobiles; in 2007, they are expected to purchase 10 million. ? By 2008, India's total pool of qualified graduates will be more than twice as large as China's. ? By 2015, an estimated 3.5 million white-collar U.S. jobs will be offshored. ? India is the largest arms importer in the developing world. ? American corporations expect to earn $20 to $40 billion from the civilian nuclear agreement with India. ? In 2007, there are 2.2 million Indian Americans, a number expected to double every decade. ? Twenty-nine percent of India's population speaks English -- that's 350 million people.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Sex and the City: Kiss and Tell",
        "Authors": "By Sohn, Amy, Wildman, Sarah, and Parker, Sarah Jessica (INT)",
        "Description": "After six wildly successful and critically acclaimed season, HBO's Sex and the City lowered its curtain with an extraordinary finale befitting its remarkable run. Now Sex and the City, the first true comedy about sex and love from a female point of view (and the show that made cosmopolitans and designer shoes part of every single woman's night out), lives on in this luscious, uniquely entertaining, and one-of-a-kind book.  Sex and the City: Kiss and Tell, the official companion book, celebrates the show with behind-the-scenes stories on all six seasons and original interview with each of the primary actors. Ever wonder which designer made that outrageous outfit of Carrie's? What real-life stories inspired those shocking episodes? How many dates the fabulous foursome have really been on? Packed with over 750 full-color photographs, this stunning volume will answer all these questions and more with information not available anywhere eels. Topped off with a introduction by Sarah Jessica Parker, Sex and the City: Kiss and Tell will excite anyone who has experienced even the slightest flirtation with the sexiest, funniest show on television.",
        "Category": " Fiction , Media Tie-In",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The Miracle Worker: A Play",
        "Authors": "By Gibson, William",
        "Description": "Based on the remarkable true story of Helen Keller and her teacher Annie Sullivan, this inspiring and unforgettable play has moved countless readers and become an American classic.Young Helen Keller, blind, deaf, and mute since infancy, is in danger of being sent to an institution because her inability to communicate has left her frustrated and violent. In desperation, her parents seek help from the Perkins Institute, which sends them a \"half-blind Yankee schoolgirl\" named Annie Sullivan to tutor their daughter. Despite the Kellers' resistance and the belief that Helen \"is like a little safe, locked, that no one can open,\" Annie suspects that within Helen lies the potential for more, if only she can reach her. Through persistence, love, and sheer stubbornness, Annie breaks through Helen's walls of silence and darkness and teaches her to communicate, bringing her into the world at last.",
        "Category": " Drama , American , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Whiskey Road: A Love Story",
        "Authors": "By Siplin, Karen V.",
        "Description": "From Karen Siplin, the author of His Insignificant Other and Such a Girl, comes a passionate and edgy love story about a savvy female celebrity photographer and a small-town white contractor that asks, \"Where does a black woman born and raised in the big city go when she wants to escape, and what happens when she gets there?\"   After one too many run-ins with irate A-list celebrities and their bodyguards on the streets of Los Angeles, paparazza Jimi Anne Hamilton has decided to throw in the towel. But when she planned to ride her BMW K 1200 motorcycle from California to New York, she didn't count on having her cross-country adventure interrupted by a motorcycle thief. After the brutal attack, which sees both her motorcycle and camera equipment stolen, she finds herself left with only her helmet, a few clothes, and a bag of money she swiped from her attacker. Disillusioned and hurt, Jimi chooses to recuperate in a nearby town where she meets Caleb Atwood, a local contractor fighting his own demons.   Jimi and Caleb make a mismatched pair: black and white, highbrow and low. But in Caleb, Jimi believes she has found someone who feels as much of an outsider as she is. With Whiskey Road, Karen Siplin again succeeds in giving readers a story about opposites who manage to see what no one else can -- that they're right for each other.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Fountain: A Novel",
        "Authors": "By Grayson, Emily",
        "Description": "From the bestselling author of The Gazebo and The Observatory comes a romantic tale of the conflicting seductions of contentment and passion. What if you had a second chance at love that was denied long ago? This is exactly what happens to Casey Becket two days before she and her husband, Michael, are to celebrate their twentieth wedding anniversary. For there, suddenly, standing in her backyard by the fountain, is Will Combray, the man she once deeply loved and was engaged to marry, who jilted her on their wedding day. Older and wearier now, yet still handsome and unpredictable, Will tells Casey that he's come back in order to try to piece together his own life, which has been a series of emotional failures. He knows in his heart that everything went wrong for him the day he left her.Will's reappearance throws chaos into Casey's ordered life. Her marriage to the kind and faithful Michael Becket, who has been her best friend since childhood, has been a source of great comfort, if not passion. Long ago, after Will's cruel and inexplicable disappearing act, which was followed by a family tragedy, Michael promised to take care of Casey and give her a happy life, and he has kept his word. But now, with Will's sudden return after more than twenty years, Casey is forced to ask herself a difficult question. Which is the better life. one that is calm and contented or one unpredictable and deeply charged?Tugged in one direction by faithfulness and honor, and in another by pure desire, Casey Becket must relive her own troubled history to discover which choice will satisfy her heart.The Fountain is Emily Grayson at her shimmering, heartfelt, romantic best.",
        "Category": " Fiction , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "God Can Handle It: Encouragement for today's world",
        "Authors": "By Gallery, Jim",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Walnut Grove",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "1001 Smartest Things Ever Said",
        "Authors": "By Price, Steven D. (EDT)",
        "Description": "In this witty collection you will find quotations grouped in categories that reflect the range of human existence, hopes, and achievement:Life and Death (And Some of What Happens in Between)“Let us not look back in anger, nor forward in fear, but around in awareness.” —James Thurber Love and Friendship“The heart has its reasons of which reason knows nothing.”—Blaise PascalSuccess and Ways to Achieve It“Success is the ability to go from one failure to another with no loss of enthusiasm.”—Sir Winston ChurchillThe Life of the Mind“Don't talk unless you can improve the silence.”—Jorge Luis BorgesPolitics and Politicians, Government and Statesmen“Nothing in life is certain except death and taxes.”—Benjamin Franklin Proverbial Wisdom“Joy shared is twice the joy. Sorrow shared is half the sorrow.”—Swedish proverb",
        "Category": " Reference , Quotations",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Glamorous Disasters: A Novel",
        "Authors": "By Schrefer, Eliot",
        "Description": "Noah rose from humble beginnings and, through pure grit and resourcefulness, got himself through Princeton. Now staggering under the weight of massive student loans and dazzled by life in the big city, Noah enters the rarefied field of SAT tutoring in Manhattan, working one-on-one with the spoiled, gorgeous children of the American aristocracy.   He takes on the considerable academic challenges that are Dylan Thayer, a dissipated high school athlete-socialite, and his waifish sister, Tuscany. Dylan won't lift a finger to do anything but pick up a lacrosse stick, and Tuscany is avidly pursuing her own downfall via drugs and relationships with men more than twice her age. But their mother, a self-medicating pediatrician, has ambitious plans for them in spite of their shortcomings -- and she has plans for their SAT tutor as well.   With echoes of The Devil Wears Prada, The Nanny Diaries, and Bright Lights, Big City, Glamorous Disasters is an incisive portrayal of a small and privileged world, a cautionary tale written by a Harvard grad who was once an SAT tutor himself -- an outsider who became a magnificently observant insider.",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Behave Yourself!: The Essential Guide to International Etiquette",
        "Authors": "By Powell, Michael",
        "Description": "This book is for travelers heading away from home who are unsure whether to kiss the air, shake hands, or bow; what to wear; and how to eat, speak, or dress. Learn how to walk the walk and talk the talk in foreign climes with this stylish reference book, an essential guide for those traveling abroad. Very easy to use and organized by country, Behave Yourself! is a must for those traveling or doing business away from their natural habitat. Special icons identify helpful information on * Greeting* Eating & Drinking* Physicality * Dress * Gifts & TipsCountries discussed include:* Australia* Austria* Belgium* Brazil* Canada* Chile* China* Croatia* Czech Republic* Denmark* Egypt* Finland* France* Germany* Greece* Hong Kong* Hungary* Iceland* India* Ireland* Israel* Italy* Japan* Malaysia* Mexico* Morocco* Netherlands* New Zealand* Norway* Pakistan* Palestine* Poland* Portugal* Romania* Russia* Saudi Arabia* Singapore* South Africa* South Korea* Spain* Sri Lanka* Sweden* Switzerland* Taiwan* Turkey* United Arab Emirates* United Kingdom* United States of America* Venezuela* West Indies",
        "Category": " Travel , Reference",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "John McCain: An American Odyssey",
        "Authors": "By Timberg, Robert",
        "Description": "This reissue of the penetrating biography of Senator John McCain, the man who may be the next president of the United States, by celebrated author Robert Timberg now has a new foreword that updates readers on the politician's life since this book's original publication in 1999. In John McCain: An American Odyssey, Timberg provides a riveting account of McCain's remarkable life -- from his rambunctious childhood and his madcap escapades as a U.S. Naval Academy midshipman to his grim experiences as a combat pilot and POW in Vietnam, where the North Vietnamese held him prisoner for five and a half years. Most important, the author illuminates Senator McCain's postwar evolution into one of our country's most distinguished politicians and a formidable presidential candidate. This biography probes deeply into the life of this hugely colorful, straight-talking American original. It is a rich and captivating portrait of one of America's most fascinating and provocative public figures -- a man who has captured the imagination of millions of Americans and who will continue to be a most prominent figure in the American political landscape.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Sandpebbles",
        "Authors": "By Hickman, Patricia",
        "Description": "The tale of a broken heart's awakening to hope.A moving, richly told story set in a small fishing village in coastal North Carolina, Patricia Hickman's novel portrays a witty, recently widowed herione who must learn to let go of the past--and discover God's surprising, renewing provision for her future.",
        "Category": " Fiction , Religious",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "What She Wants at Midnight (Dream Wreakers)",
        "Authors": "By Dean, Kimberly",
        "Description": "The man of Devon Bradshaw's dreams is exactly that -- in her dreams.   For the past seven months, he has watched her with dark, haunting eyes while she sleeps. Though she yearns to caress those powerful muscles and feel the intense heat radiating from his body, she can't even see his face.   Cael Oneiros is a Dream Wreaker, descended from Greek gods, and ever since his first night at Devon's bedside, he's wanted to fill the luscious redhead's sweet dreams with steamy satisfaction. It tortures him not to touch her, not to stay by her side until dawn -- but without his help, none of his other mortal charges can sleep.   Desperate to touch her dream man, Devon casts a love spell...and is stunned when it works. With a little mandrake, some mugwort, and a few rose petals, she finally has her legs wrapped around Cael's muscular body -- and the sex is a mind-blowing pleasure ride she could never have dreamed up. But her magic didn't come with a warning label, and while she's burning up the sheets every night with her sexy sandman, her love spell has consequences she didn't expect....",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Nancy Clark's Sports Nutrition Guidebook, Third Edition",
        "Authors": "By Clark, Nancy",
        "Description": "The nation's leading sports nutritionist tells you how to get the maximum benefit from the foods you choose with customized eating plans. You'll learn how to eat before games or tournaments and how to eat afterward for optimal recovery. Clark covers current food, drink, and sport supplement options and explains which are best - and why - based on individual energy expenditure. She also gives advice on trendy diet alternatives like the Zone, Atkins, thermogenics, and Ultra Slim-Fast.",
        "Category": " Sports & Recreation , General",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Second Mrs. Darcy: A Novel",
        "Authors": "By Aston, Elizabeth",
        "Description": "The next adventure of the Darcy family from the author of Mr. Darcy's Daughters -- the story of a reluctant heiress who has been left a widow by Darcy's cousin Christopher.It is a truth universally acknowledged that a single woman in possession of a good fortune must be in want of a husband. So say the friends and family of impoverished widow Octavia Darcy when she unexpectedly inherits a fortune, but she has a different view and looks forward to a new life of independence. Escaping from the efforts of her half brothers and sisters to marry her off, Octavia goes to Yorkshire to find out more about the family she never knew, and while she is there she meets and crosses swords with landowner and politician Sholto Rutherford.When she returns to London to share a house with the dashing Lady Susan, Octavia, now secure in her new life, becomes caught up in the romantic problems of her niece. Then, the shadow of George Warren, the old nemesis of the Darcy family, falls over her, and she is threatened with the loss of both inheritance and reputation.",
        "Category": " Fiction , Literary",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Just Say No! : A Novel",
        "Authors": "By Tyree, Omar",
        "Description": "Sometimes Dreams Come True...  and Sometimes Ther're Too Hot to Handle  Best freinds since childhood, Darin Harmon and John Williams are young men on the brink of realizing their dreams. For John, it his music; for Darin, football. When Darin suffers an injury that closes the door on his sports aspirations, he reluctantly follows his friend into the music scene and quickly gets swept up in promoting John's new \"Loverboy\" identity to R&B superstardom. But the celebrity lifestyle of big-time money, fast women, and easy drugs quickly takes it toll, and the friends find themselves at a crossroads that will forever shape each of their futures.  As only he can, Omar Tyree delivers another urban classic filled with irresistible characters you won't forget.",
        "Category": " Fiction , Literary",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Skinny Women Are Evil: Notes of a Big Girl in a Small-Minded World",
        "Authors": "By Mo'Nique and McGee, Sherri A.",
        "Description": "Now in paperback, popular comedienne and television star Mo'Nique tells us how to be a big woman in a small woman's world.It is NO secret that I am a BIG girl. Always have been, always will be. The only way I'll ever wear a size 6, or even a 16, is if you add them together. That's right: I wear a size 22. And I'm proud, because I wear it well. Hell, even Ray Charles and Stevie Wonder can see that! Such is the life—and largesse—of Mo'Nique, one of America's best-loved plus-size personalities. “I really wish I didn't have to write this book,” writes Mo'Nique. “But it appears I have no choice. Especially when BIG girls are still subjected to ridicule simply because we've been blessed with a few extra pounds.” In Skinny Women Are Evil, Mo'Nique strips away the stigma of being weight-challenged and introduces a new vocabulary in which F.A.T. is FABULOUS AND THICK and a woman who is “skinny” is just plain evil. Why? Because America gives them the comfortable airline seats, the fashionable clothes, and the lead roles in the Hollywood blockbusters. So how can a F.A.T. girl learn to operate in the it's-a-small-world after all? In this hilarious, heartwarming book, women of all sizes, shapes, and colors can benefit from Mo'Nique's Fat Girls' Survival Tips, a handy Thin-O-Meter, and a generous portion of advice about dating, eating, dressing, undressing, and much more. Skinny Women Are Evil is Mo'Nique's testament to living large and loving it. So go on, dig in!",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Hope Within, Heirs of Montana 4",
        "Authors": "By Peterson, Tracie",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Ethiopia, 4th: The Bradt Travel Guide",
        "Authors": "By Briggs, Philip",
        "Description": "This Bradt guide has become the definitive source of information on this country rich in culture, history, and dramatic scenery. For first-time visitors, Philip Briggs supplies plenty of practical advice on how to bridge the cultural gap and plan a trouble-free trip. Heritage hotspots in a land thought to be the cradle of civilization and resting place of the Ark of the Covenant include the architecturally fascinating rock-hewn church of Lalibela, the unofficial eighth wonder of the world, and ancient palaces and staelae at Axum. Ethiopia boasts nine national parks and several wildlife sanctuaries, all of which are detailed in Philip Briggs's comprehensive text.This guide features:>Where to find some of East Africa's rarest wildlife, including the Simien wolf, walia ibex, and gelada baboon>Ethiopia's national parks and wildlife sanctuaries>Traveling the Northern Historic Circuit>Addis Ababa in detail: where to stay, eat, and drink, plus nearby sightseeing",
        "Category": " Travel , Africa , General",
        "Publisher": "Bradt Travel Guides",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Smotherhood: Wickedly Funny Confessions from the Early Years",
        "Authors": "By Lamb, Amanda",
        "Description": "Television crime reporter and full-time mother tells it like it is in this raw, irreverent collection of essays—just what mothers are asking for when they curl up with a book at night after a seventeen-hour day. Amanda Lamb, a regular contributor to Dot-moms.com, lauded by the New York Times and Time magazine, writes about the reality of raising children, working, and keeping a family together, sharing some wickedly funny moments along the way. “Parents will never get enough sleep until they're dead. Osama Bin Laden would come out of hiding if he could listen to your baby wail all night.”",
        "Category": " Humor , Topic , Marriage & Family",
        "Publisher": "Skirt!",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "skirt! Rules for the Workplace: An Irreverent Guide to Advancing Your Career",
        "Authors": "By Johnson, Kelly Love",
        "Description": "Humorous, practical, tell-it-like-it-is advice for women in the workplace.Only seven of the Fortune 500 companies have a woman as CEO or President, and nearly 20 percent of them don’t have any women at all in upper management. In the bestselling tradition of Nice Girls Don’t Get the Corner Office and Who Moved My Cheese, Kelly Love Johnson lays out practical advice for career women who are starting out or who wonder why they’re not moving ahead. This is the book every graduating senior, receptionist, and entry-level assistant will steal from her best friend. Johnson shows how speaking out, embracing change, and changing others’ perceptions of working women can bring both personal and professional success. Chapters include: \"The Alphas and the Betas: Personality Types,\" \"A Feminist Says What?\" and \"Work Like a Girl.\" Using personal anecdotes, tried and true tactics, and a directory of resources and Web sites, Johnson shows readers how women can move ahead in the workplace just as well as men, as Ginger Rogers once said, \"but backwards and in high heels.\"",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Facing Clemens: Hitters on Confronting Baseball's Most Intimidating Pitcher",
        "Authors": "By Mayo, Jonathan and Clemens, Roger (FRW)",
        "Description": "Roger Clemens has won more than 350 games in his 20-year baseball career, pitching more than 4,500 strikeouts, earning a record seven Cy Young awards. Along the way, he’s hit 150 batters, knocked down hundreds more, and stared down every batter who tried to dig in against him. This book puts you right in the batter’s box agains the “Rocket Man.” The best hitters in baseball have failed to figure out this fearsome pitching prodigy. Mayo interviews scores of players, including Cal Ripken, Jr., Ken Griffey, Jr., Julio Franco, Chipper Jones, Luis Gonzalez, and Juan Pierre, who assess the intimidating Clemens and his effect on the great game..",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Itsy Bitsy Yoga: Poses to Help Your Baby Sleep Longer, Digest Better, and Grow Stronger",
        "Authors": "By Garabedian, Helen",
        "Description": "The ancient practice of yoga will help your baby sleep better, digest easier, be happier, and stay healthier. Start today.If you've been searching for an excellent way to bond with your baby and improve his or her health, Itsy Bitsy Yoga is the solution you've been looking for. Helen Garabedian, a certified instructor in yoga and infant massage, has developed over seventy yoga postures and thirty-five series for moms and dads to enjoy with their growing babies. You don't need any previous yoga experience. Learn the many benefits of yoga, posture by posture, in this accessible guide, with seventy beautiful black-and-white photos, at-a-glance reference charts, and memorable Itsy Bitsy Yoga rhymes. Yoga can help babies up to two years of age: -sleep better -get relief from gas pains and colic -digest food easier -stay healthier with a strong immune system -receive neuromuscularm stimulation -learn to relax The book also features seven Magic Poses that can soothe fussy, upset babies within minutes! So start enjoying more time with your happy yoga baby right now.",
        "Category": " Family & Relationships , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Fun with the Family Virginia, 6th (Fun with the Family Series)",
        "Authors": "By Stapen, Candyce H.",
        "Description": "From well-known sites to little-known places, families will find plenty to do in Virginia. Discover hiking, swimming, biking, and more in Chincoteague National Wildlife Refuge; get wet at a forty-acre water park in Williamsburg; or visit the Virginia State Capitol building--designed by Thomas Jefferson--in Richmond..",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Where",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Self-employed Tax Solutions: Quick, Simple, Money-Saving, Audit-Proof Tax and Recordkeeping Basics for the Independent Professional",
        "Authors": "By Walker, June",
        "Description": "June Walker tackles the most vexing problems facing the self-employed: bad recordkeeping and tax ignorance. Her solutions are simple, quick and audit proof: a recordkeeping method that works and a guide through the tax maze that ends with more money in the indie's pocket and less money going to Uncle Sam. The self-employed operate under various names -- sole proprietors, freelancers, subcontractors, free agents, independent professionals - but the IRS and other taxing authorities require all of them to follow the same rules. If self-employed people don't understand tax and recordkeeping fundamentals, they will eventually gum up the works, and the remedy will be expensive, time-consuming, worrisome, and possibly fatal to their businesses - no matter how talented, motivated and entrepreneurial they are. The author creates characters such as wedding photographer Billy Bridesnapper and the clueless CPA Sammy Segar to illustrate situations based on the real experiences of her clients. Through these examples told in clear, crisp and simple prose she explains the complete range of tax and recordkeeping basics - like how to prove to the IRS that the endeavor is a business not a hobby, how start-up costs differ from other deductions, how to go snorkeling and still deduct travel expenses, why a gift to mom can be a legitimate business deduction,  why solos needn't worry about the difference between income and a reimbursement, how to make estimated tax payments,  the structure and advantages of sole proprietorship, and hundreds of vital details about taxes, finances, and recordkeeping.  Armed with June's unique copyrighted worksheets designed just for the indie, her system takes only a few hours a year to implement, and saves time, anxiety and stress. Even the beginner who has never kept business records can easily learn it. Self Employed Tax Solutions explains how not to miss one single business deduction, how to pay the least tax legitimately possible and how to keep records so that accounting and tax preparer fees are reduced. Self-Employed Tax Solutions is not written for dummies but for bright, intelligent people who don't understand the business side of their solo ventures. It's the one indispensable book that self-employed people need to survive and to succeed in a business environment where the tax laws and regulations are structured not for them but for corporations and employees.",
        "Category": " Business & Economics , Accounting , Financial",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "How to Rock Climb!, 4th (How To Climb Series)",
        "Authors": "By Long, John",
        "Description": "How to Rock Climb!, now in its fourth edition, is the world's top instructional book on climbing. All the fundamentals--from ethics to getting up the rock--are presented in John Long's classic style. Revised and updated to reflect the modern standards of equipment, technique, and training methods, this guide includes sections on face climbing; crack climbing; ropes, anchors, and belays; getting off the rock; sport climbing; and much more. It is the essential how-to book for rock climbers everywhere.",
        "Category": " Sports & Recreation , Outdoor Skills",
        "Publisher": "FalconGuides",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Improbable Machine: What the New Upheaval in Artificial Intelligence Research Reveals About How the Mind Really Works",
        "Authors": "By Campbell, Jeremy",
        "Description": "Argues that the key to the development of the human mind has been experience and not logic and discusses the mind's structure",
        "Category": "",
        "Publisher": "Touchstone Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Federal Budget Deficits: America's Great Consumption Binge (Prentice-Hall International Series in Systems and Control Engineering)",
        "Authors": "By Courant, Paul N. and Gramlich, Edward M.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "The Sporting Clays Handbook",
        "Authors": "By Meyer, Jerry",
        "Description": "",
        "Category": " Sports & Recreation , Shooting",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Party Favors",
        "Authors": "By Johnston, Susan and Sexton, Nicole",
        "Description": "Party Favors gives a deliciously witty peek into the secretive world of political fundraising in D.C. Co-written by a former Director of Finance for the National Republican Senatorial Committee and a published playwright, the novel tracks the meteoric rise and fall of the young Temple Sachet, the Big Money Babe of the Republican Senate. As a ?Ray of Hope” intern at the White House, Temple caught Potomac Fever?a hopeless, incurable addiction to D.C. Hooked, smart, and desperate for more, Temple navigates her way through the treacherous community of lobbyists making deals for dollars, gossiping staffers, and child-like senators to become the second most powerful fundraiser in America. Now she’s expected to raise $95 million and must find creative ways to get the uber-rich and ultra-eccentric to hand over the cash money green. From the outside her life looks like one fantastic party, but on the inside she’s tired of dating the wrong men and sleeping on the office floor. Luckily, she has an elite cadre of political friends to help keep her sane . . . or does she? When Temple’s own career begins to surpass that of her mentor, Prudence, a rude awakening awaits. But an unexpected betrayal and a major hurricane force Temple to reexamine everything she believes in?.",
        "Category": " Fiction , Political",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "The Lees of Virginia: Seven Generations of an American Family",
        "Authors": "By Nagel, Paul C.",
        "Description": "In The Lees of Virginia, Paul Nagel chronicles seven generations of Lees, from the family founder Richard to General Robert E. Lee, covering over two hundred years of American history. We meet Thomas Lee, who dreamed of America as a continental empire. His daughter was Hannah Lee Corbin, a non-conformist in lifestyle and religion, while his son, Richard Henry Lee, was a tempestuous figure who wore black silk over a disfigured hand when he made the motion in Congress for Independence.  Another of Thomas' sons, Arthur Lee, created a political storm by his accusations against Benjamin Franklin. Arthur's cousin was Light-Horse Harry Lee, a controversial cavalry officer in the Revolutionary War, whose wild real estate speculation led to imprisonment for debt and finally self-exile in the Caribbean. One of Harry's sons, Henry Lee, further disgraced the family by seducing his sister-in-law and frittering away Stratford, the Lees' ancestral home. Another son, however, became the family's redeeming figure--Robert E. Lee, a brilliant tactician who is still revered for his lofty character and military success.  In these and numerous other portraits, Nagel discloses how, from 1640 to 1870, a family spirit united the Lees, making them a force in Virginian and American affairs.        Paul Nagel is a leading chronicler of families prominent in our history. His Descent from Glory, a masterful narrative account of four generations of Adamses, was hailed by The New Yorker as \"intelligent, tactful, and spiritually generous,\" and Pulitzer Prize-winning historian W.A. Swanberg, in the Chicago Sun-Times, called it \"a magnificent embarrassment of biographical riches.\"  Now, in The Lees of Virginia, Nagel brings his skills to bear on another major American family, taking readers inside the great estates of the Old Dominion and the turbulent lives of the Lee men and women.",
        "Category": " Reference , Genealogy & Heraldry",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "A Little Book Of Cheer",
        "Authors": "By Loberg, Mary",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The End of Iraq: How American Incompetence Created a War Without End",
        "Authors": "By Galbraith, Peter W.",
        "Description": "A key former member of the Senate Foreign Relations Committee who led the U.S. Senate to pass sanctions against Saddam Hussein's regime documents what he believes to be the failed American war in Iraq, profiling the country as a broken nation comprised of a Kurdistan independent state, strict Islamic regions, and troubled Sunni politics. Reprint. 50,000 first printing.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "He Said She Said: Men And Women Square Off On Sex, Money, And Who Rules The World",
        "Authors": "By Skirt! Magazine (EDT)",
        "Description": "He Said/She Said offers a quirky collection of sayings by famous (and infamous) men and women on the burning issues of any and every day. Hear both sides of the story in this witty compilation of the best lines from both sexes. Full-color illustrations further add to the bright ideas and bon mots expressed herein. From feminism to sports, gossip to power, you'll never lack for a comeback again.",
        "Category": " Humor , Topic , Relationships",
        "Publisher": "Skirt!",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Cold Pursuit: A Thrilling Romantic Suspense (A Black Falls Novel, 1)",
        "Authors": "By Neggers, Carla",
        "Description": "A prominent ambassador is killed in a suspicious hit-and-run in Washington, D.C. Hours later, his stepdaughter vanishes in the mountains of northern New England.Back in her hometown of Black Falls, Vermont, to do damage control on her career, Secret Service agent Jo Harper is drawn into the search. But her efforts face an unexpected challenge: Elijah Cameron. With his military training and mountain rescue experience, Elijah knows the unforgiving terrain better than anyone. But he and Jo have been at odds forever?and Elijah believes the missing teenager isn't just lost?she's on the run.Forced to work together, Jo and Elijah battle time and the elements in a race into the unforgiving mountains. The twists and turns awaiting them will take them closer to the explosive truth?and into the sights of a killer.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Dead Certain: The Presidency of George W. Bush",
        "Authors": "By Draper, Robert",
        "Description": "In this ambitious work of political narrative, Robert Draper takes us inside the Bush White House and delivers an intimate portrait of a tumultuous decade and an embattled administration.Virtually every page of this book crackles with scenes, anecdotes, and dialogue based on access to every principal actor in the Bush administration, including six newsmaking interviews with the president himself.",
        "Category": " Political Science , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Getting Yours: The Complete Guide to Government Money",
        "Authors": "By Lesko, Matthew",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "The Complete Book of Sea Kayaking, 5th (How to Paddle Series)",
        "Authors": "By Hutchinson, Derek C.",
        "Description": "Discover the excitement and adventure of paddling on the open sea. This thoroughly revised fifth edition of the bestselling Complete Book of Sea Kayaking is a comprehensive guide for the beginner and an invaluable reference source for the seasoned veteran. From basic strokes and techniques to advanced rescue maneuvers, kayak history to boat design, this is the fundamental book for all sea kayakers.With this book in hand readers will learn about choosing a kayak and paddle, launching, how to outfit themselves, advice on kayak strokes, maneuvers, navigation, equipment, and the newest technology. This new edition contains additional material on the history and origins of the kayak as well as new information on navigation. The chapters on strokes and techniques have been expanded considerably and now present information in a master-class format that caters to novice paddlers.",
        "Category": " Sports & Recreation , Kayaking",
        "Publisher": "FalconGuides",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "More Sex Is Safer Sex: The Unconventional Wisdom of Economics",
        "Authors": "By Landsburg, Steven E.",
        "Description": "A witty and razor-sharp look at the many ways our individually rational decisions can combine into some truly weird collective results—and some hilarious and serious ways to fix just about everything.Economics is no longer the “dismal science” dreaded by college freshmen. In recent years, a band of economists has broken away from the charts and graphs of college textbooks, and begun to explain ordinary behavior in plain and often entertaining English. Steve Landsburg was one of the first of the new breed, in his book The Armchair Economist and long-running “Everyday Economics” column in Slate magazine. Now he is back, and more provocative than ever. In More Sex Is Safer Sex, Landsburg shows how the rational behavior of each one of us—when combined together—produces the often bizarre, seemingly irrational behavior of crowds. We all stand up at the ballpark, so none of us can see. We avoid casual sex, from fear of disease, and we thereby make sex more dangerous. Things really get interesting when Landsburg suggests ways to change the rules, and game the system. Why not charge juries if a convicted felon is exonerated? Why not have each member of Congress represent a national subset of voters, chosen alphabetically? Why not solve the “overpopulation” problem by having more children, who will help think of ways to improve our use of resources? More Sex Is Safer Sex will make you laugh and argue—and it will make you think about the world around you in new and unforgettable ways.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Secrets: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "Danielle Steel, America’s number-one best-selling novelist, has held millions spell-bound  with such novels as Family Album, Full Circle, and Changes. But with Secrets she  takes her readers beyond the tightly knit world of the family, into the heart of  the nation’s most glamorous industry: television.  Here is the drama behind the creation  of Manhattan, a first-of-its-kind prime-time television series produced by Melvin  Wechsler. Tempered by tragedy, seasoned by success, a man with a Midas touch, Mel  Wechsler will assemble a dazzling cast:  Sabina Quarles at forty-five has managed  to maintain–by dint of spunk and surgery–the body of an eighteen-year-old. Tough,  spirited, and self-sufficient, she has survived twenty years in Hollywood, never  marrying, never quite succeeding, never deigning to work in television.  Yet Manhattan may bring her both the stardom she craves–and the security her very special needs  require.  Jane Adams is an earthy thirty-nine-year-old beauty.  Devoted to her children,  dominated by her abusive and violent husband, forced to choose between her husband  and her acting career, Jane may find that her role in Manhattan has cost her everything  that matters most.   Zack Taylor, the leading man, is a paragon of professionalism.   Yet beyond the smooth good looks, the easy warmth, and the slick charm of the eligible  bachelor, he remains an enigma.  The charming ingenue, Gabrielle Thornton-Smith,  seems to have appeared out of the blue. Beautiful, talented and on the brink of success  at twenty-five, what can she have to hide?  And Bill Warwick, plucked from the ranks  of struggling young actors, is now slated to be the nation’s new heartthrob.  But  he has lied about one issue in his background. Not only will Bill’s future hang in  the balance, but the success of the whole series may be jeopardized when he is forced  publicly to confront the consequences of his little white lie.  Set in Los Angeles  and New York, Secrets carries the reader behind the scenes into the making of a major  television series. Probing even deeper beneath the polished surfaces, Danielle Steel  explores the dilemmas both men and women, in and out of the searchlight of the media,  confront today. She paints a vivid, compelling picture of a sophisticated world and  the surprisingly real problems of the people who inhabit it.  Here Danielle Steel  delineates her richest and most complex cast of characters, people forced together  by extraordinary circumstances who must perform even when they're torn apart by their  deepest secrets.",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Insiders' Guide to Williamsburg and Virginia's Historic Triangle, 14th (Insiders' Guide Series)",
        "Authors": "By Blackwell, Mary Alice, Causey, Anne Patterson, and Sack, Joetta",
        "Description": "For more than twenty years, the Insiders' Guide® series has remained the essential source for in-depth travel and relocation information. Each guide is written by locals and true insiders and offers a personal, practical perspective that readers everywhere have come to know and love.From candlelight ghost tours and colonial reenactments to state-of-the-art thrill rides and waterslide adventures, the towns of Williamsburg, Jamestown, and Yorktown provide numerous opportunities to celebrate the past and the present. This authoritative guide will lead you through the Historic Triangle's diverse offerings, as well as show you where to enjoy the region's best cuisine and wines.Inside you'll find:countless details on how to live and thrive in the area, from the best shopping to the lowdown on real estate the inside scoop on popular attractions such as Colonial Williamsburg, the James River plantations, and Busch Gardenscomprehensive listings of restaurants, lodging, entertainment, and recreational activities sections dedicated to children, retirement, Newport News and Hampton, and much moreWhether you're planning a vacation, already living in the area, or looking to relocate, Insiders' Guide to Williamsburg will show you everything you need to know.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Insiders Guides",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "London Walks (On Foot Guides)",
        "Authors": "By Woolfrey, Celia",
        "Description": "Revised and updated, the popular On Foot Guides offer city tours in a totally new way—illustrating a variety of walks with full-color, aerial-view, three-dimensional maps to give users an immediate sense of each route and what can be seen along the way. The informative text offers accurate, discriminating descriptions of places to stop and shop, eat, drink, or sightsee. Most walks are one to three hours in length, making them ideal for busy tourists or inquisitive locals looking to explore the more interesting neighborhoods and sites of each city. Color photos of top attractions round out the contents of these clear, easy-to-use guides.",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "We Die Alone: A WWII Epic of Escape and Endurance",
        "Authors": "By Howarth, David Armine and Ambrose, Stephen E. (INT)",
        "Description": "We Die Alone recounts one of the most exciting escape stories to emerge from the challenges and miseries of World War II. In March 1943, a team of expatriate Norwegian commandos sailed from northern England for Nazi-occupied arctic Norway to organize and supply the Norwegian resistance. But they were betrayed and the Nazis ambushed them. Only one man survived--Jan Baalsrud. This is the incredible and gripping story of his escape.Frostbitten and snowblind, pursued by the Nazis, he dragged himself on until he reached a small arctic village. He was near death, delirious, and a virtual cripple. But the villagers, at mortal risk to themselves, were determined to save him, and--through impossible feats--they did.We Die Alone is an astonishing true story of heroism and endurance. Like Slavomir Rawicz's The Long Walk, it is also an unforgettable portrait of the determination of the human spirit.",
        "Category": " History , Military , World War II",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "KNOW YOU HEIRLOOMS: An indespensable guide to identifying and evaluating your inherited treasures or new discoveries..",
        "Authors": "By Ormsbee, Thomas H",
        "Description": "",
        "Category": "",
        "Publisher": "McBride Co",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "A Gladiator Dies Only Once: The Further Investigations of Gordianus the Finder (Novels of Ancient Rome, 11)",
        "Authors": "By Saylor, Steven",
        "Description": "Steven Saylor's Roma Sub Rosa series of novels, set in the later Roman Republic and featuring Gordianus the Finder, has garnered unusual acclaim from readers and reviewers alike, establishing him as one of the pre-eminent historical mystery writers. In A Gladiator Dies Only Once, the second collection of his award-winning stories featuring Gordianus, Saylor more than meets his own high standards. Set between the events of his novels Roman Blood and Catilina's Riddle, these previously untold adventures from the early career of Gordianus - when his adopted son, Eco, was still a mute boy and his wife, Bethesda, was but his slave - will delight Saylor's many fans while illuminating details of the ancient world like no other writer can.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The 9/11 Report: The National Commission on Terrorist Attacks Upon the United States",
        "Authors": "By National Commission on Terrorist Attacks Upon the United States, Hamilton, Lee, and Kean, Thomas H.",
        "Description": "With Reporting and Analysis by the New York TimesWhat happened on 9/11 and how? Are we safer now? Have we learned any lessons? These are the questions on the mind of every American since that terrible day.And on July 26th we may have some answers. On that day, The National Commission on Terrorist Attacks Upon the United States (also known as the 9/11 Commission) will issue their complete report of the circumstances surrounding 9/11. THE 9/11 REPORT will cover many topics including:*Al Qaeda and the organization of the 9/11 attack *Intelligence collection, analysis, and management (including oversight and resource allocation) *International counterterrorism policy, including states that harbor or harbored terrorists, or offer or offered terrorists safe havens *Terrorist financing *Border security and foreign visitors *Law enforcement and intelligence collection inside the United States *Commercial aviation and transportation security, including an investigation into the four hijackings *The immediate response to the attacks at the national, state, and local levels, with personal interviews of Presidents Clinton and Bush on their rolesIn addition, THE 9/11 REPORT will make recommendations as to how to prevent such attacks in the future. Certain to create controversy, this report will be much discussed, politicized, debated and possibly denied. But no matter what it says, THE 9/11 REPORT will be a book that goes down in history.",
        "Category": " Political Science , Terrorism",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Working Class Majority: America's Best Kept Secret",
        "Authors": "By Zweig, Michael",
        "Description": "The United States is not a middle class society. Michael Zweig shows that the majority of Americans are actually working class and argues that recognizing this fact is essential if that majority is to achieve political influence and social strength. \"Class,\" Zweig writes, \"is primarily a matter of power, not income.\" He goes beyond old formulations of class to explore ways in which class interacts with race and gender.Defining \"working class\" as those who have little control over the pace and content of their work and who do not supervise others, Zweig warns that by allowing this class to disappear into categories of middle class or consumers, we also allow those with the dominant power, capitalists, to vanish among the rich. Economic relations then appear as comparisons of income or lifestyle rather than as what they truly are—contests of power, at work and in the larger society.Using personal interviews, solid research, and down-to-earth examples, Zweig looks at a number of important contemporary social problems: the growing inequality of income and wealth, welfare reform, globalization, the role of government, and the family values debate. He shows how, with class in mind, our understanding of these issues undergoes a radical shift.Believing that we must limit the power of capitalists to abuse workers, communities, and the environment, Zweig offers concrete ideas for the creation of a new working class politics in the United States.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "ILR Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Empires Beyond the Great Wall",
        "Authors": "By Kessler, Adam T. and Kellser, Adam T.",
        "Description": "This attractive volume, which celebrates the heritage of Genghis  Khan, accompanied a tour of archaeological treasures from  Inner Mongolia across North America between 1994 and 1995 which  was organised by the Natural History Museum of Los Angeles  County. The volume publishes photographs of artefacts and works  of art which date from the Palaolithic and the first dynasties of  the 3rd and 2nd millenna BC to the Qing Dynasty of the  post-medieval era and includes objects representative of the 20th  century. The photographs are accompanied by a useful discussion  which places the objects within their cultural and historic  contexts.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "University of Washington Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Sea of Lost Love: A Novel",
        "Authors": "By Montefiore, Santa",
        "Description": "From the author of The Gypsy Madonna and The Last Voyage of the Valentina, a breathless novel that sweeps its heroine from the Cornish coast to the rugged beauty of Puglia Italy, where she discovers a shocking truth about her family and the way to save her ancestral home.Celestria Montague always spends her summers at Pendrift Hall, the rambling, shabby mansion adorned with wisteria and clematis that has been home to the Montague family for generations. It is 1958, and the family is celebrating her father's fiftieth birthday at a lavish ball. The celebratory night ends in death and tragedy, however, and young Celestria learns that the family may lose Pendrift Hall. Her grandfather urges Celestria to play detective, to solve the mysteries surrounding the night's events, and to save the ancient mansion if at all possible. Her quest takes her to Italy's rugged and beautiful Puglia, and into the dark, cool cloisters of the Convento di Santa Maria del Mare. Here Celestria meets an enigmatic stranger and confronts unwelcome truths about her family—and herself. Sea of Lost Love is Santa Montefiore at her very best—sensitive, sensual, and complex.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Deep Economy: The Wealth of Communities and the Durable Future",
        "Authors": "By McKibben, Bill",
        "Description": "The bestselling author of The End of Nature issues an impassioned call to arms for an economy that creates community and ennobles our livesIn this powerful and provocative manifesto, Bill McKibben offers the biggest challenge in a generation to the prevailing view of our economy. For the first time in human history, he observes, \"more\" is no longer synonymous with \"better\"—indeed, for many of us, they have become almost opposites. McKibben puts forward a new way to think about the things we buy, the food we eat, the energy we use, and the money that pays for it all. Our purchases, he says, need not be at odds with the things we truly value.McKibben's animating idea is that we need to move beyond \"growth\" as the paramount economic ideal and pursue prosperity in a more local direction, with cities, suburbs, and regions producing more of their own food, generating more of their own energy, and even creating more of their own culture and entertainment. He shows this concept blossoming around the world with striking results, from the burgeoning economies of India and China to the more mature societies of Europe and New England. For those who worry about environmental threats, he offers a route out of the worst of those problems; for those who wonder if there isn't something more to life than buying, he provides the insight to think about one's life as an individual and as a member of a larger community.McKibben offers a realistic, if challenging, scenario for a hopeful future. Deep Economy makes the compelling case that the more we nurture the essential humanity of our economy, the more we will recapture our own.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Little Things: A Memoir in Slices",
        "Authors": "By Brown, Jeffrey",
        "Description": "A collection of funny, poignant, and autobiographical short stories, Little Things looks at the aspects of daily life -- friendship, illness, death, work, crushes, love, jealousy, and fatherhood -- we take for granted. As each story loops into others, Jeffrey Brown shows how the smallest andseemingly most insignificant parts of everyday life can end up becoming the most meaningful. Brown's first full-length autobiographical book in several years, Little Things is also his most impressive, touching, and true.",
        "Category": " Comics & Graphic Novels , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "If I Am Missing or Dead: A Sister's Story of Love, Murder, and Liberation",
        "Authors": "By Latus, Janine",
        "Description": "In April 2002, Janine Latus's youngest sister, Amy, wrote a note and taped it to the inside of her desk drawer. Today Ron Ball and I are romantically involved, it read, but I fear I have placed myself at risk in a variety of ways. Based on his criminal past, writing this out just seems like the smart thing to do. If I am missing or dead this obviously has not protected me...   That same spring Janine Latus was struggling to leave her marriage -- a marriage to a handsome and successful man. A marriage others emulated. A marriage in which she felt she could do nothing right and everything wrong. A marriage in which she felt afraid, controlled, inadequate, and trapped.   Ten weeks later, Janine Latus had left her marriage. She was on a business trip to the East Coast, savoring her freedom, attending a work conference, when she received a call from her sister Jane asking if she'd heard from Amy. Immediately, Janine's blood ran cold. Amy was missing.   Helicopters went up and search dogs went out. Coworkers and neighbors and family members plastered missing posters with Amy's picture across the county. It took more than two weeks to find Amy's body, wrapped in a tarpaulin and buried at a building site. It took nearly two years before her killer, her former boyfriend Ron Ball, was sentenced for her murder.   Amy died in silent fear and pain. Haunted by this, Janine Latus turned her journalistic eye inward. How, she wondered, did two seemingly well-adjusted, successful women end up in strings of physically or emotionally abusive relationships with men? If I Am Missing or Dead is a heart-wrenching journey of discovery as Janine Latus traces the roots of her own -- and her sister's -- victimization with unflinching candor. This beautifully written memoir will move readers from the first to the last page. At once a confession, a call to break the cycle of abuse, and a deeply felt love letter to her baby sister, Amy Lynne Latus, If I Am Missing or Dead is an unforgettable read.",
        "Category": " Family & Relationships , Abuse , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Edinburgh Castle",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "The Stationery Office Books (Agencies)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Life in a Medieval Village (Cambridge Introduction to World History)",
        "Authors": "By Morgan, Gwyneth",
        "Description": "A portrayal of the everyday life of a peasant family, the parish church, and the manor within a typical village in 13th century England.",
        "Category": " Young Adult Nonfiction , History , Europe",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Stalin's Ghost: An Arkady Renko Novel (The Arkady Renko Novels)",
        "Authors": "By Smith, Martin Cruz",
        "Description": "Detective Arkady Renko returns to Moscow in the internationally bestselling series about Russian crimes, broken hearts, and the mysteries of the soul.Investigator Arkady Renko, the pariah of the Moscow prosecutor's office, has been assigned the thankless job of investigating a new phenomenon: late-night subway riders report seeing the ghost of Joseph Stalin on the platform of the Chistye Prudy Metro station. The illusion seems part political hocus-pocus and also part wishful thinking, for among many Russians Stalin is again popular; the bloody dictator can boast a two-to-one approval rating. Decidedly better than that of Renko, whose lover, Eva, has left him for Detective Nikolai Isakov, a charismatic veteran of the civil war in Chechnya, a hero of the far right and, Renko suspects, a killer for hire. The cases entwine, and Renko's quests become a personal inquiry fueled by jealousy. The investigation leads to the fields of Tver outside of Moscow, where once a million soldiers fought. There, amidst the detritus, Renko must confront the ghost of his own father, a favorite general of Stalin's. In these barren fields, patriots and shady entrepreneurs -- the Red Diggers and Black Diggers -- collect the bones, weapons and personal effects of slain World War II soldiers, and find that even among the dead there are surprises.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "No: Why Kids--of All Ages--Need to Hear It and Ways Parents Can Say It",
        "Authors": "By Walsh, David",
        "Description": "Join the movement to say Yes to No. An unprecedented coalition of parents and educators across Minnesota have adopted No as a statewide read.Although saying No to your child is obviously important, many parents still have a hard time following through—even when they know they should—especially when other parents and the culture around them are being permissive.  Now, successful psychologist, bestselling author, and nationally known parenting expert Dr. David Walsh provides you with an arsenal of tactics, explanations, and examples for using No the right way with your kids. His memorable, affecting, and sometimes humorous anecdotes help you regain confidence in your own judgment and ability to say No as they remind you that you're not alone in your parenting struggles. With Dr. Walsh's down-to-earth advice, you can immediately assess and improve your relationship with your kids, set and enforce limits that make sense for different ages (from toddlers to teens), and otherwise make No a positive influence on kids' behavior and in your overall family life.  The first look at the psychological importance of No in a child's development, No offers the lively voice, warm wisdom, science made simple, and breadth of knowledge that readers have come to expect from Dr. Walsh.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Fighting Fit: Boxing Workouts, Techniques, and Sparring (Start-Up Sports, Number 12)",
        "Authors": "By Werner, Doug and Lachica, Alan",
        "Description": "A boxer’s workout is a fantastic way to burn calories—it is engaging, exhilarating, and effective. Going beyond jumping rope and punching the heavy bag, this guide describes intermediate and advanced boxing skills that will help anyone improve their performance in the ring. This boxing workout will help develop body and character so that athletes can get into the best shape of their lives, build self-confidence, and be winners in and out of the ring.",
        "Category": " Sports & Recreation , Boxing",
        "Publisher": "Tracks Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Art of Mesoamerica from Olmec to Aztec (World of Art)",
        "Authors": "By Miller, Mary Ellen",
        "Description": "Looks at drawings, ceramics, sculpture, reliefs, and architecture produced by the Olmecs, Maya, and Aztecs, and describes the cultural background of each work",
        "Category": "",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "The Next Great Bubble Boom: How to Profit from the Greatest Boom in History: 2006-2010",
        "Authors": "By Dent, Harry S.",
        "Description": "For over fifteen years, New York Times bestselling author Harry S. Dent, Jr., has been uncannily accurate in predicting the financial future. In his three previous works, Dent predicted the financial recession of the early nineties, the economic expansion of the mid-nineties, and the financial free-for-all of 1998-2000.  The Next Great Bubble Boom -- part crystal ball, part financial planner -- offers a comprehensive forecast for the next two decades, showing new models for predicting the future behavior of the economy, inflation, large- and small-cap stocks, bonds, key sectors, and so on. In taking a look at past booms and busts, Dent compares our current state to that of the crash of 1920-21, and the years ahead of us to the Roaring Twenties. Dent gives advice on everything from investment strategies to real estate cycles, and shows not only how bright our future will be but how best to profit from it.  Dent gives us all something to look forward to, including:   The Dow hitting 40,000 by the end of the decade The Nasdaq advancing at least ten times from its October 2001 lows to around 13,500, and potentially as high as 20,000 by 2009 Another strong advance in stocks in 2005, with a significant correction into around September/October 2006 The Great Boom resurging into its final and strongest stage in 2007, and even more fully in 2008, lasting until late 2009 to early 2010   Dent's amazing ability to track and forecast our financial future is renowned, and here he takes that ability to the next level, showing not only what our economy will look like but also how it will affect us as individuals, as organizations, and as a culture. From the upcoming wealth revolution to the essential principles of entrepreneurial success, the book describes a new society where economic and philanthropic development go hand in hand.  In The Next Great Bubble Boom, Dent shows not only how the economic growth of the late 1990s was a prelude to the true great boom right around the corner but how all of us can reap its benefits.",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Playing The Game",
        "Authors": "By Sheard, Jim and Armstrong, Wally",
        "Description": "Jim Sheard pairs up with PGA Life member Wally Armstrong for an enjoyable look at life and golf.  With a foreword by Scott Simpson, past U.S. Open champion, this handsome gift book is divided into 18 chapters-one for each hole on a golf course.  Filled with full-color photos, spiritual insight and golden metaphors.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Milestones in Public Health",
        "Authors": "By Barbara DeBuono",
        "Description": "",
        "Category": "",
        "Publisher": "Pfizer Global Phaarmaceuticals",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Rules for Renegades: How to Make More Money, Rock Your Career, and Revel in Your Individuality",
        "Authors": "By Comaford-Lynch, Christine",
        "Description": "WANT A RICHER LIFE?BREAK ALL THE RULESRenegade entrepreneur-and runaway success story-Christine Comaford-Lynch has lived the kind of life most of us can only dream about. From model to monk to multimillionaire, she does what she wants-and gets things done.Now, in ten outrageous life lessons, she'll show you how to make your dreams come true. Your way. Your rules. Rules for Renegades distills what Christine has learned as she succeeded (and failed) in business, built strong relationships (and some disasters), and evolved spiritually and professionally. If you want to become financially independent, she'll show you how to do it. If you want to build your confidence and self-esteem, she'll give you a crash course. If you want a meaningful life full of rich connections, she'll share her secrets.Ultimately, she lets you in on the greatest secret of all-how to build a fulfilling life while rocking your career. She has also filled her book with lots of cool free stuff: links to a sample business plan outline, tutorials on sales and marketing techniques, and tools to help you enhance your own power.You'll learn the surprising truth behind her most offbeat rules. . .Everything's an Illusion, So Pick One That's Empowering.Rock Rejection and Finesse Failure.Learn to Love Networking.Work Your Money Mojo.Rules for Renegades is not just the story of a remarkable entrepreneur. It's an amazing approach to life that breaks the rules-and makes life work for you.",
        "Category": " Business & Economics , Training",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Increasing Revenue from Your Clients",
        "Authors": "By Connor, Richard A",
        "Description": "How to create profitable revenue from existing clients. Describes a client-centered marketing approach to produce and protect revenue. Shows you how to retain clients, sell additional services to them, and how to protect revenue obtained from clients that may be targeted by more aggressive firms. Discusses how to develop client retention plans and strategies for re-establishing relations with former clients. Also reveals how to build marketing into your consultation engagement procedures.",
        "Category": " Business & Economics , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Maryland and Delaware Off the Beaten Path®, 8th (Off the Beaten Path Series)",
        "Authors": "By Colbert, Judy",
        "Description": "This guide to Maryland and Delaware reveals the unique and quirky attractions the states have to offer:  touch authentic fossils at the Deep Creek Lake Discovery Center in Maryland, take Ed Kane's Water Taxi around the Baltimore City Harbor, and tour the historical Delaware Toy and Miniature Museum.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "GPP Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Dr. Spock's Baby and Child Care: 8th Edition",
        "Authors": "By Spock, Benjamin, M.D. and Needlman, Robert",
        "Description": "OVER 50 MILLION COPIES IN PRINT! THE CLASSIC THAT CONTINUES TO GROW WITH THE TIMES! For sixty-five years, parents have relied on the expert advice of renowned pediatrician Dr. Benjamin Spock. But while children never change, issues and concerns do. Dr. Robert Needlman, himself a top-notch pediatrician, has newly updated and expanded this timeless classic to speak to any parent who is raising children in our rapidly changing world. While still providing reassuring advice on age-old topics such as caring for a new baby, as well as accidents, illness, and injuries, this book also contains expanded information in many new areas, including: • Cutting-edge medical opinion on immunizations • Obesity and nutrition • Cultural diversity and nontraditional family structures • Children’s learning and brain development • The newest thinking on children with special needs • Environmental health • Increasingly common disorders such as ADHD, depression, and autism— including medications and behavioral interventions • Children and the media, including electronic games • Coping with family stress • And much, much more With an updated glossary of common medications and an authoritative list of the most reliable online resources, this invaluable guide is still the next best thing to Dr. Spock’s #1 rule of parenting: “Trust yourself. You know more than you think you do.”",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Quotable Teacher",
        "Authors": "By Howe, Randy (EDT)",
        "Description": "If teaching is an art form, then students are the canvas. A passionate teacher has the power to change lives, and in turn, help shape tomorrow’s world. With reflections from notables including Aesop, Woody Allen, Maya Angelou, Bill Clinton, Bill Cosby, Helen Keller, Langston Hughes, and John F. Kennedy, these inspirational and informative words of wisdom discuss everything from the importance of teaching and learning to dealing with discipline and classroom management.",
        "Category": " Reference , Quotations",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Last Look",
        "Authors": "By Mariah Stewart",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Whisker of Evil: A Mrs. Murphy Mystery",
        "Authors": "By Brown, Rita Mae and Gellatly, Michael (ILT)",
        "Description": "This balmy summer in Crozet, Virginia, postmistress Mary Minor \"Harry\" Haristeen has a lot to think about. Things have been pretty cozy between her and her ex-husband, Fair...and her beloved old post office is in danger of being replaced with a modern building - and modern rules.Harry's thoughtful contemplation is shattered the day she stumbles over a dead body near Potlicker Creek. Barry Monteith, the handsome local horse breeder, has been savagely murdered. A true ladies' man, Barry was known to have left a string of broken hearts behind him. But could a spurned lover be responsible for his untimely demise? The plot only thickens when an autopsy reveals that Barry was infected with rabies weeks before being killed.As usual, Harry can't resist doing a little digging - with Mrs. Murphy close by to warn of approaching danger. Harry makes a remarkable discovery in the creek - the class ring of Mary Pat Reines, a local woman who disappeared thirty years earlier along with prized Thoroughbred stallion. Like Barry, Mary Pat was a successful horse breeder - and now all of Crozet is wondering if the two cases are linked.As the police struggle with the evidence, the pressure gets hotter than a June afternoon - especially when another person is found dead of less-than-natural causes. As usual, Mrs. Murphy and her crew are the first to sniff out the truth. But if they don't find a way to help Harry piece together the puzzle, she could become the killer's next target - and even Mrs. Murphy's slinkiest moves won't be able to save her.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Merchants of Fear: Why They Want Us to be Afraid",
        "Authors": "By Catherwood, Christopher and DiVanna, Joseph",
        "Description": "Although George Bush and Dick Cheney appear on the cover of this book in obvious reference to their scare-mongering considering terrorism and the nonexistent threat of Iraq, Catherwood (a historian affiliated with Churchill College Cambridge and Homerton College in the UK) and DiVanna (a UK-based economist and business consultant) argue that fear is an underlying characteristic of the American culture that has always been present as a legitimized mechanism for government control and economic activity. They connect the post-9/11 era of fear to previous fear-creating events like McCarthyism, the launching of Sputnik, and the Cold War and examine the similar role played by the media in exploiting fear in each of these cases. They present evidence that the United States has been involved in a historical cycle in which fear is used to justify armed interventions at times when the economy is slumping and warn against the decay in the American social fabric that has resulted from this cycle. Finally, they look to the example of the rise and fall of the British Empire and other great powers to consider the possible trends in this continuing use of fear to promote political, military, and economic objectives. Annotation ©2008 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , Political Ideologies , Democracy",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Tao of Physics",
        "Authors": "By Fritjof Capra",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1977"
        }
    },
    {
        "Title": "The Portable Mba in Entrepreneurship",
        "Authors": "By Bygrave, William D.",
        "Description": "Sixty-million years ago dinosaurs were driven to extinction by global climatic changes, making way, in the process, for the small, more adaptable, warm-blooded mammals. Similarly, in the new economic climate of the 1980s and '90s, small business owners and entrepreneurs are quickly becoming the dominant business species. While the floundering corporate giants continue to lay off workers at a rate of 400,000 annually, small businesses create millions of new jobs each year - a trend, most experts agree, that will continue well into the 21st century.In The Portable MBA in Entrepreneurship, you'll find out how top business schools are preparing students to meet the challenges of the entrepreneurial-driven business climate of the 1990s and beyond. William Bygrave, a successful entrepreneur and Director of the Center for Entrepreneurial Studies at Babson College, has brought together an all-star team of thinkers and doers to offer both established and aspiring entrepreneurs this comprehensive, highly practical guide. They include professors, consultants, and entrepreneurs - most of them successful business people, in addition to being first-class academics. Over the course of fourteen chapters, these experts cover all the angles, including how to tell if you've got the \"right stuff\" to be a success; start-up strategies; spotting market opportunities, marketing, and advertising; getting financing and managing debt; preparing business plans; managing a growing business and strategies for growth; legal and tax issues every small business person and entrepreneur should know; protecting intellectual property; and much more.Amazingly, while The Portable MBA in Entrepreneurship brings you the collective wisdom of some of the top guns in the academic and business worlds, it requires no background or academic prerequisites. Featuring solid, substantive information written in an interesting and engaging style, this book is your golden opportunity to get a state-of-the-art education in entrepreneurship in your spare time and at a tiny fraction of the cost of an MBA program.",
        "Category": " Business & Economics , Entrepreneurship",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Signers of the Declaration of Independence",
        "Authors": "By Ferris, Robert G. and Morris, Richard E.",
        "Description": "",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Interpretive Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "The Harvard Guide to Influential Books: 113 Distinguished Harvard Professors Discuss the Books That Have Helped to Shape Their Thinking",
        "Authors": "By Devine, C. Maury, Dissel, Claudia M., and Parrish, Kim D. (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Taking Charge: The Dynamics of Personal Decision Making and Self Management",
        "Authors": "By McMinn, Gordon",
        "Description": "",
        "Category": "",
        "Publisher": "Accent Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "Firing on All Cylinders: The Service/Quality System for High-Powered Corporate Performance",
        "Authors": "By Clemmer, Jim and Sheehy, Barry",
        "Description": "In a recent Gallup Poll, 50 percent of CEOs surveyed consider service/quality to be the single most important business issue their organizations face. North American businesses confront fierce competition from abroad and continue to lose market share. A growing number of companies, governments, and institutions are turning to service/quality improvement, or total quality management, to succeed in these turbulent times. But many organizations are floundering and failing to effectively implement these powerful new management methods.Firing on All Cylinders gives you a practical map for improving service and quality within your organization. You'll find thought-provoking questions that help you analyze what components are amiss within your organization so you and your management team remove quality improvement roadblocks. Jim Clemmer provides essential implementation checklists, \"how-to\" tips, and deployment processes so you can use Achieve International's Service/Quality System to guide your company's continuous quality improvement journey.Achieve's Service/Quality System is used by dozens of health care, public and private sector organizations, such as American Express, IBM - Canada, and Black & Decker. It combines three formerly separate organizational performance fields - customer service, organization development, and quality improvement - to help management teams take a broader, system-wide approach to long-term performance improvement.At the heart of this highly effective system are 12 key service/quality improvement areas or \"cylinders\" that include skill building, signaling commitment, systems and process management, standards and measures, listening to internal/external customers, reward and recognition, education and awareness, marketing strategies, and hiring and orienting. Clemmer outlines the fundamental steps for improving performance for each cylinder and incorporates a number of brief, \"real-life\" examples of what numerous organizations have done to achieve top performance. He also outlines how to avoid common implementation pitfalls and traps.Firing on All Cylinders also answers such fundamental deployment questions as: who should be involved?, how does your organization build the commitment of the vital frontline people who will ultimately carry out the improvement plans?, and how can you ensure that the Service/Quality System doesn't become just another \"program of the month\"?This comprehensive, clearly organized strategy for implementing a continuous quality improvement process will help you and your management team fine tune your organizational engine and increase performance!",
        "Category": " Business & Economics , General",
        "Publisher": "Business One Irwin",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The Ultimate Baseball Road-Trip: A Fan's Guide to Major League Stadiums",
        "Authors": "By O'Connell, Kevin and Pahigian, Josh",
        "Description": "The Ultimate Baseball Road-Trip is a comprehensive guide to all the diverse and fascinating ballparks throughout the country by two entertaining young writers whose love for the game of baseball and the game of life overflows from each page. Josh Pahigian and Kevin O'Connell's approach to skillfully planning and fully appreciating a road-trip or a visit to a single park is funny and irreverent and loaded with information designed to make the most of the experience.Part travel manual, part ballpark atlas, part baseball history book, part restaurant and city guide, and, not least, part epic narrative, The Ultimate Baseball Road-Trip encompasses all the essential elements of a full-blown baseball road-trip. Included are ticket and travel information, a detailed guide to the best and worst seats in each park, folklore and statistics on each park, tips on each park's trademark foods, and profiles of nearby sports bars and baseball attractions, all within a lively narrative that reminds us that baseball is often the ultimate metaphor for the important things in life.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The step-by-step guide to growing and displaying roses",
        "Authors": "By Mattock, John",
        "Description": "",
        "Category": "",
        "Publisher": "Nelson Regency",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Intimate Circle: The Sexual Dynamics of Family Life",
        "Authors": "By Ehrenberg, Miriam and Ehrenberg, Otto",
        "Description": "Discusses the current status of sexual attitudes within families, and explores common myths and situations concerning sex with which families must cope",
        "Category": " Social Science , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    }
]