[
    {
        "Title": "Christmas Mouse (Look-Look)",
        "Authors": "By Szekeres, Cyndy",
        "Description": "A mouse helps his family prepare for Christmas",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Celebration of American Food: Four Centuries in the Melting Pot (The Library of Congress Series)",
        "Authors": "By Schremp, Geraldine",
        "Description": "Celebration of American Food explores the profound impact of various immigrant groups on American cuisine, delving into the regional variations that reflect the diversity of our tastes. In addition, the book traces the creation of cooking and kitchen tools including the stove, the icebox, the microwave oven and the electric bread baker. Also featured are fads and fancies throughout the ages, from hamburger stands in the 1920s to TV dinners in the 1950s, from cooking out of cans in the 1960s to the ethnic diversity and natural food trends of the 1980s and 1990s. Packed with fascinating facts and generous detail, Celebration of American Food is a grand banquet of American culinary history.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Fulcrum Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "A Long Way from Tipperary: What a Former Monk Discovered in His Search for the Truth",
        "Authors": "By Crossan, John Dominic",
        "Description": "I have spent thirty years reconstructing the historical Jesus. I have done so self-consciously and self-critically and have tried to do the same on reconstructing myself. But what justifies this memoir is how my own personal experience, from Ireland to America, from priest to professor, from monastery to university, and ... from celibacy to marriage, may have influenced that reconstruction. Where has it helped me see what others have not, and where has it made invisible to me what others find obvious?-from A Long Way from TipperaryFrom his upbringing in Ireland to front-page coverage in the New York Times and mention in cover stories in Time, Newsweek, and U.S. News & World Report, John Dominic Crossan-who has courageously pioneered the contemporary quest for the historical Jesus-has dared to go his own way. In this candid and engaging memoir, the world's foremost Jesus scholar reveals what he has discovered over a lifetime of open-eyed, fearless exploration of God, Jesus, Christianity, and himself. Crossan shares his provocative thinking on such issues as how one can be a Christian without going to church; whether God is vengeful, or just, or both; and why Jesus is more like Gandhi or Martin Luther King Jr. than like the Pope or Jerry Falwell.Raised in the traditional Irish Catholic Church, Crossan inherited a faith that was \"accepted fully and internalized completely but undiscussed, uninvestigated, and uncriticized.\" A dauntless spirit whose imagination was ignited not by piety but by the lure and challenge of adventure, he became a monk to travel and explore the world, unaware that his most thrilling quests would be scholarly and spiritual. \"God had going the best adventure around,\" Crossan confesses.Because he could never subject his theological convictions and historical findings to the restrictions of the Church, Crossan chose to leave the monastery and priesthood. Speaking of this time in his life, Crossan writes, \"Not even a vow of obedience could make me sing a song I did not hear.\" But he never abandoned the Roman Catholic community or tradition and never lost his faith. He has devoted his life and career to a reexamination of what he calls \"necessary open-heart surgery on Christianity itself.\"",
        "Category": " Biography & Autobiography , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Mary Emmerling's Quick Decorating: Fast and Easy Projects for Every Room of the House (American Country Series)",
        "Authors": "By Emmerling, Mary Ellisor, Kirchner, Jill, Skott, Michael (PHT), and Skott, Michael",
        "Description": "In Mary Emmerling's Quick Decorating, Mary Emmerling solves everyone's number one decorating problem: how to create a beautiful home when time is at a premium.Her chapters organize projects by how much time is needed to complete them - from five minutes to an afternoon. And in the final chapter she shows how to put it all together, using her own move to a new home in Santa Fe as a guide, with diagrammatic photographs of every room in the house that break down their overall beauty into easy-to-understand elements.With hundreds of illustrated projects, three hundred full-color photographs, an appendix of a hundred instant ideas, including tips on moving into a new home, and an all-new resource directory, Mary Emmerling's Quick Decorating is the answer to today's biggest home-design challenge - how to do decorate beautifully and fast.",
        "Category": " House & Home , Decorating",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Great Cooking With Country Inn Chefs: A Culinary Journey Across America",
        "Authors": "By Greco, Gail",
        "Description": "Gathers international-style recipes featured at American country inns, including appetizers, breads, soups, salads, vegetables, meat, game, fish, seafood, sauces, and desserts",
        "Category": " Cooking , Reference",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "John Henry (Picture Puffins)",
        "Authors": "By Lester, Julius and Pinkney, Jerry (ILT)",
        "Description": "Julius Lester and Jerry Pinkney's warm, humorous retelling of a popular African-American folk ballad.When John Henry was born the birds, bears, rabbits, and even a unicorn came to see him. He grew so fast, he burst right through the porch roof, and laughed so loud, he scared the sun! Soon John Henry is swinging two huge sledgehammers to build roads, pulverizing boulders, and smashing rocks to smithereens. He's stronger than ten men and can dig through a mountain faster than a steam drill. Nothing can stop John Henry, and his courage stays with us forever. A Caldecott Honor Book* \"This is a tall tale and heroic myth, a celebration of the human spirit . . . The story is told with rhythm and wit, humor and exageration, and with a heart-catching immediacy that connects the human and the natural world. \" --Booklist, starred review\"Another winning collaboration from the master storyteller and gifted artist of Tales of Uncle Remus fame.\" --School Library Journal\"A great American hero comes fully to life in this epic retelling filled with glorious, detailed watercolors . . .  This carefully crafted updating begs to be read aloud for its rich, rhythmic storytelling flow, and the suitably oversize illustrations amplify the text.\" --Publishers Weekly",
        "Category": " Juvenile Fiction , People & Places , United States , African American",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Henny Penny (Paul Galdone Classics)",
        "Authors": "By Galdone, Paul (EDT)",
        "Description": "Convinced the sky is falling, Henny Penny and a band of gullible friends march off to tell the king, only to meet their end at the hands of a wily fox.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Flowers of the Caribbean",
        "Authors": "By Lennox, G.w. and Seddon, S.a.",
        "Description": "Anyone visiting the Caribbean for the first time cannot fail to be impressed by the richness and luxuriance of the vegetation. This book includes photographs that have been taken of plants growing in their natural surroundings in the Caribbean, particularly of flowering trees as they appear to be especially exotic when in blossom.",
        "Category": " Nature , Plants , General",
        "Publisher": "MacMillan Educ Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Presidency ~ A History of the Office of the President of the United States from 1789 to the Present (Clinton)",
        "Authors": "By Nelson, Michael (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Pub Overstock Unlimited Inc",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "What Do We Mean When We Say Love?",
        "Authors": "By Sullivan, Deirdre",
        "Description": "",
        "Category": "",
        "Publisher": "Running Pr Book Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Jeff Foxworthy's Redneck Dictionary: Words You Thought You Knew the Meaning Of",
        "Authors": "By Foxworthy, Jeff, Bahr, Fax (CON), Small, Adam (CON), Campbell, Gary (CON), and Hartt, Brian (CON)",
        "Description": "Hey, you! The one holding the book. Have you ever seen a volume like this? Well, whether you realize it or not, it’s the one you’ve been waiting for. Jeff Foxworthy’s Redneck Dictionary will teach you how to speak this unique Southern dialect fluently. Whether you’re blue-collar or hoity-toity, swimming in cash or betting your bottom dollar, a little bit country or a lot of city slicker, this practical reference to redneck words and turns of phrases will give you hours of laughs.So expand your horizons and learn another language with this fun, instructive, and hilariously illustrated book as your guide. After all, speaking redneck is a heck of a lot easier than speaking French!",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Never Too Little to Love",
        "Authors": "By Willis, Jeanne and Fearnley, Jan (ILT)",
        "Description": "Whimsical watercolors illustrate a comical, cumulative tale of an amorous mouse who aims impossibly high -- and learns that you're never too little (or too big) to love.Tiny Too-Little loves someone who's very, very tall, and Tiny wants a kiss. What if he stands on his tiptoes on top of a thimble? What if he stands on his tiptoes on top of a matchbox on top of a thimble? Clever cut-away pages show Tiny's precarious pile growing higher and higher, while the object of his affection stays just out of reach. When the teetering stack finally falls with a crash, will his hopes be dashed? How can a tiny mouse get the kiss he needs?",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "The Valentine Bears",
        "Authors": "By Bunting, Eve and Brett, Jan (ILT)",
        "Description": "Mrs. Bear plans a surprise Valentine's Day celebration for Mr. Bear despite their usual hibernating habits at that time of year.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Valentine's Day",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Generals of the Civil War",
        "Authors": "By Golay, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Phantom Army of the Civil War and Other Southern Ghost Stories",
        "Authors": "By Spaeth, Frank (EDT)",
        "Description": "This is a haunting collection of personal encounters with the spirit world as they appeared in FATE magazine. These are tales handed down over the years that have their basis in the horrors of the Civil War.",
        "Category": " History , Military , Wars & Conflicts (Other)",
        "Publisher": "Castle Books / Book Sales, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Ghosts And Haunts Of The Civil War: Authentic Accounts Of The Strange And Unexplained",
        "Authors": "By Coleman, Christopher K.",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Recognition of Sakuntala (Dover Thrift Editions)",
        "Authors": "By Kalidasa, Ryder, Arthur W. (TRN), and Tagore, Rabindranath (INT)",
        "Description": "While out on a hunting trip, a king encounters a lovely maiden, and the course of their secret romance sweeps the audience from a forest hermitage to a dazzling palace to ethereal celestial realms. The tale of King Dusyanta and Śakuntala, who meet by chance and are separated by a curse, was derived from an episode in the Mahabharata, India's grand religious epic. The Recognition of Śakuntala, written in the 5th century by the greatest of the ancient Indian playwrights, offers a classic introduction to Indian theater and aesthetics.In addition to its enchanting love story, this play presents a religious drama. It promotes the doctrine of karma, in which all experiences are influenced by actions from earlier in life, and it represents an allegory of the relationship between the worshiper and the sacred. Students of drama, religious studies, and world literature will appreciate this affordable and accessible edition of a timeless play.",
        "Category": " Drama , Ancient & Classical",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "50 Things You're Not Supposed to Know: Volume 1",
        "Authors": "By Kick, Russ",
        "Description": "Russ Kick has proved himself a master at uncovering facts that \"they\" would prefer you never hear about. The rapid success of the largeformat Disinformation Guide series edited by Kick has only whetted a roaring public appetite for more revelations about government coverups, scientific scams, corporate crimes, medical malfeasance, historical whitewashes, media manipulation, and other knockyoursocksoff secrets and lies. This CDsized book packs a powerful punch in a small, attractive package intended for impulse and gift purchases, as well as serving as a handy reference book. Among Kick's amazing discoveries, all thoroughly documented:The first genetically modified humans have already been born.Hitler's blood relatives are living in the U.S.The CIA commits over 100,000 serious crimes per year.The U.S. planned to explode an atomic bomb on the moon.An atomic bomb was dropped on North Carolina.The main hero of the movie Black Hawk Down is a convicted child molester.The discoverer of HIV no longer believes the virus is the sole cause of AIDS.Kent State wasn't the only massacre of U.S. college students during the Vietnam era.Lincoln didn't free any slaves.A uniquely valuable tool to debunk modern mythology and the people and institutions serving it up.",
        "Category": " Political Science , General",
        "Publisher": "Disinformation Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Hot Stuff",
        "Authors": "By Evanovich, Janet and Banks, Leanne",
        "Description": "Dear Reader, If you like hot men, hot action and hot attraction you're going to love this HOT new series! HOT STUFF introduces Cate Madigan, a Boston native from a large and crazy Irish family. Cate has far too much going on to get involved in extracurricular activities, like men and marriage. She spends all day in school, earning her teaching degree, and all night working as a bartender in Boston's South End. Ex-cop Kellen McBride has decided to make Cate's bar his nightly haunt. He likes Cate's sassy Irish spirit and wild red hair. He also has an ulterior motive for getting close to her. Cate has sworn off all things romantic, but when she comes home to a ransacked apartment, a roommate who has flown the coop, and a sleeping bullmastiff named Beast, Cate has no choice but to ask Kellen for help. Can Kate resist the charming Kellen McBride while keeping herself out of danger? Or will Kellen turn up the heat on Cate and everything in her life?We know you'll have a blast with HOT STUFF!Janet Evanovich & Leanne Banks",
        "Category": " Fiction , Romance , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Simply Sexy (The Simply Series, Book 5)",
        "Authors": "By Phillips, Carly",
        "Description": "What do women want? Newspaperman Colin Lyons needs to figure it out—fast! Because advice columnist Rina Lowell is waging a sexual campaign against him that he can't withstand for long. Not that he wants to&#133;. Rina is as irresistible to him as her column is to her readers. The problem? The newspaper's in the red, and all fluff pieces have to be cut. Still, faced with Rina's seductive powers of persuasion, Colin can't resist taking her to bed. Little does she guess he's about to put her out of a job, too&#133;.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Death of an Irish Tinker: A Peter McGarr Mystery (Peter McGarr Mysteries)",
        "Authors": "By Gill, Bartholomew",
        "Description": "A body is found shackled to the upper branches of the tallest tree in Ireland. The victim is a \"Tinker,\" one of the mysterious class of itinerant travelers who have roamed Ireland for generations. The murder bears all the signs of being the work of Desmond Bacon, \"the Toddler,\" brutal king of Ireland's heroin trade. But who was the deceased and why was he killed? The answer lies with a Tinker woman named Biddy Nevins, who may be the only person able to put Bacon away--that is, if Peter McGarr and his crew can get to her before the Toddler does.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Undomestic Goddess",
        "Authors": "By Kinsella, Sophie",
        "Description": "Workaholic attorney Samantha Sweeting has just done the unthinkable. She’s made a mistake so huge, it’ll wreck any chance of a partnership. Going into utter meltdown, she walks out of her London office, gets on a train, and ends up in the middle of nowhere. Asking for directions at a big, beautiful house, she’s mistaken for an interviewee and finds herself being offered a job as housekeeper. Her employers have no idea they’ve hired a lawyer—and Samantha has no idea how to work the oven. She can’t sew on a button, bake a potato, or get the #@%# ironing board to open. How she takes a deep breath and begins to cope—and finds love—is a story as delicious as the bread she learns to bake. But will her old life ever catch up with her? And if it does…will she want it back?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Winds of Altair",
        "Authors": "By Bova, Ben",
        "Description": "Earth is an old planet, and her teeming masses are running out of resources . . . and time. It is up to men such as Jeff Holman to discover a haven for Earth’s millions. Altair VI is one such planet, and Holman is determined to transform this world into one where the human race can survive.Star probes had long before informed Earth that Altair VI had a flourishing ecology with one very tough beast at the top of the food chain, a beast that will have to be dealt with before the human colony ships arrive. The beast is not only tough, it is as smart as a man.Holman is faced with a soul-wrenching decision—for to make Altair VI habitable for humans, all native life must die.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "God Calling: Devotionals for Restoring Faith and Serenity",
        "Authors": "By Russell, A. J.",
        "Description": "God Calling presents the wisdom of Christianity through the ears and then the voices of Two Listeners. Here is a daily devotional full of the time-tested words of counsel, comfort, encouragement, and wisdom that have inspired countless thousands throughout the years.“What man calls conversion is often only the discovery of the Great Friend. What man calls religion is the knowledge of the Great Friend. What man calls holiness is the imitation of the Great Friend.”The words of that Great Friend are given daily presence in God Calling—made easily available for all, to ease and simplify the chaos and pain of our tension-filled world.Includes devotional pages—with space to record your own messages of faith.",
        "Category": " Religion , Inspirational",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1978"
        }
    },
    {
        "Title": "Jefferson's Fine Arts Library: His Selections for the University of Virginia Together With His Own Architectural Books",
        "Authors": "By O'Neal, William Bainter",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Univ of Virginia Pr",
        "Price Starting With ($)": "38.54",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "Hikes in the Washington region",
        "Authors": "By Stone, Philip J",
        "Description": "",
        "Category": "",
        "Publisher": "Potomac Appalachian Trail Club",
        "Price Starting With ($)": "8.45",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Hiking Virginia's National Forests",
        "Authors": "By Wuertz-Schaefer, Karin",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The American Presidency: A Glorious Burden",
        "Authors": "By National Museum of American History (U. S.) (COR), Bunch, Lonnie G. (EDT), Crew, Spencer R., Hirsch, Mark G., Rubenstein, Harry R., Smith, Richard Norton (INT), and Bunch, Lonnie G.",
        "Description": "In conjunction with the opening of a new permanent exhibit at the National Museum of History, this amply illustrated volume by museum staff draws from NMH collections to illuminate the evolution, and media's memory-shaping, of the US Presidency through material culture: from assassination-related images to Clinton's saxophone. Includes a chronology. Lacks an index. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " History , United States , General",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "The Look-It-up Book of Presidents (Look-It-Up Books)",
        "Authors": "By BLASSINGAME, Wyatt",
        "Description": "Entertaining, up-to-the minute, and easy-to-use, The Look-It-Up Book of Presidents features a short, lively biography of every president from George Washington through the winner of the 2012 presidential election, plus a chapter on Election 2000—the \"year of the chad.\" It includes concise descriptions of the major events, issues, and achievements of each administration, and is fully illustrated in black and white with engravings, cartoons, and photographs.  In-print and updated after every presidential election since 1968, it's an easy-to-use, affordable alternative to hardcover home reference books like National Geographic's Our Country's Presidents at $24.95. An invaluable resource that the whole family will turn to again and again, The Look-It-Up Book of Presidents is American history in a nutshell.",
        "Category": "",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "The All-Summer Cookbook",
        "Authors": "By Linda Fraser~Emma Brown",
        "Description": "",
        "Category": " Cooking , Seasonal",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "6.89",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Get A Jump:Student Aid Answer Book 4ed",
        "Authors": "By Buck, Carl (EDT)",
        "Description": "Covers the financial aid process with information on such topics as obtaining loans, grants, scholarships, cutting college costs, and repaying student loans.",
        "Category": " Study Aids , Financial Aid",
        "Publisher": "Petersons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Yiddish Wisdom: Yiddishe Chochma",
        "Authors": "By Swarner, Kristina (EDT)",
        "Description": "All the color, vibrancy, and humor of Yiddish is captured in this timeless treasury of over 100 folk sayings in both English and Yiddish. From the profound (A meowing cat can't catch mice/A katz vos m'yavket ken kain meiz nit chapen) to the sublime (Man thinks and God laughs/A mentsh tracht un Got lacht) to the simply practical (When you look to the heights, hold on to your hat/Az du kukst oif hoichen zachen halt tsu dos hitl), Yiddish Wisdom collects the best the Old Country has to offer from an enduring wealth of proverbs, folk sayings, and phrases.Whether you speak Yiddish or just enjoy the unique insight of those who do, Yiddish Wisdom will delight you with its wit, warmth, and thoughtfulness. Chagall-like illustrations by Kristina Swarner complete this entertaining collection - the perfect icebreaker for social gatherings, mah-jongg games, and coffee klatches, or a charming gift for any happy occasion. Your grandmother would be proud.",
        "Category": " Social Science , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Today's Destructive Cults and Movements",
        "Authors": "By Gesy, Lawrence J. (EDT) and Giambalvo, Carol (EDT)",
        "Description": "Defines and describes destructive cults, explores their attraction, and examines, in detail, fundamentalism, Shepherding, the Ku Klux Klan, Witchcraft, Satanism, and other organizations",
        "Category": " Religion , Cults",
        "Publisher": "Our Sunday Visitor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Harry Houdini: Master of Magic (Harry Houdini Mysteries)",
        "Authors": "By Kraske, Robert",
        "Description": "This biography recounts the life of Harry Houdini from his boyhood through his years as an escape artist and master showman.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , General",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Treasured Stories of Christmas: A Touching Collection of Stories That Bring Gifts from the Heart and Joy to the Soul",
        "Authors": "By Guideposts Associates (EDT)",
        "Description": "Collects poems, stories, mediations, and reflections on Christmas from such writers as Norman Vincent Peale, Robert Louis Stevenson, Pearl S. Buck, and Faith Baldwin",
        "Category": " Religion , General",
        "Publisher": "Bbs Pub Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "I’m Dreaming of Some White Chocolate: Christmas Reflections with a Little Holly & a Lot of Jolly",
        "Authors": "By Rhea, Rhonda",
        "Description": "A humorous holiday guide filled with insight from Scripture offers practical solutions for making the holiday season less stressful and more enjoyable, covering everything from parties, to gift wrapping, to dealing with visiting relatives. Original.",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Reader's Digest Complete Do It Yourself Manual",
        "Authors": "By Digest, Readers",
        "Description": "",
        "Category": "",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "7.7",
        "Publish Date": {
            "Month": "April",
            "Year": "1973"
        }
    },
    {
        "Title": "American Economic Policy and National Security (The Pew Project on America's Task in a Changed World)",
        "Authors": "By Moran, Theodore H.",
        "Description": "Economics now occupies a more prominent position than ever in determining the United States' ability to lead other countries and influence events on the world stage. Mismanagement of economic policy threatens both the United States' position in the international system and our national security. Moran examines three economic threats that could endanger America's national security: America's fundamental and cumulative decline relative to the other major industrial states; a loss of crucial economic and technological capabilities within our own country; and the growing dependence on other countries for vital goods, services, and technologies. He explores the nature of each threat and analyzes the policy alternatives to meet it. Moran argues that the policy responses of greatest benefit to the Unites Stats cannot be  based soley on economic criteria. Instead, American policymakers must construct what the author calls a \"grand stategy\" that envisions an international system that best serves American intersts and includes an assessment of the ability of American political leaders to guide the public in ways that support this system.",
        "Category": " Political Science , General",
        "Publisher": "Council on Foreign Relations",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Ghost Stories (Story Library)",
        "Authors": "By Westall, Robert and Eckett, Sean (ILT)",
        "Description": "An illustrated collection of twenty-two scary stories by such authors as Ray Bradbury, Charles Dickens, Saki, and Philippa Pearce",
        "Category": " Young Adult Fiction , Legends, Myths, Fables , General",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Sinking of the Titanic: Eyewitness Accounts (Dover Maritime)",
        "Authors": "By Mowbray, Jay Henry (EDT)",
        "Description": "Published in 1912 within months of the sinking of the Titanic, this \"memorial edition\" of first-hand accounts by survivors, people in rescue boats, and other on-the-scene witnesses, offers heart-wrenching testimony about the great disaster, steeped in the sentiments of the day. Surviving passengers recount heart-breaking tales of parting with loved ones, watching the great ship sink while the steadfast band played \"Nearer, My God, to Thee,\" and floating helplessly for long hours on icy seas. The search for responsibility began amid the grief of widows and orphans aboard the rescue vessel Carpathia, with accusations of ignored warnings, reckless attempts at record-setting, and the woefully inadequate supply of lifeboats. Enhancing the text are drawings of the ship's decks and luxurious interiors, along with numerous rare photographs of celebrity passengers, captain and crew, poignant images of survivors huddled in lifeboats, and many more striking scenes. Readers will be spellbound by the gripping, you-are-there quality of this unique volume and its remarkable vision of one of the great maritime disasters of history.",
        "Category": " Transportation , Ships & Shipbuilding , History",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Favorite Poems of Childhood (Dover Children's Thrift Classics)",
        "Authors": "By Smith, Philip",
        "Description": "Superb treasury of time-honored poetic gems includes Lewis Carroll's \"The Walrus and the Carpenter,\" Edward Lear's \"The Owl and the Pussy-Cat,\" Eugene Field's \"Wynken, Blynken and Nod,\" Emily Dickinson's \"I’m Nobody! Who are you?,\" Robert Louis Stevenson's \"The Swing,\" many more. Printed in large, easy-to-read type.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "A Treasury of Jewish Stories (A Treasury of Stories)",
        "Authors": "By Geras, Adele (EDT) and Cope, Jane (ILT)",
        "Description": "A collection of stories exploring the Jewish world, by such authors as Isaac Bashevis Singer, Lynne Reid Banks, and Marilyn Hirsh",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "THE THREE BEARS",
        "Authors": "By Watts, Mabel",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Owl at Home (I Can Read Level 2)",
        "Authors": "By Lobel, Arnold",
        "Description": "Welcome to Owl's Cozy home!Owl lives by himself in a warm little house. But whether Owl is inviting Winter in on a snowy night or welcoming a new friend he meets while on a stroll, Owl always has room for visitors!Arnold Lobel's beloved Level 2 I Can Read classic was created for kids who read on their own but still need a little help.The classic Frog and Toad stories by Arnold Lobel have won numerous awards and honors, including a Newbery Honor, a Caldecott Honor, ALA Notable Children’s Book, Fanfare Honor List (Horn Book), School Library Journal Best Children’s Book, and Library of Congress Children’s Book.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "The Adventures of Happy Jack (Dover Children's Thrift Classics)",
        "Authors": "By Burgess, Thornton W. and Cady, Harrison (ILT)",
        "Description": "Happy Jack Squirrel fills his days with fun and foolishness — even while jealously guarding his winter supply of hickory nuts from his mischief-making cousin, Chatterer the Red Squirrel, and playful Striped Chipmunk.But the bouncing, bushy-tailed creature's days of comfort and security are threatened when he wakes one morning to find his worst dream come true: Shadow the Weasel is close by, and Happy Jack finds himself running for his life, trying every trick he knows to get away from his enemy.With gentle charm and good-natured humor, master storyteller Thornton Burgess once again draws youngsters into the timeless world of the Green Forest and the Green Meadows where young readers learn about nature and are encouraged to love the \"lesser folk in fur and feathers.\"",
        "Category": " Juvenile Fiction , Animals , Squirrels",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Blacky the Crow (Dover Children's Thrift Classics)",
        "Authors": "By Burgess, Thornton W. and Cady, Harrison (ILT)",
        "Description": "Children will love this wonderful tale of Blacky the Crow, who has very sharp eyes, and who is often getting into trouble because he sees things he shouldn't. One day Blacky notices two fresh eggs in a nest belonging to Hooty the Owl and Mrs. Hooty. The eggs are a prize too delicious to pass up and Blacky devises a plan to snatch them. But does he succeed? Young readers will enjoy finding out in this charming tale by master storyteller Thornton W. Burgess.Reset in large, easy-to-read type, this book is filled with gentle humor and important lessons about nature and wildlife, and is further enhanced by four original Harrison Cady illustrations. Blacky the Crow is sure to captivate youngsters discovering the joy of reading and the pleasures of storytelling at its finest.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "No More Monsters for Me! (I Can Read Level 1)",
        "Authors": "By Parish, Peggy, Simont, Marc (ILT), and Simont, Marc",
        "Description": "An enjoyable, funny way to address bedtime fears and scared-of-the-dark issuesGuess what's growing in the basement . . . a baby monster!Minneapolis Simpkin is hiding it down there. But a monster is a hard thing to keep secret, especially one that hiccups and cries, and gets bigger every hour. This Level One I Can Read is perfect for kids learning to sound out words and sentences. From the beloved creator of Amelia Bedelia, Peggy Parish, and illustrated by Caldecott medalist Marc Simont.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Keep Your Kids Safe on the Internet (CLS.EDUCATION)",
        "Authors": "By Johnson, Simon",
        "Description": "Protect your children from dangers that lurk on the Internet. Learn to identify the real threats--be they pedophiles, cyber-stalkers, hackers, spyware, viruses, or adware--and formulate an effective protection plan. Choose the best software for your needs and your budget from the book’s independent review of firewalls, web filters, anti-virus products, and more. Plus, a companion Web site hosted by the author will update data and threats.",
        "Category": " Computers , Internet , General",
        "Publisher": "McGraw-Hill Osborne Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Shoot the Piper: A Randall Gatsby Sierra Mystery",
        "Authors": "By Hill, Richard",
        "Description": "Private investigator Randall Gatsby Sierra probes the disappearance of an old friend, a writer who vanishes with both his latest novel and his huge advance and who leads Sierra on an increasingly deadly chase all over Britain. By the author of What Rough Beast?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "8.68",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Are You My Mother ?",
        "Authors": "By Eastman, P. D.",
        "Description": "This must-have classic about a baby bird in search of his   mother is the perfect for every day! A baby bird goes in search of his mother in this hilarious Beginner Book   edited by Dr. Seuss. When a mother bird's egg starts to jump, she hurries off   to make sure she has something for her little one to eat. But as soon as   she's gone, out pops the baby bird. He immediately sets off to find his   mother, but not knowing what she looks like makes it a challenge. The little   hatchling is determined to find his mother, even after meeting a kitten, a   hen, a dog, and a Snort. The timeless message of the bond between mother and   child make P. D. Eastman's Are You My Mother? a must for baby showers, beginning readers, and Mother's   Day. Originally created by Dr. Seuss, Beginner Books encourage children to read   all by themselves, with simple words and illustrationsthat give clues to   their meaning.",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1960"
        }
    },
    {
        "Title": "Mother Quotations (Quotations Books)",
        "Authors": "By Exley, Helen (EDT)",
        "Description": "",
        "Category": " Religion , Counseling",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Joy to the World: A Victorian Christmas",
        "Authors": "By Hart, Cynthia, Grossman, John, and Dunhill, Priscilla",
        "Description": "Text by Priscilla Dunhill. The Christmas we love today sprang from the festive parlors and bedecked halls of a century ago, where it lives still in the lush pages of Joy to the World. A specially embossed and die-cut jacket wraps the book like a precious gift. Selection of the Literary Guild and the Better Homes & Gardens Family Book Service. 199,000 copies in print.",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Straw Men",
        "Authors": "By Marshall, Michael",
        "Description": "The slaughter of sixty-eight patrons at a crowded fast-food restaurant in Pennsylvania, the killing of a California teenager, and other horrific, seemingly unrelated events hold the clues to a lethal network of fear known as The Straw Men. Original.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Jove",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Love Notes: From My Heart to Yours",
        "Authors": "By Booher, Dianna",
        "Description": "The original art illustrator, Sabra Izner, adds a whimsical dimension to the heartwarming writing of popular writer and speaker Dianna Booher. This is the gift to get that special someone any day of the year.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Surprises: 38 Poems about Almost Everything! (I Can Read Level 3)",
        "Authors": "By Hopkins, Lee Bennett (EDT)",
        "Description": "‘These thirty-eight poems offer beginning readers a chance to try some verse. With drawings that pack a lot of action, a friendly book that will connect with everyday lives and lend a little music along the way.’ —BL. Notable Children's Books of 1984 (ALA)Best Books of 1984 (SLJ)Children's Books of 1984 (Library of Congress)",
        "Category": " Juvenile Nonfiction , Poetry , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "HarperCollins College Outline History of Philosophy (HARPERCOLLINS COLLEGE OUTLINE SERIES)",
        "Authors": "By Scott-Kakures, Dion, Castagnetto, Susan, Benson, Hugh, and Hurley, Paul",
        "Description": "Prepared for students by renowned professors and noted experts, here are the most extensive and proven study aids available, covering all the major areas of study in college curriculums. Each guide features: up-to-date scholarship; an easy-to-follow narrative outline form; specially designed and formatted pages; and much more.",
        "Category": " Philosophy , History & Surveys , General",
        "Publisher": "Collins Reference",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "The Birth of Tragedy (Dover Thrift Editions: Philosophy)",
        "Authors": "By Nietzsche, Friedrich Wilhelm",
        "Description": "Among the most influential philosophers of modern times, Friedrich Nietzsche (1844-1900) declared in this classic study that Greek tragedy achieved greatness through a fusion of elements of Apollonian restraint and control with Dionysian components of passion and the irrational. In Nietzsche's eyes, however, Greek tragedy had been destroyed by the rationalism and optimism of thinkers like Socrates. Nevertheless, he found in these ancient works the life-affirming concept that existence is still beautiful, however grim and depressing it may sometimes be. These and many other ideas are argued with passionate conviction in this challenging book, called by British classicist F. M. Cornford \"a work of profound imaginative insight, which left the scholarship of a generation toiling in the rear.\"",
        "Category": " Philosophy , History & Surveys , Ancient & Classical",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Love in Verse: Classic Poems of the Heart",
        "Authors": "By Blease, Kathleen (EDT)",
        "Description": "The world for me, and all the world can hold, is circled by your arms. . . .--James Weldon Johnson                                                         [p. 48]True love is eternal--and in poetry, it speaks across the ages to both men and women, reminding us of its power, constancy, and depth. In this lovely literary valentine, nearly a hundred evocative, tender poems from some of the most inspired poets of our time celebrate love longed for and finally found; love requited and unrequited; love secret and blazoned across the sky; loves past, present, and yet to come.An incomparable collection of beauty and grace, Love in Verse pays fitting tribute to the world's most treasured emotion.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Life's Little Instruction Book For Incurable Romantics A Pulse-quickening Collection For And About People In Love",
        "Authors": "By Brown, H. Jackson and Spizman, Robyn",
        "Description": "We all need a little romance in our lives. Romance doesn't usually just happen, and so we all need a gentle reminder of how to rekindle the spark of romance.Call each other in the middle of the day just to say, \"Hello, I love you.\"Remember that if it matters to your mate, it should matter to you.Count your blessings and start with each other.Have a beautiful flower arrangement awaiting your loved one after a long separation.In addition, this charming book tells stories of the most romantic things ever done, secrets of building a long and happy marriage, and romantic thoughts from the world's greatest literature.The goal of this book is to make the world just a bit more romantic, one couple at a time.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Fables of Avianus",
        "Authors": "By Slavitt, David R, Avianus, and Welliver, Neil (ILT)",
        "Description": "\"When the word fable is mentioned,\" writes Jack Zipes in his foreword to this volume, \"one automatically thinks of the name Aesop, never Avianus.\" Nevertheless, the lively and instructive fables of this early fifth-century Roman writer enjoyed significant popularity in Europe throughout the Middle Ages. Now the complete work of Avianus - forty-two elegiac fables in all - has been rendered into contemporary English verse by acclaimed translator David Slavitt. The volume also features four new illustrations by the artist Neil Welliver.The fables of Avianus show a world in flux, a topsy-turvy world, in which humor and cunning constitute the only saving grace for humans - and, one might add, the poet. While remaining true to the Aesopic spirit of depicting scenes of survival of the fittest in a blunt and candid manner, Avianus is fond of hyperbole and the grotesque, and he skillfully employs his hexameters to bring about an ironic twist that often makes the reader question traditional assumptions. Writing at a time when the Roman world was being transformed by the rise of Christianity, Avianus appears to voice doubt about humankind's ability to deal with change.But Avianus's voice was not a voice of despair. Like Aesop, he shows a clear preference in his fables for learning how to survive and for the underdog. These and other parallels between Avianus's world and our own are all the more striking in the splendid verse translations of David Slavitt. Speaking as clearly to us as he did to his Roman contemporaries, Avianus is once again revealed as a shrewd poet who can unmask hypocrisy and overcome adversity every bit as well as his savvy master Aesop.",
        "Category": "",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "The Biggest Pumpkin Ever",
        "Authors": "By Kroll, Steven and Bassett, Jeni (ILT)",
        "Description": "Desmond and Clayton must work together to win the Biggest Pumpkin competition, in this popular bestselling picture book.Once there were two mice who fell in love with the same pumpkin....Desmond the field mouse wants to carve the biggest jack-o'-lantern in the neighborhood with his pumpkin. Clayton the house mouse wants to win the Biggest Pumpkin contest with his. But when they discover that their choice pumpkins are actually the same one, Desmond and Clayton decide to work together to grow the biggest pumpkin ever!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "It's the Great Pumpkin, Charlie Brown",
        "Authors": "By Fontes, Justine, Fontes, Ron, Schulz, Charles M., Korman, Justine, and Braddock, Paige",
        "Description": "It's Halloween!  Time for ghosts, ghouls, and...  the Great Pumpkin? Linus is sure that this year the Great Pumpkin will finally appear. Join Snoopy, Charlie Brown, Lucy, and the rest of the Peanuts gang for some spooky tricks and hilarious treats in this thirty-fifth anniversary adaptation of the television special!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Blood, Tears and Folly: An Objective Look at World War II",
        "Authors": "By Deighton, Len",
        "Description": "",
        "Category": " History , Military , World War II",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Alligators in the Sewer and 222 Other Urban Legends: Absolutely True Stories that Happened to a Friend...of a Friend...of a Friend",
        "Authors": "By Craughwell, Thomas J.",
        "Description": "Urban Legend (ur/ben lej/end) n. a fictional story, circulated by word-of-mouth, that is perpetuated by the continual assertion of truth.All the rumors that have passed through office e-mail networks, the fantastic stories that have \"happened to a friend\" and the horrifying tales told around campfires are gathered here for the first time in one fascinating, unbelievable collection.Organized by subject, chapters include: Naked at His Own Surprise Party and Other Sexual Escapades, The Stolen Kidney and Other Medical Disasters, The Gulf War Computer Virus and Other High Tech Scares, Roswells's Area 51 and Other Extraterrestrial Encounters, Elvis's Motorcycle and Other Celebrity Rumors, and many more. Each story runs one-to-two-pages long.Many of the stories have been told with a different twist--variations are included at the end of each tale.",
        "Category": " Humor , General",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Secret Intelligence",
        "Authors": "By Baggett, Blaine and Volkman, Ernest",
        "Description": "This volume probes how a democratic society justifies, uses, and controls a large espionage network without compromising the values of the society it is established to protect",
        "Category": " History , United States , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Brain Child: A Novel",
        "Authors": "By Turner, George",
        "Description": "A man, who had been genetically altered before birth in a disastrous experiment to increase human intelligence and creativity and then abandoned, searches for his roots and finds them grounded in deceit, vengeance and perversity",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "The Jerusalem Scrolls (The Zion Legacy, Book 4)",
        "Authors": "By Thoene, Bodie and Thoene, Brock",
        "Description": "The fourth book in the author's epic saga of the Holy land propels readers two thousand years into the past to the first century A.D. where Romans, Zeolots, religious fanatics, and traveling preachers dominate the landscape. 40,000 first printing.",
        "Category": " Fiction , Religious",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Hard Knocker's Luck (A Viking Novel of Mystery and Suspense)",
        "Authors": "By Murray, William",
        "Description": "The horse-playing sleuth and magician, Lou \"Shifty\" Anderson gets involved with a beautiful shoplifter, an art dealer, a down-at-heel artist, a sometime actress, and their various racetrack plots, plans, and perils",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Book of Books; an Eclectic Collection of Reading Recommendations, Quirky Lists,",
        "Authors": "By Krantz, Les and Knight, Tim",
        "Description": "",
        "Category": "",
        "Publisher": "Wildwood Books",
        "Price Starting With ($)": "4.94",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Clara Caterpillar",
        "Authors": "By Cole, Henry (ILT) and Edwards, Pamela Duncan",
        "Description": "Such a clever caterpillar! A carefree cabbage caterpillar named Clara, who becomes a common cream-colored butterfly, can′t possibly compete with a catty, conceited caterpillar named Catisha, who becomes a captivating crimson-colored butterfly. Or can she? Ages 3 - 6",
        "Category": " Juvenile Fiction , Science & Nature , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Drucker: The Man Who Invented the Corporate Society",
        "Authors": "By Tarrant, John J.",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Myth of America's Decline: Leading the World Economy into the 1990s",
        "Authors": "By Nau, Henry R.",
        "Description": "How can America be in decline and yet win the Cold War in 1989 and the Persian Gulf war in 1991?  Because, as Henry R. Nau argues in this probing analysis of postwar policy, the Untied States, unlike the Soviet Union, shared power with its allies as it built a converging world community of political democracies and liberalized market. Today America leads that community as both the world's only military superpower and the one country Western governments trust to use military force for common objectives--a trust exemplified by the recent war in Kuwait.       A loss of relative power, Nau contends, is not troublesome if it leads to more convergent domestic values and institutions among countries.  Over a period of forty years, carefully chronicled in this book, the United States pursued political and economic policies that successfully nurtured Western democracies and integrated industrial economies.  Through open markets, America helped allies catch up; and through open societies, the industrial nations overcame ethnic and economic divisions and grew to trust one another more.  Although the United States lost relative economic power, it gained political friends and still remains, economically, the world's leader in absolute levels of productivity.       Nor, according to the data assembled in this study, has the United States lost its ability to compete in foreign markets.  The economic policies of the 1980s led to growth rates and manufacturing productivity increases that surpassed the boom years of American dominance from 1947-1967 and equaled or exceeded the performance of Germany and Japan in the latter part of the decade.       The threat to our future, Nau contends, does not come from trade competition with the allies.  It comes instead from domestic divisions that immobilize America's fiscal and domestic policies and prevent the country from taking the lead role in assisting the historic transformation underway in Eastern Europe, the Soviet Union, and many developing countries.  Americans have to decide whether half of their federal budget outlays should continue to go to middle class entitlements, distributed without regard to need, or whether some of these savings--as well as defense cuts--should go to needy people both at home and in the reforming countries abroad.  Nau demonstrates that America can only live up to its high standards at home only if it recognizes that these standards are now widely recognized and accepted around the world.  To turn America's back on a world yearning to be free would not only weaken the prospects for success in the reforming countries but scuttle America's self-image and confidence at home.",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "7.64",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Myths and Legends (Story Library)",
        "Authors": "By Horowitz, Anthony and Mosley, Francis (ILT)",
        "Description": "Thirty-five ancient myths and legends, including lesser-known tales from Polynesia, North and South America, the Far East, Europe, and Africa, as well as some of the best stories from Greece, are gathered together in this far-ranging anthology of the tragedies and triumphs of the ancient world.",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "10.95",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The World of the Pharaohs: A Complete Guide to Ancient Egypt",
        "Authors": "By Hobson, Christine and Logan, Thomas J.",
        "Description": "Christine Hobson's invaluable guide to the history, people and archaeology of ancient Egypt has now been reprinted again. Illustrations, charts, chronoolgies support the detailed and informative discussions about many of Egypt's most important sites and archaeologists, all aimed at helping the visitor to make the most from their visit. An enthusiastic foreword by T G James from the British Museum praises Hobson for providing ` the information and confidence which will make a visit to Egypt a truly enriching experience'. Full of colour pictures and attractive tinted drawings.",
        "Category": " Social Science , Archaeology",
        "Publisher": "Thames and Hudson",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "The Iraq Study Group Report: The Way Forward - A New Approach",
        "Authors": "By Iraq Study Group, Baker, James A. Iii, and Hamilton, Lee H.",
        "Description": "On March 15, 2006, members from both parties in Congress supported the creation of the bipartisan Iraq Study Group to review the situation on the ground and propose strategies for the way forward. For more than eight months, the Study Group met with military officers, regional experts, academics, journalists, and high-level government officials from America and abroad. Participants included George W. Bush and members of his cabinet; Bill Clinton; Jalal Talabani; Nouri Kamal al-Maliki; Generals John Abizaid, George Casey, and Anthony Zinni; Colin Powell; Thomas Friedman; George Packer; and many others. This official edition contains the Group’s findings and proposals for improving security, strengthening the new government, rebuilding the economy and infrastructure, and maintaining stability in the region. It is a highly anticipated and essential step forward for Iraq, America, and the world.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Blackwater: A Novel",
        "Authors": "By Ekman, Kerstin and Tate, Joan (TRN)",
        "Description": "On Midsummer's Eve, 1974, Annie Raft arrives with her daughter Mia in the remote Swedish village of Blackwater to join her lover Dan on a nearby commune.  On her journey through the deep forest, she sumbles upon the site of a grisly double murder--a crime that will remain unsolved for nearly twenty years, until the day Annie sees her grown daughter in the arms of one man she glimpsed in the forest that eerie midsummer night.Like Gorky Park and Smilla's Sense of Snow, Blackwater is a unique trhiller in which the hearts and minds of the characters are as strikingly compelling as the exotic northern landscape that envelops them.",
        "Category": " Fiction , Psychological",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "The Cross: An Anthology (Nelson's Anthology)",
        "Authors": "By Thomas Nelson",
        "Description": "Nelson's Anthology Series is a collection of poems, writings, and various excerpts from leading authors worldwide.Classic Authors like T.S. Eliot , O. Henry, Dostoyevsky, and L'Engle have written poems, short stories and novels on this event. Contemporary Christian authors have also penned tomes about the death of Jesus: Max Lucado, Charles Swindoll, and Beth Moore.With quotes, hymns, excerpts, and more, this anthology will be a complete volume about the event of the Cross. From both the writings of both secular and Christian writers, the reader will experience how the death of Christ has impacted the world throughout the centuries!FEATURES:Beautiful embossed 3-piece bound hardcover with dust jacketRibbon markerJagged-edged paper, giving it a classic feelEvent order allows for a great personal devotional during EasterFUTURE TITLES:The Miracles: An Anthology (August 2003)The Resurrection: An Anthology (January 2004)COMPANION TITLE:The Incarnation: An AnthologyISBN: 0-7852-4928-1In-Store Date: October 1, 2002",
        "Category": " Religion , Christianity , Literature & the Arts",
        "Publisher": "Nelson Reference & Electronic Pub",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "God's Promises for Your Every Need",
        "Authors": "By Countryman, Jack and Gill, A. (COM)",
        "Description": "There's nothing that sets our minds and hearts at ease like the promises of God.In the best-selling God's Promises line--over 15 million sold--God's Promises for Your Every Need offers comfort and hope found only in God's Word. No matter what your situation, God has a promise for you!",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "God's Promises for Every Day",
        "Authors": "By Word Publishing and Gill, A. (CON)",
        "Description": "Here is help and support when you need it-immediate, helpful answers to your daily challenges.",
        "Category": " Religion , Biblical Reference , Quotations",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Aladdin and Other Favorite Arabian Nights Stories (Dover Children's Thrift Classics)",
        "Authors": "By Kliros, Thea (ILT) and Smith, Philip (EDT)",
        "Description": "The group of stories known as The Arabian Nights or The Thousand and One Nights is believed to have originated in the East during the early Middle Ages. The tales first appeared in a Western translation in France in 1704. This selection of favorite Arabian Nights stories, with new illustrations by Thea Kliros, features a multitude of colorful characters — devious magicians, monstrous giants, lovely princesses, and steadfast suitors — caught up in exciting adventures that take them to faraway lands.The six classics included here are \"Aladdin and the Wonderful Lamp,\" \"Ali Baba and the Forty Thieves,\" \"Abou Hassan, or, The Sleeper Awakened,\" \"The Seven Voyages of Sinbad the Sailor,\" \"Camaralzaman and Badoura,\" and \"The Enchanted Horse.\" With this book as their guide, children can journey to the enchanted world of the Arabian Nights and enjoy the same time-honored tales that have enthralled readers and listeners for centuries.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Arab Historians of the Crusades",
        "Authors": "By GABRIELI, FRANCESCO",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Dorset Pr",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "ESSENTIALS OF PHILOSOPHY: The Basic Concepts of the World's Greatest Thinkers",
        "Authors": "By Mannion, James",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Kiss: Lovers' Quotations and Romantic Paintings (Assorted Love Themes)",
        "Authors": "By Exley, Helen (EDT)",
        "Description": "",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Facts on the New Age Movement (The Anker Series)",
        "Authors": "By Ankerberg, John and Weldon, John",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "My Country 'tis of Thee",
        "Authors": "By Germany, Rebecca",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Mothers (Mini Square Books)",
        "Authors": "By Exley, Helen and Clarke, Juliette",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Messiah Highlights and Other Christmas Music",
        "Authors": "By Willcocks, David",
        "Description": "Selections fo Christmas choral music and carols, illustrated with classic paintings from the Metropolitan Museum of Art",
        "Category": " Music , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Legs Benedict:: A Bed-And-breakfast Mystery (Bed-and-Breakfast Mysteries)",
        "Authors": "By Daheim, Mary",
        "Description": "A week of \"mayhem-as-usual\" at Hillside Manor kicks off with the arrival of a mysterious \"Mr. Smith\" and his floozie \"Mrs.\" from New York City—and it accelerates into chaos when Mr. Smith himself kicks off, a victim of the foulest of plays. Hostess Judith McMonigle Flynn is shocked to learn that her now-defunct roomer was actually \"Legs\" Benedict—hit man for the notorious Ronzini Family—and that virtually every other guests at her B&B had good reason to want Legs broken. Judith's policeman-hubby Joe is understandably peeved that homicide happened (again!) under his own roof. And when the FBI moves in—more interested in nabbing a Nazi nutcase than a malicious mobster murderer—the local cops clear out, leaving Judith, Joe and irrepressible cousin Renie to find out who whacked the wiseguy before the hits keep coming.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Slang: The Topical Dictionary of Americanisms",
        "Authors": "By Dickson, Paul",
        "Description": "Unlike most slang dictionaries that list entries alphabetically, Slang takes on modern American English one topic at a time, from \"auctionese\" to \"computerese\", the drug trade and sports slang. Slang was originally published by Pocket Books in 1990 in paperback (ISBN 0671672517, out of print) and revised in 1998 in hardcover and paperback (ISBN 0671549200 and 0671549197; hc out of print soon after publication, pb in print until 2005). The new Slang has 50% new material, including new chapters on slang associated with work cubicles, gaming, hip hop, and coffeehouses. Dickson brings slang into the twenty-first century with such blogger slang as TMPMITW, which stands for \"the most powerful man in the world\" (the president).  Whether you want to be privy to the inside banter of the boardroom, backroom or the Washington Beltway, Slang is an indispensable resource, and a lot of fun. Slang is evidence that the spoken language is continually changing to meet new needs for verbal expressions, tailored to changing realities and perceptions.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Walker Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Tempest (No Fear Shakespeare) (Volume 5)",
        "Authors": "By Shakespeare, William and Crowther, John (EDT)",
        "Description": "Read Shakespeare’s plays in all their brilliance—and understand what every word means!   Don’t be intimidated by Shakespeare! These popular guides make the Bard’s plays accessible and enjoyable.Each No Fear guide contains:The complete text of the original playA line-by-line translation that puts the words into everyday languageA complete list of characters, with descriptionsPlenty of helpful commentary",
        "Category": " Study Aids , Book Notes",
        "Publisher": "Sparknotes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Cooking Fresh from the Mid-Atlantic: Tantalizing Recipes, Famous Chefs, and Conversations",
        "Authors": "By McManus, Fran, Rickard, Wendy, Pouillon, Nora (INT), Yonkers, Ann Harvey (INT), and Kunstler, James Howard (FRW)",
        "Description": "More than 130 recipes from the region¬?s 27 best chefs, handpicked for their commitment to the quality and flavor that small-scale, local farms have to offer.",
        "Category": " Cooking , Regional & Ethnic , American , Middle Atlantic States",
        "Publisher": "Eating Fresh Publications",
        "Price Starting With ($)": "7.95",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Next Year in Jerusalem: 3000 Years of Jewish Stories (Picture Puffins)",
        "Authors": "By Waldman, Neil (ILT) and Schwartz, Howard",
        "Description": "A lavishly illustrated collection of eleven timeless stories, folktales, and legends celebrates the unique spirit of the city of Jerusalem, in a celebration of the 50th anniversary of Israel. Reprint.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "What Do You Say, Dear?",
        "Authors": "By Joslin Sesyle",
        "Description": "What do you say when:You bump into a crocodile on a crowded city street?A nice gentleman introduces you to a baby elephant?The Queen feeds you so much spaghetti that you don’t fit in your chair anymore?This is the funniest book of manners you’ll ever read!",
        "Category": " Juvenile Fiction , Social Themes , Manners & Etiquette",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Better Homes and Gardens Second Storybook",
        "Authors": "By Betty O'Connor",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Publishing Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "America's Struggle for Leadership in Technology (English and French Edition)",
        "Authors": "By Derian, Jean-Claude",
        "Description": "Derian (science adviser to the French government) presents an outside perspective on the state of high technology in America. Contrasting US industries with those of Europe and the Far East, he identifies the issues that must be addressed if the US is to retain a leadership role in technology. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Business & Economics , General",
        "Publisher": "Mit Pr",
        "Price Starting With ($)": "5.98",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "The Power of Perimenopause : A Woman's Guide to Physical and Emotional Health During Perimenopause",
        "Authors": "By Bender, Stephanie Degraff and Colbert, Treacy",
        "Description": "The perimenopausal years can start as early as age thirty-five and last for up to ten years. This transitional period in a woman's life has often been misdiagnosed or ignored. Now Stephanie Bender, an expert in women's hormonal health, sounds a wake-up call for the confusing years before menopause, which require special emotional, dietary, and health guidance.The Power of Perimenopause explains how symptoms such as irregular cycles, night sweats and insomnia, decreased libido, memory lapses, and mood swings can be traced to fluctuating hormones. It gives detailed recommendations on how to use both conventional and alternative approaches to lessen symptoms, including the most up-to-date research and new treatments. Bender also goes beyond medical advice to show women how all facets of their lives, from diet to attitude to lifestyle, can be transformed to make this an exciting and productive phase. Perimenopause is a time when women can reconsider their beliefs and priorities with newfound wisdom--perhaps discarding outmoded images of female beauty and examining their relationships with lovers and family on a deeper level. The Power of Perimenopause explores this neglected age with practical ways to enhance the quality of all areas of women's lives.From the Trade Paperback edition.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Crown Archetype",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Empires of the Mind: Lessons to Lead and Succeed in a Knowledge-Based World",
        "Authors": "By Waitley, Denis",
        "Description": "Empires of the Mind is a revolutionary book that explains why standard management practices, job descriptions, and career tracks are obsolete. In order to succeed, individuals, at every level, must reinvent themselves as their companies and institutions restructure the way they function. While there are many current theories on organizational management and team productivity, there is a scarcity of wisdom to help each of us adapt and thrive as we ride the tumultuous wave of societal change. Empires of the Mind is the first book ever to offer answers to men and women interested in \"reengineering\" themselves as well as their corporations.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Passover Parrot",
        "Authors": "By Kahn, Katherine (ILT) and Zusman, Evelyn",
        "Description": "Relates what happens when the family parrot steals the afikomen at the Passover seder.",
        "Category": " Juvenile Fiction , Religious , General",
        "Publisher": "Kar-Ben Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "Celebrate: A Book of Jewish Holidays (All Aboard Book)",
        "Authors": "By Weissman, Bari (ILT) and Gross, Judith",
        "Description": "An overview of all the Jewish holidays from Tu Bishvat to Hanukkah, complete with Hebrew pronunciation keys, explains why the days are celebrated and how each tradition developed",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Other, Religious",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Words of Wisdom",
        "Authors": "By Mick Farren",
        "Description": "",
        "Category": "",
        "Publisher": "Chrysalis",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    }
]