[
    {
        "Title": "France (Eyewitness Travel Guides)",
        "Authors": "By Bailey, Rosemary (EDT)",
        "Description": "Eyewitness Travel Guide: France will lead you straight to the best attractions the country has to offer. Packed with photographs, illustrations and detailed maps, it will help you to discover France region-by region; from Champagne in the north to the sun-blessed corner of Provence and the Cote d'Azur. Eyewitness Travel Guide: France provides insider tips every visitor needs, from the world-class architecture of the Louvre, to the island-life of Corsica and rolling vineyards of Bordeaux — with comprehensive listings of the best hotels, chateaux, resorts, restaurants, cafes and nightlife in each region for all budgets. There are 3D cutaways and floor-plans of all the must-see sites, plus street-by-street maps of the major cities and towns.Eyewitness Travel Guide: France explores the culture, history, architecture and art of this charming country, with a perfect balance between thriving cities and gorgeous countryside, high fashion and rustic charm.",
        "Category": " Travel , Europe , France",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Lonely Planet France (Country Guide)",
        "Authors": "By Robinson, Daniel, Fallon, Steve, Williams, Nicola, Berry, Oliver, and Le Nevez, Catherine",
        "Description": "Complemented by easy-to use, reliable maps, helpful recommendations, authoritative background information, and up-to-date coverage of things to see and do, these popular travel guides cover in detail countries, regions, and cities around the world for travelers of every budget, along with extensive itineraries, maps with cross-referencing to the text, \"Top 10\" and \"Top 5\" lists, and other practical features.",
        "Category": " Travel , Europe , France",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.81",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "National Geographic Photography Field Guide: Travel (National Geographic Photography Field Guides)",
        "Authors": "By Caputo, Robert",
        "Description": "For more than 100 years the name National Geographic has been synonymous with excellence in photography. Some of the finest photographers in the world have traveled the globe capturing memorable images for the pages of the Society's magazines and publications. Now you can learn how National Geographic photographers make those outstanding pictures in this remarkable guidebook.  National Geographic Contributing Photographer Robert Caputo shares his secrets to making great travel photographs in this engaging and informative guide.  ? Hoe to capture a sense of place  ? Tips for getting the most out of short or long trips  ? What equipment to use to get best results  ? How to turn your snapshots into professional-looking travel photographs  ? Photography Web sites",
        "Category": " Photography , Subjects & Themes , General",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Best Ever Three & Four Ingredient Cookbook",
        "Authors": "By Jenny White",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Curse of Snake Island (Pirate School #1)",
        "Authors": "By James, Brian and Zivoin, Jennifer (ILT)",
        "Description": "Hoping to be taken seriously by Rotten Tooth, who is supposed to be training them to be pirates, nine-year-old Pete leads his friends in an attempt to beat the grown-ups in finding the treasure buried on Snake Island and stealing it from the giant snake that guards it.Hoping to be taken seriously by Rotten Tooth, who is supposed to be training them to be pirates, nine-year-old Pete leads his friends in an attempt to beat the grown-ups in finding the treasure buried on Snake Island and stealing it from the giant snake that guards it.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Midnight Fugue: A Dalziel and Pascoe Mystery",
        "Authors": "By Hill, Reginald",
        "Description": "Reginald Hill, award-winning author of The Price of Butcher’s Meat and Death Comes for the Fat Man, returns with Midnight Fugue, a riveting new crime novel featuring Yorkshire coppers Dalziel and Pascoe as they tackle the case of a detective who went missing seven years ago under suspicious circumstances. Taking place within the space of a single October Sunday and alternating between Mid-Yorkshire and London, Midnight Fugue is a riveting, complex mystery that builds to a dramatic, twisting conclusion.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Roadfood: The Coast-to-Coast Guide to 700 of the Best Barbecue Joints, Lobster Shacks, Ice Cream Parlors, Highway Diners, and Much, Much More",
        "Authors": "By Stern, Jane and Stern, Michael",
        "Description": "For road warriors and armchair epicures alike, the seventh edition of Roadfood is the key to finding some of the tastiest treasures in the United States. The indispensable companion for savvy travelers nationwide, Roadfood is now bigger and better than ever. Totally revised and updated, the seventh edition covers over 700 of the country’s best local eateries, including more than 200 brand new listings along with up-to-date descriptions of old favorites. An extended tour of the most affordable, most enjoyable dining options along America’s highways and back roads, Roadfood offers enticing, satisfying meal-time alternatives for chain restaurant–weary travelers. The Sterns provide vivid descriptions and clear regional maps that direct people to the best lobster shacks on the East Coast; the ultimate barbecue joints in the South; the most sizzling steakhouses in the Midwest; and dozens of top-notch diners, hotdog stands, ice cream parlors, and other terrific spots to stop for a bite countrywide.",
        "Category": " Travel , United States , General",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "DK Eyewitness Travel Guide: Spain",
        "Authors": "By Inman, Nick, Gallagher, Mary-Ann, Quintero, Josephine",
        "Description": "DK Eyewitness Travel Guide: Spain is your indispensable guide to this beautiful part of the world. The fully updated guide includes unique cutaways, floor plans, and reconstructions of the must-see sights, plus street-by-street maps of key cities and towns. The also is packed with photographs and illustrations leading you straight to the best attractions this country has to offer.The uniquely visual DK Eyewitness Travel guide will help you to discover everything region by region, from local festivals and markets to day trips around the countryside. Detailed listings will guide you to the best hotels, restaurants, bars, and shops for all budgets. Detailed transportation and other practical information will help you to get around by train, bus, or car.With insider tips and essential local information, DK Eyewitness Travel Guide: Spain will help you explore every corner of Spain effortlessly.",
        "Category": " Travel , Europe , Spain & Portugal",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "6.2",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Italy: A Culinary Journey",
        "Authors": "By Hewitt, Gillian (EDT)",
        "Description": "Regional recipes for soups, salads, appetizers, meat, poultry, seafood, breads, vegetables, and desserts are accompanied by lists of local wines",
        "Category": " Cooking , General",
        "Publisher": "Collins Pub San Francisco",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "The Girl from Junchow (A Russian Concubine Novel)",
        "Authors": "By Furnivall, Kate",
        "Description": "An epic journey of love and discovery from the national bestselling author of The Russian Concubine and The Red Scarf. China, 1929. For years Lydia Ivanova believed her father was killed by the Bolsheviks. But when she learns he is imprisoned in Stalin-controlled Russia, the fiery girl is willing to leave everything behind- even her Chinese lover, Chang An Lo. Lydia begins a dangerous search, journeying to Moscow with her half-brother Alexei. But when Alexei abruptly disappears, Lydia is left alone, penniless in Soviet Russia. All seems lost, but Chang An Lo has not forgotten Lydia. He knows things about her father that she does not. And while he races to protect her, she is prepared to risk treacherous consequences to discover the truth.",
        "Category": " Fiction , Political",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "The Ultimate Book of Optical Illusions",
        "Authors": "By Seckel, Al",
        "Description": "Prepare to be amazed! Inside the covers of this incredible, colorful collection are hundreds of the world’s most powerful optical illusions. They’re beautiful to behold, and stunning in their trickery. Some of the mind-boggling images seem to spring into action, vibrating, pulsing, and spinning like a hula hoop. Other ambiguous illusions feature two subjects in one: the fun is in finding them both in the single picture—including a mouse playing hide and seek in a cat’s face and a strange desert mirage where palm trees imperceptibly morph into camels. And still more, like “The Impossible Terrace,” which couldn’t exist off the page: just try to figure out if you’re viewing the space from above or below. Every one is astonishing.",
        "Category": " Art , General",
        "Publisher": "Puzzlewright",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Freshwater Aquariums (Animal Planet® Pet Care Library)",
        "Authors": "By Boruchowitz, David E.",
        "Description": "",
        "Category": " Pets , Fish & Aquariums",
        "Publisher": "T.F.H. Publications, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Quiet Strength: The Principles, Practices, and Priorities of a Winning Life",
        "Authors": "By Dungy, Tony and Whitaker, Nathan",
        "Description": "2008 Retailer's Choice Award winner!Tony Dungy's words and example have intrigued millions of people, particularly following his victory in Super Bowl XLI, the first for an African American coach. How is it possible for a coach—especially a football coach—to win the respect of his players and lead them to the Super Bowl without the screaming histrionics, the profanities, and the demand that the sport come before anything else? How is it possible for anyone to be successful without compromising faith and family? In this inspiring and reflective memoir, now updated with a new chapter, Coach Dungy tells the story of a life lived for God and family—and challenges us all to redefine our ideas of what it means to succeed. The softcover edition of this #1 New York Times best-seller includes a new chapter! In it, Coach reflects on the 2007 football season and last year's successful hardcover release of Quiet Strength. Also features a foreword by Denzel Washington and a 16-page color-photo insert. Over 1 million in print!",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "Tyndale Momentum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Walt Disney's Classic Dumbo",
        "Authors": "By Slater, Teddy, Dias, Ron, and Guenther, Annie",
        "Description": "Recounts the tale of Dumbo, the little elephant who turns his unusual feature--huge ears--into an asset when he learns to fly.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Discovering Dinos",
        "Authors": "By Phidal Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Phidal Publishing Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Day I Had to Play With My Sister (My First I Can Read)",
        "Authors": "By Bonsall, Crosby Newell",
        "Description": "Older brother thinks he knows the rules to hide-and-seek. But little sister has her own idea of how to play. And the resulting confusion, compounded by a lively dog, is hilarious. Now available for the first time in full-color and reformatted as a My First I Can Read Book, Crosby Bonsall's appealing story and simple text will delight emergent readers.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Fox at School (Penguin Young Readers, Level 3)",
        "Authors": "By Marshall, James (ILT) and Marshall, Edward",
        "Description": "Starring   in the school play means hard work, and being left in charge means keeping   the class under control. Fox thinks there's nothing to it. And, when he's put   to the test, will Fox retreat? Never!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "5 Steps to a 5 AP Calculus AB - BC, Second Edition (5 Steps to a 5 on the Advanced Placement Examinations Series)",
        "Authors": "By Ma, William and Wheater, Carolyn (CON)",
        "Description": "The AP AB/BC calculus exams have the largest enrollment of any AP exam. This new edition of the AB/BC guide has been expanded to cover both the AB and BC calculus tests and includes key updates on all the material covered in the latest revision of the exams.",
        "Category": " Study Aids , Advanced Placement",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Insight Guide Brazil (Discovery Channel)",
        "Authors": "By Ladle, Jane",
        "Description": "A joint publication by Insight Guides and the Discovery Channel, this travel guide to Brazil covers history, culture, the arts, places of interest, and travel tips on planning, getting around, lodging, dining, activities, shopping, and language. It focuses on Brazilian food, architecture, African influence, the Amazon, Carnival, and soccer as well as incorporating short descriptions of the rainforest, motor racing, television, Rio shantytowns, the lost city of El Dorado, and wine country. Color photos and maps are interspersed throughout. Annotation ©2006 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Travel , South America , General",
        "Publisher": "APA",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "The Eating Well Recipe Rescue Cookbook: Healthy Versions of Favorite Recipes from the Magazine of Food and Health",
        "Authors": "By Dorschner, Cheryl (EDT) and Jamieson, Patricia (EDT)",
        "Description": "Provides healthier versions of traditional recipes for breakfasts, breads, muffins, appetizers, soups, salads, dressings, vegetables, pizzas, pasta, meat, poultry, fish, seafood, and desserts",
        "Category": " Cooking , Reference",
        "Publisher": "Eating Well Books",
        "Price Starting With ($)": "6.56",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Football legends of all time",
        "Authors": "By Carroll, Bob",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Physiology of Sport and Exercise",
        "Authors": "By Wilmore, Jack H. and Costill, David L.",
        "Description": "",
        "Category": " Medical , Physiology",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "9.01",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Legacy of the Dog: The Ultimate Illustrated Guide to Over 200 Breeds",
        "Authors": "By Yamazaki, Tetsu and Kojima, Toyoharu",
        "Description": "Legacy of the Dog is the finest, most comprehensive photographic guide to dog breeds ever published. The beauty and majesty of over 200 breeds are dramatically presented in more than 900 full-color images by acclaimed photographer Tetsu Yamazaki, whose superb work also appeared in Chronicle Books' best-selling volume, Legacy of the Cat.Page after page features prize-winning dogs of every shape, size, and color, including all 134 breeds currently recognized by the American Kennel Club, as well as a fascinating selection of breeds rarely seen in other dog guides. A glossary and an index round out this invaluable treasury for pet enthusiasts and professional dog breeders alike.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Weather (Eyewitness Books, No. 28)",
        "Authors": "By Cosgrove, Brian, Shone, Karl (ILT), and Percival, Keith (ILT)",
        "Description": "Full-color photographs. Find out the causes of thunder, lightning, hurricanes, and tornadoes; how clouds are formed and what each kind portends; and why weather forecasters are seldom 100 percent right. \"The imaginative use of photographs helps to clarify many of the concepts.\"School Library Journal.",
        "Category": "",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Better Homes and Gardens Pork, Sausage and Ham Cookbook",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corporation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1979"
        }
    },
    {
        "Title": "Orchids Simplified: An Indoor Gardening Guide",
        "Authors": "By Jaworski, Henry",
        "Description": "This cleary written and lavishly photographed guide provides all the know-how and inspiration needed to begin cultivating brillant blooms and discovering the enchanting world of Orchids.",
        "Category": " Gardening , Flowers , Orchids",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Everyday Menus: 281 Deliciously Simple Weeknight Recipes (Southern Living)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "If at First You Do Not See",
        "Authors": "By Brown, Ruth",
        "Description": "\"The story hinges on a caterpillar who wanders off looking for something to eat,  only to discover that every toothsome morsel he finds is something else.... Brown’s radiantly hued paintings have been executed with an artfulness that one  must marvel at and admire.\" --Publishers Weekly",
        "Category": " Juvenile Fiction , Concepts , Senses & Sensation",
        "Publisher": "Henry Holt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "The Book of IQ Tests",
        "Authors": "By Carter, Philip J. and Russell, Kenneth A.",
        "Description": "Think you’re smart? Prove it! Twenty-five brain-stumping IQ quizzes, featuring wordplay, diagrams, numerical challenges, and more, provide an intriguing challenge. Here’s just one sample of what’s in store: Solve the clues to find four six-letter words. The same three letters are represented by XYZ in each word.X Y Z _ _ _ clue : fleet_ X Y Z _ _ clue : heat_ _ X Y Z _ clue : beguiles_ _ _ X Y Z clue : remove defensive capabilityAnswer:2. Armada, warmth, charms, disarm. XYZ = ARM",
        "Category": " Games & Activities , Quizzes",
        "Publisher": "Main Street",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Creative Cooking For Two (Creative cooking series)",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Better Homes and Gardens Candy",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Explains basic candy-making procedures and shares recipes for fudges, caramels, pralines, nougats, taffies, brittles, toffees, hard candies, licorice, marshmallows, and gumdrops",
        "Category": " Cooking , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Storms Of Perfection: In Their Own Words",
        "Authors": "By Andrews, Andy",
        "Description": "",
        "Category": "",
        "Publisher": "Lightning Crown Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Beast Feast: Poems & Paintings",
        "Authors": "By Florian, Douglas",
        "Description": "In this hilarious collection of twenty-one original animal poems and paintings, the animals are out in all their finned, furry, and feathered glory. From lobsters to rheas to fireflies, kiwis to camels to chameleons, here’s a beast for everyone to love!",
        "Category": " Juvenile Nonfiction , Poetry , General",
        "Publisher": "Voyager Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Successful Coaching - 3rd Edition",
        "Authors": "By Martens, Rainer",
        "Description": "",
        "Category": " Sports & Recreation , History",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "7.42",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Moving Into The Future: National Standards for Physical Education",
        "Authors": "By National Association for Sport and Physical Education, Sport, National Association for, Education, Physical",
        "Description": "An essential tool for every quality physical education program for Kindergarten through 12th grade, this text establishes content standards that clearly identify consensus statements on what students should know and be able to do as a result of a quality physical education program. The second edition, based on input from practitioners who have been using the standards in their programs for the past eight years, reflects the current thought and the most recent research in physical education. The National Association for Sport and Physical Education seeks to enhance knowledge and professional practice in sport and physical activity through scientific study and dissemination of research-based and experiential knowledge to members and the public.",
        "Category": " Education , Physical Education",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Beliefs That Changed the World: The History and Ideas of the Great Religions",
        "Authors": "By Bowker, John",
        "Description": "",
        "Category": " Religion , History",
        "Publisher": "Quercus",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Usborne Book of Papier Mache (How to Make Series)",
        "Authors": "By Gibson, Ray",
        "Description": "Provides instructions for making papier mache, and suggests a variety of projects",
        "Category": " Juvenile Nonfiction , Technology , Machinery & Tools",
        "Publisher": "Edc Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Watch Out for Jabba the Hutt! (Star Wars: Clone Wars; DK Readers, Level 1: Beginning to Read)",
        "Authors": "By Beecroft, Simon",
        "Description": "Since the first time we heard Luke Skywalker ask Obi-Wan Kenobi \"You fought in the Clone Wars!?\" in Episode IV: A New Hope, fans the world over have been wondering exactly what the Clone Wars were and what clones in combat would look like. On August 15th, 2008, with the theatrical release of Star Wars: The Clone Wars, much will be explained. The Clone Wars take place between Episode II: Attack of the Clones and Episode III: Revenge of the Sith. Lucasfilm is now bringing the wars to life in an all-new CGI animated series.The theatrical release will launch this groundbreaking computer-generated animated series, which will then debut on Cartoon Network and TNT in the fall. New characters like female Padawan Ahsoka Tano join old favorites Anakin Skywalker, Yoda, Count Dooku, General Grievous, and others as the Jedi cross lightsabers with the dark side yet again.",
        "Category": " Juvenile Fiction , Science Fiction , General",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "The Rough Guide to Mandarin Chinese (a dictionary phrasebook)",
        "Authors": "By Rough Guides (EDT)",
        "Description": "",
        "Category": " Foreign Language Study , Chinese",
        "Publisher": "Rough Guides",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Love Walked Among Us: Learning To Love Like Jesus",
        "Authors": "By Miller, Paul E.",
        "Description": "Nowhere was the vitality of Jesus more visible than in His love--compassionate, honest, powerful, humble, and sacrificial.Get to know Jesus, observe His life and His love as they unfold in the gospel accounts of Matthew, Mark, Luke, and John.Combined with author Paul Miller’s own life stories, Love Walked Among Us will encourage you to imitate Jesus’ way of loving people in your relationships and community. Become more like Jesus and grow in your relationship with God.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "NavPress",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Calling Doctor Amelia Bedelia (I Can Read Level 2)",
        "Authors": "By Sweat, Lynn (ILT) and Parish, Herman",
        "Description": "Funny bonesThe doctor is out! But Amelia Bedelia is ready to help a crowd of grouchy patients. Along the way she doses out some of the best medicine of all -- laughter, of course!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Meet Julie",
        "Authors": "By Hunt, Robert (ILT), McDonald, Megan, McAliley, Susan (ILT), and Sebok, George (ILT)",
        "Description": "In 1974, after Julie's parents divorce, she moves to a new San Francisco neighborhood where the school does not have a girls' basketball team, so she fights for the right to play on the boys' team.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "American Girl",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Holiday celebrations",
        "Authors": "By Publications International, Eds.",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "7.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Mother-Daughter Book Club",
        "Authors": "By Frederick, Heather Vogel",
        "Description": "The book club is about to get a makeover.... Even if Megan would rather be at the mall, Cassidy is late for hockey practice, Emma's already read every book in existence, and Jess is missing her mother too much to care, the new book club is scheduled to meet every month.   But what begins as a mom-imposed ritual of reading Little Women soon helps four unlikely friends navigate the drama of middle school. From stolen journals, to secret crushes, to a fashion-fiasco first dance, the girls are up to their Wellie boots in drama. They can't help but wonder: What would Jo March do?   Acclaimed author Heather Vogel Frederick will delight daughters of all ages in a novel about the fabulousness of fiction, family, and friendship.",
        "Category": " Juvenile Fiction , Books & Libraries",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Betty Crocker One-Dish Meals: Casseroles, Skillet Meals, Stir-Fries and More for Easy, Everyday Dinners (Betty Crocker Books)",
        "Authors": "By Crocker, Betty (EDT) and Losleben, Heidi (EDT)",
        "Description": "Make mealtime easy and delicious with one-dish recipes from Betty Crocker!From a hearty casserole to a sizzling stir-fry, one-dish meals are the ultimate fix-it-and-forget-it solution for busy cooks on the go. This book packs flavor and convenience into more than 300 all-in-one recipes that will help you put variety on the menu every day of the week. You'll find a whole range of tempting soups, stews, salads, pizzas, foil-packet dishes and more to explore. With tantalizing choices like Pizza Alfredo, Tuna Twist Casserole and Spicy Black Bean Barbecue Chili to choose from, who needs sides? And you'll save energy on shopping, prepping and cleanup, too. Home cooking has never been so stress-free.* Make Chicken Pot Pie and other classic dishes, or try new favorites like Greek Pita Pizzas* Pick up valuable recipe tips, from cooking and shopping how-to's to do-aheads, substitutions, serve-with ideas and storage advice.* Make the most of slow-cooker options and grilling recipes to put great food on the table year-round.* Looking for inspiration? Check out handy recipe lists for kid-friendly, potluck, brunch and casual entertaining ideas.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Betty Crocker",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Concise Rules Of APA Style (APA, Concise Rules of APA Style)",
        "Authors": "By AMERICAN PSYCHOLOGICAL ASSOCIATION",
        "Description": "Where do you put the notes to a table? What is the difference between \"g\" and \"g\"? How do you cite a work discussed in a secondary source? Along with answering these and other questions that always seem to arise about six minutes before deadline, this reference also gives information on organizing ideas into an acceptable form and reducing bias in language. Compiled from the fifth edition of the Publication Manual of the American Psychological Association, this pocket guide includes information on punctuation (for those who confuse slashes with hyphens), capitalization (for those who confuse newtons and watts with Newton and Watt), spelling (for all of us), italicizing, and abbreviating, as well as advice on presenting statistics, tables, figures, quotations, citations, footnotes and appendices (it prefers \"appendixes\"). It also provides very helpful reference examples, including those from electronic and audiovisual media, a cross-reference to the publication manual and a checklist for manuscript submission. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Social Science , Reference",
        "Publisher": "Amer Psychological Assn",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Thanks to Josefina (American Girls Short Stories)",
        "Authors": "By Graef, Renee (ILT), Tripp, Valerie, Tibbles, Jean-Paul (ILT), McAliley, Susan, McAliley, Susan (ILT), and Graef, Renee",
        "Description": "In 1824 New Mexico, Josefina and her sisters argue as they weave, until Josefina thinks of a way to make their work more fun, in a story that includes historical notes on blanket weaving in New Mexico in 1824.",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Charming Ponies: A Pony Promise",
        "Authors": "By Szymanski, Lois",
        "Description": "A PONY PROMISE A special family of horses is about to change Tiffany's life.  Tiffany Clark has to keep her big brother's family secret and it's not easy. Luckily she can confide in Windy, the pinto mare at Mr. Paul's horse farm. But when Windy and a mare named Stormy give birth within days of each other, there's a problem. It's going to take a miracle for Stormy's foal to survive, and nothing short of a horse adoption can save the day. Will Windy agree to raise another mare's foal?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Festival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "JELL-O Brand Fun and Fabulous Recipes (Favorite Recipes)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "General Foods Corporation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "English-Spanish/Spanish-English Medical Dictionary",
        "Authors": "By Rogers, Glenn T.",
        "Description": "Translates more than 15,000 commonly used medical, technical, common, and slang terms in both English and Spanish. Sample conversations covering history-taking for a number of medical conditions are shown in Spanish as it is spoken in the U.S. with English translation immediately following. This edition includes expanded patient histories and over 3,000 new terms.",
        "Category": " Medical , Dictionaries & Terminology",
        "Publisher": "McGraw-Hill Professional",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "The Seven Daughters of Eve: The Science That Reveals Our Genetic Ancestry",
        "Authors": "By Sykes, Bryan",
        "Description": "In 1994 Bryan Sykes was called in as an expert to examine the frozen remains of a man trapped in glacial ice in northern Italy for over 5000 years—the Ice Man. Sykes succeeded in extracting DNA from the Ice Man, but even more important, writes Science News, was his \"ability to directly link that DNA to Europeans living today.\" In this groundbreaking book, Sykes reveals how the identification of a particular strand of DNA that passes unbroken through the maternal line allows scientists to trace our genetic makeup all the way back to prehistoric times—to seven primeval women, the \"seven daughters of Eve.\"",
        "Category": " Science , Life Sciences , Genetics & Genomics",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Australia and New Zealand (Top 10 Wines)",
        "Authors": "By Gasnier, Vincent",
        "Description": "",
        "Category": " Antiques & Collectibles , Wine",
        "Publisher": "DK",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Animal Defenses: Based on the Television Series Wild, Wild World of Animals",
        "Authors": "By Tanner, Ogden",
        "Description": "Illustrates the many ways in which animals protect themselves from predators, discussing animal camouflage and concealment, bluffs and threats, group defense, flight, and fighting and including excerpts from exemplary animal stories",
        "Category": " Science , General",
        "Publisher": "Silver Burdett Pr",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "Mia (American Girl)",
        "Authors": "By Yep, Laurence",
        "Description": "Mia St. Clair is a ten-year-old girl  living in upstate New York. She has grown up playing ice hockey wit her three older brothers on the pond behind their house. Mia's got the skills and the scrappiness it takes to be a star hockey player, but she's tired of skating in her brothers' shadows and has decided to follow her heart and pursue figure skating instead. Does she have what it takes to grow and compete as a figure skaters?",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "American Girl",
        "Price Starting With ($)": "8.84",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Better Homes and Gardens New Complete Guide To Home Repair & Improvement",
        "Authors": "By Better Homes and Gardens Books (EDT)",
        "Description": "The largest home improvement manual on the market, includes 600 pages, 500 projects, and more than 3,000 full-color illustrations for home repairs and improvements.Organized in four large sections of subject matter to make the information easy to find, including: Inside Your Home, Outside Your Home, Your Home's Systems, and Basics You Should Know.This book is designed so readers can scan each page and quickly understand the scope of each project.Color bars located on the outer edge of each page designate each section to make it easy for readers to see where they are in the book.You'll Need boxes list the skills, time, and tools required to complete each project shown in the book.Material Matters features educate the reader about the pros and cons of different types of materials to use for the job.Helpful Hints features highlight the how-to wisdom of the Better Homes and Gardens® team of experts.",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Meredith Corp. / Better Homes and Gardens",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Bessie",
        "Authors": "By Albertson, Chris",
        "Description": "Considered by many to be the greatest blues singer of all time, Bessie Smith was also a successful vaudeville entertainer who became the highest-paid African-American performer of the roaring twenties. This book - a revised and expanded edition of the classic biography of this extraordinary artist - debunks many of the myths that have circulated since her untimely death in 1937.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Development Across the Life Span",
        "Authors": "By Feldman, Robert S.",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "8.19",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Help! I'm a Sunday School Teacher",
        "Authors": "By Johnston, Ray",
        "Description": "Yes, help is on the way--in this funny, yet extremely practical volume. Flannel graph-tested Sunday school veteran Ray Johnston offers empathy and understanding as he serves up 50 creative thoughts, tips, and ideas you can use to make Sunday school come alive, including: Letting students choose the content. How to use the element of surprise. How to tackle tough topics. Small can be beautiful. Keep your kids guessing. How to adapt curriculum for your kids. You (yes, you) can be creative. It's OK to have fun and many more! As an added bonus, Ray has included resources that you can use to improve your effectiveness, including a \"Pick Your Topics\" survey, a learning styles inventory, an active learning planning sheet, and much more. Whether you're teaching first graders or high schoolers, no matter what kind of church you're in, Ray's wit, wisdom, and practical ideas are just what you need to give your teaching that extra spark. You'll approach Sunday school in a whole new way (and even find yourself liking it!) after you've chuckled your way through Help! I'm a Sunday School Teacher!",
        "Category": " Religion , Christian Ministry , Youth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Bridge Basics: An Introduction to the Game",
        "Authors": "By McVey, Mary A.",
        "Description": "",
        "Category": "",
        "Publisher": "Ket Enterprise",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "Just Too Good to Be True: A Novel",
        "Authors": "By Harris, E. Lynn",
        "Description": "Harris serves up a treat that will capture and enchant audiences everywhere—a big, bold, and irresistible novel about football, family, and secrets.Brady Bledsoe and his mother, Carmyn, have a strong relationship. A single mother, faithful churchgoer, and the owner of several successful Atlanta beauty salons, Carmyn has devoted herself to her son and his dream of becoming a professional football player. Brady has always followed her lead, including becoming a member of the church’s \"Celibacy Circle.\" Now in his senior year at college, the smart, and very handsome, Brady is a lead contender for the Heisman Trophy and a spot in the NFL. As sports agents hover around Brady, Barrett, a beautiful and charming cheerleader, sets her mind on tempting the celibate Brady and getting a piece of his multimillion-dollar future—but is that all she wants from him, and is she acting alone? Carmyn is determined to protect her son. She’s also determined to protect the secret she’s kept from Brady his whole life. As things heat up on campus and Carmyn and Brady’s idyllic relationship starts to crumble, mother and son begin to wonder about the other—are you just too good to be true? A sweeping novel about mothers and sons, football and beauty shops, secrets and lies, JUST TOO GOOD TO BE TRUE has all the ingredients that have made E. Lynn Harris a bestselling author: family, friendship, faith, and love.",
        "Category": " Fiction , Family Life",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Ivy & Bean (Book 1)",
        "Authors": "By Barrows, Annie and Blackall, Sophie (ILT)",
        "Description": "The moment they saw each other, Bean and Ivy knew they wouldn't be friends. But when Bean plays a joke on her sister, Nancy, and has to hidequickIvy comes to the rescue, proving that sometimes the best of friends are people never meant to like each other. Vibrant characters and lots of humor make this a charmingand addictiveintroduction to Ivy and Bean.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Persistence of Memory (Den of Shadows)",
        "Authors": "By Atwater-Rhodes, Amelia",
        "Description": "Sixteen-year-old Erin Misrahe just wants to be like everyone else in her new school. But Erin has more to worry about than passing AP Chemistry or making friends. In times of stress, she has always been overcome by her alter ego, Shevaun, whose violent behavior wreaks havoc on those around her. Erin can never remember anything about these episodes, and she’s grateful to have been spared them for a while.But when a protective friend comes back into Erin’s life, he insists that Shevaun is a vampire who actually exists apart from Erin. Shevaun has dangerous allies, like the handsome witch Adjila—and they’re determined to sever Shevaun’s connection to Erin once and for all.",
        "Category": " Young Adult Fiction , Legends, Myths, Fables , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Duck & Goose, 1, 2, 3",
        "Authors": "By Hills, Tad and Hills, Tad (ILT)",
        "Description": "Learn basic counting concepts with the New York Times-bestselling odd couple Duck and Goose! All the favorite characters, including Bluebird and Thistle, return—this time to  introduce basic counting concepts. One goose. Two ducks. Three friends. As the characters  illustrate from numbers 1 to 10, children will love to follow along with the simple  text and all-new original art. A small trim size and Easter egg-colored art makes  this the perfect Easter basket stuffer for young children everywhere! And don't miss other books in the collection, including the picture books Duck & Goose and Duck, Duck, Goose, and the board books What's Up, Duck? and Duck & Goose Find a Pumpkin!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "Random House Studio",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Giant Hug",
        "Authors": "By Horning, Sandra and Gorbachev, Valeri (ILT)",
        "Description": "How do you give your granny a hug when she lives far away? Send it through the mail, of course! Owen’s hug travels across the country in a series of hilarious, sometimes awkward, always heartfelt embraces between animals of different shapes and sizes. Valeri Gorbachev’s adorable artwork pairs beautifully with Sandra Horning’s charming text, and makes for a fun, funny, and educational read-aloud. An unexpected twist at the end will delight readers and have kids asking for this book again and again.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Dragonfly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Anatomy of a Boyfriend (Anatomy of a... Series)",
        "Authors": "By Snadowsky, Daria",
        "Description": "After having no romance to speak of in all of her high school years, a teen girl discovers romance with a track star from across town--soon venturing into emotional and physical realms never before experienced. Reprint.",
        "Category": " Young Adult Fiction , Romance , General",
        "Publisher": "Ember",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Babymouse #9: Monster Mash",
        "Authors": "By Holm, Jennifer L., Holm, Matt, Holm, Jennifer L. (ILT), and Holm, Matt (ILT)",
        "Description": "NEW YORK TIMES bestselling and Newbery Honor winning author Jennifer Holm teams up with Matthew Holm to bring you a fully illustrated graphic novel series packed with humor and kid appeal—BABYMOUSE!    With multiple Children's Choice awards and over 1.7 million books in print, kids, parents, and teachers agree that Babymouse is perfect for fans of Junie B. Jones, Ivy and Bean, Big Nate, Dork Diaries, and the Ramona chapter books!It was a dark and scary Halloween. . . . This year, Babymouse is determined to have  the best Halloween costume and the best Halloween party ever. Will Babymouse be the  monster of her dreams? Will Felicia Furrypaws come to the party? And is that really the creature from the black lagoon living in Babymouse’s locker? Find out in Monster Mash—the 9th hilarious, action-packed installment of the beloved Babymouse graphic novel series!Here's what people are saying about Babymouse! The  Chicago Sun-Times: \"Move over, Superman, here comes  Babymouse!\" Starred Review, The Horn  Book: \"Nobody puts Babymouse in the corner!\"  Booklist: \"Cute, smart, sassy Babymouse is fun and funny, and this book, like its  predecessors, will draw reluctant readers as well as Babymouse fans.\"The Bulletin: \"An almost absurdly likeable  heroine.\"",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Max for President",
        "Authors": "By Krosoczka, Jarrett J.",
        "Description": "Max thinks that he would like to be class president.So does Kelly.But there can only be one president! Who will the class elect?Full of laughs and suspense, Max for President is a lively story of good sportsmanship—and a great way for kids to learn a little about elections, too!",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Dragonfly Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Ugly Guide to Things That Go and Things That Should Go But Don't (Uglydolls)",
        "Authors": "By Horvath, David and Kim, Sun-min",
        "Description": "It’s ugly out there! And to get around in such an Ugly world, you need a pretty Ugly vehicle. Sometimes it will go and sometimes it won’t, but that’s okay . . . because it’s Ugly! This guide to Ugly vehicles will give you the first-ever look at Babo’s Cookie Cruiser, Pony Ride 2000, Treading-Water Capris, Ox’s Coin Purse Mobile, Sailor Babo’s S.S. Uh-oh, and more. So pay close attention and watch out! Because if you ever happen to see an Ugly vehicle on the road, you’ll want to stay far, far away.",
        "Category": " Juvenile Fiction , Toys, Dolls & Puppets",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Spanking Shakespeare",
        "Authors": "By Wizner, Jake",
        "Description": "SHAKESPEARE SHAPIRO HAS ALWAYS hated his name. His parents bestowed it on him as some kind of sick joke when he was born, and his life has gone downhill from there, one embarrassing incident after another. Entering his senior year of high school, Shakespeare has never had a girlfriend, his younger brother is cooler than he is, and his best friend's favorite topic of conversation is his bowel movements.But Shakespeare will have the last laugh. He is chronicling every mortifying detail in his memoir, the writing project each senior at Shakespeare's high school must complete. And he is doing it brilliantly. And, just maybe, a prize-winning memoir will bring him respect, admiration, and a girlfriend . . . or at least a prom date.From the Hardcover edition.",
        "Category": " Young Adult Fiction , Humorous , General",
        "Publisher": "Ember",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Christian the Lion",
        "Authors": "By Bourke, Anthony, Rendall, John, and Knowles, Ruth (ADP)",
        "Description": "As Ace and John, two friends, are searching for holiday gifts in London, they come across a lion cub for sale in Harrods, the famous department store! Unable to bear the thought of leaving the cub, Ace and John take him home and name him Christian. After a year of fun and mischief Christian has grown up, and Ace and John realize that their pet needs to be among other lions and deserves to live free, in his natural environment. Luckily, friends help introduce Christian to the African wild. Christian the Lion tells the riveting true story of one animal’s ability to adapt to life in the wild, and captures the unexpectedly enduring connection between man and animal.",
        "Category": " Juvenile Nonfiction , Animals , Lions, Tigers, Leopards, etc.",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Hot Mess: Summer in the City",
        "Authors": "By Kraut, Julie and Lester, Shallon",
        "Description": "EMMA FREEMAN IS waving buh-bye to her standard summer of stationwagoning around the suburbs. This summer she’s heading to the big city. Emma’s totally prepped for days at a fabulous internship and nights of socialite-ing around town. But when you’re 17 and not an heiress, reality is far from pink fizzy drinks and red velvet ropes. As the summer heats up, Emma learns that glamour is hard to come by when your only friend is too boy-crazy to hang, your budget is more H&M than D&G, and you spend 8 hours a day working for a man who proves that the devil wears Dockers too. Add one little white lie told to one very hot coworker and a roommate who makes Paris Hilton look junior varsity, and this summer in the city is starting to turn into one hot mess.",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Boy Book: A Study of Habits and Behaviors, Plus Techniques for Taming Them (Ruby Oliver Quartet)",
        "Authors": "By Lockhart, E.",
        "Description": "From E. Lockhart, author of the highly acclaimed, New York Times bestseller We Were Liars, which John Green called \"utterly unforgettable,\" comes The Boy Book, the second book in the uproarious and heartwarming Ruby Oliver novels.Here is how things stand at the beginning of newly-licensed driver Ruby Oliver's  junior year at Tate Prep:  •  Kim: Not speaking. But far away in Tokyo.  •  Cricket:  Not speaking.  •  Nora: Speaking--sort of. Chatted a couple times this summer when  they bumped into each other outside of school--once shopping in the U District, and  once in the Elliot Bay Bookstore. But she hadn't called Ruby, or anything.  •  Noel:  Didn't care what anyone thinks.  •  Meghan: Didn't have any other friends.  •  Dr.  Z: Speaking.  •  And Jackson. The big one. Not speaking. But, by Winter Break, a  new job, an unlikely but satisfying friend combo, additional entries to The Boy Book and many difficult decisions help Ruby to see that there is, indeed, life outside  the Tate Universe.",
        "Category": " Young Adult Fiction , Social Themes , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Ugly Guide to Being Alive and Staying That Way (Uglydolls)",
        "Authors": "By Horvath, David and Kim, Sun-min",
        "Description": "Where are Uglys born? Where do they go to school? And what is Big Toe’s Eaty Feed Speeder? Whether you’re born in the Uglyverse or plan on moving there, you’ll need the Ugly Guide to Being Alive and Staying That Way to help you navigate life’s many Ugly shoals. Visit the Ugly Grade School Lunch-a-Munch Hut, stroll the Ugly College campus, and find out how to survive Ugly work—and even get paid for it!—in the third Ugly Guide from Uglydoll creators David Horvath and Sun-Min Kim. Featuring their original Ugly art style and trademark sense of humor, this will be a must-have for Uglydoll fans of all ages.",
        "Category": " Juvenile Fiction , Toys, Dolls & Puppets",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Devil's Paintbox",
        "Authors": "By McKernan, Victoria",
        "Description": "When orphans Aiden and Maddy Lynch first meet trailrider Jefferson J. Jackson in the spring of 1865, they’re struggling to survive on their family’s drought-ravaged Kansas farm. So when Jackson offers an escape—a 2000-mile journey across the roughest country in the world—Aiden knows it’s their only choice.They say there are a hundred ways to die on the Oregon Trail, and the long wagon journey is broken only by catastrophe: wolf attacks, rattlesnakes, deadly river crossings, Indians, and the looming threat of smallpox, “the devil’s paint.” Through it all, Aiden and Maddy and a hundred fellow travelers move forward with a growing hope, and the promise of a new life in the Washington Territory. But one question haunts them: who will survive the journey?In an adventure-filled and historically accurate new novel, Victoria McKernan captures both the peril and the stunning beauty of the frontier West. Shackleton’s Stowaway (“Truly thrilling” according to The Washington Post) was Victoria McKernan’s first novel for young adults. She lives in Washington, D.C..",
        "Category": " Young Adult Fiction , Historical , United States , 19th Century",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Busy Body Book: A Kid's Guide to Fitness",
        "Authors": "By Rockwell, Lizzy (ILT) and Rockwell, Lizzy",
        "Description": "A celebration of the amazing human machine and a life on the move!Your amazing body can jump, sprint, twist, and twirl. Your body is built to move.Lizzy Rockwell explains how your bones and muscles, heart and lungs, nerves and brain all work together to keep you on the go. Kids walk and skate and tumble through these pages with such exuberance that even sprouting couch potatoes will want to get up and bounce around—and that’s the ultimate goal. Studies show that American kids are becoming more sedentary and more overweight and that they carry these tendencies with them into adolescence and adulthood. Experts agree that we need to help kids make physical activity a life-long habit. Through education, information, and encouragement, this book aims to inspire a new generation of busy bodies!",
        "Category": " Juvenile Nonfiction , Science & Nature , Anatomy & Physiology",
        "Publisher": "Dragonfly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Horse Diaries #1: Elska",
        "Authors": "By Sanderson, Ruth (ILT) and Hapka, Catherine",
        "Description": "Iceland, circa AD 1000Elska is a silver dapple Icelandic filly. She spends summers frisking about the countryside and winters in the farmyard, where the girl human Amma takes special care of her. But when a powerful neighbor notices Elska, her contented life suddenly changes. Here is Elska’s story . . . in her own words.",
        "Category": " Juvenile Fiction , Historical , Europe",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Everybody Bonjours!",
        "Authors": "By Kimmelman, Leslie and McMenemy, Sarah (ILT)",
        "Description": "Shop a fancy France-y store. Eat a pretty petit four. Discover! Sightsee! Explore! On this fun and friendly tour, everybody says “Bonjour!” Whether at a soccer stadium (“players scoring”), a crêpe stand (“batter pouring”), or strolling the Champs d’ Elysee (where folks “bonjour” in every store), a little girl and her family are welcomed everywhere with the signature French greeting. Jump into these pages and enjoy the trip! Through lilting words and lively images, Everybody Bonjours welcomes young reader-travelers to a Paris that isn’t just for artists, grown-ups, and dreamers– it’s for kids!",
        "Category": " Juvenile Fiction , People & Places , Europe",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Horse Diaries #2: Bell's Star",
        "Authors": "By Sanderson, Ruth (ILT) and Hart, Alison",
        "Description": "Vermont, 1850sBell’s Star is a brown Morgan colt with a white star and two white stockings. He was bred for hard work, yet he longs to run free with his human friend, Katie, on his back. But when Star helps rescue a runaway slave girl, his ideas about freedom may change forever. Here is Star’s story . . . in his own words. With exciting and knowledgeable text and lovely black-and-white art throughout—both by real horse owners—Horse Diaries are the perfect fit for all lovers of horses and history!",
        "Category": " Juvenile Fiction , Historical , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Nobody's Princess (Princesses of Myth)",
        "Authors": "By Friesner, Esther",
        "Description": "Helen of Sparta wants to be more than a princess and a pretty face—she wants to be a hero.The traditions of ancient Sparta would have Helen know her place: a beautiful princess, a loyal daughter, a perfect bride. But Helen wants adventure, and she's not looking back. Not one to count on the gods to take care of her, she sets out to see the world and seek her own fate with steely determination. Her rebellious will makes Helen dangerous enemies—such as the self-proclaimed  \"son of Zeus\" Theseus—but it also gains her true friends, from the famed huntress Atalanta to the young priestess who is the Oracle  of Delphi. If she is strong enough, if she is cunning enough, if she is brave enough, Helen will find her destiny . . . but what does destiny have in store for her? In Nobody's Princess, author Esther Friesner deftly weaves together history  and myth as she takes a new look at the girl who will become Helen of Troy. The back of the book includes further facts about Helen of Troy and Ancient Greece. Hand to readers who love Tamora Pierce and Leigh Bardugo, particularly if they just finished Wonder Woman: Warbringer and want to know more about Helen of Troy.\"A must-read for fans of fantasy and mythology.\"—VOYA\"Along the way, Friesner skillfully exposes larger issues of women's rights, human bondage, and individual destiny. It's a rollicking good story.\"—Booklist",
        "Category": " Young Adult Fiction , Historical , Ancient Civilizations",
        "Publisher": "Ember",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Fate",
        "Authors": "By Barnes, Jennifer Lynn",
        "Description": "For the past two years, Bailey Morgan has lived a double life: high school student by day, ancient mystical being by night. As the third Fate, Bailey literally controls the fate of the world, but as Plain Old Bailey, her life is falling apart. She’s got a tattoo that was supposed to be temporary (but isn’t), friendships that were supposed to last forever (but might not), and no idea what her future holds after high school graduation.Then Bailey meets the rest of the Sidhe, an ancient race defined by their power, beauty, and a sinister habit of getting what they want at any cost. Before Bailey knows it, she’s being drawn into an otherworldly web more complicated than anything she weaves as a mortal Fate.",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Goddess of Yesterday",
        "Authors": "By Cooney, Caroline B.",
        "Description": "Anaxandra is taken from her birth island at age 6 by King Nicander to be a companion to his crippled daughter, Princess Callisto. Six years later, her new island is sacked by pirates and she is the sole survivor. Alone with only her Medusa figurine, she reinvents herself as Princess Callisto when Menelaus, great king of Sparta, lands with his men. He takes her back to Sparta with him where Helen, his beautiful wife, does not believe that the red-headed child is Princess Callisto. Although fearful of the half-mortal, half-goddess Helen, Anaxandra is able to stay out of harm’s way—until the Trojan princes Paris and Aeneas arrive. Paris and Helen’s fascination with each other soon turns to passion and plunges Sparta and Troy into war. Can Anaxandra find the courage to reinvent herself once again, appease the gods, and save herself? In Caroline B. Cooney’s epic tale of one girl’s courage and will to survive, Anaxandra learns that home is where you make it and identity goes deeper than just your name.From the Hardcover edition.",
        "Category": " Young Adult Fiction , Historical , Ancient Civilizations",
        "Publisher": "Ember",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Molly Moon's Hypnotic Time Travel Adventure (Molly Moon, 3)",
        "Authors": "By Byng, Georgia",
        "Description": "Molly Moon meets . . . Molly Moon? In this third book in the wildly popular New York Times bestselling series, mesmerizing orphan Molly Moon and her fabulouspug, Petula, are off to India, where they discover a new twist in the potential power of hypnosis: time travel! With the book available in trade paperback for the first time, readers can experience Molly’s adventure in an edition perfectly suited for time travel.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Faith and Treason: The Story of the Gunpowder Plot",
        "Authors": "By Fraser, Antonia",
        "Description": "In England, November 5 is Guy Fawkes Day, when fireworks displays commemorate the shocking moment in 1605 when government authorities uncovered a secret plan to blow up the House of Parliament--and King James I along with it. A group of English Catholics, seeking to unseat the king and reintroduce Catholicism as the state religion, daringly placed thirty-six barrels of gunpowder in a cellar under the Palace of Westminster. Their aim was to ignite the gunpowder at the opening of the Parliamentary session. Though the charismatic Catholic, Robert Catesby, was the group's leader, it was the devout Guy Fawkes who emerged as its most famous member, as he was the one who was captured and who revealed under torture the names of his fellow plotters. In the aftermath of their arrests, conditions grew worse for English Catholics, as legal penalties against them were stiffened and public sentiment became rabidly intolerant.In a narrative that reads like a gripping detective story, Antonia Fraser has untangled the web of religion, politics, and personalities that surrounded that fateful night of November 5. And, in examining the lengths to which individuals will go for their faith, she finds in this long-ago event a reflection of the religion-inspired terrorism that has produced gunpowder plots of our own time.",
        "Category": " History , Europe , Great Britain , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The 101 Most Influential People Who Never Lived: How Characters of Fiction, Myth, Legends, Television, and Movies Have Shaped Our Society, Changed Our Behavior, and Set the Course of History",
        "Authors": "By Lazar, Allan, Karlan, Dan, and Salter, Jeremy",
        "Description": "From Santa Claus to Buffy the Vampire Slayer, from Uncle Sam to Uncle Tom, here is a compelling, eye-opening, and endlessly entertaining compendium of fictional trendsetters and world-shakers who have helped shape our culture and our lives. The 101 Most Influential People Who Never Lived offers fascinating histories of our most beloved, hated, feared, and revered invented icons and the indelible marks they made on civilization, including:# 28: Rosie the Riveter, the buff, blue-collar factory worker who helped jump-start the Women's Liberation movement# 7: Siegfried, the legendary warrior-hero of Teutonic nationalism responsible for propelling Germany into two world wars# 80: Icarus, the headstrong high-flyer who inspired the Wright brothers and humankind's dreams of defying gravity . . . while demonstrating the pressing need for flight insurance# 58: Saint Valentine, the hapless, de-canonized loser who lost his heart and head at about the same time# 43: Barbie, the bodacious plastic babe who became a role model for millions of little girls, setting an impossible standard for beauty and style",
        "Category": " Social Science , Popular Culture",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Curious George's Dream",
        "Authors": "By Rey, H. A. and Rey, Margret",
        "Description": "After a long day at the fair George is frustrated. It seems he is always too small! But when George falls asleep and wakes up BIG, he discovers being too large can be difficult, too, and maybe he's the right size after all. The adventures of Curious George continue in an all-new series beginning in fall 1998 with eight new stories. Written and illustrated in the style of Margret and H. A. Rey, the books appear in paperback (8 x 8\") and hardcover editions and feature the art of Vipah Interactive, the animators of HMI's Curious George CD-ROMs.",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "HMH Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Harpers Ferry",
        "Authors": "By Murfin, James V. / Reber, James Q.",
        "Description": "",
        "Category": "",
        "Publisher": "Reber",
        "Price Starting With ($)": "6.56",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Egyptian Art (World of Art)",
        "Authors": "By Aldred, Cyril",
        "Description": "Of the ancient art that has survived from the non-Classical world, that of Egypt makes a unique appeal.In this authoritative and splendidly illustrated guide Cyril Aldred surveys nearly 3000 years of Egyptian art and architecture, concentrating on the fine arts of painting and sculpture.",
        "Category": " Art , History , Ancient & Classical",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Eddie Would Go: The Story of Eddie Aikau, Hawaiian Hero",
        "Authors": "By Coleman, Stuart Holmes",
        "Description": "",
        "Category": " Sports & Recreation , Water Sports",
        "Publisher": "MindRaising Press",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Living with Grief: Children, Adolescents, and Loss",
        "Authors": "By Doka, Kenneth J. (EDT) and Hospice Foundation of America (COR)",
        "Description": "Living With Grief: Children, Adolescents, and Loss, (2000) edited by Kenneth J. Doka, features articles by leading educators and clinicians in the field of grief and bereavement. The chapters entitled \"Voices\" are the writings of children and adolescents. The book includes a comprehensive resource list of national organizations and a useful bibliography of age-appropriate literature for children and adolescents.",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "Routledge",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Girl Who Kicked the Hornet's Nest (Millennium Trilogy)",
        "Authors": "By Larsson, Stieg and Keeland, Reg (TRN)",
        "Description": "Lisbeth Salander—the heart of Larsson’s two previous novels—lies in critical condition, a bullet wound to her head, in the intensive care unit of a Swedish city hospital. She’s fighting for her life in more ways than one: if and when she recovers, she’ll be taken back to Stockholm to stand trial for three murders. With the help of her friend, journalist Mikael Blomkvist, she will not only have to prove her innocence, but also identify and denounce those in authority who have allowed the vulnerable, like herself, to suffer abuse and violence. And, on her own, she will plot revenge—against the man who tried to kill her, and the corrupt government institutions that very nearly destroyed her life.Once upon a time, she was a victim. Now Salander is fighting back.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Lois Lane Tells All",
        "Authors": "By Hawkins, Karen",
        "Description": "New York Times bestselling author Karen Hawkins returns to Glory, North Carolina, for another delightful story of love and laughter.She thinks she’s Lois Lane . . .Susan Collins always wanted to be a hard-hitting reporter, but there’s not much call for her talents in sleepy Glory, North Carolina. Then the Murder Mystery Club—a trio of enterprising octogenarians—decides to open their own CSI lab at the assisted-living center. And when strange \"accidents\" begin to happen around town, Susan senses she could be on to the news story of her dreams.He doesn’t want to be her Superman . . .Mark Tremayne has returned to Glory to take over as CFO of The Glory Examiner. His job is to keep the newspaper profitable, which means covering the annual Baptist Church Bake-Off and selling ads for the county fair—not allowing his too-sexy-for-her-own-good reporter to hare off after a wild story that could alienate some of the townspeople.Together . . . they’re Kryptonite.Mark’s and Susan’s viewpoints could be from different planets, but their mutual attraction is in total alignment. Despite their arguments, the indomitable redhead and the hot accountant are a sexual explosion waiting to happen. And when it does, Glory had better watch out!",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Acceleration (Readers Circle)",
        "Authors": "By McNamee, Graham",
        "Description": "It’s a hot, hot summer, and in the depths of the Toronto Transit Authority’s Lost and Found, 17-year-old Duncan is cataloging lost things and sifting through accumulated junk. And between Jacob, the cranky old man who runs the place, and the endless dusty boxes overflowing with stuff no one will ever claim, Duncan’s just about had enough. Then he finds a little leather book. It’s a diary filled with the dark and dirty secrets of a twisted mind, a serial killer stalking his prey in the subway. And Duncan can’t make himself stop reading.What would you do with a book like that? How far would you go to catch a madman?And what if time was running out. . . .From the Hardcover edition.",
        "Category": " Young Adult Fiction , Mysteries & Detective Stories",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "CliffsNotes on Stowe's Uncle Tom's Cabin",
        "Authors": "By Lybyer, J. J.",
        "Description": "Cliffs Test Preparation Guides help students prepare for and improve their performance on standardized tests ACT Preparation Guide CBEST Preparation Guide CLAST Preparation Guide ELM Review GMAT Preparation Guide GRE Preparation Guide LSAT Preparation Guide MAT Preparation Guide MATH Review for Standardized Tests MSAT Preparation Guide Memory Power for Exams Police Officer Examination Preparation Guide Police Sergeant Examination Preparation Guide Police Management Examinations Preparation Guide Postal Examinations Preparation Guide Praxis I: PPST Preparation Guide Praxis II: NTE Core Battery Preparation Guide SAT Preparation Guide SAT II Writing Preparation Guide TASP Preparation Guide TOEFL Preparation Guide with 2 cassettes Advanced Practice for the TOEFL with 2 cassettes Verbal Review for Standardized Tests Writing Proficiency Examinations You Can Pass the GED Cliffs Quick Reviews help students in introductory college courses or Advanced Placement classes Algebra I Algebra II Anatomy & Physiology Basic Math and Pre-Algebra Biology Calculus Chemistry Differential Equations Economics Geometry Linear Algebra Microbiology Physics Statistics Trigonometry Cliffs Advanced Placement Preparation Guides help high school students taking Advanced Placement courses to earn college credit AP Biology AP Calculus AB AP Chemistry AP English Language & Composition AP English Literature & Composition AP United States History Cliffs Complete Study Editions are comprehensive study guides with complete text, running commentary and glossary Chaucer's Prologue Chaucer's Wife of Bath Hamlet Julius Caesar King Henry IV, Part I King Lear Macbeth The Merchant of Venice Othello Romeo and Juliet The Tempest Twelfth Night See inside back cover for listing of Cliffs Notes titles Registered trademarks include: GRE, MSAT, the Praxis Series, and TOEFL (Educational Testing Service): AP, Advanced Placement Program, and SAT (College Entrance Examination Board); GMAT (Graduate Management Admission Council); and LSAT (Law School Admission Council.) Uncle Tom's Cabin",
        "Category": " Study Aids , Study Guides",
        "Publisher": "*Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Daddy For Christmas (By Request)",
        "Authors": "By Browning, P. and Winters, R.",
        "Description": "The wonder, joy, and romance of the Christmas season are captured in three full-length novels--Pamela Browning's Merry Christmas, Baby, Jule McBride's The Baby and the Bodyguard, and The Nutcracker Prince by Rebecca Winters. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Girl Who Played with Fire (Millennium Trilogy, No 2)",
        "Authors": "By Larsson, Stieg",
        "Description": "Part blistering espionage thriller, part riveting police procedural, and part piercing exposé on social injustice, The Girl Who Played with Fire is a masterful, endlessly satisfying novel.  Mikael Blomkvist, crusading publisher of the magazine Millennium, has decided to run a story that will expose an extensive sex trafficking operation. On the eve of its publication, the two reporters responsible for the article are murdered, and the fingerprints found on the murder weapon belong to his friend, the troubled genius hacker Lisbeth Salander. Blomkvist, convinced of Salander’s innocence, plunges into an investigation. Meanwhile, Salander herself is drawn into a murderous game of cat and mouse, which forces her to face her dark past.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "A Concise History of Indian Art",
        "Authors": "By Craven, Roy C",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Turkish Newspaper Reader",
        "Authors": "By Murphy, John D. and Somay, Metin",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Dunwoody Pr",
        "Price Starting With ($)": "8.92",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Understanding Healthcare",
        "Authors": "By Wurman, Richard Saul",
        "Description": "",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "T O P",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Candlewick Book of Bear Stories",
        "Authors": "By Martin Waddell, John Burningham, Helen Oxenbury, Jez Alborough",
        "Description": "A collection of nineteen beloved illustrated stories and poems specially designed for any true  bear lover includes such favorites as This Is The Bear, We're Going On A Bear Hunt, and Let's Go Home, Little Bear.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Precious Moments: Through the Year Stories",
        "Authors": "By Beers, V. Gilbert and Butcher, Samuel J. (ILT)",
        "Description": "A collection of stories celebrating the unique wonders of the four seasons",
        "Category": "",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    }
]