[
    {
        "Title": "Captain Grey",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Beech Tree Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Phantoms: A Thriller",
        "Authors": "By Koontz, Dean R.",
        "Description": "“Phantoms is gruesome and unrelenting…It’s well realized, intelligent, and humane.”—Stephen KingThey found the town silent, apparently abandoned. Then they found the first body, strangely swollen and still warm. One hundred fifty were dead, 350 missing. But the terror had only begun in the tiny mountain town of Snowfield, California.At first they thought it was the work of a maniac. Or terrorists. Or toxic contamination. Or a bizarre new disease.But then they found the truth. And they saw it in the flesh. And it was worse than anything any of them had ever imagined...",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Impossible: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "When a high-powered gallery owner collides with a wildly offbeat artist, it’s the  perfect recipe for disaster. But in her 63rd bestselling novel, Danielle Steel proves  that when two hopelessly mismatched people share a love for art, a passion for each  other, and a city like Paris, nothing is truly impossible…or is it?  Everything Sasha  does is within the boundaries of tradition. Liam is sockless in December.  Sasha  is widowed, a woman who knows she was lucky enough to be married to the most wonderful  man in the world and thankful for every moment they had. Liam is half in and half  out of a marriage that only a “wacky” artist could manage, and that his own impossibly  impulsive behavior has helped tear apart. But while Sasha has been methodically building  her father’s Parisian art gallery into an intercontinental success story, Liam has  been growing into one of the most original and striking young painters of his time.  So while the two are utterly unalike–and a nine-year age difference stares them squarely  in the face–the miracle of art brings them crashing together. Now the question is,  can Sasha guard her reputation while juggling a secret, somewhat scandalous relationship?  And how can Liam, who lives for the moment, put up with a woman who insists on having  things her own way, in her own style, and at her own time?  For Sasha, it’s a matter  of keeping Liam hidden from her grown children and well-heeled clientele as she commutes  between New York and Paris and two thriving galleries. For Liam, it’s about creating  chaos out of order, bringing out the wild streak that Sasha barely knows she has,  of choosing pizza over foie gras, and making love when others are busy making money.   That is, until a family tragedy suddenly alters Liam’s life–and forces a choice  and a sacrifice that neither one of them could have expected.  But from the snow  falling on the Tuileries to the joy of eating ice cream by candlelight, the artist  and the art dealer have tasted perfection.  And giving up now might just be the most  impossible thing of all.  With unerring insight into the hearts of men and women– and into the soul of the artist –Danielle Steel takes us into a world of glamour  and genius, priceless art and dazzling creativity. From the luxurious galleries of  Europe to the endless beaches of the Hamptons, ImPossible weaves an extraordinary  tale of love and compromise, of taking chances and counting blessings.  With brilliant  color and breathtaking emotion, Danielle Steel has written her most compelling novel  to date.From the Hardcover edition.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Days of Summer: A Novel",
        "Authors": "By Barnett, Jill",
        "Description": "In 1957, the Banning family leads a life of privilege, wealth, and domestic unhappiness. At the head of this California dynasty is oil magnate Victor Banning, a man of great power and even greater obsessions who is determined to teach his son and grandsons to be predators in his dog-eat-dog world.Jimmy Peyton is a rising star in the music business, a young man with a bright future and no connection to the Bannings, until the fateful night their cars collide on a Los Angeles street, forever changing the lives and future of two innocent families.Laurel Peyton, Jimmy's daughter, has lived her entire life in the shadow of grief. Though her mother, Kathryn, struggled to keep her daughter safe and secluded after the terrible accident that ruined their family, she cannot guard against the one danger she never expected: love.In 1970, Victor's grandsons, Jud and Cale, meet the beautiful and spirited Laurel, and these two families cross paths once again, this time on a passionate course that pits brother against brother and mother against daughter, a clash of wills that gradually draws them all closer to the truth of their tragic connection.Spanning thirty years and three generations of Peyton women and Banning men, The Days of Summer is an epic drama that explores our deepest ties to family, the mistakes we make in the name of love, and is a reminder of our ability to hope, to forgive, and to find the courage to change. In 1957, the Banning family leads a life of privilege, wealth, and domestic unhappiness. At the head of this California dynasty is oil magnate Victor Banning, a man of great power and even greater obsessions who is determined to teach his son and grandsons to be predators in his dog-eat-dog world.Jimmy Peyton is a rising star in the music business, a young man with a bright future and no connection to the Bannings, until the fateful night their cars collide on a Los Angeles street, forever changing the lives and future of two innocent families.Laurel Peyton, Jimmy's daughter, has lived her entire life in the shadow of grief. Though her mother, Kathryn, struggled to keep her daughter safe and secluded after the terrible accident that ruined their family, she cannot guard against the one danger she never expected: love.In 1970, Victor's grandsons, Jud and Cale, meet the beautiful and spirited Laurel, and these two families cross paths once again, this time on a passionate course that pits brother against brother and mother against daughter, a clash of wills that gradually draws them all closer to the truth of their tragic connection.Spanning thirty years and three generations of Peyton women and Banning men, The Days of Summer is an epic drama that explores our deepest ties to family, the mistakes we make in the name of love, and is a reminder of our ability to hope, to forgive, and to find the courage to change.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Greenwitch",
        "Authors": "By Cooper, Susan",
        "Description": "Simon, Janeand Barney, enlisted by their mysterious great uncle, arrive in a small coastal town to help recover a priceless golden grail stolen by the forces of evil, the Dark. They are not at first aware of the strange powers of another boy brought to help, Will Stanton -- nor of the sinister significance of the Greenwitch, an image of leaves and branches that for centuries has been cast into the sea for good luck in fishing and harvest.Their search for the grail sets into motion a series of disturbing, sometimes dangerous events that, at their climax, bring forth a gift that, for a time at least, will keep the Dark from rising.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Lonely Planet Switzerland",
        "Authors": "By Simonis, Damien, Johnstone, Sarah, and Jackson, Lorne",
        "Description": "",
        "Category": " Travel , Europe , Switzerland",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Man of My Dreams (Jove Romance)",
        "Authors": "By Foster, Suzanne",
        "Description": "A captivating collection of sensual stories follows four dangerously sexy heroes who have the power to conquer a woman's heart and make all of her fantasies come to life--in more ways than one--in a romantic anthology featuring works by Sherrilyn Kenyon, Maggie Shayne, Suzanne Forster, and Virginia Kantra. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Ghosts, Hauntings, and Mysterious Happenings (Strange Unsolved Mysteries)",
        "Authors": "By Emert, Phyllis Raybin and Jael (ILT)",
        "Description": "True-life accounts of strange, unexplained phenomena chronicle bizarre curses, haunted houses, poltergeists, ghostly apparitions, and people with the power to foretell the future. Original.",
        "Category": "",
        "Publisher": "Tom Doherty Assoc Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Deadly Gift (The Flynn Brothers Trilogy)",
        "Authors": "By Graham, Heather",
        "Description": "Caer is spending this Christmas among strangers. Brought to Newport, Rhode Island, from her native Ireland to nurse ailing millionaire Sean O'Riley, she's living a life few can imagine. But money can't hide the tension between O'Riley's trophy wife, his paranoid daughter, the eccentric aunt in the attic and the staff members who run the house. When O'Riley's business partner goes missing, family friend Zach Flynn arrives. Determined to help him solve the case, Caer becomes enmeshed in a mystery that weaves together the sins of the past with one family's destiny&#133;and a spirit that watches the mansion, possessing a deadly gift.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "City of the Sun (Frank Behr)",
        "Authors": "By Levien, David",
        "Description": "Private detective Frank Behr has been perfectly content living a solitary life, working on a few simple cases, and attempting to move on from his painful past. But when Paul and Carol Gabriel ask him to help them find their missing son, he can hardly refuse. Going against everything he fears—Behr's been around too long to hope for a happy ending—he enters into an uneasy partnership with Paul on a quest for the truth that will become both dangerous and haunting. Richly textured and crackling with suspense on every page, City of the Sun masterfully takes readers on an investigation like no other.www.davidlevien.com",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The Dark Tide (Ty Hauck Series)",
        "Authors": "By Gross, Andrew",
        "Description": "On the morning Karen Friedman learns that her husband, a hedge fund manager, has been tragically killed, Detective Ty Hauck begins his investigation of another man's death in a suspicious hit-and-run in Karen's hometown.The two seemingly unrelated tragedies are about to plunge a beautiful widow and a determined investigator into a maelstrom of murder, vast sums of missing money, and international conspiracy.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Potshot (Spenser)",
        "Authors": "By Parker, Robert B.",
        "Description": "Boston P.I. Spenser returns—heading west to the rich man’s haven of Potshot, Arizona, a former mining town reborn as a paradise for Los Angeles millionaires looking for a place to escape the pressures of their high-flying lifestyles. Potshot overcame its rough reputation as a rendezvous for old-time mountain men who lived off the land, thanks to a healthy infusion of new blood and even newer money. But when this western idyll is threatened by a local gang—a twenty-first-century posse of desert rats, misfits, drunks, and scavengers—the local police seem powerless. Led by a charismatic individual known only as The Preacher, this motley band of thieves selectively exploits the town, nurturing it as a source of wealth while systematically robbing the residents blind.Enter Spenser, who has been hired by the comely Mary Lou Buckman to investigate the murder of her husband. The Buckmans, a pair of  L.A. transplants, moved to Potshot and started a modest outdoor tour service. It is Mary Lou’s belief that when her husband refused to pay The Preacher and his men protection money he was killed. Without any witnesses, Spenser has little to go on, and it’s clear the local police chief won’t be doing much to help. Calling on his own cadre of tried-and-true cohorts, including Vinnie Morris, Bobby Horse, Chollo, Bernard J. Fortunato, Tedy Sapp and the redoubtable Hawk, Spenser must find a way to beat the gang at their own dangerous game.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Quicksand: An Eve Duncan Forensics Thriller",
        "Authors": "By Johansen, Iris",
        "Description": "Do you still miss your little Bonnie? This one sentence, spoken by a male voice in anonymous phone call, is all it takes to drag Eve Duncan right back to that horrifying moment years ago when her only daughter vanished without a trace. Since then, Eve's life has become an obsession to find her daughter's remains. Only one man—a brilliant, ruthless killer—knows the truth about what happened to Bonnie. But taunting Eve might be his first and last mistake…For Eve is armed with more than just her talent as a forensic sculptor. She brings with her former Navy SEAL Joe Quinn, an Atlanta detective who will do anything to help Eve put the pain of Bonnie's death to rest. Even if he has to lie to the woman he cares about the most. And even if this killer wants nothing more than to lure Eve further and further into his swamp of madness…",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Hold Tight: A Suspense Thriller",
        "Authors": "By Coben, Harlan",
        "Description": "Harlan Coben delivers a #1 New York Times bestseller that asks how well parents really know their children—and puts them on a technological roller coaster of their worst fears.“We’re losing him.” With those words, Mike and Tia Baye decide to spy on their sixteen-year-old son Adam, who has become increasingly moody and withdrawn since the suicide of his best friend. The software they install on his computer shows them every Web site visited, every e-mail sent or received, every instant message. And each keystroke draws them deeper and deeper into a maze of mayhem and violence that could destroy them all...",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "See How She Dies",
        "Authors": "By Jackson, Lisa",
        "Description": "Desperately trying to remember her past, Adria Nash believes that she is London Danvers, who was kidnapped from her wealthy family as a child, and sets out to prove her true identity while trying to elude a clever killer who refuses to let the truth be known. Original.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Stranger in Paradise (Jesse Stone Novels)",
        "Authors": "By Parker, Robert B.",
        "Description": "Ten years after hit man Crow Cromartie escapes with the spoils of a lucrative heist, Massachusetts police officer Jesse Stone is astonished when the fugitive enlists his cooperation with a job gone bad involving a young woman whose father wants her killed. Reprint.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Assurance for a Lifetime: Knowing and Living in the Confidence of Christ",
        "Authors": "By Meberg, Marilyn",
        "Description": "After making the life-changing decision to follow Christ, many new believers are left wondering \"What's next?\"  Written in her warm, conversational style, popular speaker and author Marilyn Meberg explores five topics vital to the health and growth of the new Christian.  They are:Assurance of salvationLiving by faithValue of prayerReading God's WordFellowshipLooking into these five essential areas of life with Christ will enable the new believer to find security and better understand this new relationship.  Questions for refection at the end of each chapter gives the reader an opportunity to apply these liberating truths to her own life.  This interactive component will be an effective tool to enable them to understand God's plan for a dynamic Christian life.Assurance for a Lifetime will be heavily promoted at all Women of Faith® conferences and included in the packet of information sent to each attendee who indicates her \"decision\" for Christ.  It will also be a vital part of the WOF line of product designed to meet the spiritual needs of women.",
        "Category": " Religion , Christian Life , Spiritual Growth",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "World's Greatest Collection of Church Jokes",
        "Authors": "By Miller, Paul M. (EDT)",
        "Description": "",
        "Category": " Humor , Form , Jokes & Riddles",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Black: A Novel",
        "Authors": "By Whitcomb, Christopher",
        "Description": "A fifteen-year member of the FBI who received its coveted Medal of Bravery, former agent Christopher Whitcomb electrified readers with his breathtaking memoir, Cold Zero. Now his remarkable past and hard-edged prose illuminate his highly acclaimed first thriller... Selected for the FBI's elite Hostage Rescue Team, Special Agent Jeremy Waller is about to fight terrorism at its source-by diving headlong into a violent world of trapdoor truths and shifting alliances. And he'll have company: a beautiful executive more adept at murder than marketing who turns his assignment into a cipher...a ruthless tycoon set on selling a revolutionary technology to terrorists...and a female senator and presidential hopeful charged with an unspeakable crime. Here there is no justice-and only one way out of the darkness: Head even deeper into the shadows...",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Wicked Game (The Colony)",
        "Authors": "By Jackson, Lisa and Bush, Nancy",
        "Description": "One By One, They'll Die.  .  .    Twenty years ago, wild child Jessie Brentwood vanished from St. Elizabeth's high school. Most in Jessie's tight circle of friends believed she simply ran away.  Few suspected that Jessie was hiding a shocking secret-one that brought her into the crosshairs of a vicious killer.  .  .       Until There's No One Left.  .  .      Two decades pass before a body is unearthed on school grounds and Jessie's old friends reunite to talk. Most are sure that the body is Jessie's, that the mystery of what happened to her has finally been solved.  But soon, Jessie's friends each begin to die in horrible, freak accidents that defy explanation.  .  .      But Her.  .  .    Becca Sutcliff has been haunted for years by unsettling visions of Jessie, certain her friend met with a grisly end. Now the latest deaths have her rattled. Becca can sense that an evil force is shadowing her too, waiting for just the right moment to strike. She feels like she's going crazy. Is it all a coincidence-or has Jessie's killer finally returned to finish what was started all those years ago?",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The Secret Sister",
        "Authors": "By Lowell, Elizabeth",
        "Description": "The Search For Her Sister Could Cost A Woman Her LifeChristy McKenna, the smartest fashion writer in New York, thought she'd escaped her childhood in the impoverished rural West. Then came a call for help from the one person she could not refuse—her sister, the internationally celebrated model known only as Jo.Jo's plea draws Christy back to the magnificent mountains and mysterious red-rock canyons of the Four Corners country. But she's too late—Jo has disappeared. However,  Christy does find an unlikely ally in outlaw archaeologist Aaron Cain, and together they  pursue Jo and a fabulous cache of ancient Indian artifacts worth millions.Christy and Cain  clash at every turn, but their antagonism soon turns into partnership—and blazing passion.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Public Secrets",
        "Authors": "By Roberts, Nora",
        "Description": "Emma. Beautiful, intelligent, and radiantly talented, she lives in a star-studded world of wealth and privilege. But she is about to discover that fame is no protection at all when someone wants you dead.   All Emma has to do is close her eyes and she remembers the day Brian McAvoy swept into her life. A frightened toddler, she didn’t know then that she was his illegitimate daughter or that he was pop music’s rising new star. All she knew was that with Brian, his band mates, and his new wife, she felt safe. And when her baby brother arrived, Emma thought she was the luckiest girl in the world—until the night a botched kidnapping attempt shattered all their lives . . . and destroyed Emma’s happiness.   Yet now, even though Emma is still haunted by flashes of memory from that fateful night, she has survived. She’s carved out a thrilling career and even dared to fall rapturously in love. But the man who will become her husband isn’t all that he seems. And Emma is about to awaken to the chilling knowledge that the darkest secret of all is the one buried in her mind—a secret that someone may kill to keep.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2012"
        }
    },
    {
        "Title": "The Queen's Command: A Novel of Elizabethan England (Large Print)",
        "Authors": "By Maggie Osborne",
        "Description": "",
        "Category": "",
        "Publisher": "Madison Park Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Cypress Point",
        "Authors": "By Chamberlain, Diane",
        "Description": "When her best friend Mara is left severely brain damaged after giving birth, Joelle D'Angelo finds solace in Mara's husband Liam, but as their attraction for each other grows, Joelle, driven by guilt, searches for a legendary healer to save her friend. Reprint.",
        "Category": " Fiction , Romance , Erotica",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Apprentice- Tess Gerritsen",
        "Authors": "By Gerritsen, Tess",
        "Description": "The bestselling author of The Surgeon returns—and so does that chilling novel’s diabolical villain. Though held behind bars, Warren Hoyt still haunts a helpless city, seeming to bequeath his evil legacy to a student all-too-diligent . . . and all-too-deadly.THE APPRENTICEIt is a boiling hot Boston summer. Adding to the city’s woes is a series of shocking crimes, in which wealthy men are made to watch while their wives are brutalized. A sadistic demand that ends in abduction and death.The pattern suggests one man: serial killer Warren Hoyt, recently removed from the city’s streets. Police can only assume an acolyte is at large, a maniac basing his attacks on the twisted medical techniques of the madman he so admires. At least that’s what Detective Jane Rizzoli thinks. Forced again to confront the killer who scarred her—literally and figuratively—she is determined to finally end Hoyt’s awful influence . . . even if it means receiving more resistance from her all-male homicide squad.But Rizzoli isn’t counting on the U.S. government’s sudden interest. Or on meeting Special Agent Gabriel Dean, who knows more than he will tell. Most of all, she isn’t counting on becoming a target herself, once Hoyt is suddenly free, joining his mysterious blood brother in a vicious vendetta. . . .Filled with superbly created characters—and the medical and police procedural details that are her trademark—The Apprentice is Tess Gerritsen at her brilliant best. Set in a stunning world where evil is easy to learn and hard to end, this is a thriller by a master who could teach other authors a thing or two.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Lost City (The NUMA Files)",
        "Authors": "By Cussler, Clive and Kemprecos, Paul",
        "Description": "The NUMA crew, under Kurt Austin’s direction, take on a blood-thirsty family with a fortune built on crime, in what may be race to discover the very secret of ever-lasting life in this heart-bounding installment in the #1 New York Times-bestselling series. Kurt Austin is mid-mission when his new colleague, the stunning archeologist Skye Labelle, is called away to examine a mysterious 16th-century military helmet discovered in the possession of a very contemporary-looking corpse. Ms. Labelle’s research on the armor draws her into the sights of a ruthless black-widow with her own plans for the artifact. As danger creeps closer to Ms. Labelle, a scientist half-way across the globe is kidnapped.  At the same time, experts working to harvest an enzyme discovered two thousand feet down in the North Atlantic, in an area known as “Lost City,” start turning up dead. Worlds apart in location and areas of expertise, they all have something in common. And it’s up to Kurt Austin, with the help of Joe Zavala and the NUMA Special Assignments Team, to put the pieces together if he’s going to keep his friend safe.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Blinded (Alan Gregory)",
        "Authors": "By White, Stephen",
        "Description": "In his latest masterwork of psychological suspense, the New York Times bestselling author of The Program, Warning Signs, and The Best Revenge peers into a troubled marriage to craft a shattering tale of secrecy, eroticism, betrayal, and murder.  Psychologist Alan Gregory is juggling his responsibilities as a father, a husband, and doctor when a beautiful woman walks into his office with an astounding admission.  Gibbs Storey believes that her husband may have murdered a woman.  Then, Gibbs stuns Alan again with another revelation: She thinks there are other victims…and her husband is not finished killing yet.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Black Cauldron (The Chronicles of Prydain)",
        "Authors": "By Alexander, Lloyd",
        "Description": "The land of Prydain is threatened by the evil Arawn and his band of invincible warriors",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Bantam Dell Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Britain from the Air",
        "Authors": "By Bernard Stonehouse",
        "Description": "",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Me Too",
        "Authors": "By Vera Cleaver",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "9.97",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "The Essential Guide to Entertaining: The Complete Book of Parties, Celebrations and Special Occasions",
        "Authors": "By Duncan, James (PHT) and Jones, Bridget",
        "Description": "A guide to entertaining covers special occasions--birthdays, anniversaries, funeral gatherings--features tips on cooking, decorating, and choosing wines, and includes easy menus for brunches, lunches, teas, and formal and informal dinners.",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "8.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Complete Encyclopedia Of Chinese Cooking",
        "Authors": "By Lo, Kenneth (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Casual Occasions Cookbook",
        "Authors": "By Williams, Chuck (EDT), Rosenberg, Allan (PHT), and Goldstein, Joyce",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Weldon Owen",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Mustang!: From the Walt Disney Productions' film based on the story by Calvin Clements",
        "Authors": "By Daly, Kathleen N.",
        "Description": "A young boy's love for a mustang prevents the execution of the wild horse.",
        "Category": "",
        "Publisher": "Pyramid Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Hannibal Rising (Hannibal Lecter Series)",
        "Authors": "By Harris, Thomas",
        "Description": "HE IS ONE OF THE MOST HAUNTING CHARACTERSIN ALL OF LITERATURE.AT LAST THE EVOLUTION OF HIS EVILIS REVEALED.Hannibal Lecter emerges from the nightmare of the Eastern Front, a boy in the snow, mute, with a chain around his neck.  He seems utterly alone, but he has brought his demons with him.Hannibal’s uncle, a noted painter, finds him in a Soviet orphanage and brings him to France, where Hannibal will live with his uncle and his uncle’s beautiful and exotic wife, Lady Murasaki.Lady Murasaki helps Hannibal to heal.  With her help he flourishes, becoming the youngest person ever admitted to medical school in France.But Hannibal’s demons visit him and torment him.  When he is old enough, he visits them in turn.He discovers he has gifts beyond the academic, and in that epiphany, Hannibal Lecter becomes death’s prodigy.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Complete Hot and Spicy Cookbook",
        "Authors": "By Callery, Emma (EDT)",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Herbs, Spices, Condiments",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Fruit: A Connoisseur's Guide and Cookbook",
        "Authors": "By Davidson, Alan and Knox, Charlotte",
        "Description": "An illustrated guide to fruit is part reference guide, part art book, and part cookbook, celebrating the joys of fruits and nuts",
        "Category": " Cooking , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Church Without Walls: Moving Beyond Traditional Boundaries (Spiritual Formation Study Guides)",
        "Authors": "By Peterson, Jim",
        "Description": "The first-century Christians had to sort out Jesus from Judaism in order to become a people for all nations. Today, we have to sort out Jesus from  religious traditions in order to make Him available to our nation. That’s the challenge this book tackles: Will we be the church without walls, communicating a gospel free of traditional and cultural trappings?",
        "Category": " Religion , Christian Church , Administration",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Wit and Wisdom",
        "Authors": "By Jones, C.",
        "Description": "",
        "Category": "",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "My Life As a Snow Bunny",
        "Authors": "By Delaney, Kaz",
        "Description": "Accompanying her father and his new girlfriend on their ski vacation to Colorado, sixteen-year-old Jo Vincent learns a few things about love and heartbreak when she falls head-over-skis for Hans, her gorgeous instructor. Original.",
        "Category": " Young Adult Fiction , Humorous , General",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Making Sense of Suffering: The Healing Confrontation with Your Own Past",
        "Authors": "By Stettbacher, J. Konrad",
        "Description": "A primal therapy approach to healing the psychological wounds from childhood, offering a radical plan to nurture the \"hurt child\" in everyone",
        "Category": " Health & Fitness , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Die in Plain Sight (Rarities Unlimited)",
        "Authors": "By Lowell, Elizabeth",
        "Description": "New York Times bestselling author Elizabeth Lowell creates another masterpiece of excitement and chills, passion and surpriseDie in Plain Sight When Lacey Quinn inherits the striking landscapes done by her late, much-loved grandfather, she believes they are as good as anything hanging in museums. But the paintings now in her possession are more than the works of a talented master. They are anguished voices from the grave . . . crying murder!Lacey begins researching her grandfather's past -- and is rocked almost immediately by a strange series of violent events. Someone wants to steal her inheritance, to reduce the paintings to unrecognizable ashes in a suspicious blaze. Someone wants to prevent Lacey from examining her grandfather's work too closely . . . by any means necessary.Ian Lapstrake, a security specialist, has taken an interest in Lacey's inheritance . . . and in her. Troubled by what he sees, he becomes Lacey's shadow, as her search for answers leads them both down an ever-darkening road paved with lies, blood, and devastating secrets.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Golden One (Amelia Peabody Mystery)",
        "Authors": "By Peters, Elizabeth",
        "Description": "A new year, 1917, is dawning, and the Great War that ravages the world shows no sign of abating. In these perilous times, archaeologist Amelia Peabody and her extended family must confront shocking dangers. But it is son Ramses who faces the most dire threat, answering a call that will carry him to the fabled seaport of Gaza on a mission as personal as it is perilous -- where death will be the certain consequence of exposure. While far away, Ramses's beautiful wife, Nefret, guards a secret of her own ...",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Reader's Digest Secrets of Better Cooking",
        "Authors": "By Staff of Publisher",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest Association",
        "Price Starting With ($)": "6.83",
        "Publish Date": {
            "Month": "April",
            "Year": "1972"
        }
    },
    {
        "Title": "Rediscovering Church: The Story and Vision of Willow Creek Community Church",
        "Authors": "By Hybels, Lynne",
        "Description": "Rediscovering Church is the candid story of Willow Creek Community Church’s phenomenal growth, from 100 members meeting in a Palatine, Illinois, movie theater to its present Sunday morning attendance of 15,000. Bill Hybels and his wife, Lynne, tell about Willow Creek’s beginnings, its struggles, the philosophy behind its success, and the strategies that have made it a model for church growth. The first half of the book, written by Lynne Hybels, explores the early years of Willow Creek and the personal accounts behind one of this century's most remarkable church stories. It offers an honest look at the ways God has used both the strengths and weaknesses of His people, creating a church of believers who have had tremendous impact for Christ in their community. In the second half of Rediscovering Church, Bill Hybels helps you apply the strengths of Willow Creek's ministry philosophy to your own congregation's mission. From mission statements to developing leadership, making sound financial decisions, and handling growth, Bill stresses that God wants to build His church to be an effective and committed community of faith that reaches out to a hurting world, to be the body of Christ in real and tangible ways. Rediscovering Church draws on the experiences of Willow Creek to show how one fellowship crystallized its mission and methodology, its vision and values. The Willow Creek story provides an example that churches and individuals alike can turn to for inspiration, encouragement, and a means of uncovering the pattern for their own unique mission and ministry.",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Awakening and Selected Stories (Modern Library Classics)",
        "Authors": "By Baym, Nina (EDT) and Chopin, Kate",
        "Description": "Introduction by Kaye Gibbons Edited and with notes by Nina Baym Commentary by Elizabeth Blackwell, Elizabeth Cady Stanton, and Charlotte Perkins Gilman, and from The Picayune’s Creole Cook Book   The Awakening shocked turn-of-the-century readers with its forthright treatment of sex and suicide. Departing from literary convention, Kate Chopin failed to condemn her heroine’s desire for an affair with the son of a Louisiana resort owner whom she meets on vacation. The power of sensuality, the delusion of ecstatic love, and the solitude that accompanies the trappings of middle- and upper-class life are the themes of this now-classic novel. As Kaye Gibbons points out in her Introduction, Chopin “was writing American realism before most Americans could bear to hear that they were living it.” This edition includes selected stories from Chopin’s Bayou Folk and A Night in Acadie.   Includes a Modern Library Reading Group Guide",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Modern Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Polite Society",
        "Authors": "By Sumner, Melanie",
        "Description": "In Polite Society Melanie Sumner introduces us to Darren, a not-so-nice young woman from Tennessee who joins the Peace Corps in Senegal for lack of a better idea. Fitting in with Southerners was hard enough, but trying to understand friends, lovers, and herself while unemployed in a foreign country sends Darren reeling. The world that spirals around her is full of outrageous encounters, interracial affairs, and nights of drunken revelry. Against the backdrop of a society that is governed by hospitality and good manners but is full of strangers and unfamiliar customs, Darren runs headlong into her own insecurities, fears, and desires.It is not surprising that Melanie Sumner's remarkable fiction has received early recognition from The New Yorker, which published selections from this book. With sly humor and acuity, Sumner invents a youthful heroine who is stubborn and selfish, loving and libidinous, and, ultimately, unsparingly human. Polite Society marks the debut of a talented writer whose work resounds with unusual spirit and searing honesty.",
        "Category": " Fiction , General",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "11.11",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Ugly Duckling: A Novel",
        "Authors": "By Johansen, Iris",
        "Description": "If fate suddenly made you more beautiful that you ever dreamed possible, would it be the beginning of a fairy tale, or your worst nightmare?The brutal attack should have killed anybody, but Nell Calder did more than survive. She emerged a woman transformed, with an exquisite beauty found only in fairy tales. Nell Calder deserved a happy ending. Instead, her descent into terror has just begun.Her attacker is still on the hunt, determined to finish what he's started. And Nell, protected by a new face, is just as determined to fight back and take her revenge. But to catch her prey, she will have to expose herself—even if it makes her a killer's prime target.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "All Fall Down",
        "Authors": "By Spindler, Erica",
        "Description": "Risking her career to convince troubled FBI profiler Connor Parks that a serial killer is stalking men who have escaped the fingers of justice, small-town police officer Melanie May soon discovers that the serial killer may be someone close to her, a ruthless murderer who will let nothing--and no one--stand in the way. Reissue.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Long After Midnight: A Novel",
        "Authors": "By Johansen, Iris",
        "Description": "She wanted to save lives.  The killer wanted to end hers. The first warning was  triggered hundreds of miles away.  The second warning exploded only yards from where  she and her son stood.  Now Kate Denby realizes the frightening truth:  She is somebody's  target. Danger has arrived in Kate's backyard with a vengeance.  And the gifted  scientist is awakening to a nightmare world where a ruthless killer is stalking her...where  her innocent son is considered expendable...and where the medical research to which  she has devoted her life is the same research that could get her killed.  Her only  hope of protecting her family and making that medical breakthrough is to elude her  enemy until she can face him on her own ground, on her own terms—and destroy him.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Dr. Death (Alex Delaware)",
        "Authors": "By Kellerman, Jonathan",
        "Description": "A brutalized corpse discovered in a remote region of the Hollywood Hills plunges psychologist detective Alex Delaware into a landscape of rage and madness as he struggles to solve this most baffling of homicides.To some, Eldon Mate was evil personified. Others saw the former physician as a saint. But one thing was clear: Dr. Death had snuffed out the lives of dozens of human beings and now someone had turned him into a victim. When Mate is found mutilated in a rented van, harnessed to his own killing machine, Delaware is asked to aid his old friend, homicide cop Milo Sturgis, in the hunt for the death doctor?s executioner. But Alex harbors secrets of his own that threaten to derail the partners? friendship as well as the increasingly complex investigation. With page-turning suspense and vivid portraits of L.A.?s darkest side, perennial bestseller Jonathan Kellerman?s latest tale of psychopathology taken to the extreme delivers an unforgettable journey into the most sinister corners of the human mind.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Mansfield Park (Bantam Classics)",
        "Authors": "By Austen, Jane",
        "Description": "In Mansfield Park, first published in 1814, when the author had reached her full maturity as a novelist, Jane Austen paints some of her most witty and perceptive studies of character. Against a genteel country landscape of formal parks and stately homes, the gossipy Mrs. Norris becomes a masterful comic creation; the fickle young suitor Henry Crawford provides an unequaled portrait of an unscrupulous young man; and the complexly drawn Fanny Price emerges as one of Jane Austen’s finest achievements—the poor cousin who comes to stay with her wealthy relatives at Mansfield Park and learns how the game of love can too easily turn to folly. More intricately plotted and wider in scope than Austen’s earlier works, Mansfield Park continues to enchant and delight us as a superb example of a great author’s craft.",
        "Category": " Fiction , Classics",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "The Wal-Mart Effect: How the World's Most Powerful Company Really Works--and HowIt's Transforming the American Economy",
        "Authors": "By Fishman, Charles",
        "Description": "An award-winning journalist breaks through the wall of secrecy to reveal the many astonishing ways Wal-Mart's power affects our lives and reaches all around the world.  The Wal-Mart Effect: The overwhelming impact of the world's largest company--due to its relentless pursuit of low prices--on retailers and manufacturers, wages and jobs, the culture of shopping, the shape of our communities, and the environment; a global force of unprecedented nature. Wal-Mart is not only the world's largest company; it is also the largest company in the history of the world. Americans spend $26 million every hour at Wal-Mart, twenty-four hours of every day, every day of the year. Is the company a good thing or a bad thing? On the one hand, market guru Warren Buffett estimates that the company's low prices save American consumers $10 billion a year. On the other, the behemoth is the #1 employer in thirty-seven of the fifty states yet has never let a union in the door.  Though 70 percent of Americans now live within a fifteen-minute drive of a Wal-Mart store, we have not even begun to understand the true power of the company and the many ways it is shaping American life. We know about the lawsuits and the labor protests, but what we don't know is how profoundly the \"Wal-Mart effect\" is shaping our lives.  Fast Company senior editor Fishman, whose revelatory cover story on Wal-Mart generated the strongest reader response in the history of the magazine, takes us on an unprecedented behind-the-scenes investigative expedition deep inside the many worlds of Wal-Mart. He reveals the radical ways in which the company is transforming America's economy, our workforce, our communities, and our environment. Fishman penetrated the secrecy of Wal-Mart headquarters, interviewing twenty-five high-level ex-executives; he journeyed into the world of a host of Wal-Mart's suppliers to uncover how the company strong-arms even the most established brands; and journeyed to the ports and factories, the fields and forests where Wal-Mart's power is warping the very structure of the world's market for goods. Wal-Mart is not just a retailer anymore, Fishman argues. It has become a kind of economic ecosystem, and anyone who wants to understand the forces shaping our world today must understand the company's hidden reach.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Penguin Press HC, The",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Street Dreams",
        "Authors": "By Kellerman, Faye",
        "Description": "An Abandoned Baby. A Missing Mother. But Innocence has a Fighting Chance. While on routine patrol, LAPD Officer Cindy Decker rescues a newborn from an alley Dumpster. But she can't call it a night until she sees the infant safe in a hospital, cared for by a professional-in this case a male nurse with soulful eyes and lots of charm. Now the hunt is on for the mother. Armed with advice from her overworked father, Detective Peter Decker, Cindy plunges into her inner-city Hollywood district, a world of helpless people and violent gangs. Pursuing each new lead batters her complex relationships and endangers her life. On one side: Decker and Decker, a brilliant but combative pair. On the other: a vicious killer ready to strike again.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Vision",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "City lives",
        "Authors": "By Wagenvoord, James",
        "Description": "",
        "Category": "",
        "Publisher": "HOLT, RINEHART AND WINSTON",
        "Price Starting With ($)": "8.28",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Letters from Annapolis: Midshipmen Write Home, 1848-1969",
        "Authors": "By",
        "Description": "This collection of letters penned by 13 midshipmen attending the U.S. Naval Academy begins shortly after the founding of the academy in 1845 and continues into the Vietnam Era.  Academy English professor Drew selected the letters from hundreds that found their way back to the academy archives.  She introduces the letter-writers with brief biographies and photographs and places their letters in the larger context of history. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": "",
        "Publisher": "Naval Institute Press",
        "Price Starting With ($)": "19.7",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Remaking Health Care in America: Building Organized Delivery Systems",
        "Authors": "By Shortell, Stephen M. (EDT), Gillies, Robin R., Anderson, David A., Erickson, Karen Morgan, and Mitchell, John B.",
        "Description": "Remaking Health Care in America presents the results of a comprehensive four-year study of the response to growing managed care and cost containment pressures among eleven health care systems. The book examines the success and failures of the current system and provides case study examples, practical suggestions, and recommendations for developing and implementing a more integrated, cost-effective delivery system.Written by the country's foremost authority on health services management and a team of experts, the book challenges the nation to create an environment that will support the evolution of our health care system to provide a more integrated communitywide approach that focuses on alliances, linkages, and partnerships with public health and social service agencies. To accomplish the transformation to an effective community health care management system, the authors present a conceptual framework that shows how to promote the integration of finance, human resources, strategic planning, total quality management, and information systems.",
        "Category": " Health & Fitness , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "History of the Confederate States Navy",
        "Authors": "By Scharf, J. Thomas",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Trade",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The 5 in 10 Cookbook 5 Ingredients in 10 Minutes or Less Paula Hamilton",
        "Authors": "By Hamilton, Paula J.",
        "Description": "Now Dinnertime is as Easy as 1-2-3-4-5!The 5 in 10 Cookbook makes -- and keeps -- an extraordinary promise: quick and easy recipes that use 5 ingredients (or fewer) and cook in 10 minutes or less.If you're like Paula Hamilton, tired of fast-food meals and determined to serve your family a delicious, nourishing dinner even if you've just come home from work, The 5 in 10 Cookbook is just what you need. Meals in minutes are guaranteed by limiting the recipes to 5 ingredients and 10 minutes of cooking time. Now your family can sit down to a home-cooked meal together every night.",
        "Category": " Cooking , Reference",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Landscapes Of The Civil War: Newly Discovered Photographs from the Medford Historical Society",
        "Authors": "By Pohanka, Brian C. and Sullivan, Contance (EDT)",
        "Description": "For the first time in a book, ninety-seven extraordinary, beautiful, and moving photographs from one of the nation's most important Civil War archives - more than five thousand photographs never before seen by the public that were recently discovered in the attic of the Medford Historical Society in Massachusetts.Here are images of Confederate soldiers at Devil's Den, Rose Woods, Plum Run ... Union and Confederate dead in the trenches at Petersburg, where the war's bloodiest battle was fought ... the shell of a Gothic mansion near Falmouth, Virginia ... beautiful Charleston in the aftermath of war ... and the dark shape of Fort Sumter, site of the beginning of the end.Many of the photographs are reproduced at their actual size; all are beautifully printed from tritone separations made from the vintage albumen prints. With an introduction by William F. Stapp, a leading authority on nineteenth-century American photography and former Curator of Photographs at the National Portrait Gallery. The preface is by Mark E. Neely, Jr., whose biography of Abraham Lincoln, The Fate of Liberty, won the Pulitzer Prize.",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Sweet Dreams, Irene: An Irene Kelly Novel",
        "Authors": "By Burke, Jan",
        "Description": "Irene Kelly is a reporter with a fierce integrity. Detective Frank Harriman is her lover and friend. Now they're both about to be plunged into political hellfire when a ruthless politician rocks a race for district attorney with a stunning allegation: his opponent's son is in the clutches of a satanic cult. The charge takes a fatal turn when a local woman is brutally murdered, and the grisly crime scene bears unholy implications. Tracking the clues takes Irene behind the closed doors of an isolated home for troubled youths, where obscuring the truth is only part of a stranger's diabolic game. To win it, Irene will have the devil to pay.",
        "Category": " Fiction , Literary",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Vision (Harrison Investigation, 3)",
        "Authors": "By Graham, Heather",
        "Description": "The gift of sight comes at a dangerous price When Deep Down Salvage begins the hunt for the Josephine Marie, it seems like any other dive...until Genevieve Wallace sees the vision of a dead woman in the water, her vacant eyes boring into Genevieve's very soul.Terrified and confused by what she saw, Genevieve is haunted by the memory, but no one — including her diving partner Thor Thompson  — believes her. When a dead woman washes up on shore, everyone assumes this is Genevieve's \"vision,\" but Genevieve knows the truth: the dead woman is not the ghost she saw but another victim of the same brutal killer.Sensing that the threat of death is coming closer, she and Thor are forced to acknowledge that some things can't be explained, but simply are. Somehow they have to link a violent past with a present-day mystery or risk losing themselves in an abyss of terror.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Ties That Bind",
        "Authors": "By Margolin, Phillip",
        "Description": "Phillip Margolin -- author of the smash New York Times bestsellersWild Justice and Gone, But Not Forgotten -- returns   with a thrilling tale of politics, secrets, and murder . . .Amanda Jaffe was a rising star of Portland's legal community, until a run-in with a psychopath left her scared and craving anonymity. But her new case promises to keep her in the spotlight -- and in danger. Defending the accused murderer of a U.S. senator will place her and those she loves directly in the path of a deadly cabal with ambitions that extend all the way to the presidency of the United States . . .",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "HarTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "He Shall Thunder in the Sky",
        "Authors": "By Peters, Elizabeth",
        "Description": "“Passion among the pyramids. Forged antiquities. A country at war. A camel in the garden. A cameo by Lawrence of Arabia. Add in Peters’s trademark intelligent plotting, engaging characters, and stylish writing and we can hardly ask for anything more.”—Cincinnati Enquirer One of the most beloved characters in mystery/suspense fiction, archeologist and Egyptologist Amelia Peabody bravely faces gravest peril in Cairo on the eve of World War One in New York Times bestselling Grandmaster Elizabeth Peters’s magnificent Egyptian adventure, He Shall Thunder in the Sky. The San Francisco Examiner calls these heart-racing exploits of Amelia and her courageous family, the Emersons, “pure delight.” But perhaps the New York Times Book Review states it best: “Between Amelia Peabody and Indiana Jones, it’s Amelia—in wit and daring—by a landslide.”",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Dangerous Duke (Berkley Sensation)",
        "Authors": "By Wells, Christine",
        "Description": "Lady Kate Fairchild, trapped in a loveless marriage, finds refuge in her diary, creating a phantom lover who becomes quite real when she meets the Duke of Lyle who, taking her captive in hopes that she will reveal the identity of the arsonists who killed his family, reads her innermost fantasies. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Castles in the Air",
        "Authors": "By Dodd, Christina",
        "Description": "Bound by the King . . . The document, signed and sealed by King Henry himself, commanded lady Juliana of Lofts to marry Raymond, Count of Avraché.Shattered by the Past . . . She refused, though it was treason to defy one's king. What man would have her once he discovered her secret?One Knight Would Crusade for His Lady's HeartYet Raymond would not be denied. And when he came for her, she'd learn that even the strongest will cannot resist the softest touch.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Rake",
        "Authors": "By Putney, Mary Jo",
        "Description": "Revamping her 1989 novel Would-Be Widow, the author enhances her touching tale of a woman who agrees to marry a dying soldier for very practical reasons, only to face his miraculous recovery and subsequent campaign to win her heart. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Topaz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The UltraMind Solution: Fix Your Broken Brain by Healing Your Body First - The Simple Way to Defeat Depression, Overcome Anxiety, and Sharpen Your Mind",
        "Authors": "By Hyman, Mark and Herbert, Martha, M.D., Ph.D. (FRW)",
        "Description": "A hidden epidemic races around the globe -- we can't see it or touch it, which makes it so dangerous.   The invisible epidemic has led to the suffering of millions who spend billions on drugs, only to find they don't work.   This is an epidemic of broken brains.   \"Broken brains\" go by many names -- depression, anxiety, memory loss, brain fog, attention deficit disorder, autism, and dementia, to name a few -- and show up in radically different ways from person to person, making each seem like a separate problem.   But the truth is that these \"diagnoses\" are all the result of a few basic problems with our biology. Pinpoint these biological problems, fix them, and let your body's natural healing intelligence take over to repair your brain. Now you can experience an UltraMind -- one that is highly focused and able to pay attention at will, with a strong, reliable memory and a mood that is calm, confident, in control, and in good spirits.   We have all heard of the mind-body connection or how our thoughts affect the health of our body. But the reverse is far more powerful: what you do to your body, your basic biology, has a profound effect on your brain.   Have you ever experienced instant clarity after exercise? Alertness after drinking coffee? A mental crash after popping candy? Does your brain inexplicably slow down during stress, while multitasking, or when meeting a deadline? Each is an example of how what we do to our bodies -- whether through nutrition, sleep, exercise, or stress -- has a dramatic effect on our brains.   Conventional treatments don't help, or provide only slight benefit, because they just manage symptoms rather than deal with -- and heal -- the underlying problem. And just as brain problems all stem from the same root causes, they all have the same solution -- The UltraMind Solution.   Our ancient genes interact with our environment to create systemic imbalances that affect our brains. Correct those imbalances -- most caused by nutritional deficiencies, allergens, infections, toxins, and stress -- and you can achieve optimum mental health without drugs or psychotherapy.   The UltraMind Solution is the future of medicine, the culmination of the last twenty years of research on what makes the brain happy, focused, and calm; research that has uncovered a few simple factors that explain why things go wrong and how to fix them.   Don't wait for this revolution in medicine to trickle into your doctor's office: it usually takes research twenty years to move from the lab to the patient. The answers are here, right now, in The UltraMind Solution.",
        "Category": " Body, Mind & Spirit , Healing , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.93",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "To Sin With a Stranger (Seven Deadly Sins)",
        "Authors": "By Caskie, Kathryn",
        "Description": "Meet the \"Seven Deadly Sins\"The seven Sinclair brothers and sisters live for scandal and delight in disgrace . . . until their father decrees that they must reform. Propriety has never come easily, but now they have no choice. Marry in haste . . . or regret in poverty!The Sinclairs of Scotland are known throughout society as the Seven Deadly Sins. Cast out by their father and denied their inheritance unless they mend their wild ways, they travel to London to seek respectability. No member of the clan is more scandalous than Sterling Sinclair, the Marquess of Blackburn. The ladies of the ton are powerless to withstand his rakish charms . . . until Miss Isobel Carington comes along.Ten thousand pounds if she marries Sinclair!Isobel is horrified to learn that's the amount wagered at White's Club—and now all of London is eagerly betting on her future! She's already publicly spurned the marquess, a man she hardly knows, but she's sure he is up to something, as he launches a bold campaign of seduction anyway. But soon she is surprised to learn there is much more to this man than reckless adventure and bad behavior . . . and, against her will, she begins to relish the thrill of sinning with this stranger . . .",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Earth Song (Song Novels)",
        "Authors": "By Coulter, Catherine",
        "Description": "Philippa de Beauchamp, an impulsive, thirteenth-century Cornwall beauty, escapes from her father's grasp and from her betrothal to the repulsive Baron de Bridgeport only to fall into the arms of the roguish Dienwald de Fortenberry",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Onyx",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "24 Hours: A Suspense Thriller",
        "Authors": "By Iles, Greg",
        "Description": "#1 New York Times bestselling author Greg Iles takes readers on a daringly executed roller-coaster ride as a family under attack takes justice into their own hands.It begins on a perfect night, with a perfect family about to be trapped in a perfect crime... Will Jennings is a successful young doctor in Jackson, Mississippi, with a thriving practice, a beautiful wife, and a five-year-old daughter he loves beyond measure. But Will and his family are being watched by a con man and psychopath who may be a genius. A man who has never been caught and whose victims have never talked to the police. A man whose life's work strikes at the heart of every family's unspoken fear: the unstoppable kidnapping.But this time he's picked the wrong family to terrorize. Because Will and Karen Jennings aren't going to watch helplessly as he victimizes them. They aren't going to let him get away with it. They're going to fight back...",
        "Category": " Fiction , Romance , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Pleasure Master",
        "Authors": "By Bangs, Nina",
        "Description": "",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Black Belt Patriotism: How to Reawaken America",
        "Authors": "By Norris, Chuck",
        "Description": "Bad news around every corner? Not for long!Terrorist attacks, debt, and big government plague the United States. The very foundation of our nation wobbles on shaky ground. Chuck Norris wants to change all that by reigniting the American dream, a dream of faith and freedom in what still should be the land of opportunity. The martial arts master sets out to kickstart America’s heart and return us to a country of tradition using practical advice from the Founding Fathers to modern conservatives.Spring into action and revitalize your country with Chuck Norris's dynamic book Black Belt Patriotism: How to Reawaken America.",
        "Category": " Political Science , Political Ideologies , General",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Taboo (St. John-Duras)",
        "Authors": "By Johnson, Susan",
        "Description": "Through eleven nationally bestselling books, award winner Susan Johnson has won a legion of fans for her lushly romantic historical novels.  Now she delivers her most thrilling tale yet--a searing blend of rousing adventure and wild, forbidden love...Married against her will to the brutal Russian general who conquered her people, Countess Teo Korsakova has never known what it means to want a man...until now.  Trapped behind enemy lines, held captive by her husband's most formidable foe, she should fear for her life.  But all Teo feels in General Andre Duras's shattering presence is breathless passion.  France's most victorious commander, Andre knows that he should do the honorable thing, knows too that on the eve of battle he cannot afford so luscious a distraction.  Yet something about Teo lures him to do the unthinkable: to seduce his enemy's wife, and to let himself love a woman who can never be his.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Abuela (English Edition with Spanish Phrases) (Picture Puffins)",
        "Authors": "By Kleven, Elisa (ILT) and Dorros, arthur",
        "Description": "A young girl and her grandmother celebrate their home and relationship in this magical story. Winner of the Parents' Choice Award!Come join Rosalba and her grandmother, her abuela, on a magical journey as they fly over the streets, sights, and people of New York City which sparkles below. The story is narrated in English, and sprinkled with Spanish phrases as Abuela points out places that they explore together. The exhilaration in Rosalba’s and Abuela's story is magnified by the loving bond that only a grandmother and granddaughter can share.Also available in a Spanish-language edition (ISBN: 978-0-14-056226-2)\"A book to set any child dreaming...any reader can handle it, whether familiar with Spanish or not. It's just joyful.\"-The New York Times* \"A marvelous balancing of narrative simplicity with visual intricacy...the city is transformed into a treasure trove of jewels, dazzling the eye, uplifting the spirits.\"–The Horn Book (starred review) * \"Each illustration is a masterpiece of color, line, and form that will mesmerize youngsters...The smooth text, interspersed with Spanish words and phrases, provides ample context clues...a jewel.\"–Booklist (starred review)\"Dorros's text seamlessly weaves Spanish words and phrases into the English narrative, retaining a dramatic quality rarely found in bilingual picture books\"—Publisher's Weekly An ALA Notable BookAn NCSS-CBC Children's Trade Book in the Field of Social StudiesA Library of Congress Children's Book of the YearAn American Booksellers Pick of the Lists selectionA Booklist Editor's ChoiceA Horn Book Fanfare ListingWinner of the Parent's Choice AwardA Hungry Mind Review Children's Books of Distinction List selectionA New York Public Library 100 Titles for Reading and Sharing selection",
        "Category": " Juvenile Fiction , People & Places , United States , Hispanic & Latino",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Live in a Better Way: Reflections on Truth, Love and Happiness",
        "Authors": "By Dalai Lama XIV and Singh, Renuka",
        "Description": "In his latest book, the great Tibetan spiritual leader discusses the meaning of truth and the secret to love and happiness, covering compassion, nonviolence, and many other topics along the way.",
        "Category": " Religion , Buddhism , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Booknotes : Life Stories : Notable Biographers on the People Who Shaped America",
        "Authors": "By Lamb, Brian (EDT)",
        "Description": "A treasury of interviews with some of the world's foremost biographers--including Jimmy Breslin, Doris Kearns Goodwin, David McCullough, and Frank McCourt--explores the lives and achievements of the people who have shaped the modern world, from Winston Churchill and Thomas Jefferson to Martin Luther King, Jr., and FDR. 35,000 first printing. Tour.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The God of All Comfort",
        "Authors": "By Smith, Hannah Whitall",
        "Description": "An agnostic, on discussing the subject of religion with the author, told  her: \"If you Christians want to make us agnostics inclined to look into your  religion, you must be more comfortable in the possession of it yourselves. The Christians  I meet seem to me to be the most uncomfortable people anywhere around. I, for one,  do not care to have that sort of religion.\" As a result, The God of All  Comfort was written. Far from the abundant life promised by Christ, most Christians  live in defeat and despair. The object of this book is to reveal the secret  of this abundant life and victory over defeat, to bring genuine and enduring joy  into the lives of troubled Christians, to show that everything Christ promised is  available today to all believers, and to put within reach of every Christian  that deep and lasting peace and comfort in the soul that nothing earthly can disturb.  Both God's part and man's part are explained. Colorful illustrations and anecdotes  and picturesque language illuminate every page, clarifying the vital message of  this book.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1953"
        }
    },
    {
        "Title": "Javascript in Easy Steps",
        "Authors": "By McGrath       , Mike",
        "Description": "",
        "Category": "",
        "Publisher": "Computer Step",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Origami Handbook",
        "Authors": "By Beech, Rick",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Vive Moi!: An Autobiography",
        "Authors": "By Sean O'Faolain",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "World Mythology (Dempsey Parr Micropedias) (Dempsey Parr Micropedias)",
        "Authors": "By Parr, Dempsey",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Basic Guide to Selling Crafts on the Internet",
        "Authors": "By Dillehay, James",
        "Description": "",
        "Category": " Computers , Electronic Commerce",
        "Publisher": "Warm Snow Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Polish for travellers (Phrase Books)",
        "Authors": "By Berlitz Guides",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Final Blackout",
        "Authors": "By Hubbard, L. Ron",
        "Description": "",
        "Category": " Fiction , War & Military",
        "Publisher": "Bridge Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Me and My Baby View the Eclipse",
        "Authors": "By Smith, Lee",
        "Description": "Focusing on ordinary people faced with the eclipses of life--death, divorce, illness, loss--this collection of stories includes \"Life on the Moon,\" \"Intensive Care,\" and \"Tongues of Fire\"",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Sherman: A Soldier's Passion for Order",
        "Authors": "By Marszalek, John F.",
        "Description": "Traces the life of the controversial Civil War general, and argues that an unsettled childhood helped shape his character",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Junebug",
        "Authors": "By Mead, Alice",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Vanishing Hero",
        "Authors": "By Sean O'Faolain",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown and Co.",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "The Stone Maiden",
        "Authors": "By King, Susan",
        "Description": "Alainna MacLaren must fulfill the legend of the Stone Maiden in order to save her peoplemarry a man who is willing to take her namebut despite his noble aspirations, her best prospect, Sebastien le Bret, seems unlikely to surrender his name. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Sacred Hearts: A Novel",
        "Authors": "By Dunant, Sarah",
        "Description": "The year is 1570, and in the convent of Santa Caterina, in the Italian city of Ferrara, noblewomen find space to pursue their lives under God’s protection. But any community, however smoothly run, suffers tremors when it takes in someone by force. And the arrival of Santa Caterina’s new novice sets in motion a chain of events that will shake the convent to its core.Ripped by her family from an illicit love affair, sixteen-year-old Serafina is willful, emotional, sharp, and defiant–young enough to have a life to look forward to and old enough to know when that life is being cut short. Her first night inside the walls is spent in an incandescent rage so violent that the dispensary mistress, Suora Zuana, is dispatched to the girl’s cell to sedate her. Thus begins a complex relationship of trust and betrayal between the young rebel and the clever, scholarly nun, for whom the girl becomes the daughter she will never have.As Serafina rails against her incarceration, others are drawn into the drama: the ancient, mysterious Suora Magdalena–with her history of visions and ecstasies–locked in her cell; the ferociously devout novice mistress Suora Umiliana, who comes to see in the postulant a way to extend her influence; and, watching it all, the abbess, Madonna Chiara, a woman as fluent in politics as she is in prayer. As disorder and rebellion mount, it is the abbess’s job to keep the convent stable while, outside its walls, the dictates of the Counter-Reformation begin to purge the Catholic Church and impose on the nunneries a regime of terrible oppression.Sarah Dunant, the bestselling author of The Birth of Venus and In the Company of the Courtesan, brings this intricate Renaissance world compellingly to life. Amid Sacred Hearts is a rich, engrossing, multifaceted love story, encompassing the passions of the flesh, the exultation of the spirit, and the deep, enduring power of friendship.",
        "Category": " Fiction , Historical",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "The Last Bridge: A Novel",
        "Authors": "By Coyne, Teri",
        "Description": "For ten years, Alexandra “Cat” Rucker has been on the run from her past. With an endless supply of bourbon and a series of meaningless jobs, Cat is struggling to forget her Ohio hometown and the rural farmhouse she once called home. But a sudden call from an old neighbor forces Cat to return to the home and family she never intended to see again.  It seems that Cat’s mother is dead.What Cat finds at the old farmhouse is disturbing and confusing: a suicide note, written on lilac stationery and neatly sealed in a ziplock bag, that reads: Cat, He isn’t who you think he is. Mom xxxoooOne note, ten words–one for every year she has been gone–completely turns Cat’s world upside down. Seeking to unravel the mystery of her mother’s death, Cat must confront her past to discover who “he” might be: her tyrannical, abusive father, now in a coma after suffering a stroke? Her brother, Jared, named after her mother’s true love (who is also her father’s best friend)? The town coroner, Andrew Reilly, who seems to have known Cat’s mother long before she landed on a slab in his morgue? Or Addison Watkins, Cat’s first and only love?The closer Cat gets to the truth, the harder it is for her to repress the memory and the impact of the events that sent her away so many years ago. Taut, gripping, and edgy, The Last Bridge is an intense novel of family secrets, darkest impulses, and deep-seated love. Teri Coyne has created a stunning tapestry of pain and passion where past and present are seamlessly interwoven to tell a story that sears and warms in equal measure.",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Proven Health Tips Encyclopedia",
        "Authors": "By Corporation, American Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "American Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Year of the Hangman",
        "Authors": "By Blackwood, Gary L.",
        "Description": "In 1776, the rebellion of the American colonies against British rule was crushed.  Now, in 1777-the year of the hangman-George Washington is awaiting execution, Benjamin Franklin's banned rebel newspaper, Liberty Tree, has gone underground, and young ne'er-do-well Creighton Brown, a fifteen-year-old Brit, has just arrived in the colonies.  Having been shipped off against his will, with nothing but a distance for English authorities, Creighton befriends Franklin, and lands a job with his print shop.  But the English general expects the spoiled yet loyal Creighton to spy on Franklin.  As battles unfold and falsehoods are exposed, Creighton must decide where his loyalties lie...a choice that could determine the fate of a nation.",
        "Category": " Young Adult Fiction , Historical , United States , Colonial & Revolutionary Periods",
        "Publisher": "Speak",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Greetings from Somewhere Else",
        "Authors": "By McInerney, Monica",
        "Description": "Lainey Byrne is a master at controlled chaos, juggling her hectic, demanding job, her chef boyfriend with his crazy hours, and her roiling family with all its daily dramas. But her life truly threatens to spin out of control when her aunt May, who owns a B&B in Ireland, passes away. In order for the Byrnes to collect their inheritance, someone from the family must take over Aunt May’s business for a year. And apparently that someone is Lainey.Between running a run-down, virtually guest-free B&B (without the slightest ability to cook or clean), worrying about her family from afar, adjusting to country life, and dealing with the complications of long-distance love, Lainey is in way over her head. But when a reunion with a (gorgeous) childhood friend sparks unexpected complications, Lainey realizes that fate may have another path for her–a direction she never imagined.",
        "Category": " Fiction , Women",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "The World According to Garp: A Novel (Ballantine Reader's Circle)",
        "Authors": "By Irving, John",
        "Description": "This is the life and times of T. S. Garp, the bastard son of Jenny Fields, a feminist leader ahead of her time. This is the life and death of a famous mother and her almost-famous son; theirs is a world of sexual extremes, even of sexual assassinations. It is a novel rich with lunacy and sorrow, yet the dark, violent events of the story do not undermine a comedy both ribald and robust. In more than thirty languages, in more than forty countries–with more than ten million copies in print–this novel provides almost cheerful, even hilarious evidence of its famous last line: “In the world according to Garp, we are all terminal cases.”",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Seize The Dawn",
        "Authors": "By Drake, Shannon",
        "Description": "After she decides to marry an aging French nobleman instead of a man she despises,  Lady Eleanor of Clarin is kidnapped by fierce Highland outlaw Brendan Graham and thrown into a web of treachery, where she will discover a passion she has never known in the arms of her enemy. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Aeneid of Virgil (Bantam Classics)",
        "Authors": "By Virgil",
        "Description": "Aeneas flees the ashes of Troy to found the city of Rome and change forever the course of the Western world--as literature as well.  Virgil's Aeneid is as eternal as Rome itself, a sweeping epic of arms and heroism--the searching portrait of a man caught between love and duty, human feeling and the force of fate--that has influenced writers for over 2,000 years.  Filled with drama, passion, and the universal pathos that only a masterpiece can express. The Aeneid is a book for all the time and all people.",
        "Category": " Poetry , Ancient & Classical",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "Jericho's Fall",
        "Authors": "By Carter, Stephen L.",
        "Description": "Stephen L. Carter’s brilliant debut, The Emperor of Ocean Park, spent eleven week son the New York Times best-seller list. Now, in Jericho’s Fall, Carter turns his formidable talents to the shadowy world of spies, official secrecy, and financial fraud in a thriller that rivets the reader’s attention until the very last page.In an imposing house in the Colorado Rockies, Jericho Ainsley, former head of the Central Intelligence Agency and a Wall Street titan, lies dying. He summons to his beside Beck DeForde, the younger woman for whom he threw away his career years ago, miring them both in scandal. Beck believes she is visiting to say farewell. Instead, she is drawn into a battle over an explosive secret that foreign governments and powerful corporations alike want to wrest from Jericho before he dies.An intricate and timely thriller that plumbs the emotional depths of a failed love affair and a family torn apart by mistrust, Jericho’s Fall takes us on a fast-moving journey through the secretive world of intelligence operations and the meltdown of the financial markets. And it creates, in Beck DeForde, an unforgettable heroine for our turbulent age.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "The fire-dwellers / Margaret Laurence ; Introduction by Allen Bevan ; General Editor: Malcolm Ross.",
        "Authors": "By Laurence, Margaret",
        "Description": "",
        "Category": "",
        "Publisher": "McClelland & Stewart",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    }
]