[
    {
        "Title": "Miss Bindergarten Gets Ready for Kindergarten (Miss Bindergarten Books (Paperback))",
        "Authors": "By Wolff, Ashley (ILT) and Slate, Joseph",
        "Description": "This rhyming, brightly illustrated book is the perfect way to practice the alphabet and to introduce young children to kindergarten.It's the first day of kindergarten and Miss Bindergarten is hard at work getting the classroom ready for her twenty-six new students. Meanwhile, Adam Krupp wakes up, Brenda Heath brushes her teeth, and Christopher Beaker finds his sneaker. Miss Bindergarten puts the finishing touches on the room just in time, and the students arrive. Now the fun can begin! \"Multifaceted and appealing, this book can be enjoyed in many ways, at home and at school.\" --The New York Times Book ReviewFor readers of Kindergarten, Here I Come and The Night Before Kindergarten.",
        "Category": " Juvenile Fiction , Social Themes , New Experience",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Home Alone Survival Guide",
        "Authors": "By Hammerslough, Jane",
        "Description": "",
        "Category": "",
        "Publisher": "Trumpet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Search & Find Picture Puzzle Book - Sports",
        "Authors": "By Tallarico, Tony",
        "Description": "",
        "Category": "",
        "Publisher": "Kids Books, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Black Stallion Revolts",
        "Authors": "By Farley, Walter",
        "Description": "After the Black attacks another horse, Alec realizes that the once-wild horse needs more space and freedom, so they head out west to a huge ranch. But a terrible accident separates the two, leaving Alec with amnesia and the Black alone to reclaim the wild life to which he was born. As the Black struggles to survive, and as Alec struggles to remember who he is and his connection to the magnificent stallion in the canyon, a gripping adventure story unfolds.",
        "Category": " Young Adult Fiction , Animals , Horses",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1977"
        }
    },
    {
        "Title": "Clifford and the Runaway Rabbit (Clifford the Big Red Dog) (Big Red Reader Series)",
        "Authors": "By Margulies, Teddy Slater and Bracken, Carolyn (PHT)",
        "Description": "Emily Elizabeth asks Clifford to watch Wally, her classroom's pet bunny, but when T-Bone and Cleo want to play with him, Wally escapes and a chase begins. Original.",
        "Category": " Juvenile Fiction , Animals , General",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Photoshop 6 For Dummies",
        "Authors": "By McClelland, Deke and Obermeier, Barbara",
        "Description": "The latest, greatest update to the bestseller, providing the quick and easy way to get up to speed with the latest release of Adobe Photoshop. This is the book that hundreds of thousands of Photoshop users have turned to again and again for easy-to-understand, practical advice. In best-selling author and premier Photoshop guru Deke McClelland reveals his own techniques for quick and creative image editing, along with specific tips that Photoshop veterans can use to take advantage of the software's new features. In this book, Photoshop pros can discover tricks they can try out right away, while Photoshop novices can find ready-to-use instructions so that they can become productive quickly.",
        "Category": " Photography , Techniques , Equipment",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Story of Baby Jesus (Alice in Bibleland Storybooks)",
        "Authors": "By Davidson, Alice J.",
        "Description": "",
        "Category": "",
        "Publisher": "Peggy Pinson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Night Light",
        "Authors": "By Dean, Amy",
        "Description": "",
        "Category": "",
        "Publisher": "Hazelden",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Story of Easter for Children",
        "Authors": "By Charette, Beverly and Wells, Lorraine (ILT)",
        "Description": "Describes the symbols of spring, explains why we celebrate Christmas and Easter, and recounts Jesus' life, all in rhyme",
        "Category": "",
        "Publisher": "Ideals Publishing Corporation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Freelance Writing for Magazines and Newspapers: Breaking in Without Selling Out",
        "Authors": "By Yudkin, Marcia",
        "Description": "Covers direct submissions, interviews, article construction and revision, publication rights, and writing schedule, and tells how to start and develop one's career as a writer",
        "Category": "",
        "Publisher": "Perennial (HarperCollins)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Beauty & the Beast (Timeless Tales)",
        "Authors": "By Spenceley, Annabel (ILT) and Mathias, Robert",
        "Description": "Through her great capacity to love, a kind and beautiful maid releases a handsome prince from the spell which has made him an ugly beast",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Little Lessons for Life: Bible Wisdom for the Proverbs",
        "Authors": "By Kathy Arbuckle",
        "Description": "",
        "Category": "",
        "Publisher": "bARBOUR",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Digimon: Next Stop... Digiworld",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Modern Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "C++ Strategies and Tactics",
        "Authors": "By Murray, Robert B.",
        "Description": "Starting with the overall design of C++ programs and progressing to the detailed design of C++ classes, Murray covers abstraction, single and multiple inheritance, design for inheritance, exceptions, handles, robustness, reusability, templates, memory management, performance, documentation, packaging, and management issues. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Computers , Programming Languages , C++",
        "Publisher": "Addison-Wesley Professional",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Slide and Find In the Jungle",
        "Authors": "By Kathie Smith",
        "Description": "",
        "Category": " Juvenile Fiction , Animals , Lions, Tigers, Leopards, etc.",
        "Publisher": "Flying Frog Publication",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Epistles/Now",
        "Authors": "By Brandt, Leslie F.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Concordia Pub House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1976"
        }
    },
    {
        "Title": "Bugs Bunny's space carrot (A Golden look-look book)",
        "Authors": "By Reit, Seymour",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Dinosaur Bob and His Adventures with the Family Lazardo",
        "Authors": "By Joyce, William",
        "Description": "",
        "Category": "",
        "Publisher": "Scholastic Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Contact",
        "Authors": "By Sagan, Carl",
        "Description": "Beautiful astrophysicist Rebecca Blake deciphers long-awaited signals from space, persuades world leaders to construct a machine that many consider a Trojan Horse, and journeys into space for an epochal encounter",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Pocket Books: NY",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Jim Beckwourth: Adventures of a Mountain Man",
        "Authors": "By Sabin, Louis",
        "Description": "Examines the life and career of the nineteenth-century hunter, trapper, and trader",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "The Goat in the Rug",
        "Authors": "By Blood, Charles L and Link, Martin",
        "Description": "Geraldine is a goat, and Glenmae, a Navajo weaver. One day, Glenmae decides to weave Geraldine into a rug. First Geraldine is clipped. Then her wool is spun into fine, strong yarn. Finally, Glenmae weaves the wool on her loom. They reader learns, along with Geraldine, about the care and pride involved in the weaving of a Navajo rug -- and about cooperation between friends.",
        "Category": " Juvenile Fiction , Art & Architecture",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Amazing Picture Puzzles 2",
        "Authors": "By Tony Tallarico",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "6.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Fabric Stamping Handbook",
        "Authors": "By Laury, Jean Ray",
        "Description": "",
        "Category": " Crafts & Hobbies , Printmaking & Stamping",
        "Publisher": "C&T Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "The Ministry of Special Cases (Vintage International)",
        "Authors": "By Englander, Nathan",
        "Description": "From its unforgettable opening scene in the darkness of a forgotten cemetery in Buenos  Aires, the debut novel from the Pulitzer-nominated, bestselling author of For the Relief of Unbearable Urges casts a powerful  spell. In the heart of Argentina's Dirty War, Kaddish Poznan struggles with a son  who won't accept him; strives for a wife who forever saves him; and spends his nights  protecting the good name of a community that denies his existence. When the nightmare  of the disappeared children brings the Poznan family to its knees, they are thrust  into the unyielding corridors of the Ministry of Special Cases, a terrifying, byzantine  refuge of last resort. Through the devastation of a single family, Englander brilliantly  captures the grief of a nation.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Whole World Over",
        "Authors": "By Glass, Julia",
        "Description": "Greenie Duquette lavishes most of her passionate energy on her Greenwich Village bakery and her young son. Her husband, Alan, seems to have fallen into a midlife depression, while Walter, her closest professional ally, is nursing a broken heart. At Walter’s restaurant, the visiting governor of New Mexico tastes Greenie’s coconut cake and decides to woo her away to be his chef. For reasons both ambitious and desperate, she accepts–heading west without her husband. This impulsive decision, along with events beyond Greenie’s control, will change the course of several lives around her.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Chicken Soup for the Christian Soul (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Aubery, Patty (COM), and Mitchell, Nancy (COM)",
        "Description": "These stories will deepen your Christian faith by helping you practice Christian values in your daily life: at home, at work and in the community. This collection will open your heart to the experience and expression of more love in your life and will remind you that you are never alone or without hope, no matter how challenging and painful your circumstances may be.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "HCI",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Daniel Isn't Talking",
        "Authors": "By Leimbach, Marti",
        "Description": "Melanie Marsh is an American living in London with her British husband,  Stephen,  and their two young children. The Marshes’ orderly  home life is shattered when their son Daniel is given a devastating diagnosis. Resourceful and determined not to acceptt what others, including her husband, say is inevitable, Melanie finds an ally in the idealistic Andy, whose unorthodox ideas may just prove that Daniel is far more “normal” than anyone imagined. Daniel Isn’t Talking  is a moving story of a family in crisis, told with warmth, compassion, and humor.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Ageless Face, Ageless Mind: Erase Wrinkles and Rejuvenate the Brain",
        "Authors": "By Perricone, Nicholas",
        "Description": "In this revolutionary book, bestselling author and anti-aging expert Dr. Nicholas Perricone reveals a completely new and hidden threat to our looks and our health–and gives us a program to defeat it.Dr. Nicholas Perricone has gotten to the bottom of accelerated aging with the discovery of AGEs (Advanced Glycation End Products). AGEs are at least as detrimental to our health as transfats but have been largely unknown outside the medical community. AGEs give us wrinkles, but they have also been implicated in serious age-related conditions that cut across all medical specialties, from Alzheimer’s and cataracts to cardiovascular disease, diabetes, and cancer. Yet we have not had strategic interventions for stopping and reversing the effects of AGEs until now. Dr. Perricone shows us how to win the fight against AGEs with a three-part plan of attack that includes a nutritional program, targeted supplements, and new topicals. His groundbreaking program helps to • erase wrinkles and firm sagging skin • reverse age-related memory loss• heal cardiovascular disease• stop precursors of cancer• prevent symptoms of diabetesAgeless Face, Ageless Mind brings us not only a new and exciting field of research and its remarkable discoveries, but also a way to fight one of the biggest hidden threats to our immediate and long-term health.",
        "Category": " Self-help , Aging",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "A Woman in Charge: The Life of Hillary Rodham Clinton",
        "Authors": "By Bernstein, Carl",
        "Description": "Carl Bernstein’s stunning portrait of Hillary Rodham Clinton shows us, as nothing else has, the true trajectory of her life and career with its zigzag bursts of risks taken and safety sought. Marshaling all the skills and energy that propelled his history-making Pulitzer Prize reporting on Watergate, Bernstein gives us the most detailed, sophisticated, comprehensive, and revealing account we have had of the complex human being and political meteor who has already helped define one presidency and may well become, herself, the woman in charge of another.We see the shaping of Hillary as a self-described “mind conservative and heart liberal” —her ostensibly idyllic Midwestern girlhood (her mother a nurturer, but her father a disciplinarian, harsher than she has acknowledged); her early development of deep religious feelings; her curiosity fueled by dedicated teachers, by exposure to Martin Luther King Jr., by the ferment of the sixties, and, above all, by a desire to change the world. At Wellesley, we watch Hillary, a Republican turned Democrat, thriving in the new sky’s-the-limit freedom for women, already perceived as a spokeswoman for her generation, her commencement speech celebrated in Life magazine. And the book takes us to Yale Law School as Hillary meets and falls in love with Bill Clinton and cancels her dream to go her own way, to New York or Washington, tying her fortune, instead, to his in Arkansas.Bernstein clarifies the often amazing dynamic of their marriage, shows us the extent to which Hillary has been instrumental in the triumphs and troubles of Bill Clinton’s governorship and presidency, and sheds light on her own political brilliance and her blind spots—especially her suspicion and mishandling of the press and her overt hostility to the opposition that clouded her entry into the capital. He untangles her relationship to Whitewater, Troopergate, and Travelgate. He leads us to understand the failure of her health care initiative.In the emotional and political chaos of the Lewinsky affair we see Hillary, despite her immense hurt and anger, standing by her husband—evoking a rising wave of sympathy from a public previously cool to her. It helps carry her into the Senate, where she applies the political lessons she has learned. It is now her time. As she decides to run for president, her husband now her valued aide, she has one more chance to fulfill her ambition for herself—to change the world.In his preparation for A Woman in Charge, Bernstein reexamined everything pertinent written about and by Hillary Clinton. He interviewed some two hundred of her colleagues, friends, and enemies and was allowed unique access to the candid record of the 1992 presidential campaign kept by Hillary’s best friend, Diane Blair.He has given us a book that enables us, at last, to address the questions Americans are insistently—even obsessively—asking about Hillary Clinton: What is her character? What is her political philosophy? Who is she? What can we expect of her?",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Knopf",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Compulsion (Alex Delaware, No. 22)",
        "Authors": "By Kellerman, Jonathan",
        "Description": "Once again, the depths of the criminal mind and the darkest side of a glittering city fuel #1 New York Times bestselling author Jonathan Kellerman’s brilliant storytelling. And no one conducts a more harrowing and suspenseful manhunt than the modern Sherlock Holmes of the psyche, Dr. Alex Delaware. A tipsy young woman seeking aid on a desolate highway disappears into the inky black night. A retired schoolteacher is stabbed to death in broad daylight. Two women are butchered after closing time in a small-town beauty parlor. These and other bizarre acts of cruelty and psychopathology are linked only by the killer’s use of luxury vehicles and a baffling lack of motive. The ultimate whodunits, these crimes demand the attention of LAPD detective Milo Sturgis and his collaborator on the crime beat, psychologist Alex Delaware.What begins with a solitary bloodstain in a stolen sedan quickly spirals outward in odd and unexpected directions, leading Delaware and Sturgis from the well-heeled center of L.A. society to its desperate edges; across the paths of commodities brokers and transvestite hookers; and as far away as New York City, where the search thaws out a long-cold case and exposes a grotesque homicidal crusade. The killer proves to be a fleeting shape-shifter, defying identification, leaving behind dazed witnesses and death–and compelling Alex and Milo to confront the true face of murderous madness.From the Trade Paperback edition.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Translator: A Tribesman's Memoir of Darfur",
        "Authors": "By Hari, Daoud, Burke, Dennis Michael (CON), and McKenna, Megan M. (CON)",
        "Description": "I am the translator who has taken journalists into dangerous Darfur. It is my intention now to take you there in this book, if you have the courage to come with me.The young life of Daoud Hari–his friends call him David–has been one of bravery and mesmerizing adventure. He is a living witness to the brutal genocide under way in Darfur.The Translator is a suspenseful, harrowing, and deeply moving memoir of how one person has made a difference in the world–an on-the-ground account of one of the biggest stories of our time. Using his high school knowledge of languages as his weapon–while others around him were taking up arms–Daoud Hari has helped inform the world about Darfur.Hari, a Zaghawa tribesman, grew up in a village in the Darfur region of Sudan. As a child he saw colorful weddings, raced his camels across the desert, and played games in the moonlight after his work was done. In 2003, this traditional life was shattered when helicopter gunships appeared over Darfur’s villages, followed by Sudanese-government-backed militia groups attacking on horseback, raping and murdering citizens and burning villages. Ancient hatreds and greed for natural resources had collided, and the conflagration spread.Though Hari’s village was attacked and destroyedhis family decimated and dispersed, he himself escaped. Roaming the battlefield deserts on camels, he and a group of his friends helped survivors find food, water, and the way to safety. When international aid groups and reporters arrived, Hari offered his services as a translator and guide.  In doing so, he risked his life again and again, for the government of Sudan had outlawed journalists in the region, and death was the punishment for those who aided the “foreign spies.” And then, inevitably, his luck ran out and he was captured. . . . The Translator tells the remarkable story of a man who came face-to-face with genocide– time and again risking his own life to fight injustice and save his people.",
        "Category": " Language Arts & Disciplines , Translating & Interpreting",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Therapeutic Touch: How to Use Your Hands to Help or Heal",
        "Authors": "By KRIEGER, Dolores",
        "Description": "Describes methods for harnessing natural energies of the body and directing them for the healing of one's self or others, offering personal accounts of the process as both healer and healee",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Be the Pack Leader: Use Cesar's Way to Transform Your Dog . . . and Your Life",
        "Authors": "By Millan, Cesar",
        "Description": "Bestselling author Cesar Millan takes his principles of dog psychology a step further, showing you how to develop the calm-assertive energy of a successful pack leader and use it to improve your dog’s life–and your own.Filled with practical tips and techniques as well as real-life success stories from his clients (including the Grogan family, owners of Marley from Marley & Me) and his popular television show Dog Whisperer with Cesar Millan, Cesar helps you understand and read your dog’s energy as well as your own so that you can move beyond just correcting behavioral issues and take your connection with your dog to the next level. The principles of calm-assertive energy will help you become a better pack leader in every area of your life, improving your relationships with friends, family, and coworkers.In addition, Cesar addresses several important issues for the first time, including what you need to know about the major dog behavior tools available and the difference between “personality” and “instability.” Ultimately, what emerges from Be the Pack Leader are both happier dogs and happier, more centered owners.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Dr. Perricone's 7 Secrets to Beauty, Health, and Longevity: The Miracle of Cellular Rejuvenation",
        "Authors": "By Perricone, Nicholas",
        "Description": "He has shown us how to smooth our wrinkles, and helped us slim down without feeling deprived. Now #1 New York Times bestselling author Dr. Nicholas Perricone gives us an anti-aging program that unveils the miracle of cellular rejuvenation. These seven powerful strategies are not only easy to follow but present a plan for total health designed to help us look and feel great by age-proofing us from the inside out. Taking a holistic approach that taps into cutting-edge science, Dr. Nicholas Perricone reveals how to rev up our cellular metabolism so that we can stay healthy, strong, and energetic, while keeping our skin soft, smooth, and supple. These strategies will help us reverse osteoporosis, restore bone structure and muscle mass, revitalize brain cells, reduce the chances of heart disease and cancer, elevate mood, manage blood sugar, and slim down and stay trim. Inside Dr. Perricone’s 7 Secrets to Beauty, Health, and Longevity you will discover• the six kinds of food you need to eat every day, as well as healthy and delicious snacks–including a vegetable that both suppresses appetite and builds muscle• new findings about the best nutritional supplements to win the fight against aging• revolutionary skin rejuvenating secrets for radiant, toned, and youthful-looking skin• the role of pheromones in curbing depression, boosting self-confidence, triggering weight loss, and improving libido• the essential oil that is more powerful than antibiotics• an exercise plan that will shape your silhouette and strengthen your bones in as little as ten minutes a day• delicious recipes, easy shopping lists, and a guide to safe cookware so that you can create your own anti-aging kitchen• Dr. Perricone’s trademark tips about new products that really work–and where to find themWhether your aim is to look younger, improve your health, or just feel great, you’ll see fast results by following Dr. Perricone’s simple program. These seven indispensable secrets will keep you beautiful, healthy, and young all through life.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Duke Diet: The World-Renowned Program for Healthy and Lasting Weight Loss",
        "Authors": "By Eisenson, Howard J., M.D. and Binks, Martin",
        "Description": "The Duke Diet & Fitness Center offers one of the most prestigious weight-loss programs in America. Duke’s comprehensive approach brings together the best available scientific evidence and is strengthened by more than thirty-five years of experience. The Duke program is also one of the most successful: Participants lose on average three pounds per week, and 80 percent of Duke participants surveyed one year after completing the program had maintained or improved their weight loss. Now, at last, program director Howard Eisenson, M.D., and behavioral health director Martin Binks, Ph.D., of the Duke Diet & Fitness Center, bring the Duke approach to everyone–with a plan that will help us all lose the weight, keep it off, and get healthy. The Duke Diet takes a balanced and personalized approach to weight loss that covers nutrition, fitness, and behavioral strategies, all to help us overcome obstacles and achieve lasting success. Drs. Eisenson and Binks distill their methods–previously available only to those paying nearly $10,000 for a monthlong stay–that have made the Duke Diet & Fitness Center famous. They show us that slimming down is not just about finding new ways to eat and exercise but also involves learning new ways to think about food, fitness, and a healthy lifestyle. The Duke Diet is about losing weight–but it’s also about gaining health. The core of this life-changing diet is a four-week step-by-step program that allows you to• choose from two delicious eating plans based on two different carb levels • eat foods you love from six food groups, with portions balanced to help you lose excess body fat in a safe and lasting way• select from daily menus and dozens of recipes from the Duke kitchens, including tips for modifying your favorite dishes so you can savor the tastes you love, even while you stick to your eating plan. • make peace with exercise, formulate the right fitness plan for yourself, and get started! • find your barriers to lasting weight loss and learn strategies to help you consistently make better choices for a healthier and happier lifeIncluding a simple follow-up plan for continued success and lasting weight loss, The Duke Diet also features personal advice from Drs. Eisenson and Binks, commentary on health problems associated with excess weight, patient success stories, and frequently asked questions to keep you informed and inspired as you become slimmer, fitter, and–most important–healthier! At last, here’s a book that will give you the tools you need to lose the weight and keep it off. The Duke Diet: Dieting done right.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "National Geographic Traveler: Florence & Tuscany, 2d Ed.",
        "Authors": "By Jepson, Tim",
        "Description": "Completely revised and updated guidebooks from the award-winning, internationally acclaimed series. Profusely illustrated with full-color maps, photographs, and specially commissioned artwork, packed with detailed information, savvy advice, and much more, they're a favorite with travelers everywhere&#151;and the critics love them as well. \"Sensational photos, superb maps, and prose that's authoritative.\" &#151;San Francisco Chronicle \"It's like reading and looking at a really in-depth National Geographic essay.\" &#151;Seattle Times \"All the glossy thoroughness you would expect from the brand name, with an impressive list of contributors.\"&#151;The Times (London) \"Some of the handsomest volumes you'll ever find on a shelf of travel books.\" &#151;Toronto Star \"Filled with beautiful photography, and excellent color maps; after all, this is National Geographic, a publisher that's had about a hundred years experience in doing this kind of thing.\" &#151;The Tennessean",
        "Category": " Travel , Europe , Italy",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The World Is Flat 3.0: A Brief History of the Twenty-first Century (Further Updated and Expanded)",
        "Authors": "By Friedman, Thomas L.",
        "Description": "A New Edition of the Phenomenal #1 Bestseller\"One mark of a great book is that it makes you see things in a new way, and Mr. Friedman certainly succeeds in that goal,\" the Nobel laureate Joseph E. Stiglitz wrote in The New York Times reviewing The World Is Flat in 2005. In this new edition, Thomas L. Friedman includes fresh stories and insights to help us understand the flattening of the world. Weaving new information into his overall thesis, and answering the questions he has been most frequently asked by parents across the country, this third edition also includes two new chapters--on how to be a political activist and social entrepreneur in a flat world; and on the more troubling question of how to manage our reputations and privacy in a world where we are all becoming publishers and public figures.The World Is Flat 3.0 is an essential update on globalization, its opportunities for individual empowerment, its achievements at lifting millions out of poverty, and its drawbacks--environmental, social, and political, powerfully illuminated by the Pulitzer Prize--winning author of The Lexus and the Olive Tree.",
        "Category": " History , United States , 21st Century",
        "Publisher": "Picador",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Start Late, Finish Rich: A No-Fail Plan for Achieving Financial Freedom at Any Age",
        "Authors": "By Bach, David",
        "Description": "David Bach has a plan to help you live and finish rich—no matter where you startSo you feel like you’ve started late?You are not alone.  What if I told you that right now as you flip through this book, 70% of the people in the store with you are living paycheck to paycheck?What if I told you that the man browsing the aisle to your left owes more than $8,000 in credit card debt?  And the woman on your right has less than $1,000 in savings? See? You’re really not alone.Unfortunately, the vast majority of people who’ve saved too little and borrowed too much will never catch up financially. Why? Because they don’t know how.You can start late and finish rich—but you need a plan.This book contains the plan. It’s inspiring, easy to follow, and is based on proven financial principles.  Building a secure financial future for yourself isn’t something you can do overnight. It will take time and it will take work. But you can do it.    I know. I’ve helped millions of people get their financial lives together—and I can help you.  Spend a few hours with me—and let me challenge you.  Give me a chance to become your coach.  Just because you started late doesn’t mean you are doomed to an uncertain future.  Whether you’re in your thirties, forties, fifties, or beyond, there is still time to turn things around.  It’s never too late to live and finish rich. All it takes is the decision to start.—David BachIs it too late for me to get rich?Over and over, people share their fears with David Bach, America’s leading money coach and the number-one national best-selling author of The Automatic Millionaire. “If only I had started saving when I was younger!” they say. “Is there any hope for me?”There IS hope, and help is here at last!In Start Late, Finish Rich, David Bach takes the “Finish Rich” wisdom that has already helped millions of people and tailors it specifically to all of us who forgot to save, procrastinated, or got sidetracked by life’s unexpected challenges.Whether you are in your thirties, forties, fifties, or even older, Bach shows that you really can start late and still live and finish rich – and you can get your plan in place fast. In a motivating, swift read you learn how to ramp up the road to financial security with the principles of spend less, save more, make more – and most important, LIVE MORE. And he gives you the time tested plan to do it.The Start Late, Finish Rich promise is bold and clear:Even if you are buried in debt – there is still hope.You can get rich in real estate – by starting small.Find your “Latte Factor” – and turbo charge it to save money you didn’t know you had.You can start a business on the side – while you keep your old job and continue earning a paycheck.You can spend less, save more and make more – and it doesn’t have to hurt.David Bach gives you step-by-step instructions, worksheets, phone numbers and website addresses --everything you need to put your Start Late plan into place right away. And he shares the stories of ordinary Americans who have turned their lives around, at thirty, forty, fifty, even sixty years of age, and are now financially free. They did it, and now it’s your turn. With David Bach at your side, it’s never too late to change your financial destiny. It’s never too late to live your dreams. It’s never too late to be free.",
        "Category": " Business & Economics , Motivational",
        "Publisher": "Currency",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Happy Birthday, Ronald Morgan!",
        "Authors": "By Natti, Susanna (ILT) and Giff, Patricia Reilly",
        "Description": "Ronald despairs when he realizes that his birthday falls on the day after school ends, and he will not have a classroom party like everyone else in his class",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Patriotic Crafts: 60 Spirited Projects That Celebrate America",
        "Authors": "By Rankin, Chris",
        "Description": "",
        "Category": "",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Cinderella (Disney's Wonderful World of Reading)",
        "Authors": "By Walt Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier Enterprises",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Aristocrats: The Illustrated Companion",
        "Authors": "By Tillyard, Stella",
        "Description": "When Lady Caroline Lennox ran away with the ambitious politician Henry Fox in 1744 she could have had no idea that the elopement marked the beginning of a family drama in which, for the next fifty years, she and her three sisters Emily, Louisa, and Sarah tried to achieve happiness in an often hostile world. Mistresses of some of the grandest houses in England and Ireland - Holland House, Leinster House, Carton and Castletown - their lives were splendidly magnificent. They left behind not just a vast written archive, but the portraits, furniture, houses and gardens that they had commissioned, bought and created. This volume, which accompanies the TV drama series, not only portrays their treasure trove of houses, objects and paintings but also uses stills taken on location to show the actors in their settings and costumes. In her text Stella Tillyard uses new material from the sisters' letters to take us deep into their opinions, tastes and habits and to describe how and where they bought their furniture and found their gardeners and how they filled their days in country and in town.",
        "Category": " History , Europe , Great Britain",
        "Publisher": "Cassell",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Fast & Easy Techniques for Building Modern Cabinetry",
        "Authors": "By Proulx, Danny",
        "Description": "",
        "Category": " Crafts & Hobbies , Furniture & Cabinetry",
        "Publisher": "Betterway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Ten Days in the Hills",
        "Authors": "By Smiley, Jane",
        "Description": "In the aftermath of the  2003 Academy Awards, Max and Elena- he's an Oscar-winning writer/director-open their Holywood Hills home to a group of friends and neighbors, industy insiders and hangers-on, eager to escape the outside world and dissect the latest news, gossip, and secrets of the business. Over the next ten days, old lovers collide, new relationships form, and sparks fly, all with Smiley's signature sparkling wit and characterization. With its breathtaking passion and sexy irreverence, Ten Days in the Hills is a glowing addition to the work of one of our most beloved novelists.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Disney's Pooh's Grand Adventure: The Search for Christopher Robin (A Little Golden Book)",
        "Authors": "By Korman, Justine and Rigol (ILT)",
        "Description": "When they can't find Christopher Robin, Pooh and his friends undertake a perilous search for him, and learn they're smarter, braver, and more loyal than they ever dreamed they'd be.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Zoli: A Novel",
        "Authors": "By McCann, Colum",
        "Description": "From the National Book Award–winning author of Let the Great World Spin, this haunting novel is an examination of intimacy and betrayal in a community rarely captured so vibrantly in contemporary literature.   NAMED ONE OF THE BEST BOOKS OF THE YEAR BY THE WASHINGTON POST AND THE CHRISTIAN SCIENCE MONITOR  Zoli Novotna, a young woman raised in the traveling  Gypsy tradition, is a poet by accident as much as desire. As 1930s fascism spreads  over Czechoslovakia, Zoli and her grandfather flee to join a clan of fellow Romani  harpists. Sharpened by the world of books, which is often frowned upon in the Romani  tradition, Zoli becomes the poster girl for a brave new world. As she shapes the  ancient songs to her times, she finds her gift embraced by the Gypsy people and savored  by a young English expatriate, Stephen Swann.  But Zoli soon finds that when she  falls she cannot fall halfway–neither in love nor in politics. While Zoli’s fame  and poetic skills deepen, the ruling Communists begin to use her for their own favor.  Cast out from her family, Zoli abandons her past to journey to the West, in a novel  that spans the 20th century and travels the breadth of Europe.Colum McCann has created a sensuous novel about exile, belonging and survival, based loosely on the true story of the Romani poet Papusza. It spans the twentieth century and travels the breadth of Europe. In the tradition of Steinbeck, Coetzee, and Ondaatje, McCann finds the art inherent in social and political history, while vividly depicting how far one gifted woman must journey to find where she belongs.Praise for Zoli“Very powerful . . . rich in vivid detail . . . the prose is just plain gorgeous. . . . McCann allows us to enter a world few of us know anything about.”—San Francisco Chronicle   “[A] beautifully written [novel] loosely based on the life of the Polish Gypsy poet ‘Papusza,’ who lived throughout most of the twentieth century. . . . Beautifully conceived, wonderfully told, the story is proof of an indomitable spirit. The elusive character of Zoli, the brilliang artist, is unforgettable.”—The Washington Post Book World   “McCann is a writer of large and driving vision. . . . [Zoli] contains passages of stunning lyricism and sharp ironic force.”—The New York Times “Rich and sensuous . . . McCann’s research and lustrous prose bring Zoli vibrantly alive.”—Entertainment Weekly",
        "Category": " Fiction , Literary",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Working Hard With the Mighty Crane (Tonka, Storybooks)",
        "Authors": "By Petruccio, Steven James (ILT), Korman, Justine, and Tonka Corporation (COR)",
        "Description": "Preschoolers can learn about the driver of the Mighty Crane and all the things that the crane can do as he works many tough jobs throughout the neighborhood during a busy week on the job. Original.",
        "Category": "",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Return: An Inspector Van Veeteren Mystery (3) (Inspector Van Veeteren Series)",
        "Authors": "By Thompson, Laurie (TRN) and Nesser, Hakan",
        "Description": "International Bestseller Chief Inspector Van Veeteren is forced to unlock the secrets of a nearly perfect  murder in this taut psychological thriller.On a rainy April day, a body—or what  is left of it—is found by a young girl. Wrapped in a blanket with no hands, feet,  or head, it signals the work of a brutal, methodical killer. The victim, Leopold  Verhaven, was a track star before he was convicted for killing two of his ex-lovers.  He consistently proclaimed his innocence, however, and was killed on the day of his  return to society. This latest murder is more than a little perplexing and Chief  Inspector Van Veeteren is determined to discover the truth, even if it means taking  the law into his own hands.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Vintage Crime/Black Lizard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Manual: A True Bad Boy Explains How Men Think, Date, and Mate--and What Women Can Do to Come Out on Top",
        "Authors": "By Santagati, Steve and Cohen, Arianne",
        "Description": "How many times have you and your friends asked one another these questions without ever coming up with any good answers? Your girlfriends just tell you what you want to hear. At the end of the day, the only person who can give you insight into man problems is—that’s right—a man! But guys have hidden agendas. What guy would give up all his dating advantages by spilling the goods?Steve Santagati would. A self-confessed serial dater and Bad Boy, Steve is telling all for the benefit of womankind. Every guy is at least part Bad Boy, and in The Manual, this prime specimen reveals what every woman needs to know to counter Bad Boy tactics, both amateur and professional. Steve is never condescending or callous, but honest, perceptive, and street-smart. His guidance is straightforward and his insights are dead-on, giving women tools they can immediately put to work.Discover what you may not want to know but need to know about:•The Heart of the Bad Boy (i.e., the nature of the beast)•The Male Mind: how he sees you and how you can make this worko your advantage •Guys on the Hunt: the male modus operandi, from the grocery store to Home Depot•When Boy Meets Girl: how to handle dating, from flirting to “sext” messaging to learning his weaknesses•Mating: so you’ve got him . . .  should you keep him?Why learn from a Bad Boy instead of, say, a psychologist? Because there’s no replacement for “in the field” experience. You’ll benefit from (and laugh at) stories of real things Steve has done in relationships with women as well as of women turning the tables on him when he least expected it. The book also includes a question-and-answer section, in which Steve explores some of the toughest dating issues. To understand Steve is to understand the Bad Boy, and that will take you a long way in understanding all men. Find out how much more fun dating can be when you get the upper hand on Bad Boys . . . for good.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Crown Archetype",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Good Husband of Zebra Drive (No. 1 Ladies' Detective Agency, Book 8)",
        "Authors": "By McCall Smith, Alexander",
        "Description": "Fans around the world adore the bestselling No. 1 Ladies’ Detective Agency series and its proprietor, Precious Ramotswe, Botswana’s premier lady detective. In this charming series, Mma  Ramotswe—with help from her loyal associate, Grace Makutsi—navigates her cases and her personal life with wisdom, good humor, and the occasional cup of tea. There is rarely a dull moment in the life of Precious Ramotswe, and on Zebra Drive and Tlokweng Road many changes are afoot. Mr. J.L.B. Matekoni wants be put in charge of a case involving an errant husband, and Mma Makutsi is considering leaving the agency, taking her near perfect score on the Botswana Secretarial College typing exam with her. Meanwhile, Mma Ramotswe has been asked to investigate a series of unexpected deaths at the hospital in Mochudi. Along the way, she encounters other tricky mysteries, and once again displays her undying love for Botswana, a country of which she is justly proud.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "I Wear My Tutu Everywhere! (All Aboard Books (Paperback))",
        "Authors": "By Lewison, Wendy Cheyette, Morgan-Vanroyen, Mary (ILT), and Morgan, Mary",
        "Description": "Tilly loves her tutu, and she never wants to take it off. She wears it everywhere--in the pool, at the zoo, even in the rain! So what will Tilly do when her tutu accidentally gets torn?",
        "Category": " Juvenile Fiction , Performing Arts , Dance",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Windy City: A Novel of Politics",
        "Authors": "By Simon, Scott",
        "Description": "The acclaimed author of the intensely powerful novel Pretty Birds, Scott Simon now gives us a story that is both laugh-out-loud funny and heart-piercing–as sprawling and brawling as Chicago, where politics is a contact sport.The mayor of Chicago is found in his office late at night, sitting in his boxer shorts, facedown dead in a pizza. The mayor was a hero and a rascal: dynamic, charming, ingenious, corruptible, and a masterly manipulator. The city mourns. But it’s discovered that the mayor was murdered–shortly after he may have begun to squeal on some of his colleagues at City Hall. Over the next four days, police race to find the mayor’s killer, while the politicians who bemoan his passing scramble for his throne. At the center is Sundaran “Sunny” Roopini, forty-eight, alderman of the Forty-eighth Ward, and vice-mayor. Sunny is an Indian immigrant, a restaurant owner, and a recent widower. He is getting tired of politics and wants to hold on just long enough to do the best for his two restive teenage daughters. But as acting interim mayor for a few days, Sunny must deal with forty-nine other aldermen who have their own clashing ambitions.How will Sunny do what’s best for both his family and city in a time of crisis?As The Last Hurrah embodied urban politics for a previous generation, Windy City captures politics in the multiethnic tumult of today’s big city, where a stalled subway raises fears of a terrorist attack and smoke-filled rooms are abolished by no-smoking statutes. The story takes a raft of colorful characters–pinky-ringed pols, pious reformers, money-grubbers, and wheeler-dealers of every creed, color, and proclivity–through City Hall corridors, neighborhood restaurants and clubs, weddings, sex scandals, gospel churches, police stations, and sting operations to deliver an ending that is unexpectedly noble.Windy City is a roller coaster of a novel that dips and soars through the amusement park of politics. With echoes of Primary Colors and Thank You for Smoking, Windy City will win votes as the best political novel in many years. Its personal story–about a flawed, decent man thrust suddenly under hot lights–will also win hearts.Praise for Windy City: “Delectable… Offers an insider’s view of the kind of urban political fray–albeit fictional–that Barack Obama emerged from as an Illinois state legislator representing Chicago’s South Side…. Windy City’s articulate and witty protagonist … must juggle dirty secrets and deal making…”–USA Today“Comic but sneakily affecting… The rich multiculturalism of the American city is not a new phenomenon… rarely, however, has it been depicted with such unabashed affection... The zeal with which he celebrates the city, warts and all, is hard to resist..  Simon’s choice of hero…is an immensely appealing figure.”–Washington Post Book World“Pitch-perfect… Scott Simon, NPR host, knows his way around politics… His dialogue throws off sparks and shrieks like a Chicago El-car…Recommended to all political junkies.”–The Roanoke Times (Virginia)“A hilarious satirical novel about politics.”–Clarence Page, The Chicago Tribune“Entertaining and well-observed… renders the inner workings of City Hall with wit and aplomb….Some of Simon’s Chicagoans may be con artists, crooks, amoral opportunists or blowhards, sometimes all of the above, but the author still treats them with great affection and respect, creating an impressively large and diverse cast of characters”–Adam Langer, The Chicago Tribune“[A] great novel… filled with emotional turmoil, gritty political decisions, murders, homicide attempts, a suicide and even a touch of romance…[a] human and fully realized portrait of the people caught up in contemporary public life.”–Time Out Chicago“[A] big-hearted bear-hug of a novel… embracing roots and family, eccentricities and failings, and dappled with the sights, sounds and grit of the Windy City–makes this an energizing and loving contemporary urban fable.”–GO Magazine, AirTran Airways“A rather sentimental, positive picture of the democratic process.” —Pittsburgh Post-Gazette“Windy City is funny and tender… full of boisterous love for the sport of politics and Chicago.  The best political novel in years.”–Christopher Buckley, author of Boomsday and Thank You for Smoking",
        "Category": " Fiction , Political",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "I Just Forgot (A Little Critter Book)",
        "Authors": "By Mayer, Mercer and Mayer, Mercer (ILT)",
        "Description": "Mercer Mayer’s Little Critter is having a very forgetful day in this classic, funny, and heartwarming book. Whether he’s forgetting his lunchbox, forgetting to put on his rain boots, or forgetting to turn off the water, both parents and children alike will relate to this beloved story. A perfect way to teach children about responsibility!",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "What a Bad Dream (A Golden Look-Look Book)",
        "Authors": "By Mayer, Mercer and Mayer, Mercer (ILT)",
        "Description": "Mercer Mayer’s Little Critter is having a very bad dream in this classic, funny, and heartwarming book. Whether he’s tossing in his sleep or needing a warm glass of milk, both parents and children alike will relate to this beloved story. A perfect way to alleviate any fears of bad dreams!",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "All by Myself (Little Critter) (Look-Look)",
        "Authors": "By Mayer, Mercer and Mayer, Mercer (ILT)",
        "Description": "Mercer Mayer’s Little Critter wants to show you all the things he can do for himself in this classic, funny, and heartwarming book. Whether he’s tying his shoes, coloring a picture, or riding his bike, both parents and children alike will relate to this beloved story. A perfect way to teach children about independence!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Forgive Me: A Novel",
        "Authors": "By Ward, Amanda Eyre",
        "Description": "From the acclaimed author of How to Be Lost comes a gorgeous new novel about love, memory, and motherhood.Nadine Morgan travels the world as a journalist, covering important events, following dangerous leads, and running from anything that might tie her down. Since an assignment in Cape Town ended in tragedy and regret, Nadine has not returned to South Africa, or opened her heart–until she hears the story of Jason Irving. Jason, an American student, was beaten to death by angry local youths at the height of the apartheid era. Years later, his mother is told that Jason’s killers have applied for amnesty. Jason’s parents pack their bags and fly from Nantucket to Cape Town. Filled with rage, Jason’s mother resolves to fight the murderers’ pleas for forgiveness.As Nadine follows the Irvings to beautiful, ghost-filled South Africa, she is flooded with memories of a time when the pull toward adventure and intrigue left her with a broken heart. Haunted by guilt and a sense of remorse, and hoping to lose herself in her coverage of the murder trial, Nadine grows closer to Jason’s mother as well as to the mother of one of Jason’s killers–with profound consequences. In a country both foreign and familiar, Nadine is forced to face long-buried demons, come to terms with the missing pieces of her own family past, and learn what it means to truly love and to forgive.With her dazzling prose and resonant themes, Amanda Eyre Ward has joined the ranks of such beloved American novelists as Anne Tyler and Ann Patchett. Gripping, darkly humorous, and luminous, Forgive Me is an unforgettable story of dreams and longing, betrayal and redemption.",
        "Category": " Fiction , Cultural Heritage",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "In an Instant: A Family's Journey of Love and Healing",
        "Authors": "By Woodruff, Lee and Woodruff, Bob",
        "Description": "In January 2006, Lee and Bob Woodruff seemed to have it all–a happy marriage, four beautiful children, and marvelous careers. Bob had just been named co-anchor of ABC’s World News Tonight, but then, while he was embedded with the military in Iraq, an improvised explosive device went off near the tank he was riding in. He and his cameraman, Doug Vogt, were hit, and Bob suffered a traumatic brain injury that nearly killed him.In an Instant is the frank and compelling account of how Bob and Lee Woodruff’s lives came together, were blown apart, and then were miraculously put together again–and how they persevered, with grit but also with humor, through intense trauma and fear. More than a dual memoir of love and courage, In an Instant is an important, wise, and inspiring guide to coping with tragedy–and an extraordinary drama of marriage, family, war, and nation.#1 New York Times Bestseller“Gripping . . . The Woodruffs’ devotion to each other is palpable. . . . [In an Instant is] a remarkably lucid, even engrossing story of . . . Bob Woodruff’s recovery, interwoven with tales from his marriage and family life.”–San Jose Mercury News“Both Woodruffs [shoot] from the hip, writing with candor about their ordeal and describing it with an intimacy that couldn’t be captured on camera. . . . Their frankness heightens the book’s impact.”–The New York Times“Extraordinary . . . All sorts of themes thread their way through this frank, inspiring book: courage in the face of adversity; the pursuit of career at the expense of family; the bravery of foreign correspondents; the fortitude of female friendship. . . . Woodruff’s survival story comforts.”–The Seattle Times“A testimony to the power of the human spirit, to the catharsis of love and to infinite hope.”–The Oklahomanwww.bobwoodrufffamilyfund.org",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Just Go to Bed (Little Critter) (Pictureback(R))",
        "Authors": "By Mayer, Mercer",
        "Description": "Mercer Mayer’s Little Critter is not looking forward to bedtime in this classic, funny, and heartwarming book. Whether it’s time for him to stop playing and take a bath, or when he puts up a fuss getting into is jammies, both parents and children alike will relate to this beloved story. A great way to introduce children to their very own bedtime routine!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Where are my shoes?",
        "Authors": "By Dudko, Mary Ann",
        "Description": "Baby Bop finds a different kind of footwear in every room in the house as she searches for her own shoes",
        "Category": "",
        "Publisher": "Barney Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Ugly Duckling (Fairy Tale Classics Storybook)",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Landoll",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Smart Women Finish Rich: 9 Steps to Achieving Financial Security and Funding Your Dreams",
        "Authors": "By Bach, David",
        "Description": "With hundreds of thousands copies in print around the world, Smart Women Finish Rich, by renowned financial advisor David Bach, has shown women of all ages and backgrounds how to take control of their financial future and finish rich.  Whether you’re working with a few dollars a week or a significant inheritance, Bach’s nine-step program gives you tools for spending wisely, establishing security, and aligning money with your values.  Plus, in this completely revised and updated edition, David Bach includes critical new long-term investment advice, information on teaching your kids about money, Internet resources, and new ways to attract greater wealth–personal and financial–into your life.",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "Currency",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Itchy, Itchy Chicken Pox (Hello Reader!, Level 1)",
        "Authors": "By MacCarone, Grace and Lewin, Betsy (ILT)",
        "Description": "Peppy rhymes present the humorous side to a common ailment.",
        "Category": " Juvenile Fiction , Health & Daily Living , Diseases, Illnesses & Injuries",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Eyes on Nature: Wolves and Coyotes",
        "Authors": "By Resnick, Jane Parker",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Grand Avenues: The Story of Pierre Charles L'Enfant, the French Visionary Who Designed Washington, D.C.",
        "Authors": "By Berg, Scott W.",
        "Description": "In 1791, shortly after the United States won its independence, George Washington personally asked Pierre Charles L’Enfant—a young French artisan turned American revolutionary soldier who gained many friends among the Founding Fathers—to design the new nation's capital. L’Enfant approached this task with unparalleled vigor and passion; however, his imperious and unyielding nature also made him many powerful enemies. After eleven months, Washington reluctantly dismissed L’Enfant from the project. Subsequently, the plan for the city was published under another name, and L’Enfant died long before it was rightfully attributed to him. Filled with incredible characters and passionate human drama, Scott W. Berg’s deft narrative account of this little-explored story in American history is a tribute to the genius of Pierre Charles L'Enfant and the enduring city that is his legacy.",
        "Category": " Architecture , History , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "29.13",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Double Bind (Vintage Contemporaries)",
        "Authors": "By Bohjalian, Christopher A.",
        "Description": "From the bestselling author of The Flight Attendant, here is a gripping psychological novel of obsession and consequence.When Laurel Estabrook is attacked while riding her bicycle through Vermont’s back  roads, her life is forever changed. Formerly outgoing, Laurel withdraws into her  photography, spending all her free time at a homeless shelter. There she meets Bobbie  Crocker, a man with a history of mental illness and a box of photographs that he  won’t let anyone see. When Bobbie dies, Laurel discovers a deeply hidden secret–a  story that leads her far from her old life, and into a cat-and-mouse game with pursuers  who claim they want to save her.In a tale that travels between the Roaring Twenties  and the twenty-first century, between Jay Gatsby’s Long Island and rural New England,  bestselling author Chris Bohjalian has written an extraordinary novel.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Rainbow Fish to the Rescue!",
        "Authors": "By James, J. Alison and James, J. Alison (TRN)",
        "Description": "The sequel to the bestseller \"The Rainbow Fish\" is now available in a glittering board book edition for the very young. \"The gently implied themes of sharing and friendship in the first story are expanded here to include courage\".--\"School Library Journal\". Full color.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "North-South Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2018"
        }
    },
    {
        "Title": "The Third Jesus: The Christ We Cannot Ignore",
        "Authors": "By Chopra, Deepak",
        "Description": "Who is Jesus Christ? In The Third Jesus, bestselling author and spiritual leader Deepak Chopra provides an answer to this question that is both a challenge to current systems of belief and a fresh perspective on what Jesus can teach us all, regardless of our religious background. There is not one Jesus, Chopra writes, but three.First, there is the historical Jesus, the man who lived more than two thousand years ago and whose teachings are the foundation of Christian theology and thought. Next there is Jesus the Son of God, who has come to embody an institutional religion with specific dogma, a priesthood, and devout believers. And finally, there is the third Jesus, the cosmic Christ, the spiritual guide whose teaching embraces all humanity, not just the church built in his name. He speaks to the individual who wants to find God as a personal experience, to attain what some might call grace, or God-consciousness, or enlightenment. When we take Jesus literally, we are faced with the impossible. How can we truly “love thy neighbor as thyself”? But when we see the exhortations of Jesus as invitations to join him on a higher spiritual plane, his words suddenly make sense.Ultimately, Chopra argues, Christianity needs to overcome its tendency to be exclusionary and refocus on being a religion of personal insight and spiritual growth. In this way Jesus can be seen for the universal teacher he truly is–someone whose teachings of compassion, tolerance, and understanding can embrace and be embraced by all of us.",
        "Category": " Religion , Spirituality",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "In the Ring: The Trials of a Washington Lawyer",
        "Authors": "By Bennett, Robert S.",
        "Description": "Robert S. Bennett has been a lawyer for more than forty years. In that time, he’s taken on dozens of high-pro?le and groundbreaking cases and emerged as the go-to guy for the nation’s elite. Bob Bennett gained international recognition as one of America’s best lawyers for leading the defense of President Bill Clinton in the Paula Jones case. But long before, and ever since, representing a sitting president, he has fought for justice for many famous (and some now infamous) clients. This is his story.Born in Brooklyn and an amateur boxer in his youth, Bennett has always brought his street ?ghter’s mentality to the courtroom. His case history is a who’s who of ?gures who have dominated legal headlines: super lobbyist Tommy Corcoran, former Secretaries of Defense Clark Clifford and Caspar Weinberger, Marge Schott, and, most recently, New York Times reporter Judith Miller and former World Bank president Paul Wolfowitz. Bennett also served as special counsel to the Senate during the ABSCAM and Keating Five scandals and was a leading member of the National Review Board for the Protection of Children & Young People, created by the United States Conference of Catholic Bishops in response to the sex abuse allegations.Taking the reader deep within his most intriguing and dif?cult cases, In the Ring shows how Bennett has argued for what’s right, won for his clients, and effected his share of change on the system. This is an intimate and compelling memoir of one lawyer’s attempt to ?ght hard and fair.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Kennedy's Brain: A Novel",
        "Authors": "By Mankell, Henning",
        "Description": "When archaeologist Louise Cantor returns to Sweden from a dig in Greece, her world collapses with the discovery of her only child dead in his bed. Henrik turns out to have led multiple lives and held many secrets - including his HIV-positive status - that she knew nothing about, and part of her shock over his death stems from the realization that he concealed so much from her. Louise is convinced his death cannot be a suicide, and her grief and anger become an all-consuming desire to know who her son really was and what could have left him dead at the age of twenty-eight. Her investigation takes her to Spain, Australia, and, in her most disorienting and perilous trip, Mozambique, home to a sinister AIDS hospice run by a powerful philanthropist who is somehow linked to Henrik. Her travels also bring her closer and closer to a danger she cannot yet understand, while those who dare to help her put their lives at risk.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "New Press, The",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Barney's Favorite Mother Goose Rhymes (Volume 2)",
        "Authors": "By White, Stephen",
        "Description": "For young fans of the popular purple dinosaur, this collection includes fourteen classic Mother Goose rhymes side-by-side with fourteen interactive original rhymes.",
        "Category": "",
        "Publisher": "Barney Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Fodor's Nova Scotia & Atlantic Canada, 10th Edition: With New Brunswick, Prince Edward Island, and Newfoundland & Labrador (Travel Guide)",
        "Authors": "By Fodor's Travel Publications, Inc. (EDT)",
        "Description": "Fodor’s. For Choice Travel Experiences.Fodor’s helps you unleash the possibilities of travel by providing the insightful tools you need to experience the trips you want. Although you’re at the helm, Fodor’s offers the assurance of our expertise, the guarantee of selectivity, and the choice details that truly define a destination. It’s like having a friend in Atlantic Canada!•Updated frequently, Fodor’s Nova Scotia & Atlantic Canada provides the most accurate and up-to-date information available in a guidebook.•Fodor’s Nova Scotia & Atlantic Canada features options for a variety of budgets, interests, and tastes, so you make the choices to plan your trip of a lifetime.•If it’s not worth your time, it’s not in this book. Fodor’s discriminating ratings, including our top tier Fodor’s Choice designations, ensure that you’ll know about the most interesting and enjoyable places in Atlantic Canada.Experience Atlantic Canada like a local! Fodor’s Nova Scotia & Atlantic Canada includes choices for every traveler, from traveling coastal cliffs on stunning scenic drives, to chowing down at a lobster boil, to spotting majestic whales, drifting icebergs, or nesting puffins. •Indispensable, customized trip planning tools include “Top Reasons to Go,” “Word of Mouth” advice from other travelers, and tips to help save money, bypass lines, and avoid common travel pitfalls.Visit Fodors.com for more ideas and information, travel deals, vacation planning tips, reviews and to exchange travel advice with other travelers.",
        "Category": " Travel , Canada , Atlantic Provinces (NB, NL, NS, PE)",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Matters of Honor: A Novel",
        "Authors": "By Begley, Louis",
        "Description": "“Terrifically intelligent, moving, and entertaining.”–The New York Sun“With snappy dialogue [and] intelligent prose . . . Begley paints a memorable portrait of lasting friendship and of the strength required to step outside of the expectations that surround each of us.”–Rocky Mountain NewsAt the beginning of the 1950s, three disparate young men are thrown together as roommates at Harvard College: Henry White, a Polish-Jewish refugee who survived World War II by hiding in Poland; Archibald P. Palmer III, an Army brat; and Sam Standish, ostensibly the scion of a fine New England family who has just learned that he was adopted at birth by parents he cannot respect. Each seeks to come to terms with his identity or to remake it altogether. Henry’s task is especially daunting: He is determined to live as an American, free of the shackles of his hideous past. But reinvention is a bargain with the devil, and over the years each will find that it comes at a high cost, challenging one’s honor and loyalty to parents, friends, and ultimately oneself.“Absorbing . . . In full Henry James mode, Begley uses a lucid prose style to dispassionately eviscerate the upper classes even as he illuminates the true meaning of friendship.”–Booklist“The final moral crisis of Henry’s life [is] gorgeously evoked. . . . Begley’s analysis of class and anti-Semitism in America is often brilliant.”–The Washington Post Book World“A moving tale . . . [Begley’s] technique demands attention–and richly rewards it.”–The New York Observer“An elegant novel of enduring friendship.”–Publishers Weekly (starred review)",
        "Category": " Fiction , Historical , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Dream When You're Feeling Blue: A Novel",
        "Authors": "By Berg, Elizabeth",
        "Description": "New York Times bestselling author Elizabeth Berg takes us to Chicago at the time of World War II in this wonderful story about three sisters, their lively Irish family, and the men they love.As the novel opens, Kitty and Louise Heaney say good-bye to their boyfriends Julian and Michael, who are going to fight overseas. On the domestic front, meat is rationed, children participate in metal drives, and Tommy Dorsey and Glenn Miller play songs that offer hope and lift spirits. And now the Heaney sisters sit at their kitchen table every evening to write letters–Louise to her fiancé, Kitty to the man she wishes fervently would propose, and Tish to an ever-changing group of men she meets at USO dances. In the letters the sisters send and receive are intimate glimpses of life both on the battlefront and at home. For Kitty, a confident, headstrong young woman, the departure of her boyfriend and the lessons she learns about love, resilience, and war will bring a surprise and a secret, and will lead her to a radical action for those she loves. The lifelong consequences of the choices the Heaney sisters make are at the heart of this superb novel about the power of love and the enduring strength of family.From the Hardcover edition.",
        "Category": " Fiction , Sagas",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Christ the Lord: The Road to Cana: A novel",
        "Authors": "By Rice, Anne",
        "Description": "Anne Rice’s second book in her hugely ambitious and courageous life of Christ begins during his last winter before his baptism in the Jordan and concludes with the miracle at Cana.It is a novel in which we see Jesus—he is called Yeshua bar Joseph—during a winter of no rain, endless dust, and talk of trouble in Judea.Legends of a Virgin birth have long surrounded Yeshua, yet for decades he has lived as one among many who come to the synagogue on the Sabbath. All who know and love him find themselves waiting for some sign of the path he will eventually take.And at last we see him emerge from his baptism to confront his destiny—and the Devil. We see what happens when he takes the water of six great limestone jars, transforms it into cool red wine, is recognized as the anointed one, and urged to call all Israel to take up arms against Rome and follow him as the prophets have foretold.As with Out of Egypt, the opening novel, The Road to Cana is based on the Gospels and on the most respected New Testament scholarship. The book’s power derives from the profound feeling its author brings to the writing and the way in which she summons up the presence of Jesus.",
        "Category": " Fiction , Christian , Historical",
        "Publisher": "Knopf",
        "Price Starting With ($)": "14.98",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Atlas of the Bible: An Illustrated Guide to the Holy Land (Readers Digest)",
        "Authors": "By Reader's Digest Association",
        "Description": "Maps, photographs, and illustrations show the geography, historical events, and people of the Middle East during Biblical times",
        "Category": " Religion , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "The Bear That Heard Crying (Picture Puffins)",
        "Authors": "By Rand, Ted (ILT), Kinsey-Warnock, Natalie, and Kinsey, Helen",
        "Description": "An IRA-CBC Children’s Choice Book. The drama of this unbelievable but true story is enhanced by Ted Rand’s stunning illustrations.In June 1783, three-year-old Sarah Whitcher wanders into the woods and disappears. For three long days, friends and neighbors search fruitlessly for her. Then a stranger leads the desperate family to a pine tree beneath which the child lies. Sarah tells her rescuers of the “big black dog” that kept her warm every night—but the bear tracks encircling her tell a different tale.    “A treat for ‘pioneer story’ buffs.”—School Library Journal",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "School Zone - Alphabet Workbook - Ages 5 to 7, Kindergarten to 1st Grade, ABCs, Letters, Letter Word & Object Association, and More (School Zone I Know It!® Workbook Series) (I Know It Books)",
        "Authors": "By Hoffman, Joan",
        "Description": "",
        "Category": " Juvenile Nonfiction , Concepts , Alphabet",
        "Publisher": "School Zone Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2017"
        }
    },
    {
        "Title": "The Bush Tragedy",
        "Authors": "By Weisberg, Jacob",
        "Description": "This is the book that cracks the code of the Bush presidency. Unstintingly yet compassionately, and with no political ax to grind, Slate editor in chief Jacob Weisberg methodically and objectively examines the family and circle of advisers who played crucial parts in George W. Bush’s historic downfall.In this revealing and defining portrait, Weisberg uncovers the “black box” from the crash of the Bush presidency. Using in-depth research, revealing analysis, and keen psychological acuity, Weisberg explores the whole Bush story. Distilling all that has been previously written about Bush into a defining portrait, he illuminates the fateful choices and key decisions that led George W., and thereby the country, into its current predicament. Weisberg gives the tragedy a historical and literary frame, comparing Bush not just to previous American leaders, but also to Shakespeare’s Prince Hal, who rises from ne’er-do-well youth to become the warrior king Henry V.Here is the bitter and fascinating truth of the early years of the Bush dynasty, with never-before-revealed information about the conflict between the two patriarchs on George W.’s father’s side of the family–the one an upright pillar of the community, the other a rowdy playboy–and how that schism would later shape and twist the younger George Bush; his father, a hero of war, business, and Republican politics whose accomplishments George W. would attempt to copy and whose absences he would resent; his mother, Barbara, who suffered from insecurity, depression, and deep dissatisfaction with her role as housewife; and his younger brother Jeb, seen by his parents as steadier, stronger, and the son most likely to succeed.Weisberg also anatomizes the replacement family Bush surrounded himself with in Washington, a group he thought could help him correct the mistakes he felt had destroyed his father’s presidency: Karl Rove, who led Bush astray by pursuing his own historical ambitions and transforming the president into a deeply polarizing figure; Dick Cheney, whose obsessive quest to restore presidential power and protect the country after 9/11 caused Bush and America to lose the world’s respect; and, finally, Donald Rumsfeld and Condoleezza Rice, who encouraged Bush’s foreign policy illusions and abetted his flight from reality.  Delving as no other biography has into Bush’s religious beliefs–which are presented as at once opportunistic and sincere–The Bush Tragedy is an essential work that is sure to become a standard reference for any future assessment. It is the most balanced and compelling account of a sitting president ever written.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Beautiful Children: A Novel",
        "Authors": "By Bock, Charles",
        "Description": "One Saturday night in Las Vegas, twelve-year-old Newell Ewing goes out with a friend and doesn’t come home. In the aftermath of his disappearance, his mother, Lorraine, makes daily pilgrimages to her son’s room and tortures herself with memories. Equally distraught, the boy’s father, Lincoln, finds himself wanting to comfort his wife even as he yearns for solace, a loving touch, any kind of intimacy. As the Ewings navigate the mystery of what’s become of their son, the circumstances surrounding Newell’s vanishing and other events on that same night reverberate through the lives of seemingly disconnected strangers: a comic book illustrator in town for a weekend of debauchery; a painfully shy and possibly disturbed young artist; a stripper who imagines moments from her life as if they were movie scenes; a bubbly teenage wiccan anarchist; a dangerous and scheming gutter punk; a band of misfit runaways. The people of Beautiful Children are “urban nomads,” each with a past to hide and a pain to nurture, every one of them searching for salvation and barreling toward destruction, weaving their way through a neon underworld of sex, drugs, and the spinning wheels of chance. In this masterly debut novel, Charles Bock mixes incandescent prose with devious humor to capture Las Vegas with unprecedented scope and nuance and to provide a glimpse into a microcosm of modern America. Beautiful Children is an odyssey of heartache and redemption–heralding the arrival of a major new writer.Advance praise for Beautiful Children“Charles Bock has delivered an anxious, angry, honest first novel filled with compassion and clarity. Beautiful Children is fast, violent, sexy and–like a potentially dangerous ride–it could crash at any moment but never does. The language has a rhythm wholly its own–at moments it is stunning, near genius. This book is big and wild–it is as though Bock saved up everything for this moment. A major new talent.”–A. M. Homes“Beautiful Children careens from the seedy to the beautiful, the domestic to the epic, all with huge and exacting heart.”–Jonathan Safran Foer“Beautiful Children is the best first novel I’ve read in years–certainly the best first novel of our newborn century. Charles Bock has written a masterpiece: tragic, comic, sexy, chilling, far-reaching, and wise–at once an accusation and a consolation, and a lucid portrait of what is happening at the very heart of our culture, and what it means to be a young American today.”–Sean Wilsey",
        "Category": " Fiction , Psychological",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "THE BEGINNING OF SORROWS",
        "Authors": "By Martin, David Lozell",
        "Description": "The arrival of Johnny Reace, a mysterious stranger, changes the life of Bonner, the man who takes him in",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Giving: How Each of Us Can Change the World",
        "Authors": "By Clinton, Bill and Clinton, Bill (NRT)",
        "Description": "Here, from Bill Clinton, is a call to action. Giving is an inspiring look at how each of us can change the world. First, it reveals the extraordinary and innovative efforts now being made by companies and organizations—and by individuals—to solve problems and save lives both “down the street and around the world.” Then it urges us to seek out what each of us, “regardless of income, available time, age, and skills,” can do to help, to give people a chance to live out their dreams.Bill Clinton shares his own experiences and those of other givers, representing a global flood tide of nongovernmental, nonprofit activity. These remarkable stories demonstrate that gifts of time, skills, things, and ideas are as important and effective as contributions of money. From Bill and Melinda Gates to a six-year-old California girl named McKenzie Steiner, who organized and supervised drives to clean up the beach in her community, Clinton introduces us to both well-known and unknown heroes of giving. Among them:Dr. Paul Farmer, who grew up living in the family bus in a trailer park, vowed to devote his life to giving high-quality medical care to the poor and has built innovative public health-care clinics first in Haiti and then in Rwanda;a New York couple, in Africa for a wedding, who visited several schools in Zimbabwe and were appalled by the absence of textbooks and school supplies. They founded their own organization to gather and ship materials to thirty-five schools. After three years, the percentage of seventh-graders who pass reading tests increased from 5 percent to 60 percent;'Oseola McCarty, who after seventy-five years of eking out a living by washing and ironing, gave $150,000 to the University of Southern Mississippi to endow a scholarship fund for African-American students;Andre Agassi, who has created a college preparatory academy in the Las Vegas neighborhood with the city’s highest percentage of at-risk kids. “Tennis was a stepping-stone for me,” says Agassi. “Changing a child’s life is what I always wanted to do”;Heifer International, which gave twelve goats to a Ugandan village. Within a year, Beatrice Biira’s mother had earned enough money selling goat’s milk to pay Beatrice’s school fees and eventually to send all her children to school—and, as required, to pass on a baby goat to another family, thus multiplying the impact of the gift.Clinton writes about men and women who traded in their corporate careers, and the fulfillment they now experience through giving. He writes about energy-efficient practices, about progressive companies going green, about promoting fair wages and decent working conditions around the world. He shows us how one of the most important ways of giving can be an effort to change, improve, or protect a government policy. He outlines what we as individuals can do, the steps we can take, how much we should consider giving, and why our giving is so important.Bill Clinton’s own actions in his post-presidential years have had an enormous impact on the lives of millions. Through his foundation and his work in the aftermath of the Asian tsunami and Hurricane Katrina, he has become an international spokesperson and model for the power of giving.“We all have the capacity to do great things,” President Clinton says. “My hope is that the people and stories in this book will lift spirits, touch hearts, and demonstrate that citizen activism and service can be a powerful agent of change in the world.”",
        "Category": " Social Science , Volunteer Work",
        "Publisher": "Random House Audio",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Ageless: The Naked Truth About Bioidentical Hormones",
        "Authors": "By Somers, Suzanne",
        "Description": "In this #1 New York Times bestseller, Suzanne Somers reveals the secrets to a younger, healthier, and sexier you.What if you could really feel better as you get older, or age without illness? What  could be better than having your doctor tell you that you have the bones of a twenty-year-old,  or the heart of a thirty-year-old? Follow the advice in Ageless, and you’ll discover  your own internal fountain of youth! Jam-packed  with updated information on bioidentical hormone replacement and antiaging, Ageless will change your life forever. Suzanne talks about:• Antiaging medicine and how  it can help work against the environmental assault that is making us sick• Menopause,  which can become an enjoyable passage once the body is in perfect hormonal sync with  bioidentical hormone replacement therapy• Why so many hysterectomies are unnecessary,  how birth control pills may have contributed to the rise of them, and how to restore  your body to perfect hormonal balance after having one• The importance of sleep  and the healing work that nature does during this time",
        "Category": " Self-help , Aging",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Trupp: A Fuzzhead Tale",
        "Authors": "By Cannon, Janell",
        "Description": "Trupp, a young Fuzzhead, decides to venture into the world. With a cheeky raven for a companion, Trupp rambles through the city, going virtually unnoticed by humans-that is, until they are confronted by a homeless woman who sees Trupp for who he really is. Before Trupp can decide whether to stay or run away, this unusual woman realizes that he could use a little help. “Fans of Stellaluna, Cannon’s exceptional debut book, will approach her second with high expectations--and those will be met.”--Publishers Weekly",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Sandpiper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Fodor's Munich & Bavaria, 1st Edition: Plus Salzburg (Travel Guide)",
        "Authors": "By Lombardi, Matthew (EDT) and Cabasin, Linda (EDT)",
        "Description": "Oktoberfest and beer halls, fairytale castles atop green mountains, and lost-in-time medieval towns are just a few reasons why Munich and Bavaria remain Germany’s most popular areas, with 620,000 American visitors in 2006. The World Cup Championship brought the region even more attention last year. Whether travelers want great shopping or classical music in Munich, or the best hiking, boating, and skiing in the mountains and lakes of the Bavarian Alps, this easy-to-use guide has it all. Written by local experts, Fodor’s Munich & Bavaria is an insider’s key to both the sophisticated urban pleasures and the gorgeous countryside of Germany’s heart.   ·CloseUp boxes focus on German beer and attending Oktoberfest, plus the best beer gardens in Munich·The Romantic Road chapter is a complete itinerary for touring the villages, churches, and castles along this famous scenic and historic route ·Side trip to nearby Salzburg, Austria, covers the highlights of this beloved city· “What’s Where,” “Quintessential Bavaria,” and “If You Like” sections at the front of the guide identify the main attractions and experiences·“Top Reasons to Go” boxes at the start of each chapter make planning a snap·Discerning dining and lodging reviews cover cozy local favorites, fine-dining picks, good-value city hotels, and idyllic mountain inns",
        "Category": " Travel , Europe , Germany",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "His Illegal Self",
        "Authors": "By Carey, Peter",
        "Description": "When the boy was almost eight, a woman stepped out of the elevator into the apartment on East Sixty-second Street and he recognized her straightaway. No one had told him to expect it. That was pretty typical of growing up with Grandma Selkirk . . . No one would dream of saying, Here is your mother returned to you.His Illegal Self is the story of Che—raised in isolated privilege by his New York grandmother, he is the precocious son of radical student activists at Harvard in the late sixties. Yearning for his famous outlaw parents, denied all access to television and the news, he takes hope from his long-haired teenage neighbor, who predicts, They will come for you, man. They’ll break you out of here.Soon Che too is an outlaw: fleeing down subways, abandoning seedy motels at night, he is pitched into a journey that leads him to a hippie commune in the jungle of tropical Queensland. Here he slowly, bravely confronts his life, learning that nothing is what it seems. Who is his real mother? Was that his real father? If all he suspects is true, what should he do?Never sentimental, His Illegal Self is an achingly beautiful story of the love between a young woman and a little boy. It may make you cry more than once before it lifts your spirit in the most lovely, artful, unexpected way.",
        "Category": " Fiction , Literary",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Meg",
        "Authors": "By Alten, Steve",
        "Description": "In a top-secret dive into the Pacific Ocean's deepest canyon, Jonas Taylor found himself face-to-face with the largest and most ferocious predator in the history of the animal kingdom. The sole survivor of the mission, Taylor is haunted by what he's sure he saw but still can't prove exists - Carcharodon megalodon, the massive mother of the great white shark. The average prehistoric Meg weighs in at twenty tons and could tear apart a Tyrannosaurus rex in seconds.Written off as a crackpot, suffering from post-traumatic stress disorder, Taylor refuses to forget the depths that nearly cost him his life. With a Ph.D. in paleontology under his belt, Taylor spends years theorizing, lecturing, and writing about the possibility that Meg still feeds at the deepest levels of the sea. But it takes an old friend in need to get him to return to the water, and a hotshot female submarine pilot to dare him back into a high-tech miniature sub.Diving deeper than he ever has before, Taylor will face terror like he's never imagined, and what he finds could turn the tides bloody red until the end of time.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Bridge of San Luis Rey (Perennial Classics)",
        "Authors": "By Wilder, Thornton",
        "Description": "The Bridge of San Luis Rey opens in the aftermath of an inexplicable tragedy--a tiny foot-bridge in Peru breaks, and five people hurtle to their deaths. For Brother Juniper, a humble monk who witnesses the catastrophe, the question in inescapable. Why those five? Suddenly, Brother Juniper is committed to discover what manner of lives they led--and whether it was divine intervention or a capricious fate that took their lives.",
        "Category": " Fiction , War & Military",
        "Publisher": "Perennial (HarperCollins)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Life of Jesus",
        "Authors": "By Savary, Louis",
        "Description": "",
        "Category": "",
        "Publisher": "Regina Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Moses and the Very Special Basket (Did You Know Old Testament Bible Story)",
        "Authors": "By Sunny Griffin",
        "Description": "",
        "Category": "",
        "Publisher": "Landoll",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Peony in Love: A Novel",
        "Authors": "By See, Lisa",
        "Description": "“I finally understand what the poets have written. In spring, moved to passion; in autumn only regret.”For young Peony, betrothed to a suitor she has never met, these lyrics from The Peony Pavilion mirror her own longings. In the garden of the Chen Family Villa, amid the scent of ginger, green tea, and jasmine, a small theatrical troupe is performing scenes from this epic opera, a live spectacle few females have ever seen. Like the heroine in the drama, Peony is the cloistered daughter of a wealthy family, trapped like a good-luck cricket in a bamboo-and-lacquer cage. Though raised to be obedient, Peony has dreams of her own.Peony’s mother is against her daughter’s attending the production: “Unmarried girls should not be seen in public.” But Peony’s father assures his wife that proprieties will be maintained, and that the women will watch the opera from behind a screen. Yet through its cracks, Peony catches sight of an elegant, handsome man with hair as black as a cave–and is immediately overcome with emotion.So begins Peony’s unforgettable journey of love and destiny, desire and sorrow–as Lisa See’s haunting new novel, based on actual historical events, takes readers back to seventeenth-century China, after the Manchus seize power and the Ming dynasty is crushed. Steeped in traditions and ritual, this story brings to life another time and place–even the intricate realm of the afterworld, with its protocols, pathways, and stages of existence, a vividly imagined place where one’s soul is divided into three, ancestors offer guidance, misdeeds are punished, and hungry ghosts wander the earth. Immersed in the richness and magic of the Chinese vision of the afterlife, transcending even death, Peony in Love explores, beautifully, the many manifestations of love. Ultimately, Lisa See’s new novel addresses universal themes: the bonds of friendship, the power of words, and the age-old desire of women to be heard.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Stories Jesus Told (Little classics)",
        "Authors": "By Etta G. Wilson",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Easter Women: Luke 7:36-8.3; 23:55-24:12; John 20:1-18 for Children (Quality Religious Books for Children)",
        "Authors": "By Greene, Carol and Wind, Betty (ILT)",
        "Description": "Retells in rhyme how Mary of Magdalene followed Jesus devotedly, and on the day of His Resurrection He appeared first to her.",
        "Category": " Religion , General",
        "Publisher": "Concordia Pub House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "President Lincoln: The Duty of a Statesman",
        "Authors": "By Miller, William Lee",
        "Description": "The American president has come to be the most powerful figure in the world—and back in the nineteenth century a great man held that office. William Lee Miller’s new book closely examines that great man in that hugely important office: Abraham Lincoln as president.Wars waged by American presidents have come to be pivotal historical events. Here Miller analyzes the commander in chief who coped with the profound moral dilemmas of America’s bloodiest war.In his acclaimed book Lincoln’s Virtues (“A fascinating account, sensitively written, rich in insight” —Arthur Schlesinger, Jr.), Miller explored Abraham Lincoln’s intellectual and moral development. Now he completes his “ethical biography,” showing the amiable and inexperienced backcountry politician transformed by constitutional alchemy into an oath-bound head of state, slapped in the face from the first minute of his presidency by decisions of the utmost gravity and confronted by the radical moral contradiction left by the nation’s Founders: universal ideals of Equality and Liberty and the monstrous injustice of human slavery.With wit and penetrating sensitivity, Miller shows us a Lincoln with unusual intellectual power, as he brings together the great themes that will be his legend—preserving the United States of America while ending the odious institution that corrupted the nation’s meaning. Miller finds in this superb politician a remarkable presidential combination: an indomitable resolve, combined with the judgment that keeps it from being mindless stubbornness; and a supreme magnanimity, combined with the discriminating judgment that keeps it from being sentimentality. Here is the realistic war leader persisting after multiple defeats, pressing his generals to take the battle to the enemy, insisting that the objective was the destruction of Lee’s army and not the capture of territory, saying that breath alone kills no rebels, remarking that he regretted war does not admit of holy days, asking whether one could believe that he would strike lighter blows rather than heavier ones, or leave any card unplayed. And here is the pardoner, finding every excuse to keep from shooting the simple soldier boy who deserts. Here too is the eloquent leader who describes the national task in matchless prose, and who rises above vindictiveness and triumphalism as he guides the nation to a new birth of freedom.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Riddle of Baby Rosalind (The Nicki Holland Mystery Series #9)",
        "Authors": "By Hunt, Angela Elwell",
        "Description": "To whom it may concern,Thank you for taking care of my baby, Rosalind. I hope you will forgive me for the unexpectedness of this situation, but I cannot give Rosalind the home she deserves. I hope you will see that she is well taken care of and loved. Please do not let anyone harm her. Tell her I loved her very much.Thank you.Nicki and her friends expected a normal flight home from Ireland until Laura meets a woman in the airport and offers to watch her baby. When the woman fails to board the plane with the girls, Laura and Nicki find a note in the baby's diaper bag. Did the mother really abandon the child? Was the woman in the airport really the baby's mother, or was she the kidnapper? Nicki and her friends have only eight hours to find answers to their many questions about the baby in their care.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "What I Know for Sure: My Story of Growing Up in America",
        "Authors": "By Ritz, David (CON) and Smiley, Tavis",
        "Description": "From the man who catapulted the Covenant with Black America to number one on the New York Times bestseller list comes a searing memoir of poverty, ambition, pain and atonment. Tavis Smiley grew up in a family of thirteen in rural Indian,  where money was scarce and the sight of other black faces even scarcer. Always an outsider because of his race, economic background,  and Pentecostal religious beliefs, he was  sustained by his family’s love. But one day his world was shattered when his father brutally beat him, sending him to the hospital and then into foster care for a period of time. In What I Know for Sure, Smiley recounts how he overcame his painful history and became one of America’s most popular media figures.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Nancy Drew 54: The Strange Message in the Parchment",
        "Authors": "By Keene, Carolyn",
        "Description": "A sheep farmer receives a mysterious telephone call shortly after he buys a series of pictures painted on parchment. “Decipher the message in the parchment and right a great wrong,” the voice says. Puzzled, the owner asks Nancy to help.With Junie, his daughter, Nancy tracks down a kidnapper and a group of extortionists. Is there a connection between the message in the parchment and a boy artist on another farm? And who is responsible for the atmosphere of fear in the neighborhood? After several harrowing experiences, Nancy begins to tighten the net around a ruthless villain and calls on the assistance of her friends Ned, Burt, Dave, Bess and George to bring his nefarious scheme to a dead end.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1977"
        }
    },
    {
        "Title": "Hide and Seek: A Novel",
        "Authors": "By Sambrook, Clare",
        "Description": "Meet Harry Pickles, age nine and a bit. Harry is the fastest boy runner in the world (according to Harry), firstborn son of Mo and Pa, the best-looking parents in their Notting Hill elementary school parking lot. He's leader of the gang, the gang being Harry and his pals Peter and Piggy. He's a popular guy. Harry's life is good. At least that's the way it was before the school outing. Hide & Seek tells the story of a family whose world is rocked by loss.",
        "Category": " Fiction , Literary",
        "Publisher": "Canongate U.S.",
        "Price Starting With ($)": "6.13",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Horses (Now I Know)",
        "Authors": "By Greydanus, Rose and Snyder, Joel (ILT)",
        "Description": "Describes horses' physical characteristics, surveys the different types of horses, and discusses their growth",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Santa Calls",
        "Authors": "By Joyce, William",
        "Description": "Art Atchinson Aimesworth -- inventor, crime fighter, and allaround whiz kid-journeys north with his sister, Esther, and his pal, Spaulding, by special invitation from Santa himself. But why did Santa call? Now available in a new hardcover edition, this truly Joyce-ian crusade features villains and swashbuckling adventure, concluding with a most spectacular and touching Christmas celebration.A holiday extravaganza like no other, by the creator of Rolie Polie Olie, Snowie Rolie, Sleepy Time Olie, Dinosaur Bob and His Adventures wirh the Family Lazardo, and George Shrinks.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Final Exam: A Surgeon's Reflections on Mortality",
        "Authors": "By Chen, Pauline W.",
        "Description": "A brilliant transplant surgeon brings compassion and narrative drama to the fearful reality that every doctor must face: the inevitability of mortality.When Pauline Chen began medical school, she dreamed of saving lives. What she could not predict was how much death would be a part of her work. Almost immediately, she found herself wrestling with medicine’s most profound paradox–that a profession premised on caring for the ill also systematically depersonalizes dying. Final Exam follows Chen over the course of her education and practice as she struggles to reconcile the lessons of her training with her innate sense of empathy and humanity. A superb addition to the best medical literature of our time.",
        "Category": " Medical , Physicians",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    }
]