[
    {
        "Title": "The Power of Forgiveness: Celebration of Simplicity",
        "Authors": "By Joyce Meyer",
        "Description": "",
        "Category": "",
        "Publisher": "warner faith",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Spies: The Undercover World of Secrets, Gadgets and Lies",
        "Authors": "By Owen, David and Mendez, Antonio J. (FRW)",
        "Description": "An illustrated guide to the deadly world of espionage.    Agents, double agents and multiple agents are vital to waging war successfully and they often help nations avoid war altogether. Spies have affected the outcomes of wars and crucial battles throughout history.    Spies exposes the secret successes and public failures of intelligence gathering and operations from ancient times to the current war on terrorism.    Using easy-to-follow illustrated case studies and sidebar features, Spies reveals the behind-the-scenes stories of famous spies, international secrets, betrayals and bravery in the long history of spying.     The book describes in exciting detail:  The art of spy tradecraft  Techniques spies use to gather and send secrets  Devices used to steal            state secrets  How agents survive in hostile environments  Whether or not spies like James Bond really exist.    Today, sophisticated digital and space-based technology gathers untold amounts of raw data. Yet far from rendering the spy on the ground obsolete, human intelligence is more vital than ever to separate the truth from the deception.    Spies is a factual and fascinating look into a dangerous world where nothing is what it appears to be.",
        "Category": " Young Adult Nonfiction , Science & Nature , General",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Heroes of the Bible (Little Golden Book)",
        "Authors": "By Jane Werner Watson",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press / Western Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "We're in the Money",
        "Authors": "By Bergman, Andrew",
        "Description": "",
        "Category": " Performing Arts , Film & Video , General",
        "Publisher": "Harpercollins College Div",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "The Pocket Mortgage Guide: 60 of the Most Important Questions and Answers About Your Home Loan - Plus Interest Amortization Tab",
        "Authors": "By Guttentag, Jack M.",
        "Description": "The \"Mortgage Professor\" answers critical homemortgage questionsThis value-packed consumer reference by a nationally syndicated mortgage columnist is indispensable for anyone looking to secure a home mortgage. The Pocket Mortgage Guide answers 50 of the most commonly asked mortgage questions, including:How can I find the lowest-cost lender? Should I choose a 15-year loan or a 30-year loan? What is PMI and how can I cancel it? How large a mortgage will I be able to afford? What will my monthly mortgage payment be? What is a \"debt ratio\" used for and how is it calculated? What is a home equity line of credit and what should it be used for? The book also provides valuable interest amortization tables and is the perfect resource for home buyers.",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Bridges of Madison County: The Film",
        "Authors": "By Waller, Robert James, Regan, Ken (PHT), and Regan, Ken",
        "Description": "",
        "Category": " Fiction , Romance , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Reasons for Seasons: The Great Cosmic Megagalactic Trip Without Moving from Your Chair (The Brown Paper School)",
        "Authors": "By Allison, Linda",
        "Description": "Stories to read, ideas to think about, and things to make and do--all contributing to an understanding of the seasons and their effect on the earth.",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1975"
        }
    },
    {
        "Title": "Thanks a Bunch",
        "Authors": "By Magsamen, Sandra",
        "Description": "",
        "Category": " Psychology , Emotions",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Poe's Heart and the Mountain Climber: Exploring the Effect of Anxiety on Our Brains and Our Culture",
        "Authors": "By Restak, Richard, M.D.",
        "Description": "Are you bombarded by a constant media feed of global terrorism, war, and rising unemployment rates—and by a mind-numbing array of ads that urge you to “ask your doctor” about the newest anti-anxiety medications? If it sometimes feels as if this country is having a collective anxiety attack, then you won’t be surprised to learn that more than 19 million Americans suffer from some form of acute anxiety.Poe’s Heart and the Mountain Climber tackles this situation head-on, with a fresh perspective and a straightforward approach to exploring and understanding our anxiety before it paralyzes us.After interviewing many experts on anxiety, and reflecting on his own many years treating anxious patients (as well as experiencing more than a few anxious moments himself), Dr. Richard Restak has organized this book around one primary principal: the best way to manage anxiety in these anxious times is to learn about it and put that learning to practical use. His message is vital and empowering: anxiety is not a mental illness that must require medication, but often a normal, biological response to stress.Anxiety is part of our genetic makeup. We wouldn’t be alive today if our ancestors had lacked the ability to anticipate dangers and threats. Anxiety is as natural a part of our existence as breathing, eating, or sleeping, and it is closely linked to our powers of reasoning. Unlike any other species, only we are able to envision future possibilities. As a result, we aren’t tethered to the here and now, but can imaginatively anticipate the good things that might happen to us. But we can also envision the bad things and, as a result, experience anxiety. We can’t have one without the other. Anxiety, therefore, isn’t something to be eliminated but, rather, something to be understood. Anxiety is only undesirable when it becomes extreme.This groundbreaking book teaches us to view anxiety not as a burden, but as a stimulus for greater accomplishment and enhanced self-knowledge. We will function at our best when we stop working to deny our anxiety or trying to escape it and instead learn to accept its presence in our lives and transform it into the positive, creative energy from which it stems.",
        "Category": " Psychology , Mental Health",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "When Life Hurts: Comforting Reflections for Our Troubled Moments",
        "Authors": "By Greeley, Andrew M.",
        "Description": "Andrew M. Greeley, one of the most renowned authors and lecturers of our day, here turns his attention to a variety of the trials and frustrations that we all too often encounter in these hectic, pressure-filled times. These essays on nearly fifty themes address our fears, hang-ups, and worries, providing commonsense advice, consolation, and encouragement. In his inimitable fashion, Greeley blends the wisdom of the Scriptures with his own down-to-earth and uplifting insights. Anyone involved in the frequently harried and painful business of living—indeed, everyone—will find their true solace for those moments when life hurts. “I can heartily endorse this wo . . . Greeley deals not only with sorrow, but offers truly comforting reflections of other troubled moments, for our frustration, our physical and mental pain, for our hopelessness and despair.”—Morton Kelsey",
        "Category": " Religion , Meditations",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "The New HIDE or SEEK: Building Self-Esteem in Your Child",
        "Authors": "By Dobson, James C.",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "The Real America: Messages from the Heart and Heartland",
        "Authors": "By Beck, Glenn",
        "Description": "There are some things people think but don't say....  \"Political correctness is the classic Great Idea Gone Wrong. All it's done is shut us up. It hasn't changed anybody's mind. It hasn't changed our hearts. It's changed our faces. It's taken every opinion we have, it's taken every joke we have, and it's forced us to conceal it and hide it and bury it. It's made us superficial.\"  \"Terrorism isn't caused by poverty, poverty is caused by terrorism. Terror is a tool used by those seeking power to keep the masses in need of an answer.\"  \"Too many people blame everything on everybody else, and because they do, they will expect too little from themselves and too little from their children.\" Glenn Beck says all that, and more.  As one of the most listened to nationally syndicated radio talk-show hosts and the driving force behind the Rallies for America, Glenn Beck entertains, inspires, and informs millions of listeners. In The Real America, Beck continues to tell it like it really is, cutting through the fog of modern-day pundits and pontificators who have made it their mission to undermine and underestimate the greatness of America, our strength as Americans, and the power of the American spirit.  With his inimitable combination of self-effacing humor and heartfelt conviction, Glenn rails against many of the forces that keep us from our potential as a nation and as individuals -- and tells how to overcome them. His topics include:   Family and community  Politics  Personal responsibility  Race relations  Religion  Political correctness, the media, Hollywood, and celebrities  Abortion and the deat penalty  Alcohol and drugs  Why I wave the flag  Glenn Beck's compelling message in The Real America echoes the ideas he has delivered to thousands of people with his groundbreaking Rallies for America: Once we connect with our power individually, we can empower others -- and then we can be as great and as grand as we have always wanted to be as a person, as a people, and as a nation.",
        "Category": " History , United States , General",
        "Publisher": "POCKET",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "New Choices In Natural Healing: Over 1,800 of the Best Self-Help Remedies from the World of Alternative Medicine",
        "Authors": "By Gottlieb, Bill (EDT) and Dollemore, Doug (EDT)",
        "Description": "Tap the Power of Alternative Medicine withNew Choices in Natural HealingAcupressure-- for pinpoint pain reliefAromatherapy-- relieve stress and tensionAyurveda-- a customized system of better healthFlower Therapy-- heal the mind, and the body will followFood Therapy-- the power to erase diseaseHerbal Therapy-- a healing partnership with Mother NatureHomeopathy-- medicines perhaps more powerful than prescriptionsHydrotherapy-- bathe yourself in natural healingImagery-- picture yourself perfectly healthyJuice Therapy-- the curative essence of fruits and vegetablesMassage-- hands-on healing for yourself and your familyReflexology-- speed restorative energy to organs and body partsRelaxation and Meditation-- achieve a higher state of healthSound Therapy-- soothe your body with music's gentle wavesVitamin and Mineral Therapy-- natural prescriptions for healingYoga-- stretches for better health",
        "Category": " Health & Fitness , Naturopathy",
        "Publisher": "Rodale Press, Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "In the Presence of Dinosaurs",
        "Authors": "By Colagrande, John and Felder, Larry",
        "Description": "Explores life in the Mesozoic era through text and illustrations that speculate on the daily life and behavior of dinosaurs and other creatures who lived in the various habitats of that time period.",
        "Category": " Nature , Dinosaurs & Prehistoric Creatures",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Uncle Vanya",
        "Authors": "By Chekhov, Anton Pavlovich, Mamet, David, and Chernomordik, Vlada",
        "Description": "Pulitzer Prize-winning playwright David Mamet’s Uncle Vanya is a sparkling restoration of a masterpiece of the modern stage, marked by Mamet’s finely tuned ear for dialogue and memorable poetic imagery.In \"Uncle Vanya,\" a retired professor and his beautiful young wife return to the country estate left by his deceased first wife to find themselves overwhelmed by the stagnant inevitability of the rituals of their life and class, and mercilessly taxed by the encroachment of age at the expense of youth. All of the play’s characters are plunged into that precarious state where, in Beckett’s words, &#147;the boredom of living is replaced by the suffering of being.”Working from a literal translation by Vlada Chernomordik, Mamet, who has also adapted Chekhov’s Three Sisters and The Cherry Orchard, opens the way for a contemporary audience to establish immediate contact with a classic, infusing the power of Chekhov’s play with the potent precision of his own modern voice.",
        "Category": " Drama , General",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Fanny Hill: Memoirs of a Woman of Pleasure",
        "Authors": "By Cleland, John",
        "Description": "",
        "Category": "",
        "Publisher": "Putnams",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "The Drowning Tree: A Novel (Ballantine Reader's Circle)",
        "Authors": "By Goodman, Carol",
        "Description": "Artfully imagined, intricately detailed, eerily poignant: these are the outstanding features of Carol Goodman’s literary thrillers. She is part novelist, part craftsman—and The Drowning Tree is her newest masterpiece.Juno McKay intended to avoid the nearby campus of her alma mater during her fifteenth reunion weekend, but she just can’t turn down the chance to see her longtime friend, Christine Webb, speak at the Penrose College library. Though Juno cringes at the inevitable talk of the pregnancy that kept her from graduating, and of her husband, Neil Buchwald, who ended up in a mental hospital only two years after their wedding, Juno endures the gossip for her friend’s sake. Christine’s lecture sends shockwaves through the rapt crowd when she reveals little-known details about the lives of two sisters, Eugenie and Clare—members of the powerful and influential family whose name the college bears. Christine’s revelation throws shadows of betrayal, lust, and insanity onto the family’s distinguished facade.But after the lecture, Christine seems distant, uneasy, and sad. The next day, she disappears. Juno immediately suspects a connection to her friend’s shocking speech. Although painfully reminded of her own experience with Neil’s mental illness, Juno nevertheless peels away the layers of secrets and madness that surround the Penrose dynasty. She fears that Christine discovered something damning about them, perhaps even something worth killing for. And Juno is determined to find it—for herself, for her friend, and for her long-lost husband.From the Hardcover edition.",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Monkey Learns To Potty",
        "Authors": "By Smith, Dana C. and McClure, Denise (ILT)",
        "Description": "Potty Monkey learns to potty train in this beautiful and fun-to-read child's board book. Potty Monkey has new underwear and a potty chair. Via \"Monkey See-Monkey Do\" storyline the monkey trains and so can you. Quality board book includes exceptionally colorful artwork and mirror. A joy to read again and again.",
        "Category": " Juvenile Fiction , Health & Daily Living , Toilet Training",
        "Publisher": "PottyMD",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2015"
        }
    },
    {
        "Title": "Encyclopedia of computer science and engineering",
        "Authors": "By Ralston, Anthony, Reilly, Edwin D",
        "Description": "",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold Co",
        "Price Starting With ($)": "43.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Garfield Food for Thought: His 13th Book",
        "Authors": "By Davis, Jim",
        "Description": "It's not that he doesn't have plenty to think about. Garfield could ponder the fact that he's the most popular cat in feline history. He could even examine his soul to discover why he's so funny, so mean to Odie, so nice to Nermal, and so exasperating and lovable to Jon. But he'd probably just prefer to think about food....",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Sacred Passage: How to Provide Fearless, Compassionate Care for the Dying",
        "Authors": "By Coberly, Margaret, Ph.D.",
        "Description": "Working as an emergency room nurse, Margaret Coberly came in contact with death on a daily basis. However, it wasn't until her own brother was diagnosed with terminal cancer that she realized she understood very little about the emotional and spiritual aspects of caring for the terminally ill. To fill this gap she turned to the unique wisdom on death and dying found in Tibetan Buddhism. In this book Coberly offers sound, practical advice on meeting the essential needs of the dying, integrating stories from her long career in nursing with useful insights from the Tibetan Buddhist teachings. In the West, death is viewed as a tragic and horrible event. Coberly shows us how this view generates fear and denial, which harm the dying by adding unnecessary loneliness, confusion, and mental anguish to the dying process. Tibetan Buddhism focuses on the nature of death and how to face it with honesty, openness, and courage. In this view, death is not a failure, but a natural part of life that, if properly understood and appreciated, can offer the dying and their loved ones an opportunity to gain valuable insight and wisdom. Coberly argues that the Tibetan Buddhist outlook can be a useful antidote to the culture of fear and denial that surrounds death in the West and can help caregivers become more fully present, fearless, honest, and compassionate. Sacred Passage  highlights two very practical teachings on death and dying from the Tibetan Buddhist tradition and presents them in clear, nontechnical language. Readers learn about the \"eight stages of dissolution leading to death,\" a detailed roadmap of the dying process that describes the sequence of physical, psychological, and spiritual changes that occur as we die. Coberly also presents the \"death meditation,\" a contemplative exercise for developing a new relationship to death—and life. The book also includes a lengthy, annotated list of recommended readings for added guidance and inspiration. Topics include:   How the terminally ill can experience emotional and spiritual healing even when they can't be cured  Why Western medicine's relentless focus on curing disease has led to inadequate care for the dying  What to expect during the dying process  How our fear and denial of death harm the dying  Techniques to help caregivers promote a peaceful environment for the dying and their loved ones  How to meet the changing physical and emotional needs of the dying  Helpful advice on what to say and how to behave around the terminally ill",
        "Category": " Religion , Buddhism , General",
        "Publisher": "Shambhala",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Painted Wood Projects in the Pennsylvania Folk Art Style",
        "Authors": "By Bridgewater, Alan and Bridgewater, Gill",
        "Description": "",
        "Category": " Crafts & Hobbies , Woodwork",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Cinderella",
        "Authors": "By Jeffers, Susan, Ehrlich, Amy, and Perrault, Charles",
        "Description": "In her haste to flee the palace before the fairy godmother's magic loses effect, Cinderella leaves behind a glass slipper.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Anthologies",
        "Publisher": "Dial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "This Unhappy Country: The Turn of the Civil War, 1863",
        "Authors": "By Arnold, James R. and Wiener, Roberta",
        "Description": "Discusses the Battles of Vicksburg, Gettysburg, Chancellorsville, and Chattanooga, all of which had a major impact on the outcome of the Civil War.",
        "Category": " Juvenile Nonfiction , History , United States , 19th Century",
        "Publisher": "Lerner Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Everyday Life of the Aztecs",
        "Authors": "By Bray, Warwick",
        "Description": "",
        "Category": "",
        "Publisher": "Hippocrene Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Hear the Just Word & Live It (Illuminationbooks)",
        "Authors": "By Burghardt, Walter J.",
        "Description": "",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Paulist Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Everything Kids' Joke Book: Side-Splitting, Rib-Tickling Fun",
        "Authors": "By Dahl, Michael",
        "Description": "Presents a collection of silly riddles, jokes, puzzles, and tricks, and offers information on famous comedians and advice about becoming developing a comedy act.",
        "Category": " Juvenile Nonfiction , Humor , Jokes & Riddles",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Finite Mathematics With Business Applications",
        "Authors": "By Kemeny, John G.",
        "Description": "",
        "Category": " Mathematics , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "May",
            "Year": "1972"
        }
    },
    {
        "Title": "Garfield Eats His Heart Out",
        "Authors": "By Davis, Jim",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "Decorating Details Projects and Ideas (Best of Martha Stewart Living)",
        "Authors": "By Stewart, Martha",
        "Description": "Provides instructions for making picture frames, tables, stools, lamps and shades, shelves, screens, mirrors, pillows, and throws",
        "Category": "",
        "Publisher": "Leisure Arts@ Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Verifying Nonproliferation Treaties: Obligation, Process, and  Sovereignty",
        "Authors": "By Kessler, J. Christian",
        "Description": "Examines two issues of national security policy: stemming the proliferation of weapons of mass destruction; and verifying international nonproliferation agreements. Describes the forces that shape the ways in which negotiators address the question of establishing and maintaining confidence among signatories to treaties limiting nuclear, chemical, and biological weapons and reducing the size of conventional forces. Explains how the chance events of the day intertwine with substantive developments in treaty negotiations and implementation.",
        "Category": " Political Science , International Relations , Arms Control",
        "Publisher": "Department of the Army",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Jerusalem: Song of Songs: A Passionate History of a Unique and Inspiring City",
        "Authors": "By Uris, Leon and Uris, Jill",
        "Description": "A magnificent historical tribute to the city of Jerusalem encompasses the five turbulent millennia of its history, and is accompanied by numerous photographs that illuminate every facet of the amazing city",
        "Category": " History , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "8.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Remaking America: New Uses, Old Places",
        "Authors": "By Diamonstein, Barbaralee",
        "Description": "",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "6.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Garfield Takes the Cake",
        "Authors": "By Davis, Jim",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Unspeakable Acts",
        "Authors": "By Bond, Simon",
        "Description": "Darkly humorous cartoons satirize the cruelty, insensitivity, tactlessness, and crassness of people in a portrayal of the absurdity of modern life",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Woman's Place: Options and Limits in Professional Careers",
        "Authors": "By Epstein, Cynthia Fuchs",
        "Description": "",
        "Category": " Social Science , Gender Studies",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Railway Children (Nesbit, NESB)",
        "Authors": "By Nesbit, Edith and Brock, C. E. (ILT)",
        "Description": "Nearly a hundred years after its original publication, The Railway Children is still one of E. Nesbit's most beloved and delightful stories. Roberta, Peter, and Phyllis were very happy living in a comfortable house surrounded by a cook and servants and two loving parents, until one evening when there was a knock at the door and their father was mysteriously taken away by two men. Suddenly alone, their mother moves the family to a small cottage in the countryside. There, the children begin a series of exciting adventures, from saving a train filled with passengers from a landslide, to rescuing a baby from a fire, to aiding a penniless Russian exile, to eventually unraveling the mystery of their father's disappearance. Featuring a new jacket illustration by Caldecott medalist Paul O. Zelinsky, as well as all nineteen of the original black-and-white line drawings by C. E. Brock, this classic story is perfect for home and classroom libraries.",
        "Category": " Juvenile Fiction , Transportation , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Operations Research Methods: As Applied to Political Science and the Legal Process (Quantitative Applications in the Social Sciences)",
        "Authors": "By Nagel, Stuart S. and Neef, Marian",
        "Description": "Discusses basic concepts and methods associated with the application of operations research toward arriving at an optimum mix, level, or choice.",
        "Category": " Social Science , Research",
        "Publisher": "SAGE Publications, Inc",
        "Price Starting With ($)": "16.5",
        "Publish Date": {
            "Month": "September",
            "Year": "1976"
        }
    },
    {
        "Title": "American Home: From Colonial Simplicity to the Modern Adventure",
        "Authors": "By Freeman, Michael (PHT), Rocheleau, Paul (PHT), Larkin, David, Garrett, Wendell, and Webb, Michael",
        "Description": "Nowhere else in the world can compare with the incredible array of domestic architecture in America. It sometimes seems that there are as many styles of houses as there are actual number of houses. While the earliest American houses were largely derived from English or Dutch prototypes, the diversity for which America is so celebrated soon emerged, reflecting mostly how Americans used their homes, as well as local and regional tastes and vernacular and folk origins from around the world. The variety and dynamism in the style of homes in that emerging pluralistic society marches on today in homes designed by adventuresome architects and clients.In this extraordinary celebration of the American house, renowned author David Larkin, with commentary by some of today's leading architectural historians and critics, examines the paths that have led to distinctively American homes. Special attention is given to examining details of the makeup of each house as well as the functions of \"the home\" and how these functions have changed just as technology, social relations, and living arrangements have changed in the United States over the past 400 years.Filled with more than 400 beautiful color photographs, this book also contains six double gatefolds, which offer dramatic presentations of the elements and details that make up the variety of architectural styles in American residential architecture. No other illustrated history of the American house can come close to this full portrayal of the historical and stylistic ranges of the place we call \"home.\"",
        "Category": " Architecture , History , General",
        "Publisher": "Universe",
        "Price Starting With ($)": "9.83",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Backgammon: The Way to Play and Win",
        "Authors": "By Gibson, Walter Brown",
        "Description": "",
        "Category": "",
        "Publisher": "BARNES & NOBLE",
        "Price Starting With ($)": "12.61",
        "Publish Date": {
            "Month": "June",
            "Year": "1974"
        }
    },
    {
        "Title": "The Beechers: An American Family in the Nineteenth Century",
        "Authors": "By Rugoff, Milton Allan",
        "Description": "Provides insight into the issues of a complex period through the influential Beecher family whose lives spanned the nineteenth century from the patriarch, Lyman, to his successful sons and daughters",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "Cactus Hotel (Rise and Shine)",
        "Authors": "By Guiberson, Brenda Z. and Lloyd, Megan (ILT)",
        "Description": "It is another hot day in the desert. Birds and other animals scurry about looking for food. When they get tired they stop to rest at a giant cactus. It is their hotel in the desert!Many different animals live in the cactus hotel. It protects them; and they protect it, by eating the pests that could harm the cactus.The cactus grows larger and larger and will live for about two hundred years. When one animal moves out, another moves in. There is never a vacancy in the cactus hotel.This story--about a desert, a giant cactus, and the animals who live in it--is one that even the youngest child will understand and enjoy.Parents' Choice AwardIRA-CBC Teachers' ChoiceAn NSTA-CBC Outstanding Science Trade BookAn NCTE Notable Trade Book in the Language Arts",
        "Category": " Juvenile Nonfiction , Science & Nature , Flowers & Plants",
        "Publisher": "Square Fish",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Mugged by the State: Outrageous Government Assaults on Ordinary People and Their Property",
        "Authors": "By Fitzgerald, Randall",
        "Description": "The author of When Government Goes Private focuses attention on government gone awry, chronicling numerous examples of harrassment and overzealous prosecution of government policies and laws that will shock readers.",
        "Category": " Political Science , Public Policy , General",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Schaum's Statistics",
        "Authors": "By Schaum, Spiegel, Murray R.",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill Companies",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "December",
            "Year": "1961"
        }
    },
    {
        "Title": "A Defense for the Dead (Tom Doherty Associates Books)",
        "Authors": "By Fredrickson, Michael",
        "Description": "The murderer is known as Van Gogh.  Leaving a bloody trail of bodies up and down the east coast, every one of the serial killer's targets receives his gruesome signature: the removal of the victim's right ear.  After ten such bodies, the FBI tracks him down and takes him out, putting an end to an horrific mystery.  For Boston attorney Jimmy Morrissey, however, Van Gogh's death is only the beginning.Jimmy Morrissey has problems of his own.  His wife has cancer, his practice is floundering, and his receptionist is trying to use him as his own personal bodyguard.  Things only get worse when two FBI agents let him in on a chilling piece of evidence found in Van Gogh's apartment: abeautiful woman's headshot, with Morrisey's name and address on the back.It isn't tool long before Morrissey realizes that he's been sent a message from beyond thegrave.  The tightly wrapped Van Gogh case begins to unravel with every new detail Jimmy uncovers, which could mean that a murderer is still at large.  But finding out the truth means taking on a client that technically doesn't exist, living Jimmy Morrissey as Defense for the Dead.",
        "Category": " Fiction , Legal",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Substitute Victim",
        "Authors": "By Pentecost, Hugh",
        "Description": "When his client, movie star and controversial political activist Elissa Hargrove, is one of the victims of a backstage bomb, public relations expert Julian Quist looks into Elissa's personal and political involvements and promptly becomes a target himself",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dodd, Mead",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "The Secret School",
        "Authors": "By Avi",
        "Description": "More than anything, Ida Bidson wants to become a teacher. To do that, she must finish eighth grade, then go on to high school. But her dream falters when the one-room school in her remote Colorado town shuts down. Her only hope is to keep the school open without anyone finding out. Yet even a secret school needs a teacher. Ida can't be it. . . . Or can she?In the spirit of The True Confessions of Charlotte Doyle, Newbery Medal winner Avi creates an inspiring story of a headstrong girl determined to control her own destiny.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Sugar Busters! Cut Sugar to Trim Fat",
        "Authors": "By Steward, H. Leighton (EDT), Bethea, Morrison C., Andrews, Sam S., Balart, Luis A., and Steward, H. Leighton",
        "Description": "Written by three renowned physicians and a CEO of a Fortune 500 company, Sugar Busters! is a new diet plan based on sound nutritional principles that shows you how to reduce the sugar in your daily menu through easy-to-follow recipes and meal plans. This effective and groundbreaking program steers you away from overhyped (and insulin-stimulating) foods such as potatoes and pasta, white bread and white rice, carrots and corn - and leads you toward a sensible consumption of delicious foods once considered taboo.With Sugar Busters! you will develop a diet plan that is right for you; determine the glycemic levels of various foods with a handy glycemic index; discover which foods to eat at what time of day; avoid food combinations that add pounds; learn the myths of calories, fats, cholesterol, and weight gain; and feel great, increase your energy, and prevent chronic disease.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Lethal Dose",
        "Authors": "By Snodgrass, Steven",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Icam Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Start a Craft - Toleware: Get Started in a New Craft With Easy-To-Follow Projects for Beginners",
        "Authors": "By Witchell, Ann",
        "Description": "A history of the beautiful and decorative art of Toleware is complemented by precise and fully illustrated instructions for preparing new and old metal items for decorating, from collecting materials through mastering equipment techniques.",
        "Category": "",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Carroll's heritage: Essays on the architecture of a Piedmont Maryland county",
        "Authors": "By Getty, Joe",
        "Description": "",
        "Category": "",
        "Publisher": "Historical Society of Carroll County",
        "Price Starting With ($)": "9.31",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Playtime (Treasure Hunt)",
        "Authors": "By Crawford, Andy (ILT)",
        "Description": "Young readers are invited to answer questions based on photographs of toys, sports equipment, art supplies, and other items and to find the plastic dinosaur hidden in the illustrations",
        "Category": " Juvenile Nonfiction , Concepts , General",
        "Publisher": "DK Preschool",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Safe Horse Safe Rider : A Young Rider's Guide To Responsible Horsekeeping",
        "Authors": "By Haas, Jessie",
        "Description": "Beginning with understanding the horse and ending with competitions, this book includes chapters onbody language, pastures, catching, and grooming. Ages 9 and up.",
        "Category": " Young Adult Nonfiction , Sports & Recreation , General",
        "Publisher": "Storey Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Wacky Wednesday (Beginner Books(R))",
        "Authors": "By Seuss, Dr. and Booth, George (ILT)",
        "Description": "Read and count along with Dr. Seuss and George Booth’s classic Beginner Book full of errors. This is no ordinary day! There’s a shoe on the ceiling and bananas in the apple tree, and it only gets wackier. From a hole in the kitchen table to a green sun in the sky, young readers will love finding each silly mistake. Illustrated by renowned New Yorker cartoonist George Booth, Wacky Wednesday is impossible to forget. Originally created by Dr. Seuss, Beginner Books encourage children to read all by themselves, with simple words and illustrations that give clues to their meaning.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1974"
        }
    },
    {
        "Title": "The Gospel for Kids (Series A)",
        "Authors": "By Weisheit, Eldon",
        "Description": "",
        "Category": "",
        "Publisher": "Concordia Pub House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Women and Pain: Why It Hurts and What You Can Do--Including Complementary and Holistic Remedies, As Well as Traditional Medicine",
        "Authors": "By Young, Mark Allen, M.D. and Baar, Karen",
        "Description": "A close-up look at the problem of chronic pain and how it affects women argues that women experience pain and respond to pain medications differently from men and show women how to treat their own chronic pain effectively with a range of complementary, holistic, and traditional therapies. 75,000 first printing.",
        "Category": " Health & Fitness , Holism",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Last Man Down: A Firefighter's Story of Survival and Escape from the World Trade Center",
        "Authors": "By Paisner, Daniel and Picciotto, Richard",
        "Description": "On September 11, 2001, FDNY Battalion Chief Richard \"Pitch\" Picciotto answered the call heard around the world. In minutes he was at Ground Zero of the worst terrorist attack on American soil, as the Twin Towers of the World Trade Center began to burn-and then to buckle. A veteran of the 1993 bombing of the World Trade Center, Picciotto was eerily familiar with the inside of the North Tower. And it was there that he concentrated his rescue efforts. It was in its smoky stairwells where he heard and felt the South Tower collapse. Where he made the call for firemen and rescue workers to evacuate, while he stayed behind with a skeleton team of men to help evacuate a group of disabled and infirm civilians. And it was in the rubble of the North Tower where Picciotto found himself buried-for more than four hours after the building's collapse.  This is the harrowing true story of a true American hero, a man who thought nothing of himself-and gave nearly everything for others during one of New York City's-and the country's-darkest hours.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Managing Organizational Performance (JOSSEY BASS SOCIAL AND BEHAVIORAL SCIENCE SERIES)",
        "Authors": "By Nash, Michael M.",
        "Description": "A practical guide to planning, measuring, and controlling performance at all organizational levelscorporate, departmental, group, and individual. Contains special resources such as charts, worksheets, questionnaires, and forms.",
        "Category": " Business & Economics , Management",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "8.46",
        "Publish Date": {
            "Month": "April",
            "Year": "1983"
        }
    },
    {
        "Title": "Art in the Early Church",
        "Authors": "By Walter Lowrie",
        "Description": "",
        "Category": "",
        "Publisher": "Pantheon Books",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "Honest Water (Wesleyan Poetry Series)",
        "Authors": "By Farnsworth, Robert",
        "Description": "Robert Farnsworth has sought to write poems that \"simultaneously think and sing.\"  His poems are meditative and musical with measured pace.  The landscape of northern New England, \"the Atlantic's edge,\" is central to the vision of this book.  It becomes a living phenomenon with human qualities: \"honest water\"; \"strong water\"; a landscape that has \"diminished and forgiven him.\"  He writes sometimes in melancholy about human affairs: \"a common durable sadness,\" \"a language of loss, of everything unassuaged,\" \"a thousand discouragements,\" \"the underwater light/that comes before a storm.\"  And often of quiet memory, \"imagination's tender lens,\" and of anticipation, \"the love your empty dress is promising.\"  Honest Water is a book of steadily evolving power.",
        "Category": " Poetry , General",
        "Publisher": "Wesleyan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The King of the Fields",
        "Authors": "By Singer, Isaac Bashevis",
        "Description": "A fictional exploration of primitive history, Singer's novel portrays an age of superstition and violence in a country emerging from the darkness of savagery. Part parable of modern civilization, part fascinating historical novel, it reaffrims the author's reputation as a master storyteller.",
        "Category": " Fiction , Jewish",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "49.64",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Woman of Letters",
        "Authors": "By Safir, Margery",
        "Description": "Alex, an unconventional and married young scholar sets out to seduce the man of her dreams, a Nobel Prize-winning playwright, in a story about the effects of sexual liberation in modern intellectual society",
        "Category": " Fiction , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "17.54",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Cities of Ancient Mexico: Reconstructing a Lost World",
        "Authors": "By Sabloff, Jeremy A.",
        "Description": "",
        "Category": "",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Planet of Whispers",
        "Authors": "By Kelly, James P.",
        "Description": "The cat-like aliens of the planet Chan attempt to trade the secret to long life to the Messengers in exchange for much-needed wheat",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Bluejay Books",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Sex in America: A Definitive Survey",
        "Authors": "By Kolata, Gina, Michael, Robert T., Gagnon, John H., and Laumann, Edward O.",
        "Description": "For the first time ever, Sex in America reveals the myth-shattering results of the only comprehensive and methodologically sound survey of America's sexual practices and beliefs.In 1992, highly regarded social scientists Robert T. Michael, John H. Gagnon, and Edward O. Laumann embarked on an unprecedented study of America's sex life. Working through the National Opinion Research Center at the University of Chicago, their staff of 220 interviewers spent seven months interviewing 3,432 scientifically selected respondents about all aspects of their sex lives, histories, and beliefs. More important, unlike the famous but inherently flawed reports of Alfred Kinsey, Redbook and Playboy magazines, Shere Hite, Samuel and Cynthia Janus, and others, this survey relied on a random sample of Americans rather than on an unrepresentative group of volunteers. The resulting data reveal not just what we do sexually but how society shapes even our most private sexual experiences. They show not just why we are the way we are, but what it might take to change this behavior.Sure to arouse considerable controversy, the survey directly contradicts many of the conclusions of previous reports and defies widely held conventional wisdom about America's sexual practices and beliefs, with startling revelations about how often people have sex, how many partners they have, and where they meet them; the likelihood that the AIDS epidemic will spread into the heterosexual population; what people like to do in bed; how many Americans are homosexual; the incidence of forced sex; and why some people are more satisfied with their sex lives than others.After years of misleading statistics and unsubstantiated claims, Sex in America presents a comprehensive, reliable look at America's collective sex life, the definitive word on American sexuality today.",
        "Category": " Social Science , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "When Friday Isn't Payday: A Complete Guide to Starting, Running-and-surviving in a Very Small Business",
        "Authors": "By Kirk, Randy W.",
        "Description": "Presents the very small business entrepreneur with guidelines on when to start a business, when to enlarge, or when to quit",
        "Category": " Business & Economics , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Dirty Little Secrets : The Persistence of Corruption in American Politics",
        "Authors": "By Sabato, Larry J. and Simpson, Glenn R.",
        "Description": "Fact: The Christian Coalition's 1994 voter guides appear to have been skewed to favor Republican candidates in key congressional races across the country, in direct contravention of federal election law.The truth is, the politicians couldn't be happier dickering over the remains of the welfare state. Because, as you'll learn in Dirty Little Secrets, there is probably not a politician in America who does not benefit directly, personally, and continually from the status quo.Fact: On the eve of the 1994 elections, mock \"pollsters\" called up thousands of voters in one Wisconsin congressional district to ask whether their electoral decisions would be influenced if they knew one of the candidates was a lesbian.Most politicians want to do the right thing. But they also want to be reelected, and the system is far stronger than any honest man or woman. The influence of money and the intricacies of the levers of power make it easier for politicians to ignore the law than to obey it. In Dirty Little Secrets you will read of the conservative movement's hidden manipulations in 1994, and learn the truth about Newt Gingrich's twenty-year program of political destabilization. The history of the corrupt House the Democrats built with the help of liberal interest groups stands revealed. And Larry J. Sabato and Glenn R. Simpson expose the corrupt and illegal tactics both parties have used for decades to protect and promote their own power.Fact: In 1994, in Alabama, one local election was decided by fewer than three hundred votes. Seventeen hundred ballots cast in that election were illegally admitted absentee ballots, some of them submitted by dead people.Sabato and Simpson's fresh reporting and thousands of hours of background research include interviews with influential politicians, consultants, and political operatives, Freedom of Information Act requests, and thousands of pages of obscure campaign reports. They prove corruption is not about bad apples or colorful local traditions. And they offer a completely original plan for reform - Deregulation Plus - that will frighten both parties and make the American electorate smile for the first time in years. Dirty Little Secrets pulls together the corruption story from all parts of the country so overwhelmingly that no one - from the White House to your house - will be able to deny that political reform must be one of the key issues of the 1996 election campaign.",
        "Category": " Social Science , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Nurse as Executive (Aspen Publication)",
        "Authors": "By Barbara J. Stevens",
        "Description": "",
        "Category": "",
        "Publisher": "Aspen Publishers",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Introduction to Islamic Civilization",
        "Authors": "By Savory, Roger M. (EDT)",
        "Description": "This book is a wide-ranging and general introduction to Islamic civilisation from its origins to the present day. Writing in clear and non-technical language, Professor Savory's contributors seek answers to broad and important questions: how did a single civilisation develop in a multi-ethnic, multi-cultural region; how did Islamic internationalism come to be translated into powerful nationalist movements in modern times; how has the West been affected by its continuing contact with Islam; what factors have threatened Islamic civilisation in modern times, and is there a future for it at all. The book begins with a section on the geographical, ethnic and linguistic background of the Middle East, continues with an historical résumé of the Islamic period, and moves on to the core chapters on the religious, philosophical and legal foundations of Islamic society and its contributions to world civilisation in the fields of literature, art, science and medicine. The time-scale covers the pre-Islamic, medieval and modern periods, and care has been taken to draw out the implications of the interaction between Christian West and Islamic East from the Crusades down to the massive encroachment of the West upon the Muslim world - at military, political, economic and cultural levels - in the modern era. Introduction to Islamic Civilisation is based on a successful series of adult-education programmes broadcast on Canadian radio, organised by members of the Department of Islamic Studies at the University of Toronto. The material has been revised and rewritten for book publication and is offered as a genuinely introductory handbook on a vital and fascinating subject.",
        "Category": " History , World",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1976"
        }
    },
    {
        "Title": "Mystic Seaport",
        "Authors": "By Brownell, Lisa",
        "Description": "",
        "Category": "",
        "Publisher": "Mystic Seaport",
        "Price Starting With ($)": "7.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Johnson humor",
        "Authors": "By Johnson, Lyndon B., Adler, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Words at Play: Quips, Quirks & Oddities",
        "Authors": "By Michaelsen, O. V.",
        "Description": "A puzzle columnist for the  Mensa International Journal  assembles a plethora of puns, an anthology of anagrams, a pack of palindromes, many malapropisms, oodles of oxymorons, and quite a few just plain curiosities, many never before published in book form, and probably never to be so again. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Humor , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Schaum's outline of theory and problems of microeconomic theory (Schaum's outline series)",
        "Authors": "By Salvatore, Dominick",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The Christian Home School",
        "Authors": "By Harris, Gregg",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "Noble Pub Assoc/Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Saint-Gaudens and the gilded era",
        "Authors": "By Tharp, Louise Hall",
        "Description": "",
        "Category": "",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "101 Things Everyone Should Know About Science",
        "Authors": "By Michels, Dia L. and Levy, Nathan",
        "Description": "Why do you see lightning before you hear thunder? What keeps the planets orbiting around the sun? What metal is a liquid at room temperature? Science affects everything -- yet so many of us wish we understood it better. Using an accessible question-and-answer approach, key concepts in biology, chemistry, physics, earth and general science are explored and demystified in this award-winning book. An engaging and fun way to better your understanding of how science surrounds us every day.",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "Science, Naturally!",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Buddhism: The Path to Nirvana (Religious Traditions of the World)",
        "Authors": "By Lester, Robert C.",
        "Description": "Traces the development of Buddhism, discusses its beliefs, traditions, and practices, and identifies the path to enlightenment",
        "Category": " Religion , Buddhism , General",
        "Publisher": "Harper San Francisco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "United Methodist Altars:A Guide For The Local Church",
        "Authors": "By Hickman, Hoyt L.",
        "Description": "",
        "Category": " Religion , Christian Church , Administration",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Valley of The Far Side (Volume 6)",
        "Authors": "By Larson, Gary",
        "Description": "1985 FarWorks, Inc. All Rights Reserved.The Far Side and the Larson signature are registered trademarks of FarWorks, Inc.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Garfield Worldwide (Garfield #15)",
        "Authors": "By Davis, Jim",
        "Description": "How does America's foremost feline do it? There's so much lasagna to be eaten, so many dogs to kick around, that he doesn't have time to worry about current events. He is the maestro of mirth and the purveyor of puns to his millions of fans. With Garfield in your life, is there room for anything more...?",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Garfield Weighs In: His Fourth Book",
        "Authors": "By Davis, Jim",
        "Description": "Contains cartoons of Garfield scoring victories for gluttony and lethargy and includes Garfield's own opinionated biography of his creator",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "Da Capo Best Music Writing 2003: The Year's Finest Writing On Rock, Pop, Jazz, Country & More",
        "Authors": "By Groening, Matt (EDT) and Bresnick, Paul (EDT)",
        "Description": "It's here: the fourth and latest volume in the series that you have come to rely upon for your music reading fix. The 2003 volume will celebrate the year's best writing about music and its culture with a selection of pieces on a dazzling array of topics drawn from more than a hundred sources-remarkable essays by journalists and authors who are as serious about writing as they are about music.Past contributors have included:* Jonathan Lethem * David Rakoff * Mike Doughty * Lorraine Ali * Greil Marcus * Richard Meltzer * Robert Gordon * Sarah Vowell * Nick Tosches * Anthony DeCurtis * William Gay * Whitney Balliett * Lester Bangs * Rosanne Cash * Susan Orlean * David Hadju * Lenny Kaye * The Onion * Mark Jacobson * Gary Giddins * John Leland * Luc Sante * Monica Kendrick * Kalefa Sanneh",
        "Category": " Music , History & Criticism",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "What Do You Say?",
        "Authors": "By Stanley, Mandy",
        "Description": "in this bright, sturdy board book you will find sounds for all kinds of creatures, from a friendly lion to a little fish. This is the perfect book to read -- and roar -- along with!",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Open Hand Celebration Cookbook: Great Chefs Cook for Festive Occasions",
        "Authors": "By Eichelbaum, Stanley",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Quotable Dad",
        "Authors": "By Lyons, Tony (EDT), Lyons, Nick (INT), Lyons, Tony (INT), and Lyons, Nick (EDT)",
        "Description": "\"I felt something impossible for me to explain in words. Then when they took her away, it hit me. I got scared all over again and began to feel giddy. Then it came to me--I was a father.\"--Nat King Cole\"I can run the country or I can control Alice [his daughter]. I can't do both.\"--Theodore Roosevelt\"The simplest toy, one which even the youngest child can operate, is called a grandparent.\"--Sam Levenson\"John Elway is a great football player. He used to be my son. Now I'm his father.\"--Jack Elway\"My father was not a failure. After all, he was the father of a president of the United States.\"--Harry S. Truman\"When I was fourteen, my father was so ignorant I could hardly stand to have the old man around. But when I got to be twenty-one, I was astonished at how much he had learned in seven years.\"--Mark Twain THE QUOTABLE DAD is a collection of hundreds of memorable quotations about the relationships between fathers and their sons and daughters--some wise, some thoughtful, some hilarious. The quotations range from the thoughts of an expectant father, to the rewards and challenges of raising children, to the delightful musings on being a grandfather. They are culled from sources as varied as famous writers, actors, athletes, comedians, captains of industry, politicians, and philosophers.",
        "Category": " Reference , Quotations",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Encounter program",
        "Authors": "By Enstrom, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Theater in America: 200 Years of Plays, Players, and Productions",
        "Authors": "By Henderson, Mary C.",
        "Description": "A comprehensive study recreates the history of the American stage, includes a review of trends and fashions, and shows a complete production schedule, from playwright to casting call",
        "Category": "",
        "Publisher": "Harry N. Abrams, Inc.",
        "Price Starting With ($)": "8.51",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "The Spirit of the Chinese Character: Gifts from the Heart",
        "Authors": "By Aria, Barbara and Gon, Russell Eng",
        "Description": "From the fluid strokes in the characters denoting \"grace,\" \"enlightenment,\" and \"tranquility\" to the complex meanings inherent in the words for \"honor,\" \"love,\" and \"wisdom,\" the richness and depth of the Chinese language come alive in this compact, elegant volume of 40 beautifully rendered ideograms. Every character is accompanied by a simple chart showing its physical composition, stroke by stroke, as well as an informative text describing the myriad linguistic components from which its meaning is derived.As a result, the reader can grasp each character's significance and connection to centuries of Chinese philosophy and, ultimately, gain an understanding of the language beyond a mere familiarity with linguistic symbols. Complete with two-color printed end-papers and a charming full-color bookmark, The Spirit of the Chinese Character makes a lovely gift or keepsake volume, sure to inspire a fascination with the complexity of an incomparably beautiful and evocative language.",
        "Category": " Foreign Language Study , Chinese",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "The Vivid Flavors Cookbook: International Recipes from Hot & Spicy to Smokey & Sweet",
        "Authors": "By Wemischner, Robert",
        "Description": "Includes international-style recipes for poultry, fish, seafood, grains, pastas, and vegetables",
        "Category": " Cooking , Methods , Canning & Preserving",
        "Publisher": "Lowell House",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Party!",
        "Authors": "By Warde, Fran and Treloar, Debi (ILT)",
        "Description": "",
        "Category": " Cooking , Entertaining",
        "Publisher": "Gardners Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Zachary's Ball (Tavares baseball books)",
        "Authors": "By Tavares, Matt",
        "Description": "An engaging picture book that really hits home—just in time for baseball season!Zachary is amazed by the sights and sounds at Fenway Park when he goes to his first major-league baseball game. But when his father catches a foul ball at the game and gives it to Zachary, something really amazing happens—suddenly, he finds himself on the pitcher's mound, wearing a Red Sox uniform! As long as Zachary has the ball, all of his baseball fantasies seem to come true. But can he hold onto its magic? With simple text and striking black-and-white pencil drawings, Matt Tavares brings to life the fantasy of every baseball fan and evokes the spirit of a beloved national pastime.",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Beacon On The Rock: Dramatic History of Lighthouses from Ancient Greece to the Present Day (Barron's Education Series)",
        "Authors": "By Williams, Peter",
        "Description": "Describes ancient lighthouses built by the Phoenicians and  Greeks, then details development of lighthouses from  seventeenth-century wood-fired beacons to today's  state-of-the-art solar-powered lights. Readers are treated to a  fascinating chronicle of lighthouse technology and architecture,  with focus on how lighthouses have evolved over the centuries.  Full-color cutaway diagrams show the inner workings of a  lighthouse and describe how its lens system operates.",
        "Category": " History , General",
        "Publisher": "Brécourt Academic",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Who Got Einstein's Office? Eccentricity And Genius At The Institute For Advanced Study",
        "Authors": "By Regis, Edward",
        "Description": "",
        "Category": "",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Sea Kayaking: A Manual for Long-Distance Touring",
        "Authors": "By Dowd, John",
        "Description": "Demonstrates kayaking techniques, tells how to plan a long ocean trip, and offers practical information about navigation, safety, camping, food gathering, and first aid",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Greystone Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Great Movie Musical Trivia Book",
        "Authors": "By Jones, Shirley and Kurtti, Jeff",
        "Description": "(Applause Books). \"If you're a fan of the celluloid musical, get ready   you are about to have one terrific time.\"  Shirley Jones \"It's here. The perfect gift for anyone who likes a good movie musical ... This is complete coverage: from stats through awards, to fun dirt on ten of everyone's favorite movies. It grabs you and you can't quit nibbling.\"   4-Front  \"Kurtti challenges even the most astute music fan.\"   Edge . Includes more than 100 photos!",
        "Category": " Performing Arts , Film , Guides & Reviews",
        "Publisher": "Applause Theatre & Cinema Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Hammond New Century World Atlas",
        "Authors": "By Hammond Incorporated (COR)",
        "Description": "Presents detailed, large format, computer-generated world maps and includes information on topography, population, land use, mineral resources, currency, environmental concerns, population trends, and more",
        "Category": " Reference , General",
        "Publisher": "Hammond World Atlas Corp",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Man's Many Voices: Language in its Cultural Context",
        "Authors": "By Burling, Robbins",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "National Geographic Atlas of the Middle East",
        "Authors": "By National Geographic Society (U. S.)",
        "Description": "While tensions continue to rise in Iraq and surrounding countries, there is a heightened curiosity worldwide for definitive, balanced, and timely information about the Middle East. This concise and distinctive volume provides a fascinating, in-depth look at the driving forces that have led to acts of violence, religious fervor, and costly wars in this hotile territory and lends valuable insight into the present situation. National Geographic Atlas of the Middle East contains newly researched and updated maps illustrating the diverse issues of the region today. Boundary and territorial disputes, the uneven distribution of natural resources, and booming population pressures are detailed in stunning visual explanations. Other regional thematic maps elaborate on questions surrounding religion, ethnic and linguistic groups, oil, water, agriculture, industry, trade, international corporations, and military forces. The complex history of the Middle East is explored through maps devoted to topics that include the rise and falls of empires, civilizations, major conflicts, holy sites, and various other significant events that have shaped the region. Geographically, politically, thematically, and chronologically organized, National Geographic Atlas of the Middle East is an accessible reference to a turbulent area prominent in headlines, hearts, and minds.",
        "Category": " Reference , Atlases, Gazetteers & Maps",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Rhymes with Witches",
        "Authors": "By Myracle, Lauren",
        "Description": "High school freshman Jane believes that she would do anything to be popular until she is selected to be in the school's most exclusive clique and learns that popularity has a price.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Shenandoah Wonder and Light (Wonder and Light series)",
        "Authors": "By Plant, Ian J.",
        "Description": "Windswept granite peaks dramatically thrusting up from gentle rolling hills and turbulent waterfalls cascading through sylvan forests are among the featured views captured in these photographs of Shenandoah National Park.",
        "Category": " Photography , Subjects & Themes , Regional",
        "Publisher": "Mountain Trail Press",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    }
]