[
    {
        "Title": "The Literary Murder: A Critical Case (Michael Ohayon Series, 2)",
        "Authors": "By Gur, Batya and Bilu, Dalya (TRN)",
        "Description": "Inspector Michael Ohayon of the Jerusalem police must deal with profound ethical questions when he investigates the murder of a celebrated poet and professor of literature at the Hebrew University",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2020"
        }
    },
    {
        "Title": "Woman of Influence: Ten Traits of Those Who Want to Make a Difference",
        "Authors": "By Farrel, Pam",
        "Description": "You can have a godly influence in your family, on the job, at church, in your community and beyond. This book discusses the qualities that God values and shows how you can develop those qualities to become a woman of influence - a woman whose life makes a difference.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Intervarsity Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Extra Nutty",
        "Authors": "By Nancy, Ted L.",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Adult Children Secrets of Dysfunctional Families: The Secrets of Dysfunctional Families",
        "Authors": "By Friel, John C. and Friel, Linda D.",
        "Description": "It is estimated that as many as 34 million people grew up in alcoholic homes. But what about the rest of us? What about families that had no alcoholism, but did have perfectionism, workaholism, compulsive overeating, intimacy problems, depression, problems in expressing feelings, plus all the other personality traits that can produce a family system much like an alcoholic one? Countless millions of us struggle with these kinds of dysfunctions every day, and until very recently we struggled alone. Pulling together both theory and clinical practice, John and Linda Friel provide a readable explanation of what happened to us and how we can rectify it.",
        "Category": " Self-help , Codependency",
        "Publisher": "Health Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Loki & Loon: A lifetime affair with the sea",
        "Authors": "By Pinchot, Gifford B.",
        "Description": "",
        "Category": "",
        "Publisher": "Dodd Mead",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Credible Signs of Christ Alive: Case Studies from the Catholic Campaign for Human Development",
        "Authors": "By Hogan, John P.",
        "Description": "This accessible and stirring book not only introduces readers to the work of the Catholic Campaign for Human Development (CCHD), the domestic antipoverty and social justice program sponsored by the United States Conference of Catholic Bishops, but also inspires us to service. With John P. Hogan as our guide, we are invited to walk with those who serve and those who are served in confronting the daily reality of poverty as well as the root causes and structures that cause it. Written with the skill of a journalist and the passion of a social justice reformer, Credible Signs of Christ Alive highlights six exemplary CCHD-funded projects that represent successful joint efforts between the working poor—including whites, African-Americans, Latin Americans, and a variety of immigrant groups including, Africans, Asians, Hispanics, and Russians—and the non-poor. Complete with case studies, reflection questions, suggested actions, contacts, and optional further reading, this book tells the story behind the poverty statistics, mines the hope behind the headlines, and makes real the power of faith to transform the world.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Sheed & Ward",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Manuscript Submission (Elements of Fiction Writing)",
        "Authors": "By Edelstein, Scott",
        "Description": "Looks at the current fiction market, explains how to select and approach editors and agents, and indicates the proper form for proposals and submissions",
        "Category": " Reference , Writing Skills",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Blown to Bits: How the New Economics of Information Transforms Strategy",
        "Authors": "By Evans, Philip and Wurster, Thomas S.",
        "Description": "The new economics of information is blowing apart the foundations of traditional business strategy. According to Blown to Bits, your business definition, industry definition, and competitive advantage are simultaneously up for grabs. Evans and Wurster argue that with the spread of connectivity and common standards, your customers will increasingly have rich access to a universe of alternatives, your suppliers will exploit direct access to your customers, and focused competitors will pick off the most profitable parts of your value chain. With an uncompromising clarity and vivid examples, Blown to Bits is targeted squarely at today's practicing business and corporate leaders. This groundbreaking book shows how to build new strategies that reflect the new economics of information, and explains how to take advantage of the forces shaping today's competitive advantage.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Harvard Business Review Press",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Living With Grief: Alzheimer's Disease",
        "Authors": "By Doka, Kenneth J. (EDT)",
        "Description": "Papers by experts in geriatrics, gerontology, psychology, law, and bioethics look at the challenges posed by Alzheimer's and related dementias to clinicians, professional and lay caregivers, hospice workers, and policy advocates. Topics include quality of life, personal perspectives on the disease, helping patients and caregivers adapt, and medical advances. The volume includes a chapter on Alzheimer's resources in the US but lacks a subject index. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Health & Fitness , Diseases , Nervous System (incl. Brain)",
        "Publisher": "Hospice Foundation of America",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Gobbledygook Has Gotta go",
        "Authors": "By John O'Hayre",
        "Description": "",
        "Category": "",
        "Publisher": "Wash, D.C.: Dept of Interior, (1966)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "The Christian's secret of a happy life for today: A paraphrase of Hannah Whitall Smith's classic",
        "Authors": "By Jackson, Catherine",
        "Description": "",
        "Category": "",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Daily Pathways",
        "Authors": "By Rice, Helen Steiner",
        "Description": "Poems, selected scriptures, and meditations attempt to create an awareness of God's presence",
        "Category": " Religion , General",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Body of Truth",
        "Authors": "By Lindsey, David L.",
        "Description": "From the bestselling author of Mercy, an artfully crafted, hypnotically suspenseful thriller that combines the intensity of Thomas Harris with the moral complexity of Graham Greene.David L. Lindsey is one of those rare writers who have enjoyed both critical and commercial success. His six previous novels have received widespread acclaim for their elegant writing and vivid characters, but they also have been virtually impossible to put down, and his last novel, Mercy was a huge national bestseller. Now, in Body of Truth, Lindsey's popular hero Stuart Haydon returns as he investigates the disappearance of a young American woman in the murky underworld of Guatemala.When Lena Muller, daughter of a wealthy Houston businessman, disappears in Central America, her father, convinced she has been murdered, hires private detective Jim Fossler to investigate. Six months later Haydon receives an urgent call from Fossler - an old friend - from Guatemala City. Fossler has found Lena, but believes she is in serious trouble; sounding quite shaken, he asks Haydon to fly down to help him clear up the situation.Haydon complies, and upon arriving in Guatemala is immediately drawn into the country's surreal and violent netherworld, where a small group of American expatriates are engaged in quasi-official intrigues that have entangled them with corrupt military officials and an elusive faction of Guatemalan guerrillas. The unforgettable cast of Lena's \"friends,\" all desperately trying to locate her, include Bennett Pittner, the brilliant, jaded semi-alcoholic CIA head of station in Guatemala; Janet Pittner, his wealthy and dangerously impetuous ex-wife, a woman for whom deceit is second nature - and a pleasure; Dr. Aris Grajeda, a young Guatemalan doctor who passionately fights both his country's suffering and the corruption that causes it; and Taylor Cage, a shadowy \"freelancer\" in the intelligence trade, an undeniably arrogant, calculating, and charming man, as \"possessing of true bravery as any man Haydon had ever met.\"As Haydon is drawn further into this maze of conspiracies, he soon realizes that Lena Muller is not the young woman either he or her parents thought her to be. And, much to his regret, he also learns that it is not only people who disappear in Guatemala - often the border between reality and illusion vanishes as well.Body of Truth is a brilliant thriller: literate, haunting, and as impossible to put down as it is to forget.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Informed Advantage A Resource Guide for Healthy Aging (1998 publication)",
        "Authors": "By George Pfeiffer~Judith Webster",
        "Description": "",
        "Category": "",
        "Publisher": "Wrkcr Pr",
        "Price Starting With ($)": "9.27",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Windy City Blues (V.I. Warshawski Novel)",
        "Authors": "By Paretsky, Sara",
        "Description": "Nine deftly plotted stories feature Chicago's hard-nosed but tender-hearted private investigator, V. I. Warshawski, along with the regular crew of Lotty, Max, Sal, and Murray. 75,000 first printing. $75,000 ad/promo.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Friends, Lovers, Chocolate (Isabel Dalhousie Series)",
        "Authors": "By McCall Smith, Alexander",
        "Description": "ISABEL DALHOUSIE - Book 2 Nothing captures the charm of Edinburgh like the bestselling Isabel Dalhousie series of novels featuring the insatiably curious philosopher and woman detective.  Whether investigating a case or a problem of philosophy, the indefatigable Isabel Dalhousie, one of fiction’s most richly developed amateur detectives, is always ready to pursue the answers to all of life’s questions, large and small.In this delightful second installment in Alexander McCall Smith’s bestselling detective  series, the irrepressibly curious Isabel Dalhousie gets caught up in a highly unusual  affair of the heart.When Isabel is asked to cover for vacationing Cat at her delicatessen,  Isabel meets a man with a most interesting problem. He recently had a heart transplant  and is suddenly haunted by memories of events that never happened to him.The situation  piques her insatiable curiosity: Could the memories be connected with the donor’s  demise? Naturally, Isabel’s friend Jamie thinks it is none of Isabel’s business.  Meanwhile, Grace, Isabel’s housekeeper, has become infatuated with a man at her spiritualist  meeting, and Cat brings home an Italian lothario. That makes for some particularly  tricky problems–both practical and philosophical–for Isabel to unravel in this enormously  engaging and highly unusual mystery.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Second Time Around (Clark, Mary Higgins)",
        "Authors": "By Clark, Mary Higgins",
        "Description": "In a novel that reaffirms her reputation as \"America's Queen of Suspense,\" Mary Higgins Clark delivers a gripping tale of deception and tantalizing suspense.  Nicholas Spencer, charismatic head of the medical research company Gen-stone, involved in the development of an anticancer vaccine, suddenly disappears. His private plane crashes en route to Puerto Rico, but his body is not found.  Early results of the vaccine seemed highly promising. Yet, coinciding with Nicholas Spencer's disappearance comes news that the FDA is denying approval. Then follows the shocking revelation that Spencer had looted Gen-stone of huge sums of money -- including the lifetime savings of people who had risked every penny they had.  Marcia \"Carley\" DeCarlo, the thirty-two-year-old columnist for the Wall Street Weekly, is assigned to cover the story. Carley is the stepsister of Spencer's wife, Lynn, an aggressive PR woman and socialite, whom she dislikes and distrusts.  The day after news of her husband's disappearance rocks the financial and medical world, Lynn attends a meeting of the stockholders of Gen-stone, flaunting expensive clothing and jewelry. Accused of having participated in the scam, she appears indifferent to the anger and despair of the people attending, among them a man whose child has cancer and who is now about to lose his home. That night, she narrowly escapes death when her mansion in Bedford, New York, is set on fire. She turns to Carley, begging her to use her investigative skills to prove that she was not her husband's accomplice.  As Carley proceeds with her investigation, she is confronted by seemingly impenetrable questions: Is Nicholas Spencer dead or in hiding? Was he guilty or set up? Why the sudden reversal in medical opinion of the vaccine from recognition to condemnation? And as the facts begin to unfold, she becomes the target of a dangerous group involved in a sinister and fraudulent scheme.  The Second Time Around is Mary Higgins Clark at her best, telling a story that intertwines fiction with the stuff of real-life headlines in a novel of breathtaking suspense and surprises.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Sacrifice",
        "Authors": "By Vachss, Andrew H.",
        "Description": "While searching for a missing infant, private eye Burke stumbles upon a monstrous child, a baby killer, a discovery that leads him into a horrifying world of witchcraft, voodoo, cruelty, and Satanism in the dark underworld of New York",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Weapons of Mass Distortion: The Coming Meltdown of the Liberal Media",
        "Authors": "By Bozell, L. Brent",
        "Description": "Could Al Franken and his left-wing cronies possibly be right? Is liberal media bias just a myth propagated by conservatives, and have the mainstream media actually swung to the right? Absolutely not.In the new book Weapons of Mass Distortion, L. Brent Bozell III—founder and president of the Media Research Center, America’s largest and most respected media watchdog organization—presents the definitive account of how liberal bias in the news industry is alive and well. But here’s the thing: The liberal media are headed for a downfall. Bozell demonstrates how their monopoly on information is at last coming to an end, in large part because journalists continue to deny the bias that infects their news coverage. His unrivaled expertise allows him to show readers exactly how the media landscape is changing—and to expose the even bigger changes that are coming.Marshaling an astonishing amount of evidence, Bozell documents exactly how the news media deliberately attempt to set the national agenda through their slanted coverage. In the process he destroys the arguments that Franken and many other left-wing commentators have put forward regarding media bias.Weapons of Mass Distortion also reveals:• How the liberal media’s slanted coverage of President George W. Bush will play a huge role in the 2004 elections• Why liberals’ claims about the influence of Fox News and the “conservative media” are wrong—and deliberately misleading• How the mainstream press has waged war on the war on terrorism• Never-before-told stories of how leading journalists, behind the scenes, betray the liberal bias they so forcefully deny in public—incidents that Bozell has witnessed firsthand• How the same journalists who condemn the Right for “hate speech” regularly launch (and get away with) vicious personal attacks on conservatives • Clear evidence that the major news outlets are hemorrhaging viewers, readers, and listeners precisely because of their liberal biasBy dominating the news media for so long, liberals have been able to control what we see and hear. But as Bozell makes clear, the Left will lose that control soon enough.",
        "Category": " Political Science , International Relations , Arms Control",
        "Publisher": "Crown Forum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Spirit of England",
        "Authors": "By Bryant, Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "Collins",
        "Price Starting With ($)": "5.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Weatherproofing (Home Repair and Improvement)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Open Hearts, Helping Hands: Prayers by Lay Volunteers in Mission",
        "Authors": "By Koch, Carl and Culligan, Michael",
        "Description": "",
        "Category": " Religion , Christian Life , Stewardship & Giving",
        "Publisher": "St Marys Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Impossible Dreams: A Red Sox Collection",
        "Authors": "By Stout, Glenn (EDT)",
        "Description": "The Red Sox have long been the favorite subject of baseball's literati, more for what they haven't accomplished than for what they have. The mystery that shrouds this storied franchise has made for great copy for more than 100 years. But much of the very best writing on the team has often been obscured by romantic tales of legend and destiny, curses and conspiracies - until now. Turning solidly to the bedrock of traditional baseball writing, Glenn Stout has collected the best writing on the Sox that best tells the story of the franchise. A veritable sourcebook of more than a century of unforgettable baseball, Impossible Dreams is a book no self-respecting Sox fan can afford to miss.",
        "Category": " Sports & Recreation , Baseball , Essays & Writings",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Babar's Little Girl",
        "Authors": "By De Brunhoff, Laurent",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "The Siege of Shangri-La: The Quest for Tibet's Sacred Hidden Paradise",
        "Authors": "By McRae, Michael J.",
        "Description": "At the far eastern end of the Himalayas in Tibet lies the Tsangpo River Gorge, known as \"the great romance of geography\" during the nineteenth century's golden age of exploration. Here the mighty Tsangpo funnels into an impenetrable canyon three miles deep, walled off from the outside world by twenty-five-thousand-foot peaks. Like the earthly paradise of Shangri-La immortalized in James Hilton's classic 1933 novel Lost Horizon, the Tsangpo Gorge is a refuge revered for centuries by Tibetan Buddhists - and later in the Western imagination - as a sanctuary in times of strife as well as a gateway to nirvana.The Siege of Shangri-La tells the story of this fabled land's exploration as both a geographical and a spiritual destination - and chronicles the discovery at the end of the millennium of the truth behind the myths and rumors about it. Veteran journalist Michael McRae traces the gorge's exploratory history from the clandestine missions of surveyor-spies called pundits and the horticultural expeditions of naturalists in the early twentieth century to the recent investigations of scholars, adventurers, and pilgrims seeking the gorge's physical and metaphysical nucleus: the \"Hidden Falls\" of the Tsangpo.",
        "Category": " History , Asia , General",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Tamarind Woman",
        "Authors": "By Badami, Anita Rau",
        "Description": "Set in the railway colonies of India, Tamarind Woman tells a sweeping story of two generations of women. Kamini, an overachiever, lives in a self-imposed exile in Canada. Her mother, Saroja, nicknamed Tamarind Woman due to her sour tongue, is trapped by the customs of traditional Indian life. When Saroja informs her daughter that she has sold their house and is going on a journey across India alone by train, both women are plunged into the past, confronting their dreams and disappointments as well as their long-held secrets. At the center of both their lives is Kamini's elusive father, an officer for the India Railway System. Often away from home working on the railroads, he is unaware of the secrets of his own household. He doesn't know that his wife disappears for days at a time, leaving Kamini and her favored younger sister in the care of their superstitious servant. Nor does he know the gossip surrounding his wife and the local mechanic. Nothing, however, escapes Kamini's notice. Only now, living in Canada, is she able to make sense of the eccentric family she's left behind. Only now, with her children grown and her husband long deceased, is Saroja able to make peace with her past.  Lyrical, compassionate, and wise, Tamarind Woman is a powerful novel about family, memory, and the traditions that tear us apart and bring us together.",
        "Category": " Fiction , Literary",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Average American: The Extraordinary Search for the Nation's Most Ordinary Citizen",
        "Authors": "By O'Keefe, Kevin",
        "Description": "Send an e-card for The Average American! Click here.    John Q Public. Plain Jane. The Average Joe. We think we know the type, but have we ever actually met the person? To be the perfectly average American is harder than it might seem: You must live within three miles of a McDonald's, and two miles of a public park; you must be better off financially than your parents, but earn no more  than $75,000 a year; you must believe in God and the literal truth of the Bible, yet hold some views that traditional churches have deemed sacrilegious.   Equipped with his trusty Mr. Q, a notebook that he  has compiled with over 1,000 facts about the Average American, Kevin O'Keefe has completed a tour of America in search of the sublimely ordinary, the man or woman who represents most definitively all that is average in our country.   In his travels from New York to Nevada, Pennsylvania to Hawaii, Kansas to Connecticut and beyond, O'Keefe talks business and pleasure with the proprietors of Average Joe and Jane Athletics, visits the polls on election day with the first candidate for the Average American  party, bypasses both Peoria and Normal, Illinois (for, as he explains, they are not that normal), watches the magician Myklar the Ordinary wow the kids at a church in rural Maryland, and delivers a fascinating, often surprising, look into the history and culture of the common man and  woman. At the end of the road he discovers that the Average American is, up close, rather extraordinary.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Lady and the Unicorn",
        "Authors": "By Chevalier, Tracy",
        "Description": "A set of bewitching medieval tapestries hangs today in a protected chamber in Paris. They appear to portray a woman's seduction of a unicorn, but the story behind their making is unknown - until now.Paris, 1490. A shrewd French nobleman commissions six lavish tapestries celebrating his rising status at Court. He hires the charismatic, arrogant, sublimely talented Nicolas des Innocents to design them. Nicolas creates havoc among the women in the house - mother and daughter, servant and lady-in-waiting - before taking his designs north to the Brussels workshop where the tapestries are to be woven.There, master-weaver Georges de la Chapelle risks everything he has on finishing the tapestries - his finest, most intricate work - on time for his exacting French client. Ill-prepared for temptation and seduction, he and his family are consumed by the project and by their dealings with the full-blooded painter from Paris.The results change all their lives - lives that have been captured in the tapestries, for those who know where to look.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Off the Mangrove Coast",
        "Authors": "By L'Amour, Louis",
        "Description": "Louis L'Amour is an American legend, a master storyteller whose tales of action and heroic adventure echo his own intrepid exploits. Relentless suspense, breathtaking danger, riveting characters-these are the hallmarks of L'Amour's classic fiction. Off the Mangrove Coast collects for the first time in one volume nine of his extraordinary stories-some long out of print and unavailable anywhere else, some never before published.From the jungles of Borneo to the hidden canyons of the American West, from small-town fight clubs to a Parisian caf&eacute at the end of World War II, these are tales of betrayal and revenge, courage and cowardice, glory and greed, as only Louis L'Amour can tell them.Here are vintage stories of men and women who dare what others will never attempt, who fight for justice and dreams when the odds are against them. A charismatic boxer with quick hands and a hair-trigger temper itches to fight all comers-but if he's ever going to get a shot at a championship, he will first have to fight the man who ruined his father. A beautiful movie star finds a dead man in her apartment and begs a former lover to clear her name, only to enmesh the tough private eye in a murder with ties to the mob.Here too, are tales of high adventure. A reluctant hero, hired to guide a diamond-hunting couple up a river ruled by headhunters and pirates, risks everything in pursuit of a legendary stone and the mysterious warlord who guards it. And in the title story, Off the Mangrove Coast, a young renegade who'd grown to manhood riding freights, prizefighting, and working mines sails the exotic South China Sea with a trio of dangerous men in search of treasure they figure to divide four ways. But when it's time to dive for the prize, can he trust any of them to guard his back?Combining electrifying action scenes, vivid historical detail, and characters who seem to leap off the page, these spectacular stories honor the legend of Louis L'Amour. A memorable addition to the author's already impressive catalogue of work, Off the Mangrove Coast celebrates L'Amour's unequalled genius, creative vision, and humanity.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Last Heroes: A Men at War Novel",
        "Authors": "By Griffin, W. E. B.",
        "Description": "In The Last Heroes, it is June 1941. War clouds break over Europe, and determined that the United States will be prepared, Franklin D. Roosevelt and \"Wild Bill\" Donovan orchestrate the most complex espionage organization in history, the Office of Strategic Services. Young and daring, the handpicked members of the OSS assemble under a thin camouflage of diplomacy and then disperse throughout the world to conduct operations upon which may hinge the entire outcome of the war. And of them all, no operation may be more critical than the one being conducted by hotshot pilot Richard Canidy and his half-German wild-card friend Eric Fulmar: to secure the rare ore that will power a top-secret weapon coveted on both sides of the Atlantic - the atomic bomb.",
        "Category": " Fiction , War & Military",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Teddy Bear Collection",
        "Authors": "By Baxter, Nicola and Shuttleworth, Cathie (ILT)",
        "Description": "Offers young and old a glimpse into the secret lives of teddy bears in a collection of twelve tales told by the bears themselves on a cold winter night, revealing what really happened at the Teddy Bears' Picnic and other secrets.",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Viruses: A Scientific American Library Book",
        "Authors": "By Levine, Arnold J.",
        "Description": "Part of the  Scientific American   Library, an account for the general reader of what viruses are, how they go about their little lives, and how they have such a huge impact on ours. Very well illustrated with photographs and drawings, many in color. No bibliography. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Scientific American Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "I'd like to be (A Parents magazine read aloud original)",
        "Authors": "By Kroll, Steven",
        "Description": "A little girt imagines all the things she'd like to be before deciding that being \"me\" is the best of all.A child imagines solving various problems by being a clock, a doctor, a duck, and other identities, before deciding that being \"me\" is the best of all",
        "Category": "",
        "Publisher": "Parents Magazine Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Keeping Your Cool Under Fire: Non Defensive Communication",
        "Authors": "By Wells, Theodora",
        "Description": "Reviews the fundamentals of nondefensive communication, which stresses retaining internal control in situations when external control is vested in someone else and demonstrates how to quickly evaluate all options within a situation",
        "Category": " Psychology , General",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "August",
            "Year": "1979"
        }
    },
    {
        "Title": "Surrender and Survival: The Experience of American Pow's in the Pacific 1941-1945",
        "Authors": "By Kerr, E. Bartlett",
        "Description": "Recounts Japanese treatment of more than twenty thousand U.S. prisoners of war during World War II, and discusses the cultural clashes that occurred",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "The United States Air Force: Basic documents on roles and missions (Air staff historical study)",
        "Authors": "By Wolf, Richard Irving",
        "Description": "",
        "Category": "",
        "Publisher": "Office of Air Force History, U.S. Air Force",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "International politics of energy interdependence: The case of petroleum",
        "Authors": "By Choucri, Nazli",
        "Description": "",
        "Category": "",
        "Publisher": "Lexington Books",
        "Price Starting With ($)": "6.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Incident at Hawk's Hill",
        "Authors": "By Eckert, Allan W and Schoenherr, John (ILT)",
        "Description": "Six-year-old Ben is very small for his age, and gets along better with animals than people. One June day in 1870, Ben wanders away from his home on Hawk's Hill and disappears into the waving prairie grass. This is the story of how a shy, lonely boy survives for months in the wilds and forges a bond with a female badger. ALA Notable Book. Newbery Honor Book.",
        "Category": " Young Adult Fiction , Historical , United States , 19th Century",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Customer Service: Career Success through Customer Satisfaction (NetEffect Series) (2nd Edition)",
        "Authors": "By Timm, Paul R.",
        "Description": "",
        "Category": " Business & Economics , Customer Relations",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Black Mass",
        "Authors": "By Lehr, Dick and O'Neill, Gerard",
        "Description": "John Connoly and James \"Whitey\" Bulger grew up together on the streets of South Boston. Decades later, in the mid 1970's, they would meet again.  By then, Connolly was a major figure in the FBI's Boston office and Whitey had become godfather of the Irish Mob.  What happened next -- a dirty deal to being down the Italian mob in exchange for protection for Bulger -- would spiral out of control, leading to murders, drug dealing, racketeering indictments, and, ultimately, the biggest informant scandal in the history of the FBI.Compellingly told by two Boston Globe reporters who were on the case from the beginning, Black Mass is at once a riveting crime story, a cautionary tale about the abuse of power, and a penetrating look at Boston and its Irish population.",
        "Category": " True Crime , General",
        "Publisher": "HarpPeren",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Managing Systems Maintenance",
        "Authors": "By Perry, William E.",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Q E D Pub Co",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "The Great Hill Stations Of Asia",
        "Authors": "By Crossette, Barbara",
        "Description": "For the European and later the American colonial soldier, the civil administrator and his clerk, the merchant, the missionary, and the families who followed them east of Suez, daily life was less a matter of advancing the glory of God or empire than a battle for survival against sunstroke, dysentery, cholera, malaria, and a host of other unnamed deadly fevers as well as little-examined, vague indispositions that in hindsight would probably be diagnosed as clinical symptoms of depression. Later, medical scholars coined a phrase for it: ?tropical fatigue.' Pity John Ouchterlony. By the time they brought him to the healing hills, it was too late. On April 29, 1863, Lieutenant Colonel Ouchterlony of the Royal Madras Engineers died of ?jungle fever brought on by exposure while in the execution of his duty,' says a memorial plaque?one of many?at St. Stephens Church in Ootacumund, a British colonial town in the Nilgiri Hills of southern India. Others were luckier. They got to Ooty in time and survived the perilous East, at least for another season, by rising above its pestilential lower reaches. On litters, in chairs, on ponies, by foot if they were able, Europeans in Asia nearly two centuries ago began climbing into the hills in search health, relaxation, and sometimes their sanity.They called the refuges they created?little European towns carved from rocky mountainsides or nestled in the meadows of high plateaus?'hill stations.' Colonialism came and went, but the hill stations remain. They are no longer European, but most have not lost their unique appeal. After all, the plains still fry in the sun and the cities of Asia have only grown larger, noisier, and more polluted. New generations of Asians are rediscovering hill stations and turning them into tourist resorts with luxury hotels and golf courses. Hill stations still cling to their history, and the story they tell reveals a lot about how colonial life was lived. They also have a future, if environmental damage and overpopulation do not destroy the forested hills and mountains that gave them their spectacular settings and pleasant climates.Hill stations began to appear, albeit at different times in different places, when the era of initial exploration and conquest was waning, wives and families arrived in substantial numbers, and life had become a bit more routine. By then, colonial societies could take stock of their longer-term needs and, regrettably, look for ways to build walls around themselves to shut out native populations. Through the age of European mercantile empire building and colonialism that began with the turn of the sixteenth century, hill stations were largely a nineteenth-century phenomenon. Most were established between 1820 and 1885, though the Dutch were early with Bogor in Indonesia and the French came later with Dalat in Vietnam and the Americans with Baguio in the Philippines. The British themselves built a second generation of hill stations after World War I in southeast Asia.In early 1997, Barbara Crossette set off on a journey of several months to see Asia anew through its great hill stations, moving from mountain to mountain from Pakistan, across India, to Sri Lanka, Burma, Malaysia, Vietnam, and the Philippines. A year earlier, Crossette had made a trip to the highlands of Indonesian Sumatra, the land of the Minangkabau and Batak people, where the idea of this kind of journey came together.",
        "Category": " History , Asia , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "No Child Left Behind: A Guide for Professionals",
        "Authors": "By Yell, Mitchell L. and Drasgow, Erik",
        "Description": "This guide examines the No Child Left Behind Act (NCLB) of 2001 and its effect on the education of students in America's public schools. This guide describes the legal structure of the law, the purpose of the law, and examines important principles of the law relevant to states, school districts and schools.  Because each state will have its own ways of addressing the requirements of the law, discussion questions throughout each section require the reader to seek information about their state's interpretation of NCLB.",
        "Category": " Education , Educational Policy & Reform , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Three Faces of Revolution",
        "Authors": "By Philbrick, Herbert Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "Capitol Hill Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Amazing Men: Courage, Insight, Endurance",
        "Authors": "By Tenneson, Joyce",
        "Description": "An extraordinary assortment of portrait photographs, a follow-up to Wise Women, captures a cross-section of men aged sixty and over, representing a variety of professions, geographic locations, and lifestyles, including Tom Brokaw, Bill Cosby, Robert DeNiro, B. B. King, Joe Torre, Ben Kingsley, and many others. Simultaneous. 50,000 first printing.",
        "Category": " Photography , Individual Photographers , General",
        "Publisher": "Bulfinch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Family Celebrations at Birthdays and for Vacations and Other Holidays",
        "Authors": "By Hibbard, Ann",
        "Description": "Offers tips and advice for planning Christian celebrations for birthdays and other special occasions, and includes family devotions and a selection of hymns",
        "Category": " Religion , General",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "The Art of War",
        "Authors": "By Sun-tzu, Griffith, Samuel B. (TRN), and Liddell, B. H. (FRW)",
        "Description": "Like Machiavelli's The Prince and the Japanese Book of Five Rings, Sun Tzu's The Art of War is as timely for business people today as it was for military strategists in ancient China. Written in China more than 2,000 years ago, Sun Tzu's classic The Art of War is the first known study of the planning and conduct of military operations. These terse, aphoristic essays are unsurpassed in comprehensiveness and depth of understanding, examining not only battlefield maneuvers, but also relevant economic, political, and psychological factors.  Indeed, the precepts outlined by Sun Tzu regularly applied outside the realm of military theory. It is read avidly by Japanese businessmen and was touted in the movie Wall Street as the corporate raider's bible.Providing a much-needed translation of this classic, Samuel Griffith has made this powerful and unique work even more relevant to the modern world. Including an explanatory introduction and selected commentaries on the work, this edition makes Sun Tzu's timeless classic perfectly accessible to modern readers.",
        "Category": " Philosophy , Eastern",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1971"
        }
    },
    {
        "Title": "Essentials of Maternal-Newborn Nursing",
        "Authors": "By Olds, Sally B., London, Marcia L., and Ladewig, Patricia W.",
        "Description": "A textbook for nursing students (and also relevant to practicing nurses), composed of five parts: basic concepts, pregnancy, birth, the newborn, and postpartum.  Within each part, the sequence of chapters moves logically from normal to abnormal (or \"at-risk\") coverage, while cultural aspects of the childbearing experience are integrated throughout. Among other changes, this revised and updated edition (2nd ed., 1990) expands coverage of high-risk pregnancy and the high-risk newborn. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "9.01",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Older and Wiser",
        "Authors": "By Restak, Richard M.",
        "Description": "Packed with specific advice and simple exercises, a groundbreaking guide to the latest scientific research into the effects of aging is designed to help maintain, and increase, brain power at any age. Reprint.",
        "Category": " Medical , Mental Health",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Russian-English/English-Russian Dictionary -- 1993 publication",
        "Authors": "By Benyukh, Oleg and Benyukh, Ksana",
        "Description": "A contemporary dictionary for students and travelers, with some 32,000 entries. The Russian-English section offers the phonetics for the Russian words in Roman letters, for those not completely familiar with the Cyrillic alphabet. The English-Russian section likewise offers phonetics in the Cyrillic alphabet to help Russians pronounce American English. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Hippocrene Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Knot's Complete Guide to Weddings",
        "Authors": "By Roney, Carley and Creators of the Knot's Online",
        "Description": "The editors of \"The Knot,\" a highly popular Internet site devoted to all things nuptial, present a savvy guide to contemporary weddings, filled with cost-cutting strategies, tips on handling relatives, photographs, and much more. Original. $230,000 ad/promo.",
        "Category": " Reference , Weddings",
        "Publisher": "Broadway",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Showman: The Life of David O. Selznick",
        "Authors": "By Thomson, David",
        "Description": "David O. Selznick, the legendary producer and maker of Gone With the Wind, is brilliantly portrayed in this full-scale biography by the first writer to be given complete access to Selznick's voluminous and revealing papers - everything from script notes, production reports, and contract memos, to letters rich in intrigue, gambling accounts, and financial records. No other Hollywood giant ever had so much to say; no other was brave and reckless enough to leave so much on the record.Selznick was the most charming, best-read, most insanely workaholic (and most easily diverted), most talented, arrogant, hopeful, amorous, insecure, and self-destructive of all the geniuses of American moviemaking. His story is the history of the picture business, from immigrant nerve to cafe society. It is, as well, the story of the chronic romantic who married first the princess of the kingdom (Irene, daughter of Louis B. Mayer) and then a young beauty - Jennifer Jones - whom he made a princess.Around him was a cast of vivid supporting players: his father, Lewis J., who made and lost fortunes in silent films; his two brothers - Myron, a pioneering (and boozing) agent, and Howard, whose mental condition overshadowed the rest of the family; Irene, David's scourge and his last comfort, as well as the person who taught him about power in Hollywood; Jock Whitney, fabulously rich, a great friend to David, and crazy about the movies; George Cukor; Alfred Hitchcock; Orson Welles; Vivien Leigh; Alexander Korda; William Paley; Ben Hecht; and John Huston.We see Selznick making such films as What Price Hollywood?, King Kong, David Copperfield, A Star is Born, Rebecca, Since You Went Away, Spellbound, Duel in the Sun, Portrait of Jennie, The Third Man, and A Farewell to Arms. And we are given the fullest possible account of the chaos, good fortune, folly, and glory of the making of Gone With the Wind.This superb biography uncovers the private lives and business maneuverings of Hollywood as no other book has done. It chronicles the Golden Age as seen from deep inside the gold mine and from behind locked doors where the spoils were divided, filched, or gambled away. In its rich sense of the wonders, ironies, and delusions inherent in \"showmanship,\" this is a book about America in this century, turning from reality toward the glamour, the legend - the fantasy - of the movies.",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Sexuality and homosexuality;: A new view",
        "Authors": "By Karlen, Arno",
        "Description": "",
        "Category": "",
        "Publisher": "W. W. Norton",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "To The Ends of the Earth",
        "Authors": "By Carpenter, Marj and Chrisman, Kent (EDT)",
        "Description": "",
        "Category": " Religion , Christianity , Protestant",
        "Publisher": "Geneva Press",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "The Italians: A Full-Length Portrait Featuring Their Manners and Morals",
        "Authors": "By Barzini",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1977"
        }
    },
    {
        "Title": "Goldilocks and the Three Bears",
        "Authors": "By Black Claire and Illustrator-Kincaid Eric",
        "Description": "",
        "Category": "",
        "Publisher": "Berryland Books Ltd",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Wallpapers for Historic Buildings: A Guide to Selecting Reproduction Wallpapers",
        "Authors": "By Nylander, Richard C",
        "Description": "",
        "Category": " Architecture , Decoration & Ornament",
        "Publisher": "Natl Trust for Historic",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1983"
        }
    },
    {
        "Title": "Harriet Tubman: Antislavery Activist (Black Americans of Achievement)",
        "Authors": "By Huggins, Nathan Irvin and Taylor, Marian",
        "Description": "Describes the life of the energetic abolitionist, including her origins as a slave in Maryland, her role as a \"conductor\" for the Underground Railroad, her service to the Union during the Civil War, and her role in establishing an old-age home for Afro-Americans.",
        "Category": " Young Adult Nonfiction , Biography & Autobiography , Cultural Heritage",
        "Publisher": "Chelsea House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Burn Unit: Saving Lives after the Flames",
        "Authors": "By Ravage, Barbara",
        "Description": "&#147;A compelling blend of science, history and storytelling. Barbara Ravage has fashioned an enlightening, invaluable book.” &#151;Stewart O&#39;Nan, author of The Circus Fire: A True Story of an American TragedyThough each of us is just a spark away from being a burn victim, the public knows little and understands less about the world that patients inhabit. Pulling the curtains back on this private and sterile environment, Burn Unit is a riveting account of the frontline efforts&#151;both modern-day and historical&#151;to save lives devastated by fire. With unflinching urgency, Barbara Ravage follows an extraordinary team of healers at Massachusetts General Hospital, the cradle of modern burn treatment and the site of one of the best burn units in the world. From Boston&#39;s Cocoanut Grove fire of 1942 to the treatment of the victims of the Rhode Island nightclub fire in early 2003, we watch everyday heroes do their incredible but punishing work against the backdrop of history. Both a moving human drama and an engrossing scientific exploration of this little-known field of medicine, Burn Unit is an unforgettably powerful read.",
        "Category": " Medical , Emergency Medicine",
        "Publisher": "Da Capo Press Inc",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Quotable Women: A Celebration",
        "Authors": "By Running Press",
        "Description": "",
        "Category": " Literary Criticism , Women Authors",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "What's Holding You Back?: Eight Critical Choices For Women's Success",
        "Authors": "By Austin, Linda S.",
        "Description": "After thirty years of feminism, women continue to underachieve, occupying only 10 percent of top-level managerial or professional positions. And significant achievement-influential woman leaders and visionaries-is rarer still. The reason, argues this bold and inspiring book, lies in the self-imposed psychological glass ceiling, which influences every decision women make in their lives. What's Holding You Back? charts women's unique pathways to achievement and examines eight life-defining choices that determine their ultimate level of accomplishment.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Bouncing Back",
        "Authors": "By King, Jan",
        "Description": "Jan King comes from the school of hard knocks. She's been through two divorces and a bout with breast cancer. She's lost loved ones along the way, and has endured other struggles with family and friends. But one thing Jan has always done is keep her sense of humor. Her first book, Hormones from Hell, sold over a million copies and reminded women of the lighter side of menopause. Now in Bouncing Back, she takes her trademark \"tell it like it is\" style and tackles the subject of life's challenges-and shows how anyone can face adversity and come out on top. Her step-by-step \"BOUNCE Plan\" inspires readers to eat right, think positive, and tackle life's woes with both strength and style.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Women's Spirituality: Resources for Christian Development",
        "Authors": "By Conn, Joann Wolski (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Mars Plus",
        "Authors": "By Pohl, Frederik and Thomas, Thomas T.",
        "Description": "The mixed Mars population of humans, cyborgs, and half-cyborgs is suddenly beset by strange changes in, and behavior of, the computer net on which all Martian life depends. By the author of the Nebula Award-winning Man Plus.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Mystic River",
        "Authors": "By Lehane, Dennis",
        "Description": "When they were children, Sean Devine, Jimmy Marcus, and Dave Boyle were friends. But then a strange car drove up their street. One boy got in the car, two did not, and something terrible happened -- something that ended their friendship and changed all three boys forever. Twenty-five years later, Sean is a homicide detective. Jimmy is an ex-con. And Dave is trying to hold his marriage together and keep his demons at bay-demons that urge him to do horrific things.When Jimmy's daughter is found murdered, Sean is assigned to the case. His investigation brings him into serious conflict with Jimmy. And then there is Dave, who came home covered in someone else's blood the night Jimmy's daughter died. While Sean attempts to use the law to return peace and order to the neighborhood, Jimmy finds his need for vengeance pushing him ever closer to a moral abyss from which he won't be able to return.A tense and unnerving psychological thriller, Mystic River is also an epic novel of love, loyalty, faith, and family.",
        "Category": " Fiction , General",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "New Living Spaces (HOME REPAIR AND IMPROVEMENT (UPDATED SERIES))",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Illustrations, diagrams, and instructions show the homeowner how to divide a large room, convert an attic, basement, or garage into a usable room or work space, and make other adaptations of house space to suit family needs",
        "Category": " House & Home , Repair",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Heating and Cooling",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": "",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Jazz for Beginners (Beginner's Documentary Comic Books, 42)",
        "Authors": "By David, Ron and Holley, Vanessa",
        "Description": "",
        "Category": " Music , Genres & Styles , Jazz",
        "Publisher": "Writers & Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Korea: The Untold Story of the War",
        "Authors": "By Goulden, Joseph C.",
        "Description": "A history of the Korean War makes use of recently declassified documents that provide a background for the decisions that affected the course of the war",
        "Category": "",
        "Publisher": "Times Books",
        "Price Starting With ($)": "46.27",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "At the Summit; Speeches and Interviews; February 1987 - July 1988 - 1st Edition/1st Printing",
        "Authors": "By Gorbachev, Mikhail S.",
        "Description": "Contains statements and interviews by and with the Soviet leader at both Summits, as well as his subsequent reports to the Soviet people. No index or bibliography. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Richardson, Steirman & Black",
        "Price Starting With ($)": "15.59",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Nixon Off the Record : His Candid Commentary on People and Politics",
        "Authors": "By Crowley, Monica",
        "Description": "With fully reconstructed conversations based on extensive notes made at the time, Nixon off the Record puts the reader in the room with the thirty-seventh president, listening to his views on leadership, his opinions of White House predecessors and successors, his activities and thoughts during the 1992 presidential campaign and election, and his assessment of Bill Clinton's first year in office and his potential challengers in 1996. Nixon's views give voters uncommon criteria by which to measure presidential candidates - including Bob Dole - and their ability to exercise effective leadership.Richard Nixon was one of the most controversial and indestructible presidents of the twentieth century. With her privileged perspective and unlimited access to Nixon, Crowley has written a perceptive and spirited memoir that shows not just what Nixon thought in the last years of his life but who he was. She offers an unprecedented behind-the-scenes view of Nixon's activities and opinions, giving the reader a front-row view of recent American political history.Nixon's unparalleled experience placed him in a unique position to judge leaders who had come before and after. His assessments are candid, astonishing, and sometimes explosive. This book places those judgments in context and brings them alive for the last American presidential election of the twentieth century.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Shaker Style",
        "Authors": "By Bowman, John S.",
        "Description": "",
        "Category": "",
        "Publisher": "JG Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Sexual confidence",
        "Authors": "By Phillips, Debora",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Teddy Ballgame: My Life in Pictures",
        "Authors": "By Williams, Ted, Pietrusza, David (CON), Doerr, Bobby (FRW), Feller, Bob (CON), and Thorn, John (INT)",
        "Description": "An initimate portrait of one of the most compelling sports figure of the 20th century, vibrantly told in Ted Williams own plain-spoken words.",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "Sport Media Pub",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "World of the Polar Bear",
        "Authors": "By Bruemmer, Fred",
        "Description": "",
        "Category": "",
        "Publisher": "NorthWord Press, Inc.",
        "Price Starting With ($)": "19.25",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Log Cabin Cooking: Pioneer Recipes & Food Lore",
        "Authors": "By Swell, Barbara",
        "Description": "",
        "Category": " Cooking , History",
        "Publisher": "Native Ground Music",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Old-Time Farmhouse Cooking: Rural America Recipes & Farm Lore",
        "Authors": "By Swell, Barbara",
        "Description": "",
        "Category": " Cooking , History",
        "Publisher": "Native Ground Music",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Strategic Investing",
        "Authors": "By Casey, Douglas",
        "Description": "Offers financial advice to the small investor on a variety of available investment options and on general money matters, including pensions, banking, consumer prices, real estate, borrowing, and investing",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "Twenty Years A-Growing (Oxford Paperbacks)",
        "Authors": "By O'Sullivan, Maurice",
        "Description": "In tellng the story of his youth, Maurice O'Sullivan uses a style derived from the folk tales he learned from his grandfather, and sharpened by his own lively imagination. Though he wrote simply for his own pleasure and for the entertainment of his friends--without any thought of a wider audience--O'Sullivan now enjoys a devoted following of readers who appreciate what E.M Forster praised as the \"gaiety and magic\" of this book.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1983"
        }
    },
    {
        "Title": "What Kind of Family Is This?: A Book About Stepfamilies (Golden Learn About Living Books)",
        "Authors": "By Seuling, Barbara, Berk, Bernice, and Dolce, Ellen (ILT)",
        "Description": "When Jeff's mother remarries, he has trouble adjusting to his new stepfather, stepsister, and stepbrother, as well as the lack of privacy in the new house",
        "Category": "",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "Mr. Food Cooks Like Mama",
        "Authors": "By Ginsburg, Art",
        "Description": "Mr. Food sets out to recreate the nostalgia and great taste of Mama's cooking, with more than 250 recipes that adapt traditional dishes to the ease of the modern kitchen. 100,000 first printing. $75,000 ad/promo. Lit Guild & BH&G Alt. Tour.",
        "Category": " Cooking , Reference",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Signs of Life in the USA: Readings on Popular Culture for Writers",
        "Authors": "By Maasik, Sonia and Solomon, Jack (EDT)",
        "Description": "Signs of Life in the USA teaches students to read and write critically about popular culture by giving them a conceptual framework to do it: semiotics, a field of critical theory developed specifically for the interpretation of culture and its signs. Written by a prominent semiotician and an experienced writing instructor, the text’s high-interest themes feature provocative and current reading selections that ask students to think analytically about America’s impressive popular culture:  How is TV’s Mad Men a lightning rod for America’s polarized political climate? Has the nature of personal identity changed in an era when we spend so much of our lives online? Signs of Life bridges the transition to college writing by providing students with academic language to talk about our common, everyday cultural experience. Read the preface. Order Multimodal Readings for Signs of Life in the USA packaged with Signs of Life in the USA, Seventh Edition using ISBN-13: 978-1-4576-1989-2.",
        "Category": " Language Arts & Disciplines , Readers",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "America's Traditional Crafts",
        "Authors": "By Robert Shaw",
        "Description": "",
        "Category": "",
        "Publisher": "Beaux Arts Edition",
        "Price Starting With ($)": "11.08",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Dragonfly: NASA And The Crisis Aboard Mir",
        "Authors": "By Burrough, Bryan",
        "Description": "The co-author of the best-seller, Barbarians at the Gate, offers a behind-the-scenes account of NASA's ambitious, sometimes tumultuous involvement with Russia's problem-plagued Mir space station over three years. 175,000 first printing.",
        "Category": " Technology & Engineering , Aeronautics & Astronautics",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The official Scrabble quiz game book: Based on the world's leading word game",
        "Authors": "By Allen, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The World of Hummingbirds",
        "Authors": "By Tilford, Tony",
        "Description": "",
        "Category": " Nature , Birds & Birdwatching",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Power Interviews: Job-Winning Tactics from Fortune 500 Recruiters",
        "Authors": "By Hough, Lee and Yeager, Neil",
        "Description": "Interviewing in today's fiercely competitive job market can seem like walking through a minefield. New trends in corporate strategy and structure have led to dramatic changes in what employers look for in prospective employees and in the types of questions you will be asked during an interview.In this revised and expanded edition of their bestselling career guide, two experienced counselors share their inside knowledge --and the expert advice of Fortune 500 recruiters --to equip you with the interviewing skills you need to land the job. Here's where you'll find: * The key characteristics that leading companies look for in prospective employees --and how to project them * The fifty most frequently asked questions --as well as detailed scripts of the best answers * The Power Prep Strategy --practice sessions to perfect your interview techniques * Tips on positioning yourself during an interview --how to convey your added value * Strategies for power negotiating, overcoming differences with an interviewer, narrowing your job search --and much more.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The convention problem: Issues in reform of presidential nominating procedures (Studies in presidential selection)",
        "Authors": "By Parris, Judith H.",
        "Description": "",
        "Category": "",
        "Publisher": "Brookings Institution",
        "Price Starting With ($)": "10.33",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Murders: Washington's most famous murder stories",
        "Authors": "By Kelly, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "Washingtonian Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "NUTS!: Southwest Airlines' Crazy Recipe for Business and Personal Success",
        "Authors": "By Freiberg, Kevin and Freiberg, Jackie",
        "Description": "Two management consultants reveal the secrets of Southwest Airlines' success and describe the unusual and unexpected inner workings of one of America's biggest success stories. 100,000 first printing. $300,000 ad/promo. Tour. IP.",
        "Category": " Transportation , Aviation , Commercial",
        "Publisher": "Bard Press",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Cut",
        "Authors": "By McCormick, Patricia",
        "Description": "An astonishing PUSH novel about pain, release, and recovery from an amazing new author.Fifteen-year-old Callie isn't speaking to anybody, not even to her therapist at Sea Pines, the \"residential treatment facility\" where her parents and doctor sent her after discovering that she cuts herself.  As her story unfolds, Callie reluctantly become involved with the other \"guests\" at Sea Pines -- finding her voice and confronting the trauma that triggered her behavior.",
        "Category": " Young Adult Fiction , Social Themes , General",
        "Publisher": "Push",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Poor Richards Almanac for the Years 1733-1758. Wherein are retain'd in Their Entirety the Author's Prefaces, Proverbs, Verses & Entertaining Remarks",
        "Authors": "By Franklin, Benjamin",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1977"
        }
    },
    {
        "Title": "Little Creatures",
        "Authors": "By Napoli, Donna Jo and Klementz-Harte, Lauren (ILT)",
        "Description": "How many feathers will it take?  The Little Angel of Freedom can't wait till her wings are full of feathers. Then she'll hear a bell ring, and be able to fly. But to prove she's ready, she has to help out Simone, a little girl with a big problem.  Simone likes to capture animals -- especially bugs. Sometimes they get harmed while they're in her care. The Little Angel has to use her powers to show Simone the right thing to do. But Little Angel's worried -- how will she rescue the captured animals? And will she ever get enough feathers to earn her Angelwings at last?  Be kind to animals!",
        "Category": " Juvenile Fiction , Love & Romance",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "How to Save the Catholic Church",
        "Authors": "By Greeley, Andrew M. and Durkin, Mary G.",
        "Description": "Offers recommendations for a renewal of the Catholic Church in America, addressing issues of worship, parish life, the arts, family life, and sexuality",
        "Category": " Religion , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Raising Confident Boys: 100 Tips For Parents And Teachers",
        "Authors": "By Hartley-Brewer, Elizabeth",
        "Description": "Boys need to be noticed, admired, understood, and accepted to feel good about themselves. Boys who lack appropriate emotional support from the adults close to them are at risk of believing they don't fit in and are likely to act accordingly, engaging in risky behaviors-including at worst using drugs and acting out violently. Raising Confident Boys teaches readers what makes boys prone to low self-esteem and provides practical, effective tips for managing these situations as they arise.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "On Rice: 60 Fast and Easy Toppings That Make the Meal",
        "Authors": "By Frankeny, Frankie (PHT) and Rodgers, Rick",
        "Description": "In On Rice, Rick Rodgers shows how to broaden your dinner repertoire with more than sixty delicious, quick-and-easy toppings to serve over that favorite grain, rice. This innovative volume offers an international array of delectable sauces, stews, and stir-fries, most of which can be prepared in less than half an hour - while the rice is cooking.From the simple and beloved to the exotic and creative, these rice dishes are as perfect for entertaining as they are for everyday meals. Illustrated with tempting photographs, On Rice offers an inspiring selection of tasty seafood, meat, and vegetarian toppings for simple one-dish meals.With a guide to the different methods of preparing rice and an overview of the array of rices (and a selection of other grains) now available - from the familiar white and brown to the exciting basmati, black, arborio, and Valencia varieties - this enticing volume proves that everything is nice on rice.",
        "Category": " Cooking , Specific Ingredients , Rice & Grains",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Are You Sugar Sensitive? Potatoes Not Prozac",
        "Authors": "By Kathleen DesMaisons",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "It Ain't Over 'Til the Fat Lady Sings",
        "Authors": "By Peretz Howard",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Florence King Reader",
        "Authors": "By King, Florence",
        "Description": "A collection of writings by the humorist author of Confessions of a Failed Southern Lady features excerpts from each of her books; a complete novel, When Sisterhood Was in Flower; noted columns and book reviews; essays on modern life; and a selection from The Barbarian Princess. Reprint.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "How Do We Know When It's God?: A Spiritual Memoir",
        "Authors": "By Wakefield, Dan",
        "Description": "Told in clear and concise prose, the author discusses the pros and cons of modern spirituality, addresses the continual issues that challenge his faith, and offers spiritual guidance and inspiration. 35,000 first printing.",
        "Category": " Religion , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    }
]