[
    {
        "Title": "Sun and Shadow: An Erik Winter Novel (A Chief Inspector Erik Winter Novel)",
        "Authors": "By Edwardson, Ake and Thompson, Laurie (TRN)",
        "Description": "Like his fellow countryman Henning Mankell, åke Edwardson is a successful figure on the international mystery scene and a brilliant discovery for lovers of intricate, psychologically charged, and stylish crime novels. With Sun and Shadow, Edwardson introduces readers to detective Erik Winter, the youngest chief inspector in Sweden, who wears sharp suits, cooks gourmet meals, has a penchant for jazz, and is about to become a father. He's also moody and intuitive, his mind inhabiting the crimes he's trying to solve. In this atmospheric, heart-stopping tale, Winter's troubles abound—and a bloody double murder on his doorstep is just the beginning.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Flame (The Sons of Destiny, Book 7)",
        "Authors": "By Johnson, Jean",
        "Description": "Seventh in the hot series from the national bestselling author that Jayne Anne Krentz hails as ?fabulously fresh.? Eight brothers, born in four sets of twins, two years apart to the day?they fulfill the Curse of Eight Prophecy. Though no longer trapped in exile, their growing family faces new problems. Now that it?s his turn to look for a bride, Koranen, the seventh-born brother, cursed with a flame that courses beneath his flesh, must find a woman able to endure the literal heat of his passion. Then Danau the Aquamancer arrives, and as everyone knows, fire and water create steam.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "The Only Good Lawyer (John Francis Cuddy Mystery)",
        "Authors": "By Healy, Jeremiah F.",
        "Description": "With the help of his irrepressible hero, John Francis Cuddy, Jeremiah Healy never fails to deliver scintillating, perfectly pitched mystery masterpieces in what The New York Times Book Review calls \"a superior series.\" Now the Shamus Award-winning author \"looks ready to join the honors class of private-eye writers that includes Robert B. Parker\" (USA Today), as he introduces us to The Only Good Lawyer.   An attorney friend of Boston P.l. John Cuddy has called in a favor, looking into the case of Alan Spaeth. Spaeth is one sorry piece of work -- a down-and-out divorce squeeze, a racist, a misogynist, and from all appearances, a cold-blooded killer. Frankly wishing the whole mess would disappear, Cuddy can't let it. It pains him, but he's convinced of Spaeth's innocence, and he isn't the kind of P.l. who can watch even a guy like Spaeth fry for someone else's crime.   As much as Cuddy is repulsed by the accused, he's intrigued by the victim, Woodrow Wilson Gant, the African-American lawyer who had been representing Spaeth's wife in a very nasty divorce. But before Cuddy's investigation is done, there will be plenty of nastiness to go around. On the surface, Gant led a charmed and successful life as a rising star in the glittering firmament of Massachusetts law. But three quick bullets at a deserted roadside knocked Gant out of the Boston skyline for good, and now Cuddy's discovered the attorney was also a man of strange desires and deep secrets?secrets that could prove lethal to the touch....   Ricocheting from Gant's law offices, Cuddy picks up the trail of a woman who fled the scene of the murder. Rousted by a couple of loan sharks and conned by Gant's avaricious brother, Cuddy stumbles on a more personal question. The mere mention of Gant's name puts a cold, hard kink in his relationship with Assistant D.A. Nancy Meagher, and Cuddy's Iosing sleep wondering why.   Greed. Revenge. Jealousy. There is any number of motives for murder, and Cuddy can take his pick as he investigates the high-profile homicide of Woodrow Wilson Gant, exploring the raw passion -- and touching every nerve -- of the edge.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Parenting With Fire: Lighting Up the Family with Passion and Inspiration",
        "Authors": "By Boteach, Shmuel",
        "Description": "A unique parenting manifesto from one of America's most provocative personalities.  According to Shmuley Boteach, author of Kosher Sex and host of TLC's Shalom in the Home, transmitting passions, motivating children with shared goals, and getting them excited about values are the most important things any parent can do. With great humor and insight, Boteach shows parents how to take their child to life's mountaintop-and create a parent-child bond based on vitality, exuberance, and mutual respect.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "NAL Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Before You Take that Pill: Why the Drug Industry May Be Bad for Your Health",
        "Authors": "By Bremner, J. Douglas, M.D.",
        "Description": "A medical expert reveals risks of the most commonly prescribed drugs-and why the drug industry doesn't want consumers to know about them.Recent scandals involving diabetes drugs, Vioxx, and many other medications reveal the serious and undisclosed risks of some of the most commonly used prescription drugs in this country. InBefore You Take That Pill, Dr. J. Douglas Bremner, a researcher and clinician at Emory University whose study on Accutane and depression made headlines, offers an inside look at the pharmaceutical industry, as well as a scientifically backed assessment of the risks of more than three hundred prescribed medications, vitamins, and supplements.While many drugs are essential to the health of consumers, as Dr. Bremner explains, for many people, the benefits may not outweigh the potential side effects. This book contains warnings that are not on the drug labels. It also exposes tricks of the trade that demonstrate how the profit-making interests of \"big pharma\" may not always be in line with the safety of the public - from the corruption that exists in the drug approval process to the tactics drug companies use to encourage doctors to prescribe their products. Most important, Before You Take That Pill empowers readers by giving them sound information on specific medications so they can understand and weigh the potential risk themselves. Backed by the latest studies, as well as insight from a doctor who is in the trenches, this book should be on the shelf of every drug consumer.",
        "Category": " Health & Fitness , Safety",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Travels With Barley: The Quest for the Perfect Beer Joint",
        "Authors": "By Wells, Ken",
        "Description": "Pulitzer Prize finalist and former Wall Street Journal writer Ken Wells set out on America's mighty River of Beer (aka the Mississippi) in a quest for his own Oz: the mythical Perfect Beer Joint. Along the way he samples great beer with the Heartland's raconteurs, probes Elvis's beer-drinking habits, drops in on brewers and hopheads, tours the World's Largest Six-Pack and a bar once owned by Al Capone, and visits an Extreme Beer Maker whose dream is 50-proof brew. This is a vision of America that readers have never seen before- through the frosty prism of a beer glass.",
        "Category": " Business & Economics , Industries , Hospitality, Travel & Tourism",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Missing (The FBI Psychics)",
        "Authors": "By Walker, Shiloh",
        "Description": "From the national bestselling author whose sexy stories ?you will not soon forget?(Romance Review) comes a brand-new, sinfully sexy romantic suspense novel. Her psychic gift drove away the man she loved? and years later has drawn him back to her? As a teenager, Taige Branch hated her psychic gift. No one could understand?except for Cullen Morgan, the boy who stole her heart. He did his best to accept her, until his mother was brutally murdered?and he couldn?t forgive Taige for not preventing it. Now a widowed father, Cullen Morgan has never forgotten Taige. But what brings her back into his life is another tragedy. His beloved little girl has been kidnapped, and Taige is his only hope of finding her. Working together against the clock, Cullen and Taige can?t help but wonder whether?if they find his daughter in time?it isn?t too late for the overpowering love that still burns between them?",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Introduction to Social Problems",
        "Authors": "By Sullivan, Thomas J. and Thompson, Kenrick S.",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "A Blessing in Disguise: 39 Life Lessons from Today's Greatest Teachers",
        "Authors": "By Cohen, Andrea Joy, M.d. and Nhat Hanh, Thich (FRW)",
        "Description": "Cohen, a cancer researcher and poet, collects essays and personal stories on overcoming challenges, soul expression, death and dying, life's everyday lessons, spirituality, and relationships. \"Today's greatest teachers\" range from Buddhist Monk Thich Nhat Hanh, to Martha Beck, an \"innovator in life design\" and monthly columnist at O, The Oprah Magazine. In between are experts in integrative and preventive medicine, clinical psychologists and social workers, and a visionary who writes poetry about organizational change. Cohen is founder of the Complementary and Alternative Medicine Research Program in Cancer at the University of Colorado Health Sciences Center. Annotation ©2008 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Sunshine",
        "Authors": "By McKinley, Robin",
        "Description": "From  award-winning and national bestselling author, Robin McKinley,  comes  this dark, sensual vampire fairy tale. \"A gripping, funny,  page-turning,  pretty much perfect work of magical literature.\"--Neil  Gaiman“Sunshine”   is what everyone calls her.  She works long hours in her family’s   coffeehouse, making her famous “Cinnamon Rolls as Big as Your Head,”   Bitter Chocolate Death, Caramel Cataclysm, and other sugar-shock   specials that keep the customers coming.  She’s happy in her   bakery—which her stepfather built specially for her—but sometimes she   feels that she should have life outside the coffeehouse. One evening   she drives out to the lake to get away from her family, to be alone.    There hasn’t been any trouble at the lake for years.  But there   is trouble that night for Sunshine.  She is abducted by a gang of   vampires who shackle her to the wall of an abandoned mansion, within   easy reach of a figure stirring in the moonlight.  Sunshine knows that   he is a vampire and that she is to be his dinner.  Yet when dawn breaks   he has not attempted to harm her.And now he needs her help to survive the day...",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Don't Look Now",
        "Authors": "By Miller, Linda Lael",
        "Description": "Defense attorney Clare Westbrook functions very well in crisis mode -- whether taking the media rap for an explosive case or bargaining with her teenaged niece, whom Clare is raising. But a shocking crime -- the murder of her notoriously unethical boss -- is about to test her heart and soul: heading the homicide investigation is irresistibly sexy detective Tony Sonterra. Now, a passion that is as risky as it is addictive pulls Clare into the crosshairs of a deadly mystery from the past. As the truth closes in and it becomes clear someone's targeting her, Clare and Tony embark on a twisting chase in the Arizona heat, where their dangerous desire sparks a determined hunt for a killer.",
        "Category": " Fiction , General",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Lucy Gets Her Life Back",
        "Authors": "By Holm, Stef Ann",
        "Description": "Red Duck, Idaho, may be just a speck on the map, but it's perfect for a hardworking single mom looking for a good place to start over. Arriving with recipes, ambition, a silent prayer and two teenage boys, Lucy Carpenter is ready to cook her way into the hearts and wallets of celebrities who frequent the nearby ski resort and watering holes.But she needs somebody to put the word out—and that somebody is Drew Tolman, former pro baseball player turned local big shot. She's heard the rumors—scandal, women and more—but he's the man Lucy needs on her side. It takes a little effort and a lot of decadence—in the kitchen—but word of Lucy's culinary talents spreads like melting chocolate.Soon everyone's got Lucy's number, but her best caller is Drew. He's eager to convince the deliciously tempting Lucy that she's the dessert he's been saving room for&#133;.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "More Than It Hurts You",
        "Authors": "By Strauss, Darin",
        "Description": "Josh Goldin was savoring a Friday afternoon break in the coffee room, harmlessly flirting with co-workers while anticipating the weekend at home where his wife, Dori, waited with their eight-month-old son, Zack. And then Josh's secretary rushed in, using words like intensive care, lost consciousness, blood.That morning, Dori had walked into the emergency room with her son in severe distress. Enter Dr. Darlene Stokes, an African American physician and single mother whose life is dedicated both to her own son and navigating the tricky maze of modern-day medicine. But something about Dori stirred the doctor's suspicions. Darlene had heard of the sensational diagnosis of Munchausen by proxy, where a mother intentionally harms her baby, but she had never come upon a case of it before. It's rarely diagnosed and extraordinarily controversial. Could it possibly have happened?When these lives intersect with dramatic consequences, Darlene, Dori, and Josh are pushed to their breaking points as they confront the nightmare that has become their new reality. Darin Strauss's novel is set in a world turned upside down - where doctors try to save babies from their parents, police use the law to tear a family apart, and the people you know the best end up surprising you the most.",
        "Category": " Fiction , Literary",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Smitten",
        "Authors": "By Evanovich, Janet",
        "Description": "Single mom Lizabeth Kane isn't exactly carpenter material -- she's never picked up a hammer in her life. But she desperately needs the construction job that builder Matt Hallahan is offering. And even though he knows trouble is ahead, Matt can't refuse Lizbeth's irresistible smile.Matt Hallahan isn't exactly relationship material -- he has always been too busy working on other people's houses to make a home of his own. And even though she knows better, Lizabeth can't stop thinking about the rugged carpenter.Is the relationship Matt and Lizabeth are building solid -- or more like a house of cards?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Country Brides: A Little Bit Country",
        "Authors": "By Macomber, Debbie",
        "Description": "Rorie Campbell has a pleasant, predictable life in San Francisco,where she's seeing a pleasant, predictable man. Then, one vacation,her car breaks down on an Oregon country road and horse rancherClay Franklin comes to her rescue. Rorie soon discovers that a citygirl can fall in love with a country man. But Clay has no right toreturn her feelings—because he's engaged to another woman.Kate Logan is devastated when Clay Franklin, her former fiancéand the man she's always loved, marries Rorie Campbell instead.But at Clay's wedding—and after a glass of champagne too many—Kate proposes to her longtime friend, rancher Luke Rivers. Lukeaccepts her proposal—and refuses to renege on his promise. What'smore, he insists that Kate doesn't love Clay—she loves him—.",
        "Category": " Fiction , Romance , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Last Boleyn: A Novel",
        "Authors": "By Harper, Karen",
        "Description": "She survived her own innocence, and the treachery of Europe’s royal courts; The Last   Boleyn is the story of the rise and fall of the Boleyns, one of England’s most   powerful families, through the eyes of the eldest daughter, Mary. Although her sister,   Anne, the queen; her brother, George, executed alongside Anne; and her father, Thomas,   are most remembered by history, Mary was the Boleyn who set into motion the chain   of events that brought about the family’s meteoric rise to power, as well as the   one who managed to escape their equally remarkable fall. Sent away to France at an   extraordinarily young age, Mary is quickly plunged into the dangerous world of court   politics, where everything is beautiful but deceptive, and everyone she meets is   watching and quietly manipulating the events and people around them. As she grows   into a woman, Mary must navigate both the dangerous waters ruled by two kings and   the powerful will of her own family in order to find a place for herself and the   love she so deeply desires.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Mark of the Lion: A Jade Del Cameron Mystery",
        "Authors": "By Arruda, Suzanne",
        "Description": "After driving an ambulance along the front lines of World War I, she can fire a rifle with deadly precision. Still suffering trauma from the Great War, she sets off for Africa determined to fulfill a man's dying wish...never expecting to become involved in murder.Rich with romance, mystery, and adventure, Mark of the Lion introduces a fascinating new heroine and explores the elusive heart of a compelling and exotic world.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Louise Nevelson: A Passionate Life",
        "Authors": "By Lisle, Laurie",
        "Description": "",
        "Category": " Biography & Autobiography , Artists, Architects, Photographers",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Dave Barry's History of the Millennium (So Far)",
        "Authors": "By Barry, Dave",
        "Description": "A brilliantly funny look at the tumultuous recent past from the Pulitzer Prize?winning humorist. Remember when everything was going to go to hell when Y2K struck? That didn?t happen. Right? But what did happen? To provide a little perspective on a really messed-up millennium (so far), the one and only Dave Barry slips into his historian?s robe (it?s plush terrycloth) and revisits the defining moments in our country?s recent history?from the Bush years to?jeez, it?s still the Bush years! As an added bonus, Barry quickly?we?re busy here?tosses in the complete history of the last millennium, covering crucial turning points such as the invention of the pizza by Leonardo da Vinci and the computer by Charles Babbage (who died in 1871 still waiting to talk to tech support). Fellow Americans, the time has come to bone up with Barry as he puts the hysterical in history.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Plain Jane: A Novel of Jane Seymour (Tudor Women Series)",
        "Authors": "By Gardner, Laurien",
        "Description": "Continuing the story of Henry VIII?s wives?from the author of The Spanish Bride and A Lady Raised High. With a face better suited to a nun?s habit than a wedding dress, Jane Seymour has no suitors and few hopes. Then, her prospects brighten when she is granted a position at court as maid of honor to Queen Catherine. There, Jane watches as King Henry VIII ignores his aging wife, showering favor on the beautiful Anne Boleyn, the woman he would make his new queen. But soon he tires of Anne and his wandering eye falls on Jane. Though she has feelings of affection for Henry, she cannot let herself be swept away by his attentions if she is to win not only his heart, but also the greatest prize of all?the Crown.",
        "Category": " Fiction , Biographical",
        "Publisher": "Berkley",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Under Enemy Colors (The Adventures of Charles Hayden)",
        "Authors": "By Russell, S. Thomas",
        "Description": "Born to an English father and a French mother, lieutenant Charles Saunders Hayden?s career is damned by his ?mixed? heritage. Assigned to the HMS Themis, an aging frigate under the command of a captain reviled by his crew for both his brutality towards his men and his cowardice in battle, Hayden is torn between honor and duty, as the British navy engages the French in a centuries-old struggle for power.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Fugitive Nights: A Novel",
        "Authors": "By Wambaugh, Joseph",
        "Description": "Playground for the rich, arena for the powerful, graveyard for the unlucky—welcome to Palm Springs!   For some, it’s the pleasure capital of the world. For other, it’s a city of last chances, a paradise on the edge of the desert. For soon-to-be-ex-cop Lynn Cutter, sweating out a disability pension, it could become a point of no return.   As a rule, Cutter wouldn’t give a private investigator the time of day, but Breda Burrows is the exception to every rule. Sultry, blue-eyed, long-legged, and tough as nails, Breda can be very convincing, and she’s convinced Cutter to be her guide through the glittering netherworld of Palm Springs—an explosive mix of silicone, Geritol, old money, and murder.   The trail begins with the monied socialite wife of a philandering husband. The wife doesn’t care about her husband’s infidelity, but she does want to know why he’s made a secret deposit—at a sperm bank. What Cutter wants to know is the identity of the strange, violent man hubby is meeting in the desert—a man known only as the fugitive.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "From Binge to Blackout: A Mother and Son Struggle with Teen Drinking",
        "Authors": "By Volkmann, Chris and Volkmann, Toren",
        "Description": "Throughout his college years, Toren Volkmann partied like there was no tomorrow, having what was supposed to be the time of his life. Like so many parents, his mother, Chris, overlooked Toren’s growing alcohol problem. But when he graduated, Toren realized he’d become a full-blown alcoholic. And he was not alone.Considered a rite of passage, teenage drinking has skyrocketed to epidemic proportions, fostering a generation of young adults whose lives are already beginning to come apart under the strain. This book, written from the viewpoints of both mother and son, is a riveting, enlightening, and heartbreakingly true story of a family that was able to confront the fear, pain, and denial that threatened to destroy them—and survive the epidemic of teenage drinking that’s putting America’s future at risk.",
        "Category": " Psychology , Developmental , Adolescent",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Lumby Lines",
        "Authors": "By Fraser, Gail",
        "Description": "Nestled in the Northwest is a quaint little town that its quirky residents are proud to call home. With charming shops lining its one main thoroughfare, Lumby is home to the oldest apple tree in the county and the smallest bank in the state. And though it's hours from the nearest big city, readers will always find Lumby close to their hearts. When Mark and Pam Walker, a vacationing couple from the East Coast, decide to restore Lumby's ramshackle Montis Abbey and turn it into an inn, it takes a while for the locals to warm up to them. Especially the irascible William Beezer, owner of The Lumby Lines-the newspaper \"worth the paper it's printed on.\" At every turn, he tries to hinder the Walkers' efforts. But the couple soon learns that for every citizen like William, there are many more willing to lend a hand-and that Lumby isn't just a place, it's a way of life.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Essential Dalai Lama: His Important Teachings",
        "Authors": "By Mehrotra, Rajiv (EDT)",
        "Description": "An invaluable collection that brings together the best of the Dalai Lama's writings on all aspects of life  An inspiration to millions of people worldwide, the Dalai Lama has authored more than fifty books. Now, for the first time, The Essential Dalai Lama brings together the best of the Dalai Lama's writings on all aspects of life, from work to meditation. Divided into four sections-The Vision, Buddhist Perspectives, Practice, A World in Harmony-The Essential Dalai Lama contains eloquent applications of the principles of ancient Buddhist thought to contemporary issues, all expressed in the Dalai Lama's uniquely compelling voice. This is the perfect compilation for anyone who wishes to have one source for the Dalai Lama's teachings or who seeks an introduction to the philosophy and practice of Buddhism.",
        "Category": " Religion , Buddhism , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Hydrogen Economy: The Creation of the Worldwide Energy Web and the Redistribution of Power on Earth",
        "Authors": "By Rifkin, Jeremy",
        "Description": "The road to global security,\" writes Jeremy Rifkin, \"lies in lessening our dependence on Middle East oil and making sure that all people on Earth have access to the energy they need to sustain life. Weaning the world off oil and turning it toward hydrogen is a promissory note for a safer world.\"  Rifkin's international bestseller The Hydrogen Economy presents the clearest, most comprehensive case for moving ourselves away from the destructive and waning years of the oil era toward a new kind of energy regime. Hydrogen-one of the most abundant substances in the universe-holds the key, Rifkin argues, to a cleaner, safer, and more sustainable world.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "5-Factor Fitness: The Diet and Fitness Secret of Hollywood's A-List",
        "Authors": "By Pasternak, Harley and Boldt, Ethan",
        "Description": "Harley Pasternak, M.Sc., holds an MS in exercise physiology and nutritional sciences from the University of Toronto, and an honors degree in kinesiology from the University of Western Ontario. He is certified by the American College of Sports Medicine and the Canadian Society of Exercise Physiology. His work has been profiled in such national publications as Redbook, Glamour, Fitness and Men's Health, and he has appeared on The Oprah Winfrey Show and other TV programs. Pasternak, a native of Canada, lives and works in Los Angeles.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Talking to Depression: Simple Ways To Connect When Someone In Your Life Is Depressed: Simple Ways To Connect When Someone In Your Life Is Depressed",
        "Authors": "By Strauss, Claudia J. and Manning, Martha (FRW)",
        "Description": "When someone suffers from depression, friends and family members naturally want to help—but too often their good intentions come out all wrong. This practical, compassionate guide helps readers understand exactly what their loved one is going through, and why certain approaches help and others have the potential to do damage. Talking to Depression offers specific advice on what to do and what not to do—and what to say and what not to say—to avoid frustration and give the kind of caring, effective support that will make a difference.",
        "Category": " Psychology , Emotions",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "When Enough is Enough: A Comprehensive Guide to Successful Intervention",
        "Authors": "By Finnigan, Candy and Finnigan, Sean",
        "Description": "Read Candy Finnigan's posts on the Penguin Blog.From a nationally recognized addiction specialist featured on the A&E series Intervention, a comprehensive and compassionate guide to confronting a loved one with an addiction.  What do you do when someone you care about is caught in the downward spiral of addiction? The goal of an intervention is to get the person who is addicted to alcohol, to drugs, to gambling, to sex, to what have you to seek treatment-to seek treatment today. And it is remarkably effective: over 80 percent of people faced with an intervention agree to get help. In When Enough Is Enough, Candy Finnigan offers support, advice, and hope to people who care about someone with an addiction. She acknowledges that although intervention is a powerful tool, it is a complicated process-one that absolutely must be done right.  This kind of confrontation must be highly structured, and Finnigan-a veteran of hundreds of interventions-provides a frank but sympathetic guide to preparing for and staging an intervention. By talking readers through the personal, medical, psychiatric, financial, and legal issues involved, she turns what seems like a chaotic and overwhelming task into a manageable and empowering experience.",
        "Category": " Self-help , Substance Abuse & Addictions , Alcohol",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Life Laughs: The Naked Truth about Motherhood, Marriage, and Moving On",
        "Authors": "By McCarthy, Jenny",
        "Description": "Jenny McCarthy, New York Times bestselling author of Baby Laughs and Belly Laughs, speaks candidly about the challenges and the humor to be found in balancing motherhood and the ups and downs of marriage.  Jenny McCarthy&#146;s honesty has made her a bestseller.  In Life Laughs, Jenny opens up about all of the things no one told you before you got married and had kids.  Of course there&#146;s plenty of Jenny&#146;s outrageous humor, but she also writes openly and for the first time about doing your best when marriage falters and about her own divorce, which made headlines when it was announced in the summer of 2005.  Jenny doesn&#146;t pretend to be an expert in her books; she is instead something more valuable&#151;a good girlfriend.  Catch Jenny&#146;s take on growing older, finances, PMS, sex, dating . . . and again, mommyhood.  Jenny McCarthy is a trusted, brand-name, bestselling author, and Life Laughs is poised to be her biggest book yet.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Destiny",
        "Authors": "By Parks, Tim",
        "Description": "Christopher Burton is one of Britain's foremost foreign correspondents, the acknowledged world expert on Italian affairs. Three months after returning to London with his Italian wife for an extended stay, Burton, while standing at the reception desk of the Rembrandt Hotel in London's Knightsbridge, receives a phone call informing him that his teenage son has committed suicide. Why, upon receiving this terrible news, does he immediately conclude that his marriage of almost thirty years is over? And why is grief so slow in coming? Burton feels his pious, mercurial wife may have given him his life in Italy - even his prestigious career - but she has also made it impossible.Was their troubled son somehow the victim of their long, explosive love-hate relationship? Looking back, Burton sees in his life a web of contradictions, unanswered questions, and confusions. And yet, it has been his destiny.",
        "Category": " Fiction , Literary",
        "Publisher": "Arcade Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Icebound",
        "Authors": "By Koontz, Dean R.",
        "Description": "A secret Arctic experiment turns into a frozen nightmare when a team of scientists, stranded on a drifting iceberg with a massive explosive charge, battle the elements for survival, only to discover that one of them is a murderer. Original.",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "211 Things a Bright Boy Can Do",
        "Authors": "By Cutler, Tom",
        "Description": "For everyone who loved The Dangerous Book for Boys-an oddly useful and hilarious handbook for the mischievous child in all of us. If you've reached adulthood without knowing how to spin a rope like a cowboy, cure a hangover, or make a citizen's arrest, this is the book you've been waiting for. Funny, far-ranging, and surprisingly handy, the book presents tutorials, including: - How to Be a Real Man: mow the perfect lawn; defend yourself with nothing but an umbrella - Bracing Outdoor Activities: skate backwards; make a boomerang come back; snare wild game - Amusing Diversions: float an egg; eat a goldfish; master fiendish tongue-twisters; judge a woman's bra size at a glance Also includes: - Sumo wrestling for beginners - Four diversions with a banana - And much more",
        "Category": " Reference , General",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "7.24",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Violet on the Runway",
        "Authors": "By Walker, Melissa",
        "Description": "A wallflower in the spotlight can do one of two things: wilt, or blossom... Violet Greenfield's life changes forever when a lady in giant Chanel shades tells her she could be IT, the next Kate Moss-but taller, and without the PR problems. That's how Violet winds up with a business card in the front pocket of her jeans on her first day as a senior in high school. Angela Blythe from Tryst Models in New York City wants to put Violet on a plane and whisk her into the world of high-heeled boots and oversized sunglasses. Tall, skinny Violet, who's been P-L-A-I-N practically forever. And guess what? She's going.    Look out for Violet by Design, coming in March 2008 from Berkley Jam.",
        "Category": " Young Adult Fiction , Social Themes , Friendship",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Book of Useless Information",
        "Authors": "By Botham, Noel",
        "Description": "What you may so cavalierly call useless information could prove invaluable to someone else. Then again, maybe not. But to The Useless Information Society, any fact that passes its gasp-inducing, not-a-lot-of-people-know-that test merits inclusion in this fascinating but ultimately useless book... Did you know (or do you care)...• That fish scales are used to make lipstick?• Why organized crime accounts for ten percent of the United States’s annual income?• The name of the first CD pressed in the United States?• The last year that can be written upside-down or right side-up and appear the same?• The shortest performance ever nominated for an Oscar®?• How much Elvis weighed at the time of his death?• What the suits in a deck of cards represent?• How many Quarter Pounders can be made from one cow?• How interesting useless information can be?The Book of Useless Information answers these teasers and is packed with facts and figures that will captivate you—and anyone who shares your joy in the pursuit of pointless knowledge.",
        "Category": " Reference , Trivia",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "While America Aged: How Pension Debts Ruined General Motors, Stopped the NYC Subways, Bankrupted San Diego, and Loom as the Next Financial Crisis",
        "Authors": "By Lowenstein, Roger",
        "Description": "While America Aged illuminates the scope of the problem we’re facing, and warns that the worst is yet to come. With the narrative flair and talent for decoding financial ambiguities that readers have come to rely on, Lowenstein brilliantly chronicles three fascinating pension cases: the collapse of the over-obligated General Motors, the pension strike that halted New York City’s subways and effectively shut down the city, and the scandalous bankrupting of the affluent corner of Southern California, the city of San Diego. Not only compelling historical sagas rich with detail and unforgettable characters, each story also acts as an object lesson. Lowenstein warns that these pension wars are only the beginning of the retirement and healthcare crisis we will face if we don’t find ways to address this latest moral hazard. Governments and corporations across the country used pensions as a seemingly easy way to curry favor with unions (easy because the expense would be deferred until a later generation). But now, with cumulative retirement deficits approaching $1 trillion, the day of reckoning has arrived.       Is there a way out? Lowenstein recognizes that fixing pensions will be difficult but securing retirement is a critical issue?especially in our rapidly aging country?and he proposes a cogent solution to the impending crisis. Masterfully written and convincingly argued, While America Aged is a timely and crucial wake-up call to a pension damaged America.",
        "Category": " Law , Pension Law",
        "Publisher": "Penguin Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Past Imperfect (Daw Book Collectors)",
        "Authors": "By Greenberg, Martin Harry (EDT) and Segriff, Larry (EDT)",
        "Description": "Some of science fiction's finest authors explore the themes of time travel, time paradoxes, and alternate universes in an anthology of original short fiction by Kristine Kathryn Rusch, Diane Duane, Dean Wesley Smith, James P. Hogan, Jane Lindskold, Jody Lynn Nye, and others. Original.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "DAW",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Stealing Buddha's Dinner: A Memoir",
        "Authors": "By Nguyen, Bich Minh",
        "Description": "A coming-of-age memoir by a Vietnamese American recounts her struggles for an American identity in the pre-politically correct climate of the Midwest and her passion for American food in the face of her family's Buddhist lifestyle.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "The Saffron Kitchen",
        "Authors": "By Crowther, Yasmin",
        "Description": "On a blustery day in London, the dark secrets and troubled past of Maryam Mazar surface violently, with tragic consequences for her daughter, Sara, and her newly orphaned nephew Saeed. Consumed with guilt, Maryam leaves the safe comfort of her suburban home and mild English husband to return to Mazareh, the remote village on Iran's northeast border where her own story began. There she must face her past and the memories of a life she was forced to leave behind, in the days when she was young, headstrong, and beautiful.Back in England, Sara, who has never felt a strong tie to Maryam's birthplace, tries to understand what could have compelled her mother to leave. Together with Saeed and her distraught father, she begins to unearth Maryam's story from amid her memories of opium poppies, family lore and fragments of conversation, photographs and a few lines of poetry. In her quest to piece their life back together, Sara follows her mother to Iran to discover the roots of her unhappiness and to try to bring her home. Far from the streets of London, in a land of minarets, among the snow-capped mountains and dusty plains that have haunted her mother's dreams for half a century, Sara finally learns the terrible price Maryam once had to pay for her freedom, and of the love she left behind.",
        "Category": " Fiction , Literary",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Red: Teenage Girls in America Write On What Fires Up Their LivesToday",
        "Authors": "By Goldwasser, Amy (EDT)",
        "Description": "?Unsparingly frank and perceptive? (Vanity Fair) personal essays by teenage girls. For every teen girl who thinks she?s alone, and every adult who?s dared to try to figure her out, comes this eye-opening collection in the spirit of New York Times bestseller Ophelia Speaks. In Red, fifty-eight girls?ranging in age from thirteen to nineteen, and writing from across the spectrum of geographic, socioeconomic, racial, and religious upbringings?share ?heartbreaking, hilarious, and often harrowing? (Francine Prose) essays about everything from politics to pop culture; from post-Katrina New Orleans to Johnny Depp; from the loneliness of losing a best friend to the loathing or pride they feel about their bodies. The authors of Red are brave and honest documentarians of their own lives. These girls are the best shades of red (not pink): a little bit angry, a lot passionate. They?re on fire, and their essays speak gloriously for the future.",
        "Category": " Literary Collections , Essays",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Harmful Intent (A Medical Thriller)",
        "Authors": "By Cook, Robin",
        "Description": "It should have been a routine childbirth.  But somehow, the mother died in the delivery, the baby was born brain-damaged, and Jeffrey Rhodes, the anesthesiologist, is running for his life.  Charged with malpractice, he is found guilty of harmful intent and reckless disregard for human life.  To clear his name, Rhodes must follow a fugitive trail into the heart of medical nightmare.  A trail that, for some, may end in suicide--and for others, in the  most shocking conspiracy of our time...",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "The Flame and the Shadow",
        "Authors": "By Rossetti, Denise",
        "Description": "A mercenary is hired to kidnap a fire witch in this brilliant, magical novel of erotic passion. For fans of Laurel K. Hamilton and Shana Abé...Some are drawn to the light. Some are drawn to the dark. Some desire bothGrayson of Concordia, known on countless worlds as the Duke of Ombra, is a mercenary, a sorcerer of shadowsa man whose soul is consumed by darkness. For Gray, the bleak savagery in his heart is manifest in an entity he calls Shad. He has long resisted Shad's enticements, but when he is hired to kidnap a fire witch, he seizes the chance to restore his soulno matter the cost.Cenda’s heart is ash. Devastated by a shattering loss, life has lost all meaning for the fire witch. Slowly, she has worked to master her powers and go on living. But when she encounters Gray, her will is no match for her desire. But her love may not survive the terrible discovery of Gray's betrayalSparkles with excitement! An inventive tale of magic and erotic adventure.”New York Times Bestselling Author Shana Abé",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Ace",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Closing the Leadership Gap: Add Women, Change Everything",
        "Authors": "By Wilson, Marie C.",
        "Description": "The defining examination of the new role of women in America?now fully revised When first published in 2004, Marie Wilson?s Closing the Leadership Gap finally drew attention to what everyone knew but no one talked about?the lack of women in America?s leadership positions, even though compelling research shows that women enhance the top decision-making process dramatically. And yet, even as our nation sits on a world spinning with crises, we have barely begun to tap that most critical natural resource. With the possibility of America?s first woman president looming large, now is the time to revisit this inspiring call to action.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "The Iliad (Signet Classics)",
        "Authors": "By Homer and Rouse, W. H. D. (TRN)",
        "Description": "The triumphs and tragedies, heroes and exploits, gods and warriors on both sides of the Trojan War come alive in a translation of Homer's great epic poem. Reprint.",
        "Category": " Fiction , Classics",
        "Publisher": "Pearson",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Literally, the Best Language Book Ever: Annoying Words and Abused Phrases You Should Never Use Again",
        "Authors": "By Yeager, Paul",
        "Description": "By turns gleefully precise and happily contrarian, this is a highly opinionated guide to better communication. In Literally, the Best Language Book Ever, author Paul Yeager attacks with a linguistic scalpel the illogical expressions and misappropriated meanings that are so commonplace and annoying. Identifying hundreds of common language miscues, Yeager provides an astute look at the world of words and how we abuse them every day. For the grammar snobs looking for any port in a storm of subpar syntax, or the self-confessed rubes seeking a helping hand, this witty guide can transform even the least literate into the epitome of eloquence.",
        "Category": " Language Arts & Disciplines , Style Manuals",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Long Road Home: A Story of War and Family",
        "Authors": "By Raddatz, Martha",
        "Description": "NOW A NATIONAL GEOGRAPHIC MINISERIES EVENTABC News’ Chief Global Affairs Correspondent Martha Raddatz shares remarkable tales of heroism, hope, and heartbreak in her account of “Black Sunday”—a battle during one of the deadliest periods of the Iraq War.The First Cavalry Division came under surprise attack in Sadr City on Sunday April 4, 2004. Over 7,000 miles away, their families awaited the news for forty-eight hellish hours—expecting the worst. In this powerful, unflinching account, Martha Raddatz takes readers from the streets of Baghdad to the home front and tells the story of that horrific day through the eyes of the courageous American men and women who lived it.“A masterpiece of literary nonfiction that rivals any war-related classic that has preceded it.”—The Washington Post",
        "Category": " History , Military , Iraq War (2003-2011)",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Come to Think of It: Notes on the Turn of the Millennium",
        "Authors": "By Schorr, Daniel",
        "Description": "A volume of unstinting political observations by an analyst for NPR's All Things Considered and Weekend Edition covers such topics as the war in Iraq, health care, and the U.N. report on climate change.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "The Session",
        "Authors": "By Kelman, Judith",
        "Description": "He delights in destroying lives; her mission is to save them. One of them will lose.P.J. Lafferty, a therapist assigned to the woman's psych ward at New York's infamous Rikers Island, is passionate about her work. But when she bends the rules to help a troubled patient named Jeannie Bagshaw, she's blamed for the stabbing death that ensues and fired. Struggling to pick up the pieces, P.J. takes on private patients and starts working with a therapist of her own. But just as things seem to be looking up, P.J. happens upon disturbing new developments regarding the murder at the prison.They implicate the victim's estranged and sadistic husband. They threaten the safety of her only child, and they've trapped an eyewitness in an inescapable nightmare. P.J. begins to suspect that she's become a pawn in a dangerous and elaborate cat-and-mouse game. But with whom? And why? As the razor-sharp pieces of this deadly puzzle fall into place, so do those of P.J.'s own troubling past. The harder these dark forces push against her, the more P.J. realizes that only she can stop a ruthless madman dead in his tracks. And her time is running out.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Truth about the Truth: De-confusing and Re-constructing the Postmodern World (New Consciousness Reader)",
        "Authors": "By Anderson, Walter Truett (EDT)",
        "Description": "Includes essays and excerpts from the works of prominent modern thinkers such as Umberto Eco, Jacques Derrida, and Isaiah Berlin among others.",
        "Category": " Philosophy , Movements , Humanism",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Green, Greener, Greenest: A Practical Guide to Making Eco-Smart Choices a Part of Your Life",
        "Authors": "By Bongiorno, Lori and Beinecke, Frances (FRW)",
        "Description": "Are you the turn off the tap while brushing your teeth type, the low-flow shower head type, or can you go all the way with a low-flow toilet? Environmental journalist Bongiorno gives readers options as she describes how to take small steps toward reducing that pesky carbon footprint. With every topic she gives sets of progressive alternatives, starting with the most basic and advancing toward true grit, starting with food and moving on to beverages, personal care, babies and children, home building and improvement, energy and water, apparel and furnishings, cleaning, yards and gardens, and transportation. The recommendations are flexible and easy to do in small increments, giving readers lots of options and very little guilt. The result is a useful-pocket-sized guide you can use as a reference or even for light (but serious) reading. Annotation ©2008 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Nature , Ecology",
        "Publisher": "Perigee Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Winter Moon",
        "Authors": "By Koontz, Dean R.",
        "Description": "\"Koontz is brilliant in the creation of his characters and in building tension.\"CHICAGO SUN-TIMESIn Los Angeles, a hot Hollywood director, high on PCP, turns a city street into a fiery apocalypse. Heroic LAPD officer Jac McGarvey is badly wounded and will not walk for months. His wife and his child are left to fend for themselves against both criminals that control an increasingly violent city and the dead director's cult of fanatic fans.In a lonely corner of Montana, Eduardo Fernandez, the father of McGarvey's murdered partner, witnesses a strange nocturnal sight. The stand of pines outside his house suddenly glows with eerie amber light, and Fernandez senses a watcher in the winter woods. As the seasons change, the very creatures of the forest seem in league with a mysterious presence. Fernandez is caught up in a series of chilling incidents that escalate toward a confronation that could rob him of his sanity or his life--or both.As events careen out of control, the McGarvey family is drawn to Fernandez's Montana ranch. In that isolated place they discover their destiny in a terrifying and fiercely suspenseful encounter with a hostile, utterly ruthless, and enigmatic enemy, from which neither the living nor the dead are safe.",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "State of the Union",
        "Authors": "By Kennedy, Douglas",
        "Description": "Douglas Kennedy’s riveting new novel bears his trademark genius for writing serious popular fiction.Hannah Buchan leads an orderly life in a small town in Maine — a schoolteacher, married to a doctor, with two grown up children. However, her past conceals a dark secret. Thirty years ago she had a brief, dangerous fling with Tobias Judson, a high profile student activist, which she had reconciled to that internal, off-limits attic room marked “Ancient History.” But when Tobias suddenly pops up out of nowhere with a book about his radical years, her life goes into free-fall. And before she knows it, Hannah discovers that a long-ago transgression is never really forgotten.Set amid two wildly contrasting periods of recent American life — the militant 60s and 70s, and the new-found conservatism of today — State of the Union is a remarkable portrait of one woman’s attempts to find her own way in the shifting political currents of her time. But it is also an intriguing portrait of the complexities of a long marriage, the ongoing guilt of parenthood, the perpetual tension between familial responsibility and personal freedom, and the divisive debate between liberal and conservative values that so engulfs the United States today.",
        "Category": " Fiction , General",
        "Publisher": "Arrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Chant of Jimmie Blacksmith: The Classic Novel of an Aboriginal Torn Apart",
        "Authors": "By Keneally, Thomas",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1983"
        }
    },
    {
        "Title": "Christianity: The Faith That Makes Sense",
        "Authors": "By McCallum, Dennis",
        "Description": "Ideal for new teachers and group studies, this very readable apologetic presents a clear, rational defense for Christianity to those unfamiliar with the Bible. Readers will consider the validity of Christian beliefs, overcome barriers to faith, and be challenged to meet Christ personally.",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Living Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Ahead of the Curve: Two Years at Harvard Business School",
        "Authors": "By Broughton, Philip Delves",
        "Description": "An assessment of the teaching methods used by Harvard Business School to promote students into the elite ranks of the business world reveals how the university's curriculum focuses on analyses of actual business scenarios that teach sophisticated strategies in such areas as accounting, beta, and leveraging. 50,000 first printing.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Penguin Press HC, The",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Be with Me",
        "Authors": "By Banks, Maya",
        "Description": "She has a killer on her tail and three men in her bed? An author who knows how to please turns up the Heat in a sizzling new novel of erotic suspense? Hutch, Cam, and Sawyer were juvenile delinquents when they formed a friendship with the wealthy but lonely Regina. She felt loved for the first time in her life?by all three. Today she?s a police officer and wary of resuming her relationship with the hot trio?until an attempt is made on her life. When they jump in to protect her, an all-new bond is formed, one riskier than ever before because now a killer looms in the shadows.",
        "Category": " Fiction , Erotica , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Anger: A Novel",
        "Authors": "By Sarton, May",
        "Description": "Emotional and forthright, Anna battles against  Ned's crippling reserve. In the clash of these  two strong personalities, May Sarton explores  the different ways that men and women express  both anger and love.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Cinnamon Gardens: A Novel",
        "Authors": "By Selvadurai, Shyam",
        "Description": "Set among the upper classes in the gracious, repressive and complex world of 1920s Ceylon (Sri Lanka), this evocative novel tells the story of two people who must determine if it is possible to pursue personal happiness without compromising the happiness of others. A young teacher, Annalukshmi, whose splintered family attempts to arrange an appropriate marriage for her, must decide whether the independence she craves will doom her to a life without love and companionship. It is also the story of Balendran who, respectably married, must suppress-or confront-the secret desires for men that threaten to throw his life into chaos.  With sensuous atmosphere and vivid prose, this masterfully plotted novel re-creates a world where a beautiful veneer of fragrant gardens and manners hides social, personal, and political issues still relevant today.",
        "Category": " Fiction , Historical",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "No Easy Answers",
        "Authors": "By Smith, Sally",
        "Description": "",
        "Category": " Family & Relationships , Learning Disabilities",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1980"
        }
    },
    {
        "Title": "Mercenaries",
        "Authors": "By Knight, Angela",
        "Description": "Beautiful Trinity Yeager's mission: join Nathan August's star-hopping team of mercenary soldiers. With one condition: Trinity must prove her resilience as a lover for him and his first officer, Sebastian Cole. Trinity not only sees Nathan's bet. She raises it...Now, from galactic dens of depravity to far-reaching planets of dominant females and strapping male slaves, Trinity, Sebastian, and Nathan join forces, risk flesh and blood, and push the boundaries of erotic adventure in order to protect, honor, and service.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Double the Pleasure (Wild Hart)",
        "Authors": "By Foster, Lori, Martin, Deirdre, D'Alessandro, Jacquie, and Mccall, Penny",
        "Description": "Get a double dose of sexy fun with this contemporary romance collection—featuring a Winston novella from New York Times bestselling author Lori Foster.Think of the man you’d give anything to be with. Think of what you’d like to do to him…and what you’d like him to do to you. Think of the fun you could have. Now, double it!New York Times bestselling sensations Lori Foster, Deirdre Martin, Jacquie D'Alessandro, and Penny McCall come together to deliver four playful stories of games between friends and lovers in this tantalizing anthology, including a novella featuring Foster's Winston cousins—sexy twins who use their knock-out mirror-image good looks to switch places and tantalize the girls of their dreams.",
        "Category": " Fiction , Romance , Erotica",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "211 Things a Clever Girl Can Do",
        "Authors": "By Cutler, Bunty",
        "Description": "Anything boys can do, girls can do better.The hysterical, cheeky, female counterpart to the smash hit 211 Things a Bright Boy Can Do.If you’ve ever wanted to walk on stilts, make sloe gin, ride an ostrich, or forecast the weather like your grandmother used to, this is the book you’ve been waiting for.This surprisingly handy and delightfully amusing guide includes instructions for:EVERYDAY SURVIVAL SKILLS:How to manage an umbrella in the wind, escape a swarm of vicious bees, spot a love rat, get out of a cab without exposing yourself, and make a little black dress out of a garbage bag.HANDY HOUSEHOLD ADVICE:Learn 17 uses for spare fishnet stockings, how to remove any stain, rescue a meal that’s gone wrong, and enforce toilet seat procedure in a shared dwelling place.TOOLS FOR THE HOBBYIST IN THE KNOW:How to groom a horse, read tea leaves, force a cucumber, and bellydance.",
        "Category": " Humor , Form , Jokes & Riddles",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Curious Gardener's Almanac: Centuries of Practical Garden Wisdom",
        "Authors": "By Edworthy, Niall",
        "Description": "A delightful anthology of curiosities that honors the gardening life. Celebrating the garden in all its splendid diversity and rich history, this collection of facts, ancient wisdom and customs, tips, and recipes features more than 1,000 entries-remarkable information about flowers, vegetables, fruits, trees, herbs, insects, birds, water, soil, tools, composts, climate, gardens and gardeners, myths, superstitions, and biodynamics. Woven into this wealth of knowledge are famous quotations, anecdotes, traditional sayings, lines of verse, and words of rural wisdom. It's a wonderful gift for any gardener, whether they're tending a window box or a full-fledged farm.",
        "Category": " Gardening , Reference",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "A Handbook to Luck (Vintage Contemporaries)",
        "Authors": "By Garcia, Cristina",
        "Description": "In the late 60s, three teenagers from around the globe are making their way in the world: Enrique Florit, from Cuba, living in southern California with his flamboyant magician father;  Marta Claros, getting by in the slums of San Salvador; Leila Rezvani, a well-to-do surgeon's daughter in Tehran. We follow them through the years, surviving war, disillusionment, and love, as their lives and paths intersect. With its cast of vividly drawn characters, its graceful movement through time, and the psychological shifts between childhood and adulthood, A Handbook to Luck is a beautiful, elegiac, and deeply emotional novel by beloved storyteller Cristina García.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Rosehaven (Song Novels)",
        "Authors": "By Coulter, Catherine",
        "Description": "From the #1 NEW YORK TIMES BESTSELLING AUTHOR. When heiress Hastings Trent is joined with warrior Severin Langthorne in marriage, she must uncover the mystery surrounding a secluded estate known as Rosehaven.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Secrets of Self-Healing: Harness Nature's Power to Heal Common Ailments, Boost Your Vitality,and Achieve Optimum Wellness",
        "Authors": "By Ni, Maoshing",
        "Description": "Read Maoshing Ni's posts on the Penguin Blog.    A guide to natural healing that combines the wisdom of Eastern tradition with Western medicine and nutritional   science. Secrets of Self-Healing ranges from treating common ailments with healing foods   and herbs to the all-round balancing of mind and body that is essential for vitality, wellness, and longevity.   In Part One, Dr. Mao explains that diet, exercise, self-awareness, a positive emotional life, living in harmony with the   environment, and spiritual growth are crucial for vibrant, lasting health. He shows, for example, how simple self-  assessments can help prevent disease, how negative emotions can make us ill, how clutter in our homes can create   imbalances in our bodies, and how Eastern and Western medicine can work together to fight cancer. Then,   in Part Two, he reveals his favorite natural remedies for more than sixty-five common ailments, such as sore throat,   dandruff, headaches, high blood pressure, sunburn, insect bites, indigestion, and jet lag. Inspirational and   practical, Secrets of Self-Healing will put readers on the path to a balanced and healthy life.",
        "Category": " Body, Mind & Spirit , Healing , General",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "The Book of Joe: A Novel",
        "Authors": "By Tropper, Jonathan",
        "Description": "Right after high school, Joe Goffman left sleepy Bush Falls, Connecticut and never looked back. Then he wrote a novel savaging everything in town, a novel that became a national bestseller and a huge hit movie. Fifteen years later, Joe is struggling to avoid the sophomore slump with his next novel when he gets a call: his father's had a stroke, so it's back to Bush Falls for the town's most famous pariah. His brother avoids him, his former classmates beat him up, and the members of the book club just hurl their copies of Bush Falls at his house. But with the help of some old friends, Joe discovers that coming home isn't all bad—and that maybe the best things in life are second chances.Fans of Nick Hornby and Jennifer Weiner will love this book, by turns howling funny, fiercely intelligent, and achingly poignant. As evidenced by The Book of Joe's success in both the foreign and movie markets, Jonathan Tropper has created a compelling, incredibly resonant story.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Tomorrow They Will Kiss: A Novel",
        "Authors": "By Santiago, Eduardo",
        "Description": "Written with buoyant humor and a sharp sense of human desire, this is the story of love pursued at any cost, of how friendship and history unite people for better or worse, and of the hope for that redemptive kiss capable of reconciling estranged lovers and countries.",
        "Category": " Fiction , Literary",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Big Green Purse: Use Your Spending Power to Create a Cleaner, Greener World",
        "Authors": "By Maceachern, Diane",
        "Description": "Read Diane McEachern's posts on the Penguin Blog.    Protecting our environment is one of the biggest issues facing our planet today. But how do we solve a problem that   can seem overwhelming-even hopeless? As Diane MacEachern argues in Big Green Purse, the best way to fight   the industries that pollute the planet, thereby changing the marketplace forever, is to mobilize the most powerful   consumer force in the world-women. MacEachern's message is simple but revolutionary. If women   harness the \"power of their purse\" and intentionally shift their spending money to commodities that have the greatest   environmental benefit, they can create a cleaner, greener world. Spirited and informative, this book: -   targets twenty commodities-cars, cosmetics, coffee, food, paper products, appliances, cleansers, and more-where   women's dollars can make a dramatic difference; - provides easy-to-follow guidelines and lists so women can   choose the greenest option regardless of what they're buying, along with recommended companies they should   support; - encourages women to spend wisely by explaining what's worth the premium price some green   products cost, what's not, and when they shouldn't spend money at all; and - differentiates between products   that are actually \"green\" and those that are simply marketed as \"ecofriendly.\" Whether readers want to   start with small changes or are ready to devote the majority of their budget to green products, MacEachern offers   concrete and immediate ways that women can take action and make a difference. Empowering and enlightening, Big   Green Purse will become the \"green shopping bible\" for women everywhere who are asking, \"What can I do?  \"",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Avery",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "After Rain: Stories",
        "Authors": "By Trevor, William",
        "Description": "Twelve remarkable stories by the master storyteller William Trevor. Last Stories is forthcoming from Viking.\"There is no better short story writer in the English-speaking world.\"—Wall Street Journal  In this collection of twelve dazzling, acutely rendered tales, William Trevor plumbs the depths of the human heart. Here we encounter a blind piano tuner whose wonderful memories of his first wife are cruelly distorted by his second; a woman in a difficult marriage who must choose between her indignant husband and her closest friend; two children, survivors of divorce, who mimic their parents' melodramas; and a heartbroken woman traveling alone in Italy who experiences an epiphany while studying a forgotten artist's Annunciation.  Trevor is, in his own words, \"a storyteller. My fiction may, now and again, illuminate aspects of the human condition, but I do not consciously set out to do so.\"Conscious or not, he touches us in ways that few writers even dare to try. Trevor wrote eighteen novels and novellas, and hundreds of short stories, for which he has won a number of prizes including the Hawthornden Prize, the Yorkshire Post Book of the Year Award, the Whitbread Book of the Year Award and the David Cohen Literature Prize in recognition of a lifetime's literary achievement. In 2002 he was knighted for his services to literature.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Penguin (Non-Classics)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Green Hour: A Novel",
        "Authors": "By Tuten, Frederic",
        "Description": "In this novel, Frederic Tuten explores the ageless tension between a life of passion and a desire for ease. Set in Paris and New York, The Green Hour tells the story of Dominique, an art historian who cannot choose between two men who embody the critical schism in her life - unquenchable idealism and material, attainable happiness.The novel etches the career of this extraordinary woman from her rebellious college years to the present. What unfolds is a passionate love story in which Dominique is torn by her destructive devotion to her first love, the seductive Rex, who periodically appears and disappears from her life, and Eric, a wealthy businessman deeply bound to her.Woven into this turbulent love story is the narrative of Dominique's intellectual life, revealing her complex relationship with art, tradition, and the cultural turmoils of our time. In portraying a character for whom love and idealism are lost, the novel hauntingly reveals the need for pursuing both.",
        "Category": " Fiction , Literary",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Dora: An Analysis of a Case of Hysteria",
        "Authors": "By Freud, Sigmund",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner Paper Fiction",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1963"
        }
    },
    {
        "Title": "Mona Lisa Craving (Monere: Children of the Moon, Book 3)",
        "Authors": "By Sunny",
        "Description": "In the sequel to Mona Lisa Awakening and Mona Lisa Blossoming, Mona Lisa, a Monère woman, is drawn to Dante, the warrior son of a healer, who had been cursed by a high priestess to endure a never-ending cycle of life and death and who wants nothing more than to die at Mona Lisa's hands. Original.",
        "Category": " Fiction , Romance , Paranormal",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Bono",
        "Authors": "By Assayas, Michka and Bono",
        "Description": "A portrait of the Grammy Award-winning lead singer of U2 discusses how his life and achievements defy rock-star clichés, describing his transformation from a post-punk band singer to one of the industry's most famous figures, his long-time marriage to his childhood sweetheart, and his work as a spokesperson for Third-World issues. Reprint.",
        "Category": " Biography & Autobiography , Music",
        "Publisher": "Riverhead Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Ultimate Book of Useless Information: A Few Thousand More Things You Might Need to Know ( But ProbablyDon't)",
        "Authors": "By Botham, Noel",
        "Description": "Bigger, better, and more useless than ever!  In their groundbreakingly useless book, The Book of Useless Information, the members of the Useless Information Society proved that knowledge doesn't have to be useful to be entertaining. Now they present a new collection of their most fascinating, hilarious, and wholly trivial findings. The Ultimate Book of Useless Information includes such \"did you knows\" as:  - Peanuts are one of the ingredients in dynamite - The average person spends two weeks of their life kissing - And giraffes have no vocal cords",
        "Category": " Reference , Trivia",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Charmed & Deadly (Bronwyn the Witch, Book 3)",
        "Authors": "By Havens, Candace",
        "Description": "Bronwyn is back...but so is her evil ex-boyfriend. From the author of Charmed & Ready and Charmed & Dangerous.  Bronwyn is used to making enemies-when you dedicate your life to ridding the world of evil magic dudes and dudettes, it can happen. So when she first realizes that an attempted hit on the Prime Minister was really for her, it's just \"same spell, different day.\" But then something about this hex reminds Bronwyn an awful lot of an ex-Jason Gladstone, who was her college sweetheart until he tied her up and tried to drain her of her powers. Talk about a date from hell.",
        "Category": " Fiction , Romance , Paranormal",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Bridal Wreath",
        "Authors": "By Undset, Sigrid",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Lightning McQueen",
        "Authors": "By Frank Berrios",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Eye of the Story: Selected Essays and Reviews",
        "Authors": "By Welty, Eudora",
        "Description": "Eudora Welty discusses her own artistic endeavors and aims as well as providing commentaries on such writers as Chekhov, Faulkner, Jane Austen, Virginia Woolf, and Elizabeth Bowen",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "Doc Hudson (Disney/Pixar Cars)",
        "Authors": "By Frank Berrios",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Mater (Cars)",
        "Authors": "By Berrios, Frank",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "365 Nights: A Memoir of Intimacy",
        "Authors": "By Thorpe, Betsy and Muller, Charla",
        "Description": "When Charla Muller?s husband turned 40, she gave him something memorable. Sex. Every day. For an entire year. The Mullers had a solid marriage and two wonderful children, but over the years sex had fallen low on their to-do list. The lack of intimacy wasn?t causing them to drift apart, exactly, but their connection didn?t seem as great as it could be. Charla decided she couldn?t go on pretending the relationship they once had wasn?t important. The couple would embark on a year of scheduled sex, falling over Tonka trucks and piles of laundry in an effort to make time for each other. There were obstacles along the way (work implosions, faking it) and questions came to light. Will sex every day strengthen a marriage, or reveal the cracks? Pull a couple together or drive them apart? Does good sex (even mediocre sex) make up for things that aren?t so good?",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "It's OK if You're Clueless: and 23 More Tips for the College Bound",
        "Authors": "By McMillan, Terry",
        "Description": "When her son Solomon graduated from high school, Terry McMillan was asked to be the guest speaker at the commencement ceremony. Determined not to be dull or redundant, Terry thought back to when she was stepping out into the world for the first time and the things she wished people had told her. Printing up what she thought were the most important tips for these new graduates, Terry was surprised to find that not only were these homemade pamphlets a hit with the students, but their parents clamored for copies too.   Now with It's Ok If You're Clueless, Terry McMillan brings her trademark wit and sass to every son and daughter about to take their first tentative steps into adulthood. Offering such nuggets as \"Sit up straight,\" \"Don't listen to your parents,\" and \"Bring your laundry home,\" as well as \"See the world\" and \"Read anything and everything,\" It's Ok If You're Clueless is packed with the commonsense advice and conversational tone that have made her novels classic bestsellers. Equal parts witty and wise, It's Ok If You're Clueless is the perfect gift for the college bound this May.",
        "Category": " Study Aids , College Guides",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Darwin's Secret",
        "Authors": "By Hoyt, Richard",
        "Description": "A surreal trip down the exotic Amazon in search of gold and a magic icon turns up a lost Utopian colony of Europeans, a group of god-doctors who heal with leeches, and other unnerving surprises",
        "Category": " Fiction , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "The Cross and The Crescent: The Dramatic Story of the Earliest Encounters Between Christians and Muslims",
        "Authors": "By Fletcher, Richard A.",
        "Description": "In this immensely readable history that couldn’t be more timely, award-winning historian Richard Fletcher chronicles the relationship between Islam and Christianity from the time of Muhammad to the Reformation. With lucidity and sound scholarship, Fletcher demonstrates that though there were fruitful trading and cultural interactions between Muslims and Christians during the period when the Arabs controlled most of the Mediterranean world, each group viewed the other’s religion from the beginning as fundamentally different and suspect. Eschewing moral judgments and easy generalizations, The Cross and the Crescent allows readers to draw their own conclusions and explore the implications for the present day.",
        "Category": " Religion , History",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "The Serpent Garden",
        "Authors": "By Riley, Judith Merkle",
        "Description": "When Henry VIII arranges a marriage between his sister and the aging French king, widowed painter Susanna Dallet joins the entourage of the princess-bride, unwittingly carrying a perilous secret that will embroil her in the dark intrigues of the French court. Reprint.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Why Wills Won't Work (If You Want to Protect Your Assets): Safeguard Your Estate for the Ones You Really Love",
        "Authors": "By Budish, Armond D.",
        "Description": "For most people drawing up a will, making sure their inheritance is secure for their spouse, children, grandchildren, or other family members is a top priority. And though they may think they're taking care of their loved ones' future with the traditional planning a will offers, the reality is that down the line their designated heirs may never see a dime.  As attorney and estate-planning expert Armond Budish explains in Why Wills Won't Work, good estate planning in the twenty-first century requires more than the old \"one size fits all\" approach of filling out a few legal documents. In this book, he illustrates his customized SAFE method-the only solution that will Safeguard Assets for your Family Exclusively. Beginning with an assessment quiz that helps readers determine their particular needs, risks, and goals, along with the options available, Why Wills Won't Work addresses:  - how to protect a child's inheritance in a divorce; - the steps to take now to avoid death taxes later; - how to safeguard an inheritance for grandchildren; - how to keep probate court, creditors, and potential lawsuits from depleting an inheritance; - how to plan in advance for a disabled child or one who can't manage money; and - what documents you really need, and how to choose a lawyer.  Easy to follow and reader-friendly, with illuminating real-life stories throughout, Why Wills Won't Work is the essential guide for readers who want to be sure now that their family's future inheritance is airtight.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Circa 1492: Art in the Age of Exploration",
        "Authors": "By National Gallery of Art (U. S.) (COR) and Levenson, Jay A. (EDT)",
        "Description": "Surveys the art of the Age of Exploration in Europe, the Far East, and the Americas",
        "Category": "",
        "Publisher": "National Gallery of Art Washington,/ Yale University Press,",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "The Mirror Crack'd (Jane Marple Mysteries)",
        "Authors": "By Christie, Agatha",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books Inc",
        "Price Starting With ($)": "9.52",
        "Publish Date": {
            "Month": "September",
            "Year": "1977"
        }
    },
    {
        "Title": "Kissing the Virgin's Mouth: A Novel",
        "Authors": "By Gershten, Donna M.",
        "Description": "Guadalupe Magdalena Molina Vásquez -- wife, scoundrel, courtesan, mother -- is full of contradictions: she believes in love but is suspicious of men; she rejects religion but admires the Virgin Mary; she respects tradition while breaking all the rules. Here, in the Golden Zone of Teatán, Mexico, Magda tells her extraordinary life story -- from a poor Mexican barrio to American affluence, from wide-eyed childhood to worldly courtesan life, from full-blooded youth to oncoming blindness -- and bewitchingly imparts the hard-earned wisdom she has gained through the years.",
        "Category": " Fiction , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Merlin's Dragon (Merlin Saga)",
        "Authors": "By Barron, T. A.",
        "Description": "In the years after Fincayra disappears and Merlin has been sent wandering, a young lizard-like creature, with the wings of a bat and the magical power to produce any smell it encounters, is born into the new world of Avalon. The unlikely hero—Basil, he is called—cannot find a single creature like itself nor a person who can tell him what he is. But it is clear that Basil is much more than he seems when he stumbles into an encounter with the great Merlin, saving his child’s life, then uncovers a secret plot by the evil Rhita Gawr. It’s a race against time and across Avalon as Basil, with the help of the faithful wind sister Ailah, searches for the great wizard to warn him. This is one of T.A. Barron’s most thrilling adventures yet and features a new and unforgettable character in his earliest years.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Philomel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Awakening at Midlife: A Guide to Reviving Your Spirit, Recreating Your Life, and Returning to Your Truest Self",
        "Authors": "By Brehony, Kathleen A.",
        "Description": "Fraught with physical, relational, professional, and psychological changes, midlife can be a challenging time.  But according to Jungian-oriented psychotherapist Kathleen Brehony, \"tranformation at midlife offers unparalleled opportunities for a rich, meaningful second half of life.\"With special sections on recovering childhood dreams, enriching creative expression, learning to appreciate our physical selves, heightening consciousness, and more, this guide is a wake-up call for anyone who wants to reassess one's beliefs and find a path that leads to greater fulfillment, happiness, and passion for life's journey.",
        "Category": " Psychology , Developmental , Adulthood & Aging",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Ready Readers Colossal Collection: Stage 2 - Grades 1-3",
        "Authors": "By Publishing, Modern",
        "Description": "",
        "Category": "",
        "Publisher": "Modern Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Warning at One (Lois Meade Mystery)",
        "Authors": "By Purser, Ann",
        "Description": "She's worked through all of the days of the week, turning up clues and scrubbing up both messes and murderers in the village of Long Farnden. But crime is a persistent stain, and Lois Meade is finding that sleuthing takes up as much time as she can give it.The tenants of Lois Meade's terrace house in Tresham are all up and leaving, frustrated by their neighbor's feisty pet cockerel, an early riser with a piercing voice - aptly named Satan. His owner, the elderly Clem Finch, refuses to part with his feathery companion. If that bird doesn't fly the coop soon, Lois just might consider putting coq au vin on the menu.So it's a relief when her son Douglas gets a new job in Tresham and asks to rent the house. But something very peculiar is occurring on Gordon Street. A local grocery has been robbed. One neighbor comes and goes only by night. And then there's old Mrs. Blairgowrie across the street, who seems unusually observant ... for a blind woman.Then Clem and his pet cockerel are found dead under mysterious circumstances, and Douglas - who has become involved with Clem's granddaughter, Susie - is one of the prime suspects. As landlord, mother, and witness, Lois must take action and flush out the killer who's fouling the Meade name.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Sharpe's Honor (Richard Sharpe's Adventures, No. 7)",
        "Authors": "By Cornwell, Bernard",
        "Description": "An unfinished duel, a midnight murder, and the treachery of a beautiful prostitute lead to the imprisonment of Sharpe. Caught in a web of political intrigue for which his military experience has left him fatally unprepared, Sharpe becomes a fugitive--a man hunted by both ally and enemy alike.",
        "Category": " Fiction , War & Military",
        "Publisher": "Penguin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "What Every American Should Know About Who's Really Running America: And What You Can Do About It",
        "Authors": "By Rossi, Melissa",
        "Description": "A guide to the politicos, money men, lobbyists, and deal makers who really run AmericaWhat foreign country has the power to send America crashing into a recession? Why is the USA still dangerously dependent on oil, when viable energy alternatives have existed for decades? Who made the call that we should return to nuclear energy—and then took a high-paying position with a nuclear company? Which youth group was a spawning ground for many contemporary power mongers? What lobbyists and special-interest groups are running the show on Capitol Hill—and exactly what tools of persuasion are they using?Melissa Rossi answers these questions and more in this timely and topical guide to who’s pulling the strings behind the scenes of American politics.  This latest edition of Rossi’s popular What Every American Should Know. . . series puts the spotlight on our own backyard, covering topics like: • Which groups ensure that Americans pay more for drugs than any other nation • How our immigration laws are damaging the U.S. economy • Who’s telling the school boards what your child will learn • Who really benefits from U.S. foreign policy • How corporations and government agencies are spying on us • Why we should avoid electronic voting • Who killed the electric car and who exposed it Organized by topic for easy reference, What Every American Should Know About Who’s Really Running America shows Americans what is going on behind the scenes and how they can counterbalance the influence of a small, powerful elite to put the power back where it should be—in the hands of the people.",
        "Category": " Political Science , Public Policy , Economic Policy",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Lucky Guide to Mastering Any Style: How to Wear Iconic Looks and Make Them Your Own",
        "Authors": "By France, Kim and Linett, Andrea",
        "Description": "On the heels of the fabulously successful Lucky Shopping Manual comes the complete handbook for   creating a great look based on ten iconic styles —packed with more than 450 color images.     With a circulation of 1.1 million, Lucky magazine has taken America’s most dedicated shoppers by storm,   offering real-world advice and first-rate finds. Now the Lucky experts show how to put it all together in an inspiring   collection of ideas that go beyond the basics and yield endless innovation for year-round reinvention.   Based on the techniques used by fashion designers for years, The Lucky Guide to Mastering Any Style features   ten versatile archetypes that can be customized to fit varying moods, personalities, and body types. Applying these   enduring styles to a dazzling spectrum of possibilities, The Lucky Guide to Mastering Any Style deconstructs   each look, with components including clothes, shoes, accessories, patterns, and colors. Just as designers use swatches   and images to spark creativity, readers will have access to hundreds of photographs from style setters. Must-haves for   every closet, foolproof instructions, profiles of real-life Lucky Girls, and money-saving Lucky Breaks make this the   indispensable resource for complete chic.",
        "Category": " Reference , Consumer Guides",
        "Publisher": "Avery",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Sea Glass",
        "Authors": "By Shreve, Anita",
        "Description": "With all the narrative power and emotional immediacy that have made her novels acclaimed international bestsellers, Anita Shreve unfolds a richly engaging tale of marriage, money, and troubled times-the story of a pair of young newlyweds who, setting out to build a life together in a derelict beach house on the Atlantic coast, soon discover how threatening the world outside their front door can be.",
        "Category": " Fiction , Literary",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "The Juan-Carlos Cruz Calorie Countdown Cookbook: A 5-Week Eating Strategy for Sustainable Weight Loss",
        "Authors": "By Shulman, Martha Rose and Cruz, Juan-carlos",
        "Description": "A five-week weight-loss program by the Food Network's \"Calorie Commando\" shares 150 low-fat varieties of favorite recipes, shares the author's own weight-loss success story, and includes such options as chicken parmesan, tortilla casserole, and chocolate cake.",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "Gotham",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Mine All Mine",
        "Authors": "By Davies, Adam",
        "Description": "A dazzling and funny romantic comedy from Adam Davies, the author of The Frog King and Goodbye Lemon.Otto Starks is a \"pulse\"—a highly specialized security guard who has hyperdeveloped senses and a nervous habit of popping tabs of cyanide. Otto was once a rising star but then he was rolled three times by the notorious Rat Burglar. Now, demoted and dangerously in debt to a loan shark, all he has left is Charlie Izzo, the woman he loves. Unfortunately, she is also the Rat Burglar's zealous advocate. That's bad enough. But then Otto gets robbed yet again and the cops pronounce him the prime suspect. When Charlie disappears and Otto becomes a fugitive, he realizes that the Rat Burglar has stolen much more from him than art. And to get it back he must break the law he has devoted his life to upholding. Mine All Mine is a nail-biting thriller about deception, betrayal, and ownership—in art and in love.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    }
]