[
    {
        "Title": "Treasury of Christmas Carols",
        "Authors": "By Silverman, Jerry",
        "Description": "",
        "Category": "",
        "Publisher": "Dorset House Publishing Co Inc",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Art of War (Barnes & Noble Classics)",
        "Authors": "By Sun-tzu, Giles, Lionel (TRN), and Galvin, Dallas (EDT)",
        "Description": "&&LDIV&&R&&LDIV&&R&&LI&&RThe Art of War&&L/I&&R, by &&LB&&RSun Tzu&&L/B&&R, is part of the &&LI&&R&&LI&&RBarnes & Noble Classics&&L/I&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&R“A clever fighter is one who not only wins, but excels in winning with ease.” So wrote Sun Tzu 2,500 years ago.&&LBR&&R&&LBR&&RSun Tzu’s incisive blueprint for battlefield strategy is as relevant to today’s combatants in business, politics, and everyday life as it once was to the warlords of ancient China. &&LI&&RThe Art of War&&L/I&&R is one of the most useful books ever written on leading with wisdom, an essential tool for modern corporate warriors battling to gain the advantage in the boardroom, and for anyone struggling to gain the upper hand in confrontations and competitions. &&LBR&&R&&LBR&&RHere Lionel Giles’s famed 1910 translation, laced with commentary from illustrious Chinese experts, is brought up to date with relevant quotations from Western writers and thinkers.  This new edition offers Sun Tzu’s timeless classic, both with and without annotation, making it more accessible to aspiring leaders and military strategists than ever before. &&L/DIV&&R&&LDIV&&R&&LP&&R&&LB&&RDallas Galvin&&L/B&&R, a writer and journalist specializing in international affairs and the arts, has reported on military affairs in Latin America and Asia and produced documentaries for the NATO Alliance.&&L/P&&R&&L/DIV&&R",
        "Category": " History , Military , General",
        "Publisher": "Sterling Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Leo the Late Bloomer",
        "Authors": "By Kraus, Robert and Aruego, Jose (ILT)",
        "Description": "“Captivating and rollicking.” —The Horn BookLeo isn't reading, or writing, or drawing, or even speaking, and his father is concerned. But Leo's mother isn't. She knows her son will do all those things, and more, when he's ready.This heartwarming story of how a little tiger named Leo bloomed is told by bestselling author Robert Kraus and is accompanied by the wonderfully bold illustrations of Jose Aruego.With its message of patience and humor, Leo the Late Bloomer is more timely than ever. As Children's Books and Their Creators commented: \"Leo's reassuring 'I made it!' at the end delights young listeners who may have been scrutinized for early blooming by well-intentioned moms and dads. Deserves space on any parenting shelf.\"",
        "Category": " Juvenile Fiction , Social Themes , Peer Pressure",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "A Christmas Carol (Fun-to-Read Fairy Tales)",
        "Authors": "By Paul Hernandez",
        "Description": "",
        "Category": "",
        "Publisher": "Modern Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Christmas in the Manger",
        "Authors": "By Buck, Nola and Bond, Felicia (ILT)",
        "Description": "The classic Christmas story, a joy to share with young children.The gentle beauty of the story of the first Christmas is now available as a board book. With a simple, lyrical text and radiant artwork, this book is perfect for the youngest child to be a part of the wonder of the Nativity.Parents, grandparents, and caregivers have all embraced this telling. Don't miss this beautiful little book from the acclaimed team of Nola Buck and Felicia Bond.",
        "Category": " Juvenile Fiction , Concepts , Senses & Sensation",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "DK Readers: The Story of Chocolate (DK Readers Level 3)",
        "Authors": "By Polin, Caryn J.",
        "Description": "A mouthwatering book about chocolate for advanced young readers. Includes gorgeous photography and a full glossary. Full of deliciously tempting facts about everyone's favorite candy.Did you know that the average person eats 100 chocolate bars a year? Or that the largest chocolate confection ever made weighed as much as 140,000 chocolate bars? This history of chocolate fulfills cravings for knowledge by helping children to develop reading skills and a general curiosity about the world around them.Stunning photographs combine with lively illustrations and engaging, age-appropriate stories in DK Readers, a multilevel reading program guaranteed to capture children's interest while developing their reading skills and general knowledge.With DK Readers, children will learn to read—then read to learn!",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "I Promise You My Love",
        "Authors": "By Schutz, Susan Polis (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "The Lion's Paw (Little Golden Book)",
        "Authors": "By Tenggren, Gustaf (ILT) and Werner Watson, Jane",
        "Description": "In this famous African folktale, a lion has a thorn in its paw. Who will take it out? Only the little mouse is brave enough! Children will learn a lesson about compassion as they look at breathtaking paintings of African animals by renowned illustrator Gustaf Tenggren. A Little Golden Book Classic!",
        "Category": " Juvenile Fiction , Animals , Lions, Tigers, Leopards, etc.",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Miss Hickory",
        "Authors": "By Bailey, Carolyn Sherwin and Gannett, Ruth Chrisman",
        "Description": "A Newbery Award winner!Most dolls lead a comfortable but unadventurous life. This was true of Miss Hickory until the fateful day that her owner, Ann, moves from her New Hampshire home to attend school in Boston—leaving Miss Hickory behind. For a small doll whose body is an apple-wood twig and whose head is a hickory nut, the prospect of spending a New Hampshire winter alone is frightening indeed. In this classic modern day fairy tale, what’s a doll to do?",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1977"
        }
    },
    {
        "Title": "The Fire Cat (I Can Read Level 1)",
        "Authors": "By Averill, Esther Holden",
        "Description": "Pickles the fire cat to the rescue!Pickles is a young cat with big paws who wishes to do big things with them! When he's adopted by the local firehouse, Pickles works hard to be a good fire cat. He learns to jump on a fire truck. He learns to help put out a fire, and he even helps out in a rescue. Beginning readers will cheer as Pickles gets his wish and finds something big to do with his paws. With sweet illustrations from author-illustrator Esther Averill, this Level One I Can Read book is perfect for children learning to sound out words and sentences.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "The Adventures of Chatterer the Red Squirrel (Dover Children's Thrift Classics)",
        "Authors": "By Burgess, Thornton W., Kliros, Thea (ILT), and Cady, Harrison (ILT)",
        "Description": "Author and editor of numerous children's books, Thornton W. Burgess was also a noted conservationist. In writing for youngsters he combined a gift for storytelling with his love of the outdoors, creating an entertaining menagerie of animals whose adventures he skillfully recounted in a series of charming fables. In them, he taught young readers about nature and encouraged them to love the \"lesser folk in fur and feathers.\"In this delightfully told tale, Burgess chronicles the escapades of Chatterer the Red Squirrel, who's known throughout the Green Forest as a mischief maker. Narrowly escaping the clutches of Shadow the Weasel and Redtail the Hawk, the bushy-tailed little fellow decides to leave the forest for a new home, only to learn that curiosity, carelessness, and mistrust can lead to a heap of troubles.First published in 1915, this engaging story will charm readers of all ages — as well as young listeners.",
        "Category": " Juvenile Fiction , Animals , Squirrels",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Book of Three (Pyrdain Chronicles)",
        "Authors": "By Alexander, Lloyd",
        "Description": "Taran, The Assistant Pig-Keeper, longs to be a hero.He begins his journey with a strange assortment of companions on a dangerous mission to save his beloved land, Prydain.  Packed with action, humor, romance, and gallantry, Taran's adventures chronicle his beloved Prydain and his battle with the forces of evil.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1978"
        }
    },
    {
        "Title": "Ballad of Frankie Silver",
        "Authors": "By McCrumb, Sharyn",
        "Description": "Spencer Arrowood was a young, untried deputy sheriff when his testimony helped convict a Tennessee youth for the brutal slaying of two hikers along the Appalachian Trail. Now, twenty years later, Spencer receives an invitation to an execution. After two decades on death row, a date has finally been set to strap Fate Harkryder into the chair and throw the switch. But time has eroded Spencer's moral certainty of guilt and raised the specter of another murder.Over a century ago, it is said that a man was murdered in his sleep, that a young wife and mother was accused of the crime, and that on the gallows her last words were silenced by her father's order. In 1833 Frankie Silver became the first woman in North Carolina to be hanged for murder. But what really happened so long ago becomes an obsession for Spencer Arrowood as the parallels between Frankie and Fate, between two crimes more than a hundred years apart, become as clear - and as shocking - as the single truth that joins two condemned souls. Suddenly, Spencer Arrowood is engaged in a race against time to keep history from happening all over again, and to save the life of a man who just may be innocent after all.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Heartfire (The Tales of Alvin Marker V)",
        "Authors": "By Card, Orson Scott",
        "Description": "Alvin's wife Peggy makes a perilous journey to Charleston to visit the exiled king of England to plead for an end to the madness between the free nations and slave nations of North America, while Alvin journeys north to Salem, Massachusetts to confront a legacy of witchcraft. 100,000 first printing.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "27.09",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "In Pursuit of the Proper Sinner",
        "Authors": "By George, Elizabeth",
        "Description": "Calder Moor is a wild and deadly place: many have been trapped in the myriad limestone caves, lost in collapsed copper mines, injured on perilous gritstone ridges. But this time, when two bodies are discovered in the shadow of the ancient circle of stones known as Nine Sisters Henge, it is clearly not a case for Mountain Rescue. The corpses are those of a young man and woman. Each met death in a different fashion. Each died violently. To Detective Inspector Thomas Lynley, brought in to investigate by special request, this grisly crime promises to be one of the toughest assignments of his career. For the unfortunate Nicola Maiden was the daughter of a former officer in an elite undercover unit, a man Lynley once regarded as a mentor. Now, as Lynley struggles to find out if Nicola's killer was an enemy of her father's or one she earned herself, a disgraced Barbara Havers, determined to redeem herself in the eyes of her longtime partner, crisscrosses London seeking information on the second murder victim. Yet the more dark secrets Lynley and Havers uncover, the more they learn that neither the victims nor the suspects are who they appear to be. And once again they come up against the icy realization that human relationships are often murderous...and that the blood that binds can also kill.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "11.33",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Forever Odd (Odd Thomas)",
        "Authors": "By Koontz, Dean R.",
        "Description": "Every so often a character so captures the hearts and imaginations of readers that he seems to take on a life of his own long after the final page is turned. For such a character, one book is not enough—readers must know what happens next. Now Dean Koontz returns with the novel his fans have been demanding. With the emotional power and sheer storytelling artistry that are his trademarks, Koontz takes up once more the story of a unique young hero and an eccentric little town in a tale that is equal parts suspense and terror, adventure and mystery—and altogether irresistibly odd.We’re all a little odd beneath the surface. He’s the most unlikely hero you’ll ever meet—an ordinary guy with a modest job you might never look at twice. But there’s so much more to any of us than meets the eye—and that goes triple for Odd Thomas. For Odd lives always between two worlds in the small desert town of Pico Mundo, where the heroic and the harrowing are everyday events. Odd never asked to communicate with the dead—it’s something that just happened. But as the unofficial goodwill ambassador between our world and theirs, he’s got a duty to do the right thing. That’s the way Odd sees it and that’s why he’s won hearts on both sides of the divide between life and death.A childhood friend of Odd’s has disappeared. The worst is feared. But as Odd applies his unique talents to the task of finding the missing person, he discovers something worse than a dead body, encounters an enemy of exceptional cunning, and spirals into a vortex of terror. Once again Odd will stand against our worst fears. Around him will gather new allies and old, some living and some not.  For in the battle to come, there can be no innocent bystanders, and every sacrifice can tip the balance between despair and hope. Whether you’re meeting Odd Thomas for the first time or he’s already an old friend, you’ll be led on an unforgettable journey through a world of terror, wonder and delight—to a revelation that can change your life. And you can have no better guide than Odd Thomas.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Business of Being a Writer",
        "Authors": "By Goldin, Stephen and Sky, Kathleen",
        "Description": "This business guide for writers provides essential information regarding copyrights, contracts, and taxes and includes appendixes of proofreaders' symbols, government resources, and writers' organizations",
        "Category": " Business & Economics , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Golden Trillium (World of the Three Moons, Bk. 3)",
        "Authors": "By Norton, Andre",
        "Description": "The story of the three sister princesses of Ruwenda began in Black Trillium, an epic of magic, mystery, and love created by three of fantasy's finest talents - Andre Norton, Julian May, and Marion Zimmer Bradley. The saga continued in Blood Trillum, and now award-winning and bestselling author Andre Norton picks up the tale as Princess Kadiya, the headstrong Seeker-Warrior, encounters a timeless evil of loathsome power that threatens the realm of Ruwenda.The sisters Haramis, Anigel and Kadiya have defeated the evil sorcerer Orogastus, united the kingdoms of Ruwenda and Labornok, and restored a precarious balance to the sundered world. With her mystical three-eyed sword, Kadiya now journeys into the choked swamps of Ruwenda, there to seek her destiny among the Oddling swamp-dwellers whose army she had once led.Kadiya ventures to the lost city of the Vanished Ones only to discover a strange race living deep inside its forbidden walls - tiny, intelligent creatures known as Hassitti, waiting patiently but fruitlessly for the Vanished Ones' return. The Hassitti are able to \"catch dreams\" of distant events and places, and now their visions are bringing vivid, troubled warnings of an unknown danger issuing from the mountains to the west.The apprehensions are soon confirmed by a mysterious plague that is spreading from the western mountains, a deadly foulness that kills everything in its wake. The carrier of evil disease now approaches the domain of the Skritek, dreadful saurian monsters that feed on living flesh, enemies of Oddlings and humans alike, creatures of implacable hatred.Kadiya, with only three Oddlings to accompany her, quests into the Thorny Hell, the Skritek's ichorous realm, to confront the source of the plague and find a means to defeat it. There they find a portal leading to a universe of awesome darkness - a foul entranceway that threatens the very existence of the World of the Three Moons.Golden Trillum is the tumultuous saga of a desperate battle against dark forces, a tale of courage in the face of overwhelming odds, and the story of a love destined to overcome the eternal barriers of time and space.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Papa's Angels: A Christmas Story",
        "Authors": "By Paxton, Collin Wilcox and Carden, Gary",
        "Description": "\"This is what happened since Momma died....\" So begins this heartwarming Christmas tale from the Appalachian mountains. Told with fable-like charm through the eyes of twelve-year-old Becca Jenkins, Papa's Angels invites the reader into the heart of a family rocked by tragedy at Christmas. Along with her brothers and sisters - Hannah Rose, Alvin, Maude and John Neal - the keenly observant Becca watches as their father battles the crippling grief caused by his wife's recent death. Just when all appears lost, the Jenkins children, with the help of their wise and feisty \"Grammy,\" demonstrate to Papa the true meaning of Christmas and love.",
        "Category": "",
        "Publisher": "New World Library",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Mittens",
        "Authors": "By Newberry, Clare Turlay",
        "Description": "Richard achieves his lifelong desire to have a kitten, only to have it become lost.",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "A Christmas Treasury: Twelve Unforgettable Holiday Stories",
        "Authors": "By L. Frank Baum",
        "Description": "A collection for holiday reading includes one of Hans Christian Andersen's tales, a short story by O. Henry, and selections from humorous to inspirational by such authors as Katherine Paterson, Louisa May Alcott, and Truman Capote.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Bocaditos",
        "Authors": "By Hearon, Reed and Smith, Laurie (PHT)",
        "Description": "From acclaimed chef and cookbook author Reed Hearon comes this enticing book for the festive small foods or \"little bites\" of Mexico. Whether served as appetizers or in combination as a meal, these delicious dishes will bring an authentic Mexican accent to any table. Lavishly illustrated with full-color photos, and offering more than forty recipes, Bocaditos will bring home the true flavors of Mexico.",
        "Category": " Cooking , Regional & Ethnic , Mexican",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Complete Civil War: The Definitive Fact File of the Campaigns, Weapons, Tactics, Armies and Key Figures",
        "Authors": "By Philip Katcher",
        "Description": "",
        "Category": "",
        "Publisher": "Cassell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Vermeer",
        "Authors": "By Bonafoux, Pascal",
        "Description": "",
        "Category": "",
        "Publisher": "William S. Konecky Associates",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Rapunzel (Picture Puffin Books)",
        "Authors": "By Zelinsky, Paul O. (ILT) and Zelinsky, Paul O.",
        "Description": "Award winning author/adapter/illustrator Paul O. Zelinsky's Caldecott Medal Winning book! Perfect for readers of all fairy tales.\"A breathtaking interpretation gives the fairy tale new art-historical roots, with illustrations that daringly-and effectively-mimic the masters of Italian Renaissance painting.\"--Publishers WeeklyTrapped in a tower with no door, Rapunzel is allowed to see no one but the sorceress who has imprisoned her-until the day a young prince hears her singing to the forest birds. . . . The timeless tale of Rapunzel is vividly and magnificently brought to life through Paul O. Zelinsky's powerful sense of narrative and his stunning oil paintings.\"Simply put, this is a gorgeous book; it demonstrates respect for the traditions of painting and the fairy tale while at the same time adhering to a singular, wholly original, artistic vision.\" (The Horn Book, starred review)",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Sufism: The Alchemy of the Heart (Eastern Wisdom - The Little Wisdom Library)",
        "Authors": "By Waley, M. I.",
        "Description": "",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "The Nature of Chinese Character: Gifts from the Earth",
        "Authors": "By Aria, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Dracula (Bantam Classics)",
        "Authors": "By Stoker, Bram",
        "Description": "One of the most popular stories ever told, Dracula (1897) has been re-created for the stage and screen hundreds of times in the last century. Yet it is essentially a Victorian saga, an awesome tale of thrillingly bloodthirsty vampire whose nocturnal atrocities reflect the dark underside of a supremely moralistic age. Above all, Dracula is a quintessential story of suspense and horror, boasting one of the most terrifying characters in literature: centuries-old Count Dracula, whose diabolical passions prey upon the innocent, the helpless, the beautiful. Bram Stoker, who was also the manager of the famous actor Sir Henry Irving, wrote seventeen novels. Dracula remains his most celebrated and enduring work -- even today this Gothic masterpiece has lost none of the spine-tingling impact that makes it a classic of the genre.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Gathering Blue (Readers Circle)",
        "Authors": "By Lowry, Lois",
        "Description": "Lois Lowry’s Gathering Blue continues the quartet beginning with the quintessential dystopian novel, The Giver, followed by Messenger and Son.Kira, an orphan with a twisted leg, lives in a world where the weak are cast aside. She fears for her future until she is spared by the all-powerful Council of Guardians. Kira is a gifted weaver and is given a task that no other community member can do. While her talent keeps her alive and brings certain privileges, Kira soon realizes she is surrounded by many mysteries and secrets. No one must know of her plans to uncover the truth about her world and see what places exist beyond.",
        "Category": " Young Adult Fiction , Science Fiction , General",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Night Fall (A John Corey Novel, 3)",
        "Authors": "By DeMille, Nelson",
        "Description": "A John Corey Novel On a Long Island beach at dusk, Bob Mitchell and Janet Whitney conduct their illicit love affair in front of a video camera, set to record each steamy moment. Suddenly a terrible explosion lights up the sky. Grabbing the camera, the couple flees as approaching police cars speed toward the scene. Five years later, the crash of TWA Flight 800 has been attributed to a mechanical malfunction. But for John Corey and Kate Mayfield, both members of the elite Anti-terrorist Task Force, the case is not closed. Suspecting a cover-up at the highest levels and disobeying orders, they set out to find the one piece of evidence that will prove the truth about what really happened to Flight 800 - the videotape that shows a couple making love on the beach and the last moments of the doomed airliner.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Vision",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Twelve Keys to an Effective Church: The Leaders' Guide",
        "Authors": "By Callahan, Kennon L.",
        "Description": "",
        "Category": " Religion , Christian Church , Administration",
        "Publisher": "Jossey-Bass Inc Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Close to Shore: The Terrifying Shark Attacks of 1916",
        "Authors": "By Capuzzo, Michael",
        "Description": "Combining rich historical detail and a harrowing, pulse-pounding narrative, Close   to Shore brilliantly re-creates the summer of 1916, when a rogue Great White shark   attacked swimmers along the New Jersey shore, triggering mass hysteria and launching   the most extensive shark hunt in history. In July 1916 a lone Great White left its usual deep-ocean habitat and headed in   the direction of the New Jersey shoreline.   There, near the towns of Beach Haven   and Spring Lake--and, incredibly, a farming community eleven miles inland--the most   ferocious and unpredictable of predators began a deadly rampage: the first shark   attacks on swimmers in U.S. history.    Capuzzo interweaves a vivid portrait of the era and meticulously drawn characters   with chilling accounts of the shark's five attacks and the frenzied hunt that ensued. From the unnerving inevitability of the first attack   on the esteemed son of a prosperous Philadelphia physician to the spine-tingling   moment when a farm boy swimming in Matawan Creek feels the sandpaper-like skin of   the passing shark, Close to Shore is an undeniably gripping saga. Heightening the   drama are stories of the resulting panic in the citizenry, press and politicians,   and of colorful personalities such as Herman Oelrichs, a flamboyant millionaire who   made a bet that a shark was no match for a man (and set out to prove it); Museum   of Natural History ichthyologist John Treadwell Nichols, faced with the challenge   of stopping a mythic sea creature about which little was known; and, most memorable,   the rogue Great White itself moving through a world that couldn't conceive of either   its destructive power or its moral right to destroy. Scrupulously researched and   superbly written, Close to Shore brings to life a breathtaking, pivotal moment in   American history. Masterfully written and suffused with fascinating period detail   and insights into the science and behavior of sharks, Close to Shore recounts a breathtaking,   pivotal moment in American history with startling immediacy.",
        "Category": " Nature , Animals , Marine Life",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "American Idols: The Worship of the American Dream",
        "Authors": "By McDowell, Josh",
        "Description": "Although not inherently corrupt, the American Idol television program has magnified a culture preoccupied with fleeting fame and image overload. Feeding off that frenzy, American Idols takes a necessary look at the false gods in modern society. The golden calf of Bible times may be gone, but in its place today are enslavements to consumerism, celebrity, sexual freedom, easy religion, and more. This timely book helps readers realize and overcome their own idolatries.",
        "Category": " Performing Arts , Television , General",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "On Blue Falls Pond",
        "Authors": "By Crandall, Susan",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Opal (Dakotah Treasures #3)",
        "Authors": "By Lauraine Snelling",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "My Daddy And Me",
        "Authors": "By Sklansky, Amy E. and Hoyt, Ard (ILT)",
        "Description": "Just like wind and kites, a pail and a shovel, and the moon and stars -- whatever the season, Daddy and child go together in this sweet Father's Day paperback for young readers!We go togetherLike honey and bees,like peanut butter and jelly,like hide and seek.Whatever the weather,We go together.Read along as daddies and children play through the seasons in this simple story of love between parent and child. Drawings of all different kinds of fathers and children accompany Amy Sklansky's darling text.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Q Is for Duck: An Alphabet Guessing Game",
        "Authors": "By Elting, Mary",
        "Description": "Why does A stand for zoo, B for dog, and C for hen? The young reader finds out in this amusing game based on the alphabet.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Sandpiper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Bunny My Honey",
        "Authors": "By Jeram, Anita",
        "Description": "When Bunny gets lost and can't find his mother, he fears that Mummy and his friends may not be able to find him to take him home. By the illustrator of Guess How Much I Love You.",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Candlewick Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Peter Rabbit and His Friends Word Book",
        "Authors": "By Potter, Beatrix",
        "Description": "",
        "Category": "",
        "Publisher": "Chatham River Press / Ottenheimer / Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Celebrating Snow Globes (Collectibles)",
        "Authors": "By Chertoff, Nina and Kahn, Susan",
        "Description": "All it takes is a shake of the wrist to make the flakes  fall on Santa’s sleigh, Elvis’s hips, or the Statue of Liberty’s torch?creating a miniature world in each snow globe. From the ornate to the political, from children’s characters to American cities and personalities, these colorful images will propel collectors back to their curio cabinets to watch a dazzling display and set the rest of us out on a lovely nostalgic trip. Each picture comes with a description that gives the history of the piece?going back to the time when snow globes weren’t just tourist souvenirs but depictions of the most romantic sites on earth. Find out where they were first created, which companies specialized in making them, and why they’re so irresistible.",
        "Category": " Antiques & Collectibles , Figurines",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Big Dog... Little Dog (A Bedtime Story)",
        "Authors": "By Eastman, P. D.",
        "Description": "Illus. in full color. \"Two dogs who are opposite in every way are also the best of friends. The bold, colorful drawings are appealing and emphasize the concepts of size, color, and opposites.\"--Booklist.",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1973"
        }
    },
    {
        "Title": "Strong Mothers, Strong Sons: Raising the Next Generation of Men",
        "Authors": "By Caron, Ann F.",
        "Description": "A practical, informative guide for mothers on raising secure, healthy sons.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "John F. Kennedy: The Presidential Portfolio: History as Told Through the John F. Kennedy Library and Museum",
        "Authors": "By Kenney, Charles",
        "Description": "PublicAffairs is proud to introduce the first volume in our new Presidential Library Series, edited by renowned presidential historian Michael Beschloss.  Each year, thousands of people visit the John F. Kennedy Library and Museum to experience the \"thousand days\" of his presidency and learn what it took to be the leader of the most powerful nation on earth. Now readers can revisit the tenure of one of America's most mythic figures and most controversial presidents through this elegantly designed book and portfolio.  John F. Kennedy: The Presidential Portfolio is a unique time capsule that captures the essence, style, and excitement of the Kennedy presidency. Readers will travel back in time to the breathtakingly close election; the drama of the Cuban Missile Crisis; the careful political maneuvering at the start of the civil rights movement; the Bay of Pigs fiasco; and the inspiring creation of the Peace Corps. Key figures, such as First Lady Jacqueline Bouvier Kennedy and Attorney General Robert F. Kennedy, are vividly profiled. And bound to each book is a 90-minute CD recording of never-before-heard Kennedy phone conversations and dictations.   For Kennedy Library visitors, fans of Camelot, or anyone interested in American history, this historically authoritative examination of the man, his era, and an institution is an essential reference volume and a beautiful gift.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "High Crimes",
        "Authors": "By Finder, Joseph",
        "Description": "HONOR YOUR WIFE.SERVE YOUR COUNTRY.CONCEAL THE TRUTH.Do you ever really know the person you married?Claire Heller Chapman, a Harvard Law School professor and a high-powered attorney, has just attained a national reputation for her work on several high-profile cases. Her second husband, Tom Chapman, is a successful moneymanager who adores Claire and her six-year-old daughter. They live in a beautiful house and lead a glamorous and happy life.Then a random burglary turns their world upside down. A routine police investigation reveals that Tom is not who he says he is. He never attended the college he said he did. He once had a different name. He once was, Claire learns, a secret operative for the U.S. government. When he is suddenly arrested and put on trial for a crime he insists he didn't commit -- an unspeakable atrocity carried out thirteen years ago -- she puts her reputation on the line to defend him. The case is tried in a top-secret court-martial conducted by the Pentagon, in which all the evidence is classified, and the rules are unlike any Claire has ever known.She struggles to work within the system, passionately trying to believe in Tom's innocence, even as all the evidence seems to indicate that her husband is a cold-blooded murderer.MURDER IN THE LINE OF DUTYA MARRIAGE IN THE LINE OF FIREA Main Selection of the Book-of-the-Month Club",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Beautiful Washington D.C.",
        "Authors": "By Curran, William C.",
        "Description": "",
        "Category": "",
        "Publisher": "Beautiful Amer Pub Co",
        "Price Starting With ($)": "5.93",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "Treasures of the Smithsonian",
        "Authors": "By Park, Edwards",
        "Description": "A look at the diverse collections of the Smithsonian Institution and its associated museums documents its great treasures from the fields of art, science, technology, history, crafts, natural history, and culture",
        "Category": " Business & Economics , General",
        "Publisher": "Smithsonian Inst Pr",
        "Price Starting With ($)": "10.61",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "Christmas Ideals 2006 (IDEALS CHRISTMAS)",
        "Authors": "By Lloyd, Marjorie",
        "Description": "",
        "Category": " Religion , Holidays , General",
        "Publisher": "Ideals Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "A Singular Country",
        "Authors": "By Donleavy, J. P",
        "Description": "A personal view of Ireland, told in the vernacular of the Irishman, recreates the vivid range of Ireland's people, including small farmers, landed aristocrats, Anglo-English, priests, politicians, saints, and scholars",
        "Category": " History , United States , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Dangerous Waters",
        "Authors": "By Eidson, Bill",
        "Description": "One moment changes Riley Burke's life forever when he tries to help a young boy attacked on a loading dock and is drawn into a world of fear, drugs, destruction, and betrayal",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "The Mighty Chieftains (American Indians)",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Discusses the varying role of the chief in Native American cultures, and profiles notable leaders from Metacomet (\"King Philip\") through the nineteenth century, including the Apache chiefs, Chief Joseph, and Plenty Coups",
        "Category": " History , General",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Red, White, and Blue: The Story of the American Flag (Penguin Young Readers, Level 3)",
        "Authors": "By Herman, John and Roraback, Robin (ILT)",
        "Description": "Some people call the American flag Stars and Stripes or Old Glory. But did you know that it hasn't always looked the same? Read this Level 3 reader, and you will find out all about the history of the American flag.",
        "Category": " Juvenile Nonfiction , Readers , Intermediate",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Jewish Washington: Scrapbook of an American Community",
        "Authors": "By Laura Cohen Apelbaum",
        "Description": "",
        "Category": "",
        "Publisher": "Washington Book Distributors",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Great ideas in psychotherapy (v. 4)",
        "Authors": "By Chessick, Richard D.",
        "Description": "",
        "Category": "",
        "Publisher": "J. Aronson",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Dogs of War",
        "Authors": "By Forsyth, Frederick",
        "Description": "A British mining magnate hires a mercenary to carry out his plan to overthrow a West African dictator",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "The Viking Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1974"
        }
    },
    {
        "Title": "The Story of Thanksgiving",
        "Authors": "By Venturi-Pickett, Stacy (ILT) and Skarmeas, Nancy J.",
        "Description": "Recounts the story of the first Thanksgiving, including the journey of the Pilgrims on the Mayflower and the assistance offered to them by Squanto and the other Indians",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Thanksgiving",
        "Publisher": "WorthyKids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "A Maze of Stars",
        "Authors": "By Brunner, John",
        "Description": "After the Ship finishes its mission of planting more than six hundred planets with human stock, it takes on a human consciousness and wanders aimlessly through space witnessing the tragedies it has created. Reprint.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Case of the Hardboiled Dicks (Max Slade Mystery)",
        "Authors": "By Blumenthal, John",
        "Description": "A parody of detective stories features Mac Slade as he searches for the missing brother of a Greenwich Village socialite, only to be accused of murder",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "The Prince (Signet Classics)",
        "Authors": "By Machiavelli, Niccolo",
        "Description": "The classic handbook of statecraft written four centuries ago by an Italian nobleman recommends guile and craftiness to attain and maintain political power. Reprint. BAKER & TAYLOR Bks",
        "Category": " Philosophy , Political",
        "Publisher": "Signet Classics",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Murder of Richard III",
        "Authors": "By Peters, Elizabeth",
        "Description": "Jacqueline Kirby is fascinated by the assembled guests at an English country mansion who have assumed the dress and lifestyle of Richard III's court, until someone decides to recreate his historic crimes",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "All Things Are Possible: Pass the Word",
        "Authors": "By Ohrbach, Barbara Milo",
        "Description": "Barbara Milo Ohrbach, best-selling author of A Token of Friendship, celebrates optimism with inspiring, motivating quotations in an inviting new format and at an irresistible low price. This is the perfect bedside companion, and a thoughtful present for a friend facing an important challenge or a young person just starting out in life.",
        "Category": " Religion , Faith",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "A Poet to His Beloved: The Early Love Poems of William Butler Yeats",
        "Authors": "By Yeats, W. B. and Eberhart, Richard",
        "Description": "As a young man, William Butler Yeats was deeply affected by the idea of romantic love, or, as he called it, \"the old high way of love.\" Characteristically, much of his early poetry that which was written prior to 1910, is poetry that belongs to courtship.When Yeats was twenty-three years old, he met and fell in love with the beautiful Irish nationalist, Maud Gonne. Although she repeatedly refused to marry Yeats, Maud would become the object of his passion and his poetry. The emotional power in many of Yeats' early poems is shaped by the one-sidedness of his affair with Maud, but the poems themselves remain hopeful and bitter-sweet, pure in their language and attitudes about love.The forty-one poems collected in A Poet to his Beloved represent some of Yeats's most evocative and passionate early love poems. These versed are simple, lyrical, and often dreamy, and they speak knowingly of innocence and beauty, passion and desire, devotion and the fear of rejection.",
        "Category": " Poetry , European , English, Irish, Scottish, Welsh",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Introduction to Oriental Mythology",
        "Authors": "By Clio Whittaker",
        "Description": "",
        "Category": "",
        "Publisher": "Grange Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Love Poems by Women: An Anthology of Poetry from Around the World and Through the Ages",
        "Authors": "By Mulford, Wendy and Russell, Sandi (EDT)",
        "Description": "For over 2,000 years women have been writing love poetry. Here is the first anthology of love poems written only by women. Poets from all ages and all parts of the world, expressing love not only for their male and female lovers, but for parents, children, friends, for art, God, nature, and homeland, are collected here, and include the works of: Sappho, Emily Dickenson, Ono no Komachi, Shadab Vajdi, Alice Walker, Sor Juana Ines de la Cruz, and many more.",
        "Category": " Poetry , Subjects & Themes , Inspirational & Religious",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "How to Survive Being Married to a Catholic: A Frank and Honest Guide to Catholic Attitudes, Beliefs, and Practices",
        "Authors": "By Henesy, Michael and Gallagher, Rosemary",
        "Description": "How to Survive Being Married to a Catholic uses a lively cartoon format to illustrate and explain the central beliefs of Catholics. You'll find answers to more than eighty of the questions most commonly asked about Catholicism, plus a glossary of terms.",
        "Category": " Humor , General",
        "Publisher": "Liguori Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Great Pumpkin Strikes Again! (Peanuts)",
        "Authors": "By Fontes, Justine, Fontes, Ron, Schulz, Charles M., and Brannon, Tom (ART)",
        "Description": "Will the Great Pumpkin ever visit the Peanuts gang? Once again, Linus holds out hope that his Halloween hero will choose his pumpkin patch to visit. Lucy, Snoopy, Charlie Brown, and even Sally think he's wasting his time. But when Peppermint Patty hears that the Great Pumpkin brings presents to children -- and possibly even new baseball gloves -- the Halloween hilarity begins!",
        "Category": " Juvenile Nonfiction , Humor , Comic Strips & Cartoons",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Pumpkin Chic: Decorating With Pumpkins and Gourds",
        "Authors": "By Caldwell, Mary, McCaul, Andrew (ILT), and Hunter, Lauren (ILT)",
        "Description": "Presents an array of projects that use pumpkins, squash, and gourds for autumn decorations throughout the home.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "The Pumpkin Patch: Ready-to-Read Level 1 (Robin Hill School)",
        "Authors": "By Gordon, Mike (ILT) and McNamara, Margaret",
        "Description": "Level 1: Starting to Read  &#149; Simple stories  &#149; Increased vocabulary  &#149; Longer sentences  Mrs. Connor's first-grade class is going on a field trip! They're headed to the pumpkin patch to pick out pumpkins. Katie dreams of finding the perfect pumpkin. But the one she chooses isn't perfect at all. It's too small! But then her father shows her that wonderful things often come in small packages.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Once a Mouse...",
        "Authors": "By Brown, Marcia",
        "Description": "Marcia Brown retells an Indian fable from the Hitopadesa in this Caldecott Medal–winning tale of a mouse who becomes a tiger.When a small mouse’s life is threatened by large jungle predators, a kindly hermit uses magic to change him into a cat, a dog, and a majestic tiger. But the proud tiger must suffer the consequences when he becomes ungrateful and forgets his humble origins. Marcia Brown’s magical woodcuts bring this Indian fable to life with the mastery that won her a second Caldecott Medal.",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Murder, My Deer (Kate Jasper Mysteries)",
        "Authors": "By Girdner, Jaqueline",
        "Description": "In her eleventh action-packed mystery, newly married Kate Jasper is forced to put her honeymoon on hold when she finds herself targeted by a radical group of deer supporters and must track down a killer before it is too late. Reprint.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Calculus and Its Applications (9th Edition)",
        "Authors": "By Schneider, David I., Goldstein, Larry Joel, and Lay, David C.",
        "Description": "This extremely readable, highly regarded, and widely adopted text present innovative ways for applying calculus to real-world situations in the business, economics, life science, and social science disciplines. The text's straightforward, engaging approach fosters the growth of both mathematical maturity and an appreciation for the usefulness of mathematics. The authors' tried and true formula ? pairing substantial amounts of graphical analysis and informal geometric proofs with an abundance of hands-on exercizes ? has proven to be tremendously successful.  Functions, derivatives, applications of the derivative, techniques of differentiations, exponential and natural logarithm functions, definite integral, variables, trigonometric functions, integration, differential equations, Taylor polynomials and probability.  For individuals interested in an introduction to calculus applications.",
        "Category": " Mathematics , Calculus",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Knots",
        "Authors": "By Farah, Nuruddin",
        "Description": "A new novel from one of the world's great writers-an extraordinary work set in Mogadiscio, Somalia-that both breaks new ground and brings him back to his literary roots.  A strong, self-reliant woman who was born in Somalia but brought up in North America, Cambara returns to Mogadiscio to escape a failed marriage and an overweening mother. Her journey back to her native home is a desperate attempt to find herself on her own terms-however ironically, in a country where women are expected to wear veils. And she has given herself a mission to reclaim her family's home from the warlord who has taken it as his own.  Cambara finds emotional refuge and practical support with a group of Somali women activists working to broker peace in a country that has been savagely riven by its drug-addled, power-hungry men. Farah's novels have been famous for their unique African feminism since his debut, From a Crooked Rib (just reissued by Penguin); Knots represents his most powerful return to that legacy.  Knots also presents a penetrating portrayal of Somalia's capital city-a city that's changed from the city Westerners saw on CNN and in 'Black Hawk Down,' transformed into a state of violent anarchy and psychological disrepair that has never been more important to understand. An especially intimate portrait of Mogadiscio, it's informed by Farah's own recent efforts to reclaim his family's property there, as well as his experiences trying to negotiate peace among the city's warlords.  Now more than ever, Farah's deeply wise and worldly inside look at the Muslim world is valuable and necessary.",
        "Category": " Fiction , Political",
        "Publisher": "Riverhead Hardcover",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "The New Complete Coffee Book: A Gourmet Guide to Buying, Brewing, and Cooking",
        "Authors": "By Perry, Sara",
        "Description": "Now with a fresh new cover, the New Complete Coffee Book is filled to the brim on the worlds favorite beverage. Covering the latest in the coffee craze, it includes dozens of recipes for every coffee drink imaginable, from the sternly efficient Espresso (the rocket fuel of coffees) to the indulgent Cappuccino Borgia Milkshake. Author Sara Perry gives us the 411 on coffee history, production, and lore. If that werent enough, she adds 40 recipes for delicious, internationally inspired treats (both sweets and savories) using coffee as a main ingredient. Paired with smart-looking photographs, this is a handsome exploration of a precious commodity and the hundreds of ways to enjoy it.",
        "Category": " Cooking , Beverages , Coffee & Tea",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Tender at the Bone: Growing Up at the Table",
        "Authors": "By Reichl, Ruth",
        "Description": "At an early age, Ruth Reichl discovered that \"food could be a way of making sense of the world. . . . If you watched people as they ate, you could find out who they were.\" Her deliciously crafted memoir, Tender at the Bone, is the story of a life determined, enhanced, and defined in equal measure by a passion for food, unforgettable people, and the love of tales well told.  Beginning with Reichl's mother, the notorious food-poisoner known as the Queen of Mold, Reichl introduces us to the fascinating characters who shaped her world and her tastes, from the gourmand Monsieur du Croix, who served Reichl her first soufflé, to those at her politically correct table in Berkeley who championed the organic food revolution in the 1970s.  Spiced with Reichl's infectious humor and sprinkled with her favorite recipes, Tender at the Bone is a witty and compelling chronicle of a culinary sensualist's coming-of-age.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Broadway",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Jesus I Never Knew",
        "Authors": "By Yancey, Philip",
        "Description": "What happens when a respected Christian journalist decides to put his preconceptions aside and take a long look at the Jesus described in the Gospels? How does the Jesus of the New Testament compare to the ''new, rediscovered' Jesus -- or even the Jesus we think we know so well? Best-selling author Phillip Yancey says, 'The Jesus I got to know in writing this book is very different from the Jesus I learned about in Sunday school. In some ways he is more comforting; in some ways more terrifying.' Yancey offers a new and different perspective on the life of Christ and his work -- his teaching, his miracles, his death and resurrection -- and ultimately, who he was and why he came. Relating the gospel events to the world we live in today, The Jesus I Never Knew gives a moving and refreshing portrait of the central figure of history. With a willingness to tackle difficult questions, Yancey looks at the radical words of this itinerant Jewish carpenter and asks whether we are taking him seriously enough in our own day and age. From the manger in Bethlehem to the cross in Jerusalem, Yancey presents a complex character who generates questions as well as answers; a disturbing and exhilarating Jesus who wants to radically transform your life and stretch your faith. The Jesus I Never Knew uncovers a Jesus who is brilliant, creative, challenging, fearless, compassionate, unpredictable, and ultimately satisfying. This honest book will help you discover a different Jesus from the flannelgraph Sunday school figure, the sweetly smiling Victorian Savior, and all the cultural cliches that have tamed Jesus and kept him in comfortable religious boxes. According to Yancey, 'No one who meets Jesus ever stays the same. In the end I found the process of writing this book to be a great act of faith-strengthening. Jesus has rocked my own preconceptions and has made me ask hard questions about why those of us who bear his name don't do a better job of following him.'",
        "Category": " Religion , Christian Life , Personal Growth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Locked in the Library!: A Marc Brown Arthur Chapter Book 6 (Marc Brown Arthur Chapter Books)",
        "Authors": "By Krensky, Stephen and Brown, Marc Tolon",
        "Description": "After Arthur calls Francine a marshmallow, she refuses to speak to him. Then Mr. Ratburn pairs them up for a homework project. They reluctantly go to the library for research-and find themselves locked in once the library closes. Will Arthur and Francine set aside their differences and work together to find a way out? In chapter-book format, for children who are ready to read on their own, this supenseful adventure will surely be a hit among Arthur fans.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Extreme Lo-Carb Meals On The Go: Fast And Fabulous Solutions To Get You Through The Day",
        "Authors": "By Long, Sharron",
        "Description": "Living the low-carb lifestyle doesn't have to be difficult. It's all about making smart choices. So how can you still enjoy lunch out with coworkers, stave off the afternoon carb cravings, and find the time to make low-carb meals that taste great? Extreme Lo-Carb Meals to Go offers dozens of tasty meal solutions and low-carb lifestyle tips that will get you through your hectic day.This practical cookbook provides you with answers to all the lifestyle challenges you face every day, including:Are there any smart high-protein breakfast options besides bacon and eggs?Should I eat low-carb energy bars?What's a quick, filling lunch I can bring to work?Is there a way to \"snack smart\" while low-carb dieting?What easy to prepare low-carb dinner options will the kids actually eat and enjoy?Featuring 150 fantastic make-ahead meals, such as Sausage and Cheese Muffins, Very Veggie Wraps, and Mocha Cheesecake, Extreme Lo-Carb Meals to Go is the perfect way for you to say hello to time - and goodbye to carbs!",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Complete Hoyle's Games (Wordsworth Reference)",
        "Authors": "By Hoyle, E.",
        "Description": "",
        "Category": " Games , General",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Parenting with Love and Laughter: Finding God in Family Life",
        "Authors": "By Jones, Jeffrey D.",
        "Description": "In this wise and witty book, author, youth expert, and practicing minister Jeffrey D. Jones brings to light the spiritual aspects of parenting that are often ignored by popular experts and gurus. Jones shows you how to attend to your own inner spiritual life and to the quality of your relationships within your family. By doing so we you re-envision parenting as a transformative, joyful and spiritual practice rather than merely a set of rules and regulations or tips and techniques.Parenting with Love and Laughter is a conversation about families and parenting that is filled with inspiration gleaned from scripture, reflections on Jeffrey D. Jones's own experience of family life, and wisdom he has gathered from years of service in the ministry. In addition, this warm and wonderful book features a bonus section at the end that provides simple designs and suggestions for group meeting-perfect for retreats, workshops, adult education classes, and parenting support groups. Use this blueprint for parenting to introduce love and laughter into your family life.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Ideals Mother's Day March, 1997 (Vol. 54, No.2)",
        "Authors": "By IDEAL'S PUBLICATIONS",
        "Description": "",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Ideals Publications Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Taste of France",
        "Authors": "By Freson, Robert",
        "Description": "A celebration of regional French cuisine includes one hundred recipes and a detailed account of the culinary traditions of twelve major regions",
        "Category": " Cooking , Regional & Ethnic , French",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "10.48",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Rand Mcnally Business Traveler's Road Atlas and Guide to Major Cities",
        "Authors": "By Rand McNally and Company",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally & Co.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Jamberry",
        "Authors": "By Degen, Bruce",
        "Description": "This bestselling classic features a berry-loving boy and an endearing rhyme-spouting bear. The fun wordplay and bright paintings with lots of details for young readers to explore make Jamberry a perennial favorite.A small boy and a big friendly bear embark on a berry-picking extravaganza, looking for blueberries, blackberries, and strawberries. Their fun adventure comes to a razzamatazz finale under a starberry sky. From author-illustrator Bruce Degen, Jamberry is perfect for sharing. \"With delightful, rich illustrations and zany wordplay, Jamberry is a must have book for any family with young children,\" according to Children's Books Guide.HatberryShoeberryIn my canoeberryUnder the bridgeAnd over the damLooking for berries...Berries for jam!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Classic Christianity: Life's Too Short to Miss the Real Thing",
        "Authors": "By George, Bob",
        "Description": "",
        "Category": "",
        "Publisher": "Harvest House Publishers, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Great Moments in Sex: Over 1,000 Eye-Opening Entries about the People, Gadgets, Literature, Songs, Movies, Advertisements, and Other Fascinating Facts, Follies, and Foibles in Sex",
        "Authors": "By Rilly, Cheryl",
        "Description": "Over  1,000 Eye-Opening Entries about the People, Gadgets, Literature, Songs, Movies, Advertisements, and Other Fascinating Facts, Follies, and Foibles in Sexual HistoryGet ready to enjoy a lively, funny, sometimes shocking, and always fascinating treatment of a subject you were just thinking about anyway!Great Moments in Sex is an entertaining romp through the history of sex--from ancient times to the era of Viagra and Monica Lewinsky -- complete with the gadgets, people, literature, songs, advertisements, movies, and events associated with all things sexual.At any given moment, any given person is more likely to be thinking about sex than about anything else. It makes us who we are and it determines what we do. It's the bane, the pain, the pleasure of our existence. If history has proved anything, it's that there's just no rational way to deal with sex--and this book is a fun and fascinating review of the absurd, amazing, bewildering, frightening, and altogether irrational ways we have dealt with it throughout time. Great Moments in Sex chronicles the whole libidinous, lascivious, and just plain loony story: the tools we've used, the laws we've made, the so-called expert advice from Aristotle to The Joy of Sex, the attempts to repress sex, and the infinitely varied ways it has popped up anyway.",
        "Category": " Humor , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Fish Book (Look-Look)",
        "Authors": "By Angelfish, Christopher and Veno, Joseph (ILT)",
        "Description": "Introduces some of the many different kinds of creatures that live in the sea, including fish, mammals, crustaceans, and other invertebrates, and describes how they differ from each other",
        "Category": " Juvenile Fiction , Animals , Marine Life",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Christmas With God (Quiet Moments)",
        "Authors": "By Honor Books",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Season's Greetings",
        "Authors": "By Quillin, Rachel",
        "Description": "",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "A Dictionary of Twentieth-Century Art (Oxford Quick Reference)",
        "Authors": "By Chilvers, Ian",
        "Description": "From Renoir and Picasso to Red Grooms and Guerrilla Girls, this is the most useful reference work on twentieth-century art available in a single volume. Compiled by Ian Chilvers, the editor of The Oxford Dictionary of Art, it is both authoritative and accessible, with generous use of anecdotes and clear explanations of many potentially confusing terms.  Providing broad coverage of painting, sculpture, drawing, and the applied arts, the Dictionary has clear, scholarly entries on the important movements and styles of the twentieth century, including Dada, Cubism, Surrealism, Art Deco, Abstract Expressionism, Pop Art, Body and Performance art, and Neo Expressionism. In addition, it provides entries on art schools and galleries, exhibitions and prizes, terms and techniques. Extensive biographies feature not only artists but also collectors, critics, dealers, and patrons. And though the Dictionary concentrates on the great names, it is not confined to the mainstream of modern art, and features both artists working in a more popular tradition as well as interesting peripheral figures. This up to date and informative guide is an essential reference for anyone interested in modern art.",
        "Category": " Art , Reference",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Choosing Happiness: Keys to a Joyful Life",
        "Authors": "By Stoddard, Alexandra",
        "Description": "Based on her more than thirty years as a noted thinker and speaker on personal contentment, Alexandra Stoddard shares what she has learned about the small but significant changes you can make to be happier day by day.A fun first step: quickly write down ten words that define who you are—perhaps beaches, family, food, home—and what else? This and dozens of other inventive ideas will help you pursue happiness wisely and well.In challenging times, it is easy to question whether happiness is a choice. Alexandra Stoddard affirms that not only is it possible to choose happiness but that happiness is the best choice we can make. It is the \"first principle\" of life that unites humankind because it is what we all desire.Happiness lies in the passions we pursue and in the pressures we decline. It is in knowing how to work and when to play. It is in the treasured objects we keep nearby and in the ordinary moments we elevate into small celebrations. It is in the note we write to a friend and the kindness we show a stranger. Happiness is what you make it, where you make it. Happiness is our best choice.",
        "Category": " Body, Mind & Spirit , Healing , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Cunning Man",
        "Authors": "By Davies, Robertson",
        "Description": "“A delight, a novel that travels 70 years of history on its own swift feet, a book of love and wisdom, loss and irony”—The Boston Sunday Globe When Father Hobbes mysteriously dies at the high alter on Good Friday, Dr. Jonathan Hullah – whose holistic work has earned him the label “Cunning Man” (for the wizard of folk tradition) – wants to know why. The physician-cum-diagnostician’s search for answers compels him to look back over his own long life. He conjures vivid memories of the dazzling, intellectual high jinks and compassionate philosophies of himself and his circle, including flamboyant, mystical curate Charlie Iredale; cynical, quixotic professor Brocky Gilmartin; outrageous banker Darcy Dwyer; and jocular, muscular artist Pansy Todhunter. In compelling and hilarious scenes from the divine comedy of life, The Cunning Man reveals profound truth about being human.  The crowning achievement of “one of the most learned, amusing… accomplished novelists of our time and… of our century.” – The New York Times Book Review",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "The Right Mind: Making Sense of the Hemispheres",
        "Authors": "By Ornstein, Robert",
        "Description": "The psychologist and author of the best-seller The Psychology of Consciousness discusses the different capacities of the right and left sides of the brain, shedding new light on the way the brain constructs a coherent life. 50,000 first printing. Tour.",
        "Category": " Psychology , Physiological Psychology",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "No Turning Back: The Life and Death of Animal Species",
        "Authors": "By Ellis, Richard and Ellis, Richard (ILT)",
        "Description": "A noted naturalist's fascinating inquiry into the life and death of animal species Just about every species that has ever lived on earth is extinct. The trilobites, which dominated the ocean floors for 300 million years, are gone. The last of the dinosaurs was wiped out by a Mount Everest-sized meteorite that slammed into the earth 65 million years ago. The great flying reptiles are gone, and so are the marine reptiles, some of them larger than a humpback whale. Before humans crossed the Bering land bridge some 15,000 years ago, North America was populated by mastodons, mammoths, saber-toothed tigers, and cave bears. They too are MIA. Passenger pigeons once flew over North America in flocks that numbered in the billions; the last one died in 1914. In this book you will meet creatures that were driven to extinction even more recently, as well as some that were brought back from the brink. You will even encounter animals not known to exist until recently -- an antidote to extinction.",
        "Category": " Nature , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Terrorist Hunter: The Extraordinary Story of a Woman Who Went Undercover to Infiltrate the Radical Islamic Groups Operating in America",
        "Authors": "By Anonymous",
        "Description": "The remarkable memoir of an Iraqi woman who escaped from captivity in Baghdad and became America's leading undercover counter-terrorist expert.   Here is the story of an anonymous counter-terrorism expert, a young woman, who, in disguise, has penetrated front groups of anti-American terrorist organizations operating in this country. In this edge-of-the-seat memoir, she chronicles her escape from Iraq via Iran to Israel, following a great tragedy that befell her family at the hands of Saddam Hussein. She also details how she became involved in intelligence gathering for the United States, her adoptive country, while working for an antiterrorism group. With her unique insights into how terrorist groups veil their true operations by various means, she was able to infiltrate and identify dangerous terrorist organizations and entities working undetected in the United States. Terrorist Hunter provides fascinating and shocking information on how federal agencies, chiefly the FBI and the State Depart-ment, repeatedly ignored or mishandled important information she provided. She reveals her role in exposing terrorist supporters who the White House considered to be friends, in preventing the government from funding terrorist activities, and in the deportation of terrorists and their supporters. She also reveals how she discovered a billion-dollar scheme that rich Saudi Arabians set up to filter money to terrorist groups, through charities and businesses in the United States -- information that the FBI sat on for years, until after 9-11.",
        "Category": " True Crime , Espionage",
        "Publisher": "Ecco",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Creative Window Treatments (Forty-Five Styles Shown Step-by-Step) by The Home Design Institute (1992-05-03)",
        "Authors": "By The Home Design Institute",
        "Description": "",
        "Category": " House & Home , Decorating & Furnishings",
        "Publisher": "Cy DeCosse Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Beginning Math: Grade Pk-k (Learn on the Go)",
        "Authors": "By Not Available (NA)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Mathematics , General",
        "Publisher": "Learning Horizons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Da Wild, Da Crazy, Da Vinci #14 (Time Warp Trio)",
        "Authors": "By Scieszka, Jon and McCauley, Adam (ILT)",
        "Description": "You probably know that Leonardo da Vinci painted the Mona Lisa. Did you know that he also invented an early version of a helicopter and a tank, and that he planned to execute the Time Warp Trio for spying on his inventions? Sam's bright idea to look for the inventor of the Book takes the guys to 15th century Italy to meet up with Leonardo. But it's going to take at least three more bright ideas, two magic tricks, and one great invention to get them out of trouble and safely back home. If not, it could be a lifetime of Italian army toilet-cleaning detail for Joe, Sam, and Fred.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Viking Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Midnight Cab",
        "Authors": "By Nichol, James W.",
        "Description": "A terrified three-year-old boy is found clinging to a wire fence at the side of a country road. His mother had whispered to him, \"Never let go,\" then vanished. The only clue found by authorities as to the child's identity is a photograph of two summering teenage girls and a letter presumably written from one to the other.Sixteen years later, Walker Devereaux is in Toronto to discover the truth about his biological mother, of whom he has a dim memory. Working as an after-hours cabdriver, Walker befriends Krista, a demanding, pretty, wheelchair-bound night dispatcher. Krista and Walker become fast friends, and she can't help but involve herself with Walker's quest to understand his shrouded identity. Soon enough, though, their off-hours sleuthing turns perilous. Walker and Krista's trajectory through darkened Toronto streets and the eerie, densely wooded countryside veers this duo ever closer to that of another abandoned boy who has transformed himself into the embodiment of his own desperate, violent, and sinister pathologies.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Canongate U.S.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Superior Person's Third Book of Well-Bred Words",
        "Authors": "By Bowler, Peter and Corrigan, Dennis (ILT)",
        "Description": "Gathers a wide range of definitions for precise but neglected words chosen to enrich one's vocabulary and insult one's adversaries.",
        "Category": " Language Arts & Disciplines , Spelling & Vocabulary",
        "Publisher": "David R Godine",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Some Like It Hot (A-List)",
        "Authors": "By Dean, Zoey",
        "Description": "It's prom season, and no town does prom like Tinsel Town. Ben is back for the summer -- just in time to be Anna's prom date. But his family has a house guest who's so hot, she's bound to burn up their perfect plans. Adam finds out a scandalous secret that threatens to tear Cammie's world to pieces. Sam agrees to take Parker to the prom and they end up doing a lot more than dancing. What happens when Sam's romance-obsessed boyfriend Eduardo flies in from Paris to surprise Sam? This prom is sure to be glamorous, and occasionally downright shocking! It's just the kind of night the A-List crew will never forget.",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Poppy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Maggie: A Girl of the Streets (Signet Classics)",
        "Authors": "By Crane, Stephen",
        "Description": "A collection of short stories includes the tale of the short and brutal life of a hopeful young woman who, ignored and abused by her family, trusts a hustler who promises to protect her, but only hastens her downfall",
        "Category": " Fiction , Classics",
        "Publisher": "Signet Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    }
]