[
    {
        "Title": "Light Menus",
        "Authors": "By Mariano, Louise",
        "Description": "",
        "Category": "",
        "Publisher": "Landoll's; Ideal's Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Navigation Rules: International-Inland",
        "Authors": "By Transportation Dept., Coast Guard, S/N 050-012-00407-2",
        "Description": "Official publication contains International Regulations for Preventing Collisions at Sea, 1972 (COLREGS), incorporating amendments, which became effective on November 19, 1989 and November 1995. Also includes the Inland Navigation Rules that have been in effect for all inland waters, including the Great Lakes, since Mar. 1, 1983. Provides all revisions through January 1, 1999. International rules and inland rules for similar subjects are printed side-by-side for comparison.",
        "Category": " Business & Economics , Reference",
        "Publisher": "United States Department of Transportation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Barbara Kraus' Calories and Carbohydrates: (15th Edition)",
        "Authors": "By Kraus, Barbara",
        "Description": "Completely revised and updated to contain the latest information, a valuable nutritional handbook lists the calorie and carbohydrate levels of more than 8,500 brand-name and basic foods, including fruits and vegetables, calibrated according to portion and cross-referenced. Original.",
        "Category": " Health & Fitness , Diet & Nutrition , Food Content Guides",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Ubiquitous Pig",
        "Authors": "By Jonas, Susan and Nissenson, Marilyn",
        "Description": "Mention the word pig and people smile. They picture pink skin, a corkscrew tall, and the adorable snout of a piglet. They think of Miss Piggy, Wilbur, and Porky Pig. Pigs have inspired writers from Ovid to Mother Goose and artists from ancient Herculaneum to contemporary Hollywood. Still, people can't decide what to make of pigs. Pigs are so compelling, so mysterious, so contradictory - finicky yet fat, massive yet dainty, stolid yet smart. Humans, uneasy about their role in the life and death of pigs, make images of them that reveal complex feelings of attraction, revulsion, sentimentality, and guilt.In The Ubiquitous Pig, authors Marilyn Nissenson and Susan Jonas take an affectionate look at the many-sided relationship between humans and pigs and the art people have made to reflect that bond. Presented in 165 illustrations, 90 of them in color, are some of the most beguiling, dignified, haunting, cuddly, and ferocious images of pigs from antiquity to the present, along with excerpts from writings about them. Sprinkled throughout are sidebars, aphorisms, and little-known facts about these fascinating but often misunderstood creatures.The relationship between people and pigs has been noted by medical researchers, political cartoonists, and literary figures, including G. K. Chesterton, Thomas Hardy, George Orwell, Charles Lamb, Beatrix Potter, Lewis Carroll, Dylan Thomas, E. B. White, and Harry Truman, who said, \"No man should be allowed to be president who does not understand hogs.\" Representations of pigs are among the earliest works of art, and they have remained a compelling subject for artists as diverse as Hieronymous Bosch, Faberge, Eadweard Muybridge, Winslow Homer, Currier and Ives, Alexander Calder, Henri Cartier-Bresson, Charles Addams, Maurice Sendak, and William Steig.The authors provide a lively introduction, filled with anecdotes and history. A brief bibliography for the hard-core pig fan and an index round out this charming volume.",
        "Category": " Fiction , General",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Dictionary of foreign terms",
        "Authors": "By Mawson, Christopher Orlando Sylvester",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Y. Crowell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Collective Knowledge (Business Skills)",
        "Authors": "By Marcus, Robert and Watters, Beverly",
        "Description": "Advances in communications and computing, the advent of the Internet, and the proliferation of high-speed computer networks and servers are producing unprecedented improvements in business collaboration and productivity. Knowledge Workers have become an indispensable resource—the productivity engine of the 21st-century—by using technology to streamline the capture and delivery of organizational knowledge to fellow workers worldwide. COLLECTIVE KNOWLEDGE describes this new Knowledge Workplace, where intellectual capital is a key managed asset and where Web-based collaborative team services, portals for information management and discovery, and broadcast delivery of information to every desktop all help enable constant productivity gains.THE HISTORY OF INFORMATION MANAGEMENT: Consider the history of knowledge management and propagation, from cuneiform to computing, and the rise of the next-generation intranet.THE EMERGENCE OF THE KNOWLEDGE WORKPLACE:  Read about how the confluence of work and next-generation intranet technology has produced a dynamic productivity ecosystem.THE COMPELLING BUSINESS VALUE PROPOSITION: Discover how leading organizations are using intranets to increase productivity and reduce costs.INTRANET MANAGEMENT STRATEGIES: Obtain practical guidance for planning, developing, and managing next generation intranets—now and in the future.",
        "Category": " Computers , Internet , General",
        "Publisher": "Microsoft Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Converting Kate",
        "Authors": "By Weinheimer, Beckie",
        "Description": "Kate was raised in the Holy Divine Church?it influenced everything from her homeschooling to her handmade clothes. But ever since her unbelieving father?s death last year, she has suspected that there?s more to life than memorizing scripture. Taking advantage of their move to a new town, Kate?to her devout mother?s horror?quits Holy Divine. She joins the cross-country team, wears shorts to public school, and even tries a traditional Christian church. As she struggles to come to terms with her father?s death and her mother?s unquestioning beliefs, Kate discovers there?s a big difference between religion and faith?and that the two don?t always go hand in hand.",
        "Category": " Young Adult Fiction , Family , Parents",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Bettelheim: A Life And A Legacy",
        "Authors": "By Sutton, Nina and Sharp, David (TRN)",
        "Description": "Who was Bruno Bettelheim? The brilliant discoverer of a unique method of treating psychotic children, justly acclaimed the world over? Or the brutal and despotic bully who was denounced after his death by former students and patients?In her quest to understand this puzzling and powerful man, Nina Sutton spent five years tracing Bettelheim's footsteps from Vienna to Los Angeles, via Chicago, Basel, and Jerusalem. She interviewed students and colleagues, friends and enemies, and uncovered rare documents, including Bettelheim's letters from Buchenwald and Dachau.As the internationally famous director of the Orthogenic School in Chicago and the author of a dozen bestsellers on Nazism, child rearing, emotional disturbances, and fairy tales, Bettelheim was always surrounded by controversy. He was a Jew who rejected the inevitability of the Holocaust, a psychoanalyst who challenged the very notion of \"insanity,\" and a man who liked to shroud his life in mystery and sometimes outright lies.Most significantly, he was a therapist driven by an almost magical idea: that from an absolute evil, Nazism, could be drawn the salvation of deeply disturbed children. Sutton shows how Bettelheim discovered his life force in the concentration camp and then tried to use his own aggression as a lighting rod for the self-destructive anger and violence seething within the children in his care. Probing deep into his past and into the scandal that broke out after his suicide, she reveals how care and brutality, commitment to truth and a passion for fairy tales, could coexist in this exceptional man.",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Hamlet (Bantam Classic)",
        "Authors": "By Shakespeare, William and Bevington, David M.",
        "Description": "One of the greatest plays of all time, the compelling tragedy of the tormented young prince of Denmark continues to capture the imaginations of modern audiences worldwide. Confronted with evidence that his uncle murdered his father, and with his mother’s infidelity, Hamlet must find a means of reconciling his longing for oblivion with his duty as avenger. The ghost, Hamlet’s feigned madness, Ophelia’s death and burial, the play within a play, the “closet scene” in which Hamlet accuses his mother of complicity in murder, and breathtaking swordplay are just some of the elements that make Hamlet an enduring masterpiece of the theater.Each Edition Includes:• Comprehensive explanatory notes • Vivid introductions and the most up-to-date scholarship • Clear, modernized spelling and punctuation, enabling contemporary readers to understand the Elizabethan English• Completely updated, detailed bibliographies and performance histories • An interpretive essay on film adaptations of the play, along with an extensive filmography",
        "Category": " Drama , Shakespeare",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Mass Career Customization: Aligning the Workplace With Today's Nontraditional Workforce",
        "Authors": "By Benko, Cathleen and Weisberg, Anne",
        "Description": "Far-reaching changes in attitudes and family structures have been redefining the workforce for more than two decades&#151;yet the workplace has remained much the same.  During this time, many companies have learned that personalizing the customer experience is good for business. In Mass Career Customization, the authors argue convincingly to extend this popular and profitable concept to the workplace.This book is centered on the powerful insight that career options in today’s economy need to accommodate the rising and falling phases of employee engagement as it changes over time. The remarkable process unveiled in this book offers choices involving four important dimensions of career progression: role; pace; location and schedule; and workload.As the working population shrinks, maintaining industry advantage will depend largely on keeping employees engaged and connected. Mass career customization provides a framework for organizational adaptability that will do just that.",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "Harvard Business Review Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Mysterious Healing Secrets From Around The World",
        "Authors": "By Laign, Jeffrey",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International Limited",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Seals and Sea Lions of the World (Of the World Series)",
        "Authors": "By Bonner, Nigel",
        "Description": "This latest title in the \"Of the World\" series - the seventeenth - covers that fascinating group of animals whose evolution into their present forms and life-styles seems almost contradictory. While seals, sea lions and walruses are indeed mammals, their habitat is very much an aquatic one, their limbs now fully adapted for swimming rather than land locomotion.The various families of the order Pinnipedia - fur seals, sea lions, walruses and the phocid seals - are described and illustrated. Evolution, classification, distribution, life-cycles, zoology and their current status and future are all fully discussed. In addition, the complex question of their relationship with humans is examined. As with other marine-dwelling mammals, the issues are controversial. In examining topics such as conflicts between seals and fishing and culling and the fur trade, expert author Nigel Bonner adopts a professional and unemotional approach, based on first-hand knowledge and much experience.Their aquatic life and the remoteness of their habitats make the seals and their kin hard to study. Yet encounters with these species have produced in many people a particularly strong response, sometimes becoming sentimental. This book sensibly places them in context through a clear understanding of their natural history and their interactions with humans. The text is enhanced throughout by some 100 color photographs, detailed diagrams and maps.",
        "Category": " Juvenile Nonfiction , Animals , Marine Life",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Healing Brain: Breakthrough Discoveries About How the Brain Keeps Us Healthy",
        "Authors": "By Ornstein, Robert E. and Sobel, David",
        "Description": "Examines the tasks of the brain from regulation of body temperature to the positive effects of tears and crying",
        "Category": " Health & Fitness , General",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "The Threat Closer to Home: Hugo Chavez and the War Against America",
        "Authors": "By Schoen, Douglas and Rowan, Michael",
        "Description": "A chilling account of Hugo Chávez's shadow war on the United States    The American government has shrugged off South American politics for nearly forty years. In the meantime, our neighbor to the south has grown into an unprecedented threat. Hugo Chávez, the current president of Venezuela and a self-proclaimed enemy of the United States, commands what even Osama bin Laden only dreams of -- but few Americans see him as a true danger to this country. This book argues that we should.   Chávez has the means and the motivation to harm the United States in a way that few other countries can, and he has declared an \"asymmetric war\" against America. He runs a sovereign nation that is the fourth largest supplier of oil to the United States. He enjoys annual windfall oil profits that equal the net worth of Bill Gates. He has more modern weapons than anyone in Latin America. He has strategic alliances with Iran, North Korea, and other enemies of America, yet he has duped many Americans -- from influential political and cultural leaders to ordinary citizens who benefit from his oil largess through his state-owned oil company -- into believing that he is a friend.   Drawing on two decades of experience working at the highest level of Venezuelan and American politics, Schoen and Rowan go behind the scenes to examine Chávez's efforts to subvert both the American economy and his own country's stability. Not only did he help drive the price of oil from ten dollars a barrel to more than a hundred dollars a barrel, he's sponsored and become increasingly involved in civilian massacres, drug running, money laundering, nuclear weapons proliferation, and terrorist training.   Schoen and Rowan have both the insight and the access to make a case not yet made in the American media. Over the course of the past decade while living and working in Venezuela as writers and political consultants, they've investigated Ch‡vez's past, explored his family connections, and gone up against him in a series of elections. Their startling revelations about Ch‡vez's rise to power and his reach into American politics make this the kind of urgent, newsbreaking narrative that will spark vital debate in the corridors of power.",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Vivisection and Dissection in the Classroom: A Guide to Conscientious Objection",
        "Authors": "By Anna E. Francione Gary L. And Charlton",
        "Description": "",
        "Category": "",
        "Publisher": "Amer Anti-Vivisection Society",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Miss Garnet's Angel",
        "Authors": "By Vickers, Salley",
        "Description": "Salley Vicker's sensational debut novel, `Miss Garnet's Angel' is a voyage of discovery; a novel about Venice but also the rich story of the explosive possibilities of change in all of us at any time.",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Global AIDS: Myths & Facts",
        "Authors": "By Irwin, Alexander C., Millen, Joyce, and Fallows, Dorothy",
        "Description": "AIDS is the most devastating communicable disease in history, and structures of poverty and injustice are magnifying the crisis in underresourced countries.More than 36 million people are infected with HIV/AIDS—the vast majority of them in the poor world, or in poor and marginalized communities within wealthy countries. And since AIDS was first recognized in the early 1980s, 13 million children have been orphaned and 22 million people have died from the disease.Irwin and Millen, co-authors of the critically praised Dying for Growth: Global Inequality and the Health of the Poor, demonstrate that it is morally imperative and practically feasible to control the spread of AIDS by overturning common myths about treatment and prevention.For example, it is often argued that ordinary citizens in rich countries can do little to fight AIDS in poor counties. But Irwin and Millen show how individual activists, students, health providers, and members of international health organizations have helped to play pivotal roles in lowering drug prices and securing increased funding for vaccine development. Activism and education by groups like ACT UP, Student Global AIDS Campaign, and various religious organizations is forcing national and international leaders to take greater responsibility for the global AIDS crisis.Features a comprehensive resource guide. Illustrated with photographs. Alexander Irwin is an assistant professor of religious studies at Amherst College. Joyce Millen is Director of Research for the Institute for Health and Social Justice. Irwin and Millen are co-authors of Dying for Growth: Global Inequality and the Health of the Poor. James Orbinski, president of Doctors Without Borders, called Dying for Growth \"deeply intelligent, thoroughly researched—a must-read for all citizens and activists committed to meaningful change.\"",
        "Category": " Political Science , General",
        "Publisher": "South End Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Gift of Christmas Past: A Return to Victorian Tradition",
        "Authors": "By O'Neil, Sunny",
        "Description": "",
        "Category": "",
        "Publisher": "Amer Assn for State & Local",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "Rasselas Poems and Selected Prose.",
        "Authors": "By Johnson, Samuel",
        "Description": "",
        "Category": "",
        "Publisher": "RE",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "German Pocket Dictionary",
        "Authors": "By Moulton, W.",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1974"
        }
    },
    {
        "Title": "The UnCivil University (Politics & Propaganda in American Education)",
        "Authors": "By Tobin, Gary A., Ferer, Jenna, and Weinberg, Aryeh Kaufmann",
        "Description": "The UnCivil University tells a cautionary tale of how higher education, an institution touted for its open-mindedness, has become a prime vehicle for politically motivated prejudice against Jews and Israel. It exposes the unspoken world of double standards, bureaucratic paralysis, and abdication of leadership that not only allows but often supports anti-Jewish extremists on campus.",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Institute for Jewish & Community Research",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Lost Prince",
        "Authors": "By Wood, Bridget",
        "Description": "",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Webster's II New Riverside Pocket Dictionary",
        "Authors": "By",
        "Description": "More than 35,000 definitions in a convenient size and format. With a measurement table, a table of proofreaders’ marks, and a punctuation guide.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Positively Connecticut: Selected Stories from the Award-Winning WTNH-TV Series (Broadcast Tie-Ins)",
        "Authors": "By Smith, Diane",
        "Description": "Seventy stories of people living in Connecticut taken from the weekly news segment \"Positively Connecticut\" on WTNH-TV",
        "Category": " Travel , United States , Northeast , New England (CT, MA, ME, NH, RI, VT)",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Social Studies and Citizenship Education: Content Knowledge (Praxis Study Guides)",
        "Authors": "By Educational Testing Service (EDT)",
        "Description": "",
        "Category": " Study Aids , Tests (Other)",
        "Publisher": "Ets/Educational Testing Service",
        "Price Starting With ($)": "5.6",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Low-Budget, High-Quality Design",
        "Authors": "By Heller, Steven and Fink, Anne",
        "Description": "",
        "Category": " Art , Techniques , Drawing",
        "Publisher": "Watson-Guptill",
        "Price Starting With ($)": "6.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Everything Is Somewhere: The Geography Quiz Book",
        "Authors": "By McClintock, Jack",
        "Description": "This book features numerous quizzes on topics from continents, climates, animals, and oceans to cities, transportation, food, and health to world regions and the United States",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "My Father's Geisha",
        "Authors": "By Bennett, James Gordon",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "The Caribbean: The Genesis of a Fragmented Nationalism (Latin American Histories)",
        "Authors": "By Knight, Franklin W.",
        "Description": "Explores the common social pattern that has emerged from the various governments, languages, peoples, and beliefs and values that form the history of the Caribbean area",
        "Category": " History , Caribbean & West Indies , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Soule's Dictionary of English Synonyms",
        "Authors": "By SHEFFIELD, ALFRED D. (Editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The 'Official' CB Slanguage Language Dictionary, Including Cross-Reference",
        "Authors": "By Dills, Lanie",
        "Description": "",
        "Category": "",
        "Publisher": "Dills",
        "Price Starting With ($)": "6.37",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Rostenkowski: The Pursuit of Power and the End of the Old Politics",
        "Authors": "By Cohen, Richard E.",
        "Description": "A political biography that follows Rostenkowski from his origins in the Democratic ward politics of Chicago's Polish northwest side through his tenure as the powerful chairman of the House of Representatives' Ways and Means Committee to his eventual conviction and imprisonment on charges of corruption. Alongside the rise and fall of Rostenkowski's fortunes, the changing nature of the deal making and negotiation of party politics inside the House are examined. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , American Government , Legislative Branch",
        "Publisher": "Ivan R. Dee",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Acres of Diamonds: Your Wealth and Your Duty",
        "Authors": "By Cornwell, Russell H.",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Homeward Bounder: And Other Sea Stories",
        "Authors": "By Beaver, Floyd",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Glencannon Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Asthma For Dummies",
        "Authors": "By Berger, William E., M.D.",
        "Description": "The incidence of asthma is rising dramatically in the United States and across the globe. Asthma affects 17 million people in the U.S. and is the most common chronic childhood disease. If you or someone you love suffers from asthma, you know that there is no cure—however, with proper care, asthmatics can lead normal, active, and fulfilling lives. Now you can breathe easy with this plain-English guide, which clearly explains the prevention, diagnosis, symptoms, and treatment of the disease.Asthma For Dummies will help asthma sufferers and their loved ones get a strong handle on managing the disease. Dr. William Berger, one of the nation’s foremost experts on allergies and asthma, gives you the tools you need to:Understand the relationship between allergies and asthmaIdentify your asthma triggersPrepare for your first doctor’s visitAllergy-proof your home or office environmentAvoid asthma complicationsFind outside supportFeaturing up-to-date coverage of childhood asthma, this easy-to-understand guide covers all the vital issues surrounding asthma, including handling food allergies, exercising when asthmatic, asthma during pregnancy, and all the latest medications. You’ll find tips on avoiding allergens that cause respiratory symptoms, testing for allergies, and dealing with HMOs. This fact-packed guide also features:A dedicated chapter to asthma in the elderlyThe latest information on Claritin and Clarinex, two common allergy medications taken by those with asthmaThe interrelationships between asthma and other respiratory complications of untreated allergy such as ear, sinus, tonsil, and adenoid diseaseExtensive information on controller drugs and rescue medicationsFuture trends in asthma therapyOffering the latest on allergy shots and tips for traveling with asthma, Asthma for Dummies will relieve your anxiety about asthma, help you control your triggers, and manage the disease long-term.",
        "Category": " Health & Fitness , Diseases , Respiratory",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Last Tango in Paris",
        "Authors": "By Alley, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Dexter's Laboratory Science Fair Showdown: Cartoon Network",
        "Authors": "By Tartakovsky, Genndy and Lovitt, Chip",
        "Description": "",
        "Category": " Juvenile Fiction , Science & Technology",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Forgotten Fire",
        "Authors": "By Bagdasarian, Adam",
        "Description": "A National Book Award Finalist.In 1915 Vahan Kenderian is living a life of privilege as the youngest son of a wealthy Armenian family in Turkey. This secure world is shattered when some family members are whisked away while others are murdered before his eyes.Vahan loses his home and family, and is forced to live a life he would never have dreamed of in order to survive. Somehow Vahan’s incredible strength and spirit help him endure, even knowing that each day could be his last.",
        "Category": " Young Adult Fiction , Historical , Europe",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Dinosaurs (National Geographic My First Pocket Guides)",
        "Authors": "By Willis, Paul M. A., Kirshner, David, and McKinnon, James",
        "Description": "Discusses fossils and the age of dinosaurs and provides illustrated descriptions of types of dinosaurs including size, diet, and habitat.",
        "Category": " Juvenile Nonfiction , Animals , Dinosaurs & Prehistoric Creatures",
        "Publisher": "Natl Geographic Soc Childrens books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "PrettyTOUGH",
        "Authors": "By Tigelaar, Liz",
        "Description": "Bubbly, blond Krista brown is pretty and popular. Her sister, Charlie, is more interested in braving the Malibu waves than the halls of the school that Krista rules. but when Krista and Charlie are both recruited to the school?s soccer team, they are forced to face their differences. Can these two sisters become teammates, and friends, in time to make it to the championships? Classic themes of sisterhood and romance make PrettyTough a new take on Francine Pascal's Sweet Valley High. the strong sports element and a tie-in to the prettytougH sportswear and entertainment franchise give this first book by liz tigelaar added appeal.",
        "Category": " Young Adult Fiction , Family , Siblings",
        "Publisher": "Razorbill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Bright Minds, Poor Grades: Understanding and Motivating your Underachieving Child",
        "Authors": "By Whitley, Michael D., Ph.D.",
        "Description": "For any parent who has ever been told, \"your child isn't performing up to his or her potential,\" this book has the answer. Renowned clinical psychologist Michael Whitley, Ph.D. offers a proven ten-step program to motivate underachieving children. This easy-to follow book identifies the six types of underachievers from the procrastinator to the hidden perfectionist to the con artist, and it presents the ten steps to help children succeed in school-and ultimately, in life.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Peace is Possible: Conversations with Arab and Israeli Leaders from 1988 to the Present",
        "Authors": "By Abraham, S. Daniel and Clinton, Bill (FRW)",
        "Description": "A first-hand personal account of American businessman and Slim Fast founder Danny Abraham's more than 15 years of peacemaking efforts in the Middle East and the reasons he believes peace is possible.For more than fifteen years, entrepreneur Danny Abraham, founder and former chairman of Slim Fast, chose to utilize his considerable resources to facilitate Mideast peace. Together with Utah Congressman Wayne Owens, Abraham made more than sixty trips to the Middle East between 1988 to 2002, meeting with Arab leaders Hosni Mubarak, Hafez Assad, Crown Prince Abdullah, and Yasser Arafat, and Israeli prime ministers Yitzhak Shamir, Yitzhak Rabin, Shimon Peres, Ehud Barak, and Ariel Sharon.Using his business experience with difficult negotiations, Abraham took an active behind-the-scenes role, setting up critical one-on-one meetings between key figures. He urged these leaders to articulate not what they wanted, but what they needed, to make peace, fostering significant advances in the peace process. Since Owens' untimely death in 2002, Abraham has continued to arrange peacemaking meetings on his own.Drawing from meeting transcripts, diary entries, and extensive handwritten notes, Abraham writes in the first person about these extraordinary, often private meetings, giving us rare \"you are there\" insight into historically significant events. In his pragmatic and hopeful book, he writes, \"I am a great optimist, particularly about a region of the world that usually brings out people's most pessimistic inclinationsIsrael and its neighbors.\" Foreword by President Bill Clinton. 16 page color photo insert, maps, chronology, index.",
        "Category": " Political Science , Peace",
        "Publisher": "Newmarket",
        "Price Starting With ($)": "8.3",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Boy In the Striped Pajamas (Movie Tie-in Edition) (Random House Movie Tie-In Books)",
        "Authors": "By Boyne, John",
        "Description": "Berlin 1942When Bruno returns home from school one day, he discovers that his belongings are being packed in crates. His father has received a promotion and the family must move from their home to a new house far far away, where there is no one to play with and nothing to do. A tall fence running alongside stretches as far as the eye can see and cuts him off from the strange people he can see in the distance.But Bruno longs to be an explorer and decides that there must be more to this desolate new place than meets the eye. While exploring his new environment, he meets another boy whose life and circumstances are very different to his own, and their meeting results in a friendship that has devastating consequences.",
        "Category": " Young Adult Fiction , Historical , Holocaust",
        "Publisher": "David Fickling Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "The Words of Martin Luther King, Jr. (Words of Series)",
        "Authors": "By King, Coretta Scott",
        "Description": "More than 120 quotations on the community of man, racism, civil rights, justice and freedom, faith and religion, nonviolence, and peace. 16 photos, chronology.",
        "Category": "",
        "Publisher": "Newmarket Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "New Parrot Handbook, The (Barron's Pet Handbooks)",
        "Authors": "By Vriends, Matthew M. and Lantermann, Werner",
        "Description": "Professional tips on how to purchase, cage, speech-train and nurture parrots plus a wealth of essential information on parrot ailments and most effective medical treatments. Fifty exquisite full-color photos, and numerous drawings.",
        "Category": " Pets , Birds",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Amazon Parrots (Barron's Pet Owner's Manual) (English and German Edition)",
        "Authors": "By Lantermann, Werner and Lantermann, Susanne",
        "Description": "",
        "Category": " Pets , Birds",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "DK Readers: The Story of Pocahontas (Level 2: Beginning to Read Alone)",
        "Authors": "By Jenner, Caryn",
        "Description": "Examines the life of the Indian princess Pocahontas and her contact with English settlers, especially John Smith.",
        "Category": " Juvenile Nonfiction , History , United States , Colonial & Revolutionary Periods",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Husbands & Wives:The Best of Friends",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Lifeway Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Peter Armo's Lady in the Shower",
        "Authors": "By Armo,Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "The Persuasive Edge: The Executive's Guide to Speaking and Presenting",
        "Authors": "By Martel, Myles",
        "Description": "Tells how to plan, prepare, and customize a presentation, gauge employee sentiment, develop teleconferencing skills, increase customer confidence, and handle tough questions",
        "Category": " Business & Economics , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "The Goodness of Garlic",
        "Authors": "By Midgley, John and Sidaway, Ian (ILT)",
        "Description": "Outlines the health benefits of garlic and offers thirty recipes from around the world featuring garlic, onions, chives, and leeks",
        "Category": " Cooking , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Shooting Water: A Memoir of Second Chances, Family, and Filmmaking",
        "Authors": "By Saltzman, Devyani",
        "Description": "This debut memoir, an intimate story of second chances, love and redemption, spans three continents and four countries, as a daughter rekindles her relationship with her filmmaker mother during the production of Water, Deepa Mehta's most controversial movie.Introducing a new literary voice, Shooting Water recounts Devyani Saltzman's remarkable story of reconnecting with her mother, international award-winning filmmaker Deepa Mehta. When Devyani was eleven, her parents divorced, and the courts required her to choose which parent to live with. She chose to live with her father in Toronto and then spent the next eight years navigating between two religions (Hinduism and Judaism), two cultures (Indian and Canadian), two traditions and two people—belonging to both and to neither at once.In late 1999, at the age of nineteen, Devyani was invited by her mother to join her in the holy city of Benares, India, to work on Water, the final installment in Mehta's acclaimed Elements trilogy (which started with Fire and Earth). After only a week of shooting, Water became the target of a series of politically motivated attacks. The movie was shut down. Devyani went off to Oxford and, then, three years later rejoined her mother when production resumed in Sri Lanka. What began as a journey to heal deep wounds from the past turned into a five-year odyssey to complete the film.Transformative and inspiring, Shooting Water chronicles Saltzman's life-changing experience in India, the struggle to produce a film, and, through that struggle, the emergence of a deeper love between mother and daughter. 16 b/w photographs.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Newmarket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Barnyard Banter (Avenues)",
        "Authors": "By Fleming, Denise",
        "Description": "This farm favorite is now a board book, perfect for preschoolers. \"Cows in the pasture, moo, moo, moo. Roosters in the barnyard, cock-a-doodle-doo . . .\"It's another noisy morning on the farm, and all of the animals are where they should be -- except Goose. And where is Goose? Young children will enjoy clucking, mucking, mewing, and cooing while they search for Goose on every gorgeously illustrated spread.",
        "Category": " Juvenile Fiction , Animals , Farm Animals",
        "Publisher": "Square Fish",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Classic Mystery Stories (Dover Thrift Editions)",
        "Authors": "By Greene, Douglas G. (EDT)",
        "Description": "A tribute to the first great age of fictional sleuthing, this delightful collection of 13 mystery classics is devoted to the genuine tale of ratiocination, in which the detective solves the crime by investigation and observation, by using his or her wits.Included among these gems, written between 1841 and 1920, are Edgar Allan Poe's \"The Murders in the Rue Morgue,\" widely acknowledged as the first detective story; Charles Dickens' \"Three Detective Anecdotes,\" in which a policeman is the detective-hero; Jack London's \"The Leopard Man's Story,\" featuring an unusually grisly but thoroughly plausible murder method; \"The Phantom Motor,\" by Jacques Futrelle; as well as tales by Wilkie Collins, Gelett Burgess, Susan Glaspell, E. C. Bentley, Rodrigues Ottolengui, Baroness Orczy, Samuel Hopkins Adams, Meville Davisson Post, and H. C. Bailey.Douglas G. Green, a widely recognized authority in the field of mystery fiction, provides an Introduction and informative headnotes for the stories.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Middle Kingdom",
        "Authors": "By Barrett, Andrea",
        "Description": "For Grace, the ardent yet puzzled heroine of Andrea Barrett’s third novel, this trip has been planned as a three-week stay: she’s to play dutiful wife to Walter, her prominent scientist husband, at the 1986 Beijing International Conference on the Effects of Acid Rain. Walter is twelve years older than Grace, and as sour as the rain he studies; he and Grace are at a particularly troubled point in their marriage. Their tightly circumscribed visit, however, becomes a journey infinitely less tidy and more complex as Grace falls forever out of love with her husband and very much in love with this country and its culture. In the chaos of the Beijing streets and in the home of her new friends Dr. Yu and her son Zaofan, Grace finds the web of life she’s been too lost to perceive. “Time you spend in the past and future is time you spend alone,” Dr. Yu tells her. “But between them there is a middle kingdom, both feet planted here.”",
        "Category": " Fiction , General",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Anonymous Rex",
        "Authors": "By Garcia, Eric",
        "Description": "A People Beach Book of the Week“Very funny.” –Dave Barry “Startling and clever…hilarious and chilling.” –T.C. Boyle“All the elements of a cult classic.” –Entertainment Weekly “Great.” –Orlando Sentinel “Fast, funny, and smoothly written.” –Seattle Times“A detective thriller featuring a velociraptor PI and a secret society of dinosaurs disguised as humans?…Awesomely funny….Vincent Rubio has a washed-up Los Angeles detective agency, lousy credit, and a dead partner—on top of an addiction to basil and a hard time keeping his tail tucked away in his latex human suit. A routine arson investigation promises to get him back on his (clawed) feet, until the case sends him to New York, the scene of his partner’s suspicious death by runaway taxi. Witty, fast-paced detective work makes for a good mystery, but the story’s sly, seamlessly conceived dinosaur underworld contains all the elements of a cult classic. Grade: A.” –Entertainment Weekly “Debut novelist Eric Garcia pulls off this parallel dino world to a T (rex). [His] descriptions are delicious…inventive and imaginative. He cleverly avoids what could have been a one-joke book with charm, sly humor and a terrific narrative pace.” –USA Today“What would the world be like if the dinosaurs hadn’t gone extinct? As this very funny book shows, for one thing, L.A. would be even weirder than it is now.” –Dave Barry“First-time novelist Eric Garcia pulls it off, keeping the laughs frequent and the plot intriguing. After a few chapters, it seems downright logical to believe we’re surrounded by a cast out of Jurassic Park. Apart from showing off a splendidly warped imagination, Garcia provides a solid mystery.” –People “Garcia has come up with an imaginative twist to the detective fiction genre.” –Daily Variety “Audacious and imaginative. You might not believe any of this 30 seconds after you close the covers, but while it’s going on you’re going to be dazzled by Garcia’s energy and chutzpah.” –Publishers Weekly“Garcia plays it almost completely straight, respecting all noir traditions, and comes up with lovely touches.” –Chicago Tribune“A ‘noir-asaurus’ of a novel, bellowing for attention, the first and only of its breed in the dinosaur detective genre. Garcia has written something so strange, so bizarre, that he’s to be admired just for the attempt. And he not only pulls it off, he also actually makes you wonder why someone hasn’t thought of it before. Garcia’s tough guy deadpan is perfect for navigating his outrageous lost world, and the easy, familiar tone is probably what makes the premise so simple to swallow. Garcia talks the talk, and more importantly, he smirks in all the right places.” –The Miami Herald “Vincent Rubio, the protagonist of this first-person—er, first-dino narrative is so likeable, the story handled with such deftness, that it actually, incredibly works. Spider Robinson meets Sam Spade. The writing is sardonic and strong in the hard-boiled tradition, and laced with jokes about the history humans think they know: Oliver Cromwell was a Brontosaur, and ‘Capone and Eliot Ness were just two Diplodoci with a grudge to settle.’” –The Richmond Times Dispatch“Anonymous Rex leaps out of its gumshoe formula fast enough to break the genre barrier. Imagine a hard-boiled detective novel crossed with magical realism. Think film noir with great special effects. Think fabulous read. Well p...",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "You Know You're over 50 When...",
        "Authors": "By Kavet, Herb",
        "Description": "Provides a humorous look at the changes in a person's life after reaching middle age",
        "Category": "",
        "Publisher": "Ivory Tower Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Warriors Of The Prophet: The Struggle For Islam",
        "Authors": "By Huband, Mark",
        "Description": "Based on eyewitness accounts and original interviews, this bold new work provides a vivid portrayal of the evolving political and cultural role played by Islamic fundamentalist movements. Drawing on his firsthand experiences, Mark Huband moves deep inside the contemporary Islamic movements of countries as diverse as Morocco and Afghanistan.Huband reveals how Western powers have contributed to the rise of Islamic movements by their earlier support of the Afghan Islamic resistance and gives detailed accounts of his discussions with militant groups, Muslim scholars, and political opponents of the Islamic movements.Enriching these discussions, the author contextualizes the movements by exploring their historical and intellectual framework. The book uniquely illustrates the variety found within the movements, as well as the range of relationships the Islamic movements have to the various countries in which they are active.Warriors of the Prophet details the current crisis in Algeria; the disappointments of Arab nationalism and socialist experiments in Egypt; the social breakdown of Somalia in relation to the ideal of an Islamic way of life; the disaffected youth in the Islamic movements of Morocco, Egypt, and elsewhere; and the Islamic experiment and its relationship with the non-Islamic world as revealed in Sudan&#39;s experience since 1989. Through these insightful accounts, Huband gives us a penetrating exploration of one of the major issues of the late twentieth century.",
        "Category": " History , Middle East , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Publicity Stunt",
        "Authors": "By Fuhrman, Candice J.",
        "Description": "Looks at the way the public relations profession exploits the media, detailing over one hundred gags, stunts, and other attention-getters actually used to promote various events, products, and firms",
        "Category": " Business & Economics , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "At Home in Stone Creek (Stone Creek #6) (Silhouette Special Edition #2005)",
        "Authors": "By Miller, Linda Lael",
        "Description": "Everyone in Ashley O'Ballivan's life is marrying and starting families—except her. But what date can compare to Jack McCall, the man who broke her heart years ago?And now he's mysteriously back. But he isn't who she thinks he is.After a dangerous mission working for the DEA, security expert Jack McCall rents a room in Ashley's bed-and-breakfast. For her sake, he must keep his distance. But his feelings for her are so powerful that only his heart remains off-limits. To protect her—from his enemies and himself—he has to leave…vowing to fight his way home to her and Stone Creek forever.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin Special Edition",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Selected Stories of O. Henry (Barnes & Noble Classics Series)",
        "Authors": "By Henry, O. and Blake, Victoria",
        "Description": "&&LDIV&&R&&LDIV&&R&&LI&&RSelected Stories of O. Henry&&L/I&&R, by&&LSTRONG&&R O. Henry&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R&&LSTRONG&&R&&L/B&&R &&L/DIV&&R&&LDIV&&R&&LSTRONG&&RO. Henry&&L/B&&R mastered the art of the humorous, energetic tale that ends with a sudden, ironic twist. In “After Twenty Years,” for example, two boys agree to meet at a particular spot exactly twenty years later. Both are faithful, but in the intervening years one boy has turned into a criminal, the other into a policeman. Behind the rendezvous lurks a powerful dramatic situation with a fascinating moral dilemma—all dealt with in a few brief pages. &&L/DIV&&R&&LP&&RThis is just one of the many literary gems in &&LI&&RSelected Stories of O. Henry&&L/I&&R, a collection of 45 of O. Henry’s most renowned and entertaining short stories. Each one offers insights into human nature and the ways it is affected by love, hate, wealth, poverty, gentility, disguise, and crime—themes that ran through the author’s own life. Born William Sidney Porter, O. Henry started writing while in prison for embezzlement. Later he moved to New York, and his tales romanticizing the commonplace, particularly the life of ordinary New Yorkers, became highly popular. The most widely read author of his time, O. Henry died penniless but left behind a wealth of short stories that endure as classics of the genre. &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LSTRONG&&RVictoria Blake&&L/B&&R &&L/B&&Ris a freelance writer. She has worked at &&LI&&RThe Paris Review&&L/I&&R and contributed to the &&LI&&RBoulder Daily Camera&&L/I&&R, small literary presses in the United States, and English-language publications in Bangkok, Thailand. She currently lives and works in San Diego, California.&&L/P&&R",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Barnes Noble Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Shakespeare's Richard III (Cliffs Notes) (Cliffsnotes Literature Guides)",
        "Authors": "By Lowers, James K.",
        "Description": "Richard of Gloucester crosses and double-crosses friends and foes alike in a no-holds-barred effort to solidify control of the throne once occupied by his brother, Edward IV. His antics prove fruitful until one final battle with Henry, Earl of Richmond, at the end of the War of the Roses.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "CliffsNotes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1961"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Jewish History and Culture",
        "Authors": "By Blech, Benjamin",
        "Description": "You're no idiot, of course.  You know that Judaism began with Abraham and that Moses led the children out of slavery in Egypt.  But when it comes to knowing who Elijah, Esther, and Judah Maccabee were, and their significance to Judaism, you feel like you've been wandering in the desert for 40 years.  Don't feel Jewish guilt just yet!  The Complete Idiot's Guide to Jewish History and Culture provides you with a complete, authoritative account of the Jewish people--from Abraham, Moses, and King David to Golda Meir, Menachem Begin, and Yitzhak Rabin.  In this Complete Idiot's Guide, you get:",
        "Category": " Religion , Atheism",
        "Publisher": "Alpha Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Mountain Bike! Mid-Atlantic States: New York to West Virginia",
        "Authors": "By Surkiewicz, Joe",
        "Description": "",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Menasha Ridge Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Take Care of Your cat with the Home Vet Handbook",
        "Authors": "By Hayman, Bruce",
        "Description": "",
        "Category": "",
        "Publisher": "Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Scholastic Reader Level 1: Monster Math Picnic",
        "Authors": "By Burns, Marilyn, MacCarone, Grace, and Hartelius, Marge (ILT)",
        "Description": "Those lovable Math Monsters return to teach children the combinations of numbers that add up to ten in a math book that includes activities and a note to parents from acclaimed math educator Marilyn Burns. Original.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The bedside book of angels",
        "Authors": "By Trimiew, Anna",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Lucky Star (Step-Into-Reading, Step 3)",
        "Authors": "By McDonald, Megan and Wallace, Andrea (ILT)",
        "Description": "Star cannot wait to share her library book with her best friend Blister, but when the book gets ruined, they get into a fight over it.",
        "Category": " Juvenile Fiction , Readers , Intermediate",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Great Ideas From Learning: Volume One - Math",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "David Bliss - Springhouse Corp.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Hide This Spanish Book (Hide This Book)",
        "Authors": "By Berlitz Publishing",
        "Description": "It's not the Spanish you learned in school. Learn the lingo on: Love,  Sex, Extreme Sports, Video Games, Fashion, Body and Gross Bodily  Functions, Internet, Text Messaging, Gossip, Entertainment, and  Partying. Also exposed in Hide This Book are hilarious language mishaps,  social trends, and cool cultural features. Thermometers indicate how  “hot” language is, so you know when an expression is totally offensive, completely inappropriate and downright nasty! Hear the foreign language online, or download the audio to you iPod® or MP3 player. Entertaining as well as enlightening, this is one language reference you'll enjoy reading cover-to-cover.",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Hide This",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Flip: How to Turn Everything You Know on Its Head--and Succeed Beyond Your Wildest Imaginings",
        "Authors": "By Sheahan, Peter",
        "Description": "Emphasizing flexible, counterintuitive decision making, Flip calls for a new way of doing business in an economy where conventional wisdom won't get you anywhere\"Business today requires new perspectives\"—this is how Peter Sheahan, one of the youngest and fastest-rising stars on the international consulting and speaking circuit, begins this essential guidebook for succeeding in the twenty-first century. Sheahan reveals how the world's most effective organizations and individuals distinguish themselves from the competition, instead of running with the pack. In Flip he uncovers what the superstars of modern business have in common: an ability to \"flip\"—to think counterintuitively and then act boldly, with no regard for \"business as usual\" conventions. Sheahan explores six major flips: Action Creates Clarity—to move forward you must act in spite of ambiguity. Your action will create the clarity you're looking for.To keep pace with rising expectations, you can't just be fast, good, or cheap. Instead you must recognize that Fast, Good, Cheap: Pick Three–Then Add Something Extra has become the new standard in every industry.To develop competitive advantage, you must Absolutely, Positively Sweat the Small Stuff.To satisfy customers' needs for engagement and contact—spiritual, emotional, physical—remember that it's not just business, Business Is Personal.To win mass-market success, Find It on the Fringe. The way to separate yourself from the competitive herd is to be courageous and create new market space.To Get Control, Give It Up. You cannot command and control customers or the talented staff needed to reach them. Instead you must empower others to create, dream, and believe for you.Sheahan teaches today's decision makers how to embrace change and successfully operate in an economy that runs on new ideas. Those who take on these lessons will be in position to join other \"flipstars\" such as Richard Branson, Google, Toyota, Rupert Murdoch, and Apple. Stick to what you learned in business school at your peril. . . . The small-world economy calls for a new way of doing business. It calls for Flip.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Free Association: Method and Process",
        "Authors": "By Kris, Anton",
        "Description": "",
        "Category": "",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "George Washington (History Maker Bios)",
        "Authors": "By Candice F Ranson",
        "Description": "",
        "Category": "",
        "Publisher": "Lerner Publications Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Garrett Park: A History of the Town From Its Beginnings to 1970",
        "Authors": "By Town of Garrett Park",
        "Description": "",
        "Category": "",
        "Publisher": "Town of Garrett Park",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Undaunted Spirit (Westward Dreams #5)",
        "Authors": "By Peart, Jane",
        "Description": "Free-spirited journalist Independence McClaren follows her heart to a Colorado silver-town---and a test of her fierce commitment to the truth.Mindy's birth name is Independence McClaren---a fitting match for her tenacity and determination. Leaving behind a secure but colorless future in the east, the fiery young woman heads west to Coarse Gold, Colorado, and the opportunity to carve her mark in a man's world.As reporter for the Roaring River Gazette, Mindy not only will ferret out the news but will become the voice of conscience in this rough-and-tumble mining town, its reminder of the biblical principles of truth, virtue, and mercy.Little does she dream how her most prized possession as a journalist---her passion for the truth---will be put to the test. To follow her heart or to retain her integrity? Mindy will have to choose.Bestselling author Jane Peart takes readers to the Old West in the Westward Dreams Series with five novels of excitement, adventure, and romance. From mining camps to California vineyards, you'll meet women who must find a new life for themselves in a difficult, sometimes hostile environment. But with persistence, principle, and a steadfast faith, they not only survive, they thrive.",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Sold to a Laird (Tulloch Sgathan)",
        "Authors": "By Ranney, Karen",
        "Description": "Lady Sarah Baines was devoted to her mother and her family home, Chavensworth.  Douglas Eston was devoted to making a fortune and inventing.  The two of them are married when Lady Sarah′s father proposes the match and threatens to send Lady Sarah′s ill mother to Scotland if she protests.   Douglas finds himself the victim of love at first sight, while Sarah thinks her husband is much too, well, earthy for her tastes.  Marriage is simply something she had to do to ensure her mother′s well-being, and even when her mother dies in the next week, it′s not a sacrifice she regrets.   She cannot, however, simply write her mother′s relatives and inform them of her death.  She convinces Douglas - an ex pat Scot - to return to Scotland with her, to a place called Kilmarin.  At Kilmarin, she is given the Tulloch Sgàthán, the Tulloch mirror. Legend stated that a woman who looked into the mirror saw her true fate.   Douglas and Sarah begin to appreciate the other, and through passion, Douglas is able to express his true feelings for his wife.  But once they return to England and Douglas disappears and is presumed dead, Sarah has to face her own feelings for the man she′s come to respect and admire.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Runaway Heart (Westward Dreams)",
        "Authors": "By Peart, Jane",
        "Description": "The stagecoach driver's shout sent a chill down Holly Lambeth's spine.  What an ominous sound!  Was Riverbend, Oregon, to be the end of the line for her?  She had come west to escape the swirling gossip about her broken engagement.  She had come to escape the humiliation of being jilted.  She had come here to find a welcome new life, but her cousin's chilly reception tells her she has made a terrible mistake.  Here in Riverbend, two thousand miles from Kentucky, in a town barely more than a mining camp, Holly faces the fact that she is unwanted and unwelcome.  Knowing this unhappy truth, Holly reaches another conclusion. Only she can change her situation.Both the editor of the local newspaper, as well as the town's doctor, are attracted to the pretty newcomer.  But Holly has more than romance on her mind.  An unforeseen opportunity presents a challenge and brings Holly to a decision that will not only change her, but alter her own vision of her future.  Bestselling author Jane Peart takes readers to the Old West in the Westward Dreams Series with five novels of excitement, adventure, and romance. From mining camps to California vineyards, you'll meet women who must find a new life for themselves in a difficult, sometimes hostile environment. But with persistence, principle, and a steadfast faith, they not only survive, they thrive.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Richard Scarry's Chipmunk's ABC (Little Golden Book)",
        "Authors": "By Scarry, Richard (ILT) and Miller, Roberta",
        "Description": "Chipmunk lives under the apple tree, in a burrow. He likes to eat cake and pick daffodils.This cheerful book features appealing animal characters, bright artwork in Richard Scarry's  classic style, and simple sentences that teach the alphabet.",
        "Category": " Juvenile Fiction , Concepts , Alphabet",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Come the Dawn",
        "Authors": "By Skye, Christina",
        "Description": "Come The Dawn continues the story of the aristocratic Delamere family that readers were captivated by in Come The Night. This time the focus falls on India, the beautiful and headstrong sister of Come The Night's hero Luc Delamere, who falls in love with the rakish Devlyn Carlisle. They meet briefly and innocently as children, and again ten years later when, as adults, they fall deeply into a passionate affair. The Napoleonic Wars soon tear Devlyn away, but not before the two are joined in a secret wedding bond. When Devlyn is betrayed by a comrade in arms and presumed dead, India swears to continue her Iife alone, without the love that she prized above all else. Until one night a stranger with a familiar smile appears in a crowded ballroom, and India is plunged into a mystery to discover who betrayed Devlyn and to find a way to love again.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Carnivores of Light and Darkness (Journeys of the Catechist)",
        "Authors": "By Foster, Alan Dean",
        "Description": "When a lone survivor of a shipwreck pleads for the safe return of the Visioness Thrmaryl, kidnapped by an evil sorcerer, a herdsman from an isolated tribe, Ehomba, embarks on a journey through an unfamiliar world to rescue a woman he has never met. Reprint.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Aspect",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Odyssey (Wordsworth Classics)",
        "Authors": "By Homer and Lawrence, T. E. (TRN)",
        "Description": "A modern prose version of the classical epic relates the wanderings and homecoming of a Greek warrior and hero",
        "Category": " Poetry , Ancient & Classical",
        "Publisher": "Wordsworth Editions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "All You Can Eat: A Feast of Great Food Cartoons",
        "Authors": "By Gross, S. (EDT)",
        "Description": "Cartoons poke fun at restaurants, hot dog stands, ice cream, nutrition, and other aspects of food and eating",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "True Green Kids: 100 Things You Can Do to Save the Planet",
        "Authors": "By Mckay, Kim, Bonnin, Jenny, and De Rothschild, David (FRW)",
        "Description": "True Green Kids is the one book every home should have for the next generation. This vital children’s title is an innovative collection of fun and practical ways to help kids become agents for environmental change in their world.With fresh, new strategies and a bright, friendly design, True Green Kids invites the whole family to embark on an eco-adventure through a series of fun ideas that can be applied everywhere from the living room to the local park. Underscoring its message of individual awareness and action with beautiful color illustrations and lively text, the book puts an energetic spin on conservation, making environmental stewardship exciting and empowering for young kids. With a foreword by Clean Up the World Ambassador and National Geographic Emerging Explorer David de Rothschild, this volume brings the core message that you can make a difference to a younger audience in an engaging, educational way. While primarily aimed at kids, the book also encourages the active involvement of parents, teachers, and other members of the community, making it a vital addition to every library, home, and classroom.",
        "Category": " Juvenile Nonfiction , Science & Nature , Environmental Conservation & Protection",
        "Publisher": "National Geographic Kids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Paloverde: A novel",
        "Authors": "By Jacqueline Briskin",
        "Description": "",
        "Category": "",
        "Publisher": "Warner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "China Live: Two Decades in the Heart of the Dragon",
        "Authors": "By Chinoy, Mike",
        "Description": "The Hong Kong Bureau Chief for CNN offers a close-up look at recent Chinese history as he himself has witnessed it, discussing the death of Mao, Deng Xiaoping's reforms, the Tiananmen Square massacre, and China's troubled present and potential future.",
        "Category": " History , Asia , China",
        "Publisher": "Turner Pub",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "True Power - Get it, Use it, Share it",
        "Authors": "By Larsen, Linda",
        "Description": "",
        "Category": "",
        "Publisher": "Brandywine Publishing (FL)",
        "Price Starting With ($)": "6.61",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Before Freedom, When I Just Can Remember: Personal Accounts of Slavery in South Carolina",
        "Authors": "By Hurmence, Belinda (EDT)",
        "Description": "During the 1930s, the Federal Writers’ Project undertook the task of locating former slaves and recording their oral histories. The more than ten thousand pages of interviews with over two thousand former slaves were filed in the Library of Congress, where they were known to scholars and historians but few others. From this storehouse of information, Belinda Hurmence has chosen twenty-seven narratives from the twelve hundred typewritten pages of interviews with 284 former South Carolina slaves. The result is a moving, eloquent, and often surprising firsthand account of the last years of slavery and first years of freedom. The former slaves describe the clothes they wore, the food they ate, the houses they lived in, the work they did, and the treatment they received. They give their impressions of Yankee soldiers, the Klan, their masters, and their newfound freedom.Belinda Hurmence was born in Oklahoma, raised in Texas, and educated at the University of Texas and Columbia University. She has written several novels for young people, including Tough Tiffany (an ALA Notable Book), A Girl Called Boy (winner of the Parents' Choice Award), and The Nightwalker. She has also edited My Folks Don't Want Me to Talk About Slavery and We Lived in a Little Cabin in the Yard, companion volumes to this book. She now lives in Raleigh, NC.",
        "Category": " History , General",
        "Publisher": "Blair",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Chemical Principles in the Laboratory (Saunders Golden Sunburst Series)",
        "Authors": "By Masterton, William L., Slowinski, Emil J., and Wolsey, Wayne C.",
        "Description": "",
        "Category": " Science , Chemistry , General",
        "Publisher": "Thomson Learning",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "LIBERTY, EQUAILITY, POWER, VOL 2",
        "Authors": "By Murrin, John M. and McPherson, James M.",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "A Dog Owner's Guide to Training Your Dog (Dog Owner's Guides)",
        "Authors": "By Palmer, Joan",
        "Description": "",
        "Category": " Pets , Dogs , General",
        "Publisher": "Tetra Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Across the Centuries",
        "Authors": "By McDougal, Littell (EDT)",
        "Description": "",
        "Category": " Young Adult Nonfiction , Social Science , General",
        "Publisher": "Houghton Mifflin School",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Complete Business Etiquette Handbook",
        "Authors": "By Pachter, Barbara, Brody, Marjorie, and Anderson, Betsy",
        "Description": "Covers introductions, coping with difficult personalities, breaking bad news, telephone manners, letters, and international customs",
        "Category": " Business & Economics , Business Etiquette",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Hot Johnny (and the Women Who Loved Him)",
        "Authors": "By Jackson-Opoku, Sandra",
        "Description": "Through the discerning eyes of those who have known and loved him, we watch Hot Johnny take a journey into the past, where a deeply guarded family secret lies hidden, waiting to be revealed. Along the way, pivotal moments of Hot Johnny's life begin to surface: his childhood struggles in the ghettos of Chicago, his rites of passage as a young gang member, his tragically short athletic career, his fantasies and obsessions, cruelties and compassion.Each woman has a distinct voice and her own point of view. Among them is Destiny, the damaged young woman he married, but cannot save; Lola Belle, the white lesbian with something to prove and nothing to lose; Tree, the college soulmate, whose first taste of tenderness came from Hot Johnny's touch; Cinnamon, the thrill seeker who only Johnny can satisfy; Peaches, the prostitute who gave the boy his name and sealed his reputation; Jonavis, the daughter he never knew he had; and Gracita Reina, \"Queen of Grace,\" his great-grandmother, who holds the key to Johnny's salvation. Each woman provides a piece of the puzzle that is Hot Johnny - until at last he is brought into dazzling focus.",
        "Category": " Fiction , General",
        "Publisher": "One World/Ballantine",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Complete Garden Flower Book: Annuals, Perennials, Bulbs, Shrubs, Climbers",
        "Authors": "By Catie Ziller, Robert Oerton",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Murdoch Books",
        "Price Starting With ($)": "10.4",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "By Hook or by Crook",
        "Authors": "By Emma Lathen",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1977"
        }
    },
    {
        "Title": "Victoria Victorious: The Story of Queen Victoria",
        "Authors": "By Plaidy, Jean",
        "Description": "In this unforgettable novel of Queen Victoria, Jean Plaidy re-creates a remarkable   life filled with romance, triumph, and tragedy. At birth, Princess Victoria was   fourth in line for the throne of England, the often-overlooked daughter of a prince   who died shortly after her birth. She and her mother lived in genteel poverty for   most of her childhood, exiled from court because of her mother’s dislike of her uncles,   George IV and William IV. A strong, willful child, Victoria was determined not to   be stifled by her powerful uncles or her unpopular, controlling mother. Then one   morning, at the age of eighteen, Princess Victoria awoke to the news of her uncle   William’s death. The almost-forgotten princess was now Queen of England. Even better,   she was finally free of her mother’s iron hand and her uncles’ manipulations. Her   first act as queen was to demand that she be given a room—and a bed—of her own. Victoria’s marriage to her German cousin, Prince Albert, was a blissfully happy one   that produced nine children. Albert was her constant companion and one of her most   trusted advisors. Victoria’s grief after Prince Albert’s untimely death was so shattering   that for the rest of her life—nearly forty years—she dressed only in black. She survived   several assassination attempts, and during her reign England’s empire expanded around   the globe until it touched every continent in the world. Derided as a mere “girl   queen” at her coronation, by the end of her sixty-four-year reign, Victoria embodied   the glory of the British Empire. In this novel, written as a “memoir” by Victoria   herself, she emerges as truthful, sentimental, and essentially human—both a lovable   woman and a great queen.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Anthills of the Savannah",
        "Authors": "By Achebe, Chinua",
        "Description": "A searing satire of political corruption and social injustice from the celebrated author of Things Fall ApartIn the fictional West African nation of Kangan, newly independent of British rule, the hopes and dreams of democracy have been quashed by a fierce military dictatorship. Chris Oriko is a member of the president's cabinet for life, and one of the leader's oldest friends. When the president is charged with censoring the opportunistic editor of the state-run newspaper--another childhood friend--Chris's loyalty and ideology are put to the test. The fate of Kangan hangs in the balance as tensions rise and a devious plot is set in motion to silence a firebrand critic. From Chinua Achebe, the legendary author of Things Fall Apart, Anthills of the Savannah is \"A vision of social change that strikes us with the force of prophecy\" (USA Today).",
        "Category": " Fiction , Political",
        "Publisher": "Anchor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "1000 Facts About the Earth",
        "Authors": "By Butterfield, Moira",
        "Description": "Every page of these stimulating first fact books is crammed with fascinating facts that are vividly presented and accompanied by dozens of colorful illustrations. With additional fact lists and an index, children are sure to find these books both appealing and accessible.",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Piano Adventures Technique & Artistry Book, Level 2B",
        "Authors": "By Nancy & Randall Faber",
        "Description": "",
        "Category": "",
        "Publisher": "The FJH Music Company Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Runaway Bay",
        "Authors": "By Hendrix, Lisa",
        "Description": "After being dumped by her boyfriend, Jackie Barnett heads off to the West Indies at the insistence of her boss, who wants her to squeeze some grant money out of the head of the Phelps Foundation who is also staying at the resort, but Jackie soon discovers that her lifelong nemesis, Reade Hunter, is also at the resort with the same intentions. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Jove",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    }
]