[
    {
        "Title": "Vegetarian: The Best-Ever Recipe Collection",
        "Authors": "By linda fraser",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Soul",
        "Authors": "By Learner, Tobsha",
        "Description": "Learner's The Witch of Cologne is an erotically-charged novel of people swept inexorably along by events they could not control.  In Soul, Learner relates the story of Lavinia and Julia Huntington, passionate women trapped in emotional whirlpools that threaten to drown them and everyone they love.  In 19th century Britain, Lavinia is married to an older man who seems to appreciate her lively curiosity. Lavinia proves to be an apt pupil in both the study and the bedroom, glorying in the pleasures of the physical.  In 21st century Los Angeles, geneticist Julia is trying to identify people who can kill without remorse. Stunned to discover that she seems to possess the trait she is looking for, Julia is reassured of her emotions by her intense passion for her husband and her delight in her pregnancy.  In the past, Lavinia's desire for her husband grows, but his cools as he becomes fascinated with another. In the present, Julia's love overwhelms her husband, who leaves her.  Lavinia and Julia feel the tortures of passion unspent. Cold logic tells them that the deaths of their tormentors will bring them peace. Separated by a hundred years, two Huntington women face the same decision. Their choices will echo far into the future.",
        "Category": " Fiction , Psychological",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Pilates on the Ball: Training Core Stability for a Healthy Body and Mind",
        "Authors": "By Wright, Gemma",
        "Description": "",
        "Category": " Health & Fitness , General",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "A Wife After God's Own Heart: 12 Things That Really Matter in Your Marriage",
        "Authors": "By George, Elizabeth",
        "Description": "A Wife After God’s Own Heart reveals how you can have what every married woman desires—a wonderful marriage filled with mutual love, friendship, romance, and joy. No matter what the state or season of your marriage, this book is for you. Join bestselling author Elizabeth George as she shares the keys to having a great marriage, including…communicating to your husband more effectivelyunderstanding how to best support your manhaving more fun as a coupleenhancing or rekindling marital intimacyhonoring God together in your relationshipWhen it comes to making a marriage the best it can be, you’ll find this book a practical help—including the many “Little Things That Make a Big Difference” in every chapter! Start now on the path to a stronger and more fulfilling relationship. Includes study guide.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "You're Grounded for Life!: And 49 Other Crazy Things Parents Say",
        "Authors": "By O'Connor, Joey",
        "Description": "",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "American Girl Book of Horse Stories",
        "Authors": "By American Girl",
        "Description": "",
        "Category": "",
        "Publisher": "Random House (Merchandising)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1963"
        }
    },
    {
        "Title": "Framed (Nancy Drew: All New Girl Detective #15)",
        "Authors": "By Keene, Carolyn",
        "Description": "A prince is in River Heights. A prince! Granted, he's from a relatively minor royal family, but still. This is big news.   The headlines get even bigger once the prince is found toting a painting for his family's good friend Mrs. Mahoney -- because within hours of his arrival, the federal authorities arrest him. They suspect he stole the painting from his family.   Dad and I aren't buying it. We have a hunch there's more to this -- ahem -- picture. But can we save the prince before he's wrongfully crowned \"criminal\"?",
        "Category": " Juvenile Fiction , Royalty",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Professor (Wordsworth Classics)",
        "Authors": "By Bronte, Charlotte",
        "Description": "",
        "Category": " Fiction , Literary",
        "Publisher": "Wordsworth Editions Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Islamic Imperialism: A History",
        "Authors": "By Karsh, Efraim",
        "Description": "From the first Arab-Islamic Empire of the mid-seventh century to the Ottomans, the last great Muslim empire, the story of the Middle East has been the story of the rise and fall of universal empires and, no less important, of imperialist dreams. So argues Efraim Karsh in this highly provocative book. Rejecting the conventional Western interpretation of Middle Eastern history as an offshoot of global power politics, Karsh contends that the region’s experience is the culmination of long-existing indigenous trends, passions, and patterns of behavior, and that foremost among these is Islam’s millenarian imperial tradition.The author explores the history of Islam’s imperialism and the persistence of the Ottoman imperialist dream that outlasted World War I to haunt Islamic and Middle Eastern politics to the present day. September 11 can be seen as simply the latest expression of this dream, and such attacks have little to do with U.S. international behavior or policy in the Middle East, says Karsh. The House of Islam’s war for world mastery is traditional, indeed venerable, and it is a quest that is far from over.",
        "Category": " Social Science , Islamic Studies",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Persian Gulf Tv War (Critical Studies in Communication and in the Cultural Industries)",
        "Authors": "By Kellner, Douglas",
        "Description": "",
        "Category": " Language Arts & Disciplines , Communication Studies",
        "Publisher": "Westview Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "La Boheme: English National Opera Guide 14 (English National Opera Guides)",
        "Authors": "By Puccini, Giacomo, Murger, Henri, Calder, J., Giacosa, Giuseppe, and Illica, Luigi",
        "Description": "The English National Opera Guides were originally conceived in partnership with the English National Opera and edited by Nicholas John, the ENO's dramaturg, who died tragically in an accident in the Alps. Most of the guides are devoted to a single opera, which is described in detail?with many articles that cover its history and information about the composer and his times. The complete libretto is included in both the original language and in a modern singing translation?except where the opera was written in English. Each has a thematic guide to the most important musical themes in musical notation and each guide is lavishly illustrated. They also contain a bibliography and a discography which is updated at each reprint. The ENO guides are widely regarded as the best series of their kind and excellent value.",
        "Category": " Music , Genres & Styles , Opera",
        "Publisher": "Oneworld Classics",
        "Price Starting With ($)": "4.93",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Impressionists at First Hand (World of Art)",
        "Authors": "By Denvir, Bernard (EDT)",
        "Description": "Gathers selections from letters, critical reviews, and reminiscences by the impressionist artists and their contemporaries",
        "Category": " Art , History , General",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Connecting With Our Children : Guiding Principles for Parents in a Troubled World",
        "Authors": "By Gilbert, Roberta M.",
        "Description": "Parents want a special relationship with their children Parents care. They want to guide their children through the rough spots in life and help them make the right decisions. Research shows that a special parental connection is extremely important in safeguarding children against dangers such as substance abuse, sexual promiscuity, criminal activity, and suicide. This is more important than ever before in today's troubled world. But what does making this connection mean? Based on Bowen family systems theory, Connecting with Our Children shows parents how to build the connection found in better relationships. Now parents have a new way to think about and respond to family problems. The author examines common concerns, such as:* How substance abuse can repeat through generations* Why fusions between family members drive conflict* How family anxiety can erupt into violence* Whether stepfamilies can create a new family unit* What roles faith and humor play in a family* How effective are special contributions made by connections with grandparentsNumerous practical examples and stories illustrate familiar situations and concerns, so that parents can learn how to deal with the often confusing situations surrounding their children, as well as those within their own lives. With a different perspective, parents can learn to overcome these difficulties, creating a stronger family and a happier, more open relationship between parent and child.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Trade Paper Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Nutrition for Women: The Complete Guide (Henry Holt Reference Book)",
        "Authors": "By Somer, Elizabeth",
        "Description": "Recent surveys indicate that women are more aware today of what constitutes a healthful diet than they were ten years ago. However, although more than 70 percent of women acknowledge that a nutritious diet is an important factor in reducing the risk of serious health problems, many still lack the skills and resources to make informed food and nutrient choices. And while many understand that diet is related to the risk for certain diseases, few women are aware of the specific dietary components that lower that risk or how to incorporate the right foods and nutrients into their diet.Nutrition for Women: The Complete Guide is an accessible reference for and about women - the first of its kind to provide a bottom-line summary of scientific nutrition research from more than 2,000 studies on the issues pertinent to women's health. In a clear, concise style it converts scientific jargon into simple, understandable terms while dispelling the myths and presenting the facts.Nutrition can be more than a bit confusing. Diets abound, from the anti-heart-disease diet to the PMS diet to the hundreds of weight-loss diets. Women who want to simplify this nutrition puzzle and combine the best advice into one diet with recommendations for particular illnesses or life stages should consult this invaluable guide. Part I presents the Healthy Woman's Diet and all the skills necessary for adapting one's habits to a more healthful eating style. In this section there are also ten key ideas for making successful changes and staying motivated. Part II introduces the latest research on the role nutrition plays in the many stages of a woman's life, including pregnancy, menopause, and the senior years. Part III offers easy-to-read summaries and dietary recommendations based on current research for a wide range of disorders from AIDS to yeast infections. Many accessible charts, tables, and worksheets will enable readers to make informed decisions about and necessary changes to their diets.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Living One",
        "Authors": "By Gannett, Lewis",
        "Description": "Torrance Spoor is your normal California teenager - a handsome high school athlete with strong sexual yearnings and a long-absent father. The invitation to spend some time with his dad - the Baron Malcolm Spoor - comes as a surprise. But what awaits Torrance at his father's windswept estate is far worse than he could ever imagine.Welcome to the world of The Living One, one of the most frightening, clever, and suspenseful novels of the year. In this tour-de-force debut, Lewis Gannett spins a spellbinding story that summons up magic, body thievery, killer dogs, ESP wars, and lusty, genre-defying sex - straight, gay, and forms yet unnamed.The Spoors are the ultimate dysfunctional family. Wealthy, shamelessly extravagant, and impossibly attractive, they are also cursed. The curse has been handed down from father to son for seven hundred years, ever since the Crusades, when a bizarre and mystifying event created a recurring pattern of madness and death. As Baron Malcolm Spoor prepares for his demise, he must pass on the family riches - and its traditions - to his estranged son.But Malcolm and Torrance both have secrets they would rather keep to themselves, secrets that are nearly revealed when a shadowy government scientist picks up psychic readings from the Spoor estate and a bohemian teacher becomes personally involved with Torrance. These two begin an investigation into the extraordinary life of Baron Malcolm Spoor, and their findings are truly horrifying.Updating elements of the epistolary novel popularized in Dracula, Lewis Gannett tells his gothic story through the inventive use of videotape transcripts, diary entries, and historical records. Vivid, scary, mythic, and engrossing, The Living One explores the terrifying dimensions of family guilt, aging, and the murderous tensions between fathers and sons. Lewis Gannett has written a startling and thrilling novel that marks the debut of an original new voice in fiction.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "Beyond Miracles: Living With Cancer : Inspirational and Practical Advice for Patients and Their Families",
        "Authors": "By Hersh, Stephen P.",
        "Description": "With recent information and insightful advice, this inspirational volume helps guide cancer patients through the initial period of devastation that occurs after learning that they have the disease and then the emotional upheaval that they endure while trying to cope with it all. Original. Tour.",
        "Category": " Health & Fitness , Diseases , Cancer",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Living with Brain Injury: A Guide for Families (Rev)",
        "Authors": "By Senelick, Richard C. and Ryan, Cathy E.",
        "Description": "",
        "Category": " Self-help , Substance Abuse & Addictions , General",
        "Publisher": "Healthsouth Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Fresh Flower Arranger's Companion",
        "Authors": "By Andrea Neophyton",
        "Description": "An illustrated guide to flower arranging is packed with exciting and innovative ideas for creating informal and attractive fresh flower arrangements without spending too much time and money.",
        "Category": "",
        "Publisher": "Booksales",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Psychological Evaluations for the Courts: A Handbook for Mental Health Professionals & Lawyers (The Guilford Law & Behavior Series)",
        "Authors": "By Melton, Gary B.",
        "Description": "",
        "Category": " Psychology , Forensic Psychology",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Delicious Ways to Control Diabetes Cookbook",
        "Authors": "By Cain, Anne Chappell (EDT)",
        "Description": "",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.91",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Gathering Place: Informal International Menus That Bring Family and Friends Back to the Table",
        "Authors": "By Kerr, Graham",
        "Description": "The result of an international quest for tasty low-fat foods and healthy ingredients, Kerr's creative menus reflect the diverse cuisines of the thirteen ports of call that he and his wife Treena visited on a recent Queen Elizabeth II voyage from New York City to Sydney, Australia.The menus serve as guides for social gatherings of friends who want to share the cooking and sample the flavors of the world together. Each menu includes an appetizer, main course [with a vegetarian alternative when needed], vegetables, side dishes and dessert. The recipes can be used on a \"mix and match\" basis as well.The book is supplemented with nutritional analyses, sources for unusual ingredients, serving suggestions, and cultural and historical notes, as well as a complete index of recipes, ingredients, and techniques. In addition, a glossary of innovative techniques developed by Kerr will help home cooks reduce harmful fat, sugar, and salt while increasing the flavor, color, and aroma of their dishes.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Camano Pr",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Tammy Turtle: A Tale of Saving Sea Turtles (No. 11 in Suzanne Tate's Nature Series)",
        "Authors": "By Tate, Suzanne and Melvin, James (ILT)",
        "Description": "Discusses the characteristics and behavior of sea turtles in a fictional story designed to promote environmental awareness",
        "Category": " Juvenile Fiction , Animals , Turtles",
        "Publisher": "Nags Head Art, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "10 Dumbest Mistakes Smart People Make and How To Avoid Them: Simple and Sure Techniques for Gaining Greater Control of Your Life",
        "Authors": "By Freeman, Arthur and Dewolf, Rose",
        "Description": "ARE YOU A MISTAKE MAKER?Have you ever thought: \"I'd better not try, I could be embarrassed\"?Does it bother you to see someone you know get ahead -- of you?Have you ever thought: \"Its my responsibility to make sure my loved ones are happy\"?Is your motto \"Anything worth doing must be done absolutely right\"?Do you tend to qualify your responses?That is, do you find yourself saying: \"Yes, its good, but...\"?Have you ever concluded: \"Everybody thinks I messed up\"?Have you ever thought: \"I just can't lose.Let's face it, when you've got it, you've got it\"?You, just like everybody else in the world, may be prone to one or many of the ten dumbest mistakes smart people make. Now, Dr. Arthur Freeman and Rose DeWolf offer clear, practical advice and concrete techniques to help you combat selfdefeating thinking and gain greater control of your life, work, and personal relationships. Arm yourself with this one right away.",
        "Category": " Self-help , General",
        "Publisher": "MorrowPb",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "The 108 Skills of Natural Born Leaders",
        "Authors": "By Blank, Warren",
        "Description": "Shows how to master a specific set of skills people commonly associate with so-called \"natural born\" leaders. Identifies 108 traits that cause others to see people as leaders, and explains how to acquire these qualities. Includes a self-assessment inventory, and examples ranging from Franklin Roosevelt to G.E.'s Jack Welch. Blank is a consultant and trainer on leadership to many Fortune 500 companies and US government agencies. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , Leadership",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Little Mermaid (Disney Princess) (Little Golden Book)",
        "Authors": "By Teitelbaum, Michael and Dicicco, Sue (ILT)",
        "Description": "Ariel is a curious young mermaid. She likes to explore sunken ships, swim up to the surface, and learn all she can about the world above the sea. Children ages 2-5 will love finding out what happens when this Disney Princess falls in love with a human in the full-color Little Golden Book retelling of Disney The Little Mermaid!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden/Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Toes, Ears, & Nose! A Lift-the-Flap Book",
        "Authors": "By Bauer, Marion Dane and Katz, Karen (ILT)",
        "Description": "Help Baby discover toes, ears, nose, and more in this lift-the-flap book by Marion Dane Bauer and illustrated by Karen Katz!Inside my boots I've got toes, and beneath my scarf is a... Baby is bundled in a mountain of clothes! Peek under the flaps of clothing to find out what's underneath, and play this fun peekaboo book again and again!",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Torah and Canon",
        "Authors": "By Sanders, James A.",
        "Description": "",
        "Category": " Religion , Judaism , General",
        "Publisher": "Fortress Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1972"
        }
    },
    {
        "Title": "The Castle in the Forest",
        "Authors": "By Mailer, Norman",
        "Description": "No career in modern American letters is at once so brilliant, varied, and controversial as that of Norman Mailer. In a span of more than six decades, Mailer has searched into subjects ranging from World War II to Ancient Egypt, from the march on the Pentagon to Marilyn Monroe, from Henry Miller and Mohammad Ali to Jesus Christ. Now, in The Castle in the Forest, his first major work of fiction in more than a decade, Mailer offers what may be his consummate literary endeavor: He has set out to explore the evil of Adolf Hitler. The narrator, a mysterious SS man who is later revealed to be an exceptional presence, gives us young Adolf from birth, as well as Hitler’s father and mother, his sisters and brothers, and the intimate details of his childhood and adolescence.A tapestry of unforgettable characters, The Castle in the Forest delivers its playful twists and surprises with astonishing insight into the nature of the struggle between good and evil that exists in us all. At its core is a hypothesis that propels this novel and makes it a work of stunning originality. Now, on the eve of his eighty-fourth birthday, Norman Mailer may well be saying more than he ever has before.",
        "Category": " Fiction , Literary",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Maternal-Newborn Nursing: A Family-Centered Approach",
        "Authors": "By Olds, Sally B., London, Marcia L., and Ladewig, Patricia Wieland",
        "Description": "Revision of a standard textbook. New features include chapters on the family, pregestational risks, women's health together with new emphasis on drugs, hypertension, AIDS. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Addison-Wesley Pub (Sd)",
        "Price Starting With ($)": "10.52",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Opening the Bible (Volume 2) (New Church's Teaching Series, 2)",
        "Authors": "By Ferlo, Roger",
        "Description": "The author leads his readers through the practical difficulties of reading the Bible, offering advice that is true to the way Anglicans have read Scripture from the time of Tyndale and Cranmer.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Cowley Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Great Country French Style",
        "Authors": "By Michele Keith",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corporation",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "THE AGE OF IDEOLOGY",
        "Authors": "By Aiken, Henry D.",
        "Description": "",
        "Category": "",
        "Publisher": "Mentor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Semi-Homemade Cooking 2",
        "Authors": "By Lee, Sandra",
        "Description": "Fabulous family-friendly recipes for every palate and mood, created from an inspired pairing of fresh and convenience products. Recipes feature the best of Italian, Asian, and Latin American cuisine, barbecue favorites, comfort food classics, slow cooker creations, everyday dinners, and special occasion inspirations.Sandra lends her Semi-Homemade, worry-free, time-saving approach to a host of delectable appetizers, snacks, main dishes, side dishes, salads, and desserts.The on-call pantry—a foolproof list of at-the-ready convenience foods for recipe success at a moment’s notice.Tasteful tablescapes make every dining experience special.Beautiful color photo of every recipe.",
        "Category": " Cooking , Reference",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "An Introduction to Jung's Psychology",
        "Authors": "By Frieda Fordham",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "It Must've Been Something I Ate",
        "Authors": "By Steingarten, Jeffrey",
        "Description": "In this outrageous and delectable new volume, the Man Who Ate Everything proves that he will do anything to eat everything. That includes going fishing for his own supply of bluefin tuna belly; nearly incinerating his oven in pursuit of the perfect pizza crust, and spending four days boning and stuffing three different fowl—into each other-- to produce the Cajun specialty called “turducken.” It Must’ve Been Something I Ate finds Steingarten testing the virtues of chocolate and gourmet salts; debunking the mythology of lactose intolerance and Chinese Food Syndrome; roasting marrow bones for his dog , and offering recipes for everything from lobster rolls to gratin dauphinois.  The result is one of those rare books that are simultaneously mouth-watering and side-splitting.",
        "Category": " Cooking , Essays & Narratives",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Fdr's America",
        "Authors": "By Kyvig, David E.",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Forum Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "I Will Be Your Friend",
        "Authors": "By Smith, Michael W.",
        "Description": "Michael W. Smith is the most successful male solo artist in contemporary Christian music. His classic song, \"Friends,\" is the most popular song played at Christian school graduations, and he has been recognized as a strong role model for Christian teenagers. His first book, Friends Are Friends Forever, has sold more than 150,000 copies and become a favorite gift for graduations. Now, in the tradition of that bestseller, I Will Be Your Friendtakes Michael's popular song of the same title on his most recent CD, This Is Your Time, and uses it as a starting point to explore the meaning of lifelong friendship. Stories of friends from Michael's childhood and adult life, biblical stories of friendship, and stories of those who have been inspirational in Michael's life will encourage people of all ages to appreciate and nurture meaningful friendships. I Will Be Your Friendwill inspire readers to develop a few close friends-and build relationships for a lifetime.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Baking Soda Bonanza",
        "Authors": "By Ciullo, Peter A.",
        "Description": "From removing tough kitchen stains and odors to buffing the Statue of Liberty, from dry-cleaning a dog to cleaning up the Hudson River, this incredibly practical, money-saving book shows how to perform hundreds of household chores and other tasks -- all with an under-a-buck box of baking soda.",
        "Category": " Cooking , Specific Ingredients , Herbs, Spices, Condiments",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Nostalgia and Sexual Difference: The Resistance to Contemporary Feminism",
        "Authors": "By Janice Doane, Devon Hodges",
        "Description": "",
        "Category": "",
        "Publisher": "methuen inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Pick Up Your Socks . . . and Other Skills Growing Children Need!: A Practical Guide to Raising Responsible Children",
        "Authors": "By Crary, Elizabeth and Casebolt, Pati",
        "Description": "Shows parents how to teach their children responsibility for their actions and their possessions",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Chicago Review Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "5 Steps to a 5 on the Advanced Placement Examinations: English Language",
        "Authors": "By Rankin, Estelle M. and Murphy, Barbara L.",
        "Description": "ENGLISH LANGUAGE ENGLISH LITERATURE Grace Freedson, Series Editor An exciting new series of study guides that lets each student design a course of study pitched to his or her individual needs and learning style Each year, more than one million U.S. high school students take one or more advanced placement (AP) exams, and, according to official projections, that number will continue to rise in the years ahead. That is because AP exams confer important benefits on those who do well on them. High AP scores are indispensable to gaining admission to most elite colleges. They provide students with a competitive edge when competing for grants and scholarships. And they allow students to bypass required university survey courses, saving on skyrocketing tuition fees. Designed to coincide perfectly with the most current AP exams, Five Steps to a 5 on the Advanced Placement Examinations guides contain several advanced features that set them above all competitors. Each guide is structured around an ingenious Five-Step Plan. The first step is to develop a study plan, the second builds knowledge, the third and fourth hone test-taking skills and strategies, and the fifth fosters the confidence students need to ace the tests. This flexible study tool is also tailored to three types of students. For the more structured student there is a \"Month-by-Month\" approach that follows the school year and a \"Calendar Countdown\" approach that begins with the new year. For students who leave studying to the last minute \"Basic Training\" covers the basics in just four weeks. Other outstanding features include:  Sample tests that closely simulate real exams  Review material based on the contents of the most recent tests  Icons highlighting important facts, vocabulary, and frequently-asked questions  Boxed quotes offering advice from students who have aced the exams and from AP teachers and college professors  Websites and links to valuable online test resources, along with author e-mail addresses for students with follow-up questions  Authors who are either AP course instructors or exam developers",
        "Category": " Study Aids , Advanced Placement",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Dinosaurs (DK Pockets)",
        "Authors": "By Lindsay, William and Clark, Neil",
        "Description": "Offers an overview of dinosaurs, describes the varieties currently known, and explains how scientists gather information about dinosaurs.",
        "Category": " Juvenile Nonfiction , Animals , Dinosaurs & Prehistoric Creatures",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Animal Noises (Copy Cats Spinner Board Books)",
        "Authors": "By Powell, Richard and Martin Larranaga, Ana (ILT)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "Tiger Tales",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Warden (Dover Thrift Editions)",
        "Authors": "By Trollope, Anthony",
        "Description": "An 1855 tale of English ecclesiastical life, this work from the author's Barsetshire series relates the humor and pathos that ensue when a kindly clergyman becomes the subject of a scandalous tabloid treatment charging him with financial impropriety. Features a cast of amusingly realistic and memorable characters, naturalistic dialogue, and consummate plotting.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Legal Tender",
        "Authors": "By Scottoline, Lisa",
        "Description": "Bennie Rosato is a maverick lawyer, and business at her law firm has never been better. Then, without warning, a savage murder tears the firm apart. All evidence points to Bennie, who has motive aplenty and an unconfirmable alibi. Her world turns upside-down as the lawyer becomes the client, and the law is now after her. When another killing takes place, Bennie runs for her life, a fugitive armed only with her wits and courage. She is determined to find the real killer -- or die trying.",
        "Category": " Fiction , Legal",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Dead Ringer (Rosato & Associates Series, 8)",
        "Authors": "By Scottoline, Lisa",
        "Description": "Bennie Rosato is fighting the battle of her life -- against her own twin. The action starts innocently enough, with a stolen wallet, but in no time events escalate and the twin wreaks havoc that can be created only by a dead ringer. Her twin tries to destroy Bennie's law firm, Rosato & Associates, and then strikes at her very heart -- which just happens to be otherwise engaged by a handsome, hunky stranger with the perfect amount of chest hair. But when a brutal murder occurs, Bennie realizes that the stakes have turned deadly. And the face of evil looks like her own.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Overlook (Harry Bosch)",
        "Authors": "By Connelly, Michael",
        "Description": "In his first case since he left the LAPD's Open Unsolved Unit for the prestigious Homicide Special squad, Harry Bosch is called out to investigate a murder that may have chilling consequences for national security. A doctor with access to a dangerous radioactive substance is found murdered in the trunk of his car. Retracing his steps, Harry learns that a large quantity of radioactive cesium was stolen shortly before the doctor's death. With the cesium in unknown hands, Harry fears the murder could be part of a terrorist plot to poison a major American city. Soon, Bosch is in a race against time, not only against the culprits, but also against the Department of Homeland Security and the FBI (in the form of Harry's one-time lover Rachel Walling), who are convinced that this case is too important for the likes of the LAPD. It is Bosch's job to prove all of them wrong.",
        "Category": " Fiction , Literary",
        "Publisher": "Vision",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Guide to Sidrot and Haftarot",
        "Authors": "By Chiel, A.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Ktav Pub Inc",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "A Complicated Kindness",
        "Authors": "By Toews, Miriam",
        "Description": "Sixteen-year-old Nomi Nickel longs to hang out with Lou Reed and Marianne Faithfull in New York City’s East Village. Instead she’s trapped in East Village, Manitoba, a small town whose population is Mennonite: “the most embarrassing sub-sect of people to belong to if you’re a teenager.” East Village is a town with no train and no bar whose job prospects consist of slaughtering chickens at the Happy Family Farms abattoir or churning butter for tourists at the pioneer village. Ministered with an iron fist by Nomi’s uncle Hans, a.k.a. The Mouth of Darkness, East Village is a town that’s tall on rules and short on fun: no dancing, drinking, rock ’n’ roll, recreational sex, swimming, make-up, jewellery, playing pool, going to cities or staying up past nine o’clock.As the novel begins, Nomi struggles to cope with the back-to-back departures three years earlier of Tash, her beautiful and mouthy sister, and Trudie, her warm and spirited mother. She lives with her father, Ray, a sweet yet hapless schoolteacher whose love is unconditional but whose parenting skills amount to benign neglect. Father and daughter deal with their losses in very different ways. Ray, a committed elder of the church, seeks to create an artificial sense of order by reorganizing the city dump late at night. Nomi, on the other hand, favours chaos as she tries to blunt her pain through “drugs and imagination.”  Together they live in a limbo of unanswered questions.Nomi’s first person narrative shifts effortlessly between the present and the past. Within the present, Nomi goes through the motions of finishing high school while flagrantly rebelling against Mennonite tradition. She hangs out on Suicide Hill, hooks up with a boy named Travis, goes on the Pill, wanders around town, skips class and cranks Led Zeppelin. But the past is never far from her mind as she remembers happy times with her mother and sister — as well as the painful events that led them to flee town. Throughout, in a voice both defiant and vulnerable, she offers hilarious and heartbreaking reflections on life, death, family, faith and love.Eventually Nomi’s grief — and a growing sense of hypocrisy — cause her to spiral ever downward to a climax that seems at once startling and inevitable. But even when one more loss is heaped on her piles of losses, Nomi maintains hope and finds the imagination and willingness to envision what lies beyond.Few novels in recent years have generated as much excitement as A Complicated Kindness. Winner of the Governor General’s Award and a Giller Prize Finalist, Miriam Toews’s third novel has earned both critical acclaim and a long and steady position on our national bestseller lists. In the Globe and Mail, author Bill Richardson writes the following: “There is so much that’s accomplished and fine. The momentum of the narrative, the quality of the storytelling, the startling images, the brilliant rendering of a time and place, the observant, cataloguing eye of the writer, her great grace. But if I had to name Miriam Toews’s crowning achievement, it would be the creation of Nomi Nickel, who deserves to take her place beside Daisy Goodwill Flett, Pi Patel and Hagar Shipley as a brilliantly realized character for whom the reader comes to care, okay, comes to love.”This town is so severe. And silent. It makes me crazy, the silence. I wonder if a person can die from it. The town office building has a giant filing cabinet full of death certificates that say choked to death on his own anger or suffocated from unexpressed feelings of unhappiness. Silentium. People here just can’t wait to die, it seems. It’s the main event. The only reason we’re not all snuffed at birth is because that would reduce our suffering by a lifetime. My guidance counsellor has suggested to me that I change my attitude about this place and learn to love it. But I do, I told her. Oh, that’s rich, she said. That’s rich. . .We’re Mennoni",
        "Category": "",
        "Publisher": "Vintage Canada",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Jane Austen in Boca: A Novel",
        "Authors": "By Cohen, Paula Marantz",
        "Description": "It is a truth universally acknowledged that a nice Jewish widower must be in want of a wife.Jane Austen centered her classic novels of manners around \"three or four families in a country village.\"  So does Paula Marantz Cohen in her novel, a witty twist on Pride and Prejudice--except this time, the \"village\" is Boca Raton, Florida. Eligible men, especially ones in possession of a good fortune and country club privileges, are scarce.  When goodhearted meddler Carol Newman learns that the wealthy Norman Grafstein has lost his wife, she resolves to marryhim off to her lonely mother-in-law, May.The novel charts the progress of May's love life as well as that of her two closest friends: the strong-minded former librarian Flo Kliman and the flamboyant Lila Katz. If there weren't confusion enough, Flo's great-niece Amy, a film student at NYU, suddenly arrives with a camera crew determined to get it all on tape.Will May and Norman eventually find happiness? Will Flo succumb to the charms of the suavely cosmopolitan Mel Shirmer? Will Amy's movie about them win an Academy Award--or at least a prize at the NYU student film competition?Complications and misunderstandings abound in this romantic and perceptive comedy of manners. It is a truth universally acknowledged that a nice Jewish widower must be in want of a wife.Jane Austen centered her classic novels of manners around \"three or four families in a country village.\"  So does Paula Marantz Cohen in her novel, a witty twist on Pride and Prejudice--except this time, the \"village\" is Boca Raton, Florida. Eligible men, especially ones in possession of a good fortune and country club privileges, are scarce.  When goodhearted meddler Carol Newman learns that the wealthy Norman Grafstein has lost his wife, she resolves to marryhim off to her lonely mother-in-law, May.The novel charts the progress of May's love life as well as that of her two closest friends: the strong-minded former librarian Flo Kliman and the flamboyant Lila Katz. If there weren't confusion enough, Flo's great-niece Amy, a film student at NYU, suddenly arrives with a camera crew determined to get it all on tape.Will May and Norman eventually find happiness? Will Flo succumb to the charms of the suavely cosmopolitan Mel Shirmer? Will Amy's movie about them win an Academy Award--or at least a prize at the NYU student film competition?Complications and misunderstandings abound in this romantic and perceptive comedy of manners.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "The Woods Colt: A Novel of the Ozark Hills",
        "Authors": "By Thames Williamson",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace and Company",
        "Price Starting With ($)": "9.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1933"
        }
    },
    {
        "Title": "Access: Washington DC (Access Guides)",
        "Authors": "By Wurman, Richard Saul",
        "Description": "Provides information about the parks, shops, galleries, museums, architecture, nightlife, restaurants, and hotels in Washington, Baltimore and the surrounding area",
        "Category": "",
        "Publisher": "Access Press (HarperCollins)",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Bridge in the fourth dimension",
        "Authors": "By Mollo, Victor",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle Books",
        "Price Starting With ($)": "20.8",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Advanced Unix Programming",
        "Authors": "By Rochkind, Marc J.",
        "Description": "",
        "Category": " Computers , Programming , General",
        "Publisher": "Pearson P T R",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Coastal North Carolina and the Outer Banks",
        "Authors": "By n/a",
        "Description": "",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Aerial Photography Services, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Redesigning Humans: Our Inevitable Genetic Future",
        "Authors": "By Stock, Gregory",
        "Description": "Forget worries about cloning people. In the future, technological advances will bring far more meaningful and controversial changes to our offspring, says Gregory Stock. As scientists rapidly improve their ability to identify and manipulate genes, people will want to protect their future children from diseases, help them live longer, and even influence their looks and their abilities. Stock, an expert on the implications of recent advances in reproductive biology, clearly shows that neither governments nor religious groups will be able to stop the coming trend of choosing an embryo's genes.",
        "Category": " Science , Reference",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Into the Light: A Simple Way to Pray with the Sick and the Dying",
        "Authors": "By Delbene, Ron",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Upper Room",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Dictionary of Quotations, The Penguin",
        "Authors": "By Cohen, M. J. and Cohen, John M.",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1960"
        }
    },
    {
        "Title": "China Shakes the World: A Titan's Rise and Troubled Future -- and the Challenge for America",
        "Authors": "By Kynge, James",
        "Description": "“Let China sleep, for when she wakes, she will shake the world.” Napoleon’s words seem eerily prescient today, as the shock waves from China’s awakening reverberate across the globe. In China Shakes the World, the former China bureau chief of the Financial Times, James Kynge, traces these tremors from Beijing to Europe to the Midwest as China’s ravenous hunger for jobs, raw materials, energy, and food -- and its export of goods, workers, and investments -- drastically reshape world trade and politics.Delving beyond mere recitation of by-now-familiar statistics, Kynge’s on-the-ground reporting provides alternative explanations for China's explosive transformation, revealing many of the usual reasons given for its growth to be myths. Most important for the future, he details China’s deep, systemic weaknesses -- rampant fraud, crippling environmental crises, a corrupt banking system, faltering government institutions, a rapidly aging population -- that threaten even greater global disruptions. And he demonstrates the profound consequences of those weaknesses for American manufacturers, oil companies, banks, and ordinary consumers.Through dramatic stories of entrepreneurs and visionaries, factory workers and store clerks at the heart of this global phenomenon, China Shakes the World explains how China’s breakneck rise occurred, the extraordinary problems the country now faces, and the consequences of both for the twenty-first century.",
        "Category": " Business & Economics , International , General",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Best American Comics 2007",
        "Authors": "By Ware, Chris (EDT) and Moore, Anne Elizabeth (EDT)",
        "Description": "Celebrating the best in graphic storytelling and literary comics, a cutting-edge collection, guest edited by the award-winning author of Jimmy Corrigan, the Smartest Kid on Earth, features excerpts from graphic novels, pamphlet comics, newspapers, magazines, mini-comics, and the Web, from R. and Aline Crumb, Art Spiegelman, Seth, Lynda Barry, Kim Deitch, Gilbert Hernandez, and others.",
        "Category": " Comics & Graphic Novels , Anthologies",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Picture Book to Remember Her By: Maryland",
        "Authors": "By Rh Value Publishing",
        "Description": "A collection of photographs revealing the natural vistas, man-made wonders, and tourist attractions of Maryland",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "How to Be Useful: A Beginner's Guide to Not Hating Work",
        "Authors": "By Hustad, Megan",
        "Description": "There's a lot of career advice out there. Much of it dumb. But what if someone read all the advice books -- over a hundred years' worth -- and put all the good ideas in one place? Could you finally escape the cube? Stop mailing things? Be happier?In How to Be Useful, Megan Hustad dismantles the myths of getting ahead and helps you navigate the murky waters of office life. Humorous yet wise, irreverent yet marvelously practical, this book will help you learnWhy \"just being yourself\" is a terrible idea.How to be smart, but not too smart.Why you shouldn't be \"nice.\"When not to be good at your job.How to screw up with grace and dignity.Why shoes matter.The right and wrong ways to talk trash about yourself.That ambition, practiced wisely, is a noble thing.",
        "Category": " Self-help , General",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Fresh Ways With Salads (Healthy and Home Cooking Series)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Fresh Ways With Picnics and Barbeques (Healthy Home Cooking)",
        "Authors": "By",
        "Description": "Provides outdoor recipes for soups, appetizers, sandwiches, meat, poultry, fish, salads, barbecues, quiche, and desserts",
        "Category": " Cooking , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Fresh Ways With Cakes (Healthy Home Cooking)",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Offers advice on baking and gathers recipes for sponge cakes, fruit cakes, cheesecake, microwave cakes, tea cakes, and muffins",
        "Category": " Cooking , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Fresh Ways With Pastries and Sweets (Healthy Home Cooking)",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Shares recipes for pastry doughs, tarts, fruit puffs, eclairs, strudels, sponge cakes, charlottes, meringues, Danish pastries, savarins, and petits fours",
        "Category": " Cooking , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "How to Be a Canadian",
        "Authors": "By Ferguson, Will and Ferguson, Ian",
        "Description": "It isn’t always easy being Canadian, according to Will Ferguson, but it can be a lot of fun. Asked to write a follow-up to his runaway bestseller Why I Hate Canadians, Ferguson, who’s Canadian himself, recruited his brother Ian ? comedy writer and executive producer of the Canadian series Sin City and a Canadian too ? to create this ultimate guide to the country's cultural quirks. The result is a hilarious inside look at that unique species, the Canadian, and their thoughts on such diverse subjects as beer, sex, dating rituals, sports, politics, religion, social rules ? and, of course, their trademark death-defying search for the middle of any road.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Douglas & McIntyre",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Of Love and Russia: The Eleven-Year Fight for My Husband and Freedom",
        "Authors": "By McClellan, Irina",
        "Description": "Recounts the author's frustration in being denied exit from Russia with her American husband, the dangerous political activism she undertook, and their hard-won reunion and new life in the United States",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "The World After Oil The Shifting Axis of Power and Wealth",
        "Authors": "By Nussbaum, Bruce",
        "Description": "",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "We Might As Well Win: On the Road to Success with the Mastermind Behind a Record-Setting Eight Tour de France Victories",
        "Authors": "By Armstrong, Lance (FRW), Bruyneel, Johan, and Strickland, Bill",
        "Description": "On the tour and inside the mind of Johan Bruyneel, the winningest team leader in cycling history and the mastermind behind the success of the world’s most celebrated champion, Lance ArmstrongJohan Bruyneel knows what it takes to win. In 1998, this calculating Belgian and former professional cyclist looked a struggling rider and cancer survivor in the eye and said, “Look, if we’re going to ride the Tour, we might as well win.” In that powerful phrase a dynasty was born. With Bruyneel as his team director, Lance Armstrong seized a record seven straight Tour de France victories. In the meantime, Bruyneel innovated the sport of cycling and went on to prove he could win without his superstar -- in 2007 he took the Tour de France title with a young new team and a lot of nerve, sealing his place in sports history forever.    We Might as Well Win takes readers behind the scenes of this amazing nine-year journey through the Alps and the Pyrenees, revealing a radical recipe for winning that readers can adapt from the bike to the boardroom to life. We witness Bruyneel’s near-death crash and comeback as a rider. We are privy to the many ways he and Armstrong outsmarted their opponents. We listen in on the team’s race radios to hear the secret strategies that inspire greatness from a disparate team. We learn how to make sure \"not winning\" isn’t the same as \"losing\" as Bruyneel struggles to prove himself -- post-Armstrong -- with new riders, new strategies, and skeptics around every corner.    Whether mounting a difficult climb, or managing a team of thirty riders and forty support staff from a miniature car hurtling along narrow European roads, or looking a future legend in the eye and willing him to believe, Bruyneel is, and has always been, the consummate winner. Readers will relish this inside tour.",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "The Czech black book",
        "Authors": "By Littell, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Wrecked (Richard Jackson Books (Atheneum Hardcover))",
        "Authors": "By Frank, E. R.",
        "Description": "Dear anyone who cared about Cameron,I was the driver of the \"other\" car.The police and my mother and father and plenty of people are saying that I didn't kill her. But I know I did. That's what her parents must believe. And my brother, Jack. He always sees what's true. I want to tell him how sorry I am about the accident. I want to say a lot of things to him and to everybody. Like how Cameron was smart and beautiful and kind in a way that isn't all that common in high school. Like how much Jack loved her and how sometimes I can hear him crying through the wall at night. I want to say how bad everything can get.In one split second.Upside down and shattered.Just like that.Wrecked.",
        "Category": " Young Adult Fiction , Family , Siblings",
        "Publisher": "Atheneum/Richard Jackson Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Darwin Conspiracy",
        "Authors": "By Darnton, John",
        "Description": "From the author of the bestselling Neanderthal comes this novel of gripping suspense and scientific conquest–a page-turning historical mystery that brilliantly explores the intrigue behind Darwin and his theory of evolution.It’s 1831, and aboard HMS Beagle the young Charles Darwin sets off down the English Channel for South America. More than 150 years later, two ambitious scholars pursuing their obsession with Darwin (and with each other) come across the diaries and letters of Darwin’s daughter. What they discover is a maze of violent rivalries, petty deceptions, and jealously guarded secrets, and the extraordinary story of an expedition embarked upon by two men. Only one returned–and changed history forever.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "German Painting in the 20th Century",
        "Authors": "By Roh, Franz",
        "Description": "",
        "Category": "",
        "Publisher": "New York Graphic Society",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Twenty Blue Devils (Gideon Oliver Mysteries)",
        "Authors": "By Elkins, Aaron J.",
        "Description": "The dead man is the manager of Tahiti's Paradise Coffee plantation, producer of the most expensive coffee bean in the world - the winey, luscious Blue Devil. His fall from a cliff is the latest accident in a string of mishaps, and although nothing tangible points to foul play, FBI agent John Lau has his suspicions. What he needs is evidence - and the best forensic expert in the business, his friend anthropologist Gideon Oliver, the Skeleton Detective.Gideon likes his java strong and his bones ancient, dry, and dusty. But the body he must examine had lain in the tropical sun for a week before it was found, and then buried native-style, without a casket. If this case is not exactly Gideon's cup of...well, tea, it is not the state of the remains that bothers him. It's the real human ugliness he suspects he'll soon unearth.To make matters worse, Gideon finds trouble in paradise: a most unwelcoming local police commandant, a strange reluctance by the Blue Devil owners to uncover any wrong-doing, and the lack of an exhumation order. Sneaking into a graveyard with a shovel and flashlight isn't his idea of a professional analysis. And what he finds six feet under will prove the ultimate test of his skills: a subtle clue that points to foul play, and bones so puzzling that they have Gideon stumped...for a while. Now Gideon must cut to the heart of a crime to find the motive that may have percolated through a family for decades - and brewed a taste for murder.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Public Administration: a Comparative Perspective",
        "Authors": "By ferrel heady",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "The End of Food",
        "Authors": "By Roberts, Paul",
        "Description": "Paul Roberts, the best-selling author of The End of Oil, turns his attention to the modern food economy and finds that the system entrusted to meet our most basic need is failing. In this carefully researched, vivid narrative, Roberts lays out the stark economic realities behind modern food and shows how our system of making, marketing, and moving what we eat is growing less and less compatible with the billions of consumers that system was built to serve. At the heart of The End of Food is a grim paradox: the rise of large-scale food production, though it generates more food more cheaply than at any time in history, has reached a point of dangerously diminishing returns. Our high-volume factory systems are creating new risks for food-borne illness, from E. coli to avian flu. Our high-yield crops and livestock generate grain, vegetables, and meat of declining nutritional quality. While nearly one billion people worldwide are overweight or obese, the same number of people—one in every seven of us—can’t get enough to eat. In some of the hardest-hit regions, such as sub-Saharan Africa, the lack of a single nutrient, vitamin A, has left more than five million children permanently blind. Meanwhile, the shift to heavily mechanized, chemically intensive farming has so compromised soil and water that it’s unclear how long such output can be maintained. And just as we’ve begun to understand the limits of our abundance, the burgeoning economies of Asia, with their rising middle classes, are adopting Western-style, meat-heavy diets, putting new demands on global food supplies. Comprehensive in scope and full of fresh insights, The End of Food presents a lucid, stark vision of the future. It is a call for us to make crucial decisions to help us survive the demise of food production as we know it. Paul Roberts is the author of The End of Oil, which was a finalist for the New York Public Library&#39;s Helen Bernstein Book Award in 2005. He has written about resource economics and politics for numerous publications, including the Los Angeles Times, the Washington Post, Harper’s Magazine, and Rolling Stone, and lectures frequently on business and environmental issues.",
        "Category": " Social Science , Agriculture & Food",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Three Nights In August: Strategy, Heartbreak, and Joy Inside the Mind of a Manager",
        "Authors": "By Bissinger, H. G.",
        "Description": "A Pulitzer Prize-winning author captures baseball’s strategic and emotional essences through a point-blank account of one three-game series viewed through the keen eyes of legendary manager Tony La Russa. Drawing on unprecedented access to a manager and his team, Bissinger brings the same revelatory intimacy to major-league baseball that he did to high school football in his classic besteller, Friday Night Lights.Three Nights in August shows thrillingly that human nature -- not statistics -- can often dictate the outcome of a ballgame. We watch from the dugout as the St. Louis Cardinals battle their archrival Chicago Cubs for first place, and we uncover delicious surprises about the psychology of the clutch, the eccentricities of pitchers, the rise of video, and the complex art of retaliation when a batter is hit by a pitch. Through the lens of these games, Bissinger examines the dramatic changes that have overtaken baseball: from the decline of base stealing to the difficulty of motivating players to the rise of steroid use. More tellingly, he distills from these twenty-seven innings baseball's constants -- its tactical nuances, its emotional pull.During his twenty-six years of managing, La Russa won more games than any other current manager and ranks sixth all-time. He has been named Manager of the Year a record five times and is considered by many to be the shrewdest mind in the game today. For all his intellectual attainments, he’s also an antidote to the number-crunching mentality that has become so modish in baseball. As this book proves, he's built his success on the conviction that ballgames are won not only by the numbers but also by the hearts and minds of those who play.",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "137.48",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Mapping the Edge: A Novel",
        "Authors": "By Dunant, Sarah",
        "Description": "Anna, a self-sufficient and reliable single mother, packs her bags one day for a short vacation to Italy. She leaves her beloved daughter at home in London with good friends. When Anna doesn’t return, everyone begins to make excuses, until the likelihood that she might not come back at all becomes chillingly clear. In this dazzling work of suspense, Sarah Dunant interweaves parallel narratives that are stretched taut with tension even as they raise difficult questions about love, trust, and accountability. We are challenged, unnerved, and ultimately exhilarated as Dunant redefines the boundaries of the psychological thriller.",
        "Category": " Fiction , Psychological",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Extraordinary Cases of Sherlock Holmes (Puffin Classics)",
        "Authors": "By Doyle, Arthur Conan, Sir",
        "Description": "The great detective solves eight baffling cases involving a family curse, a secret code, a missing racehorse, an impossible murder, a stolen jewel, blackmail, six identical sculptures, and a missing soccer player",
        "Category": " Young Adult Fiction , Classics",
        "Publisher": "Puffin",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Third Person Singular: A Mars Bahr Mystery (Mars Bahr Mysteries)",
        "Authors": "By Erickson, K. J.",
        "Description": "Set against the black backdrop of a ruthless Minnesota winter, KJ Erickson's debut novel is bursting with masterfully plotted suspense and intricately rendered characters.Prickly but gifted Minneapolis Special Detective Marshall \"Mars\" Bahr is a man whose devotion to his eight-year-old son is eclipsed only by his love of the hunt. Mars hasn't won any popularity contests among his fellow officers, but his commitment to his job and his investigative talents have gotten him a plumb assignment: Special Detective in charge of the First Response Unit, reporting directly to the chief.On a winter morning, when Mars is called to the scene of a homicide near the outskirts of town, his first thought is that a homeless drunk passed out in the wrong place on a freezing cold night. What he finds turns out to be much more menacing, a nightmare case involving a teenage girl from the right side of the tracks.With few clues and increasing pressure from the mayor on down to apprehend the killer, Mars is forced to turn away from the details of the crime on the bluffs and instead focus on the victim herself. Mary Pat Fitzgerald seemed to have a storybook lifestyle, at least from the outside. With a little digging, however, it becomes clear that appearances can be deceiving. Mars and his partner, Nettie Frisch, turn up some provocative clues in the search to uncover the truth about the young woman's lonely death-- but can they trust them?Third Person Singular is a multilayered screamer of a debut that will have readers breathlessly awaiting KJ Erickson's next effort.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Rabbit Boss",
        "Authors": "By Sanchez, Thomas",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1974"
        }
    },
    {
        "Title": "The Taft Story",
        "Authors": "By White, William S.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper",
        "Price Starting With ($)": "11.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1954"
        }
    },
    {
        "Title": "Finding Nouf: A Novel",
        "Authors": "By Ferraris, Zoe",
        "Description": "Zoë Ferraris’s electrifying debut of taut psychological suspense offers an unprecedented window into Saudi Arabia and the lives of men and women there. When sixteen-year-old Nouf goes missing, along with a truck and her favorite camel, her prominent family calls on Nayir al-Sharqi, a desert guide, to lead a search party. Ten days later, just as Nayir is about to give up in frustration, her body is discovered by anonymous desert travelers. But when the coroner’s office determines that Nouf died not of dehydration but from drowning, and her family seems suspiciously uninterested in getting at the truth, Nayir takes it upon himself to find out what really happened to her. This mission will push gentle, hulking, pious Nayir, a Palestinian orphan raised by his bachelor uncle, to delve into the secret life of a rich, protected teenage girl—in one of the most rigidly gender-segregated of Middle Eastern societies. Initially horrified at the idea of a woman bold enough to bare her face and to work in public, Nayir soon realizes that if he wants to gain access to the hidden world of women, he will have to join forces with Katya Hijazi, a lab worker at the coroner’s office. Their partnership challenges Nayir, bringing him face to face with his desire for female companionship and the limitations imposed by his beliefs. It also ultimately leads them both to surprising revelations. Fast-paced and utterly transporting, Finding Nouf offers an intimate glimpse inside a closed society and a riveting literary mystery.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "The Strange Death of Mistress Coffin",
        "Authors": "By Begiebing, Robert J.",
        "Description": "The time is the late 1640s, the place, the New England coast. A young woman has been found dead, stripped naked and thrown in a river. Her husband has mysteriously halted his legal proceedings against the most likely suspect, who has disappeared into the wilderness. Based on an actual unsolved murder that took place in colonial New Hampshire, Robert J. Begiebing's THE STRANGE DEATH OF MISTRESS COFFIN is at once a spellbinding mystery and a fascinating evocation of life in early America. \"Unusual and mesmerizing. A striking and original work by a gifted writer with an extraordinary feeling for the past.\"--E. Annie Proulx, The New York Times Book Review; \"Begiebing illuminates 'the dark and wonderful intricacy' of the human heart.\"-- Yankee. A MYSTERY BOOK CLUB MAIN SELECTION and a LITERARY GUILD SELECTION.",
        "Category": " Fiction , Historical",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "For the Roses",
        "Authors": "By Garwood, Julie",
        "Description": "No one ever knew what kind of strays, from animals to weary travelers, Mary Rose Clayborne would bring home next.Sometimes her four brothers? runaway slave Adam, ax-pickpocket Douglas, gunslinger Cole, and con man Travis -- wondered whether her boarding school education did a lick of good now that their beautiful, impulsive little sister was back in Blue Belle, Montana. Of course, everyone in town knew better than to mess with the Claybornes. The brothers, four of the toughest hombres in the West, had once been a mismatched gang of street urchins. But they had found an abandoned baby girl in a New York City alley, named her Mary Rose, headed West, and raised her to be a lady. Through the years the Claybornes had become a family, held together by loyalty and love if not by blood -- when they suddenly faced the crisis that could tear them apart. That crisis came to town with Lord Harrison Stanford MacDonald. In his fine clothes, he looked every inch a dude. Mary Rose figured that if she didn't interfere, this handsome Englishman would get himself killed, so she took him home to the Clayborne ranch to ask her brothers to turn him into a cowboy. She didn't suspect MacDonald was a chameleon, not the greenhorn he appeared to be. He'd prove fast with a gun, quick with his fists, and capable of commanding the Claybornes's respect -- if not their trust. He'd also soon be desperately in love with Mary Rose. She returned his affection blissfully and wholeheartedly...until MacDonald revealed a secret that challenged everything she believed about her love, herself, and her life. Now Mary Rose's search for identity and meaning would begin, sending her to England, to the family she lost long ago. Her soul hungered for the freedom of the American West, but she was being drawn away from all she cared about by the need to know her past...and by her uncertain but still potent love for MacDonald. Torn between conflicting loyalties, Mary Rose wasn't sure who she really was, or where she belonged...questions that could only be answered if she listened to the truth within her heart.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "What is This Jewish Heritage?",
        "Authors": "By Ludwig Lewisohn",
        "Description": "",
        "Category": "",
        "Publisher": "B' Nal B'Rith Hillel Foundations",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Jamaica's Find (Reading Rainbow)",
        "Authors": "By O'Brien, Anne Sibley (ILT) and Havill, Juanita",
        "Description": "Jamaica finds a stuffed dog at the playground and after taking him home without trying to find the owner discovers her conscience as well. Jamaica’s honest and appealing character inspired five more books, each about a childhood ethical dilemma.",
        "Category": " Juvenile Fiction , People & Places , United States , African American",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Kennedy Justice",
        "Authors": "By Navasky, Victor",
        "Description": "",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "20.85",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Picture Bride: A Novel",
        "Authors": "By Uchida, Yoshiko",
        "Description": "",
        "Category": " Fiction , Historical",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Calm My Anxious Heart: A Woman's Guide to Finding Contentment",
        "Authors": "By Dillow, Linda",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Navpress Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The farmer's own book: A treatise on the numerous diseases of the horse, with an explanation of their symptoms, and the course of treatment to be pursued",
        "Authors": "By Koogle, J. D",
        "Description": "",
        "Category": "",
        "Publisher": "Printed by McCoull & Slater",
        "Price Starting With ($)": "65.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1857"
        }
    },
    {
        "Title": "Spring Cleaning: The Spirit of Keeping Home",
        "Authors": "By Nassif, Monica",
        "Description": "Whatever the season, Spring Cleaning celebrates the rewarding ritual of refreshing your home from top to bottom. Here is clear and practical advice for how to shake the dust from the cushions, chase cobwebs from the corners, and throw open those squeaky-clean windows to let in the clean, fresh breeze.",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Spaceflight: The Complete Illustrated Story - from the Earliest Designs to Plans for the 21st Century (Smithsonian Guides)",
        "Authors": "By Neal, Valerie, Lewis, Cathleen S., and Winter, Frank H.",
        "Description": "Spaceflight This comprehensive, easy-to-use guide tells the fascinating story of one of the greatest scientific achievements of our times?the conquest of space. Produced in association with the world-renowned Smithsonian Institution and its scientific experts, Spaceflight recounts the epic adventure of the men, women, and machines that took us into space. This Smithsonian Guide features: Detailed text by Smithsonian experts clearly explaining how spaceflight developed More than 350 full-color photographs and explanatory illustrations of spacecraft, equipment, people, and events Full-color foldout timeline of spaceflight milestones decade by decade 40-page quick-access A-to-Z glossary, including capsule biographies, special terms, and key concepts Other titles: Aviation ? Planets ? Zoo Animals ? Automobiles ? Railroads",
        "Category": " Technology & Engineering , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Langenscheidt's Pocket Dictionary: Spanish-English / English-Spanish (Langenscheidt Pocket Dictionaries) (English and Spanish Edition)",
        "Authors": "By Langenscheidt",
        "Description": "",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Langenscheidt Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Queen of Babble in the Big City",
        "Authors": "By Cabot, Meg",
        "Description": "Lizzie Nichols is back, pounding the New York City pavement and looking for a job, a place to live, and her proper place in the universe (not necessarily in that order).\"Summer Fling\" Luke's use of the \"L\" (Living Together) word has her happily abandoning plans to share a one-room walk-up with best friend Shari in exchange for cohabitation with the love of her life in his mom's ritzy Fifth Avenue pied-à-terre. Lizzie's landed a non-paying gig in her chosen field—vintage wedding gown rehab—and a paying one as a receptionist at Shari's boyfriend's father's posh law firm. So life is good . . . for the moment.But almost immediately her notoriously big mouth is getting her into trouble. At work she's becoming too chummy with society bride-to-be Jill Higgins, inflaming the ire of Jill's troublesome future mother-in-law. At home she's made the grievous error of bringing up the \"M\" (Marriage) word to commitment-shy Luke. Once again joblessness and homelessness are looming large for hapless blabbermouth Liz—unless she can figure out some way to babble her way to a happily ever after.",
        "Category": " Fiction , Women",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Hug",
        "Authors": "By Alborough, Jez and Alborough, Jez (ILT)",
        "Description": "\"Alborough's simplicity results in another gem.\" — School Library JournalBobo needs a hug. But his friends don't seem to understand. \"Hug,\" he implores, time and again. Time and again his puzzled pals — from the smallest chameleon to the tallest giraffe — shrug and cuddle with their jungle mothers. As the lonely chimp's plea escalates, his friends grow concerned. Can the elephants lead Bobo to his heart's desire? Jez Alborough, the acclaimed author-illustrator of Where's My Teddy?, It's the Bear!, and My Friend Bear transforms a total of three words — and some of the most tenderly expressive animals ever created — into an endearing tribute to love and belonging.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Baby Elf's Christmas",
        "Authors": "By Cowen-Fletcher, Jane and Cowen-Fletcher, Jane (ILT)",
        "Description": "From the creator of BABY ANGELS comes an endearing holiday tale of a tiny elf in a board book — just the right size to tuck in a stocking.For Baby Elf, holiday time is full of excitement — clutching a jingle bell as big as himself, watching (real) fairies light up the tree, decorating holiday treats. In a season of first experiences, what will the fi rst gift from Baby Elf be? With soft pastels glowing red and green, Jane Cowen-Fletcher illuminates the magic of the holidays, magnified through a little one's eyes.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Lessons I Learned in the Dark: Steps to Walking by Faith, Not by Sight",
        "Authors": "By Rothschild, Jennifer",
        "Description": "At the age of fifteen, Jennifer Rothschild confronted two unshakable realities: Blindness is inevitable ... and God is enough. Now this popular author, speaker, and recording artist offers poignant lessons that illuminate a path to freedom and fulfillment. With warmth, humor, and insight,Jennifer shares the guiding principles she walks by -- and shows you how to walk forward by faith into God's marvelous light.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Eating in Italy: A Traveler's Guide to the Gastronomic Pleasures of Northern Italy",
        "Authors": "By Echtermeyer, Faith and Willinger, Faith Heller",
        "Description": "Describes the menu, wine list, and specialties of the best restaurants in each region of northern Italy",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    }
]