[
    {
        "Title": "Don't Die Broke: How to Turn Your Retirement Savings into Lasting Income",
        "Authors": "By Malaspina, Margaret A.",
        "Description": "This guide can help everyone get the most out of what they've earned, lower their tax bills, and create a stream of income that will last for the rest of their lives. There are hundreds of books on saving for retirement and investing in retirement. This one is different. It's about the decisions people can, should, and must make when it comes time to take charge of the money they've saved.",
        "Category": " Business & Economics , Personal Finance , Retirement Planning",
        "Publisher": "Bloomberg Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Sports physiology",
        "Authors": "By Fox, Edward L",
        "Description": "",
        "Category": "",
        "Publisher": "Saunders",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Tales of the Sea: Lord Jim, Typhoon, Children of the Sea, Amy Foster and Youth",
        "Authors": "By Conrad, Joseph",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Castle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "The Civil War: The Commanders...; The Battlefields...; The Fighting Men...",
        "Authors": "By Davis, William C.",
        "Description": "",
        "Category": "",
        "Publisher": "Chrysalis Books",
        "Price Starting With ($)": "19.98",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Whitetails: Behavior, Ecology, Conservation",
        "Authors": "By Bauer, Erwin A, Bauer, Peggy (PHT), and Bauer, Erwin A. (PHT)",
        "Description": "",
        "Category": " Nature , Animals , Wildlife",
        "Publisher": "Voyageur Pr",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Photographic Atlas of Planets",
        "Authors": "By Briggs, Geoffrey",
        "Description": "Maps and satellite photographs show the features of the Earth, Moon, Mercury, Venus, Mars, Jupiter, Saturn and their moons",
        "Category": " Science , Astronomy",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "A Casual Brutality",
        "Authors": "By Bissoondath, Neil",
        "Description": "Leaving Toronto for Casaquemada, the Caribbean island of his birth, Dr. Raj Rassingh finds the formerly affluent community now plagued by random violence and widespread paranoia",
        "Category": " Fiction , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Saying No Is Not Enough Second Edition: Helping Your Kids Make Wise Decisions About Alcohol, Tobacco, and Other Drugs-A Guide for Parents of Children Ages 3 Through 19",
        "Authors": "By Schwebel, Robert",
        "Description": "The challenge: How to raise children in a drug-filled society and prevent substance abuseDr. Schwebel's Recommendations:Start when your children are youngCreate a family climate for communicationShow your children how to meet their needs without drugsHelp kids understand the dangers of drugsHelp them learn to resist peer pressureTeach your children how to make wise decisionsEstablish give-and-take discussions with teensStay alert to potential drug problems and know how to respondHow to listen and what to say in order to accomplish these goals is what Saying No Is Not Enough is all about. Now in its second edition, this valuable prevention and intervention guide for parents and professionals by Dr. Schwebel, one of the nation's experts, presents his complete, step-by-step program, refined and time-tested over the last twenty-five years.What's New in This Second Edition:A full chapter on tobaccoRecommendations about parents discussing their own substance useWhat to do about drug testingMore on marijuana, the myths vs. the realitiesMore on how to deal with lying and dishonestyMore on intervention for parents whose kids are already harmfully involved with drugs",
        "Category": " Self-help , Substance Abuse & Addictions , Drugs",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Encyclopedia of Mysterious Places: The Life and Legends of Ancient Sites Around the World",
        "Authors": "By Wilkinson, Philip and Ingpen, Robert R.",
        "Description": "Tours some of the world's most interesting places, from the ziggurats of the Middle East to the mystifying lines at Nasca, Peru",
        "Category": "",
        "Publisher": "Viking Studio Books / Penguin Group",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "100% Practical Strategies for Teachers",
        "Authors": "By Barber, Gruber",
        "Description": "Over 300 spiral-bound pages include activities that take little or no preparation time, helping you work smarter, not harder!  Easy-to-implement strategies help you keep your teaching program and the learning day organized. A comprehensive guide for the classroom teacher!",
        "Category": " Education , Elementary",
        "Publisher": "Frank Schaffer",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Joy of Simple Living: Over 1,500 Simple Ways to Make Your Life Easy and -- At Home and at Work",
        "Authors": "By Davidson, Jeffrey P.",
        "Description": "Chances are, your life is overflowing with unnecessary clutter and confusion--from the \"junk drawer\" in the kitchen to the overloaded \"in box\" at the office to the ever-growing list of tasks to complete and errands to run.  With the increasingly hectic, stressful lives that more and more people are leading today, is it possible for anyone to handle the overwhelming demands on their time and still get through the day with ease?  The Joy of Simple Living will teach you just how easy it is to get back to the basics.This book will change your life.  It provides more than 1,500 easy, specific tips and techniques for cutting back, paring down, and breathing easier--without sacrificing the quality of life you deserve.  Open the book to any page and you'll find it filled with practical ideas.  The Joy of Simple Living examines every single room of your house, plus your car and your office.  Not only will you learn to create an orderly home, you'll become a more effective spouse, parent, and worker by learning how to prioritize and simplify.  You'll have more free time, more money, and a greater peace of mind when you realize the joy that simple living can bring.",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Reference Guide to United States Military History 1945 to the Present",
        "Authors": "By Shrader, Charles Reginald (EDT)",
        "Description": "Spanning the years from 1607 to the present, the Reference Guide to United States Military History series covers the significant issues, events, battles, innovations, and personalities in the history of the armed forces in America. Volume 5, the final volume, covers the period from the end of WWII to the present. The seven narrative chapters are supplemented by biographical profiles of the military leaders of the period, detailed descriptions of the principal battles and events, and the discussion of special topics. Maps and illustrations (b&w) depict military leaders, military life, battles, and other events. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , Military , United States",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "24.33",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The New Black Mask #5",
        "Authors": "By Layman, Richard (EDT) and Bruccoli, Matthew Joseph (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Classical Music: The 50 Greatest Composers and Their 1,000 Greatest Works",
        "Authors": "By Goulding, Phil G.",
        "Description": "MAKE A SOUND INVESTMENT IN CLASSICAL MUSICWho are the ten most important classical composers? Who in the world was Palestrina? Why did Stravinsky's \"Rite of Spring\" cause a riot? Which five of each important composer's works should you buy? What is a concerto and how does it differ from a sonata?Maybe you don't know the answers to these questions; author Phil Goulding certainly didn't. When Goulding first tried to learn about classical music, he found himself buried in an avalanche of technical terms and complicated jargon--so he decided to write the book he couldn't find.The result is a complete classical music education in one volume. Comprehensive, discriminating, and delightfully irreverent, Classical Music provides such essential information as:* Rankings of the top 50 composers (Bach is #1. Borodin is #50) * A detailed and anecdotal look at each composer's life and work * The five primary works of each composer and specific recommended CDs for each. * Further great works of each composer--if you really like him * Concise explanations of musical terminology, forms, and periods * A guide to the parts and history of the symphony orchestra \"This book uses every conceivable gimmick to immerse readers in the richness of classical music: lists, rankings, sidebars devoted to lively anecdotes, and catchy leads.\"--The Washington Post\"One terrific music appreciation book...The information is surprisingly detailed but concisely presented. Goulding's writing style is breezy yet mature....[He] has raised music appreciation from a racket to a service.\"--The Arizona Daily Star",
        "Category": " Music , Genres & Styles , Classical",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Pictorial History of the American People",
        "Authors": "By Slosson, Preston W.",
        "Description": "",
        "Category": "",
        "Publisher": "New York: Gallery Books. \"A Bison Book\"",
        "Price Starting With ($)": "8.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Self-Nurture: Learning to Care for Yourself As Effectively As You Care for Everyone Else",
        "Authors": "By Domar, Alice D.",
        "Description": "Everyone knows someone who needs this bookThink about how you feel at the end of a day when you find your first free moment so late in the evening that you're too exhausted to enjoy it. If you've had too many days like this, find the help you need to transform your life in Self-Nurture. Harvard psychologist Alice D. Domar, Ph.D., shows you how to restructure your life in a way that lets you breathe. Here are inspiring stories, easy-to-follow exercises, and meditations that will shift your focus from self-sacrifice to self-care. Written with wisdom and humor, Self-Nurture will empower you to develop the same fierce and tender concern for yourself that you've always given to those you love--a gift for anyone who needs to learn the art of self-care.To listen to an interview with Alice Domar, check out www.TalktoTara.com",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Making of Master and Commander: The Far Side of the World",
        "Authors": "By McGregor, Tom",
        "Description": "Peter Weir's astonishing film brings Patrick O'Brian's world to life, complete with its swashbuckling adventures, brilliantly drawn characterization, romance, and intrigue. It is sure to captivate stalwart enthusiasts of O'Brian's work as well as draw in new fans everywhere. With unique access to the cast and crew, Tom McGregor traces the project, from the actors' boot camp to the filming in the Galapagos Islands and on board a replica ship (in the same studio where Titanic was filmed).With exclusive photographs and interviews with key members of the cast, including Russell Crowe and Paul Bettany (A Beautiful Mind), and director Peter Weir (Dead Poets' Society, Green Card, The Truman Show), this book records the painstaking work of the crew and stars in making the film as historically accurate as possible, from replicating the uniforms of Nelson's navy to bringing the gun deck of the Surprise incredibly to life. Exclusive behind-the-scenes insight and information on the history of the project are dazzlingly showcased in this unique companion, featuring the same high production standards and imagination as the film itself.",
        "Category": " Performing Arts , Film , Direction & Production",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "What Nurses Know and Doctors Don't Have Time to Tell You: Practical Wisdom for Everyday Home Health Care",
        "Authors": "By Carroll, Patricia",
        "Description": "This comprehensive, accessible home reference guide addresses a wide range of health concerns-as only a nurse who knows the inside story on healthcare can. From headaches to ankle sprains, asthma to zinc remedies, this authoritative resource reveals what everyone needs to know in order to get healthy-and stay that way. The book features hundreds of tips on easing symptoms, promoting healing, following a treatment plan, and solving both the big and small problems that arise when someone is sick, hurt, or in pain.    Readers will discover how to:   € Treat everyday health complaints and minor injuries  € Heal faster after an injury  € Get the best results from medicines while reducing side effects  € Recover more comfortably at home after outpatient surgery",
        "Category": " Health & Fitness , Reference",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Thunder at Twilight: Vienna, 1913-1914",
        "Authors": "By Morton, Frederic",
        "Description": "A recreation of Vienna on the eve of WWI. By the author of  A Nervous splendor  and  The Rothschilds  (both nominated for the National Book Award). Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , Europe , Italy",
        "Publisher": "Scribner",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Designs for American Gardens",
        "Authors": "By Ireys, Alice Recknagel",
        "Description": "Presents garden plans for every size property, from a half-acre suburban lot to a few acres in the country, to a twenty-acre estate",
        "Category": " Gardening , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Modern Baptists (An Alison Press book)",
        "Authors": "By Wilcox, James",
        "Description": "",
        "Category": "",
        "Publisher": "Alison Press",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Keys Cuisine: Flavors of the Florida Keys",
        "Authors": "By Gassenheimer, Linda",
        "Description": "Over 175 recipes featuring the fish, shellfish, fruits, and vegetables of America’s tropical paradise.\"This instructive and exciting book is a must for anyone interested in Americana, good cuisine, and that last frontier of cooking, the Florida Keys.\"--Jacques Pepin",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Atlantic Monthly Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Quick Harvest: A Vegetarian's Guide to Microwave Cooking",
        "Authors": "By Baird, Pat",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Eight American Poets",
        "Authors": "By Conarroe, Joel (EDT)",
        "Description": "Provides a generous sampling of the highly celebrated as well some of the less celebrated poetry published since 1940 by this group of powerful and important writers (of whom only Ginsberg and Merrill are still with us). Editor Conarroe's introductory biographical essays frame the poems that follow. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "RANDOM HOUSE",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Self Concept and School Achievement",
        "Authors": "By Purkey, William Watson",
        "Description": "Draws a parallel between a student's scholastic performance and his self concept, and offers teachers a guide to humanistic education",
        "Category": " Education , General",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1970"
        }
    },
    {
        "Title": "The Fire of God",
        "Authors": "By Talbot, John Michael",
        "Description": "Examines the problems that beset people today, including materialism, lust, anger, and the nuclear holocaust, and discusses Moses, Jesus, and evangelism",
        "Category": " Religion , General",
        "Publisher": "Crossroad Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Freud: Conflict and Culture: Essays on His Life, Work, and Legacy",
        "Authors": "By Roth, Michael (EDT)",
        "Description": "In Freud: Conflict and Culture, Michael S. Roth presents eithgteen essays on the man who has become, in W.H. Auden's phrase, \"a whole climate of opinion.\"  This fascinating collections explores Freud's work, the absorption of his theories into mainstream culture, and his hotly contested legacy.  Oliver Sacks demonstrates how Freud's early studies anticipated contemporary neuropsychology.  Scholar Muriel Dimen reveals a paradoxical liaison between psychoanalysis and feminism.  Art Spiegelman (Maus) provides a comic strip that explores Freud's ideas about humor.  And Peter Kramer (Listening to Prozac) projects how future generations may look upon the man who, along with Marx, Darwin, and Einstein, shaped an era.  By turns moving, contentious, and amusing, Freud: Conflict and Culture boasts a body of work as eclectic and engaging as the revolutionary genius himself.",
        "Category": " Psychology , History",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "A Girl Could Stand Up: A Novel",
        "Authors": "By Marshall, Leslie",
        "Description": "A debut novel of startling originality that follows a young girl's passionate and eccentric quest for invincibility, courage, trust, and love.Leslie Marshall's first novel is a startling, fresh, totally captivating new voice. With Elray Mayhew, she has created perhaps one of literature's more unforgettable young heroines. Elray Mayhew loses her parents on her sixth birthday at an amusement park going through the Tunnel of Love. The boat the three of them are in is leaking and Barkely and Jack's feet are on the wet floor so that when the electrical moon falls from the ceiling and into their laps, they are electrocuted. Elray survives intact except for a crescent shaped scar on her right underarm. In following years she can touch the scar and communicate with them, receiving instructions, or offbeat and amusing comments, in their distinctive voices.Elray, orphaned, is now in the custody of two uncles, brothers each of Barkley and Jack. Harwood is a macho, heavily-drinking photographer who travels about the world on assignments. Aunt Ajax, as he prefers to be called, is a cross-dressing gay man who gives up his fringe existence in New York to come to Washington, move into Barkley and Jack's old house in the Cleveland Park, and throw himself full throttle into motherhood, albeit, at times, a misguided version of it.Elray doesn't speak for days and spends most of her time hiding in a crawlspace under the house. During a gathering after her parent's funeral she's there, listening to everyone shuffle above her and hearing them call her name, when she lets out her second massive scream. It's her voice returning, her Aunt Ajax, one of her new official guardians, runs to check on her. Following her is her Uncle Harwood, official guardian #2. The three of them, camped out under the house, decide to mark the day as Crawlspace Day. Crawlspace Day will be celebrated annually to mark the day that their lives became entwined, and she'll receive, belatedly, her cake and her gifts, all under the house.By the time she's twelve, Elray is spending all her time creating adventures and going on solo explorations. One day, creeping through the crypts of the Washington Cathedral that is near Half-Moon Street, she comes eye to eye with Raoul Person, a boy just her age as awkward, precocious, and alone as she is. Their story is the beating heart of this novel. They connect immediately, and together they form a partnership to practice \"the art of invincibility\"-something they'd both been trying to conquer-and christen themselves The Invincible Heels. He's her fellow knight and from crafting amateur black and white movies, to imitating their actual deaths in makeshift coffins, to a harrowing midnight swim across the Potomac when Elray just escapes drowning, they challenge each other to confront their fears.Although they remain close, as they move into the period termed \"The Vertical Bog\"-Elray's wry code for puberty-they drift apart. Her interest in filmmaking deepens, and Raoul begins running after the girly-girls. Elray withdraws, mourns Raoul, and hears less and less from her parents when she touches her scar-she's growing up. She still feels like a failure after their harrowing crossing of the Potomac, combined with typical low self-esteem of her age group, she decides to master her largest fear-going back to Glen Echo and riding again through the Tunnel of Love. Harwood accompanies her, and afterwards, she finally feels like a young adult.And happening all at the same time, Elray's paternal grandmother-long thought dead-resurfaces and sues for custody of her granddaughter (she claims to have faked her death in a fire at Blackie's House of Beef to free her family from her destructive drinking and gambling ways). Elray, at this fragile stage in her life, delights in the weirdness of the situation and welcomes the elegant, grand, smoking and dancing old woman, while unwittingly betraying her family by dis",
        "Category": " Fiction , Literary",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Dolls: From Kewpie to Barbie and Beyond",
        "Authors": "By Edison, Judith",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Treasures from the Earth: The World of Rocks and Minerals",
        "Authors": "By Shaub, Benjamin Martin",
        "Description": "Surveys the physical and optical properties of minerals, gems, and rock types, their origins and occurrences, and their uses, and procedures of collecting and identifying particular specimens",
        "Category": " Science , General",
        "Publisher": "Crown Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1975"
        }
    },
    {
        "Title": "Real Federalism: Why It Matters, How It Could Happen",
        "Authors": "By Greve, Michael S.",
        "Description": "\"Real\" federalism, Michael S. Greve argues, is a federalism that promotes citizen choice and competition among the states. Far from being an anachronism in an increasingly complex society, a regime that permits citizens to choose among competing jurisdictions - each offering a different mixture of government services - is uniquely suited to a country of highly mobile and increasingly sophisticated citizen-consumers.Real Federalism provides a road map for reviving citizen choice and state competition. Greve shows how the Supreme Court, which has reestablished at least some federalism constraints, and a loose coalition of \"leave-us-alone\" constituencies - including some religious groups, home school and school choice organizations, and term limit and tax limit advocates - can through a \"virtuous cycle\" of progressive accommodation and cooperation succeed in advancing federalism.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Aei Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Animals and their travels,: Migrations from one region to another, (The Golden library of knowledge)",
        "Authors": "By Martin, Richard A.",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Listen, listen",
        "Authors": "By Wilhelm, Kate",
        "Description": "",
        "Category": "",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Our Man in Washington",
        "Authors": "By Hoopes, Roy",
        "Description": "Hoopes's first work of fiction is a historical novel featuring James M. Cain, later the master of \"hard-boiled\" mystery novels, and H. L. Mencken, the famous iconoclastic journalist, as amateur detectives. Two Baltimore reporters (friends at that time and later in real life), they are investigating the deaths and sex scandals in the Harding administration in 1923, just before the big Teapot Dome scandal breaks.There is a remarkable relevance of 1920s scandals to today's political environment, but that remains behind the book as Mencken and Cain, two bright literary men playing Holmes and Watson, take the train to D.C. to get the real scoop. They drink a lot, meet a mysterious, sexy redhead named Roxy (a real-life influence on Cain) and a rogue named Gaston B. Means, and get a lot more than they bargained for. With hard-boiled enthusiasm they expose some of the roots of the corruption infecting our capital. All the speaking roles are real historical characters.",
        "Category": " Fiction , Historical",
        "Publisher": "Forge",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The still storm (G.K. Hall large print book series)",
        "Authors": "By Sagan, Francoise and Donougher, Christine (TRN)",
        "Description": "",
        "Category": "",
        "Publisher": "G.K. Hall",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "CIVIL RIGHTS AND WRONGS: A Memoir of Race and    Politics, 1944-1994",
        "Authors": "By Ashmore, Harry S.",
        "Description": "After fifty years as observer and participant on the front lines of the civil rights movement, Harry Ashmore finds the nation still unable, or unwilling, to face up to the basic issues posed in Gunnar Myrdal's classic An American Dilemma. In this memoir, Ashmore takes up where Myrdal left off in 1944, giving us a retrospective view of the causes and effects of the post-World War II civil rights movement, considering it in the context of the political developments that both advanced and hindered its effectiveness.As executive editor of the Arkansas Gazette, Ashmore led the fight against Governor Orval Faubus when he closed Little Rock's Central High School in defiance of the Supreme Court's landmark Brown v. Board of Education decision. As the protest by blacks spread across the nation, Ashmore was present at the heart of the action as journalist, academic, foundation executive, and adviser to Presidents Kennedy and Johnson. He has won Pulitzer Prizes for himself and his newspaper and has produced a body of work that makes up a unique chronicle of a turbulent era.Civil Rights and Wrongs is a powerful and important reappraisal of the American Dilemma by a man who has viewed it from the eye of the storm it has spawned.",
        "Category": " Political Science , Political Freedom & Security , Civil Rights",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Rising In The West: The True Story Of An \"Okie\" Family from the Great Depression Through the Reagan Years",
        "Authors": "By morgan, dan",
        "Description": "Like the Joads of Steinbeck's unforgettable The Grapes of Wrath, Oca Tatham and his family trekked west with the millions of Americans who fled the Great Depression in search of jobs and hope in California. Rising in the West presents the magnificent story of what became of this family, and opens a fascinating, heretofore almost unchronicled chapter of American experience.Drawing on years of intensive historical research, as well as countless interviews with family, friends, and associates, Dan Morgan gives us the Tathams' remarkable lives in absorbing detail. In less than half a century, they went from migrant fruit-picking to middle-class prosperity in the promised land of California, where they got caught up in the quintessential realities of the Sun Belt: agribusiness, irrigation projects, the defense industry, real-estate development, nursing home chains, and football franchises. But like so many white Southerners who went west coming from nothing, the Tathams remained outsiders. As individualistic Christians ever wary of mainstream American life and skeptical of mainstream notions of success, they found their place in that cohesive Sun Belt culture whose religious, ethical, and political outlook would form the basis of the New Populism that manifested itself so dramatically in the Reagan Revolution.More than anything else, fundamentalist Pentecostalism is at the heart of the Tathams' experience. The brush arbors and storefront churches of Oca's youth are linked by generations of deep religious commitment to the huge revivalist tabernacles that dot southern California. While the family has always been bound together by the fervor of their faith, Morgan shows how that faith is being tested today, not only as the Tathams confront inevitable family adversities like alcoholism, terminal illness, and troubled marriages, but also as they, and others like them, take their stand on the deeply divisive issues - including abortion and school prayer - topping the national agenda, and leave their profound stamp on American politics.Rising in the West is an extraordinary achievement - an engrossing account of the growth of America, as well as the intensely personal drama of a family struggling to keep faith with itself.",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Story of Robert E. Lee's Headquarters, Gettysburg, Pennsylvania",
        "Authors": "By Smith, Timothy H.",
        "Description": "",
        "Category": " History , Military , United States",
        "Publisher": "Thomas Publications",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Looking Back, Going Forward: New and Selected Poems",
        "Authors": "By Taube, Herman",
        "Description": "The work of poet and novelist Herman Taube reveals the inner world of a  tormented yet loving soul, a world of deep richness and passion. Looking Back, Going Forward includes  recent English translations of poems Taube originally wrote in Polish  and Yiddish about his World War II experiences in Poland, Siberia,  Uzbekistan, Russia, and Pomerania. It also includes poems dealing with  emigration to the United States in 1947, his continuing work as a  journalist, and a life that has been dedicated to service in Jewish  communities and his expanding family.Distributed for Dryad Press.",
        "Category": " Poetry , American , General",
        "Publisher": "University of Wisconsin Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Business Letter Writing (Arco)",
        "Authors": "By Lindsell-Roberts, Sheryl",
        "Description": "",
        "Category": "",
        "Publisher": "ARCO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Modern Real Estate Practice",
        "Authors": "By Galaty, Fillmore W., Allaway, Wellington J., and Kyle, Robert C.",
        "Description": "",
        "Category": "",
        "Publisher": "Real Estate Education Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Ecstatic Journey: The Transforming Power of Mystical Experience",
        "Authors": "By Burnham, Sophy",
        "Description": "The author of the best-selling A Book of Angels recounts her journey to mystical illumination, along with that of ordinary people and saints, seers, and holy men and women, and explores the physical effects of mystical experiences.",
        "Category": " Religion , Mysticism",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "10.0",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Everything Low Cholesterol Book: Reduce Your Risks And Ensure A Longer, Healthier Life",
        "Authors": "By Archer, Shirley",
        "Description": "",
        "Category": " Cooking , Health & Healing , Low Cholesterol",
        "Publisher": "Everything",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Last Will and Testament of Jacqueline Kennedy Onassis",
        "Authors": "By Onassis, Jacqueline Kennedy",
        "Description": "Readers who wish to know more about the woman and her life will delight in this deluxe facsimile of the complete, unedited will of Jacqueline Kennedy Onassis, containing a four-color frontispiece portrait of Mrs. Onassis.",
        "Category": " History , General",
        "Publisher": "Carroll & Graf Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Bride of the Far Side",
        "Authors": "By Larson, Gary",
        "Description": "This fourth collection of two hundred \"Far Side\" cartoon panels features the antics of fiendish ducks, misunderstood snakes, pointy-headed matrons with sequined glasses, and hilarious captions",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews Mcmeel Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Garfield Rolls On (Garfield (Numbered Paperback))",
        "Authors": "By Davis, Jim",
        "Description": "The eleventh collection of the adventures and misadventures of the Renaissance cat",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "We're Not Out of the Woods Yet",
        "Authors": "By Trudeau, G. B.",
        "Description": "This collection of Trudeau's topical comic strip satirizes some of the major events of the seventies, including the mourning of Elvis, poignantly experienced by Boopsie when she embarks on a bus-ride pilgrimage to Graceland",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1979"
        }
    },
    {
        "Title": "Cyberweb",
        "Authors": "By Mason, Lisa",
        "Description": "Reduced to scavenging for subsistence scraps among the trash people of San Francisco, Carly Nolan may have finally found her re-entry into the fast lane. Together with her onetime probe therapist Pr. Spinner - an aging and suspicious standalone A.I. entity with rusty, ill-defined housing - the disgraced linker is summoned back into public telespace by a tri-headed mainframe icon called Cognatus. And Cognatus has an offer Carly Nolan dares not refuse: a job, a future...and absolution.But there are sticky strings attached. Carly's new assignment - a telespacial hunt for unconnected human archetypes - has aroused some dangerous interest back in the real world. A ruthless mercenary Ultra fembot with fluid loyalties is now dogging her trail. The young shaman of a savage urban tribe has become obsessed with the beautiful \"genny woman\" who has sacrificed her soul to the \"Glass Land.\" And worst of all, Carly herself may be no more than an unsuspecting pawn of the Silicon Supremacists - a renegade cabal of A.I. revolutionaries planning no less than the total destruction of humankind.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "9.38",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Great Architecture of the World",
        "Authors": "By Norwich, John Julius",
        "Description": "Describes and illustrates, with photographs, cut-away drawings, and plans, man's greatest architectural achievements from the Pyramids of Giza to the Sydney, Australia, Opera House, explaining all of the world's major architectural styles",
        "Category": "",
        "Publisher": "Bonanza Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Vivien Leigh",
        "Authors": "By John R. Taylor",
        "Description": "Offers a critical study of the tormented personal life, successful acting career, and enigmatic personality of actress Vivien Leigh",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "American Baseball: v. 2",
        "Authors": "By Voigt, David Quentin",
        "Description": "",
        "Category": "",
        "Publisher": "University of Oklahoma Press",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "March",
            "Year": "1971"
        }
    },
    {
        "Title": "The decoding of Edwin Drood",
        "Authors": "By Forsyte, Charles",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Bad Intent: A Maggie MacGowen Mystery",
        "Authors": "By Hornsby, Wendy",
        "Description": "Maggie MacGowen, who sees sharply into the complexities of life and often solves crimes through the viewfinder of her video camera, is back in Los Angeles. Waiting for her is LAPD detective Mike Flint - and a case that will take her into the urban war zone of South Central L.A. There, a cop killing solved years before has reverberated through the lives of the three black children who witnessed it, one the son of the man convicted of the murder.Fifteen years later the long-dead case comes back to life, exploding in the media with a bang. A ruthless politician has decided to get the minority vote by claiming the police coerced the children into pointing a finger at Charles Conklin, an innocent man. Conklin's son, deprived of a father's guidance, has ended up in Juvenile Hall charged with a murder of his own. It is a situation sure to ignite sparks of protest in a tinderbox city - and bring Mike Flint's career down in flames.With her dreams newly joined to Mike's, Maggie begins her own campaign to clear his name, and the gutsy, prize-winning filmmaker is taking her camera and sleuthing skills into the heart of an embattled city. But beneath the smoggy L.A. skies, layer after layer of lies make the truth look out of focus around the edges. With her video running, Maggie captures the stark faces of shattered lives and the bodies that turn up. This is the real picture of cops and crime, politics and justice, poverty and dead-end streets where the savvy Maggie hopes to find the solution to a devastating mystery - or lose what is dearest to her heart.Intelligent, multilayered, and filled with surprises, this no-holds-barred suspenseful mystery showcases Wendy Hornsby's cinematic eye for detail and her wise perspective on the inner city - with its all-too-human crimes of passion, rage, and broken dreams.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "E. P. Dutton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "The Best of Rumpole",
        "Authors": "By Mortimer, John Clifford",
        "Description": "Rumpole is everyone's favorite defense barrister: he is a fearless tamer of judges who is kept in order only by She Who Must Be Obeyed. A rumbustious defender of the faith, Rumpole is known, not surprisingly, as something of a character. His exploits at the Old Bailey - and elsewhere - are an unsurpassable blend of eloquence, wit, cynicism, and experience.This volume of John Mortimer's favorite Rumpole stories contains some of the bluff barrister's finest moments. There is Rumpole's encounter with the acting world, his frequent and often disillusioning brushes with the Timsons, and many of his confrontations with the pompous and sometimes misguided gentlemen of the Bench.For those unfamiliar with Rumpole, this volume offers a perfect introduction to John Mortimer's wisest and wittiest creation. Those who have already encountered Rumpole will want to reacquaint themselves with the immortal barrister in this hugely entertaining collection of stories.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "The Basset Hound/Ps-815",
        "Authors": "By Nicholas, Anna Katherine and Foy, Marcia",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "An End to Shame: Shaping Our Next Sexual Revolution",
        "Authors": "By Reiss, Ira L.",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Prometheus Books",
        "Price Starting With ($)": "5.93",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "How to Be the Life of the Podium: Openers, Closers & Everything in Between to Keep Them Listening",
        "Authors": "By Simmons, Sylvia",
        "Description": "Provides one liners, quotes, proverbs, and anecdotes and tells how to use them to make effective and interesting speeches, and offers an introduction to the Simmons System of speech writing",
        "Category": " Literary Criticism , General",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Mastering Math Sat 1",
        "Authors": "By Paul Lawrence",
        "Description": "",
        "Category": "",
        "Publisher": "Great Source Education Group Inc",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Financial Accounting (Charles T. Horngren Series in Accounting)",
        "Authors": "By Harrison, Walter T. and Horngren, Charles T.",
        "Description": "",
        "Category": " Business & Economics , Accounting , Financial",
        "Publisher": "Prentice Hall College Div",
        "Price Starting With ($)": "8.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Giant Book of American Quotations: Over 8,000 Quotations on 264 Subjects",
        "Authors": "By Carruth, Gorton and Ehrlich, Eugene",
        "Description": "This giant compendium contains more 8,000 quotations on 264 subjects related to American life. These wise, witty, and history-making words come from 1,400 notable sources from the founding fathers to contemporary figures. Also included are the texts of 17 famous American documents including the Declaration of Independence, the Emancipation Proclamation, and more. This volume is a rich reference on American history, culture, and values, ideal for browsing and research.On Justice:Injustice anywhere is a threat to justice everywhere.–Martin Luther King, Jr.On Humankind:Human kindCannot bear very much reality–T.S. EliotOn Love:Is there more? More than Love and Death? Then tell me its name!–Emily DickinsonOn Evil:It may be necessary temporarily to accept a lesser evil, but one must never label a necessary evil as good.–Margaret Mead",
        "Category": " Reference , Quotations",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Star pitchers of the major leagues (Major league library, 15)",
        "Authors": "By Libby, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "RANDOM HOUSE",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Medea (Plays for Performance Series)",
        "Authors": "By Euripides and Rudall, Nicholas (TRN)",
        "Description": "Medea, whose magical powers helped Jason and the Argonauts take the Golden Fleece, remains one of the strongest female characters ever to appear on stage. In the play she kills her own children. Plays for Performance Series.",
        "Category": " Drama , Ancient & Classical",
        "Publisher": "Ivan R. Dee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Psychotropic Drugs",
        "Authors": "By Keltner, Norman L. and Folks, David G., M.D.",
        "Description": "",
        "Category": "",
        "Publisher": "Mosby-Year Book",
        "Price Starting With ($)": "26.28",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Restraint of Beasts",
        "Authors": "By Mills, Magnus",
        "Description": "CHOSEN AS ONE OF THE BEST NOVELS OF 1998 BY THE LOS ANGELES TIMES AND WINNER OF ENGLAND'S MCKITTERICK PRICE  This award-winning literary tour de force, shortlisted for both the Whitbread and the Booker prizes, tells the captivating tale of three men: Tam and Richie, good Scots lads at heart who have turned loafing into an art form, and their ever exasperated English foreman. Carefully laid plans go haywire from the start, and as they cover their tracks the best they can, the hapless trio heads south from Scotland to do a job in England, where they find that their reputation has preceded them, to say the least.  This outrageous and brilliant tale is riveting from beginning to end, introducing a magnetic new voice.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Essay on rime",
        "Authors": "By Shapiro, Karl Jay",
        "Description": "",
        "Category": "",
        "Publisher": "Reynal & Hitchcock, 1945",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1945"
        }
    },
    {
        "Title": "Snow Man",
        "Authors": "By Busby, Roger",
        "Description": "Competing police personal from Germany, England, and the United States are brought together in their search for the Snow Man, head of an international crime cartel, but they are up against an elusive and dangerous enemy",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Extraordinary Power for Ordinary Christians",
        "Authors": "By Tammaru, Erik",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Destiny Image Publishers",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Oxford Companion to Women's Writing in the United States",
        "Authors": "By Davidson, Cathy N. (EDT), Wagner-Martin, Linda (EDT), and Ammons, Elizabeth (EDT)",
        "Description": "From Anne Bradstreet's The Tenth Muse Lately Sprung Up in America in the seventeenth century, to Toni Morrison's Nobel Prize in 1993, women writers have woven a rich tapestry of voices across four centuries of American history. Their writings have embraced a marvelous diversity of visions, including those of Emily Dickinson, Gertrude Stein, Cynthia Ozick, Gwendolyn Brooks, Kate Chopin, Maya Angelou, Annie Dillard, Joan Didion, Edith Wharton, Adrienne Rich, Djuna Barnes, and Willa Cather.The Oxford Companion to Women's Writing in the United States provides a comprehensive, authoritative, and highly informative survey of these writers and their work as it illuminates the issues that fired their imaginations.Here is a goldmine of information about women's writing, women's history, and women's concerns--over eight hundred entries, ranging from brief identifications to extensive essays. The volume boasts contributions by many well-known thinkers, including Susan Faludi writing on backlash, Deborah Tannen on communications between the sexes, Jane Gallop on Lacanian psychoanalysis, Nell Irvin Painter on Sojourner Truth, and Trudier Harris on Toni Morrison. There are nearly four hundred biographical entries, touching on not only important poets, novelists, and playwrights (including such modern figures as Wendy Wasserstein, Anne Tyler, Alice Walker, and Tama Janowitz), but also women writers who have made important contributions in other fields, such as Betty Friedan, Rachel Carson, Margaret Mead, Aimee Semple McPherson, Elizabeth Cady Stanton, and Susan B. Anthony. Perhaps most important, there is extensive coverage of the many personal, cultural, and historical issues that have been explored by and have influenced the lives and productivity of women writers, including AIDS, race and racism, violence and sexual harassment, the Civil War, the civil rights movement, and much more. There is also coverage of the publishing world (including bookstores and women's presses), the art and practice of writing, and contemporary literary criticism (including lesbian literary theory, black feminism, and deconstruction).The women who have written beautifully, poignantly, tenderly, humorously, or powerfully about America and American lives are indeed a heterogeneous group.The Oxford Companion to Women's Writing in the United States captures this remarkable diversity, painting a fascinating portrait of women and women's writing in America.",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "7.72",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Eddy Arnold: Pioneer of the Nashville Sound",
        "Authors": "By Streissguth, Michael",
        "Description": "Eddy Arnold was just a sweet-voiced, third-generation cotton farmer from Western Tennessee with a dream: to lift himself out of rural poverty and make a name for himself as a country performer. This book traces the history of the Arnold family to a Confederate soldier named Robert M. Arnold, who began farming cotton in the Henderson region after the war. His son, Will, wed twice; his second wife, Georgia, gave birth to Richard Edward Arnold in 1918.After the stock market crash, Will Arnold lost ownership of his farm, and young Ed was less than happy working as a tenant farmer for absentee owners. An avid amateur guitarist, he soon had paying jobs at dances and gatherings around the area; inspired to go further afield, he traveled up the road to Jackson, Tennessee, where he garnered his first radio job. Meanwhile, he worked daytimes for an undertaker to help make ends meet.Forming a duo with fiddler Howard \"Speedy\" McNatt, they moved from station to station, in search of the elusive perfect homebase. They got as far as St. Louis, where their local popularity blossomed. A chance audition with radio cowboy star Pee Wee King led the duo to join King's successful band, and even greater fame for the smooth-voiced Tennessee songster. With King's band, Eddy honed his professional chops, was introduced to a wide audience via Nashville's \"Grand Ole Opry\" radio program, and met the legendary and flamboyant manager Colonel Tom Parker, who would greatly influence his career.Breaking away as a solo act, Eddy signed with Victor Records toward the end of World War II, and formed his first, highly influential band, featuring fiddler McNatt, \"Little\" Roy Wiggins on steel guitar, and bassist Gabe Tucker. His first hits were sentimental ballads, and by the late '40s he was one of Victor's top-selling artists and a consistent concert draw. His popularity was so great that he became a welcome figure on national radio and television in the mid-'50s.Then, a new sound shook the airwaves: Rock and roll. The market for Eddy's smooth country style diminished, and Eddy faced some lean times. Determined to crossover into the mainstream pop market, he experimented with a variety of styles until, in the early '60s, he hit on a perfect blend of country sentiments with uptown accompaniments. The result was a string of mid-'60s hits, highlighted by the classic \"Make the World Go Away.\" Eddy Arnold was a star all over again - and this time on the mainstream stage.",
        "Category": " Biography & Autobiography , Composers & Musicians",
        "Publisher": "Schirmer Trade Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Art of the Celts: Origins, History, Culture",
        "Authors": "By Zaczek, Iain",
        "Description": "",
        "Category": "",
        "Publisher": "Tx Bookman Remainders",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "No Salt Needed Cookbook (Rodale's High Health Cookbook Series)",
        "Authors": "By Gerras, Charles (EDT)",
        "Description": "Discusses the replacement of salt in cooking with other spices and offers recipes for a variety of appetizers, soups, main courses, salads, desserts, and breads without any salt",
        "Category": " Cooking , General",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Guerrilla Prince: The Untold Story of Fidel Castro",
        "Authors": "By Geyer, Georgie Anne",
        "Description": "Presents the story of the first modern guerrilla leader, in which the charismatic Cuban revolutionary emerges as his people's betrayer, motivated by megalomania and anti-Americanism",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Daughter of Fire: A Portrait of Iceland",
        "Authors": "By Scherman, Katharine",
        "Description": "",
        "Category": "",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Sopranos, Mezzos, Tenors, Bassos, And Other Friends",
        "Authors": "By Prashker, Betty A. (EDT), Chapin, Schuyler, and Radiches, James A. Photographer",
        "Description": "Offering detailed portraits of some of the most important figures in opera, a behind-the-scenes look examines the world of opera itself as well as the lives of Pavarotti, Domingo, Sutherland, Tebaldi, Horne, and others. 15,000 first printing.",
        "Category": " Music , Instruction & Study , Voice",
        "Publisher": "Crown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Porch Perfect",
        "Authors": "By Skolnik, Lisa and Buchholz, Barbara Ballinger",
        "Description": "",
        "Category": " Architecture , Buildings , Residential",
        "Publisher": "Friedman/Fairfax Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Fish without fuss: Seafood simplified",
        "Authors": "By Lentz, Ginny",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Dipt Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Jamsa's 1001 DOS & PC Tips/Book and Disk",
        "Authors": "By Jamsa, Kris A.",
        "Description": "One of the most useful computer books ever published, with tips covering undocumented secrets, memory management, controlling the cursor's appearance, traveling with or mailing floppy disks, using machine codes to create command files, generating sound, faster keyboards, finding a misplaced file, batch files, actually making DOSSHELL do something useful, CD ROMS, and making sense of printer codes and problems. Highly recommended for anyone who occasionally becomes frustrated with a PC.  Includes a 3.5\" disk. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Computers , General",
        "Publisher": "Mcgraw-Hill Osborne Media",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Slash Your Debt: Save Money and Secure Your Future",
        "Authors": "By Detweiler, Gerri, Eisenson, Marc, and Castleman, Nancy",
        "Description": "",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Financial Literacy Center",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "A dog for Davie's hill",
        "Authors": "By Bice, Clare",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "The Kids' Book of Awesome Activities 7",
        "Authors": "By Tony Tallarico",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks, Inc.",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Introductory Algebra: Student's Solutions Manual",
        "Authors": "By Bittinger, Marvin L., Keedy, Mervin L., and Penna, Judith A.",
        "Description": "",
        "Category": " Mathematics , General",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Great Quarterbacks of the N.F.L.",
        "Authors": "By Anderson, Dave",
        "Description": "",
        "Category": "",
        "Publisher": "Random Library",
        "Price Starting With ($)": "5.03",
        "Publish Date": {
            "Month": "October",
            "Year": "1965"
        }
    },
    {
        "Title": "Crises and Special Problems in Psychoanalysis and Psychotherapy",
        "Authors": "By Bellak, Leopold, Faithorn, Peri, and Plishka, Peter C.",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Brunner-Routledge",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "Color by Color Plant Directory",
        "Authors": "By Squire, David and Huntington, Lucy",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Chartwell Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Book of Family Therapy",
        "Authors": "By Ferber, Andrew",
        "Description": "",
        "Category": "",
        "Publisher": "Jason Aronson Inc. Publishers",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "November",
            "Year": "1978"
        }
    },
    {
        "Title": "FAO Schwarz Toys For A Lifetime: Enhancing Childhood Through Play",
        "Authors": "By Asen, Ben (PHT) and Auerback, Stevanne",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Universe",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Faith Factor: Proof of the Healing Power of Prayer",
        "Authors": "By Matthews, Dale A. and Clark, Connie",
        "Description": "Drawing from the latest scientific research, as well as numerous illustrative case studies, The Faith Factor offers convincing proof that religious practices can and do enhance the healing powers of medicine. And nationally renowned  physician Dale A. Matthews offers a program any patient can follow to incorporate faith into their own healing.Dr. Matthews points out that encouraging an integration of religious beliefs and practices in medical settings can have important benefits for the entire medical community, from patients and doctors to national health policy makers. He shows how the national trend toward rediscovering religious values has led many patients to use prayer in conjunction with conventional treatment, and that the results have already confirmed that faith and religious practice can be valuable medicine. Finally, Dr. Matthews helps readers explore the connection between faith and medicine in their own lives through methods of prayer, community worship, and study of Scripture.",
        "Category": " Religion , Faith",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "A new moral order: Studies in development ethics and liberation theology",
        "Authors": "By Goulet, Denis",
        "Description": "",
        "Category": "",
        "Publisher": "Orbis Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Military lessons of the Gulf War",
        "Authors": "By Watson, Bruce W., etc.",
        "Description": "",
        "Category": "",
        "Publisher": "Presidio Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Man in My Basement: A Novel",
        "Authors": "By Mosley, Walter",
        "Description": "The man at Charles Blakey's door has a proposition almost too strange for words. He wants to spend the summer in Charles's basement, and Charles cannot even begin to guess why.The beautiful house has been in the Blakey family for generations, but Charles has just lost his job and is behind on his mortgage payments. The money would be welcome.But Charles Blakey is black and Anniston Bennet is white, and it is clear that the stranger wants more than a basement view. There is something deeper and darker about his request, and Charles does not need any more trouble. But financial necessity leaves him no choice.Once Anniston Bennet is installed in his basement, Charles is cast into a role he never dreamed of. Anniston has some very particular requests for his landlord, and try as he might, Charles cannot avoid being lured into Bennet's strange world. At first he resists, but soon he is tempted - tempted by the opportunity to understand the secret ways of white folks. Tempted to understand a set of codes that has always eluded him. Charles's summer with a man in his basement turns into an exploration of inconceivable worlds of power and manipulation, and unimagined realms of humanity.",
        "Category": " Fiction , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Wild Irish",
        "Authors": "By Maxwell, Robin",
        "Description": "The glorious, turbulent sixteenth century is drawing to a close. Elizabeth, Queen of England, has taken on the mighty Spanish Armada and, in a stunning sea battle, vanquished it.But her troubles are far from over. At home she is challenged at every turn by the brilliant but reckless Robert Devereux, Earl of Essex, whose dangerous mix of passion and political ambition drives the aging queen to distraction. Just across the western channel, her colony Ireland is embroiled in seething rebellion, the island's fierceuntamed clan chieftains and their \"wild Irish\" followers refusing to bow to their English oppressors.In the midst of the conflict is Grace O'Malley, notorious pirate, gunrunner, and \"Mother of the Irish Rebellion.\" For years, the audacious Grace has plotted and fought against the English stranglehold on her beloved country. At the height of the uprising Grace takes an outrageous risk, sailing up the River Thames to London for a face-to-face showdown with her nemesis, the Queen of England.The historic meeting of these two female titans --perfectly matched in guts, guile, and political genius -- sets the stage for the telling of the little-known but crucial saga of Elizabeth's Irish war, a conflict at the very root of every subsequent Irish uprising. No one breathes life into these strong and pugnacious women as does Robin Maxwell in this captivating novel, a rousing tale that makes historygloriously real.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "149.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Marshall McLuhan: The Medium and the Messenger",
        "Authors": "By Marchand, Philip",
        "Description": "A biography of the man who saw the digital revolution coming decades before anyone else.with a new foreword by Neil Postman When communications thinker Marshall McLuhan gave us the phrases \"the medium is the message\" and \"global village,\" he was ahead of his time. Now, in the age of the digital revolution McLuhan and his work cannot be ignored by any student of culture and technology. Interest in McLuhan has increased dramatically since this biography was first published in 1989 to stunning reviews. The author has extensively revised this new edition to include additional information provided by McLuhan's family and friends, and to present an even clearer and more absorbing personal picture of McLuhan. The book explains the relevance to today's society of a man who reached the height of his fame in the 1960s. The foreword by Neil Postman is original to this edition.* Not for sale in Canada",
        "Category": " Science , Philosophy & Social Aspects",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Hitler's Pope: The Secret History of Pius XII",
        "Authors": "By Cornwell, John",
        "Description": "An award-winning Roman Catholic journalist presents a shocking record, drawing from secret archives, of the career of Pope Pius XII, showing his long-term collaboration with the Nazis and his anti-Semitism, and discusses his continuing influence. 40,000 first printing. Tour.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Japan: A Reinterpretation",
        "Authors": "By Smith, Patrick",
        "Description": "A landmark study of Japan in the modern world explores the history of the country over the past fifty years, exploring changes in its cultural, social, economic, and political institutions and assessing its role in contemporary world affairs. 35,000 first printing. Tour.",
        "Category": " History , Asia , Japan",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Cambridge Factfinder",
        "Authors": "By Crystal, David (EDT)",
        "Description": "The Cambridge Factfinder remains the most comprehensive and up-to-date general factbook available. In this new extended edition every area of knowledge has been updated, including populations, international boundaries, the world's political leaders, and international prizes. There is new material covering more than 30 extra pages, including the world's largest cities by population, the most up-to-date political and geographical coverage of the war in the former Yugoslavia, Eritrea as a new country, data about the legal systems of Australia, Canada, South Africa and the USA, details of the universities of 30 new countries, the most recent statistics about the world's language families, the latest details of world English use, and the major causes of death worldwide. There are over 360 illustrations - graphs, diagrams, and specially-drawn maps - and a substantial index.",
        "Category": " Reference , Encyclopedias",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Art of Living : A Guide to Contentment, Joy and Fulfillment",
        "Authors": "By Dalai Lama XIV, Cumming, Ian (PHT), Thupten Jinpa (TRN), and Cumming, Ian",
        "Description": "More than two hundred photographs complement a collection of practical advice and words of wisdom from the Dalai Lama, in an evocative photographic gift book that captures the heart of Buddhist practice.",
        "Category": " Religion , Buddhism , General",
        "Publisher": "Thorsons",
        "Price Starting With ($)": "6.63",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Antarctica: A Year at the Bottom of the World",
        "Authors": "By Mastro, Jim",
        "Description": "Vivid full-color photography and a compelling personal narrative explore the remarkable, stark beauty of Antarctica, capturing the harsh, rugged landscape, natural beauty, fierce storms, icy isolation, and extraordinary wildlife of the continent. 20,000 first printing.",
        "Category": " Nature , General",
        "Publisher": "Bulfinch",
        "Price Starting With ($)": "7.0",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Your Money or Your Life: Why We Must Abolish the Income Tax",
        "Authors": "By Richman, Sheldon",
        "Description": "Argues that the income tax should be abolished because it is an invasion of privacy that gives the government more money and power than the authors of the Constitution intended, and cannot be effectively reformed.",
        "Category": " Law , Ethics & Professional Responsibility",
        "Publisher": "Future of Freedom Foundation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "I Love Nature More",
        "Authors": "By Vavra, Robert",
        "Description": "An unabashed gift book. Vavra's luminous color photographs don't document nature so much as reveal its underlying shapes, colors, textures and moods. The 28 images range from exotic animals and birds to the less-appreciated exoticism of the everyday. A section at the back of the book reflects and comments on the images. 10x10\". Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Science , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Gideon's Fog",
        "Authors": "By CREASEY, John",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "November",
            "Year": "1974"
        }
    }
]