[
    {
        "Title": "New Dieter's Cookbook (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books (EDT)",
        "Description": "This cookbook makes eating a low-calorie diet easy and enjoyable with delicious, every day recipes.Full-color photo of finished food included with every recipe.Food exchanges (based on the American Diabetes Association's exchanges) listed with every recipe.Introduction contains information on weight loss including ideal weight, types of ingredients to use in cooking, tips on cutting calories and fat, exer-cise recommendations, and learning to eat well and forget dieting forever.Every recipe has been tested in the Better Homes and Gardens Test Kitchen for accuracy and taste appeal.Menu plans for an entire week.Tips and blurbs offer additional low-fat cooking strategies, serving suggestions, and timesaving ideas.Nutrition Facts with every recipe.List of simple ingredients for adding flavor without adding a lot of calories and fat.Special chapter lists the calories of commonly eaten foods.",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Cosmic Coincidences: Dark Matter, Mankind, and Anthropic Cosmology",
        "Authors": "By Gribbin, John and Rees, Martin",
        "Description": "An investigation into the origin of intelligent life on Earth, includes an exploration of the nature of dark matter, the superstring theory, and the existence of other universes",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Bantam New Age",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Musee Du Louvre Paintings",
        "Authors": "By Laclotte, M",
        "Description": "",
        "Category": "",
        "Publisher": "Flammarion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The Stamped and Stenciled Home: Easy, Beautiful Designs for Walls, Floors, and Home Accessories",
        "Authors": "By Glovier, Doris Cast",
        "Description": "",
        "Category": " Crafts & Hobbies , Stenciling",
        "Publisher": "Quarry Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Uncle John's Bathroom Reader Plunges into the Presidency",
        "Authors": "By Bathroom Readers' Institute",
        "Description": "They say that anybody who wants to be president should be automatically qualified for the job, and after reading this special “Chief Executive” edition of Uncle John’s Bathroom Reader, you’ll see why. We’ve dug up the most compelling and confounding dirt…er…statistics on these otherwise ordinary men who achieved great power. Which ones used it wisely? Which ones squandered it? And which ones would have rather been fishing? You’ll get an up-close and personal look at each Oval Officer. From the birth of the country to modern day yuks, Plunges into the Presidency is packed with more than 300 pages of amusing anecdotes, little-known history, fun quizzes, and more! Read about…* Ford’s famous fall and other presidential gaffes* White House ghosts* Homer Simpson takes on the presidency* Ails of the chiefs* Was President Buchanan gay?* Chief Executive Culinary Delights* Mr. President at the bat* Prezzy lols—including, “If I were two-faced, would I be wearing this one?” —Abraham Lincoln And much, much more!",
        "Category": " History , United States , General",
        "Publisher": "Portable Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Mountain Bike America: Washington, D.C./ Baltimore, 3rd: An Atlas of Washington D.C. and Baltimore's Greatest Off-Road Bicycle Rides (Mountain Bike America Guides)",
        "Authors": "By Adams, Scott and Fernandez, Martin",
        "Description": "",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Do Cats Hear with Their Feet?: Where Cats Come From, What We Know About Them, and What They Think About Us",
        "Authors": "By Page, Jake and Fox, Michael W. (FRW)",
        "Description": "Do Cats Hear with Their Feet? traces the evolution of cats from the time they first adapted their feline form about 20 million years ago. Exploring every aspect of a cat's life—from predation, to play, to communication—Jake Page shows us what a cat's daily life is really like. He gives us a cat's-eye view of a bird hunt in the foothills of the Rocky Mountains and explains why cats will hunt even when they are full, and why no self-respecting cat would eat vegetables. In sections that will be of interest to every cat owner, Jake Page demonstrates why territory is all-important to cats, investigates cat ESP, and shows that cats have, in fact, never been fully domesticated; they've just graciously decided to reside with us. Beautifully illustrated, this engaging book is full of surprising facts. Did you know: Black cats do better in the crowded conditions of cities than any other color? Cats are as allergic to humans as humans are to cats? Cats have survived falls from heights of over seven stories?Do Cats Hear with Their Feet? will show readers exactly why cats are such amazing creatures, and why humans have been crazy about them for centuries.",
        "Category": " Pets , Cats , General",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Prisoners of Hope:: Exploiting the POW/MIA Myth in America",
        "Authors": "By Keating, Susan Katz",
        "Description": "For twenty-five years, people like Marian Shelton have believed that their loved ones, in this case her husband, Charles, were still alive in Vietnam. Shelton never once removed the Missing in Action bracelet that bore the name of her husband. Then, in October 1990, she finally took the bracelet off her wrist and killed herself with a pistol.Marian Shelton represents just one of many MIA families ripped asunder in the aftermath of Vietnam. The hopes of these people have been kept alive by activists who would have all of us believe that there are many prisoners still alive in Vietnam. Fake pictures are \"discovered,\" \"sightings\" are reported to families. Sixty-two percent of all Americans believe that there are Americans still being held in Southeast Asia, and the belief factor rises to 84 percent among Vietnam veterans.Prisoners of Hope, for the first time, shows what happened to most of the prisoners captured in Vietnam and exposes those who would exploit the missing servicemen's families, including the federal government, which has lied about the situation for years.",
        "Category": " History , Military , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Classic Harley",
        "Authors": "By Williams, Mark",
        "Description": "Traces the history of the Harley-Davidson Company from its beginnings ninety years ago and features 150 original thematically grouped photographs and an informative introduction.",
        "Category": " Sports & Recreation , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Bang!: Getting Your Message Heard in a Noisy World",
        "Authors": "By Thaler, Linda Kaplan, Koval, Robin, and Marshall, Delia",
        "Description": "The founders of one of today's hottest, most innovative advertising agencies explain how to ignite the kind of marketing explosions that will capture customers' attention.Linda Kaplan Thaler, the CEO and Chief Creative Officer of the Kaplan Thaler Group, is the brains behind a host of memorable and highly successful ads, from the irresistibly sentimental \"Kodak moment\" campaign to Herbal Essences' \"totally organic experience\" to, most recently, the irrepressible AFLAC duck. In Bang!, Kaplan Thaler and Robin Koval of the Kaplan Thaler Group, currently ranked as the fastest-growing ad agency in the country, offer the kind of out-of-the-box thinking and proven strategies that marketers anywhere can use to create loud, clear, attention-grabbing messages about their products and services.Presenting an arsenal of \"big bang\" ideas, the authors discuss how to create a memorable publicity hook and how to design attention-grabbing packaging that taps into consumers' innermost desires. They interweave entertaining accounts of their successes and failures, as well as those of other companies to suggest specific ways to establish an atmosphere conducive to innovative breakthroughs--why having \"enough\" time to work on a project can be a disadvantage, and why having a small staff in a cramped space is often the best way to come up with big ideas.Full of colorful anecdotes and inspiring accounts of campaigns that have catapulted revenues and increased market shares, Bang! shows how to create a marketing campaign that rises above the banal barrage of commercials to create a genuine marketing explosion.",
        "Category": " Business & Economics , Advertising & Promotion",
        "Publisher": "Doubleday Business",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Something from the Nightside (Nightside, Book 1)",
        "Authors": "By Green, Simon R.",
        "Description": "Taylor is the name, John Taylor. My card says I'm a detective, but what I really am is an expert on finding lost things. It's part of the gift I was born with as a child of the Nightside.             I left there a long time ago, with my skin and sanity barely intact. Now I make my living in the sunlit streets of London. But business has been slow lately, so when Joanna Barrett showed up at my door, reeking of wealth, asking me to find her runaway teenage daughter, I didn't say no.             Then I found out exactly where the girl had gone.The Nightside. That square mile of Hell in the middle of the city, where it's always three A.M. Where you can walk beside myths and drink with monsters. Where nothing is what it seems and everything is possible.            I swore I'd never return. But there's a kid in danger and a woman depending on me. So I have no choice'I'm going home.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Ace",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The Ultimate Book of Dinosaurs",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Demsey Parr",
        "Price Starting With ($)": "6.38",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Tales of a New America",
        "Authors": "By Reich, Robert B.",
        "Description": "An analysis of four political myths demonstrates how current political thinking fails to accommodate the economic realities of an interdependent global economy and points the way toward a new public philosophy",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Skeleton (Eyewitness Books)",
        "Authors": "By Parker, Steve",
        "Description": "Full-color photos. \"An arresting introduction to skeletons. Each spread has an introductory paragraph plus captioned drawings and spectacular photos. Topics include exoskeletons, fish, birds, mammals, arms, skulls, and teeth. The look at the human skeleton also gives discussions of skull, spine, ribs, arms, and legs, plus front and rear views. A wealth of information, beautifully presented.\"--Kirkus.",
        "Category": "",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Fire: A Force of Nature: The Story Behind the Scenery",
        "Authors": "By De Golia, Jack",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "KC Publications, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "The Beatles: Illustrated Lyrics",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Tess Press, 1990",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Europe Today",
        "Authors": "By Tiersky, Ronald",
        "Description": "This engaging text is a true postDCold War enterprise. The contributors, an authoritative group of Americans and Europeans, explore the new Europe_West and East_using intertwining themes of domestic politics, European integration, and European security. The chapters_divided into country, institutional, and thematic sections_are both student and teacher friendly: clearly written, engaging, and tailored for classroom discussion.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Rowman & Littlefield Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Buried at Sea: A Novel of Suspense",
        "Authors": "By Garrison, Paul",
        "Description": "Hired on as a deckhand and personal trainer to a wealthy investment banker, Jim Leighton's dream of adventure came true when he set sail for Rio de Janeiro onboard the luxury yacht Hustle. But in the middle of the Atlantic Ocean, Jim's enigmatic employer, Will Spark, makes a startling announcement: they are being pursued by someone who wants them dead. With no previous sailing experience -- far from the sanctuaryof land in the company of a stranger who is possibly delusional and certainly dangerous -- Jim is suddenly trapped in a harrowing race for survival across the vast waters of the globe. And his options are rapidly being reduced to two: sail or die.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The lyric impulse.",
        "Authors": "By C DAY LEWIS",
        "Description": "",
        "Category": "",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Winds of Allegiance (The Great Northwest #2)",
        "Authors": "By Chaikin, Linda Lee",
        "Description": "British-Russian Savana Rezanov Mackenzie is drawn to two different men--Baron Peter Sarakof, who promises to reunite Savana with her Russian grandmother, Countess Rezanov, and Captain Trace Wilder, an American whose ambition is to see the Pacific northest belong to the United States",
        "Category": " Fiction , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Simple Upholstery and Slipcovers: Great Looks for Every Room",
        "Authors": "By Sholto Douglas, James",
        "Description": "Provides more than fifty projects to use to cover-up old chairs and couches, including cushions and pillows and offers tips on what materials, tools, equipment and techniques to use",
        "Category": "",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Seeing the Elephant: The U.S. Role in Global Security",
        "Authors": "By Kugler, Richard L. and Binnendijk, Hans",
        "Description": "Writing primarily for students of US war colleges, the authors (both of the Center for Technology and National Security Policy at the National Defense U. in Washington, DC) chart the intellectual history of national security thinking since the end of the Cold War. They suggest that, like the fabled Buddhists feeling different parts of an elephant, surveying together the different concepts and schools of thought of books by the 50 American national security writers discussed can lead to a better understanding of the holistic picture of the United States and its role in international affairs. They have structured their analysis according to authors that offer a neo-Kantian view of growing democratization and economic prosperity, those that put forward a neo-Hobbesian perspective emphasizing stressful security affairs and frequent military solutions, those that emphasize the impact of technological developments in world affairs, and those that examine the evolution of American national security strategy in the contemporary world. Distributed in the US by Books International. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "POTOMAC BOOKS",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Lightning in the Storm: The 101st Air Assault Division In the Gulf War",
        "Authors": "By TAYLOR, Thomas",
        "Description": "\"The Air Force and armor were the thunder of Desert Storm,\" said Gen. Schwarzkopf, \"while the 101st was the lightning.\" This is the story of the Screaming Eagles - the hell-bent, heliborne soldiers of the 101st who hurled the lightning bolts.The first one struck to begin the air war, a daring night raid which punched a hole in Iraq's radar fence for allied bombers to light up the sky over Baghdad on January 17, 1991. This white knuckle raid was recorded from beginning to end through the pilots' infrared cameras. Actual dialogue from the tapes provides a chapter of fascinating authenticity.The five month run up to the hundred-hour ground war is fascinating in and of itself. The 101st pitched thousands of Arab tents for a base (\"Fort Camel\") from where they would cover a front as large as the combined areas of Vermont and New Hampshire to block an Iraqi invasion of Saudi Arabia. Through dozens of interviews and hundreds of army videos never publicly viewed, the peculiar experiences of Desert Shield are described in many voices, from corporals to generals.The unique privations of the theater are described, where for the first time alcohol and local women were absent from war, replaced by the umbilical cord of mail, and the gripping memory of a time when the 101st drove convoys along freeways lined by tens of thousands of cheering Americans.The role of Vietnam veterans harboring memories of jungle warfare is described as they run the desert war, as is their collective vow that never again would victory on the battlefield be nullified. That opportunity for unconditional victory came in the first dawn of the ground war. Like some rampaging cyclone, the 101st touched down in the Euphrates Valley, landing brigades throughout an area the size of the mid-Atlantic seaboard. Far ahead of the allies' tanks, the Screaming Eagles strangled Iraq's lifeline into Kuwait - in the space of a single day. Darting hundreds of miles during the hundred hours, they were poised to leap on Baghdad when President Bush decided it was time to halt the offensive. More images emerge like video stills: the slaughter on the causeway - \"hell's highway\" - the last exit for the Iraqis from the jaws of a giant trap.Though the desert campaign seemed an example of Murphy's Law reversed, its success was a result of meticulous planning and preparation. There is an army adage that sweat in training prevents blood in battle. Sweat moistens these pages: the sweat of mental exertion that produced one of the most perfectly executed campaigns in U.S. military history.In it, the 101st's heliborne blitzkrieg opened a new chapter of warfare as significant as the onslaught of the German panzers into Poland. The action reads as fast as the ground war itself, while the grueling build-up for \"G\" Day is replete with personal recollections of soldiers with much to prove and more at stake.Task Force Normandy's raid, for example, ranks historically with Doolittle's strike on Tokyo but followed two heartbreaking failures: the Son Tay raid to liberate POWs in Vietnam and the debacle of Desert One in Iran. Nothing less than America's military reputation rode with eight Apaches when they were the first to penetrate Iraq's air space.Lightning in the Storm is the first glimpse, from many angles, of the post-Vietnam army in combat - all volunteers and products of new age military thinking. And at the leading edge of this high tech army is the 101st, the only air assault (heliborne) division in the world. Their performance in the desert was truly awesome. So much so that they question whether they are authentically veterans, having lost so few lives in achieving victory so sudden and total it has left them bemused.However the gulf war will be viewed in the annals of history, an illuminating picture will be found in this book of the most futuristic force to sweep over a desert.",
        "Category": " History , Military , Persian Gulf War (1991)",
        "Publisher": "Hippocrene Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Michael Jackson: The Man in the Mirror: 1958-2009",
        "Authors": "By Hill, Tim",
        "Description": "",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Connecting Church",
        "Authors": "By Frazee, Randy",
        "Description": "The development of meaningful relationships, where every member carries a significant sense of belonging, is central to what it means to be the church. So why do many Christians feel disappointed and disillusioned with their efforts to experience authentic community? Despite the best efforts of pastors, small group leaders, and faithful lay persons, church too often is a place of loneliness rather than connection. Church can be so much better. So intimate and alive. The Connecting Church tells you how. The answer may seem radical today, but it was a central component of life in the early church. First-century Christians knew what it meant to live in vital community with one another, relating with a depth and commitment that made 'the body of Christ' a perfect metaphor for the church. What would it take to reclaim that kind of love, joy, support, and dynamic spiritual growth? Read this book and find out.",
        "Category": " Religion , Christian Ministry , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "School for Scandal",
        "Authors": "By Sheridan, Richard Brinsley",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "14.95",
        "Publish Date": {
            "Month": "June",
            "Year": "1959"
        }
    },
    {
        "Title": "A Cup Of Comfort For Devotional for Mothers",
        "Authors": "By Bell, James S. and Clark, Stephen R.",
        "Description": "In A Cup of Comfort Devotional 366 entries provide a daily dose of comfort, strength and inspiration. The perfect bedside companion to be read in the morning or evening, this magnificent work is the first of its kind to combine biblical passages and commentary with a dozen touching, heartfelt stories that have become the hallmark of A Cup of Comfort. Readers will cherish stories of Jesus entering into everyday life, such as: Ul>A young woman, traumatized during her first helicopter ride, says the Lord's Prayer and finds herself in awe as she looks down on God's creation; A woman finds out through a co-worker that Jesus can meet her right in the midst of her depression;A mother learns an unforgettable lesson of faith when a doll representing the baby Jesus in her outdoor nativity scene is stolen;With entries linked to the holidays and seasons, A Cup of Comfort Devotional brightens every day of the year, deepening our joys and sustaining us through the darker times.",
        "Category": " Religion , Christian Living , Devotional",
        "Publisher": "Cup of Comfort",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "The Great Awakening: Reviving Faith & Politics in a Post-Religious Right America",
        "Authors": "By Wallis, Jim",
        "Description": "What will it take to solve the biggest issues of our time: extreme and needless poverty, global warming and environmental degradation, terrorism and the endless cycle of violence, racism, human trafficking, health care and education, and other pressing problems? While Washington offers only the politics of blame and fear, Jim Wallis, the man who changed the conversation about faith and politics, has traveled the country and found a nation hungry for a politics of solutions and hope. He shows us that a revival is happening, as people of faith and moral conviction seek common ground for change. Wallis also reminds us that religious faith was a driving force behind our greatest national reforms, such as the abolition of slavery and the civil rights movement. These \"great awakenings\" happened periodically at crucial times in our nation's history to propel us toward the common good. The time is ripe for another movement that will transform this country. With The Great Awakening, Wallis helps us rediscover our moral center and provides both the needed inspiration and a concrete plan to hold politics accountable and find solutions to our greatest challenges.",
        "Category": " Religion , Christian Living , Social Issues",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The You I Never Knew",
        "Authors": "By Wiggs, Susan",
        "Description": "Returning to her Montana hometown to put her life back together, successful advertising executive Michelle Turner struggles to bridge the distance between herself and her dying father, an aging Hollywood star, help her troubled teenage son, and come to terms with Sam McPhee, the rugged lover who had left her years ago. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Common Fire: Lives of Commitment in a Complex World",
        "Authors": "By Daloz, Laurent A. (EDT), Keen, Cheryl H., Keen, James P., and Parks, Sharon Daloz",
        "Description": "How can all of us encourage commitment to society as a whole, both in the next generation and in ourselves? This landmark book answers these questions by looking at more than one hundred people in many walks of life who live and work on behalf of the common good. The voices of these diverse individuals, and the authors' careful analysis, show that family and community relationships, education, the workplace, the arts, religion, and media all matter; they can all help - or hinder - the formation of a life of commitment.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Beacon Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "The Magic School Science Reader: The Magic School Bus: Lost in the Snow (The Magic School Bus Science Reader)",
        "Authors": "By Cole, Joanna",
        "Description": "Based upon the bestselling book series and the award-winning TV show, Magic School Bus Scholastic Readers make learning an adventure!Ms. Frizzle's class is on its way to learn how snow is made.  They take a wild ride into the clouds and get to float down on snowflakes. But how will they get back to the Magic School Bus?Climb on the Magic School Bus and learn about snow, ice crystals, and much, much more.",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , Weather",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "How to Succeed with Men",
        "Authors": "By Louis, Ron and Copeland, David",
        "Description": "Forget The Rules. At last, there's a guide to what men really want from a relationship written by the reigning experts on the subject: men! Gender studies specialists Ron Louis and David Copeland deliver the targeted, no-nonsense advice any single or divorced woman needs to find a good man. While publicizing their first team effort, How to Succeed with Women, Ron and David received many requests from the female audiences wanting to know when a book for them would be forthcoming.Packed with lively and revealing true-life examples, How to Succeed with Men moves from the first sparks, through courtships and break ups, to marriage. Along the way, women will discover: The truth about men, sex, and dating *where the desirable men are...and how to meet them The essentials of effective flirting *how to move from \"just friends\" to lovers Surefire strategies for romancing a man's soul...and seducing his body *how to avoid the pitfalls...and dump the duds Definitive criteria for judging whether a relationship has staying powerInstead of simply teaching tricks to hook a man, Louis and Copeland give women valuable insights into what truly makes the opposite sex tick...and reveal precisely how to connect with the right man.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Bob Greene's Total Body Makeover",
        "Authors": "By Greene, Bob",
        "Description": "A lifestyle blueprint instructs readers on how to achieve fitness through recommended exercises and nutritional practices that can be used in conjunction with today's most popular diet plans, in a guide that includes coverage of such topics as cardiovascular training and strength training. Reprint. 150,000 first printing.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Institutions of American Democracy: The Judicial Branch",
        "Authors": "By Hall, Kermit L. (EDT) and McGuire, Kevin T. (EDT)",
        "Description": "In recent years the Supreme Court has been at the center of such political issues as abortion rights, the administration of police procedures, and the determination of the 2000 presidential election. The checks and balances provided by the three branches of federal government are essential to nurturing and maintaining American democracy. With the guidance of coeditors Kermit L. Hall and Kevin T. McGuire, this volume of essays examines the role of the Judicial Branch in American democracy and the dynamic between the other branches of government, compares international models, and discusses possible measures for reform. The Judicial Branch considers the impact of courts on American life and addresses such central questions as: Is the Supreme Court an institution of social justice? Is there a case for judicially created and protected social rights? Have the courts become sovereign when interpreting the Constitution?  Essays examine topics that include the judiciary in the founding of the nation; turning points in the history of the American judicial system; the separation of powers between the other branches of government; how the Supreme Court resolves political conflicts through legal means; what Americans know about the judiciary and its functions; and whether the American scheme of courts is the best way to support democracy.",
        "Category": " Political Science , American Government , Judicial Branch",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Beasts & super-beasts, (The works of \"Saki\")",
        "Authors": "By Saki",
        "Description": "",
        "Category": "",
        "Publisher": "The Viking Press",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1928"
        }
    },
    {
        "Title": "The Unauthorized Teenage Mutant Ninja Turtles Quiz Book",
        "Authors": "By Rovin, Jeff",
        "Description": "A host of puzzles, quizzes, and games tests young readers' knowledge about the quartet of superheroes, the Teenage Mutant Ninja Turtles",
        "Category": "",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "The Associate: A Novel",
        "Authors": "By Grisham, John",
        "Description": "Kyle McAvoy possesses an outstanding legal mind. Good-looking and affable, he has a glittering future. He also has a dark secret that could destroy his dreams, his career, even his life. One night that secret catches up with him. The men who accost Kyle have a compromising video they’ll use to ruin him–unless he does exactly what they say. What they offer Kyle is something any ambitious young lawyer would kill for: a job in Manhattan as an associate at the world’s largest law firm. If Kyle accepts, he’ll be on the fast track to partnership and a fortune. But there’s a catch. Kyle won’t be working for the firm but against it in a dispute between two powerful defense contractors worth billions. Now Kyle is caught between the criminal forces manipulating him, the FBI, and his own law firm–in a malignant conspiracy not even Kyle with all his intellect, cunning, and bravery may be able to escape alive.",
        "Category": " Fiction , Legal",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Sullivan's Evidence",
        "Authors": "By Rosenberg, Nancy Taylor",
        "Description": "When twisted murderer and serial rapist Carl Holden is set free after the evidence against him is discredited, probation officer Carolyn Sullivan is assigned to his case and is plunged into a nightmare that challenges her professional and personal beliefs when the killings start again. 50,000 first printing.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Kensington Pub Corp",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Style's the Man: Reflections on Proust, Fitzgerald, Wharton, Vidal, and Others",
        "Authors": "By Auchincloss, Louis",
        "Description": "With fifty books to his name, Louis Auchincloss has achieved a stature few can match as a novelist, biographer, essayist, and cultural historian.In this new collection of biographical profiles combining literary and social history, Auchincloss aims his polished and finely pointed pen at the authors who have most fascinated him over the years, from Shakespeare's contemporaries to F. Scott Fitzgerald, Gore Vidal, and Tennessee Williams. These eighteen profiles, some of which first appeared in The New York Review of Books and The New York Times Book Review, show the critical insights of a celebrated writer best known for his fiction but equally astute in examining \"The Two Marcels of Proust,\" peeling away longstanding misconceptions about Edith Wharton's early development as a writer, and exploring \"Aestheticism and Homosexuality\" in Oscar Wilde and Walter Pater.Auchincloss explores the creative tension between style and substance, between fiction and life. His own style is always witty, elegant, and thoroughly engaging. Not afraid to speak his mind, he never minces words, as when he writes about Tennessee Williams, \"His heroes and heroines are sexual impulses, his plots a kind of sexual intercourse.\"The Style's the Man not only illuminates the master stylists in literature but equally demonstrates Louis Auchincloss's own wide-ranging interests, incisive intelligence, and taste cultivated over a long and distinguished career. Here he offers up a literary feast for book lovers and students alike.",
        "Category": " Literary Criticism , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Medical Mind of Shakespeare",
        "Authors": "By Kail, Aubrey C",
        "Description": "",
        "Category": "",
        "Publisher": "Maclennan & Petty",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "The Official Andy Griffith Show Scrapbook",
        "Authors": "By Pfeiffer, Lee",
        "Description": "A tribute to the popular television series features interviews with cast members, hundreds of rare photographs, a comprehensive episode guide (complete with cast and credits for each episode), a memorabilia section, and more. Original. 35,000 first printing.",
        "Category": "",
        "Publisher": "Citadel Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Indian America: A Geography of North American Indians",
        "Authors": "By Ney, Marian Wallace",
        "Description": "",
        "Category": "",
        "Publisher": "Cherokee Pubns",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Orn",
        "Authors": "By Piers Anthony",
        "Description": "",
        "Category": "",
        "Publisher": "Nelson Doubleday, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Civilian Surge: Key to Complex Operations",
        "Authors": "By Binnendijk, Hans (EDT) and Cronin, Patrick M. (EDT)",
        "Description": "",
        "Category": " Business & Economics , Reference",
        "Publisher": "National Defense University",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Inside the Mind of Gideon Rayburn",
        "Authors": "By Miller, Sarah",
        "Description": "What if you could see inside the head of the guy you love?  Know his every thought?  Feel his every dream and fantasy?  The mystery girl who’s Inside the Mind of Gideon Rayburn can. She tells us the intoxicating story of her beloved Gideon, an adorably clueless boy who flukes his way into New England’s fanciest prep school.  Gideon's naïve compared to the wolves at Midvale Academy, especially Cullen and Nicholas, his charming, morally ambiguous roommates.  They welcome Gid by trashing his music and betting big on when he’ll lose his virginity. Will he lose it with the cute and feisty Molly McGarry? Or Pilar Benitez-Jones, the most beautiful girl Gid's ever seen? Gid actually likes Molly and hooking up with her might be possible. But winning Pilar would be legendary. Gid is torn—he wants to prove himself to his roommates, but he also wants love. Through it all there is one hysterically funny girl sharing every thought in Gid’s conflicted little mind. But who is she?",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Skeleton Key (Alex Rider)",
        "Authors": "By Horowitz, Anthony",
        "Description": "Alex Rider will soon be a star in his very own TV series! A New York Times bestselling series. Alex Rider has been through a lot for his fourteen years. He's been shot at by international terrorists, chased down a mountainside, and stood face-to-face with evil.  Twice, young Alex has saved the world. And twice, he has almost been killed doing it. But now Alex faces something even more dangerous. The desperation of a man who has lost everything he cared for: his country and his only son. A man who just happens to have a nuclear weapon and a serious grudge against the free world. To see his beloved Russia once again be a dominant power, he will stop at nothing. Unless Alex can stop him first. The phenomenon that is the Alex Rider series returns with pulse-quickening action as, for the first time, Britain's MI6 and America's CIA unite forces. Be glad Alex is on our side.",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "Philomel Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Crunch Time",
        "Authors": "By Fredericks, Mariah and Bassett, Sam",
        "Description": "Mariah Fredericks is the author of the bestselling novel The True Meaning of Cleavage. In a starred review Booklist said, \"Fredericks, a first-time novelist, writes with amazing truth and perception.\" Meg Cabot, author of the Princess Diaries series, called it \"Laugh-out-loud funny and way twisted!\" Of her second book, Head Games, Kirkus Reviews said, \"Fredericks has a gift for replicating teen vernacular.\" Mariah Fredericks lives with her husband in Queens, New York, where she is working on more novels for young people.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Atheneum/Richard Jackson Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "What I Wish I'd Known Before I Got Married: Keepin' It Real",
        "Authors": "By James, Kay Cole and Littel, John",
        "Description": "Building a marriage is a lifelong endeavor for both men and women. Most marriage books cover the three C's--communication, compromise, and consideration -- but fail to address many issues critical to a healthy relationship. Family advocate Kay James calls these the \"things I wish I had known before I got married\": advice on finances, sex, children, and dealing with the extended family. Noting that the apostle Paul exhorted older women not to inspire or counsel younger women, but to teach them how to be wives to their husbands, Kay offers a lifetime's wealth of wisdom for creating an unbreakable marriage relationship.",
        "Category": " Religion , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "No One Here Gets Out Alive",
        "Authors": "By Hopkins, Jerry and Sugerman, Danny",
        "Description": "Recounts the life and tragic death of singer-songwriter Morrison, examining his recordings and performances with the Doors as well as his poetry",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "My Most Embarrassing Moment",
        "Authors": "By Jacobs, Eleanor",
        "Description": "",
        "Category": "",
        "Publisher": "Country Store Reiman Pubs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "French Bilingual Dictionary (Beginning Bilingual Dictionaries)",
        "Authors": "By Lipton, Gladys C.",
        "Description": "This dictionary, designed especially for first-year students of French, is especially useful on the junior high school level, or for anybody who needs a basic French dictionary. Features include high-frequency vocabulary and idioms, phonetic pronunciation, and more.",
        "Category": " Juvenile Nonfiction , Reference , Dictionaries",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Whatever Became Of.? - Eighth Series",
        "Authors": "By Lamparski, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Crown Publishers Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Courageous Follower: Standing Up to and for Our Leaders (2nd Edition)",
        "Authors": "By Chaleff, Ira",
        "Description": "Many significant failures—from FEMA’s response to Hurricane Katrina to the recent economic collapse—could have been prevented or mitigated if those lower in the hierarchy were successful at communicating to leaders the risks they saw in the system. Ira Chaleff’s Courageous Follower model has facilitated healthy upward information flow in organizations for over 15 years. The Harvard Business Review called Chaleff a pioneer in the emerging field of followership—this new edition shares his latest thinking on an increasingly vital topic. The updated third edition includes a new chapter, “The Courage to Speak to the Hierarchy.” Much of Chaleff’s model is based on followers having access to the leader. But today, followers can be handed questionable policies and orders that come from many levels above them—even from the other side of the world. Chaleff explores how they can respond effectively, particularly using the power now available through advances in communications technology. Everyone is a follower at least some of the time. Chaleff strips away the passive connotations of that role and provides tools to help followers effectively partner with leaders. He provides rich guidance to leaders and boards on fostering a climate that encourages courageous followership. The results include increased support for leaders, reduced cynicism and organizations saved from serious missteps.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Godforsaken Sea Racing the Worlds Most D",
        "Authors": "By Lundy, Derek",
        "Description": "",
        "Category": "",
        "Publisher": "Ediciones Callejon",
        "Price Starting With ($)": "7.13",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Chris Imbo's Peak 10 Fitness",
        "Authors": "By Raskin, Donna, Imbo, Chris, and Imbo, Sally",
        "Description": "A fat-burning and muscle-toning program by a celebrity fitness trainer provides easy-to-follow, fully illustrated guidelines for working out and eating well for results within ten weeks. Original.",
        "Category": " Health & Fitness , General",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Signing: Signed English: A Basic Guide",
        "Authors": "By Bornstein, Harry, Saulnier, Karen Luczak, and Miller, Ralph R.",
        "Description": "This quick-reference dictionary is for everyone who knows, cares about, or wants to communicate with someone who is deaf or hearing impaired. Designed by Harry Bornstein and Karen L. Saulnier, two of the foremost experts on sign language, Signing features more than one thousand black-and-white illustrations created specifically for hearing and non-hearing people who want to learn how to sign. Packed with grammar tips and vocabulary words arranged by subject for easy reference, Signing is a comprehensive guide to mastering the basics of Signed English and can be used alone or in conjunction with the Living Language video, Say it By Signing.",
        "Category": " Language Arts & Disciplines , Sign Language",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Reason: Why Liberals Will Win the Battle for America",
        "Authors": "By Reich, Robert B.",
        "Description": "In a passionate call to revitalize America's traditional two-party system, the author of The Future of Success offers a forceful argument that the tenets of liberalism must become part of the national political agenda in order to battle the radical conservatism that poses a danger for America and the world and sets out a program for liberals to regain political power. 60,000 first printing.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Unnatural Selection (Gideon Oliver Mysteries)",
        "Authors": "By Elkins, Aaron J.",
        "Description": "The Edgar® Award-winning author of Where There's a Will returns with another bonechilling mystery starring \"Skeleton Detective\" Gideon Oliver.  Sue Grafton called Aaron Elkins \"first rate.\" Elizabeth Peters called him \"one of the best in the business and getting better all the time.\" And now he's back in top form.  Forensics professor Gideon Oliver accompanies his wife to the Isles of Scilly, which dot the sea like an emerald necklace thirty miles off the Cornwall coast. Julie's been invited here by Russian expatriate Vasily Kozlov, scientist, millionaire, and eccentric. At his home, Star Castle, he regularly hosts a consortium of guests with differing opinions-which makes for some very heated arguments.  While Julie's stuck indoors, Gideon looks forward to puttering around the Neolithic sites nearby. But before day one is through, a newer bone turns up-this tibia is only a few years old-and all signs point to murder. And just as Gideon and the local law puzzle over the bone's origin, another murder happens at Star Castle. Could it just be bad luck, two murders within a couple of years? Or do Kozlov's lively debates have a way of turning deadly?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Tell Me Why: A Father Answers His Daughters Questions About God",
        "Authors": "By Novak, Michael and Novak, Jana",
        "Description": "World-renowned theologian Michael Novak is suddenly forced to bring his learning and many years of reflection close to home when his twentysomething daughter Jana, a journalist in her own right, sends him a long fax filled with practical questions about religion and life. As he attempts to answer, Jana challenges what she doesn't understand, raising the provocative questions of her generation and people of all ages. She is not interested in a scholarly essay but straight and honest replies - and she never hesitates to bat back an answer she doesn't like.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Will Israel Survive?",
        "Authors": "By Bard, Mitchell Geoffrey",
        "Description": "While most people view the Palestinian conflict as the greatest threat to Israel's survival, it is in fact only one of the nation's long-term concerns. Aside from terrorists seeking to destroy it, Israel must contend with tensions between religious and secular Jews, the demographic issues posed by a quickly growing Arab population, internal political divisions, and disputes over the water sources that are critical to its survival. In the face of these challenges, the country's future can seem precarious. Bard paints a realistic picture of the road ahead with a hopeful message: Israel will not only survive, but will endure long into the future.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Palgrave Macmillan",
        "Price Starting With ($)": "5.62",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "The Two Americas: Our Current Political Deadlock and How to Break It",
        "Authors": "By Greenberg, Stanley B.",
        "Description": "The 2000 presidential left the world standing still, but it was no fluke. America is divided right down the middle - the product of a half-century, unique in our country's history, of inconclusive, increasingly heated partisan battle.  Tantalizingly close to victory, each party inflames and mobilizes its most loyal supporters and battles to gain even a small edge with some contested groups.  Politics has become culture war - a fight about values, faith, the family, how people should live their lives.  The result: partisans are more partisan, politics more polarized, America more divided.The Two Americas: Our Current Political Deadlock and How to Break It tells the history of each party's failed efforts to dominate the era's politics and ideas, radically changing the political landscape.  The book provides an in-depth guide to the new groups at the center of our politics.  Internationally renowned political strategist and pollster Stanley Greenberg puts the reader in the room with the strategists and politicians and shows how each party can win, even shatter the impasse.The Two Americas is a political primer and strategic playbook for this unique era - essential reading for any armchair political strategist or engaged citizen eager to understand our future politics.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Molto Agitato: The Mayhem Behind the Music at the Metropolitan Opera",
        "Authors": "By Fiedler, Johanna",
        "Description": "Behind the gold curtains of the Metropolitan Opera House, amidst the elaborate sets, bejeweled costumes, and labyrinth of administrative offices, the Met has traditionally operated in great secrecy.  Until now.Johanna Fiedler, who was the Met’s general press representative for fifteen years, draws upon her insider’s knowledge and rivetingly reveals for the first time the company’s Byzantine inner workings and the personal, social, economic, and artistic struggles that have always characterized the Met.Molto Agitato is a tale with an appropriately operatic cast of characters_haughty blue bloods, ambitious social climbers, determined administrators, stubborn board members, temperamental artists_all maneuvering to use their power and influence to make the Met conform to their own agendas.  Fiedler brings to life the early days of the Met, with the imperious Toscanini arriving from Italy and Caruso filling the house; the post-WW II years, when the unions gained strength and plagued the company with strikes; and the ever present passions of tenors and sopranos, clashing offstage as well as on.  But most revelatory are Fiedler’s portrayals of James Levine and Joseph Volpe and their practically parallel ascendancies_Levine rising from prodigy to artistic director, Volpe advancing from stagehand to general manager_and their once strained relationship that was compounded by Volpe’s much publicized firing of the soprano Kathleen Battle.With its swift-flowing narrative, Molto Agitato is a wonderfully entertaining and thoroughly engaging account not only of one of the world’s most respected and richest music institutions but also of power, politics, ambition, and egos.",
        "Category": " Music , Genres & Styles , Opera",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Headaches: An Alternative Medicine Definitive Guide (Alternative Medicine Definative Guide)",
        "Authors": "By Goldberg, Burton, Milne, Robert D., and More, Blake",
        "Description": "Offers natural therapies to eliminate all types of headaches, including migraine, sinus, and tension",
        "Category": " Medical , Alternative Medicine",
        "Publisher": "Alternativemedicine.com Books",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Seduced by Moonlight (Meredith Gentry, Book 3)",
        "Authors": "By Hamilton, Laurell K.",
        "Description": "I am Meredith Gentry, P.I. and Princess Merry, heir to the throne of Fairie. Now there are those among me who whisper I am more. They fear me even as they protect me. And who can blame them? I've awakened the dazzling magic that's slumbered in them for thousands of years. But the thing is, I can't figure out why.My aunt, the Queen of Air and Darkness, is no longer distracted by her usual sadistic hobbies. Her obsession has turned unwaveringly to me. The mission to get me pregnant and beat my cousin Prince Cel to the crown is taking longer than expected. Even though I spend each night with the Queen's Ravens, my immortal guards, no child has come of our decadent pleasures. But something else is happening. My magic courses through me uncontrollably. And as I lock my half-mortal body with their full-Sidhe-blooded ones, the power surges like never before.It all began with the chalice. I dreamed of it, and it appeared, cool and hard, beside me when I awoke. My guards knew the ancient relic well - its disappearance ages ago stripped them of their vital powers. But it is here with us now. My touch resonates with its force, and they're consumed with it, their Sidhe essences lit up by it. But even as they cherish me for this unexpected gift, there are those who loathe me for it. Me, a mongrel, only half-fey and part mortal.The Unseelie court has suffered for so long, and there are some who would not have it weakened further by an impure queen. My enemies grow in number every day. But they do not know what I am capable of. Nor, for that matter, do I.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Talks With Authors.",
        "Authors": "By Southern Illinois University",
        "Description": "",
        "Category": " Literary Criticism , General",
        "Publisher": "Southern Illinois University Press",
        "Price Starting With ($)": "7.83",
        "Publish Date": {
            "Month": "June",
            "Year": "1968"
        }
    },
    {
        "Title": "Wagered Heart",
        "Authors": "By Hatcher, Robin Lee",
        "Description": "When Bethany Silverton left the genteel life of Miss Henderson’s School for Young Ladies back in Philadelphia for the raw frontier town of Sweetwater, Montana, she had no idea how much she would enjoy the freedom and danger of this wild country.A conservative preacher’s daughter, Bethany can’t resist the challenge of charming the most attractive cowboy in town into attending her father’s new church. She never dreamed that the cowboy would charm the lady.But Hawk Chandler isn’t the only man vying for Bethany’s affections. Ruthlessly ambitious Vince Richards thinks Bethany is perfect for him: attractive, gracious, just the woman to help him become governor. And he is determined to get what he wants at any cost.Drawn to one man, an obsession of another, Bethany’s quiet life is thrown into turmoil. She wagered her heart on love. Now she has gotten more than she bargained for—and the stakes are about to become life and death.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Dinosaur's Day (Dorling Kindersley Readers, Level 1: Beginning to Read)",
        "Authors": "By Thomson, Ruth",
        "Description": "A gentle Triceratops forgets to stay with the herd and has to use his sharp horns to fight a Tyrannosaurus.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Failing Grades: A Teachers Report Card on Education in America",
        "Authors": "By Bigler, Philip and Lockard, Karen",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "Vandamere Pr",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "A guide to historical method (The Dorsey series in history)",
        "Authors": "By Shafer, Robert Jones",
        "Description": "",
        "Category": "",
        "Publisher": "Dorsey Press",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Bastard Prince: Volume III of The Heirs of Saint Camber (The Heirs of Saint Camber, Vol 3)",
        "Authors": "By Kurtz, Katherine",
        "Description": "THE PRINCES IN THE TOWERThe power-hungry former Regents of the three Haldane princes were pleased. They controlled Gwynedd once more, now that Rhys Michael was king--malleable, wine-loving, and soft. Or so they thought...Unbeknownst to the Regents, Rhys Michael was coming into his birthright. With secret Deryni aid, he struggled to grasp the magic bequeathed to all anointed kings. And when Marek--heir to Gwynedd's last degenerate deposed Deryni despots--marched into Gwynedd at the head of an army, even the Regents had to admit that Rhys Michael must take to the field himself as king to repel the pretender.Rhys Michael saw his chance at last. He swore that the power of the throne--from now on and for all time to come--was to be held by Gwynedd's rightful king. For this, for his sons, and for his country, the king would risk all...FIRST PAPERBACK PUBLICATIONFrom the Paperback edition.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Winning Life: An Introduction to Buddhist Practice",
        "Authors": "By world-tribune-press",
        "Description": "",
        "Category": "",
        "Publisher": "World Tribune Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "GALLOWAY (The Sacketts)",
        "Authors": "By L'Amour, Louis",
        "Description": "Galloway Sackett searches the mountainous Apache country for his brother who is unarmed, on foot, and struggling for survival",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1970"
        }
    },
    {
        "Title": "Kids Are Americans Too",
        "Authors": "By O'Reilly, Bill and Flowers, Charles",
        "Description": "Four-time #1 bestselling author and veteran television news journalist Bill O'Reilly has more than 5 million copies of his books in print to date! His first book for younger fans, The O'Reilly Factor for Kids, held the honorable distinction of being the #1 bestselling nonfiction title for kids in 2005 according to Nielsen's The Book Standard.Back again with a dialogue on rights that will have everyone talking, O'Reilly and his coauthor Charles Flowers dole out the kind of blunt, cogent, commonsense commentary you count on them for. Together they explore timely questions being debated in and out of courts today including:Can a kid wear an antigay T-shirt on campus?Does a school newspaper have the right to bad-mouth a principal?Does a mother have the right to eavesdrop on her daughter's telephone conversations? Some of the answers will surprise you. Some will empower you. All of them will make you think.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Gonna Lay Down My Burdens",
        "Authors": "By Monroe, Mary",
        "Description": "Carmen Taylor finds her life spinning out of control when her best friend Desiree begins dating Chester Sheffield, the man Carmen has loved for years, and when Desiree gets pregant with his child, Carmen commits a  reckless crime of passion that forces her, along with Desiree, to make some difficult choices that will change their lives forever. 50,000 first printing.",
        "Category": " Fiction , Literary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Days In The Lives Of Social Workers: 50 Professionals Tell \"Real-Life\" Stories From Social Work Practice",
        "Authors": "By Grobman, Linda May (EDT)",
        "Description": "",
        "Category": " Social Science , Social Work",
        "Publisher": "White Hat Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "A Guide to Smithsonian Architecture",
        "Authors": "By Ewing, Heather and Ballard, Amy",
        "Description": "The buildings of the Smithsonian Institution not only contain impressive collections; they are themselves icons of great cultural significance, many of them part of the historic National Mall. The Smithsonian's unique buildings illustrate the changing styles and sensibilities of America as an evolving nation. Representing the work of major architects, each building evokes a specific time in history: the mid-19th-century turreted Castle, the sky-reflecting mid-century modern Air and Space Museum, and the golden, undulating, 21st-century American Indian Museum.",
        "Category": " Architecture , Buildings , Landmarks & Monuments",
        "Publisher": "Smithsonian Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Men's Wardrobe (Chic Simple)",
        "Authors": "By Gross, Kim Johnson, Stone, Jeff, Hochswender, Woody, and Bashaw, David",
        "Description": "Men's clothes today are confusing--they reflect the multi-task world we all live in, where work is a constant presence and fun is serious business. The old uniforms are gone, with casual work environments, new cultural standards, and increasing global influences, new styles are evolving. In this changing time, Chic Simple Men's Wardrobe makes the myriad options easy, accessible, and inexpensive. The book is divided into four sections of a guy's life:  WORK LIFE takes you through everything you need to compete sartorially whether you work at home or in an office, EVERYDAY LIFE reflects today's more casual society and the new dress codes for weekends and after work, OUTDOOR LIFE is a gear guide to both the classics and the tech-advanced sport clothes for golf, tennis, skiing, fishing, hunting, or the gym, and evening wear, whether for a casual dinner date or opening night, is covered in NIGHT LIFE. In addition, you'll learn to:--dress for an interview or a night on the town--handle the new corporate casual look--travel for a week with an overnight bag--relax when the invite reads \"black tie\"--choose the right cut for your body type--dejunk your closet and recycle the classics you own--create a low-maintenance lifetime wardrobeFirst Aid, a section in the back, turns you into your own valet--stains, starch, ironing are demystified; how to pack and how to shop are deconstructed; and a glossary defines more than 200 terms from \"gusset\" to \"placket.\"",
        "Category": " Self-help , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Pitch Like a Girl: How a Woman Can Be Herself and Still Succeed",
        "Authors": "By Lichtenberg, Ronna",
        "Description": "Shelves full of business books have told women that the only way to win at work is to be like a guy. The truth is that science shows that the brains of men and women work differently. Here are proven techniques to maximize the intrinsic and instinctive strengths of women for the workplace.Despite steady advancement, part of the reason for women's continuing struggle for success is a very personal challenge: They feel uncomfortable doing anything that feels like self-promotion.That's why Ronna Lichtenberg, corporate veteran turned highly sought-after management consultant, built a program for women that works with their unique advantages.Starting with recent developments in brain sex research and moving through social stereotypes, Lichtenberg takes a fresh look at how women relate to work and shows them how to use their gifts to get what they want. The book includes easy-to-use tools, tips on managing communication styles, and exercises that have been honed in Lichtenberg's many workshops.Whether giving women pragmatic advice on what to do about that infuriating boss, how to know how much money they should be making (and how to get it), or how to follow up without feeling like a beggar or a stalker, Lichtenberg is real, and really funny at the same time. Her advice ushers in a new world of possibilities for women who are ready for a success that feels right.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Frankenstein (Case Studies in Contemporary Criticism)",
        "Authors": "By Shelley, Mary Wollstonecraft and Smith, Johanna M. (EDT)",
        "Description": "This revision of a widely adopted critical edition presents the 1831 text of Mary Shelley’s English Romantic novel along with critical essays that introduce students to Frankenstein from contemporary psychoanalytic, Marxist, feminist, gender, and cultural studies perspectives. An additional essay demonstrates how various critical perspectives can be combined. In the second edition, 3 of the 6 essays are new. The text and essays are complemented by contextual documents, introductions (with bibliographies), and a glossary of critical and theoretical terms.",
        "Category": " Fiction , Classics",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Tale of Benjamin Bunny (The 23 Tales No.4)",
        "Authors": "By Potter, Beatrix",
        "Description": "A tale about Peter Rabbit, his cousin Benjamin, and the cat in Mr. McGregor's garden",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Frederick Warne & Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Dying for Mercy (Key News Thrillers)",
        "Authors": "By Clark, Mary Jane",
        "Description": "“[Clark] deftly combines the clue-searching and puzzle-solving fun of mysteries with the action-packed, emotion-driven narrative thrust of thrillers.” —Pittsburgh Tribune Review “One of Clark’s—and the genre’s—best.”—Associated Press A very suspicious death and a sprawling mansion with secrets and puzzles built into the very architecture are among the elements that make Dying for Mercy an unputdownable mystery. The third riveting thriller from New York Times bestselling Mary Jane Clark to feature Eliza Blake and her KEY News television colleagues, Dying for Mercy combines the gripping suspense of Faye Kellerman with the kind of brilliant twists, turns, and surprises that would make Agatha Christie proud. Mary Jane Clark is a member of the same writing family as fellow suspense superstars Mary Higgins Clark and Carol Higgins Clark, and this superior puzzler puts her at the very top of the family tree.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Cookshelf Chocolate",
        "Authors": "By Jacqueline Bellefontaine",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Effective Parenting for the Hard-to-Manage Child: A Skills-Based Book",
        "Authors": "By Degangi, Georgia A. and Kendall, Anne",
        "Description": "Effective Parenting for the Hard-to-Manage Child is a skills-based book for parents who need practical advice from experts, without all the jargon and generalizations. The book provides specific strategies and techniques for children who are intense, highly reactive, and unable to self-calm.It integrates various treatment approaches in a clear and accessible manner, and offers the \"best kept secrets\" from the fields of mental health and occupational therapy. The book emphasizes key concepts and everyday activities that will help children take charge of their problems, and it is an invaluable resource for any parent faced with the challenge of a hard-to-manage child.",
        "Category": " Psychology , Developmental , Child",
        "Publisher": "Routledge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Ultimate Barbra",
        "Authors": "By Cunningham, Ernest W.",
        "Description": "This year, 1998 marks the thirtieth anniversary of Funny Girl, Barbra Streisand's sensational first movie.  To celebrate her plunge into world prominence and popularity, we give you The Ultimate Barbra.  This book is an intriguing compilation of information and lore about this multi-talented and phenomenal star, with a special presentation of the people, places, and events of her headline-making life and career to date. The Ultimate Barbra is a unique, comprehensive volume and is unlike any other book to date on Ms. Streisand. It is an entertaining, bold compendium of test-your-knowledge quizzes, lists, directories of people and places, chronologies, trivia challenges, special appendices (including bibliographies, Web sites and fan club listings), and more. All aspects of her phenomenal talent are covered: her career on stage, film, TV, and in the recording studios; her love life which has ranged from Elvis Presley to Elliott Gould to Canadian prime minister Pierre Trudeau to Don Johnson to current husband James Brolin, being a mother, and her offstage activities in the arenas of philanthropy, politics, and environmentalism.This book is an informative and clever look at the richly textured life and career of the superstar who offends almost as many people as she delights. Readers and fans may be familiar with the details of her much-chronicled life, but they have not seen them presented in such an unusual and intriguing way as offered in The Ultimate Barbra.",
        "Category": " Performing Arts , Film & Video , General",
        "Publisher": "Renaissance Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Pig and I: How I Learned to Love Men (Almost) as Much as I Love My Pets",
        "Authors": "By Toor, Rachel",
        "Description": "As a single woman acquires a series of unusual pets, she finds that her boyfriends bear an uncanny resemblance to the animals, despite the fact that her love for each man inevitably fades while her love of animals deepens. Reprint.",
        "Category": " Pets , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "A Plague of Secrets: A Novel (Dismas Hardy, Book 13)",
        "Authors": "By Lescroart, John T.",
        "Description": "Dismas Hardy defends Maya Townshend, the beautiful socialite niece of the San Francisco's mayor, who is suspected of killing a charming ex-convict. A compelling and timely legal thriller filled with blackmail, political intrigue, and multiple murder which also features returning characters Abe Glitsky and Wyatt Hunt.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "The Outlander: A Novel (P.S.)",
        "Authors": "By Adamson, Gil",
        "Description": "In 1903 Mary Boulton flees alone across the West, one heart-pounding step ahead of the law. At nineteen, she has just become a widow–and her husband's killer. As bloodhounds track her frantic race toward the mountains, she is tormented by mad visions and by the knowledge that her two ruthless brothers-in-law are in pursuit, determined to avenge their younger brother's death. Responding to little more than the primitive instinct for survival at any cost, she retreats ever deeper into the wilderness–and into the wilds of her own mind.",
        "Category": " Fiction , Literary",
        "Publisher": "Ecco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Are You Dumb Enough to Be Rich? The Amazingly Simple Way to Make Millions in Real Estate",
        "Authors": "By Allen, Robert G. (FRW) and Barnett, G. William, II",
        "Description": "No investment strategy has created more millionaires that real estate… even in less-than-stellar markets. This new edition of the bestselling Are You Dumb Enough to Be Rich? empowers readers to take their first steps toward real estate investing. The book walks readers through a special 120-day plan for starting down the road to real estate wealth. Barnett gives readers the information and resources they need to find the neighborhoods with the most potential, avoid the common pitfalls of real estate investment, and build personal and professional credibility. The new editions includes exciting trends and opportunities to take advantage of, changes in specific state laws… even ways to actually profit from a downturn! In addition, the book now includes Barnett’s new “Hot Mapping” system for figuring out where to invest. Too many real estate books focus on stories and unrealistic examples of how other people became rich. Are You Dumb Enough to Be Rich? offers real strategies for people wishing to make smart, low-risk investments. Straightforward and easy-to-follow, this book demonstrates that anyone can make money- lots of it!- in real estate.",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Ultimate Fitness: The Quest for Truth about Health and Exercise",
        "Authors": "By Kolata, Gina",
        "Description": "The bestselling science reporter for  The New York Times  tells us what works and what doesn’t when we work out Ultimate Fitness: The Quest for Truth About Exercise and Health  is Gina Kolata’s compelling journey into the world of American physical fitness over the past thirty years. It is a funny, eye-opening, brow-sweating investigation into the fads, fictions, and science of fitness training. From the early days of jogging, championed by Jim Fixx— who later died of a heart attack—to weight lifting, cycling, aerobics, and Spinning, Kolata questions such popular notions as the “fat-burning zone” and “spot reducing,” the effects of food on performance, how much exercise helps build fitness, and the difference between exercise to help the heart and exercise to change the body. She explains the science of physical fitness and the objective evidence behind commonly accepted prescriptions. Along the way she profiles researchers and mavericks who have challenged conventional wisdom, marketed their inventions, and sometimes bucked criticism only to back down from their original claims.  Ultimate Fitness  spotlights the machines and machinations of the fitness industry, and cuts through the marketing and hype not only to assess what is healthy, but also to understand what our obsession with staying healthy says about American culture today.",
        "Category": " Health & Fitness , General",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Reclaiming Conservatism: How a Great American Political Movement Got Lost--And How It Can Find Its Way Back",
        "Authors": "By Edwards, Mickey",
        "Description": "A leading figure in the American conservative movement for over 40 years, Mickey Edwards was a prominent Republican congressman, a former national chairman of the American Conservative Union, and a founding trustee of the Heritage Foundation. When he speaks, conservatives listen.      Now, in this highly provocative and frank volume, Edwards argues loud and clear that conservatives today have abandoned their principles and have become champions of that which they once most feared. The conservative movement--which once nominated Barry Goldwater for President, and later elected Ronald Reagan--was based on a distinctly American kind of conservatism which drew its inspiration directly from the United States Constitution--in particular, an overriding belief in individual liberty and limited government.  But today, Edwards argues, the mantle of conservatism has been taken over by people whose beliefs and policies threaten the entire constitutional system of government. By abetting an imperial presidency, he contends, so-called \"conservatives\" have gutted the system of checks and balances, abandoned due process, and trampled upon our cherished civil liberties. Today's conservatives endorse unprecedented assertions of government power--from the creation of secret prisons to illegal wiretapping.  Once, they fought to protect citizens from government intrusion; today, they seem to recognize few limits on what government can do.  The movement that was once the Constitution's--and freedom's--strongest defender is now at risk of becoming its most dangerous enemy. Edwards ends with a blueprint for reclaiming the essence of conservatism in America.    Touching upon many current issues, this passionately argued book concludes that many of today's conservatives seem to have it all backwards.  They have turned conservatism upside down--and this book calls them on it.",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Spidering Hacks",
        "Authors": "By Calishain, Tara and Hemenway, Kevin",
        "Description": "The Internet, with its profusion of information, has made us hungry for ever more, ever better data. Out of necessity, many of us have become pretty adept with search engine queries, but there are times when even the most powerful search engines aren't enough. If you've ever wanted your data in a different form than it's presented, or wanted to collect data from several sites and see it side-by-side without the constraints of a browser, then Spidering Hacks is for you.Spidering Hacks takes you to the next level in Internet data retrieval--beyond search engines--by showing you how to create spiders and bots to retrieve information from your favorite sites and data sources. You'll no longer feel constrained by the way host sites think you want to see their data presented--you'll learn how to scrape and repurpose raw data so you can view in a way that's meaningful to you.Written for developers, researchers, technical assistants, librarians, and power users, Spidering Hacks provides expert tips on spidering and scraping methodologies. You'll begin with a crash course in spidering concepts, tools (Perl, LWP, out-of-the-box utilities), and ethics (how to know when you've gone too far: what's acceptable and unacceptable). Next, you'll collect media files and data from databases. Then you'll learn how to interpret and understand the data, repurpose it for use in other applications, and even build authorized interfaces to integrate the data into your own content.  By the time you finish Spidering Hacks, you'll be able to:Aggregate and associate data from disparate locations, then store and manipulate the data as you likeGain a competitive edge in business by knowing when competitors' products are on sale, and comparing sales ranks and product placement on e-commerce sitesIntegrate third-party data into your own applications or web sitesMake your own site easier to scrape and more usable to othersKeep up-to-date with your favorite comics strips, news stories, stock tips, and more without visiting the site every dayLike the other books in O'Reilly's popular Hacks series, Spidering Hacks brings you 100 industrial-strength tips and tools from the experts to help you master this technology.  If you're interested in data retrieval of any type, this book provides a wealth of data for finding a wealth of data.",
        "Category": " Computers , Databases , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "American Grit: What It Will Take to Survive and Win in the 21st Century",
        "Authors": "By Blankley, Tony",
        "Description": "Tough Times Call for Tough ActionIn American Grit, nationally syndicated columnist Tony Blankley warns that the administration of Barack Obama is a potential disaster at a dangerous time for America. Challenging Americans to recapture the spirit of sacrifice that has historically characterized our nation, Blankley demonstrates how Obama's agenda, with its emphasis on environmental sensitivity, military retreat, and the diminution of executive branch powers, promotes national weakness as a righteous ideal. In contrast, Blankley puts forward his own nationalist program based on toughness, resoluteness, and grit--traditional American values totally absent from Obama's agenda. In this passionate, hard-hitting book, Blankley shows:* How Obama's plan for national service is a weak substitute for what America really needs--a full-on military draft* How Obama's infatuation with alternative energy will damage America's national interests* Why we need stricter laws to prevent the media from compromising our national security* Why the office of the presidency, contrary to popular belief, has not gained enough power since the September 11 attacks* How we can craft a successful foreign policy that avoids the mistakes of both the liberals and the neo-cons* How our war effort in Iraq was undermined by effective enemy propaganda--and what we can do about it* Why education reform under President Obama will fail to address one of the biggest problems in our education system: the failure to teach patriotism Filled with solutions to problems ranging from the detention of enemy combatants to dealing with aggressive petro-states like Russia, Venezuela, and Iran, American Grit demonstrates how this country can emerge from its current domestic and military challenges as a stronger, more unified, and more tenacious nation--and why under President Obama, it won't.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "The Redbreast: A Harry Hole Novel (Harry Hole Series, 3)",
        "Authors": "By Nesbo, Jo and Bartlett, Don (TRN)",
        "Description": "“An elegant and complex thriller...ingenious…harrowingly beautiful.”—New York Times Book ReviewThe third novel in the brilliant and epic Harry Hole series from the author of The Snowman.Detective Harry Hole embarrassed the force, and for his sins he’s been reassigned to mundane surveillance tasks. But while monitoring neo-Nazi activities in Oslo, Hole is inadvertently drawn into a mystery with deep roots in Norway’s dark past, when members of the government willingly collaborated with Nazi Germany. More than sixty years later, this black mark won’t wash away—and disgraced old soldiers who once survived a brutal Russian winter are being murdered, one by one. Now, with only a stained and guilty conscience to guide him, an angry, alcoholic, error-prone policeman must make his way safely past the traps and mirrors of a twisted criminal mind. For a conspiracy is taking rapid and hideous shape around Hole...and Norway’s darkest hour may be still to come.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper-perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "The Sundance Reader (with InfoTrac)",
        "Authors": "By Connelly, Mark (EDT)",
        "Description": "Continuing to offer a superior teaching apparatus, a diverse collection of rhetorically arranged readings, and visual writing prompts, THE SUNDANCE READER, 4th edition will be accompanied by a new custom database, The SUNDANCE CHOICE, to meet the specific needs of the instructor, department and students.",
        "Category": " Education , Higher",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Herbal Wreaths: More Than 60 Fragrant, Colorful Wreaths to Make and Enjoy",
        "Authors": "By Taylor, Carol",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "The \"Simpsons\": The Complete Guide to Your Favorite Family",
        "Authors": "By Groening, Matt",
        "Description": "An episode-by-episode guide to the television programme that allows Simpsons fans to relive every joke, reference and favourite moments that they enjoyed the first time round.",
        "Category": " Humor , General",
        "Publisher": "HarperCollins Publishers Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The Bridge Player's Comprehensive Guide to Defense",
        "Authors": "By Stewart, Frank",
        "Description": "",
        "Category": " Games , General",
        "Publisher": "Dodd, Mead",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Starting Yoga: A Step-by-Step Program for Health and Well-being",
        "Authors": "By Hall, Doriel",
        "Description": "",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Cassell Illustrated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Life Without Limits: Clarify What You Want, Redefine Your Dreams, Become the Person You Want to Be",
        "Authors": "By Bassett, Lucinda",
        "Description": "In Life Without Limits, Bassett asks, \"If you could have, do, and be anything right now, what would you ask for?\" Eight out of ten people are unable to answer this simple question.How about you? Do you know how to get what you want? Do you even know what you want? What do you see when you look in the mirror? A self-confident, radiant person who is living life to the fullest? Or do you see a frustrated, insecure, dissatisfied person who doesn't know how to change things? Bassett says, \"In my work, I am continually amazed at the number of people who are personally, professionally, and financially frustrated. But the worst part is, if they could change things, they aren't sure how, or even what they would change.\" People stop dreaming, settling for a life that is neither satisfying nor rewarding because their fears and insecurities prevent them from seeing what they want in life, and how to get it. Acquiring happiness, wealth, or success on any level is difficult when you aren't clear about what you want and you don't have a plan. Before you know it, years pass by, and you're looking back with regrets.\"In my work over the past fourteen years, I have encountered two types of people. The first group is the \"doers.\" They are the movers and the shakers. They plan their life and are strongly motivated. They are on a clear path, know exactly what they want, and they are willing to take the risks to get it. The second group is the \"drifters.\" They drift through life with no real sense of direction, ending up frustrated. This can happen to people in the most prestigious occupations. The drifters have a hard time establishing a sense of true happiness, satisfaction, or security because they know they aren't where they \"should be,\" but they don't know what to do about it.Life Without Limits helps you clarify what you want in every area of your life. By using Bassett's powerful techniques you will change, therefore your life will change. Your thoughts are magnets attracting everything from the type of people you meet to the types of opportunities that come your way. Your thinking must be clear, distinct, and sharply defined. Your focused thoughts elicit emotion; your emotions ignite your actions and have a tremendous effect on the universal energy that surrounds you. You control your life. You control your destiny. And only you can take steps to change it. Life Without Limits helps you take back your power.Life Without Limits is the complete guide to attaining abundance in every area of your life. It will help you to achieve satisfaction and fulfillment personally, professionally, and financially. Once you have defined what success means for you, you will clarify your dreams and start pursuing them. Opportunities will present themselves, new doors will open, and you will begin to live the life you were meant to live: a life without limits.\"Begin now to change the person you are into the person you know you have the potential to become.\" -- Lucinda Bassett",
        "Category": " Self-help , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Lost Souls (A Bentz/Montoya Novel)",
        "Authors": "By Jackson, Lisa",
        "Description": "#1 New York Times bestselling author Lisa Jackson’s bestselling Bentz & Montoya series is back with this chilling story of true crime come to life as Rick Bentz’s daughter gets too close to an investigation that might cost her own life…\"Solidifies Jackson's status as the queen of the modern-day suspense thriller.\" —The Providence JournalKristi Bentz wants to write true crime. All she needs is that one case that will take her to the top. She finds it when she enrolls at All Saints College after learning that four girls have disappeared in less than two years. \"Expect the unexpected.\" —The Clarion LedgerAll four girls were \"lost souls\"--troubled, vulnerable girls with no one to care about them, no one to come looking for them if they disappeared. The only person that believes Kristi is her ex-lover, Jay McKnight, a professor on campus. The police think they're runaways, but Kristi senses there's something that links them--something terrifying.  .  .\"Jackson creates relentless suspense.  .  .builds the tension to an unbearable and satisfying pitch.\" —BooklistAs Kristi gets deeper into her investigation, she gets the feeling she's being watched and followed--studied, even. Then the bodies start turning up, and Kristi realizes she is playing a game with a killer who has selected her for membership in a special club from which there will be no escaping death.  .  .\"Dark and disturbing.\" —The Roanoke Times",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    }
]