[
    {
        "Title": "A Tale of Two Cities (Penguin Popular Classics)",
        "Authors": "By Dickens, Charles",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books, Limited (UK)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Under Your Spell (Witches of Mayfair, Book 1)",
        "Authors": "By Greiman, Lois",
        "Description": "Set against the glittering backdrop of Regency England, the first book in the Witches of Mayfair series follows the romantic adventures of a group of women who are members of a secret society operating at the highest levels of London society. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Hunter's Prey: Erotic Tales of Texas Vampires (Texas Vampires) (Berkley Heat)",
        "Authors": "By Whiteside, Diane",
        "Description": "Two sisters are ushered into a world of sweltering carnal delights that only two strapping nightstalkers can offer...A female cat burglar—caught in the act—is subjected to the most sublime punishment...A party girl with a craving for midnight cocktails meets a stranger with an insatiable thirst of his own...A loving wife gives her husband the ultimate birthday present—a chance to indulge in his dangerous fantasy...A love-starved widow finds herself drawn to the intoxicating rhythms of a strangely compelling musician...",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "A Stone Creek Christmas (A Stone Creek Novel, 4)",
        "Authors": "By Miller, Linda Lael",
        "Description": "Stone Creek veterinarian Olivia O'Ballivan communicates easily with animals, but men are another story. Especially rugged architect-turned-rancher Tanner Quinn. Olivia's uncanny bond with his daughter Sophie's pony, Butterpie, has him questioning her sanity, while she wonders if he's not just a drugstore cowboy. Then twelve-year-old Sophie conspires with Olivia to get Tanner into the spirit of Christmas with all the trimmings, including a tree-lighting ceremony and a man named Kris Kringle in a sleigh driven by seven reindeer&#133;and a donkey. But will a holiday miracle transform the globe-trotting Tanner into a rancher&#151;and family man&#151;for all seasons?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette Special Edition",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Wonderful Tennessee",
        "Authors": "By Friel, Brian",
        "Description": "",
        "Category": "",
        "Publisher": "Faber and Faber",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Of Women and Horses: Essays by Various Horse Women",
        "Authors": "By Pony Boy, Gawani (EDT), Boiselle, Gabrielle (PHT), and Boiselle, Gabrielle (EDT)",
        "Description": "Author and horse trainer GaWaNi Pony Boy has gathered an impressive array of horsewomen from all walks of life and asked them to describe their relationships with their equine partners. The text combines his observations and interviews with some of the women, and personal essays from others. Contains about 100 color photographs by international horse photographer Gabrielle Boiselle, as well as artwork by various artists. Oversize: 9.5x11.5",
        "Category": " Pets , Horses",
        "Publisher": "Lumina Media",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Deep Freeze #12 (Dish)",
        "Authors": "By Pollak, Barbara (ILT) and Muldrow, Diane",
        "Description": "The Chef Girls are excited about the seventh-grade ski trip, which is filled with snow sports and practical jokes. But when Shawn's nemesis Angie plays a prank that goes too far, things take a dangerous turn.",
        "Category": " Juvenile Fiction , Social Themes , Adolescence & Coming of Age",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Biscuit Wins a Prize (My First I Can Read)",
        "Authors": "By Capucilli, Alyssa Satin and Schories, Pat (ILT)",
        "Description": "It's the day of the pet show, and Biscuit has to look his best.  All his old friends are at the show, and Biscuit sees so many new friends that he can't sit still–even for the judge! The lovable yellow puppy's friendliness helps him win a big prize, and the hearts of his readers!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Go, Speed Racer, Go!",
        "Authors": "By Kelly, Sophia (ADP)",
        "Description": "The youngest Speed Racer fans will love this reader which begins with Speed as a young boy. He loves car racing and he idolizes his racing brother, Rex. Speed grows up to become the best race-car driver in the world.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Giant Rat of Sumatra: or Pirates Galore",
        "Authors": "By Fleischman, Sid and Hendrix, John (ILT)",
        "Description": "A swashbuckling tale of thievery and revengeThe Giant Rat of Sumatra is the most notorious pirate ship in the Pacific. Its ferocious figurehead, a rat with crooked teeth and gouged-out eyes, strikes fear in the heart of every seafaring crew. Now the ship has dropped anchor in San Diego. Twelve-year-old cabin boy Shipwreck -- so named after he was rescued from the sea by the pirates -- is anxious to begin his long journey home to Boston. Instead, he finds himself swept up in a treacherous plot. It seems his adventure is only just beginning. . . .",
        "Category": " Juvenile Fiction , Historical , United States , 19th Century",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "God's Little Book of Guarantees - OH",
        "Authors": "By Kopp, Heather Harpham",
        "Description": "This little gift book delivers personalized promises from Scripture rephrased as direct \"guarantees\" from God to the reader. Key verses addressing important areas of life -- finances, marriage, ministry, healing, eternal life, and more -- are organized topically and indexed so seekers can easily find promises to meet their very specific needs. Each page offers one resounding guarantee, complete with \"warranty notes\" describing the conditions of the promise and a short prayer helping the reader \"stake your claim!\" The promises of God have never been easier to find or simpler to receiveguarantee\\gar-en-‘te\\ n 1: a pledge, something given as security 2: the protection of a right afforded by legal provision.  God’s Word Is His Promise  …and His promise is His guarantee.  —A Binding Contract—  This contemporary collection of God’s eternal promises defines His terms of agreement and sets forth His benefit package in key areas of daily living.  In the fine print of these unchanging Warranty Notes is your spiritual insurance policy for abundant living—yesterday, today, and forever. Carry them. Share them. Build on them securely. Signed, sealed, delivered—they’re yours!",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Super Ideas for Youth Groups",
        "Authors": "By Yaconelli, Mike",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Upi Stylebook: The Authoritative Handbook for Writers, Editors & News Directors",
        "Authors": "By United Press International",
        "Description": "",
        "Category": "",
        "Publisher": "Natl Textbook Co Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Stablemates: Lucky",
        "Authors": "By Rogers, Jacqueline (ILT) and Gerver, Jane E.",
        "Description": "The fifth reader in the Stablemates series, featuring a Thoroughbred horse!Sisters Amy and Michele both love to ride horses! But while Michele loves to take part in jumping competitions, Amy is afraid to compete. When Michele signs Amy and her horse, Lucky, up for the next jumping show, Amy has to learn to be brave fast! With a little help from Michele's trainer and some sisterly encouragement, Amy prepares herself for a big win!",
        "Category": " Juvenile Fiction , Family , Siblings",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Essential Songwriting: Everything You Need to Compose, Perform, and Sell Great Songs",
        "Authors": "By C. J. Watson",
        "Description": "",
        "Category": "",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Exposure (Last Chance, Inc., 2)",
        "Authors": "By Davis, Dee",
        "Description": "While on a mission to thwart an international terrorist plot, British special agent Nigel Ferris encounters the one woman he has never been able to forget, photojournalist Melissa Pope, when her life is in jeopardy, plunging them both into a world of intrigue, danger, and passion. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Desert Noir (Lena Jones Series)",
        "Authors": "By Webb, Betty",
        "Description": "At the age of four, Lena Jones was found lying unconscious by the side of an Arizona Highway, a bullet robbing her of any memories. Now a private detective and scarred survivor of a dozen foster homes, Lena has vowed to find the truth about her childhood.But Lena’s quest is interrupted when her friend, art dealer Clarice Kobe, is beaten to death in her Western Heart Art Gallery on Scottsdale’s Main Street. Lena and her Pima Indian partner Jimmy Sisiwan first suspect Clarice’s abusive husband, but their investigation soon reveals that domestic violence was far from the only problem in the dead woman’s life.For all her money and beauty, Clarice had far more enemies than friends. Among them are a fiery Apache artist whose graphic work she once banned from her gallery and the daughter of an elderly Hispanic woman whose death was directly attributable to the gallery owner’s greed. And Clarice’s land developer parents are oddly untroubled by their daughter’s murder.Lena’s search for the killer brings violence back into her own life but does it bring her closer to solving her own personal mystery?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Poisoned Pen Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Worlds Imagined: 14 Short Science Fiction",
        "Authors": "By Silverberg, Robert and Greenberg, Martin Harry (COM)",
        "Description": "14 different writers, with a novella as an example of their work, view science fiction",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "10.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Escape from the Nazis",
        "Authors": "By Graham, Burton",
        "Description": "",
        "Category": "",
        "Publisher": "Castle Books",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Christy: The Women of Primrose Creek",
        "Authors": "By Miller, Linda Lael",
        "Description": "In the second volume in the Women of Primrose Creek series, Christy McQuarry, determined to build a new life for herself and her younger sister, Megan, after being left penniless at her mother's death, struggles to ignore her growing attraction to local marshal Zachary Shaw. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Scripture, thoughts, and things to do during all the days of Lent",
        "Authors": "By Recker, Colane",
        "Description": "",
        "Category": "",
        "Publisher": "Ave Maria Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "You Have the Power: How to Take Back Our Country and Restore Democracy in America",
        "Authors": "By Warner, Judith and Dean, Howard",
        "Description": "If you are worried about the way America is being governed and want to reclaim the country you know and love, now is the time to take it back. Governor Howard Dean argues that you have the power not just to defeat George W. Bush in this election but to change the future course of America.  You Have the Power is an energetic and detailed guide to restoring American democracy. It exposes the radical extremism of today's \"mainstream\" Republicans and shows Democrats how to be Democrats again. By reigniting hope, by tapping into the energy and ideals of the American people, Dean writes, the Democrats can restore America's strength and standing at home and abroad.  Drawing on his experience in the 2004 presidential election and the hope and inspiration of the people he met on the campaign trail, Dean shows how real people -- ordinary Americans like himself -- can come together to take their party, the political process, and their country back.",
        "Category": " Political Science , Political Ideologies , Democracy",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "A Survival Guide for Buying a Home",
        "Authors": "By Davis, Sid",
        "Description": "Buying a home is a complex process that involves a delicate balance of financial, emotional, and practical factors. This essential resource helps readers come out on top, revealing the best strategies for finding and buying a new home -- while saving money every step of the way.Whether looking for a house, condo, co-op, or manufactured home, readers will learn how to:* Hire the right agent* determine financial limits* develop relationships with banks and other potential lenders* evaluate communities* get prequalified or preapproved for a mortgage* negotiate the best price and terms* and more.There’s also a checklist of the 15 costliest mistakes homebuyers make -- and how to avoid every one of them -- plus crucial information on how to sell a home. Owning a home is the American dream, but achieving it can be a nightmarish experience. With this vital information and great strategies, readers will not only find their dream home faster, they will do everything right to move in quickly and confidently!\"",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Confidence Plan: How to Build a Stronger You",
        "Authors": "By Ursiny, Timothy E.",
        "Description": "Few other factors impact your life as much as your personal confidence. The Confidence Plan is a revolutionary guide that gives you a step-by-step process for building a more confident you. This smart and practical book addresses five essential paths to help you boost your self-confidence.Many people want to grow in confidence, but they try to do it without a plan. And while most confidence books may make you temporarily feel good, they fail to give you concrete ways to grow. The Confidence Plan changes that by offering a six-week practical program for taking your confidence to the next level.Using examples of unstoppable people whose mindsets have become even stronger than before, Dr. Tim Ursiny shows how you can do the same by following a step-by-step program focusing on:o Mental strategies for forming beliefs that lead to peak performanceo Emotional approaches for feeling a deep confidenceo Behavioral tactics for creating actions that lead to successo Relationship factors to develop a community that recharges youo Spiritual centeredness that creates unbreakable confidence by living your purpose and mission Dr. Tim's unique, holistic approach guides you through the science and habit of optimism and success, including: o Research on what makes people happy and successful o Links to free guides and resources for trainers, coaches and individuals o Practical, immediate action steps for busy people.No matter what your current level of confidence, The Confidence Plan can help you take it to the next level.",
        "Category": " Self-help , Personal Growth , Self-Esteem",
        "Publisher": "Sourcebooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Latex Companion (Addison-Wesley Series on Tools and Techniques for Computer T)",
        "Authors": "By Goossens, Michel, Mittelbach, Frank, and Samarin, Alexander",
        "Description": "Intended to enhance, not replace, the basic documentation for the typesetting program. Incorporates developments over the past several years, including documentation for the added features in the new release. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Computers , Desktop Applications , Word Processing",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "6.16",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Half a Can of Tomato Paste and Other Culinary Dilemmas: A Cookbook",
        "Authors": "By Anderson, Jean",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The First Humans: Human Origins and History to 10,000 B.C. (Illustrated History of Humankind, Vol. 1)",
        "Authors": "By Burenhult, Goran (EDT) and American Museum of Natural History (COR)",
        "Description": "A splendid first volume in a projected five-volume \"series\" intended for the lay audience. The cover claims connection with the American Museum of Natural History, but the only connection seems to be that the US editor is curator of anthropology there. The copyright is held by Weldon Owen Pty Ltd, Australia, and Bra B÷cker AB of Sweden. The oversize (9.75x12.5\") design is dramatic and appealing, and the visuals are great some 300 captioned photos and drawings; the contributions are smoothly written and coherently organized. Includes a glossary, but lacks a bibliography a serious omission. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Science , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Zagat 2005 Top U.S. Hotels, Resorts & Spas (Zagatsurvey)",
        "Authors": "By Marino, Donna (EDT) and Gollin, Randy (EDT)",
        "Description": "",
        "Category": " Travel , Food, Lodging & Transportation , Hotels, Inns & Hostels",
        "Publisher": "Zagat Survey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Little Moments Big Magic: Inspirational Stories Of Big Brothers And Big Sisters And The Magic They Create",
        "Authors": "By Barrett, Beth, Annis, Alan, and Riffey, Denice",
        "Description": "To commemorate the 100th birthday of Big Brothers Big Sisters, here are 100 touching, inspirational, even surprising and funny stories from a century of mentoring.  This one-of-a-kind treasury is an inspiring collection of those stories and moments we long to hear and even dream about experiencing ourselves, and reminds us of the effect we have on each other when we open ourselves up to the wonders of a new friendship.",
        "Category": " Religion , Inspirational",
        "Publisher": "Magical Moments Pub Llc",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Destination Louvre: A Guided Tour",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Musee De Louvre",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1899"
        }
    },
    {
        "Title": "Food Smart : A Nutritional Atlas",
        "Authors": "By Laura Pawlak, Lisa Turner",
        "Description": "",
        "Category": "",
        "Publisher": "Biomed General",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Fractured Fairy Tales",
        "Authors": "By Jacobs, A. J.",
        "Description": "Long before Politically Correct Bedtime Stories invaded bookstores, Americans were getting their giggles from Fractured Fairy Tales, those delightfully twisted parables brought to us between the cliffhanger adventures of our favorite cartoon heroes, Rocky & Bullwinkle. This collection, illustrated with classic art from the animated series includes the comical retelling of 25 classics such as Pinocchio (who starred in his own variety show \"The Pinocchio Doody Show\"), Jack and the Beanstalk (did you know that Jack grew a beanstalk in the outfield so he could catch fly balls for his baseball team?), or King Midas (who became a dentist so he could give his patients gold fillings). This satirical humor loved for so long by so many, is a must-have for fans of the show and anyone who loves classic fairy tales--with a twist.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Are My Bones Soft and Bendy? (Ask Me Why: Human Body)",
        "Authors": "By Mark Darling, Ed",
        "Description": "",
        "Category": "",
        "Publisher": "Southwestern",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "An American Procession",
        "Authors": "By Kazin, Alfred",
        "Description": "An American Procession is a study, on the largest scale, of the major American writers at work during the historically and literarily crucial century that began in the early 1830s, when Ralph Waldo Emerson founded a national literature on the basis of a metaphysical revolution, and ended on the eve of the 1930s with the triumph of modernism and the critical recognition of the “postponed power” of those who had been modern before their time.  These one hundred years encompassed a period of unprecedented expansion and promise in the United States, and the work of our novelists, essayists, poets, and historians was the mirror of the nation’s spirit. The thirty years preceding the Civil War produced the transcendental idealism of Emerson, Thoreau, and Whitman and the dark romanticism of Hawthorne, Poe, and Melville. In the years just after World War I, modernism reached its exemplary form in the work of Eliot, Pound, Hemingway, Dos Passos, and Fitzgerald, and between the two wars emerged the great realists: Mark Twain, Henry James, Crane, and Dreiser. It is through an exploration of the lives and works of these writers—together with Emily Dickinson, William James, Henry Adams, and Faulkner—that Kazin maps out a great literary procession shaped by individual genius, by history, and by the implacable American sense of self.   With each writer, Alfred Kazin illuminates for us the work, the influences that informed it, and its influence on the work of others. Each figure seems revitalized for us by Kazin’s acuity and powerful sympathy for his subject. An American Procession, with its intellectual energy, its clarity and breadth, is the brilliantly executed capstone of Kazin’s already illustrious career and will stand as the most important study of American literature in our time.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Fairyopolis: A Flower Fairies Journal",
        "Authors": "By Barker, Cicely Mary",
        "Description": "Do you believe in fairies? Protected and hidden by a society of Fairy lovers for over 80 years the secret fairy journal of Cicely Mary Barker is available for the first time ever to the public. Learn what really happened during that magical Summer of 1920 when Cicely Mary Barker discovered the secret world of the Flower Fairies.",
        "Category": " Juvenile Fiction , Science & Nature , Environment",
        "Publisher": "Warne",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Chuck Swindoll Collection",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Tek Secret",
        "Authors": "By Shatner, William",
        "Description": "Searching for the missing daughter of the world's wealthiest robotics industrialist, Jake Cardigan locates his target at the Mentor Psych Center where she has been brainwashed to prevent her from telling about a murderous plot. Reprint.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Hanging By a Thread",
        "Authors": "By Kahn, Joan",
        "Description": "",
        "Category": "",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Taken to the Cleaners (Mandy Dyer Mystery)",
        "Authors": "By Johnson, Dolores",
        "Description": "A \"cozy\" mystery stars a Denver dry cleaner and recent divorce+a7e who comes across a bloody men's suit and, despite the disappearance of potential witness, tries to discover the whereabouts of its owner. Original.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "African American Book of Days: Inspirational History & Thoughts for Every Day of the Year",
        "Authors": "By Stewart, Julia",
        "Description": "A trivia-filled compendium spanning the full range of African-American history offers a day-by-day chronicle highlighting important events, personalities, and accomplishments. Original.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Citadel",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "The Baker Book of Bible Travels for Kids",
        "Authors": "By Adams, Anne",
        "Description": "An adventure into the ancient world of the Old and New Testaments. Each entry includes a modern itinerary of a Bible passage where the place can be found, the Bible persons involved in the story, how they travelled, the reason for the visit, and a then and now description of the ancient city.",
        "Category": " Religion , Biblical Reference , General",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "New Kids Book of Bible Facts",
        "Authors": "By Adams, Anne",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "6.84",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Lidia's Italian Table: More Than 200 Recipes From The First Lady Of Italian Cooking",
        "Authors": "By Styler, Christopher (EDT) and Bastianich, Lidia",
        "Description": "Lidia's Italian TableLIDIA MATTICCHIO BASTIANICH\"Let me invite you on a journey with me from my childhood ...\" beckons Lidia Bastianich, hostess of the national public television series Lidia's Italian Table. And what an incredible journey it proves to be. Lidia's Italian Table is overflowing with glorious Italian food, highlighted by Lidia's personal collection of recipes accumulated since her childhood in Istria, located in northern Italy on the Adriatic Sea. Hearty and heartwarming Italian fare is what Lidia understands best, and each chapter of this gorgeous cookbook is infused with Lidia's warm memories of a lifetime of eating and cooking Italian style. Since good Italian food is based on good ingredients, Lidia includes an eloquent discourse on those products that are the cornerstones of Italian cuisine: olives (and their green-golden oil), Parmigiano-Reggiano cheese, salt, porcini mushrooms, truffles, tomato paste, and hot peppers. She also explains the importance of regional wines and grappa (in flavors from honey to dried fig) in the Italian food experience. Her recipes are filled with these Italian delicacies--Fennel, Olive, and Citrus Salad; Tagliatelle with Porcini Mushroom Sauce; Seared Rabbit Loin over Arugula with Truffle Dressing; Asparagus Gratin with Parmigiano-Reggiano Cheese-, and Zabaglione with Barolo Wine. Lidia explores every corner of Italian cuisine: from fresh and dry pasta to gnocchi and risotto to game and shellfish, all of which Lidia transforms into exceptional Italian dishes. But that is only the beginning. There are Italian soups to savor, like hearty minestre, bread-enriched zuppe, and the light and flavorful brodi. Polenta's delicious versatility is revealed through Polenta, Gorgonzola, and Savoy Cabbage Torte and White Creamy Polenta with Fresh Plums. And Lidia's luscious dolci, or desserts, invite your indulgence with Sweet Crepes with Chocolate Walnut Filling, Blueberry-Apricot Frangipane Tart, and Soft Ice Cream with Hazelnuts. Lidia attributes her passion and appreciation for Italian food to her family. Lidia's Italian Table is filled with stories of learning to make Easter bread with her Grandma Rosa in the town's communal oven; touching and smelling her way through the food markets of Trieste with her great-aunt Zia Nina; fishing for calamari with her uncle Zio Milio; and collecting briny mussels and sea urchins along the Istrian coastline with her cousins. This gastronomic adventure is more than just a cookbook: It is an exploration into the heart of Italian cuisine.",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "53.97",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Christmas Homecoming: Silver Bells/The First Noelle/I'll Be Home for Christmas/O Christmas Tree (Romancing America: Colorado)",
        "Authors": "By Dooly, Paige Winship, Goddard, Elizabeth, Mayne, Debby, and Ludwig, Elizabeth",
        "Description": "Soar to new heights in this inspirational Christmas romance collection where four females encounter love amid the Colorado Rockies. A widowed grandmother, Carol Scheirer, is filled with angst, unsure that her family will accept the new man in her life. Wedding planner Noelle Evans wonders if the guy who once jilted her deserves a second chance. Old letters put writer Christmas Scheirer at odds with the guardian of her grandfather’s estate. Missionary Holly Rivers finds she still has feelings for the man she left behind. Will mistletoe missives result in more than one Boulder bride?",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Publishing, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "100 Best Favorite Brand Name Recipes",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Ride the River: The Sacketts: A Novel",
        "Authors": "By L'Amour, Louis",
        "Description": "Alone in the big city, a fierce young frontierswoman must outsmart a dangerous con man before she can stake her claim to the family fortune.   Sixteen-year-old Echo Sackett has never been far from her Tennessee home—until she makes the long trek to Philadelphia to collect her inheritance. In the wilderness Echo can take care of herself as well as any man, but she never imagined the challenge that awaits: a crooked city lawyer who intends to take advantage of her by any means necessary. Echo will need all of her wits to best this scoundrel and make it back home in one piece.",
        "Category": " Fiction , Westerns",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Tempting Evil",
        "Authors": "By Brennan, Allison",
        "Description": "BIG DIE COUNTRYJoanna Sutton can cope with the fierce winter storm bearing down on the small rural community of Centennial Valley, Montana; the popular romance writer has survived much worse in life. Haunted by the loss of her husband and child, Jo has found refuge at her family’s secluded lodge, but her haven soon becomes a hell. During the ferocious blizzard, a local Boy Scout troop is stranded in the wilderness, compelling Jo to spearhead a desperate rescue mission, aided by a newly arrived stranger with an unknown agenda.Meanwhile, Sheriff Tyler McBride hears that three escaped convicts are fast approaching Big Sky Country. Hoping to warn Jo, he faxes over the men’s mug shots. But they never reach their intended recipient. Then Tyler makes a shocking discovery: Two people are dead, and a killer is among the group, along with the woman Tyler loves, searching for his lost son.More than one innocent life is at stake. For the sake of those Jo cares about most, and for her own survival, she’ll need all the cunning, courage, and passion she can muster to survive the mounting terror.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Organized Executive: A Program for Productivity--New Ways to Manage Time, Paper, People, and the Digital Office",
        "Authors": "By Winston, Stephanie",
        "Description": "The author of \"Getting Organized\" now updates \"The Organized Executive\" to reflect changes in technology--email, the Internet, palm pilots, and a host of other gadgets--as she reveals the best ways to analyze organization needs, optimize performance, combat procrastination, and increase productivity.",
        "Category": " Business & Economics , Organizational Behavior",
        "Publisher": "Business Plus",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Chasing Che: A Motorcycle Journey in Search of the Guevara Legend",
        "Authors": "By Symmes, Patrick",
        "Description": "Intrepid journalist Patrick Symmes sets off on his BMW R80 G/S in search of the people and places in Ernesto \"Che\" Guevara's classic Motorcycle Diaries, seeking out his own adventure as well as the legacy of the icon Che would become, Symmes retraces the future revolutionary's path.  And on the way he runs out of gas in an Argentine desert, talks a Peruvian guerrilla out of taking him hostage, wipes out in the Andes, and, in Cuba, drinks himself blind with Che's travel partner, Alberto Granado. Here is the unforgettable story of a wanderer's quest for food, shelter, and wisdom. Here, too, is the portrait of a continent whose dreams of utopia give birth not only to freedom fighters, but also to tyrants whose methods include torture and mass killing. Masterfully detailed, insightful, unforgettable, Chasing Che transfixes us with the glory of the open road, where man and machine traverse the unknown in search of the spirit's keenest desires.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Three of Us",
        "Authors": "By Elbert, Joyce",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1974"
        }
    },
    {
        "Title": "A Company of Swans",
        "Authors": "By Ibbotson, Eva",
        "Description": "Ballerinas and exotic rogues abound in this charming and lyrical historical romance for fans of Amanda Quick     For nineteen-year-old Harriet Morton, life in 1912 Cambridge is as dry and dull as a biscuit. Her stuffy father and her opressive aunt Louisa allow her only one outlet: ballet. When a Russian ballet master comes to class searching for dancers to fill the corps of his ballet company before their South American tour, Harriet’s world changes. Defying her father’s wishes and narrowly escaping the clutches of the man who wishes to marry her, Harriet sneaks off to join the ballet on their journey to the Amazon. There, in the wild, lush jungle, they perform Swan Lake in grand opera houses for the wealthy and culture-deprived rubber barons, and Harriet meets Rom Verney, the handsome and mysterious British exile who owns the most ornate opera house. Utterly enchanted by both the exotic surroundings and by Rom’s affections, Harriet is swept away by her new life, completely unaware that her father and would-be finacé have begun to track her down. . . .",
        "Category": " Young Adult Fiction , Historical , General",
        "Publisher": "Speak",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Fist of God",
        "Authors": "By Forsyth, Frederick",
        "Description": "During those fateful weeks before Saddam Hussein's invasion of Kuwait, a fragment of radio intercept had referred to Qubth-ut-Allah, a devastating secret weapon that could rain death and destruction on the Allied forces.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Corgi Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Supernatural Spine:",
        "Authors": "By R. LeRoy",
        "Description": "",
        "Category": "",
        "Publisher": "Hunter Publishing",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Mystery Writer's Handbook",
        "Authors": "By Treat, L.",
        "Description": "Essays describe how to find fresh ideas, create plots, portray realistic characters, choose a point of view, write believable dialog, and avoid cliches",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "The 20th Century Year by Year: The People and Events That Shaped the Last Hundred Years",
        "Authors": "By Charles Phillips, Neil Grant, Margaret Mulvihill, David Gould, Trevor Morris, Mark Barratt, Reg Grant",
        "Description": "",
        "Category": "",
        "Publisher": "Marshall Editions",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Doctor in Buckskin",
        "Authors": "By T.D. Allen",
        "Description": "",
        "Category": "",
        "Publisher": "Perennial Library by Harper and Row",
        "Price Starting With ($)": "10.36",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "The Killing of Ss Obergruppenfuhrer Reinhard Heydrich",
        "Authors": "By MacDonald, Callum A.",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Collier Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Seamanship: The complete illustrated guide for the cruising yachtsman",
        "Authors": "By Peter Kemp~Sail Magazine~Alan Roy",
        "Description": "",
        "Category": "",
        "Publisher": "Bonanza",
        "Price Starting With ($)": "7.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Moses: God's Man for a Crisis (Bible Study Guide from the Bible)",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Animals As Teachers & Healers: True Stories & Reflections",
        "Authors": "By McElroy, Susan Chernak (EDT) and Fox, Michael W. (INT)",
        "Description": "Explores the relationship between humans and animals with individual stories of animals as guides and healers, and discusses the need for humans to renew their emotional and spiritual connection to animals",
        "Category": " Psychology , General",
        "Publisher": "Newsage Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Girl Who Played Go: A Novel",
        "Authors": "By Sa, Shan, Hunter, Adriana, and Shan, Sa",
        "Description": "As the Japanese military invades 1930s Manchuria, a young girl approaches her own sexual coming of age. Drawn into a complex triangle with two boys, she distracts herself from the onslaught of adulthood by playing the game of go with strangers in a public square--and yet the force of desire, like the occupation, proves inevitable. Unbeknownst to the girl who plays go, her most worthy and frequent opponent is a Japanese soldier in disguise. Captivated by her beauty as much as by her bold, unpredictable approach to the strategy game, the soldier finds his loyalties challenged. Is there room on the path to war for that most revolutionary of acts: falling in love?",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "My First Real Mother Goose",
        "Authors": "By Wright, Blanche Fisher",
        "Description": "A collection of familiar Mother Goose rhymes, including \"Jack Be Nimble,\" \"To Market,\" and \"Ring Around the Rosies.\"",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Anthologies",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Ocean Life",
        "Authors": "By Morgan, Sally and Lalor, Pauline",
        "Description": "From the shallows of the shoreline to the inky black trenches cutting across the floor, oceans house a complex and varied ecosystem. The sea's intricate food webs support more life by weight and a greater diversity of animals than anywhere else on the planet. Through awe-inspiring color photography, move through the waves and dive deep into the ocean's waters. Here, great white whales swim gracefully in spite of their enormous bulk, and massive coral reefs, built by countless millions of tiny creatures, grow. Further below, organisms feed off the chemicals pouring from volcanic chimneys, and at the very bottom, where intense pressure makes exploration virtually impossible, radically different life forms reside in a range of habitats. Special sections cover such subjects as dolphins, hammerheads, coral photography, and camouflage in detail, as well as the devastation wrought to this watery environment by humans--and what's being done to protect it.",
        "Category": " Nature , Oceans & Seas",
        "Publisher": "PRC Publishing",
        "Price Starting With ($)": "9.35",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Complete Book of Business Plans (Small Business Sourcebooks)",
        "Authors": "By Covello, Joseph A. and Hazelgren, Brian J.",
        "Description": "Offers guidelines for writing a business plan, and explains how to raise capital, develop a sales advantage, improve profits, and provide the key elements required by lenders",
        "Category": "",
        "Publisher": "Sourcebooks Inc",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Informers",
        "Authors": "By Ellis, Bret Easton and Kastenmeier, Edward (EDT)",
        "Description": "In this seductive and chillingly nihilistic novel, Bret Easton Ellis, the author ofAmerican Psycho, returns to Los Angeles, the city whose moral badlands he portrayed unforgettably inLess Than Zero. This time is the early eighties. The characters go to the same schools and eat at the same restaurants. Their voices enfold us as seamlessly as those of DJs heard over a car radio. They have sex with the same boys and girls and buy from the same dealers. In short, they are connected in the only way people can be in that city.Dirk sees his best friend killed in a desert car wreck, then rifles through his pockets for a last joint before the ambulance comes. Cheryl, a wannabe newscaster, chides her future stepdaughter, “You're tan but you don't look happy.” Jamie is a clubland carnivore with a taste for human blood. As rendered by Ellis, their interactions compose a chilling, fascinating, and outrageous descent into the abyss beneath L.A.'s gorgeous surfaces.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Magic Journey (Polar Express the Movie)",
        "Authors": "By Van Allsburg, Chris, West, Tracey, Zemeckis, Robert, and Broyles, William",
        "Description": "In a full-color retelling of the movie screenplay, a magical train ride on Christmas Eve takes a boy to the North Pole to receive a special gift from Santa Claus.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Michelangelo Painter, Sculptor and Architect with the Restored Frescoes of the Sistine Chapel and of the Last Judgement",
        "Authors": "By Angelo Tartuferi",
        "Description": "",
        "Category": "",
        "Publisher": "ATS ITALIA, ROME",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Great Expectations (Penguin Classics)",
        "Authors": "By Dickens, Charles",
        "Description": "When a mysterious benefactor enables the orphan boy, Pip, to rise in Victorian society, Pip is educated as a gentleman and snobbishly neglects his childhood friends",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Five knucklebones,",
        "Authors": "By Fairman, Paul W.",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "A Proud Taste for Scarlet and Miniver",
        "Authors": "By Konigsburg, E. L.",
        "Description": "Eleanor of Aquitaine, wife to two kings, mother to two others, has been waiting in Heaven a long time -- eight centuries, more or less -- to be reunited with her second husband, Henry II of England. Finally, the day has come when Henry will be judged for admission. While Eleanor, never a patient woman in life or afterlife, waits, three people, each of whom was close to Eleanor during a time of her life, join her. Their reminiscences do far more than help distract Eleanor -- they also paint a rich portrait of an extraordinary woman who was front and center in a remarkable period in history and whose accomplishments have had an important influence on society through the ages.",
        "Category": " Young Adult Nonfiction , History , Medieval",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Dr. Cookie's Cookbook: Nutritious, Delicious Gourmet Cookies and Other Treats",
        "Authors": "By Wayne, Marvin A.",
        "Description": "Collects healthful recipes for cookies, quick breads, and other treats using low-cholesterol ingredients and with high-fiber or whole grain contents",
        "Category": " Cooking , General",
        "Publisher": "Liberty Pub. Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Chinese Porcelains of the Widener Collection, (National gallery of art handbook)",
        "Authors": "By Christensen, Erwin Ottomar",
        "Description": "",
        "Category": "",
        "Publisher": "National gallery of art, Smithsonian institution",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "New Puzzles in Logical Deduction",
        "Authors": "By Summers, George J.",
        "Description": "",
        "Category": "",
        "Publisher": "Dover Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1968"
        }
    },
    {
        "Title": "The Illustrated Encyclopedia Of North American Locomotives",
        "Authors": "By Hollingsworth, Brian",
        "Description": "Shows and describes the history of hundreds of U.S. and Canadian locomotives, and includes technical specifications for each train",
        "Category": " Science , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "The ABC's of Parent Involvement in Education: Preparing Your Child for Success--Parent Involvement Tips for Lifelong Learning",
        "Authors": "By Parents Coalition International",
        "Description": "",
        "Category": "",
        "Publisher": "National Parent's Day Coalition",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "What Matters Most (Nal Accent Novels)",
        "Authors": "By Bokat, Nicole",
        "Description": "For thirty-six years, Georgie Merkin adored her father, Adam, beloved pediatrician, frustrated poet, and buffer against her cold, fiercely ambitious mother, Dr. Estelle Merkin. When Adam dies of cancer, Georgie - a magazine writer and self-sufficient divorcee with a young son - must envision a world without her father's shelter.With regal Estelle crumbling in her grief long after the funeral, Georgie must find the courage to confront their years of detachment and misunderstanding. Secret histories wash up in sorrow's wake, and the scars of Estelle's past resurface, with a truth that may finally bind them into a family - or tear them apart forever. As her world seems to collapse around her, Georgie may just rediscover an unexpected love and the depth of the roots that define her.",
        "Category": " Fiction , Sagas",
        "Publisher": "NAL Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Art of the Painted Finish for Furniture & Decoration: Antiquing, Lacquering, Gilding & The Great Impersonators",
        "Authors": "By O'Neill, Isabel",
        "Description": "",
        "Category": " Art , Techniques , Painting",
        "Publisher": "William Morrow and Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Utopia: Thomas More",
        "Authors": "By More, Thomas, Sir, Saint, Miller, Clarence H. (INT), and Miller, Clarence H.",
        "Description": "",
        "Category": " Philosophy , Movements , Humanism",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Secrets of My Hollywood Life (Secrets of My Hollywood Life, 1)",
        "Authors": "By Calonita, Jen",
        "Description": "For fans of The Princess Diaries and Famous in Love, an engrossing look behind the velvet ropes of stardom from a former Teen People Senior Editor who has seen it all.What if your picture was taped inside teenage boys' lockers across America, your closets were bursting with never-worn designer clothing, and the tabloids constantly asked whether you were losing your \"good girl\" status?It's a glamorous life, but 16-year-old Kaitlin Burke, co-star of one of the hottest shows on TV, is exhausted from the pressures of her fame. So she decides to spend two months undercover as an ordinary high school student. But could it be that real life high school is just as harsh as cutthroat Hollywood??Don't miss the first book in the Secrets of My Hollywood Life series from Jen Calonita, author of the Fairy Tale Reform School series.",
        "Category": " Young Adult Fiction , Performing Arts , General",
        "Publisher": "Poppy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "On Location (Secrets of My Hollywood Life (2))",
        "Authors": "By Calonita, Jen",
        "Description": "It seems like the summer of dreams come true for Hollywood princess Kaitlin Burke: the media loves her (again), super-cute and funny Austin Meyers is finally her boyfriend, and she's starring in a movie by her all-time favorite director Hutch Adams. What could be sweeter? But life on set is not as perfect as the makeup and costumes. And with an old love and a scheming new publicist on the scene, it's about to get a whole lot messier.",
        "Category": " Young Adult Fiction , Performing Arts , General",
        "Publisher": "Poppy",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Gifted Gabaldón Sisters",
        "Authors": "By Lopez, Lorraine",
        "Description": "Having lost their mother in early childhood, the Gabaldón sisters consider Fermina, their elderly Pueblo housekeeper, their surrogate Grandmother. The mysterious Fermina love the girls as if they are her own, and promises to endow each with a \"special gift\" to be received upon her death. Mindful of the old woman's mystical ways, the sisters believe Fermina's gifts, bestowed based on their natural talents, magically enhance their lives. The oldest sister, Bette Davis Gabaldón, always teased for telling tales, believes her gift is the power to persuade anyone, no matter how outlandish her story. Loretta Young, who often prefers pets to people, assumes her gift is the ability to heal animals. Tough-talking tomboy, Rita Hayworth believes her gift is the ability to curse her enemies. And finally, Sophia Loren, the baby of the family, is sure her ability to make people laugh is her legacy. As the four girls grow into women they discover that Fermina's gifts come with complicated strings, and what once seemed simple can confuse over time. Together they learn the truth about their mysterious caretaker, her legacy, and the family secret that was nearly lost forever in the New Mexican desert.",
        "Category": " Fiction , Women",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Outrageous Grace: Finding a Forever Friendship With God",
        "Authors": "By Nelson, Dwight K.",
        "Description": "",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Pacific Pr Pub Assn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Harrowsmith Tomato Handbook",
        "Authors": "By Bennett, Jennifer",
        "Description": "",
        "Category": "",
        "Publisher": "Camden House+publishing Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "When the Well Runs Dry: Prayer Beyond the Beginnings",
        "Authors": "By Green, Thomas H.",
        "Description": "",
        "Category": " Religion , Prayer",
        "Publisher": "Ave Maria Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Raven Prince",
        "Authors": "By Hoyt, Elizabeth",
        "Description": "Widowed Anna Wren is having a wretched day. After an arrogant man on horseback nearly crushes her, she arrives home to learn that she is in dire financial straits.THERE COMES A TIME IN A LADY'S LIFEThe Earl of Swartingham is in a quandary. Having frightened off two secretaries, Edward de Raaf needs someone who can withstand his bad temper and boorish behavior. WHEN SHE MUST DO THE UNTHINKABLE . . . When Anna becomes the earl's secretary, it would seem that both their problems are solved. But when she discovers he plans to visit the most notorious brothel in London, she sees red-and decides to assuage her desires . . .",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Law of Corporations: In a Nutshell (Nutshell Series)",
        "Authors": "By Hamilton, Robert W.",
        "Description": "",
        "Category": "",
        "Publisher": "West Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Toad Flies High",
        "Authors": "By Walt Disney",
        "Description": "Mole, Ratty, and MacBadger's attempts at picnicking are ruined three times by Toad, but on the fourth try, Toad's recklessness actually does them a favor.",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Girlfriends Club: A Novel",
        "Authors": "By Wall, Judith Henry",
        "Description": "Writing in the bestselling tradition of Barbara Delinsky and Patricia Gaffney, Judith Henry Wall, in her new novel, The Girlfriends Club, has crafted a wry and moving story of four women who have been best friends since childhood. Through the years, and through many spiritual crises -- including the recent divorces that three of them have endured -- they have given one another emotional support. But when they are forced to share a secret that threatens to disrupt their lives, each of them begins to wonder if this bond of friendship that has held for almost four decades will be strong enough to withstand the strain.  On the eve of Mary Sue Prescott's forty-fifth birthday, she is joined by her three closest friends, Gretchen, Pamela, and Dixie, at the lakeside cabin that has been their refuge for years. This meeting of \"The Girlfriends Club\" -- as they jokingly call themselves -- is not, however, strictly a celebration, since the following morning, Mary Sue is scheduled to undergo a mastectomy. At the same time that they are dealing with Mary Sue's operation, another crisis arises, requiring the three women to make a decision that results in a haunting and terrifying secret. How these friends individually deal with their terrible secret, while going on with their lives, is a reflection of how each has coped with the traumas and stresses of the past.  Pamela, the only one of the four still married, lives in a state of perpetual fear that she will upset or embarrass her older husband, a respected judge, who is both rich and controlling, and who disapproves of Pamela's \"divorcée\" friends.  Gretchen is fearful as well, but her anxiety stems from her concern about her future following a particularly acrimonious divorce that has left her both bitter and distrustful of all men.  Dixie, more amicably divorced, has gone on with her life -- at least up to a point. There is a man in her life again, but she keeps him a secret from her friends because she has broken one of their taboos by having an affair with a married man. For Mary Sue, divorce has been especially painful, as she has not stopped caring for her former husband. A devoted wife and mother, she was devastated when he left her for a sexy, much more sophisticated widow. Now, afraid not to have a man in her life, Mary Sue has talked herself into dating again, even if it means settling for an abusive relationship.   How these women deal with their personal secrets and fears, and with the trials and tribulations of growing older and trying to find a place in a world in which everyone seems to be younger and prettier and sexier, is at the heart of The Girlfriends Club. It is a story told with compassion, humor, and absolute truth, one that explores the dynamics of friendship, and the secrets both shared and held in their hearts, as four women learn that it is never too late to live, to trust, and to love again.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Be Confident (Hebrews): Live by Faith, Not by Sight (The BE Series Commentary)",
        "Authors": "By Wiersbe, Warren W.",
        "Description": "How to Really Live by FaithWhen the Book of Hebrews was penned, the ages were colliding and society seemed to be shaking. Hebrews was written to Christians who were wondering what was going on and what they could do about it. As the stability of the old was passing away, their faith was wavering.One major message of Hebrews is BE CONFIDENT! God is shaking things so you might learn to live by faith and not by sight. He wants to build your life on the permanence of the eternal, not on the instability of the temporal.Look to Jesus Christ and BE CONFIDENT!Our ever-living High Priest in heaven is able to see us through our difficult and demanding days too. \"The just shall live by faith!\"",
        "Category": " Religion , Biblical Studies , New Testament",
        "Publisher": "David C Cook",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "CliffsNotes on James' The Portrait of a Lady",
        "Authors": "By Roberts, James Lamar (EDT)",
        "Description": "With rare honesty and acuity, James examines the mythologies of American life by putting Yanks in European society and letting them sink or swim. This tale of an innocent woman abroad adds to the wealth and richness of James's contribution to literature.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1965"
        }
    },
    {
        "Title": "An Illustrated History of the Civil War",
        "Authors": "By Miller, William J. and Pohanka, Brian C.",
        "Description": "A visual history of the American Civil War presents more than one thousand period images, many never before published, that chronicle the battle campaigns and everyday lives of the soldiers on both sides in a collection of period photographs, maps, cartoons, paintings, and sketches that capture the events and personalities of the time. 100,000 first printing.",
        "Category": " History , United States , 20th Century",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "9.22",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "American Locomotives",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "6.82",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "An Angel in My Garden",
        "Authors": "By Ellis, Alda",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "To My Daughter with Love on the Important Things in Life",
        "Authors": "By Schutz, Susan Polis, Schutz, Stephen (ILT), and Schutz, Stephen",
        "Description": "With rare insight and sensitivity, Susan Polis Schutz writes about the special feelings that bind mothers and daughters. Here is a collection of deeply felt and exquistely expressed poems that speak of life, family and relationships. A book of lasting beauty and joy.",
        "Category": " Family & Relationships , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Remembering Pearl Harbor: The Story of the U.S.S. Arizona Memorial",
        "Authors": "By Slackman, Michael",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "Arizona Memorial Museum Assn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Cholesterol Cures: More Than 325 Natural Ways to Lower Cholesterol and Live Longer from Almonds and Chocolate to Garlic and Wine",
        "Authors": "By Prevention Magazine Health Books (COR) and Castelli, William P. (EDT)",
        "Description": "Are you troubled by scary headlines linking high cholesterol levels with heart disease? Wary of cholesterol-lowering drugs that trigger worrisome side effects? Cholesterol Cures offers hundreds of natural ways to keep your cholesterol in check-- without drugs!Since this book was first released, scientists have discovered that some foods once considered off-limits actually help boost \"good\" cholesterol and lower \"bad\" cholesterol.In this revised and updated edition, you'll learn the heart-healthy benefits of:Chocolate * Guacamole * Applie Pie * Olives * Peanut Butter * Orange Juice * Real salad dressings * Fish * Wine ... and moreGet the real scoop on:* Cholesterol-lowering eggs, salad dressings, margarines, and snack bars* New anti-cholesterol supplements and herbs (such as niacin and red yeast rice extract)* The fat and cholesterol content of 500 everyday foodsYou'll discover how:* Chili peppers lower triglycerides, a type of blood fat related to cholesterol* Chicory, a coffee substitute, clobbers cholesterol* Red meat can be part of a low-fat, low choesterol diet* Yoga can help cut high cholesterolIncludes a menu plan and recipes for lowering your cholesterol 30 points in 30 days",
        "Category": " Health & Fitness , Diet & Nutrition , Weight Loss",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Encyclopedia of Herbs, Spices, & Flavorings",
        "Authors": "By Ortiz, Elisabeth Lambert (EDT)",
        "Description": "A comprehensive source of information on some 200 herbs, spices, essences, edible flowers and leaves, aromatics, vinegars, oils, teas, and coffees. Each entry is abundantly illustrated with the exceptionally bright, clear photos and layout this publisher has made its standard; and each is described with tips for storage and cooking, food match-ups, and recipes. Enhancing the work is a separate section in which characteristics of the cuisines of various regions of the world are summarized. A lovely book, first published in Great Britain in 1992; this reprint is identified as an \"American edition.\" Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Cooking , Specific Ingredients , Herbs, Spices, Condiments",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "6.76",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Masquerade (Blue Bloods, Book 2)",
        "Authors": "By De La Cruz, Melissa",
        "Description": "Schuyler Van Alen wants an explanation for the mysterious deaths of young vampires. With her best friend, Oliver, Schuyler travels to Italy in the hope of finding the one man who can help-her grandfather. Meanwhile, back in New York, preparations are feverishly underway for the Four Hundred Ball, an exclusive gala hosted by the city's wealthy, powerful, andunhuman-a true Blue Blood affair.But it's at the after-party, a masquerade ball thrown by the cunning Mimi Force, that the real danger lurks. Hidden behind the masks is a revelation that will forever change the course of a young vampire's destiny.Rich with glamour, attitude, and vampire lore, this second installment in the Blue Bloods saga will leave readers thirsting for more.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Hyperion Books for Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "VEGETABLE COOKING",
        "Authors": "By Annette Wolter",
        "Description": "",
        "Category": "",
        "Publisher": "Colour Library Books Ltd",
        "Price Starting With ($)": "8.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Standing Firm (Ten-week Journey)",
        "Authors": "By Partow, Donna",
        "Description": "The mighty redwood tree stands tall in the midst of all that nature can place against it--fire, wind, and torrential rains. In much the same way, when life hands us more than we can bear, circumstances overwhelm us, or we are tempted to make the safe choice rather than the right choice, God gives us the opportunity to stand firm.  As you discover God's truth for your life, you'll develop the courage to stand firm upon the grace and mercy of God, no matter what other people think. You'll learn how to live your life--even if it's not the life you would have chosen for yourself--without explanation, without apology. When life is difficult, stand firm. When relationships crumble, stand firm. When heartache comes, stand firm. Donna Partow takes you on a journey into the riches of God's grace and the ways in which it can give you the strength to carry on. Poignantly written and amazingly transparent, these pages will challenge your spirit and touch your emotions.",
        "Category": " Religion , Devotional",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    }
]