[
    {
        "Title": "The Best American Short Stories 2002 (The Best American Series)",
        "Authors": "By Miller, Sue and Kenison, Kartina (EDT)",
        "Description": "Since its inception in 1915, the Best American series has become the premier annual showcase for the country's finest short fiction and nonfiction. For each volume, a series editor reads pieces from hundreds of periodicals, then selects between fifty and a hundred outstanding works. That selection is pared down to the twenty or so very best pieces by a guest editor who is widely recognized as a leading writer in his or her field. This unique system has helped make the Best American series the most respected -- and most popular -- of its kind.This year's Best American Short Stories features a rich mix of voices, from both intriguing new writers and established masters of the form like Michael Chabon, Edwidge Danticat, Richard Ford, Jhumpa Lahiri, and Arthur Miller. The 2002 collection includes stories about everything from illicit love affairs to family, the immigrant experience and badly behaved children -- stories varied in subject but unified in their power and humanity. In the words of this year's guest editor, the best-selling author Sue Miller, \"The American short story today [is] healthy and strong . . . These stories arrived in the nick of time . . . to teach me once more what we read fiction for.\"",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Daydreamer, The",
        "Authors": "By McEwan, Ian and Browne, Anthony (ILT)",
        "Description": "Ten-year-old Peter Fortune has a vivid imagination. He understands just how it would feet to be a cat slinking around on soft paws, purring in the sun. He's experienced the terror and the excitement of being chased by evil dolts bent on vengeance. And he's felt the thrill of using a vanishing cream that can actually make people disappear.Peter's imagination takes him to extraordinary places. But when it takes him to the place where reality and daydreams meet, has it finally taken him too far? 1995 Notable Trade Books in the Language Arts (NCTE)Best Books 1994 (SLJ)100 Titles for Reading and Sharing (NY Public Library)",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "HarperColl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "March to the Sea (March Upcountry (Paperback))",
        "Authors": "By Weber, David and Ringo, John",
        "Description": "Marooned on a barbaric world, Prince Roger MacClintock and his Royal Marines take on barbarian hordes, fierce monsters, religious fanatics, and angry mercenaries as they make their way to a distant port that holds their only hope for escape from the planet. Reprint.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Wind Energy",
        "Authors": "By Kovarik, Thomas J.",
        "Description": "An introduction to the various aspects of wind power: its history, wind patterns of all continents, generation of electricity, storage of wind energy, and lists of equipment suppliers",
        "Category": " Technology & Engineering , General",
        "Publisher": "Quality Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1979"
        }
    },
    {
        "Title": "Sometimes Paradise",
        "Authors": "By Green, Judith H.",
        "Description": "After Loretta Worship marries wealthy Chukher Dunbar, she tries desperately to remain true to herself despite the machinations of the Palm Beach snobs who are bent on destroying her by revealing her unspeakable past",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Inspired Sleep: A Novel",
        "Authors": "By Cohen, Robert",
        "Description": "These days, Bonnie Saks is lucky to gets four consecutive hours of shut-eye, what with her bed-wetting young son, her unfinished doctoral thesis, her meager teaching salary, and the fact that she’s pregnant by a lover about as reliable as her ex-husband. Meanwhile, Ian Ogelvie, an ambitious young research scientist, is setting up a study of a promising new sleep aid. Their chance encounter forms the backdrop for this richly exuberant portrait of contemporary America, encompassing everything from the slippery evasions of love to the intricate network that binds together the pharmaceutical industry, managed care, and a shadow population of lost, sleepless souls. At once entertaining and philosophic, Inspired Sleep heralds a major voice in American fiction.",
        "Category": " Fiction , Women",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Entitled to Good Loving: Black Men and Women and the Battle for Love and Power",
        "Authors": "By Chapman, Audrey B.",
        "Description": "As a family and relationship therapist for fifteen years, Audrey Chapman has witnessed firsthand the battle that is raging between African-American men and women. Women are tired of bearing the burden, emotionally and economically, for the \"ills\" of the black community. Men feel dominated and overshadowed by these same women, and devise outrageous games of subterfuge to wrest control and mask their own vulnerability. Both feel bitter toward a society that thwarts the attainment of their goals while criticizing them for not doing better. The result: a vicious cycle of expectation and disappointment that poisons the ground for loving connections.In Entitled to Good Loving, Chapman explains that this struggle between partners in fact reflects an individual's internal conflict - one entailing control, emotional deprivation, the need for nurturance, and a sense of powerlessness - the roots of which can be traced to family structures and societal attitudes. Through numerous case studies featuring intimate revelations from both men and women, Chapman shows how a sense of \"entitlement\" - about how one's love partner should make up for one's past - can lead to unrealistic expectations and even destructive behavior.",
        "Category": " Social Science , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Degree of Guilt (Random House Large Print (Hardcover))",
        "Authors": "By Patterson, Richard North",
        "Description": "Mary Carelli, one of the most powerful women in TV journalism, is charged with the murder of Mark Ransom, America's most eminent novelist. Her attorney, Christopher Paget, sets out to shock the courtroom with revelations about Ransom as a twisted sexual predator. But as the trial unfolds, it is Paget who will be surprised...by Mary's secret motive for murder...by evidence that Mary is lying...by a woman prosecutor who believes Mary invented the story of rape...and by an enigmatic judge with an agenda of her own....From the Paperback edition.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Random House Large Print",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Millie",
        "Authors": "By Linda Jennings",
        "Description": "",
        "Category": "",
        "Publisher": "Sandvik Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "One Writer’s Beginnings (The William E. Massey Sr. Lectures in American Studies)",
        "Authors": "By Welty, Eudora",
        "Description": "Now available as an audio CD, in Eudora Welty's own voice, or as a book.Eudora Welty was born in 1909 in Jackson, Mississippi. In a \"continuous thread of revelation\" she sketches her autobiography and tells us how her family and her surroundings contributed to the shaping not only of her personality but of her writing. Homely and commonplace sights, sounds, and objects resonate with the emotions of recollection: the striking clocks, the Victrola, her orphaned father's coverless little book saved since boyhood, the tall mountains of the West Virginia back country that become a metaphor for her mother's sturdy independence, Eudora's earliest box camera that suspended a moment forever and taught her that every feeling awaits a gesture. She has recreated this vanished world with the same subtlety and insight that mark her fiction.Even if Eudora Welty were not a major writer, her description of growing up in the South--of the interplay between black and white, between town and countryside, between dedicated schoolteachers and the public they taught--would he notable. That she is a splendid writer of fiction gives her own experience a family likeness to others in the generation of young Southerners that produced a literary renaissance. Until publication of this book, she had discouraged biographical investigations. It undoubtedly was not easy for this shy and reticent lady to undertake her own literary biography, to relive her own memories (painful as well as pleasant), to go through letters and photographs of her parents and grandparents. But we are in her debt, for the distillation of experience she offers us is a rare pleasure for her admirers, a treat to everyone who loves good writing and anyone who is interested in the seeds of creativity.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Ophelia Speaks: Adolescent Girls Write About Their Search for Self",
        "Authors": "By Shandler, Sara",
        "Description": "At age sixteen, Sara Shandler read Mary Pipher's Reviving Ophelia, the national bestseller that candidly explored the unique issues that challenge girls in their struggle toward womanhood. Moved by Pipher's insight yet driven to hear the unfiltered voices of today's adolescent girls, Shandler yearned to speak for herself, and to provide a forum for other Ophelias to do so as well. A poignant collection of original pieces selected from more than eighthundred contributions, Ophelia Speaks culls writings from the hearts of girls nationwide, of various races, religions, and socioeconomic backgrounds. Ranging in age from twelve to eighteen, the voices here offer a provocative and piercingly real view on issues public and private, from body image to boys, politics to parents, school to sex. Framing each chapter are Shandler's own personal reflections, offering both the comfort of a trusted friend and an honest perspective from within the whirlwind of adolescence. In these pages, you will see your best friend, your daughter, your sister--and yourself. At once filled with heartbreak and hope, in these pages Ophelia speaks.",
        "Category": " Psychology , Developmental , Adolescent",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Blessed Assurance: At Home with the Bomb in Amarillo, Texas",
        "Authors": "By Mojtabai, A. G.",
        "Description": "Profiles the city and citizens of Amarillo, Texas, a Bible-Belt city that is home to Pantex, the final assembly site for all nuclear weapons produced in the United States",
        "Category": " Political Science , International Relations , Arms Control",
        "Publisher": "University of New Mexico Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Brave New World, Simplified Edition By H. a. Cartledge;",
        "Authors": "By Huxley, Aldous",
        "Description": "",
        "Category": "",
        "Publisher": "Longman",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Daisy's Wild Ride: A First Look at Science",
        "Authors": "By Bob. Graham",
        "Description": "",
        "Category": "",
        "Publisher": "Wishing Wells Books",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Dinosaur Time (I Can Read Level 1)",
        "Authors": "By Parish, Peggy",
        "Description": "Now young children can read about dinosaurs'even how to say their names'by themselves. 'Shouts of welcome will greet this new addition to the Early I Can Read series.' 'H. 'Excellent illustrations . . . a virtual necessity for any library that serves primary-grade children.' 'SLJ.",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "The Pleasure of Their Company: A Reminiscence (Amadeus)",
        "Authors": "By Taubman, Hyman Howard and Taubman, Howard",
        "Description": "Taubman, a music and drama critic at  The New York Times  from the 1930s to the 1970s, recalls his association with many celebrated artists, including Toscanini, Ingrid Bergman, and Leonard Bernstein. Includes b&w photos from  The New York Times  archives and the author's personal collection. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Music , Reference",
        "Publisher": "Amadeus",
        "Price Starting With ($)": "5.57",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "In the Shadow of an Eagle: And Other Adventure Stories (Highlights for Children)",
        "Authors": "By Highlights for Children, Inc.",
        "Description": "Boyds Mills Press publishes a wide range of high-quality fiction and nonfiction picture books, chapter books, novels, and nonfiction",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Anthologies",
        "Publisher": "Highlights Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Old Hasdrubal and the Pirates",
        "Authors": "By Amoss, Berthe",
        "Description": "An old bayou fisherman tells how his great-great-grandfather wrestled an alligator, rescued a captive maid from pirates, and became the hero of the Battle of New Orleans.Old Hannibal relates the way in which his great-great-grandfather helped with the Battle of New Orleans by turning the infamous pirate Lafitte into a patriot",
        "Category": "",
        "Publisher": "Parents Magazine Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Gregg Reference Manual 7ED",
        "Authors": "By Sabin, William A.",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan McGraw-Hill",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Good House Parts: Creating a Great Home Piece by Piece",
        "Authors": "By Wedlick, Dennis",
        "Description": "A good home is the result of good house parts--a certain window, a special door, a punched dormer, a romantic overlook-that are put together based on a homeowner's personal vision. A great home is filled with details that express the personality of the owners. It is comfortable to live in because the elements are perfectly suited to a particular lifestyle. Filled with examples of details that will transform a house, \"Good House Parts\" is the first book to present these parts as the building blocks for great design.",
        "Category": " House & Home , House Plans",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "What to Expect at Preschool (What to Expect Kids)",
        "Authors": "By Murkoff, Heidi Eisenberg and Rader, Laura (ILT)",
        "Description": "Growing Up Just Got Easier...With the help of Angus, the lovable Answer Dog, best-selling author Heidi Murkoff extends a hand to children and parents as they tackle life's first experiences together.It's hard to believe, but your child's starting preschool. Even if it's just for a couple of hours two or three days a week, it seems such a big step for someone in such little sneakers. Not to worry -- we're here to help prepare both of you for that step. We'll answer your child's questions about what preschool is like, what preschoolers do, who teachers are, and how they help to make preschool such a fun and special place -- so that the first day of preschool will be a day you'll both look forward to.Have fun!Heidi and Angus",
        "Category": " Juvenile Nonfiction , School & Education",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Grover Learns to Read",
        "Authors": "By Sesame Street",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Fearless #1",
        "Authors": "By Pascal, Francine",
        "Description": "I am powerful. I am graceful. I am angry. I am pure. I am raw. I am alone.  I am Gaia. I am just like you. But I'm not -- I'm Fearless?.  NO RULES. NO LIMITS. NO FEAR.  I am powerful. I am graceful. I am angry. I am pure. I am raw. I am alone.  I am Gaia. I am just like you. But I'm not -- I'm Fearless?.  NO RULES. NO LIMITS. NO FEAR.",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Slam Dunks and No-Brainers: Language in Your Life, the Media, Business, Politics, and, Like, Whatever",
        "Authors": "By Savan, Leslie",
        "Description": "A marvelously original and informative book about the ever-changing American language that offers surprising insights into why we talk the way we talk.   With dazzling wit and acuity, three-time Pulitzer Prize finalist Leslie Savan dissects contemporary language to discover what our most popular idioms reveal about America today. She traces the paths that words and expressions travel from obscurity to ubiquity.  She describes how “real people” create slang and colorful phrases (I don’t think so; Bring it on!; Dude; Outside the box); how the media, advertising, politics, and business mine the language for these phrases in order to better sell products, ideas, and personalities; and how these expressions, now that they’ve hit the big time, then burst out of our mouths as “celebrity words,” newly glamorous and persuasive.  Words like Duh! and Whatever have become such an indispensable form of communication that they’re replacing our need to articulate any real thought. Whether it’s George Tenet convincing George W. Bush that finding WMD in Iraq would be “a slam dunk” or Microsoft telling you that its latest software is a “no-brainer,” this bright, snappy language affects us all–up close and personal.Smart, dynamic, and great fun, Slam Dunks and No-Brainers is–for everyone who loves the mysteries and idiosyncrasies of language–well, a no-brainer.",
        "Category": " Social Science , Media Studies",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Virtuous Woman",
        "Authors": "By Gibbons, Kaye",
        "Description": "The story of a relationship between a carefully raised daughter of Carolina gentry and a skinny tenant farmer who had never owned anything in his life.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage Contemporaries / Vintage Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "We Brake for Joy!",
        "Authors": "By Clairmont, Patsy",
        "Description": "Those wild and wonderful women are at it again!  Campaigning for a joy-filled outlook instead of a gloomy perspective on life, the Women of Faith crew has made thousands of women laugh, lighten up, and face the challenges of life with a smile. We Brake for Joy! is a brand new devotional straight from the hearts of these extraordinary women. We Brake for Joy! offers ninety upbeat devotions to help you live out your faith with verve and style. Like its predecessor, Joy Breaks, this new devotional offers a spirited view of tackling the challenges of life, taking an honest look at what we face as women every day -- and how we can add joy to our lives in spite of the problems we encounter. Each devotion includes a Scripture passage, a meditation, a closing prayer, and wisdom from traveling companions who know how tough the journey can be -- and how good God is. If the road feels rough and rocky and you think you&apos;re running out of gas, let these seasoned women of faith offer you a life.  We Brake for Joy! will make you laugh, keep you smiling, and encourage your heart so you can get going again!",
        "Category": " Religion , Devotional",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Prince of Darkness",
        "Authors": "By Penman, Sharon Kay",
        "Description": "From the New York Times-bestselling author of Time and Chance, the much anticipated fourth novel in her acclaimed medieval mystery series.  Bowing to an urgent summons from his former lover, Justin de Quincy hastens to Paris only to find that the Lady Claudine was, in fact, acting on behalf of his nemesis Prince John. As the Queen's man, de Quincy has already encountered John's murderous side. But now John tells him of a document implicating him in a plot to kill his brother, King Richard. The document is a forgery, and, despite his hunger for the crown, John is innocent of the charge. Still, a brother who looked with amiable contempt at John's earlier intrigues would hardly risk regicide. John must find the forger and prove the document false before Richard hears of it, and he entreats Justin to help him.  It takes more than John's wily charms to persuade Justin: It is only when he realizes that the welfare of the woman he serves, Eleanor of Aquitaine, is also at risk that Justin concedes. It is a concession that will take him to a bloody chamber on Mont-Saint-Michel, to a stinking dungeon in Brittany, to a murderous encounter in a Paris cemetery, and, ultimately, to the unraveling of a conspiracy that might have changed the course of history.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "A Marian Wood Book/Putnam",
        "Price Starting With ($)": "7.52",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Present (Malory Novels (Paperback))",
        "Authors": "By Lindsey, Johanna",
        "Description": "As the entire Malory family gathers at Haverston to celebrate the season, a mysterious present arrives anonymously. The gift is an old journal -- a tender and tempestuous account of the love affair between the second Marquis, Christopher Malory, and a dark gypsy beauty named Anastasia, who seeks a love match with a non-gypsy in order to save herself from a prearranged marriage to a brute. Though the dashing English lord Anastasia sets her sight upon burns for the exquisite, exotic miss, Christopher could never consent to wed such a lowborn lady. But miracles have been known to happen in this season of peace and giving and love, as two extraordinary people seperated by cicumstance of birth begin a passionate dance of will and wiles. And in the miraculous blossoming of a glorious romance at a long ago Christmastime, there are wise and well-learned lessons that will enrich the hearts of the Malory descendants -- and, indeed, of everyone who has ever dreamed.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Love in the 90s: B.B. & Jo - The Story of a Lifelong Love : A Granddaughter's Portrait",
        "Authors": "By Blakey, Bernard Buckner, Pickett, Keri, and Blakey, Josie Walker",
        "Description": "In 1928 Josie Lou Lydia Walker was thirty-two years old. Everyone assumed she would be a spinster. She had grown up poor in Oklahoma, worked her way through college, and been ordained as a minister, traveling from Oklahoma to Kentucky to Missouri setting up religious education programs.World War I veteran B. B. Blakey, co-owner of a Tulsa, Oklahoma, hardware store, was thirty-three and had broken off an engagement with a local beauty. Having second thoughts, he went to Enid, Oklahoma, to see her at the home of friends - and one Josie Walker opened the door.B.B. and Josie would write over seven hundred letters to each other over the next year and a half as they fell deeply in love. As Josie traveled through a more innocent America, B.B.'s letters marked \"Personal\" and \"Special Delivery\" found her in small towns and train stops. Now this wonderful exchange of writing, so filled with the joy of discovering each other, is collected here by B.B. and Jo's granddaughter, award-winning photographer Keri Pickett. Along with their commentary on love, marriage, and family, she shows us a relationship most people only dream about - and to which all of us aspire.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Friendly Advice",
        "Authors": "By Winokur, Jon",
        "Description": "The author of The Portable Curmudgeon  compiles quotations and forgettable friendly advice from misanthropes, saints, convicted criminals, cynics, and shady ladies. Original. 40,000 first printing.",
        "Category": " Humor , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Eye of the Storm",
        "Authors": "By Higgins, Jack",
        "Description": "Elusive master terrorist Sean Dillon reemerges during the Gulf War when Saddam Hussein hires him to assassinate Margaret Thatcher, and only Martin Brosnan can stop him. 225,000 first printing. $150,000 ad/promo. BOMC Feat Alt. Reader's Digest Cond Bks.",
        "Category": " Fiction , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "The President's Daughter",
        "Authors": "By Higgins, Jack",
        "Description": "Twenty years ago, a brave young man in Vietnam saved the life of a widowed Frenchwoman, and a brief, passionate affair ensued. Now that young hero is President of the United States, a true golden boy - until the day his world turns upside down. On a visit to Paris, he sees his former love again for the first time, and she directs his attention to a beautiful young woman across the room. Her daughter, she says. And his. Their secret. But the surprises are only beginning.Someone, somewhere, has also discovered the truth, and acting with terrible speed, a group of men seizes the girl. If the President does not comply with their demands, they will execute her. If he uses any of America's security agencies to track them down, they will execute her. He has ten days to decide.The President turns to the only men he feels can help - Sean Dillon, the IRA enforcer turned security specialist whose work had impressed the President in London; and Blake Johnson, the decorated Marine and FBI agent who heads the elite White House group known only as \"The Basement.\" If these two cannot find his daughter, the President must face the most momentous decision of all. And meanwhile, the hours tick by....",
        "Category": " Fiction , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "From Bondage: Volume III of Mercy of a Rude Stream",
        "Authors": "By Roth, Henry",
        "Description": "Henry Roth went to sleep for the last time on the evening of October 13, 1995, but not before completing this transcendent novel, which continues \"one of the most poignant projects in American literature.\" As Tolstoy presaged his own passing in The Death of Ivan Ilyich, Roth examines his own imminent death in the most lyrical of ways, telling the story of the elderly writer, Ira Stigman, who in spite of his physical frailties, finds solace and redemption through the re-creation of the fascinating love triangle of his youth. Capturing the dizzying vitality of the 1920s and the literary world of Manhattan, Roth has set the stage for one of the most memorable literary romances of this century.",
        "Category": " Fiction , Literary",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "When Feeling Bad Is Good",
        "Authors": "By McGrath, Ellen",
        "Description": "Do you often find yourself feeling bad that no matter how much you do or how well you do it, it's never enough? Are you chronically dissatisfied with your body, your relationships, or your inability to take charge of your life?You are not alone. Millions of women struggle with similar feelings every day. For them - and for you - When Feeling Bad Is Good will be a revelation. In this ground-breaking book, Dr. Ellen McGrath shatters the cultural myth that feeling bad must be negative and introduces a new model of women's depression. She persuasively explains that many bad feelings women have are the result of \"healthy depressions\" - realistic and appropriate responses to the unhealthy culture in which they live.She examines in depth the six basic types of healthy depression that most women experience at some point in their lives. Then, through a dynamic, innovative program that features self-evaluation quizzes and practical, proven action strategies, Dr. McGrath offers a liberating road map to women who want to understand why they feel the way they do and how to break the cycles that keep them from having and being all they want.In taking this empowering personal journey, you will learn how to convert your bad feelings and take better control of your life. You will become more effective in resolving conflicts, clarifying your priorities, making healthier life choices, and living more honestly, openly, creatively, and powerfully than ever before.",
        "Category": " Medical , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Knights of the Kitchen Table (The Time Warp Trio)",
        "Authors": "By Scieszka, Jon and Smith, Lane (ILT)",
        "Description": "Adventure, comedy, and magic blend together as the members of the Time Warp Trio--Joe, Sam, and Fred--look through a mysterious book and find themselves in King Arthur's time being pursued by the evil Black Knight. Reprint.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "The Second Silence",
        "Authors": "By Goudge, Eileen",
        "Description": "When her only child is stolen from her by her estranged husband, a powerful real-estate developer, Noelle Van Doren and her long-estranged parents struggle to unravel the secrets of Robert's past, revealing their own inner fears and transforming each of their lives in the process. 60,000 first printing.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Jump and Other Stories",
        "Authors": "By Gordimer, Nadine",
        "Description": "A collection of fiction from a distinguished South African author spans the globe, showing glimpses of human nature with stories about racism, family life, terrorism, love, and fear",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Dearly, Nearly, Insincerely What is an Adverb?",
        "Authors": "By Cleary, Brian P. and illustrated by Gable, Brian",
        "Description": "",
        "Category": "",
        "Publisher": "Carolrhoda Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Home from Nowhere: Remaking Our Everyday World for the 21st Century",
        "Authors": "By Kunstler, James Howard",
        "Description": "In his landmark book The Geography of Nowhere James Howard Kunstler visited the \"tragic sprawlscape of cartoon architecture, junked cities, and ravaged countryside\" America had become and declared that the deteriorating environment was not merely a symptom of a troubled culture, but one of the primary causes of our discontent.  In Home from Nowhere Kunstler not only shows that the original American Dream -- the desire for peaceful, pleasant places in which to work and live -- still has a strong hold on our imaginations, but also offers innovative, eminently practical ways to make that dream a reality. Citing examples from around the country, he calls for the restoration of traditional architecture, the introduction of enduring design principles in urban planning, and the development of public spaces that acknowledge our need to interact comfortable with one another.",
        "Category": " Social Science , Sociology , Urban",
        "Publisher": "Touchstone Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "It Wasn't Always Easy, but I Sure Had Fun",
        "Authors": "By Grizzard, Lewis",
        "Description": "Presents a hilarious compendium of the best essays, articles, and observations from the late humorist and author of I Took a Lickin' and Kept on Tickin'. 100,000 first printing. $100,000 ad/promo.",
        "Category": " Humor , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Anne's House of Dreams (Anne of Green Gables, No. 5)",
        "Authors": "By Montgomery, L. M.",
        "Description": "Anne's own true love, Gilbert Blythe, is finally a doctor, and in the sunshine of the old orchard, among their dearest friends, they are about to speak their vows. Soon the happy couple will be bound for a new life together and their own dream house, on the misty purple shores of Four Winds Harbor.A new life means fresh problems to solve, fresh surprises. Anne and Gilbert will make new friends and meet their neighbors: Captain Jim, the lighthouse attendant, with his sad stories of the sea; Miss Cornelia Bryant, the lady who speaks from the heart -- and speaks her mind; and the tragically beautiful Leslie Moore, into whose dark life Anne shines a brilliant light.The original, unabridged textA specially commissioned biography of L. M. MontgomeryA map of Prince Edward Island",
        "Category": "",
        "Publisher": "Starfire",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Anne of the Island (Anne of Green Gables, Book 3)",
        "Authors": "By Montgomery, L. M.",
        "Description": "New adventures lie ahead as Anne Shirley packs  her bags, waves good-bye to childhood, and heads for  Redmond College. With old friend Prissy Grant  waiting in the bustling city of Kingsport and  frivolous new pal Philippa Gordon at her side, Anne tucks  her memories of rural Avonlea away and discovers  life on her own terms, filled with  surprises...including a marriage proposal from the worst fellow  imaginable, the sale of her very first story, and a  tragedy that teaches her a painful lesson. But  tears turn to laughter when Anne and her friends move  into an old cottage and an ornery black cat steals  her heart. Little does Anne know that handsome  Gilbert Blythe wants to win her heart, too. Suddenly  Anne must decide if she's ready for love...",
        "Category": "",
        "Publisher": "Starfire",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Are We Living in the End Times?",
        "Authors": "By LaHaye, Tim F. and Jenkins, Jerry B.",
        "Description": "It's a fact: 27 percent of the Bible is devoted to prophecy. But most of us don't focus 27 percent of our personal Bible study on prophecy. Why? We're confused. Or intimidated. Or both. This book takes away a lot of the mystery—andall of the intimidation. From the creators of the Left Behind series—Tim LaHaye and Jerry Jenkins—comes a truly astonishing book. User-friendly for the layperson. Remarkably complete for the scholar.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Blackbeard the Pirate: A Reappraisal of His Life and Times",
        "Authors": "By Lee, Robert Earl",
        "Description": "Edward Teach, better known as Blackbeard, was one of the most notorious pirates ever to plague the Atlantic coast. He was also one of the most colorful pirates of all time, becoming the model for countless blood-and-thunder tales of sea rovers. His daring exploits, personal courage, terrifying appearance, and fourteen wives made him a legend in his own lifetime. The legends and myths about Blackbeard have become wilder rather than tamer in the 250 years since his gory but valiant death at Ocracoke Inlet. It is difficult for historians, and all but impossible for the general reader, to separate fact from fiction. Author Robert E. Lee has studied virtually every scrap of information available about the pirate and his contemporaries in an attempt to find the real Blackbeard. The result is a fascinating and authoritative study that reads like an exciting swashbuckler. Lee goes beyond the myths and the image Teach so carefully cultivated to reveal a new Blackbeard—infinitely more interesting as a man than as a legend. In the process, he has captured the spirit and character of a vanished age, \"the golden age of piracy.\"Robert E. Lee was a former law professor who traced his own ancestry to a possible link with Blackbeard. A native of Kinston, North Carolina, he earned degrees from Wake Forest, Columbia, and Duke universities. The author of sixteen law books, Lee wrote the newspaper column \"This is the Law\".",
        "Category": " Political Science , General",
        "Publisher": "Blair",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Best Recipes from the Backs of Boxes, Bottles, Cans, and Jars",
        "Authors": "By Dyer, Ceil",
        "Description": "Hundreds of recipes that have appeared on the backs of packages for decades, withstanding the test of time, include perennial favorites that are simple, easy to prepare, economical, and delicious",
        "Category": " Cooking , Reference",
        "Publisher": "Galahad Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Help for the Hyperactive Child: A Good-Sense Guide for Parents of Children With Hyperactivity, Attention Deficits and Other Behavior and Learning Pr",
        "Authors": "By Crook, William G.",
        "Description": "Offers suggestions for parents in dealing with hyperactivity, learning disabilities, and other behavior problems",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Professional Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Little Museums: Over 1,000 Small (And Not-So-Small) American Showplaces",
        "Authors": "By Arany, Lynne and Hobson, Archie",
        "Description": "The definitive guide to the most interesting, amusing, and surprising collections in America. With listings that leave no source unexplored, this clever directory is the first in-depth popular guide to more than 1,000 small museums. Its listing of archives ranging from the utterly informal to the most diligently organized, labeled, and catalogued, from displays of celebrity shoes to the work of visionary artists, provides a picture of the American landscape that is rich in quirky details. In Little Museums, you will find the listings that tourist literature does not provide, including the Barbie Hall of Fame in Palo Alto, California, the Dog Mushing Museum in Fairbanks, Alaska; the Museum of Ordinary People in Hurtsboro, Alabama; the 24Hour Church of Elvis in Portland, Arizona; and the last freak show left in America--at Coney Island's Sideshows by the Seashore. A virtual museums listing means you don't even have to leave home to visit a little museum, and a category index makes finding museums devoted to your favorite subjects even easier. Little Museums is for anyone who hates to miss a unique opportunity along the byways and urban centers of America.",
        "Category": " Travel , Museums, Tours, Points of Interest",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Make Up Your Life: Every Woman's Guide to the Power of Makeup",
        "Authors": "By Kirkland, Douglas (PHT), Cagan, Andrea, and Jackson, Victoria",
        "Description": "With her timeless advice, Victoria Jackson demonstrates the real power of makeup: when you look better, you feel better. Make Up Your Life is not simply a how-to book. Instead it reveals what Victoria took a lifetime to learn: why makeup makes a difference in our lives, why we feel better when we wear it, and why being comfortable with the way we look ultimately frees us to celebrate who we are.For more than a decade as makeup artist to some of the world's most gorgeous women, including Jacqueline Bisset, Brooke Shields, Rene Russo, Kate Capshaw, and Kathleen Turner, Victoria Jackson has seen how using makeup has the power to help you build confidence. When you accept that your natural features are already appealing, you can feel comfortable with or without cosmetics and learn to look like yourself, only better. In this inspirational and practical book, Victoria presents dramatic before and after examples, offers tips on how to use makeup to build on what you like about your face and play down what you don't, and explains how to achieve the look you want in only two, five, or ten minutes.Why waste time worrying whether you look good enough? If you take a moment to broaden your knowledge about makeup and learn to apply it in a simple, efficient, and effective way, you can put it behind you and get on with the rest of your life. And Victoria will teach you how.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Faithful Travelers",
        "Authors": "By Dodson, James",
        "Description": "In Final Rounds, James Dodson told the poignant story of the golf trip of a lifetime with his terminally ill father. Now, armed with a fly-fishing rod and reel, he embarks with his seven-year-old daughter on an equally memorable journey across America in search of clear-running streams, swift elusive fish, and the eternal truths that only nature can provide.It has been said that life is what happens while you're waiting to go fishing. Only weeks after his eleven-year marriage abruptly ended in an amicable divorce, James Dodson decided to go on a fly-fishing pilgrimage west. His goal: to heal his wounded spirit and explain as best he could the vagaries of life and love to his beautiful, precocious seven-year-old daughter, Maggie.With his beat-up truck, Old Blue, and his aging retriever, Amos, Dodson and Maggie travel without plans or reservations, following where the spirit--and the lure of America's mighty rivers--leads them, on their way to one of America's grandest treasures: Yellowstone National Park. On the way, Dodson discovers a great deal about fishing, about America, and about the special relationship that exists only between a father and daughter. They travel from the Adirondacks, once a fly-angler's haven, to the mist-shrouded Niagara Falls. From the Michigan lakes where Ernest Hemingway roamed as a boy to small-town county fairs. From the majesty of Mount Rushmore to the mysticism of Harney's Peak, where Black Elk had his legendary visions, to finally the fly-fisherman's paradise of the San Juan River. Together father and daughter are bound by a tie as resilient and unpredictable as a fly-fisherman's line. For as the emotional waters in which they fish become ever more turbulent, Maggie's unspoken feelings of grief, anger, and blame begin to surface--a depth of hurt that forces Dodson to face his own unacknowledged pain and, worse, leaves him feeling helpless to make everything all right in his daughter's life again. Yet if fly-fishing has taught James Dodson anything, it is the rewards of patience, of following the wisdom of the course of the stream, the unexpected revelations reflected in still pools, and, of course, an abiding belief in plain dumb luck. With a little of each, these faithful travelers will find their way home again.Literate, honest, and deeply observant, Faithful Travelers is a beautiful meditation on the bond between parent and child and the nature of love and loss. In Faithful Travelers, James Dodson proves that sometimes life isn't what happens while you're waiting to go fishing: sometimes it happens while you're there.",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Universe and Eye",
        "Authors": "By Ferris, Timothy and Pinn, Ingram (ILT)",
        "Description": "Sixty brief articles provide basic explanations of complex concepts of modern science",
        "Category": " Science , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Western Unity and the Common Market",
        "Authors": "By Lippmann Walter",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "9.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Wonders of the Desert",
        "Authors": "By Sabin, Louis",
        "Description": "Describes the animals and plants to be found in the deserts of the world.",
        "Category": " Juvenile Fiction , Nature & the Natural World , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "The Bush Dyslexicon: Observations on a National Disorder",
        "Authors": "By Miller, Mark Crispin",
        "Description": "\"They misunderestimated me.\"President George W. Bush It seems like too easy a target, too cheap a laugh, but Mark Crispin Miller, with the deftly trenchant wit that always distinguishes his writing, uses the blunders and malapropisms of George W. Bush to make a larger point about the way in which we elect our presidents. Miller places Bush in the context of other notorious dunces-in-chief, and shows him indisputably in a league of his own. The book is a raucously funny ridewhether it's Bush envisioning \"a foreign-handed foreign policy\" or Miller skewering vociferous cultural conservatives like William Bennett and Lynne Cheney for their silence on Bush's particular \"West Texas version of Ebonics\"but there is also a strong undercurrent of outrage. Only because our elections have become so dependent on television and its emphatic emptiness, Miller argues, can a man of such sublime and complacent ignorance assume the highest office in the land. To quote Bush himself, \"It's not the way America is all about.\"",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Susie Bright's Sexual Reality: A Virtual Sex World Reader",
        "Authors": "By Bright, Susie",
        "Description": "Discusses politics, erotics, and the human sexual condition, with the premise that human fantasies and fears, especially the sexual ones, are more real than the real forces we have reckoned with historically",
        "Category": " Social Science , General",
        "Publisher": "Cleis Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "The naked computer: A layperson's almanac of computer lore, wizardry, personalities, memorabilia, world records, mind blowers, and tomfoolery",
        "Authors": "By Rochester, Jack B. and Gantz, John",
        "Description": "",
        "Category": "",
        "Publisher": "W. Morrow",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "In the Deep Midwinter",
        "Authors": "By Clark, Robert",
        "Description": "In November of 1949, Richard MacEwan, a well-established lawyer in St. Paul, Minnesota, loses his brother James in what seems to have been a hunting accident. As he seeks to understand the events of the day his brother died, Richard finds the calm surface of his life disturbed when secrets kept by the women in his family begin to emerge.Among his bachelor brother's papers, Richard discovers a letter from his wife, Sarah, that hints at an infidelity. Shaken and confused, he finds himself tempted by an attractive woman who had known his brother. And when Richard's daughter, Anna, vulnerable after her recent divorce, becomes involved with a married man, Charles Norden, her affair changes her life and shakes the very foundation of the MacEwan family.The lives of these four characters - and the troubling legacy of James - are rendered in luminous detail and quietly breathtaking prose. A first novel that is \"old-fashioned\" in the most satisfying ways, In the Deep Midwinter presents a family and a world in crisis, a transformation as mysterious as winter becoming spring.",
        "Category": " Fiction , General",
        "Publisher": "Picador USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Tiger Is a Scaredy Cat",
        "Authors": "By Gorbaty, Norman (ILT) and Phillips, Joan",
        "Description": "Illus. in full color. Scared of dogs, vacuum cleaners, and even mice, a faint-hearted feline has a chance to prove himself a hero when a baby mouse gets lost from its parents.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "Endangered Animals (Hello Reader!, Level 3)",
        "Authors": "By McNulty, Faith and Schwartz, Carol (ILT)",
        "Description": "An easy-to-read beginner's story combines beautiful watercolor illustrations with consciousness-raising information, in an introduction to such endangered animals as pandas, gorillas, and blue whales. Original.",
        "Category": " Juvenile Fiction , Animals , General",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "A Year Down Yonder",
        "Authors": "By Peck, Richard",
        "Description": "A Newbery Medal WinnerRichard Peck's Newbery Medal-winning sequel to A Long Way from ChicagoMary Alice's childhood summers in Grandma Dowdel's sleepy Illinois town were packed with enough drama to fill the double bill of any picture show.  But now she is fifteen, and faces a whole long year with Grandma, a woman well known for shaking up her neighbors-and everyone else!  All Mary Alice can know for certain is this: when trying to predict how life with Grandma might turn out . . . better not.  This wry, delightful sequel to the Newbery Honor Book A Long Way from Chicago has already taken its place among the classics of children's literature.\"Hilarious and poignant.\" —Publishers Weekly, starred reviewA Newbery Medal WinnerA New York Times BestsellerAn ALA Notable BookAn ALA Best Book for Young AdultsA Booklist Best Book of the YearA School Library Journal Best Book of the Year",
        "Category": " Juvenile Fiction , Family , Multigenerational",
        "Publisher": "Dial Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Aztec Autumn",
        "Authors": "By Jennings, Gary",
        "Description": "Aztec Autumn takes us to a time one generation after the Conquest, when the magnificent Aztec empire has fallen beneath the brutal heel of the invading Spaniards. But one proud young Aztec, Tenamaxtli, refuses to bow to the foreign conquerors - and secretly begins to recruit, from among the struggling survivors of the Conquest, an army of insurrection.On his courageous quest he finds high adventure, passionate women, unlikely allies, bright hope, and bitter tragedy. Driven by his dream of restoring the lost glory of the Aztec empire, he will come to threaten the seemingly invincible power of mighty Spain.Until now, Tenamaxtil's rebellion has been little remembered, perhaps because it shed no glory on the men who would write the history books, but on its outcome depended the future of all North America. Aztec Autumn re-creates this forgotten chapter of history in all its splendor.",
        "Category": " Fiction , Historical",
        "Publisher": "Forge / Tom Doherty Associates",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Reptile Room (A Series of Unfortunate Events #2)",
        "Authors": "By Snicket, Lemony, Helquist, Brett (ILT), and Handler, Daniel",
        "Description": "NOW A NETFLIX ORIGINAL SERIESViolet, Klaus, and Sunny Baudelaire are intelligent children. They are charming, and resourceful, and have pleasant facial features. Unfortunately, they are exceptionally unlucky.In the first two books alone, the three youngsters encounter a greedy and repulsive villain, itchy clothing, a disastrous fire, a plot to steal their fortune, a lumpy bed, a deadly serpent, a large brass reading lamp, a long knife, and a terrible odour. In the tradition of great storytellers, from Dickens to Dahl, comes an exquisitely dark comedy that is both literary and irreverent, hilarious and deftly crafted. Never before has a tale of three likeable and unfortunate children been quite so enchanting, or quite so uproariously unhappy.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "In the Name of Salome",
        "Authors": "By Alvarez, Julia",
        "Description": "This novel tells the story of two women - mother and daughter, one a poet, the other a teacher - and how they confronted the machismo in two Caribbean revolutions. Set in the politically chaotic Dominican Republic of the late nineteenth century, on the campuses of three American universities, and in the idealistic Communist Cuba of the 1960s, this story is based on the real lives of a volatile, opinionated, romantic, intrigue-loving family.Salome Urena's fervent patriotic poems turned her - at seventeen - into the Dominican Republic's national icon. In stark contrast, her daughter, Camila, shy and self-effacing, bent to accommodate the demands of her father and brothers (a president, an ambassador, an international literary star) - trying to hide her preference for women, to stay out of the spotlight, and to offend no one. Whereas her mother dedicated her brief life to educating Dominican girls to serve their turbulent new nation, Camila spent her career anonymously explaining the Spanish pluperfect to upper-class American girls.We meet Camila in 1960 when she is sixty-five years old and about to retire from Vassar College in Poughkeepsie, New York. This is Camila's last chance to choose a final destiny for herself. In the process of deciding, Camila uncovers first the reality of her mother's tragic personal life and, finally, where she must place her own kind of passion and commitment.Latina poet and university professor Alvarez brings many common bonds to this novel based on \"la musa de la patria,\" Salome Urena, and her daughter, Profesora Camila Henriquez-Urena. Not the least of these is an undaunted female stance from inside a powerful Caribbean family.",
        "Category": " Fiction , Literary",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Girl, A Goat, And A Goose (level 1) (Hello Reader)",
        "Authors": "By McPhail, David and McPhail, David (ILT)",
        "Description": "Three friends share a series of experiences--enduring a thunderstorm, looking for a lost feather, going for a ride in a cart, and sailing a toy boat.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Antioxidants: The Amazing Nutrients That Fight Dangerous Free Radicals, Guard Against Cancer and Other Diseases-And Even Slow the Aging Process (Good Health Guides)",
        "Authors": "By Passwater, Richard A.",
        "Description": "",
        "Category": "",
        "Publisher": "Keats Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Listening to America: An illustrated history of words and phrases from our lively and splendid past",
        "Authors": "By Flexner, Stuart Berg",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Obsessive Genius: The Inner World of Marie Curie (Great Discoveries)",
        "Authors": "By Goldsmith, Barbara",
        "Description": "The myth of Marie Curie - the penniless Polish immigrant who through genius and obsessive persistence endured years of toil and deprivation to produce radium, a luminous panacea for all the world's ills, including cancer - has obscured the remarkable truth behind her discoveries. Marie Curie's shrewd though controversial insight was that radioactivity was an atomic property that could be used to discover new elements. While her work won her two Noble Prizes and transformed our world, it did not liberate her from the prejudices of either the male-dominated scientific community or society.In Obsessive Genius, the author and historian Barbara Goldsmith has discovered the woman behind the icon we have come to believe in - an all-too-human woman trying to balance a scientific career with the obligations of family, the prejudice of society, the constant search for adequate funding, and the battle for recognition.Using original research (diaries, letters, and family interviews) to peel away the layers of myth, Goldsmith offers a portrait of Marie Curie, her amazing discoveries, and the immense price she paid for fame.",
        "Category": " Science , Chemistry , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "300 Incredible Things for Kids on the Internet",
        "Authors": "By Leebow, Ken",
        "Description": "",
        "Category": " Juvenile Nonfiction , Computers , Internet",
        "Publisher": "300 Incredible",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Morning Noon & Night",
        "Authors": "By Sheldon, Sidney",
        "Description": "When Harry Stanford, one of the wealthiest men in the world, mysteriously drowns while cruising on his yacht off the rugged coast of Corsica, it sets off a chain of events that reverberates around the globe. At the family gathering following the funeral in Boston, a strikingly beautiful young woman appears. She claims to be the daughter of Harry Stanford and entitled to a share of the tycoon's estateis she genuine or an impostor? The Stanford family is one of the most respected in America, but behind the facade of fame and glamour is a hidden web of blackmail, drugs, and murder.Sidney Sheldons Morning, Noon, and Night sweeps from the splendors of the Italian Riviera to the fashion salons of Paris and New York, to the elite of Bostons Back Bay and the social register of Floridas Hobe Sound. His intriguing story twists and turns its way through smoke and mirrors until the ultimate Sidney Sheldon surprise ending.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Pearl (Dakotah Treasures #2)",
        "Authors": "By Snelling, Lauraine",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Face of London",
        "Authors": "By Clunn, H.P.",
        "Description": "",
        "Category": "",
        "Publisher": "Littlehampton Book Services Ltd",
        "Price Starting With ($)": "7.13",
        "Publish Date": {
            "Month": "October",
            "Year": "1969"
        }
    },
    {
        "Title": "Bee Season: A Novel",
        "Authors": "By Goldberg, Myla",
        "Description": "Eliza Naumann, a seemingly unremarkable nine-year-old, expects never to fit into her gifted family: her autodidact father, Saul, absorbed in his study of Jewish mysticism; her brother, Aaron, the vessel of his father's spiritual ambitions; and her brilliant but distant lawyer-mom, Miriam. But when Eliza sweeps her school and district spelling bees in quick succession, Saul takes it as a sign that she is destined for greatness.  In this altered reality, Saul inducts her into his hallowed study and lavishes upon her the attention previously reserved for Aaron, who in his displacement embarks upon a lone quest for spiritual fulfillment.  When Miriam's secret life triggers a familial explosion, it is Eliza who must order the chaos.Myla Goldberg's keen eye for detail brings Eliza's journey to three-dimensional life. As she rises from classroom obscurity to the blinding lights and outsized expectations of the National Bee, Eliza's small pains and large joys are finely wrought and deeply felt.Not merely a coming-of-age story, Goldberg's first novel delicately examines the unraveling fabric of one family.  The outcome of this tale is as startling and unconventional as her prose, which wields its metaphors sharply and rings with maturity.  The work of a lyrical and gifted storyteller, Bee Season marks the arrival of an extraordinarily talented new writer.",
        "Category": " Fiction , Religious",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Net of Jewels: A Novel",
        "Authors": "By Gilchrist, Ellen",
        "Description": "Rhoda finally has everything she has ever wanted, but when she begins to question the simplicity of her upper-class, mid-1950s existence, it throws her into a frenetic and rebellious course toward destruction. 25,000 first printing. $25,000 ad/promo.",
        "Category": " Fiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Doctor Sleep",
        "Authors": "By Bell, Madison Smartt",
        "Description": "Adrian Strother, an insomniac hypnotist, becomes involved with an unsavory drug trafficker and his henchman, while trying to save his faltering love life",
        "Category": " Fiction , Thrillers",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "101 Dalmatians (Walt Disney's Classics) (Little Golden Books)",
        "Authors": "By Walt Disney Productions (COR), Korman, Justine, Langley, Bill (ILT), and Dias, Ron (ILT)",
        "Description": "Pongo the dalmatian and his wife Perdita undertake a daring expedition to rescue their fifteen kidnapped puppies",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Western Publishing Company, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Star Trek Puzzle Manual Puzzles, Mazes and Trivia to",
        "Authors": "By Razzi, J.",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "The Jewish Book Of Lists",
        "Authors": "By Samberg, Joel",
        "Description": "A unique reference source about Jewish life ranges from the humorous to the reverent as it offers such lists as one hundred real names of Jewish stars, Jewish places of interest, Jewish-American writers, and much more. Original. 20,000 first printing.",
        "Category": " Religion , Judaism , General",
        "Publisher": "Citadel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Managing Knock Your Socks Off Service (Knock Your Socks Off Series)",
        "Authors": "By Zemke, Ron and Bell, Chip R.",
        "Description": "A crash course in caring for customers teaches managers how to find and retain quality people, know their customers, focus their unit on a specific organizational purpose, train and support employees, and more. Original.",
        "Category": " Business & Economics , Customer Relations",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "The Timetables of History: A Horizontal Linkage of People and Events, Based on Werner Stein's Kulturfahrplan",
        "Authors": "By Grun, Bernard",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "Healers on Healing (New Consciousness Reader)",
        "Authors": "By Carlson, Richard (EDT) and Shield, Benjamin (EDT)",
        "Description": "In thirty-seven original essays written for this book, some of the world's leaders in healing explore their personal and professional experiences in order to uncover the underlying principles on which all healing rests.  Rather than focusing on diverse techniques, the writers seek the \"golden thread\" that ties together the wide range of approaches to healing.In simple, direct language, the contributors explore the complex nature of healing from many viewpoints.  We hear from physicians, psychologists, nurses, metaphysical healers, and shamans.Their topics include:what healing really is and how it takes placethe power of the healer withinwhat to look for in a healerthe function of spirituality in healingthe dramatic effects of the healing relationshipthe role of attitudes and emotionslove as a healing forcehealing and deathThe result is a grand synthesis of heartfelt thinking that offers a treasury of profound insights for people in the healing professions, people who seek to develop their own healing capacities, people who wish to benefit from healers, and anyone interested in the magical properties of human relationships.",
        "Category": " Health & Fitness , Healing",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "God's Little Devotional for Teens (God's Little Devotional Book Series)",
        "Authors": "By Honor Books",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Toy Story 2 (Look-Look Book)",
        "Authors": "By Muldrow, Diane",
        "Description": "When Woody is kidnapped by a toy collector, Buzz Lightyear organizes the other toys into a rescue party",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Craig Claiborne's Favorites From The New York Times: Recipes, restaurants, tools, techniques, people, and places (Series II)",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Times Books",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "December",
            "Year": "1976"
        }
    },
    {
        "Title": "The French Paradox and Beyond: Live Longer with Wine and the Mediterranean Lifestyle",
        "Authors": "By Perdue, Lewis",
        "Description": "Perdue proposes moderate wine consumption and an emphasis on fresh foods, prepared with olive oil. Includes a cookbook section. Published by Renaissance Publishing, 867 W. Napa Street, Sonoma, CA 95476. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Renaissance Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "The Art of the Possible: The Path from Perfectionism to Balance and Freedom",
        "Authors": "By Stoddard, Alexandra",
        "Description": "As she reflects on the beauty of a balanced life, the author of Making Choices shares her ideas on ways to seek excellence, the importance of cherishing special moments, and how to live with simplicity and grace. 50,000 first printing. Tour.",
        "Category": " Psychology , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "A Whack on the Side of the Head: How You can be More Creative",
        "Authors": "By Von Oech, Roger",
        "Description": "Provocative puzzles, anecdotes, exercises, metaphors, cartoons, questions, quotations, and stories help readers systematically break through mental blocks and unlock the mind for innovative problem solving and creativity",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Irwin Career Handbook",
        "Authors": "By Hjorth, Linda Stevens",
        "Description": "",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Richard d Irwin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Are You Communicating?",
        "Authors": "By Walton, Donald",
        "Description": "Offers advice on listening, speaking, and writing effectively, and shows the impact of these skills on a variety of successful companies",
        "Category": " Business & Economics , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Killing the Spirit",
        "Authors": "By Smith, Page",
        "Description": "In contrast to the neo-conservative critique of academic leftists (see LA227), Smith, author of the eight-volume  A People's history of the United States , goes for the right target the institution, not the individual. The problems: academic fundamentalism; the flight from teaching due to tenure requirements; the worthlessness of most research and the mediocrity of most monographs; the narrowing of the disciplines; the dominance of the \"scientific\" approach dispassionate, distant, objective. No bibliography. (RC) Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Education , Higher",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Being Ok Just Isn't Enough: The Power of Self-Discovery (Lifestyle Series)",
        "Authors": "By Helmering, Doris Wild",
        "Description": "",
        "Category": " Self-help , General",
        "Publisher": "Doris Helmering",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Sports Illustrated Yearbook 2001",
        "Authors": "By Sports Illustrated (EDT)",
        "Description": "",
        "Category": " Sports & Recreation , Reference",
        "Publisher": "Cengage",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Windsor Castle (Britains Heritage S)",
        "Authors": "By Sir Robin Mackworth-Young",
        "Description": "",
        "Category": "",
        "Publisher": "Pitkins Pictorials",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "How Do You Spell God?",
        "Authors": "By Smith, Joseph A., Gellman, Marc, and Hartman, Thomas",
        "Description": "People don't want to learn about religions just because there are religions out there. People want to learn about religions because they know that religions have great answers to the big questions.Award-winning authors Rabbi Marc Gellman and Monsignor Thomas Hartman have produced a unique way of looking at the world's religions. Instead of isolating each religion in its own separate chapter, this book unites the religions by showing how each of them answers these universal questions:How should we live?What happens to us after we die?Why does bad stuff happen to good folks?How can we talk to God?With a refreshing combination of humor and sensitivity, a rabbi and priest show us how Judaism, Christianity, Islam, Buddhism, Hinduism, and the other great religions teach us to live. This wise and often thoughtprovoking book shows us that each religion has its own wisdom and its own wonderful stories. It also explains who works for God, why the world's religions are so different, and why some days of the year have become holy.How Do You Spell God? helps us appreciate religions from all over the world. It will also help us better understand our planet, our families, and ourselves.",
        "Category": " Young Adult Nonfiction , Religion , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Profit Zone: How Strategic Business Design Will Lead You to Tomorrow's Profits",
        "Authors": "By Slywotzky, Adrian J., Andelman, Bob, and Morrison, David J.",
        "Description": "Why do some companies create sustained, superior profits year after year? Why are they always far ahead of competitors in discovering the ever-changing profit zones of their industry? Why do others languish as their traditional way of doing business turns into a no-profit zone? The Profit Zone provides the answers. It is an original and practical explanation of how and why high profit happens, revealing the strategies of twelve of today's great success stories--a group of companies and executives that have created over $700 billion in market value for their shareholders. More importantly, it shows the lessons that can be learned from the business design of these companies--adaptations that enabled them to always be several steps ahead of competitors in meeting customer priorities. Some examples:The profit lessons any product company can learn from Jack Welch's \"sell solution, not just the box\" business design at GE.How Nicholas Hayek's creation of low-end, profitable firewall brand--the Swatch--protects the rich profitability of the high-end products at his companyHow Roberto Goizueta's decision that the consumer was not the only important customer created the basis for Coke's triumph's over Pepsi.Why Charles Schwab's switchboard business design created a new way of doing business for millions of new customers in financial services.How managers of small and mid-size businesses such as Madden Communications and middle managers in large companies have used Slywotzky and Morrison's ideas to move their companies to the profit zone.",
        "Category": " Business & Economics , Strategic Planning",
        "Publisher": "Crown Business",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Next Man Up: A Year Behind the Lines in Today's NFL",
        "Authors": "By Feinstein, John",
        "Description": "A behind-the-scenes tour of the ups and downs of an NFL season focuses on the Baltimore Ravens and reveals the lesser-known aspects of the professional league, from the dangerous conditions under which athletes are expected to train to the unrelenting pressures faced by coaches and players. 250,000 first printing.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Tips and Traps When Buying A Home",
        "Authors": "By Irwin, Robert",
        "Description": "It's the biggest purchase of your life! And it sould also be the biggest mistake...if you attempt it without consulting America's leading real estate advisor. Hundreds of thousands of home buyers have turned to this guide for solid \"how-to\" advice on this all-important buy. Now real estate veteran Robert Irwin is back with a new edition of his bestselling classic. Do you know the 7 most important tips? The 4 most significant buyer's traps? Is now really the right time to buy? With this book, you'll be the savviest, best-prepared home shopper possible--whether you're seeking a primary or vacation home, condo or co-op, new construction or resale.  Here's inside information on:*How to check out neighborhoods for school quality, crime rates, and future price appreciation. *The latest home inspection rules involving earthquake and hurricane retrofitting, asbestos and lead removal; and radon detection. *New warranties implied in purchase contracts. *Each step of the home-buying process, including assessing market conditions, house-hunting, dealing with agents and attorneys, negotiating, conducting inspections, getting the best financing, even saving on closing costs!",
        "Category": "",
        "Publisher": "McGraw-Hill Companies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Uncommon Sense: A Layman's Briefing Book on the Issues",
        "Authors": "By Thomas, Cal",
        "Description": "",
        "Category": "",
        "Publisher": "Wolgemuth & Hyatt Pub",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "The Resurrectionist",
        "Authors": "By Monteleone, Thomas F.",
        "Description": "Senator Thomas Flanagan is the GOP's cynical '90s answer to JFK: youthful, charismatic, ruthless; a glad-handing hustler with big ambitions, no ideals, a sham marriage, and a secret Hollywood mistress. Yet Flanagan, endorsed by heavyweights from GOPAC to the Washington Post, is the odds-on favorite to take the White House...until the night Flanagan and his life-long friend, campaign manager Larry Constantino, take a commercial flight to a Miami governors' convention. Without warning, the airliner malfunctions, crashing into the murky Everglades. Flanagan survives, but finds his friend's corpse impaled on a jagged shaft of wreckage.Torn by unbearable anguish, Flanagan reaches out to his friend...and brings Constantino back to life. The politician who has spent his entire career pursuing power finds he has the ultimate gift: He can raise the dead.The shock leads him to confide in Dr. Estela Barrero, a dedicated ER resident who sees Flanagan cure a leukemic child. And it compels him to reconsider his past. For the first time in his life Flanagan wants to escape the spotlight.Then the word gets out.Political rivals turn on him, fearing a candidate who performs miracles. Darker forces - secret cabals, the military - are willing to commit wholesale slaughter to capture him. Terrifying visions of a burning specter stalk his dreams. Worst of all, those Flanagan has recalled to life will discover that resurrection exacts a horrifying price.",
        "Category": " Fiction , Horror",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Miranda",
        "Authors": "By Hill, Grace Livingston",
        "Description": "",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Strange Highways",
        "Authors": "By Tartikoff, Brandon and Koontz, Dean R.",
        "Description": "You are about to experience what may be the publishing event of the year. The author - one of the most prolific writers of our time, the creator of such classic New York Times bestsellers as Dragon Tears, Midnight, The Bad Place, Watchers, and Hideaway. The book - an extraordinary first-ever collection of two complete novels, plus a compilation of twelve novelettes and short stories, as only the man universally hailed as a master of imaginative fiction can create them.You are about to travel along the strange highways of human experience: the adventures and terrors and failures and triumphs that we know as we make our way from birth to death, along the routes that we choose for ourselves and along others onto which we are detoured by fate.It is a journey down wrong roads that can lead to unexpectedly and stunningly right destinations ... into subterranean depths where the darkness of the human soul breeds in every conceivable form ... over unfamiliar terrain populated by the denizens of hell. It is a world of unlikely heroes, haunted thieves, fearsome predators, vengeful children, and suspiciously humanlike robots.",
        "Category": "",
        "Publisher": "Warner Books, Incorporated",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Goosefoot",
        "Authors": "By McGinley, Patrick",
        "Description": "Moving from the Irish countryside to the excitement--and danger--of Dublin, Patricia Teeling tests herself against life in the city and begins to wonder if perhaps she should have stayed in the country",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1983"
        }
    }
]