[
    {
        "Title": "Ephemeris: The Concise Planetary",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Hieratic",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "My Family's Best: In the Kitchen With Bob",
        "Authors": "By Bowersox, Bob",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Qvc Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Food Matters: A Guide to Conscious Eating with More Than 75 Recipes",
        "Authors": "By Bittman, Mark",
        "Description": "From the award-winning champion of culinary simplicity who gave us the bestselling How to Cook Everything and How to Cook Everything Vegetarian comes Food Matters, a plan for responsible eating that's as good for the planet as it is for your weight and your health.We are finally starting to acknowledge the threat carbon emissions pose to our ozone layer, but few people have focused on the extent to which our consumption of meat contributes to global warming. Think about it this way: In terms of energy consumption, serving a typical family-of-four steak dinner is the rough equivalent of driving around in an SUV for three hours while leaving all the lights on at home.Bittman offers a no-nonsense rundown on how government policy, big business marketing, and global economics influence what we choose to put on the table each evening. He demystifies buzzwords like \"organic,\" \"sustainable,\" and \"local\" and offers straightforward, budget-conscious advice that will help you make small changes that will shrink your carbon footprint -- and your waistline.Flexible, simple, and non-doctrinaire, the plan is based on hard science but gives you plenty of leeway to tailor your food choices to your lifestyle, schedule, and level of commitment. Bittman, a food writer who loves to eat and eats out frequently, lost thirty-five pounds and saw marked improvement in his blood levels by simply cutting meat and processed foods out of two of his three daily meals. But the simple truth, as he points out, is that as long as you eat more vegetables and whole grains, the result will be better health for you and for the world in which we live.Unlike most things that are virtuous and healthful, Bittman's plan doesn't involve sacrifice. From Spinach and Sweet Potato Salad with Warm Bacon Dressing to Breakfast Bread Pudding, the recipes in Food Matters are flavorful and sophisticated. A month's worth of meal plans shows you how Bittman chooses to eat and offers proof of how satisfying a mindful and responsible diet can be. Cheaper, healthier, and socially sound, Food Matters represents the future of American eating.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Complete Paint & Wall Coverings",
        "Authors": "By Lutes, Rob (EDT) and Sunset Books (COR)",
        "Description": "Provides instructions for painting the inside and outside of the house; discusses shopping for tools and materials, preparing surfaces, and repairing holes and cracks; includes projects using wallpaper and fabrics; and details types of painting techniques including stenciling and dragging",
        "Category": " House & Home , Decorating",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Writing Mysteries: A Handbook by the Mystery Writers of America",
        "Authors": "By Grafton, Sue (EDT)",
        "Description": "\"Across the darkened basement something creaked, and I tightened my grip on the Colt Diamondback. I'm not usually timid, but my palm was sweaty. That worried me; if I had to shoot this thing, I didn't need it flailing around in my hand like the snake it was named for.\"Tough spot. And you love it. You're a sleuth in your soul and a writer at heart. You can't resist the lure of the lurid, the thrill of the chase, the artful turn of a word, and the battle of wits in solving crimes of the imaginary kind.Still, as you know, mystery fiction is a species all its own, and writing it can be a special type of puzzle.But this is a special book, a writer's conference of sorts. In this book, your partners in literary criminology are among today's top mystery authors. Through informal essays, they'll show you how the pieces fit.More than a score of writers are represented here: Warren Murphy and Molly Cochran reveal the perils and pleasures of collaboration; Sara Paretsky - creator of the V.I. Warshawski series - comments on the promise and problems of inventing a recurring character; Tony Hillerman argues against plot outlines; John Lutz writes of endings and suggests knowing where you're going before you set out.With this book, you'll learn how to make your stories more taut, more real, more immediate, and more fraught with tension.\"I heard the triple-click of a revolver's hammer being thumbed back. I fired. And a split-second of muzzle-flash illuminated what had first bothered me about the neon sign buzzing in the midnight fog.\"The solutions are up to you. But now you're armed with all the clues you need to solve the mystery ... of how to write a mystery.",
        "Category": " Reference , Writing Skills",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "5.02",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Chi-Hoon: A Korean Girl",
        "Authors": "By McMahon, Patricia I. and O'Brien, Michael F. (ILT)",
        "Description": "A look at what it means to grow up female in a traditionally male-dominated culture, based on a Korean girl's own diary, follows Chi-Hoon as she attends school, goes to temple, shops at a market, and eats with her family.",
        "Category": " Juvenile Nonfiction , People & Places , United States , Asian American",
        "Publisher": "Boyds Mills Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Kyongju, A Thousand Year Capitol",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Huh Chui-jong",
        "Price Starting With ($)": "11.93",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Especially For Him ... A Beginner's Cookbook for Men",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "WRC Publishing",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Guide to Writing Quality Individualized Education Programs: What's Best for Students with Disabilities?",
        "Authors": "By Gibb, Gordon S. and Dyches, Tina Taylor",
        "Description": "This easy-to-follow guide reduces the complexity of IEP development to seven basic steps based on the requirements if IDEA '97.  Pre-service and in-service educators will find the user-friendly format invaluable for enhancing their IEP writing skills.    This helpful guide features case studies of four students of different ages with specific disabilities.  Step-by-step instructions show how to develop a program by explanation, modeling, practice, and feedback.  Also included are instructions for transition planning, a model IEP for comparison, and references for further learning.  This guide is best used with theWhat's Best for Matthew? Interactive CD-ROM by Egan, ISBN: 0-205-26660-6.   For pre-service and in-service special education teachers.",
        "Category": " Education , Aims & Objectives",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Sketchy Santas: A Lighter Look at the Darker Side of St. Nick",
        "Authors": "By Zweigart, Will",
        "Description": "Ho, ho, huh?Who’s that excessively jolly fellow with the fake beard, shifty eyes, sweaty hands, and boozy breath? Why, it’s not just Santa but sketchy Santa! Yes, ’tis the season for awkward photos of small children posed precariously on the laps of some of the most clownish, irritable, and just plain weird-looking Santa wannabes—guys you’d give a wide berth to if you passed them on the street.Inside this painfully hilarious collection of holiday photos, you’ll discover the pop culture history of the sketchy Santa, and how to identify sketchy Santas in shopping malls everywhere . . . making this the perfect gift for anyone who understands that \"He sees you when you’re sleeping\" is a deeply disturbing thought.",
        "Category": " Social Science , Customs & Traditions",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Black & Decker The Complete Photo Guide To Home Improvement: 300 Projects And 2,000 Photos",
        "Authors": "By Creative Publishing International (EDT)",
        "Description": "This revised and expanded edition of  The Complete Photo Guide to Home Improvement is a comprehensive reference for planning and completing major remodeling projects. With nearly 300 projects, this book is indispensable for DIYers who have moved beyond basic home repair and are ready to tackle projects that make a big difference in quality of life-and in their savings accounts. DIYers who tackle their own major remodeling projects achieve exactly the results they want, and can easily save thousands of dollars over the cost of hiring contractors to do the work. Studio photography and the most detailed step-by-step information available make this book unique among books on remodeling. New in this latest edition are major chapters on kitchen planning, bathroom planning, and working with contractors for jobs that are big enough to require some help. Readers will also appreciate the focus on new building materials, including laminate flooring, steel framing, PEX plumbing tubing, and glass blocks.  A helpful reference appendix provides at-a-glance information essential for DIY remodelers.",
        "Category": " House & Home , Reference",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "8.27",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Knights in Armor (Living History)",
        "Authors": "By Clare, John D. (EDT)",
        "Description": "Living history reenactments capture the world of medieval knighthood, documenting the codes of chivalry, tournaments, practices of court life, military and social roles of the knights, armor and weaponry, and other key aspects of medieval life.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Harcourt Children's Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "American Red Cross Adult Cpr",
        "Authors": "By American National Red Cross",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Amer Red Cross",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Atlas of World War II",
        "Authors": "By David Jordan",
        "Description": "",
        "Category": "",
        "Publisher": "Amber Books Ltd.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Beautiful Castles of Britain",
        "Authors": "By Wright, Nicolas",
        "Description": "Discusses and illustrates the art and architecture of over 30 castles throughout Britain",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Gifts",
        "Authors": "By Jo-Anne Power",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Summer Day Is Done",
        "Authors": "By R. T. Stevens",
        "Description": "",
        "Category": "",
        "Publisher": "Warner",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Bake-Off Cook Book: From the 19th Annual Bake Off",
        "Authors": "By Pillsbury Company",
        "Description": "",
        "Category": "",
        "Publisher": "Pillsbury Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Today's World: A New World Atlas from the Cartographers of Rand McNally",
        "Authors": "By Rand McNally",
        "Description": "A comprehensive and current world atlas. The 128 pages of reference maps clearly show cities, roads, railroads, rivers, and other features against a shaded drawing of the terrain. Expansive two-page spreads (22x14.75\") afford large-scale maps to show details of the changing parts of the world, as well as regions of the US and Canada. 11x15\". Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "8.25",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Tumbling After",
        "Authors": "By Witcover, Paul",
        "Description": "The long-awaited second novel by Paul Witcover, acclaimed author of the remarkable Waking Beauty, is a stunning and provocative masterwork ofingenious imagination -- part-coming-of-age story, part contemporary fairy tale, part technological nightmare, and a brilliant dark vision of dystopia. Twelve-year-old twins Jack and Jilly Doone are closer than most siblings -- uncannily linked, sharing thoughts, sensations, and emotions as if one person -- as they enjoy a mostly parentless August at the Delaware shore. But in the fury of an onrushing hurricane, a frighteningly close brush with death awakens an awesome power in Jack that changes everything ...On an alternate Earth -- transformed centuries earlier by the Viral Wars into a savage battleground where the \"normal\" followers of the emperor Pluribus Unum clash unceasingly with warriors of five mutated elemental races -- a young aerie named Kestrel sets out into the perilous Waste with four companions, trusting their fates to the great and powerful Odds. Taking the next all-important step in every \"mute's\" odyssey to adulthood and duty, Kestrel dreams of glory and sacrifice, and of single-handedly bringing about the total extermination of the hated \"norm\" enemy. But even his ability to soar high above his world will not help him escape the treachery of those he dares not trust, and his psionic powers over the winds cannot blow away the strange and shattering destiny that awaits him at journey's end.A different yet oddly synchronistic fate looms for Jack Doone in this endgame summer of frightening discovery and forbidden experimentation. Suddenly cursed with the uncontrollable power to alter reality -- to \"do over\" events and change the flow of his life and the lives of those around him -- his day-to-day existence has become a twisted version of the \"Mutes and Norms\" role-playing game devised and orchestrated by his uncle Jimmy. And now the twins' survival may come down to a single roll of the cosmic dice, as Jack finds himself devastatingly alone for the first time, his cherished Jilly's protector in a terrifying battle to determine the real, armed with no weapon but memory.A staggeringly original work that blurs the lines between reality and the fantastic, between the accepted and the taboo, between fantasy and science fiction, Paul Witcover's Tumbling After is proof positive that intelligence and invention still reign supreme in the thrilling literature of speculation.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Eos",
        "Price Starting With ($)": "5.93",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Easy Low-Fat Recipes With Swanson Broth",
        "Authors": "By Teberg, Pat (EDT)",
        "Description": "Includes recipes for low-fat skillet dishes, casseroles, stir-frys, salads, vegetables, and more, along with nutritional information for each dish",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Icebergs and Glaciers",
        "Authors": "By Simon, Seymour",
        "Description": "The frozen rivers and sheets of ice known as glaciers can move as slowly as a few inches a year, yet they are a powerful force shaping the earth beneath and around them.  Breathtaking photographs mark this dramatic introduction to a beautiful yet frozen world of mountaintops and polar regions.",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , Weather",
        "Publisher": "Collins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Life Processes of Plants (Scientific American Library)",
        "Authors": "By Galston, Arthur William",
        "Description": "At first glance, plants appear to be extremely passive organisms, silent, immobile, and unprotected. But within their placid exteriors there occurs a continuous swirl of activity - a complex orchestration of processes that allow the plant to obtain food, endure drastic weather, fend off predators, anticipate the future, and carry out tasks more often associated with higher animals. Plants are organic chemists par excellence, capable of synthesizing complex molecules; and they are experts at survival, equipped to withstand and adapt to the many challenges of nature.In Life Processes of Plants, botanist Arthur Galston describes how plants live, react to crises, and change when necessary. It is an eloquent and exquisitely illustrated volume, vividly conveying the scientific research that brought these extraordinary natural skills to light.Galston explores the dynamic existence of plants at all levels - from the organism as a whole down to the interplay of its tissues, cells, and molecules. Readers will be intrigued by the plant's methods of storing energy from sunlight, by the internal clock that tells plants the time of day, by the chemical warfare used against predators and competitors, and by the hormonal and electro-chemical communications network that conveys information within the plant. In addition, readers will witness the plant's impressive powers of regeneration, wherein almost any single cell can be the starting point for a complete separate plant. Another chapter shows how this regenerative ability and cooperation with microbes are the keys to remarkable developments in the exciting field of agricultural biotechnology.Life Processes of Plants illuminates some often overlooked phenomena of the natural world. Readers will see plants in a whole new way - as fascinating examples of both the complexity and simplicity of life.",
        "Category": " Gardening , General",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "6.14",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "What's Cooking Chocolate (What's Cooking Series)",
        "Authors": "By Bellefontaine, Jacqueline",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Chocolate",
        "Publisher": "Thunder Bay Pr",
        "Price Starting With ($)": "7.23",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Plucking The Apple",
        "Authors": "By Palmer, Elizabeth",
        "Description": "Sexual fantasies, infidelities, imbroglios, and betrayals collide at a Chelsea dinner party hosted by art gallery owners James and Victoria Harting in honor of their star artist, Jack Carey. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "In Sinful Harmony",
        "Authors": "By Pappano, Marilyn",
        "Description": "Follows the interwoven stories of a young librarian who risks her reputation for a man who entices her, a secretive man who has come back to town, an aging matriarch who hides mysterious intentions, and a woman who has lied about her child's paternity. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Great Beer Trek",
        "Authors": "By Morris, Stephen",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Red Weather: A Novel",
        "Authors": "By Toutonghi, Pauls",
        "Description": "The setting is Milwaukee, Wisconsin—if not America’s heart, then at least its liver—home to an array of breweries and abandoned factories and down-on-their-luck Eastern European immigrants. The year is 1989.Revolutions are sweeping through the nations of the Eastern Bloc. Communism is unraveling. And nobody feels this unraveling more piquantly than Yuri Balodis—a fifteen-year-old first-generation American living with his Latvian-immigrant parents in Milwaukee’s Third Ward.It’s a turbulent time. And when Yuri falls in love with Hannah Graham—the daring daughter of a prominent local socialist—chaos ensues. Within weeks, Yuri is ensnared by both Hannah and socialism. He joins the staff of the Socialist Worker. He starts quoting Lenin and Marx indiscriminately.His parents, of course, are horrified and deeply saddened. They try to educate him, to show him why, in their opinion, communism has ruined so many lives. But Yuri is stubborn. And his ideological betrayal will have more serious consequences than breaking his parents’ hearts.Red Weather is by turns funny and bittersweet, tinged with a rueful comic sense that will instantly remind you of the absurd complications of love. Pauls Toutonghi’s stunning debut novel is at once reminiscent of Michael Chabon’s The Mysteries of Pittsburgh and Khaled Hosseini’s The Kite Runner.",
        "Category": " Fiction , General",
        "Publisher": "Shaye Areheart Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "World Art The Essential History",
        "Authors": "By dr-robert-benton",
        "Description": "",
        "Category": "",
        "Publisher": "Star Fire Publishing",
        "Price Starting With ($)": "10.1",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Italy's 500 Best-ever Recipes",
        "Authors": "By Jeni Wright",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "A History of Israel: Volume II: From the Aftermath of the Yom Kippur War",
        "Authors": "By Sachar, Howard Morley",
        "Description": "A sequel to Howard Sachar's classic History of Israel: From the Rise of Zionism to Our Time, which Commentary called \"monumental...a triumph of comprehensive scholarship which is also a delight to read,\" this book offers an equally compelling and powerful narrative and a wealth of human detail.  The second volume begins where its predecessor left off, tracing the political, social, and economic growth of the Israeli republic from the traumatic aftermath of the Yom Kippur War in 1973 through the Begin and Peres eras.      With lucidity and incisiveness, Sachar presents the fascinating saga of the ethnic \"revolution\" that brought Menachem Begin to power; the social upheavals that have shaken the Arab population of the West Bank; the growth of Palestinian terrorism and of incipient Jewish vigilantism; and the clandestine dialogue between Israel's and Lebanon's political leaders that culminated in Ariel Sharon's ill-starred 1982 military invasion.      Since the Yom Kippur War, Israel's history has consisted of stark contrasts between dramatic military strikes abroad--Entebbe, Baghdad, Tunis among them--and confusion and violent confrontation at home over such issues as the settlement of the occupied Arab territories and religious extremism.  Covering all the dramatic milestones since the mid-seventies, Sachar explores Israel's current malaise and the extent to which the fate of the Jewish nation rests on the foreign and economic strategies of the Great Powers.      Both a compelling story and a penetrating analysis of Israel's current difficulties and achievements, this volume stands as a brilliant successor to a book critics and scholars have recognized as the definitive work in the field.",
        "Category": " History , Middle East , Israel & Palestine",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Admission Matters 2/e",
        "Authors": "By Springer, Sally P., Reider, Jon, and Franck, Marion R.",
        "Description": "The updated edition of the must-have resource for any student applying to collegeThis thoroughly revised and updated edition of the bestselling book Admission Matters demystifies the college application process and offers practical advice for choosing the right school, writing an effective essay, navigating financial aid, and more.   This handy resource will help any college-bound student whether they attend well-funded private schools or cash-strapped public schools. Filled with helpful suggestions, ideas, and advice, the new edition also includes tips for home-schooled students who are preparing to attend college. Helps all students who are applying to college understand the process and find the school that fits their needsExpanded information on testing, early decision/early action, applying as a home schooler, and tackling the dreaded college essayUp-to-date advice on financial aid in tough economic times – how it works and how to maximize your chances of getting aidAuthors bring the multiple viewpoints of college admissions officer, high school counselor, and parent of college-bound studentsThis book gives any college-bound student the information they need to make the application process run smoothly.",
        "Category": " Study Aids , College Guides",
        "Publisher": "JB",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "A Mother's Love: An Anthology",
        "Authors": "By Thayne, RaeAnne, Johnson, Janice Kay, and Wind, Ruth",
        "Description": "Insta-MomWhen a car accident robs businesswoman Kyra Tierney of her best friend, she finds herself the proud&#151;or rather, bewildered&#151;mom of a newborn. She can hardly accept help from builder Dylan Jones, even though both she and the baby find him irresistible!?er-Dedicated MomChrista Sullivan has been devoting herself to nursing her recently injured teenage daughter back to health and life. But when her daughter responds well to former rodeo cowboy Jace McCandless, how can she push him away&#133;even if he has lost his way?And a mom who's getting&#133;hitched?For Leila Foster, most guys aren't good enough&#151; including too-hot detective Mark Duncan. And when her mother announces that she's getting remarried, Leila is utterly horrified. Now Leila's mom has a new lesson to teach her daughter about taking a risk on love&#133;and it could be the hardest yet!",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin Anthologies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Fade to Black: A Black CATs Novel",
        "Authors": "By Parrish, Leslie",
        "Description": "When the murders of eight people are captured on film and shown on a secret Web site, FBI Special Agent Dean Taggert, while tracking this sadistic killer, is lead to the small town of Hope Valley where he enlists the help of a sexy sheriff who is dealing with secrets of her own. Original.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "The Gluten-Free Bible: The Thoroughly Indispensable Guide to Negotiating Life without Wheat",
        "Authors": "By Lowell, Jax Peters and Dimarino, Anthony J., M.D. (FRW)",
        "Description": "The definitive guide to the gluten-free lifestyle, completely revised and updated for the 2.2 million Americans with celiac disease According to a landmark 2003 National Institutes of Health study, 2.2 million Americans suffer from celiac disease, an allergy to the protein gluten found in wheat. Since this book was first published in 1995 (as Against the Grain), Jax Peters Lowell has been helping celiacs follow a gluten-free diet with creativity, resourcefulness, and humor.This edition includes chapters covering- the latest research into celiac disease, and myths that have     been debunked- how to eat out happily, including a short course in restaurant    assertiveness training- how to eat in happily, including a discussion of online and    mail order suppliers and negotiating the supermarket as a celiac- dozens of delicious new recipes- drugs, cosmetics, and other products tested for celiac-safety- a thoroughly updated resource sectionTens of thousands of celiacs have already enhanced their lives with Lowell's authoritative, witty, and practical guide. The Gluten-free Bible promises to bring relief to the new gluten-intolerant generation.",
        "Category": " Cooking , Health & Healing , Allergy",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Arthritis Can Be Cured",
        "Authors": "By Aschner",
        "Description": "",
        "Category": "",
        "Publisher": "Arco Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1968"
        }
    },
    {
        "Title": "The Complete Directory to Prime Time Network TV Shows 1946 - Present",
        "Authors": "By Tim Brooks, Earle Marsh",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Obsession Untamed (Feral Warriors)",
        "Authors": "By Palmer, Pamela",
        "Description": "They are called Feral Warriors—an elite band of immortals who can change shape at will. Sworn to rid the world of evil, consumed by sorcery and seduction, their wild natures are primed for release . . .Every time she closes her eyes, Delaney Randall suffers another nightmare. A brutal serial killer has found his way inside the tough, take-no-prisoners FBI agent's head. Now she lives the murders through his eyes, from his deadly approach to his victims' screams—until the night he breaks into her apartment and she fears she's going to be the next to die.But the man who snatches Delaney from her home isn't the murderer. He's Tighe, a dangerous Feral Warrior who needs her and her visions to stop the rampages of a creature as inhuman as he is evil. Tighe has little use for humans, but as he and Delaney join forces to track the dark fiend, he falls for the intense beauty and becomes wild with an obsession as untamed as his heart.",
        "Category": " Fiction , Romance , Paranormal",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Moon Handbooks Oaxaca: Mountain Craft Regions, Archaeological Sites, and Coastal Resorts (Moon Oaxaca)",
        "Authors": "By Whipperman, Bruce",
        "Description": "",
        "Category": " Travel , Mexico",
        "Publisher": "Avalon Travel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Kitchen Solutions: Substitutions, Basic Formulas and Essential References",
        "Authors": "By Kornfeld, Meredith (EDT)",
        "Description": "Kitchen Solutions: Substitutions, Basic Formulas and Essential References is an indispensable kitchen handbook. It includes substitutions for hard-to-find ingredients; low-fat, wholesome substitutions; formulas for spice blends, sauces and other staples; meat and poultry roasting charts; and more.",
        "Category": " Cooking , Reference",
        "Publisher": "Nitty Gritty Cookbooks",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Desire Untamed (Feral Warriors)",
        "Authors": "By Palmer, Pamela",
        "Description": "For a limited time, and at a special price, discover Pamela Palmer’s Feral Warriors with Desire Untamed, the first book in the series. Plus, receive deleted scenes and excerpts from Pamela’s entire collection, including her new book, ALove Untamed, available December 26th.In Desire Untamed, Kara MacAllister thinks she’s just an average, small-town pre-school teacher until the night a mysterious stranger shows up at her door claiming she’s not only immortal, but the chosen one of a band of powerful shape-shifting males. Lyon steals her away from everything she knows and thrusts her into a world beyond her comprehension, a world filled with magic, nightmares, and perilous danger where Kara discovers an inner strength she never knew she possessed, and a passion in the arms of Lyon beyond anything she ever imagined.As he works with Kara, preparing her to become the source of power for the Feral Warriors, Lyon is swept away by Kara’s vulnerable beauty and tempted beyond all reason by a desire he can’t deny. But when Lyon realizes his band of warriors has been infiltrated by an ancient evil, he begins to question whether Kara is quite as innocent as she seems.And he begins to wonder if the woman who’s stolen his heart is destined to be his salvation...or his doom.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "America's Low Calorie Recipes",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Landoll's",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Inherit the Storm",
        "Authors": "By Edwards, Pamela",
        "Description": "",
        "Category": "",
        "Publisher": "Tudor Publishers",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Howl at the Moon (The Others, Book 12)",
        "Authors": "By Warren, Christine",
        "Description": "Noah Baker never wanted to betray The Others. But if his military commanders want him to covertly investigate a Lupine scientist—whose extraordinary research on sensory perception in werewolves could be used to develop werewolf-sharp senses in human soldiers—Noah must oblige. Even if it means deceiving the woman he desires the most.Samantha Carstairs is the personal assistant to the Alpha of the Silverback Clan, and as best friend to the Lupine community's most brilliant scientist, she is privy to its most dangerous secret. Noah knows that Sam will never leak the scientific research…so he must find another way to get it, while keeping Sam close. But someone else is after Sam's secret. Who is the other spy infiltrating The Others? If their genetic secrets get into the wrong hands, all hell could break loose. Now Noah's true loyalty is put to the test as he fights to protect The Others—and his beloved Sam—and find the imposter…before it's too late.",
        "Category": " Fiction , Romance , Paranormal",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Secrets of The Lost Symbol: The Unauthorized Guide to the Mysteries Behind The Da Vinci Code Sequel",
        "Authors": "By Burstein, Dan and De Keijzer, Arne",
        "Description": "“If anyone can divine the contents of The Lost Symbol, it’s Dan Burstein.” —New York magazineWith Secrets of the Lost Symbol, co-authors Dan Burstein and Arne de Keijzer delve into the real history, science, and hidden meanings behind Dan Brown’s latest blockbuster novel, The Lost Symbol. As they have done previously with their extraordinary New York Times bestsellers Secrets of the Code and Secrets of Angels & Demons, Burstein and de Keijzer explore the themes, conspiracies, mythologies, codes, encrypted signs, and alternate histories—from the birth of Knights Templar to the present day—popularized by the acclaimed creator of The Da Vinci Code, giving them fresh and fascinating relevance while separating truth from fantasy.",
        "Category": " Literary Criticism , American , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Condi: The Condoleezza Rice Story, New Updated Edition",
        "Authors": "By Felix, Antonia",
        "Description": "\"The secretary of state is America's face to the world and in Dr. Rice the world will see the strength, grace and decency of our country…I've relied on her counsel, benefited from her great experience and appreciated her sound and steady judgment. And now I'm honored that she's agreed to serve in my Cabinet.\"—George W. Bush, in his official statement nominating Condoleezza Rice as the next Secretary of StateAs Secretary of State and a close confidant of President George W. Bush, Condoleezza Rice is the most influential woman in the history of the United States government, and perhaps one of the most famous black women in the world. Her latest stint in Washington, DC follows her role as National Security Advisor to the President and a distinguished career as scholar, professor, provost, and foreign policy advisor that has taken her from Birmingham, Alabama, to Denver, Colorado, to Palo Alto, California, to the White House—all by the age of 50.But just who is this powerful woman who has experienced firsthand some of our nation's darkest and brightest moments, who was a key player in the government's response to the September 11 tragedies, and who some believe will likely be a future governor, senator, vice president, or even president? Drawing from exclusive interviews with dozens of relatives, colleagues, friends, and teachers and from scores of previously published interviews and articles, Antonia Felix gives us the first biography of this extraordinary American—a poised, immensely appealing, fiercely loyal, and deeply religious woman, whose passions include music, football, and Russia.Her remarkable story is founded on a compelling family legacy. With ancestors on both sides who were white slave owners and slaves, Condoleezza Rice comes from two lineages, the Rices and the Rays, devoted to education and achievement. She was born in segregated Birmingham in 1954 and grew up in the upwardly mobile, high-achieving, black middle-class enclave of the city. Her music-loving parents, both educators, named her after a musical term, Condolcezza—to play \"with sweetness.\"The Rices started their only child on piano lessons at age three and filled her childhood years with ballet, figure skating, tutoring in French and Spanish, football viewing, and a constant flow of books at her bedside table, setting forth a standard of excellence that would give her the \"twice as good\" edge necessary to be on an even standing with her white peers in the segregated South.While in training to become a concert pianist (a dream she eventually cast aside), Rice graduated from high school at 16 and from the University of Denver at 19. She ultimately found her career calling from her professor there, Josef Korbel, former Central European diplomat and father of former Secretary of State Madeleine Albright, who sparked her passion for Soviet studies. After receiving a Ph.D. at age 26, Rice became an assistant professor of political science at Stanford, starting on the path that led to her becoming the youngest-ever provost at Stanford, the youngest and first-ever female national security advisor, and the first black, female secretary of state.The story of her path to excellence is an inspiration to all, regardless of politics. Ms. Felix's book, Condi, not only gives us the first comprehensive portrait of the person who has the president's ear perhaps more than anyone else in his administration—a black woman who has risen to the top in a field traditionally dominated by white men—but also a greater understanding of and insight into the workings of the White House.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Last Watch of the Night: Essays Too Personal and Otherwise",
        "Authors": "By Waters, Sarah",
        "Description": "Sarah Waters, the award-winning author of three novels set in Victorian London, returns with a stunning novel that marks a departure from the 19th century.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Virago",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Morning Praise",
        "Authors": "By Ardis Dick Stenbakken",
        "Description": "",
        "Category": "",
        "Publisher": "Review and Herald Publishing Asssociation",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Chef: A Novel",
        "Authors": "By Singh, Jaspreet",
        "Description": "Kirpal Singh is riding the slow train to Kashmir. With India passing by his window, he reflects on his destination, which is also his past: a military camp to which he has not returned for fourteen years. Kirpal, called Kip, is shy and not yet twenty when he arrives for the first time at General Kumar's camp, nestled in the shadow of the Siachen Glacier. At twenty thousand feet, the glacier makes a forbidding battlefield; its crevasses claimed the body of Kip's father. Kip becomes an apprentice under the camp's chef, Kishen, a fiery mentor who guides him toward the heady spheres of food and women. In this place of contradictions, erratic violence, and extreme temperatures, Kip learns to prepare local dishes and delicacies from around the globe. Even as months pass, Kip, a Sikh, feels secure in his allegiance to India, firmly on the right side of this interminable conflict. Then, one muggy day, a Pakistani \"terrorist\" with long, flowing hair is swept up on the banks of the river and changes everything. Mesmeric, mournful, and intensely lyrical, Chef is a brave and compassionate debut about hope, love, and memory set against the devastatingly beautiful, war-scarred backdrop of occupied Kashmir.",
        "Category": " Fiction , Cultural Heritage",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Have I Got a Guy for You: What Really Happens When Mom Fixes You Up",
        "Authors": "By Strauss, Alix (EDT)",
        "Description": "Shows how women got suckered into going out with the mates their mothers found for them. This collection features 25 victims of poor arrangements, well-meaning fix-ups, and just plain bad judgment calls.",
        "Category": " Family & Relationships , Parenting , Parent & Adult Child",
        "Publisher": "Polka Dot Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Seizing the Enigma: The Race to Break the German U-Boats Codes, 1939-1943",
        "Authors": "By Kahn, David",
        "Description": "Focuses on the personalities involved in British efforts to break the German U-boat codes",
        "Category": " History , Military , World War II",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Steamed (Gourmet Girl Mystery)",
        "Authors": "By Conant, Susan and Conant-Park, Jessica",
        "Description": "Chloe Carter is forever on a quest for the perfect meal and the perfect man. Getting both in one shot is irresistible. That's why Chloe (known on the Internet as GourmetGirl) risks another burn when she accepts a date with DinnerDude online. Unfortunately, her fellow food lover turns out to be just another cheap, pompous, well-fed bore. Showing more promise is the honey-lavender creme brulee - a bit of culinary heaven Chloe's bland date never even has a chance to sample. Certainly there's an easier way to run out on a tab than being stabbed to death in the men's room.Talk about a rocky love life. Chloe's first date of the week is a murder victim. Her second date is with a perfectly sweet chef who'd be ideal if he wasn't the prime suspect. As the investigation plunges the amateur sleuth into the gourmet restaurant scene, she discovers a cutthroat world rife with killer competition, stormy love affairs, and a recipe for Baby Bok Choy Slaw to die for.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Sun-Dried Tomatoes",
        "Authors": "By Brennan, Ethel and Molloy, Jack (ILT)",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The People That Time Forgot",
        "Authors": "By Burroughs, Edgar Rice",
        "Description": "",
        "Category": "",
        "Publisher": "Ace",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1918"
        }
    },
    {
        "Title": "Mars and Venus Complete Book of Romance: Sears Special Markets",
        "Authors": "By Gray, John",
        "Description": "",
        "Category": "",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Allen's synonyms and antonyms by F.Surges Allen",
        "Authors": "By F.Surges Allen",
        "Description": "",
        "Category": "",
        "Publisher": "Perennial",
        "Price Starting With ($)": "8.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Pocket Dictionary of American Slang",
        "Authors": "By Harold Wentworth, Stuart Berg Flexner",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1978"
        }
    },
    {
        "Title": "Laugh Your Calories Away: Sweet 'n Low All-Star Recipes",
        "Authors": "By Adams, Joey",
        "Description": "",
        "Category": "",
        "Publisher": "Cumberland Packing Corporation",
        "Price Starting With ($)": "14.55",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Cooking for Kids Collection",
        "Authors": "By No Author",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "We Need to Talk. But First, Do You Like My Shoes?: Dress Codes for Dumping Your Man",
        "Authors": "By Grish, Kristina and Raymondstotter, Maria",
        "Description": "Is your guy noncommittal about his commitment issues? Does his idea of going Dutch not involve a European holiday? Has he ever sent flowers to his ex...on your birthday? Then you, my friend, are destined to dump the twit---but not without styling the perfect outfit first. Nobody likes having the Talk. But this indispensable guide will help you choose the perfect look to further communicate exactly how you feel.Unlike a black-tie wedding or Casual Friday, D-Day (Dump Day, that is) has never known a designated dress code-and therefore, left far too many women without an aesthetic clue as to how their clothes can drive the point home. This book will help you:- Read his relationship issues like a care label- Send him into self-loathing regret with a plunging neckline - Cushion his fall with soft fabrics, if you're feeling generous- Pair the right look with your cosmic star sign - Come up with ideas for post-dump outings with friends in order to shake breakup blues.Why waste a hot outfit on a teary night at home? Let's face it: D-Day's no walk in the park, but knowing whether to wear comfy Mary Janes, pointy stilettos, or knee-high power boots will help you move on in style!Is your guy noncommittal about his commitment issues? Does his idea of going Dutch not involve a European holiday? Has he ever sent flowers to his ex...on your birthday? Then you, my friend, are destined to dump the twit---but not without styling the perfect outfit first. Nobody likes having the Talk. But this indispensable guide will help you choose the perfect look to further communicate exactly how you feel.Unlike a black-tie wedding or Casual Friday, D-Day (Dump Day, that is) has never known a designated dress code-and therefore, left far too many women without an aesthetic clue as to how their clothes can drive the point home. This book will help you:- Read his relationship issues like a care label- Send him into self-loathing regret with a plunging neckline - Cushion his fall with soft fabrics, if you're feeling generous- Pair the right look with your cosmic star sign - Come up with ideas for post-dump outings with friends in order to shake breakup blues.Why waste a hot outfit on a teary night at home? Let's face it: D-Day's no walk in the park, but knowing whether to wear comfy Mary Janes, pointy stilettos, or knee-high power boots will help you move on in style!",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Low fat & luscious: Favorite baked treats",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "A Crowning Mercy: A Novel",
        "Authors": "By Cornwell, Bernard and Kells, Susannah",
        "Description": "“If you love historical drama…then look no further.” —Boston Globe Bernard Cornwell, the perennial New York Times bestselling author of the Richard Sharpe series and “perhaps the greatest writer of historical adventure novels today” (Washington Post) joins co-author Susannah Kells for A Crowning Mercy—a breathtaking romantic adventure set against the dramatic backdrop of the English Civil War. The exciting story of a rebellious Puritan woman on a perilous quest for love and fortune, A Crowning Mercy is a must for Cornwell fans as well as for devoted readers of Sharon Kay Penman and Diana Gabaldon.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Diabetic Recipes For the Holidays",
        "Authors": "By Various",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "17.45",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Biblical View of Self-Esteem, Self-Love, and Self-Image",
        "Authors": "By Adams, Jay Edward",
        "Description": "Who am I? Why am I here? Where am I going? Familiar questions in our day and age. But has our search for answers led us too far in the wrong direction: away from our true position in Christ and toward a dangerous emphasis on self?Recent decades have seen the rise of a powerful and influential movement within the church. Identified by labels such as “             self-image,”              “             self-esteem,”              “             self-worth,”              and “             self-love,”              this movement has one common denominator—             the emphasis on self. Regardless of religious persuasion, everyone seems to be fighting what they perceive to be a shared enemy: low self-esteem.Now well-known biblical counselor and noted author Jay Adams brings much-needed clarification to the area of self-esteem and offers the church and every believer a truly biblical view of self.",
        "Category": " Religion , Christian Theology , Ethics",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Where There's a Will (Gideon Oliver Mysteries)",
        "Authors": "By Elkins, Aaron J.",
        "Description": "There's a family plot unfolding in the northern uplands of Hawaii - on the magnificent 11,000-acre spread of ranching heir Axel Torkelsson. After going missing ten years ago, the small private plane of Axel's late Uncle Magnus has finally been found in a remote lagoon, hundreds of miles south of the Big Island. So too have Magnus's few and scattered skeletal remains, exhumed by divers and now handed over to the only man who can fit together the pieces of this mystery.What forensic detective Gideon Oliver is discovering could shake the Torkelsson family tree to its very roots. But this time his work is yielding more questions about the past than answers. Questions about the long-ago execution-style murder of Magnus's brother...about a deadly dispute between rival ranching syndicates...about a mysterious will that benefits - as well as incriminates - its heirs...and most disturbing of all: questions as to the true identity of the corpse in the lagoon. But if it isn't Uncle Magnus...As lie upon lie is revealed, as secret upon secret is exposed, Gideon's only hope is to let the bones of the dead condemn the living - before the living take revenge.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Black at Heart: A Black CATs Novel",
        "Authors": "By Parrish, Leslie",
        "Description": "Wyatt Blackstone has done his best to mask his romantic feelings for Lily Fletcher, the brilliant but fragile young woman whose technical skills have helped him track countless violent Internet predators. But now he must fin out if the woman he loves has become a rogue agent obsessed with cold-blooded revenge...",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "The Projection Principle",
        "Authors": "By Dr. George Weinberg, Dianne Rowe",
        "Description": "Introduces a simple, effective technique designed to help control the ways in which people view and treat others, and offers practical tips on how to achieve respect, appreciation, love, and opportunity",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Mystic Seaport: A camera impression",
        "Authors": "By Samuel Chamberlain",
        "Description": "",
        "Category": "",
        "Publisher": "Hastings House",
        "Price Starting With ($)": "14.43",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "The Sound of Wings: The Life of Amelia Earhart",
        "Authors": "By Lovell, Mary S.",
        "Description": "When Amelia Earhart mysteriously disappeared in 1937 during her attempted flight around the world, she was already known as America's most famous female aviator. Her sense of daring and determination, rare for women of her time, brought her insurmountable fame from the day she became the first woman to cross the Atlantic in an airplane. In this definitive biography, Mary S. Lovell delivers a brilliantly researched account on Earhart's life using the original documents, letters, the logbooks of Earhart and her contemporaries, and personal interviews with members of Amelia's family, friends and rival aviatorsThe Sound of Wings vividly captures the drama and mystery behind the most influential woman in \"The Golden Age of Flight\"--from her tomboy days at the turn of the century and her early fascinations with flying, to the unique relationship she shared with G.P. Putnam, the flamboyant publisher and public relations agent who became both her husband and her business manager. It is a revealing biography of an uncommonly brave woman, and the man who both aided and took advantage of her dreams.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Abigail Adams: A Biography",
        "Authors": "By Levin, Phyllis Lee",
        "Description": "Wife of one president and mother of another, Abigail Adams was an extraordinary woman living at an extraordinary time in American history. A tireless letter writer and diarist, her penetrating and often caustic impressions of most of the major persons of her day--including Ben Franklin, George and Martha Washington, Thomas Jefferson, Alexander Hamilton, and King George III, among others--provide one of the best first-hand accounts of the American Revolution. This biography, researched and written over a fourteen-year period, is a fascinating portrait of a brilliant woman at the center of the founding of the American republic.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "The Breast Cancer Prevention Cookbook",
        "Authors": "By Ricciotti, Hope and Connelly, Vincent",
        "Description": "With over 165 recipes, this cookbook will have you eating healthy as your best proactive defense against breast cancer. It is never too earlyor too lateto start eating well. New data is showing that the right foods can help bolster the body's defenses against cancer, even for babies in utero. The Breast Cancer Prevention Cookbook allows you to find the recipes that blend in best with your lifestyle, whether you are a vegetarian, a beginner or an accomplished cook, a family of one or many. In the first section, Hope Ricciotti gives expert medical information and health advice to women concerned about breast cancer or who have had a previous incidence. The recipe section starts with scrumptious smoothies (think lemon and mango) and moves on to soups (corn chowder); salads; pizza and pasta dishes; vegetarian meals; chicken, meat, and seafood recipes; side dishes; and dessert (raspberry-poppy muffins).",
        "Category": " Cooking , Health & Healing , Cancer",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Fruit Desserts: Delectable Seasonal Sweets",
        "Authors": "By Yockelson, Lisa",
        "Description": "Shares recipes for compotes, salads, pies, cakes, tarts, turnovers, dumplings, puddings, shortcakes, fools, mousses, cobblers, crisps, glazed fruit, ice creams, and sherbets",
        "Category": " Cooking , Specific Ingredients , Fruit",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "To Catch a Flame",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket 1991/91",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "PERRY MASON IN THE CASE OF THE AMOROUS AUNT",
        "Authors": "By Erle Stanley Gardner",
        "Description": "",
        "Category": "",
        "Publisher": "Walter J. Black, Inc.",
        "Price Starting With ($)": "14.9",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Love's Unseen Enemy: How to Overcome Guilt to Build Healthy Relationships",
        "Authors": "By Parrott, Les",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Just for Kids Collection",
        "Authors": "By Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Harmony Illustrated Encyclopedia of Country Music: 3rd Edition",
        "Authors": "By Cackett, Alan and Foege, Alec",
        "Description": "With more than 700 entries and 500 photographs, this new edition is the essential reference to the sounds and styles of country music. Covers the pioneers, the superstars, and the newest wave of popular performers, with complete life stories and an invaluable guide to recordings. Full-color photographs.",
        "Category": " Music , Genres & Styles , Country & Bluegrass",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The FC&A 2003 Information Almanac 1,001 Perfectly Legal Ways to Get Exactly What You Want, When You Want It, Every Time",
        "Authors": "By Publishing, FC&A",
        "Description": "",
        "Category": "",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "In & Around London",
        "Authors": "By Peter Matthews",
        "Description": "",
        "Category": "",
        "Publisher": "Unichrome Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Encyclopedia Of World Sea Power",
        "Authors": "By Cullen, Tony",
        "Description": "Shows and describes the capabilities of submarines, aircraft carriers, cruisers, destroyers, frigates, patrol craft, hovercraft, missiles, anti-aircraft weapons, and underwater weapon systems currently used by the world's navies",
        "Category": " Political Science , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "6.93",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Some Kind of Wonderful",
        "Authors": "By Child, Maureen",
        "Description": "Holiday shop owner Carol Baker infuses her business and her life with peace and good will. But she has secrets from her past that make her all the more determined to someday have a family of her own. She never expects a sweltering July heat wave to bring the gift of a baby girl who needs a mother's love...and a man who needs to heal his wounded soul.Ex-LAPD copy Jack Reilly's back in town--temporarily--to fill in for the ailing local sheriff. Haunted by the tragedy that made him leave Los Angeles, Jack doesn't believe in \"forever.\" His sassy landlady Carol, with her year-round Chistmas spirit, gorgeous smile, and adorable little foster daughter, Liz, begin to bring him back to life. But the past has a way of coming back again, and the dark places of the heart have a way of staying hidden. Still, good things have a way of happening in Christmas--and if the Reillys have anything to say about it, what develops between Carol and Jack will be some kind of wonderful...",
        "Category": " Fiction , Romance , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Are We Alone? Scientists Search for Life in Space",
        "Authors": "By Skurzynski, Gloria",
        "Description": "Could there really be life beyond Earth? Readers visit scientists the world over who ambitiously seek to answer that question. Through a combination of captivating narrative and scientific facts, author Gloria Skurzynski skillfully demonstrates how the quest for extraterrestrial life is real, widespread, and growing.",
        "Category": " Juvenile Nonfiction , Technology , Aeronautics, Astronautics & Space Science",
        "Publisher": "National Geographic Children's Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Symphony Themes, Compiled by Raymond Burrows [And] Bessie Carroll Redmond with Special Editorial Assistance by George Szell",
        "Authors": "By Burrows, Raymond / Redmond, Bessie Carroll",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1942"
        }
    },
    {
        "Title": "The War Chest",
        "Authors": "By Hill, Porter",
        "Description": "Looking for a way to reactivate the conflict in India and drive the French from the sub-continent, the British Chiefs of Staff call on Captain Adam Horne and his band of expendable cutthroats to undertake the deadly mission. Reprint.",
        "Category": " Fiction , War & Military",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Planning a Better Kitchen",
        "Authors": "By",
        "Description": "",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Creative Homeowner Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "The Winning Spirit",
        "Authors": "By Celizic, Mike and Koplowitz, Zoe",
        "Description": "The star of the 1996 New York Marathon came in 28,657th - not just last but dramatically last: 27 hours and 36 minutes after beginning on the Verrazano-Narrows Bridge at 6 A.M. on the previous morning. Zoe Koplowitz has multiple sclerosis. And for Zoe, the marathon is far more than just a matter of miles and finish lines. Over the years, it has become a metaphor for personal triumph over adversity. Her transformational journey of the spirit has captured the imagination of hundreds of thousands of people all over the world, superseding boundaries of race, class, and economics.The Winning Spirit: Life Lessons Learned in Last Place is an inspirational look at the true stories and lessons Zoe has learned in the course of her marathon adventures: the importance of self-acceptance, the power of a dream, courage in the face of adversity, excelling despite perceived limitations, and the beauty of unconditional love.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Commemorations",
        "Authors": "By Herlin, Hans",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1976"
        }
    },
    {
        "Title": "Beyond Identity: Finding Yourself in the Image and Character of God",
        "Authors": "By Keyes, Dick",
        "Description": "",
        "Category": " Religion , Christianity , General",
        "Publisher": "Servant Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "The Best Skillet Recipes: A Best Recipe Classic",
        "Authors": "By Burgoyne, John (ILT), Van Ackere, Daniel J. (PHT), Tremblay, Carl (PHT), Keller + Keller (PHT), and Cook's Illustrated (EDT)",
        "Description": "The Best Skillet Recipes means a world of great and easy meals. One pan is all you need! From breakfast all the way to dessert, one skillet is all you need for fast, flavorful meals. it's no surprise that meat, fish, and pasta dishes come together nicely in a skillet But pot pie can also be made in the pan. So can pizza, casseroles and souffles. Put away that second pot for boiling pasta and cook it in its sauce right in the skillet. Start pizzas on the stovetop in the skillet and finish with a hot blast in the oven (still in the skillet). Spruce up your stir-fry repertoire with new and innovative ideas.",
        "Category": " Cooking , Methods , General",
        "Publisher": "America\u0092s Test Kitchen",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Notebook Reference Science Fact Book: Second Edition",
        "Authors": "By",
        "Description": "The Notebook Reference Science Fact Book offers students everything they need for success in science right at their fingertips! From scientific terms to the scientific method, this convenient, 144 page fact book is filled with information, illustrations, definitions, and charts that students can use to review key topics and concepts. The topics covered include life, earth, and physical science, as well as investigation and experimentation. An essential section of science fair basics is also easily located to help guide them through the process of selecting a topic to making a presentation. The 3-hole punched format allows students to carry this book in a 3-ring binder for quick reference at school, at home, or on the go!",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "American Education Publishing",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Dance Ink",
        "Authors": "By Miller, J. Abbott (EDT), Tarr, Patsy (EDT), and Dalva, Nancy (EDT)",
        "Description": "",
        "Category": " Performing Arts , Dance , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "UNIX in a nutshell: System V edition : a desktop quick reference (A Nutshell handbook)",
        "Authors": "By Dougherty, Dale",
        "Description": "",
        "Category": "",
        "Publisher": "O'Reilly & Associates",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Surviving Your Dissertation: A Comprehensive Guide to Content and Process",
        "Authors": "By Rudestam, Kjell Erik and Newton, Rae R.",
        "Description": "Rudestam and Newton provide readers with expert advice on the entire dissertation process; selecting a suitable topic, conducting a review of the literature, building an argument, presenting the material, presenting data and results and managing data overload, methods for developing appropriate writing skills, ways to construct tables and figures, working with faculty committees, and dealing with emotional blocks.",
        "Category": " Study Aids , Study & Test-Taking Skills",
        "Publisher": "SAGE Publications, Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "A Gift of Hope",
        "Authors": "By Melendez, Tony",
        "Description": "",
        "Category": "",
        "Publisher": "Angelus Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Wee Willie Winkie",
        "Authors": "By Cousins, Lucy and Cousins, Lucy (ILT)",
        "Description": "Offers illustrated versions of \"Mary Mary,\" \"Polly Put the Kettle On,\" \"Hickory Dickory Dock,\" and other traditional nursery rhymes",
        "Category": " Juvenile Fiction , Nursery Rhymes",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Paris index plan: Transports, sens uniques (GUIDES VERTS, 4714) (French, English, German, Spanish)",
        "Authors": "By Pneu Michelin",
        "Description": "",
        "Category": "",
        "Publisher": "Pneu Michelin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Your First Goldfish (Your First Series)",
        "Authors": "By Gilbert, Mariana",
        "Description": "Provides information on the selection, care, varieties, breeding, and health of goldfish",
        "Category": " Pets , Fish & Aquariums",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Great Paper Jets",
        "Authors": "By Norman Schmidt",
        "Description": "",
        "Category": "",
        "Publisher": "Sterling Publishing Co., Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Twentieth-Century France: Politics and Society in France 1898-1991 (Hodder Arnold Publication)",
        "Authors": "By McMillan, James F.",
        "Description": "Originally published as \"Dreyfus to de Gaulle\", this authoritative account has now been revised and extended and is the best up-to-date introduction to the history of modern France.",
        "Category": " History , Europe , France",
        "Publisher": "Bloomsbury Academic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Life in the Family Zoo",
        "Authors": "By Platt, John M.",
        "Description": "",
        "Category": "",
        "Publisher": "Dynamic Training & Seminars",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    }
]