[
    {
        "Title": "India: From Midnight to the Millennium",
        "Authors": "By Tharoor, Shashi",
        "Description": "\"Few books in recent years, if any, offer such a comprehensive overview of what ails India, its politicians and its people; and few writers, apart from Nirad Chaudhury and V. S. Naipaul, benefit so obviously from the perspective Tharoor offers, that of an Indian with a profound empathy for his native culture, combined with the insight made possible by following India's progress from afar.\"--New York Times\"A hard-hitting, powerfully analytical and supremely articulate new book. . . . Tharoor discusses the 'flawed miracle of Indian democracy' from various angles, opting for a take-no-prisoners approach as he criticizes politicians, unpacks layers of misguided governmental policies and exposes the atavistic tendencies of special-interest pols.\" --Newsday\"Tharoor looks back at his country's first 50 years of independence, describing its challenges (illiteracy, poverty, sectarian violence and the ever-present caste problem) and its triumphs (a thriving democracy, a burgeoning economy) in lively, informative prose. He is particularly adept at describing all that India and Indians are not--not the same ethnicity, religion or language--to arrive at the nation's essence: that 'the singular thing about India was that you could only speak of it in the plural'.\" --Seattle Times",
        "Category": " History , Asia , India & South Asia",
        "Publisher": "Harper-perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The aviator;",
        "Authors": "By Knight, Clayton",
        "Description": "",
        "Category": "",
        "Publisher": "D. McKay Co",
        "Price Starting With ($)": "8.85",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "The Third Battle of Winchester (Virginia Civil War battles and leaders series)",
        "Authors": "By Delauter, Roger U",
        "Description": "",
        "Category": "",
        "Publisher": "H.E. Howard",
        "Price Starting With ($)": "95.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Bringing Back the Bay: The Chesapeake in the Photographs of Marion Warren and the Voices of Its People",
        "Authors": "By Warren, Marion E. and Warren, Mame",
        "Description": "Photographer Warren set out with his camera in 1985 to record every aspect of life apropos of the Chesapeake Bay region: native boats, farmers tilling the land, church gatherings, commerce in large and small towns, the watermen of remote places. The warmth and power of his black & white images paired with extended quotes from the people of the region collected by the photographer's daughter, Mame Warren, create an aesthetically delightful documentary of a unique area. 9x12\" Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "6.81",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "100 Q&A About Parkinson Disease (100 Questions and Answers About...)",
        "Authors": "By Lieberman, Abraham N. and McCall, Marcia",
        "Description": "A patient-oriented guide to the symptoms, diagnosis, and treatment of Parkinson's disease.",
        "Category": " Health & Fitness , Diseases , Nervous System (incl. Brain)",
        "Publisher": "Jones and Bartlett Publishers, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Doggone It (Katie Kazoo, Switcheroo No. 8)",
        "Authors": "By Krulik, Nancy E., Krulik, John (ILT), and Krulik, Wendy (ILT)",
        "Description": "When Katie's teacher moves in next-door, Katie can't believe her bad luck! Nothing could be worse than your own teacher living next-door-or could it? Mrs. Derkman hates dogs, and she wants the dogs on their street to be kept on leashes at all times! Katie is furious. Then the magic wind blows, turning Katie into her own dog, Pepper. Will she be able to convince her teacher that dogs are not all bad?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Last Watch (Watch, Book 4)",
        "Authors": "By Bromfield, Andrew (TRN) and Lukianenko, Sergei",
        "Description": "The fourth novel in the blockbuster series from one of Russia's most popular authors, Last Watch returns us to the hyper-imaginative world of Sergei Lukyanenko, where the endless battle between good and evil is about to reach its climax. Anton Gorodetsky is just getting a feel for his new powers when his boss, Gesar, sends him to assist the Scottish Night Watch in Edinburgh in a murder investigation. A young Russian man has been murdered--apparently by a vampire. But the mystery is more than it seems, and soon Anton is himself in danger. The murderer appears to be someone with intimate knowledge of the Night Watch. Before long, Anton realizes that a plot is being hatched by the forces of both darkness and light that--unless he can intervene--may mean nothing less than Armageddon.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Digging for the Truth: One Man's Epic Adventure Exploring the World's Greatest Archaeological Mysteries",
        "Authors": "By Bernstein, Josh",
        "Description": "The host of the History Channel's Digging for the Truth presents a behind-the-scenes tour of some of his most interesting and physically challenging adventures, during which he explored the secrets of the Sphinx, traced the Lost Ark of the Covenant to remote sites in Ethiopia, and witnessed a Druid ceremony at Stonehenge. 50,000 first printing.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Gotham",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Excellent Protestant Congregations: The Guide to Best Places and Practices",
        "Authors": "By Wilkes, Paul",
        "Description": "Profiles eight dynamic and diverse congregations, identifiying the characteristics that make each distinctive while explaining how any church can apply their ideas locally, in a resource that also lists more than 300 recommended Protestant congregations. Original.",
        "Category": " Religion , Christianity , Protestant",
        "Publisher": "Westminster John Knox Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Turning to One Another: Simple Conversations to Restore Hope to the Future",
        "Authors": "By Wheatley, Margaret J.",
        "Description": "\"I believe we can change the world if we start talking to one another again.\" With this simple declaration, Margaret Wheatley proposes that people band together with their colleagues and friends to create the solutions for real social change, both locally and globally, that are so badly needed. Such change will not come from governments or corporations, she argues, but from the ageless process of thinking together in conversation. Turning to One Another encourages this process. Part I explores the power of conversation and the conditions-simplicity, personal courage, real listening, and diversity-that support it. Part II contains quotes and images to encourage the reader to pause and reflect, and to prepare for the work ahead-convening truly meaningful conversations. Part III provides ten \"conversation starters\"-questions that in Wheatley&apos;s experience have led people to share their deepest beliefs, fears, and hopes.",
        "Category": " Philosophy , Metaphysics",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Max's Easter Surprise (Max and Ruby)",
        "Authors": "By Wells, Rosemary (CRT)",
        "Description": "Ruby and her friend Louise are decorating Easter eggs, but Max wants to have an Easter Parade. Big sister Ruby tells Max that the Easter Parade is tomorrow, but that he can help today by carrying all the decorated eggs to the Easter basket. But Max doesn?t want to just carry the eggs?he wants to march them in a parade!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Pirates in the Park",
        "Authors": "By Roberts, Thom and Berson, Harold (ILT)",
        "Description": "Made from a walnut shell, Jenny's ship can't compare with the big pirate ship a boy is sailing on the pond - or can it?",
        "Category": "",
        "Publisher": "Crown Publishers Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1973"
        }
    },
    {
        "Title": "The Coroner's Lunch",
        "Authors": "By Cotterill, Colin",
        "Description": "“This series kickoff is an embarrassment of riches: Holmesian sleuthing, political satire, and [a] droll comic study of a prickly late bloomer.”—Kirkus Reviews (starred review)“The sights, smells, and colors of Laos practically jump of the pages of this inspired, often wryly witty first novel.”—Denver Post“A wonderfully fresh and exotic mystery. . . . If Cotterill . . . had done nothing more than treat us to Siri’s views on the dramatic, even comic crises that mark periods of government upheaval, his debut mystery would still be fascinating. But the multiple cases spread out on Siri’s examining table . . . are not cozy entertainments, but substantial crimes that take us into the thick of political intrigue.”—The New York Times Book Review“In Siri, Cotterill has created a detective as distinctive as Maigret or Poirot.”—Orlando Sentinel“The Soho Press crime series . . . has done mystery connoisseurs everywhere a favor by adding Colin Cotterill to its publishing list. The author gives us exotic locations; a world that few of us know well; crisp, intelligent, and often-witty writing; and, most of all, a hero unlike any other.” —The Philadelphia InquirerLaos, 1975. The Communist Pathet Lao has taken over this former French colony. Dr. Siri Paiboun, a 72-year-old Paris-trained doctor, is appointed national coroner. Although he has no training for the job, there is no one else; the rest of the educated class has fled.He is expected to come up with the answers the party wants. But crafty and charming Dr.Siri is immune to bureaucratic pressure. At his age, he reasons, what can they do to him? And he knows he cannot fail the dead who come into his care without risk of incurring their boundless displeasure. Eternity could be a long time to have the spirits mad at you.For more information, visit www.colincotterill.com",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Soho Crime",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Level 26: Dark Origins",
        "Authors": "By Swierczynski, Duane and Zuiker, Anthony E.",
        "Description": "It is well known among law enforcement personnel that murderers can be categorized on a scale of twenty-five levels of evil, from the naive opportunists starting out at Level 1 to the organized, premeditated torture-murderers who inhabit Level 25.What almost no one knows - except for the elite unnamed investigations group assigned to hunt down the world's most dangerous killers, a group of men and women accounted for in no official ledger, headed by the brilliant but reluctant operative Steve Dark - is that a new category of killer is in the process of being defined.Only one man belongs to this group. His targets: Anyone. His methods: Unlimited. His alias: Sqweegel. His classification: Level 26.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Spirituality at Work: 10 Ways to Balance Your Life On-the-Job",
        "Authors": "By Pierce, Gregory F.",
        "Description": "Gregory F. A. Pierce makes a striking claim: The holy and the transcendent  can be found in the midst of the hustle and bustle of daily work. Rather than  being a “grind,” our work can be “grist” for our spiritual mills. Indeed, the  work we do has enormous spiritual significance. Spirituality at Work offers  invaluable guidance for everyone who seeks to nourish their spiritual lives  while on the job. Pierce’s ten disciplines of workplace spirituality  include: • finding sacred objects • living with imperfection • assuring  quality • giving thanks and congratulations • building support and  community • dealing with others as you would have them deal with you •  deciding what is enough—and sticking to it • balancing work, personal,  family, church, and community responsibilities • working to make “the system”  work • engaging in ongoing personal and professional development",
        "Category": " Religion , Spirituality",
        "Publisher": "Loyola Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Notebook for Fantastical Observations",
        "Authors": "By DiTerlizzi, Tony and Black, Holly",
        "Description": "Can't get enough of the faerie world? Well, Tony DiTerlizzi and Holly Black, the brave souls that helped Mallory, Simon, and Jared Grace bring their amazing adventures to a worldwide audience, are here to help you find yours!   Presenting The Spiderwick Chronicles Notebook for Fantastical Observations. This handy interactive storybook features seventeen mini-adventures collected from faerie watchers around the globe as well as plenty of pages for readers to add their own stories, maps, charts, notes, lists, diagrams, and drawings. So get ready to embark on your own faerie adventure -- all you need is an observant eye and an open mind. Just keep your wits about you. After all... their world is closer than you think....",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Simon & Schuster for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "101 Places You Gotta See Before You're 12!",
        "Authors": "By O'Sullivan, Joanne",
        "Description": "To children, the world can seem huge, filled with exciting places to visit and new things to experience. But how can they start uncovering the many treasures that await them? This fun and informative guidebook?the first in a new series?invites kids to embark on an exhilarating scavenger hunt that opens their eyes to things they’ve never imagined before. And there’s no need to go far or plan a big, expensive vacation to see this great stuff. In fact, some of the places may be quite close to home. They can take a peek at what actually goes on at their parents’ office, experience another culture’s cuisine at an ethnic restaurant, immerse themselves in the beauty of nature at a wildlife preserve, or get the inside scoop on what really happens backstage at the theater?or even in the teacher’s lounge! And the ideas are just general enough to provide a gentle push in the right direction, while allowing young dreamers to use their imagination and fill in the specifics.In addition to tons of fun facts, lists of little-known sites, and more than 250 color photos, there’s a bonus fold-out map of North America and stickers, so youngsters can mark where they’ve been.",
        "Category": " Juvenile Nonfiction , Travel",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Geometry For Dummies",
        "Authors": "By Ryan, Mark",
        "Description": "Learning geometry doesn’t have to hurt. With a little bit of friendly guidance, it can even be fun! Geometry For Dummies, 2nd Edition, helps you make friends with lines, angles, theorems and postulates. It eases you into all the principles and formulas you need to analyze two- and three-dimensional shapes, and it gives you the skills and strategies you need to write geometry proofs.  Before you know it, you’ll be devouring proofs with relish. You’ll find out how a proof’s chain of logic works and discover some basic secrets for getting past rough spots. Soon, you’ll be proving triangles congruent, calculating circumferences, using formulas, and serving up pi. The non-proof parts of the book contain helpful formulas and tips that you can use anytime you need to shape up your knowledge of shapes. You’ll even get a feel for why geometry continues to draw people to careers in art, engineering, carpentry, robotics, physics, and computer animation, among others.You’ll discover how to:  Identify lines, angles, and planes Measure segments and angles Calculate the area of a triangle Use tips and strategies to make proofs easier Figure the volume and surface area of a pyramid Bisect angles and construct perpendicular lines Work with 3-D shapes Work with figures in the x-y coordinate system  So quit scratching your head. Geometry For Dummies, 2nd Edition, gets you un-stumped in a hurry.",
        "Category": " Mathematics , Geometry , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Pascal handbook",
        "Authors": "By Tiberghien, Jacques",
        "Description": "",
        "Category": "",
        "Publisher": "Sybex",
        "Price Starting With ($)": "5.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Color Drawing: A Marker/Colored-pencil Approach for Architects, Landscape Architects, Interior and Graphic Designers, and Artists",
        "Authors": "By Doyle, Michael E.",
        "Description": "",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1983"
        }
    },
    {
        "Title": "The House of Mondavi: The Rise and Fall of an American Wine Dynasty",
        "Authors": "By Siler, Julia Flynn",
        "Description": "An epic, scandal-plagued story of the immigrant family that built—and then spectacularly lost—a global wine empireSet in California’s lush Napa Valley and spanning four generations of a talented and visionary family, The House of Mondavi is a tale of genius, sibling rivalry, and betrayal. From 1906, when Italian immigrant Cesare Mondavi passed through Ellis Island, to the Robert Mondavi Corp.’s twenty-first-century battle over a billion-dollar fortune, award-winning journalist Julia Flynn brings to life both the place and the people in this riveting family drama.The blood feuds are as spectacular as the business triumphs. Cesare’s sons, Robert and Peter, literally came to blows in the 1960s during a dispute touched off by the purchase of a mink coat, resulting in Robert’s exile from the family—and his subsequent founding of a winery that would set off a revolution in American winemaking. Robert’s sons, Michael and Timothy, as passionate in their own ways as their visionary father, waged battle with each other for control of the company before Michael’s expansive ambitions ultimately led to a board coup and the sale of the business to an international conglomerate.A meticulously reported narrative based on thousands of hours of interviews, The House of Mondavi is bound to become a classic.",
        "Category": " Business & Economics , Industries , Agribusiness",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Darkest Passion (Lords of the Underworld, 5)",
        "Authors": "By Showalter, Gena",
        "Description": "For weeks, the immortal warrior Aeron has sensed an invisible female presence. An angel—demon-assassin—has been sent to kill him. Or has she? Olivia claims she fell from the heavens, giving up immortality because she couldn't bear to harm him. But trusting—and falling for—Olivia will endanger them all. So how has this \"mortal\" with the huge blue eyes already unleashed Aeron's darkest passion?Now, with an enemy hot on his trail and his faithful demon companion determined to remove Olivia from his life, Aeron is trapped between duty and consuming desire. Worse still, a new executioner has been sent to do the job Olivia wouldn't….",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Stealing Kathryn (The Gatherers)",
        "Authors": "By Frank, Jacquelyn",
        "Description": "New York Times bestselling author Jacquelyn Frank invites you to explore a strange and sensuous world of darkest desire ruled by an extraordinary being who is about to meet his earthly match.  .  .Sandman. Angus. Morpheus. He is known by many names, except his true one, Adrian. When he departs his world, it is to enter the sacred space of sleep, and he is not there to sow sweet dreams. Adrian's mission is to reap the dark energy of nightmares, work that has twisted his soul as well as his once-handsome face. Now, he lives only to await the day darkness finally overcomes him.  .  .and to collect exquisite reminders of what he's lost.  .  . But there is one treasure that stands apart. Having risked everything to obtain her, Adrian soon realizes his mistake. For Kathryn has a wholly unexpected power over him, not only for what she represents, but for what for she is: a soul with desires as strong as his own, tempered by compassion that could save Adrian from his self-made hell--or condemn them both.  .  . Praise for the Novels of Jacquelyn Frank\"A lush narrative sure to please readers who have longed for new gothic and darkly romantic tales.\" --Booklist on Gideon\"Frank's Nightwalker series depicts an engrossing alternate world, drawn in prose that is lush and lyrical.\" --Linda Howard",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "An Introduction to Shakespeare (AESTHETICS, LITERARY HISTORY, THEATRE HISTORY",
        "Authors": "By Chute, Marchette",
        "Description": "",
        "Category": "",
        "Publisher": "E P Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Chicken Soup for the Soul: What I Learned from the Dog: 101 Stories about Life, Love, and Lessons",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Newmark, Amy (COM), and Diamond, Wendy (FRW)",
        "Description": "Chicken Soup for the Soul: What I Learned from the Dog will delight readers with humorous, heartwarming, and inspiring stories about lessons our canine friends and family members have taught us.Lessons come in all shapes and sizes, like our faithful canine  friends. Dog lovers share their stories about the valuable, heartwarming, and oftern fummy, lessons they have learned from their loyal pets.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Chicken Soup for the Soul",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "The Desperate Housewives Cookbook",
        "Authors": "By Styler, Christopher (EDT), Tobis, Scott S. (EDT), and Cherry, Marc (CRT)",
        "Description": "Spicy. Sweet. Tasty. Tart. No . . . were not talking about the lovely ladies of Wisteria Lane, but their cooking. Bree, Susan, Lynette, and Gabrielle may not be traditional housewives, but they do have their special talents in the kitchen. In The Desperate Housewives Cookbook, they share those recipes . . . and so much more!Tune in to ABC's monster hit Desperate Housewives on any given Sunday night, and youll salivate over everything from Bree's ber-gourmet repasts to Susan's what's-a-spatula simple suppers. They may have wildly different personalities and story lines, but if there's one thing the four heroines have in common, it's food. In The Desperate Housewives Cookbook, the show's millions of fans will find recipes for all the foods made famous by the show, as well as many others inspired by each housewife. For example:-Bree's elegant, impressive dinners feature dishes like Basil Pure Soup, Braised Duck, and Chicken Cutlets Saltimbocca.-Lynette's time-challenged lifestyle leads to quick, healthy, everyday fare like French Toast for Breakfast (or Dinner) with Blueberry Syrup; Warm Turkey, Muenster, and Coleslaw Wraps; and Potato Casserole.-Susan's lack of kitchen skills means that her dishes are of the couldnt-be-simpler (but still mouthwatering) variety, like a Salad of Roasted Peppers, Fresh Mozzarella, and Arugula; Foolproof Macaroni and Cheese; Chocolate Butterscotch Bars; and Garlic Mashed Potatoes.-Gabrielle enjoys the finest things in life -- and food is no exception. Her meals are gourmet, and most definitely prepared by a personal chef. Her faves include Shrimp with Chorizo and Red Pepper, Guacamole with Warm Chips, and Pineapple-Peach Smoothies.-Edie uses food for seduction as much as for sustenance. Her sensual favorites include Oysters Poached in Champagne and Cream, Sausage Puttanesca, and Ambrosia.",
        "Category": " Drama , American , General",
        "Publisher": "Kingswell",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Everlasting Kiss",
        "Authors": "By Ashley, Amanda",
        "Description": "Desire Never DiesDaisy O'Donnell doesn't get the attraction some women feel for vampires. She likes her men with a heartbeat. And she's just met one who's full of life: Erik Delacourt, the unreasonably sexy man she keeps meeting at a popular L.A. nightclub called the Crypt. She barely knows him, but there's no resisting the connection she feels. . .There's one important detail Erik hasn't gotten around to telling her yet. He's a powerful vampire out to hunt the Blood Thief who is draining young vampires all over the city--and who has just raised the stakes by destroying one of Erik's friends. To Erik, Daisy is a bright spot of innocence in a world of darkness and menace. He'll do anything--even lie to her--to keep her safe and pure.If only he knew that Daisy has something of her own to hide. . .",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Film Production Technique: Creating the Accomplished Image",
        "Authors": "By Mamer, Bruce",
        "Description": "Intended for the beginning independent film maker, this handbook describes the techniques used in the production of specific film images.  Covering each element of film production, it offers details on blocking, the camera, shooting, lighting and exposure, and editing.  Black and white photographs, diagrams, charts, and movie stills are included to illustrate the techniques described in the text.  Mamer teaches at Minneapolis College. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Performing Arts , Film & Video , Direction & Production",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Christmas Miracles: Foreword by Don Piper, Author of 90 Minutes in Heaven",
        "Authors": "By Murphey, Cecil, Gibson, Marley, and Piper, Don (FRW)",
        "Description": "Celebrate the season of hope and miracles with these inspiring true stories that will warm the heart and touch the soul… A man lies gravely ill in the hospital on Christmas when he hears angels singing and immediately makes a full recovery.  A little boy with dyslexia sits down to read a Christmas book and realizes that his disability has vanished.  And a woman’s faith is renewed by the chance discovery of a simple nativity set.Many ordinary people experience God’s grace during those special moments when Christmas becomes more than just a holiday, but a time for miracles.  Cecil Murphey and Marley Gibson bring you the real-life stories of everyday people who have experienced these life-changing moments of hope, comfort, and transformation—all during the most wonderful time of the year.",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Can a Busy Christian Develop Her Spiritual Life?: Answers to Questions Women Ask About Spirituality",
        "Authors": "By Arthur, Kay, Briscoe, Jill, and Mayhall, Carole",
        "Description": "Offers spiritual guidance for women, discussing how to appreciate one's uniqueness, learn to forgive more easily, develop confidence in sharing faith, and other issues",
        "Category": " Religion , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Green Book: The Everyday Guide to Saving the Planet One Simple Step at a Time",
        "Authors": "By Rogers, Elizabeth, Kostigen, Thomas M., Diaz, Cameron (FRW), and McDonough, William (FRW)",
        "Description": "Ellen DeGeneres, Robert Redford, Will Ferrell, Jennifer Aniston, Faith Hill, Tim McGraw, Martha Stewart, Tyra Banks, Dale Earnhardt, Jr., Tiki Barber, Owen Wilson, and Justin Timberlake tell you how they make a difference to the environment.Inside The Green Book, find out how you can too:- Don’t ask for ATM receipts. If everyone in the United States refused their receipts, it would save a roll of paper more than two billion feet long, or enough to circle the equator fifteen times!- Turn off the tap while you brush your teeth. You’ll conserve up to five gallons of water per day. Throughout the entire United States, the daily savings could add up to more water than is consumed every day in all of New York City.- Get a voice-mail service for your home phone. If all answering machines in U.S. homes were replaced by voice-mail services, the annual energy savings would total nearly two billion kilowatt hours. The resulting reduction in air pollution would be equivalent to removing 250,000 cars from the road for a year!With wit and authority, authors Elizabeth Rogers and Thomas Kostigen provide hundreds of solutions for all areas of your life, pinpointing the smallest changes that have the biggest impact on the health of our precious planet.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Harmony",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Our Family Tree: A Keepsake Book",
        "Authors": "By Barbara Briggs Morrow",
        "Description": "",
        "Category": "",
        "Publisher": "New Seasons",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Long Fall (Leonid McGill)",
        "Authors": "By Mosley, Walter",
        "Description": "The widely praised New York Times bestseller, and Mosley's first new series since his acclaimed Easy Rawlins novels...  Leonid McGill is an ex-boxer and a hard drinker looking to clean up his act. He's an old-school P.I. working a New York City that's gotten a little too fancy all around him. But it's still full of dirty secrets, and as McGill unearths them, his commitment to the straight and narrow is going to be tested to the limit...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "New American Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Understanding China: A Guide to China's Economy, History, and Political Culture",
        "Authors": "By Starr, John Bryan",
        "Description": "In this succinct, modest, and refreshingly forthright book--now revised and updated for the new century--Starr introduces to the uninitiated reader the background, basic data, and issues at stake in China's crisis-ridden present and future.The death of Deng Xioaping in February 1997, revelations about Chinese influence in our election campaigns, and Chinese eagerness to acquire advanced American technology, are only some of the developments  that show how urgently we need to know and understand China better than we do. In this revised edition of his essential book, Starr focuses his shrewd attention on them all. He furnishes additional material on China's relations with Taiwan and Tibet, the transfer of Hong Kong to Chinese rule, China's nuclear weapons program, and its environmental and human rights records.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Hill and Wang",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Nailed",
        "Authors": "By Jones, Patrick",
        "Description": "The nail that sticks out farthest gets hammered the hardest.Flint Southwestern High School is run by a cult: the jockarchy. And Bret Hendricks could never fit into their conformity cult. Bret doesn't mind standing out from the crowd when he's on stage acting or singing in his band. And he feels at home in his funky girlfriend's arms because sticking out together doesn't seem as hard. But loyalties aren't what Bret thinks they are, as his safe havens seem to disappear one by one, and he learns that sometimes you just have to risk getting hammered in order to build a great future. For any teen who feels that standing out is harder than just conforming. Patrick Jones's second novel nails the real truth about the high price of hiding one's true self.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Walker Childrens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Memories of the Old Plantation Home: A Creole Family Album",
        "Authors": "By Gore, Laura Locoul, Marmillion, Norman, and Marmillion, Sand",
        "Description": "",
        "Category": "",
        "Publisher": "The Zoe Company",
        "Price Starting With ($)": "12.98",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "The Templar Papers: Ancient Mysteries, Secret Societies and the Holy Grail",
        "Authors": "By Olsen, Oddvar",
        "Description": "Much has been written about the group of 14th-century warrior monks known as the Knights Templar. Some authors, such as Dan Brown in The Da Vinci Code, portray them as folk heroes wrongly accused. Others disagree, saying the Templar story is ultimately one of greed, deception, and idolatry. Just who were the Knights Templar? And what is their legacy? In The Templar Papers, author and historian Oddvar Olsen has assembled a veritable Who's Who of experts to unravel the mystery. Instead of rehashing previous scholarship, this book delves into new aspects of Templar lore, such as the origins of the order and its supposed survival after 1314. It attempts to answer the following:Were the Templars devil worshippers who venerated a mysterious head? Was the head that of John the Baptist? What exactly did they find in Solomon's Temple? Did they keep, and later hide, the Holy Grail and the Ark of the Covenant?You'll also discover the Templar link to Mary Magdalene and the Freemasons, including answers to questions such as:Were Jesus and Mary lovers or, in fact, husband and wife?Did Mary give birth to a child after Jesus' death? Did Freemasonry originate from the Templars?The Templar Papers offers the inquisitive reader several lifetimes of research and insight. This is a distinctive and truly unique compilation that will stimulate your mind and settle the controversy.",
        "Category": " Religion , History",
        "Publisher": "Weiser",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Singular Existence",
        "Authors": "By Talbot, Leslie",
        "Description": "",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Citadel Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "What You Should Know About the Purple Martin (America's Most Wanted Bird)",
        "Authors": "By Wade, J. L.",
        "Description": "",
        "Category": "",
        "Publisher": "self-published",
        "Price Starting With ($)": "14.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "How Could You Do This to Me Mum? (FAB 5)",
        "Authors": "By Rushton, Rosie",
        "Description": "Five English teenagers--Chelsea, Jemma, Sumitha, Jon, and Laura--begin the New Year determined to do better, but they find unexpected complications at home, at school, and in their relationships.",
        "Category": " Young Adult Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The River at the Center of the World: A Journey Up the Yangtze, and Back in Chinese Time",
        "Authors": "By Winchester, Simon",
        "Description": "A stunning tour of China, its people, and its history. Chosen as one of the best travel books of 1996 by theNew York Times Book Review.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Hellas: A Portrait of Greece",
        "Authors": "By Gage, Nicholas",
        "Description": "Gage captures a feeling - the special intensity of this land, the magical presence of the Parthenon, the sense of something that is lovely, perverse, crazy, delightful and beautiful. Readers who have never been to Greece will want to go and those who have will want to return.",
        "Category": " Travel , Reference",
        "Publisher": "Efstathiadis Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "An Honest Love (Hearts of Middlefield Series, Book 2)",
        "Authors": "By Fuller, Kathleen",
        "Description": "Anna must find the courage to tell Lukas the truth. Will he find the courage to forgive her?Anna was once betrayed by someone she loved deeply. In an attempt to never be hurt again, she and her mother relocated to Middlefield, Ohio. It was the ideal place for Anna's broken heart to mend. In Middlefield, Anna withdrew from risk, placing all her attention on managing the new gift shop she and her mom bought.When Lukas introuces himself, Anna can't resist her attraction to him. Though she finds herself falling in love, she's hiding a piece of her past in fear that their future will be destroyed if she tells him the truth.But love can't be built on lies and the past comes rushing back to Anna in an irreversible way. Now Lukas must decide how he will react to Anna's betrayal. As they cling to their belief in an honest love, they realize it's a path they must walk together even as it leads to unexpected places.",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Wee Sing 25th Anniversary Celebration book",
        "Authors": "By Beall, Pamela Conn, Nipp, Susan Hagen, Klein, Nancy Spence (ILT), and Guida, Lisa (ILT)",
        "Description": "A \"best-of\" collection features all of the favorite Wee Sing songs, along with suggestions for parents to join in and help to develop their child's imagination. Original.",
        "Category": " Juvenile Nonfiction , Music , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Tico and the Golden Wings (Knopf Children's Paperbacks)",
        "Authors": "By Lionni, Leo and Lionni, Leo (ILT)",
        "Description": "A classic fable encouraging generosity and individuality, from four-time Caldecott Honor-winner Leo Lionni.Tico, a little bird born without wings, is one day granted his dearest wish. But the wings he gets are made of gold and his bird friends turn against him. “You think you are better than we are,” they say. What Tico does with his golden feathers—and the important lesson he learns—is a fable that children will take to their hearts.",
        "Category": " Juvenile Fiction , Social Themes , Values & Virtues",
        "Publisher": "Dragonfly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1975"
        }
    },
    {
        "Title": "Ideals Easter 1990",
        "Authors": "By Ideals Publications Inc",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Ideals Valentine",
        "Authors": "By",
        "Description": "Selected poetry, prose, photographs, and illustrations celebrate love, the meaning of Valentine's Day, and the beauty and activities of winter",
        "Category": "",
        "Publisher": "Ideals Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Neighborly Ideals",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Secret Duke (A Mallorean Novel)",
        "Authors": "By Beverley, Jo",
        "Description": "A thrilling new historical romance from the New York Times bestselling author of The Secret Wedding   When Arabella Barstowe is kidnapped, she believes her life and virtue are forfeit-until she's rescued by the notorious rogue Captain Rose. Bella never expects to see him again. But years later she learns the wicked truth behind her abduction, and she seeks out the only man who can help her take revenge.  What she doesn't know is that Captain Rose is just a disguise for the formidable Duke of Ithorne, who is intrigued to hear from the mysterious woman from his past. Their lives are soon entangled by danger and a growing forbidden passion.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Proficient Motorcycling: The Ultimate Guide to Riding Well",
        "Authors": "By Hough, David L.",
        "Description": "From the publishers of Motorcycle Consumer News, Shifting Gears at 50 is a one-of-a-kind motorcycling manual for returning and late-entry riders, essentially anyone 40 years old and up who’s looking to hit the road on two wheels. Author Philip Buonpastore, a motorcycle journalist and retired US Air Force photographer, helps readers gear up to get back on a motorcycle (or get on one for the first time).In Part 1, Becoming a Motorcyclist,” Buonpastore discusses the basics of buying the right bike, gear, and equipment and getting the bike up to speed. The book continues with a good overview of learning to ride, the importance of taking a road course, venturing out on the first ride, and extending rides to long-distance jaunts. Throughout Part 1 are sidebars by riding- safety instructor and expert Walt Fulton, offering sound advice on safety precautions and execution for every leg of the new and returning rider’s journey. The author emphasizes what older riders should be aware of and which factors can affect their rides. Adding lots of great firsthand advice are humorous and helpful stories collected by the author and related by returning riders at various ages, from their late 30s to 60s.In Part 2, Buonpastore shares five of his favorite travelogues covering his long-distance tours around the US, from the American South to the west coasts. This section is illustrated by over 100 of the author’s breathtaking photographs of the various locations he toured on his bike.The foreword to the book is provided by best-selling motorcycle author David Hough (author of I-5 Press’s Proficient Motorcycling and Mastering the Ride). Hough writes, If you’re getting into today’s motorcycling at an age your doctor would describe as middle aged’ or senior,’ do you yourself a clever favor and read Phil’s book.”",
        "Category": " Transportation , Motorcycles , General",
        "Publisher": "Lumina Media",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Boys!",
        "Authors": "By Beausay, William",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Eyes of the Storm (BONE #3)",
        "Authors": "By Smith, Jeff and Hamaker, Steve (ILT)",
        "Description": "In \"Eyes of the Storm,\" book three in the epic BONE series, Gran'ma Ben reveals long-kept secrets about Thorn's royal heritage and the ancient enmities that may lead to war.In \"Eyes of the Storm,\" volume three of the nine-book BONE saga, Lucius, Smiley, and Phoney survive an attack by the rat creatures and return safely to Lucius' tavern in Barrelhaven. Phoney, desperate to win a bet with Lucius, stokes the townspeople's fear of dragons and boasts that he is a professional dragonslayer. Back at the farm, Fone Bone and Thorn are troubled by strange dreams, and Gran'ma Ben's reaction to them is stranger still: She reveals long-kept secrets and warns of great danger.  Thorn, Fone Bone, and Gran'ma Ben may have to leave the farm forever.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Graphix",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Acropolis the Monuments & the Museum",
        "Authors": "By Manolis Andronicos",
        "Description": "",
        "Category": "",
        "Publisher": "Ekdotike Athenon S.A.",
        "Price Starting With ($)": "9.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "A Sort of Samurai (Otani)",
        "Authors": "By Melville, James",
        "Description": "Superintendent Otani of the Hyogo Police investigates the murder of a Westerner during a Japanese holiday earthquake and uncovers a plot involving international gunrunning and blackmail",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Great Candles",
        "Authors": "By Hyder, Stewart D'Arcy",
        "Description": "“[Instructs] us in the finer details of a decorative craft...excellent step-by-step color photographs, starting with the most basic tapers to elegantly sculpted calla lilies that flicker...an awesomely artistic gallery of commercial...lights.”—Booklist.",
        "Category": " Crafts & Hobbies , Folkcrafts",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "A Rogue of My Own",
        "Authors": "By Lindsey, Johanna",
        "Description": "In #1 New York Times bestselling author Johanna Lindsey’s captivating regency romance, an innocent young lady’s first brush with royal court intrigue lands her at the altar alongside one of London’s most notorious rogues.For Lady Rebecca Marshall, a whirlwind of excitement begins when she becomes a maid of honor at the court of Queen Victoria. But when Rebecca unknowingly steps into the rivalry between the Queen’s spymaster and a noblewoman who uses the maids as courtly spies, she is soon entangled in a web of deceit with the charming marquis Rupert St. John. The devastatingly handsome ne’er-do-well is the cousin of Raphael Locke, with whom Rebecca was once infatuated…He’s also a secret agent of the crown who leads a double life. Certain that guileless Rebecca is spying on him, Rupert seduces her—then, forced to wed, he believes she has set a trap of the worst sort in order to marry into his powerful family! But as he comes to know Rebecca’s true heart, his vow of revenge and infidelity becomes a desire to share many passionate nights—only with his beautiful wife.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "The Elusive Bride (Black Cobra Quartet, 2)",
        "Authors": "By Laurens, Stephanie",
        "Description": "Stephanie Laurens, the phenomenal New York Times bestselling superstar is back with The Elusive Bride—the second book in her magnificent Black Cobra Quartet. Never before in print, this masterful blend of passion and intrigue follows The Untamed Bride, the first in the four-part historical romance series that Booklist calls, “fabulously entertaining.” A spellbinding tale of destiny, duty, desire, and peril—with ties to her popular Bastion Club novels and her well-loved romantic adventures featuring the endearing family of rogues, the Cynsters—The Elusive Bride confirms Laurens’s well-deserved standing as one of the genre’s premier storytellers.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Illustrated Directory of Special Forces",
        "Authors": "By Miller, David",
        "Description": "Go inside the elite and often-covert world of today's Special Forces. Superbly trained, these special operations commandos are the world's ultimate military (and para-military) tacticians. Learn about their stealthy organization, their training, uniforms and equipment, and their specially developed weapons. Fabulously illustrated with dramatic action photos, this timely reference highlights both the need for and the rapid deployment of today's Special Forces. See them in action!",
        "Category": " History , Military , Aviation",
        "Publisher": "Zenith Press",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Sex: An Oral History",
        "Authors": "By Maurer, Harry",
        "Description": "Anyone can tell you that sex is important, complex, exciting - and often difficult. We want affection? We want thrills? We want escape? We want true love? We want the raw edge?However rough the terrain, we occupy the land of sex and move in it. We keep our eyes closed or keep them open, make do with the body or use props. We're straight, we're gay, we're bi. We like sex lyrical, we like sex raunchy. We need familiarity, we crave newness. But can we communicate what we want? Do we admit it to ourselves?In this book, fifty-two people do admit their needs and communicate unforgettably while doing so. From twelve-yearold Amos Hartigan, who has yet to kiss a girl, to Judith Rothstein, age fifty-seven, who figures she has slept with a thousand men; from Jackie Dunhill, a bisexual finding liberation through S/M, to Protestant minister Eli Gregory, married and faithful for forty years, we learn about their realities and fantasies, their histories and hopes. They speak with extraordinary candor and in explicit detail about what they do. They reveal the singular landscape of their emotions: rapture, humor, pain, guilt, resignation, and passion. In many cases, they talking they do changes their lives immediately.Harry Maurer, the author of two previous oral histories, began this book because he noticed how hard it is for people to speak plainly about sex. By inviting such frank testimony from his subjects, he has cut through dogma, fear, and posturing to paint a serious and original group portrait of Americans as sexual beings. Sex: An Oral History is more illuminating than a library of how-to manuals, more erotic than a shelf of the best sex scenes in fiction.",
        "Category": " Social Science , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Mac OS X Panther Pocket Guide, 3rd Edition",
        "Authors": "By Toporek, Chuck",
        "Description": "Mac OS® X swept many Mac users off their feet with its sharp looking interface and no-nonsense, rock solid Unix® core. Well before its glow had begun to fade, the original Mac OS was replaced with Mac OS X, along with a suite of new applications and system improvements. Now there's Panther, which--like its big cat predecessor, Jaguar--brings lots of improvements to Mac OS X. Some are subtle, like faster boot time, while others are drastic but welcome, such as a much-improved Finder® and iChat? AV, which brings audio and video chat capabilities to the Mac.While it's still Mac OS X, Panther is definitely a different kind of animal, and mastering it can take a little work. The new Mac OS X Panther Pocket Guide provides the information you'll need most in a concise and easy to use format, perfect for putting you at ease with Panther. Thoroughly updated, this slim book introduces you to the fundamental concepts of Mac OS X Panther. It also features a handy \"Mac OS X Survival Guide,\" telling Mac users what's changed from Mac OS 9, and helps Windows® and Unix converts get acclimated to their new OS.Mac OS X Panther Pocket Guide provides a roadmap to the latest Mac operating system, including how to use tools as the newly revamped Finder and Dock. The book includes an overview of the System Preferences, as well as an introduction to the Unix shell and the Terminal application. It covers all the essentials, and provides instant help when you need it at your keyboard or on the road.This compact guide also includes a quick reference for creating special characters and a listing of basic keyboard commands. If you need to add or remove a user, correct preferences, log in, log out, tune the Dock, or change passwords, you'll find the information you need easily in a book that really can fit in your back pocket. With more than 250 tips and tricks, this practical, to-the-point book is a small but powerful resource for unleashing the power of Mac OS X Panther.",
        "Category": " Computers , Operating Systems , Macintosh",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Girl Who Played with Fire (Millennium Series)",
        "Authors": "By Larsson, Stieg and Keeland, Reg (TRN)",
        "Description": "Part blistering espionage thriller, part riveting police procedural, and part piercing exposé on social injustice, this second book in the Millennium series is a masterful, endlessly satisfying novel.  Mikael Blomkvist, crusading publisher of the magazine Millennium, has decided to run a story that will expose an extensive sex trafficking operation. On the eve of its publication, the two reporters responsible for the article are murdered, and the fingerprints found on the murder weapon belong to his friend, the troubled genius hacker Lisbeth Salander. Blomkvist, convinced of Salander’s innocence, plunges into an investigation. Meanwhile, Salander herself is drawn into a murderous game of cat and mouse, which forces her to face her dark past.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Vintage Crime/Black Lizard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "The Short Second Life of Bree Tanner: An Eclipse Novella (The Twilight Saga)",
        "Authors": "By Meyer, Stephenie",
        "Description": "Fans of The Twilight Saga will be enthralled by this riveting story of Bree Tanner, a character first introduced in Eclipse, and the darker side of the newborn vampire world she inhabits. In another irresistible combination of danger, mystery, and romance, Stephenie Meyer tells the devastating story of Bree and the newborn army as they prepare to close in on Bella Swan and the Cullens, following their encounter to its unforgettable conclusion.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "The 9th Judgment (Women's Murder Club)",
        "Authors": "By Patterson, James and Paetro, Maxine",
        "Description": "The most personalA young mother and her infant child are ruthlessly gunned down while returning to their car in the garage of a shopping mall. There are no witnesses, and Detective Lindsay Boxer is left with only one shred of evidence: a cryptic message scrawled across the windshield in bloodred lipstick. The most dangerousThe same night, the wife of A-list actor Marcus Dowling is woken by a cat burglar who is about to steal millions of dollars' worth of precious jewels. In just seconds there is a nearly empty safe, a lifeless body, and another mystery that throws San Francisco into hysteria. The most exciting Women's Murder Club novel everLindsay spends every waking hour working with her partner, Rich--and her desire for him threatens to tear apart both her engagement and the Women's Murder Club. Before Lindsay and her friends can piece together either case, one of the killers forces Lindsay to put her own life on the line--but is it enough to save the city? With unparalleled danger and explosive action, The 9th Judgment is James Patterson at his compelling, unstoppable best!",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "The Overton Window ",
        "Authors": "By Beck, Glenn, Balfe, Kevin (CON), Bestler, Emily (CON), and Henderson, Jack (CON)",
        "Description": "A plan to destroy America, a hundred years in the making, is about to be unleashed . . . can it be stopped? There is a powerful technique called the Overton Window that can shape our lives, our laws, and our future. It works by manipulating public perception so that ideas previously thought of as radical begin to seem acceptable over time. Move the Window and you change the debate. Change the debate and you change the country. For Noah Gardner, a twentysomething public relations executive, it’s safe to say that political theory is the furthest thing from his mind. Smart, single, handsome, and insulated from the world’s problems by the wealth and power of his father, Noah is far more concerned about the future of his social life than the future of his country. But all of that changes when Noah meets Molly Ross, a woman who is consumed by the knowledge that the America we know is about to be lost forever. She and her group of patriots have vowed to remember the past and fight for the future—but Noah, convinced they’re just misguided conspiracy-theorists, isn’t interested in lending his considerable skills to their cause. And then the world changes. An unprecedented attack on U.S. soil shakes the country to the core and puts into motion a frightening plan, decades in the making, to transform America and demonize all those who stand in the way. Amidst the chaos, many don’t know the difference between conspiracy theory and conspiracy fact—or, more important, which side to fight for. But for Noah, the choice is clear: Exposing the plan, and revealing the conspirators behind it, is the only way to save both the woman he loves and the individual freedoms he once took for granted. After five back-to-back #1 New York Times bestsellers, national radio and Fox News television host Glenn Beck has delivered a ripped-from-the-headlines thriller that seamlessly weaves together American history, frightening facts about our present condition, and a heart-stopping plot. The Overton Window will educate, enlighten, and, most important, entertain—with twists and revelations no one will see coming.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Threshold Editions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Women Food and God: An Unexpected Path to Almost Everything",
        "Authors": "By Roth, Geneen",
        "Description": "Geneen Roth’s 1991 bestseller, When Food Is Love , spoke to a wide audience—including Oprah Winfrey, who embraced Roth’s empowering message. Since then, Roth has taken the sum total of her experience and combined it with spirituality, psychology, and self-awareness to explain women’s true hunger in Women, Food, and God . .Roth’s approach to eating is the same as any addiction—it is an activity to avoid feeling emotions. From the first page, readers will be struck by Roth’s intelligence, humor, and sensitivity, as she traces the path of overeating from its subtle beginning through its logical end. Whether the drug is booze or brownies, the problem is the same: opting out of life. Roth’s premier advice is eat anything you want . She powerfully argues for personal investigation and urges readers to pay attention to what they truly need—and it usually cannot be found in a supermarket. She provides seven basic guidelines for eating (the most important is to never diet) and shares reassuring, practical advice that has over the years helped thousands of women who have attended her highly successful seminars and workshops..Truly a thinking woman’s guide to eating—and an anti-diet book— women everywhere will find insights and revelations on every page. .",
        "Category": " Self-help , Eating Disorders & Body Image",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Dead in the Family (Sookie Stackhouse/True Blood, Book 10)",
        "Authors": "By Harris, Charlaine",
        "Description": "View our feature on Charlaine Harris’s Dead in the Family.   Visit our Sookie Stackhouse series feature page.    The #1 New York Times bestselling Sookie Stackhouse series- the basis for HBO(r)'s True Blood-  continues!  After enduring torture and the loss of loved ones during the brief but deadly Faery War,   Sookie Stackhouse is hurt and she's angry. Just about the only bright spot in her life is the love she thinks she feels for   vampire Eric Northman. But he's under scrutiny by the new Vampire King because of their relationship. And as the   political implications of the Shifters coming out are beginning to be felt, Sookie's connection to the Shreveport pack   draws her into the debate. Worst of all, though the door to Faery has been closed, there are still some Fae on the   human side-and one of them is angry at Sookie. Very, very angry...",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Sizzling Sixteen (Stephanie Plum Novels)",
        "Authors": "By Evanovich, Janet",
        "Description": "Trenton, New Jersey, bounty hunter Stephanie Plum has inherited a \"lucky\" bottle from her Uncle Pip. Problem is, Uncle Pip didn't specify if the bottle brought good luck or bad luck. . . .BAD LUCK:Vinnie, of Vincent Plum Bail Bonds, has run up a gambling debt of $786,000 with mobster Bobby Sunflower and is being held until the cash can be produced. Nobody else will pay to get Vinnie back, leaving it up to Stephanie, office manager Connie, and file clerk Lula to raise the money if they want to save their jobs.GOOD LUCK:Being in the business of tracking down people, Stephanie, Lula, and Connie have an advantage in finding Vinnie. If they can rescue him, it will buy them some time to raise the cash.BAD LUCK:Finding a safe place to hide Vinnie turns out to be harder than raising $786,000. Vinnie's messing up Mooner's vibe, running up pay-per-view porn charges in Ranger's apartment, and making Stephanie question genetics.GOOD LUCK:Between a bonds office yard sale that has the entire Burg turning out, Mooner's Hobbit-Con charity event, and Uncle Pip's lucky bottle, they just might raise enough money to save the business, and Vinnie, from ruin.BAD LUCK:Saving Vincent Plum Bail Bonds means Stephanie can keep being a bounty hunter. In Trenton, this involves hunting down a man wanted for polygamy, a turnpike toilet paper bandit, and a drug dealer with a pet alligator named Mr. Jingles.GOOD LUCK:The job of bounty hunter comes with perks in the guise of Trenton's hottest cop, Joe Morelli, and the dark and dangerous security expert, Ranger. With any luck at all, Uncle Pip's lucky bottle will have Stephanie getting lucky---the only question is . . . with whom?Sizzling Sixteen . . . so hot, the pages might spontaneously combust!",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "The Lion (A John Corey Novel, 5)",
        "Authors": "By DeMille, Nelson",
        "Description": "In this eagerly awaited follow-up to The Lion's Game, John Corey, former NYPD Homicide detective and special agent for the Anti-Terrorist Task Force, is back. And, unfortunately for Corey, so is Asad Khalil, the notorious Libyan terrorist otherwise known as \"The Lion.\" Last we heard from him, Khali had claimed to be defecting to the US only to unleash the most horrific reign of terrorism ever to occur on American soil. While Corey and his partner, FBI agent Kate Mayfield, chased him across the country, Khalil methodically eliminated his victims one by one and then disappeared without a trace.Now, years later, Khalil has returned to America to make good on his threats and take care of unfinished business. \"The Lion\" is a killing machine once again loose in America with a mission of revenge, and John Corey will stop at nothing to achieve his own goal -- to find and kill Khahil.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Storm Prey",
        "Authors": "By Sandford, John",
        "Description": "The brilliant new Lucas Davenport thriller from the #1 New York Times best-selling author.  \"Sandford's track record as a best-selling author is amazing, but it's not an accident,\" wrote Booklist of Wicked Prey. \"His plotting is sharp, his villains are extraordinarily layered, and his good guys are always evolving. And this time, there's a storm brewing...Very early, 4:45, on a bitterly cold Minnesota morning, three big men burst through the door of a hospital pharmacy, duct-tape the hands, feet, mouth, and eyes of two pharmacy workers, and clean the place out. But then things swiftly go bad, one of the workers dies, and the robbers hustle out to their truck-and find themselves for just one second face-to-face with a blond woman in the garage: Weather Karkinnen, surgeon, wife of an investigator named Lucas Davenport. Did she see enough? Can she identify them? Gnawing it over later, it seems to them there is only one thing they can do: Find out who she is, and eliminate the only possible witness...",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Diagnostic and Statistical Manual of Mental Disorders, 4th Edition, Text Revision (DSM-IV-TR)",
        "Authors": "By American Psychiatric Association (COR)",
        "Description": "Since the DSM-IV® was published in 1994, we've seen many advances in our knowledge of psychiatric illness. This Text Revision incorporates information culled from a comprehensive literature review of research about mental disorders published since DSM-IV® was completed in 1994. Updated information is included about the associated features, culture, age, and gender features, prevalence, course, and familial pattern of mental disorders. The DSM-IV-TR® brings this essential diagnostic tool up-to-date, to promote effective diagnosis, treatment, and quality of care. Now you can get all the essential diagnostic information you rely on from the DSM-IV® along with important updates not found in the 1994 edition.Stay current with important updates to the DSM-IV-TR®:  ? Benefit from new research into Schizophrenia, Asperger's Disorder, and other conditions? Utilize additional information about the epidemiology and other facets of DSM conditions? Update ICD-9-CM codes implemented since 1994 (including Conduct Disorder, Dementia, Somatoform Disorders) DSM-IV-TR®, the handheld version of the Diagnostic and Statistical Manual of Mental Disorders, Fourth Edition, Text Revision, is now available for both Palm OS and PocketPC handhelds. This Text Revision incorporates information culled from a comprehensive literature review of research about mental disorders and includes associated features, culture, age, and gender features, prevalence, course, and familial pattern of mental disorders. And with Skyscape's patented smARTlink? technology, DSM-IV-TR can easily cross-index with other clinical and drug prescription products from Skyscape to provide a powerful and integrated source of clinical information that you can carry with you wherever you go!",
        "Category": " Medical , Psychiatry , General",
        "Publisher": "American Psychiatric Association",
        "Price Starting With ($)": "8.3",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Passage: A Novel (Book One of The Passage Trilogy)",
        "Authors": "By Cronin, Justin",
        "Description": "NEW YORK TIMES BESTSELLER • SOON TO BE A FOX TV SERIES • This thrilling novel kicks off what Stephen King calls “a trilogy that will stand as one of the great achievements in American fantasy fiction.”NAMED ONE OF THE TEN BEST NOVELS OF THE YEAR BY TIME AND ONE OF THE BEST BOOKS OF THE YEAR BY The Washington Post • Esquire • U.S. News & World Report • NPR/On Point • St. Louis Post-Dispatch • BookPage • Library Journal  “It happened fast. Thirty-two minutes for one world to die, another to be born.”  An epic and gripping tale of catastrophe and survival, The Passage is the story of Amy—abandoned by her mother at the age of six, pursued and then imprisoned by the shadowy figures behind a government experiment of apocalyptic proportions. But Special Agent Brad Wolgast, the lawman sent to track her down, is disarmed by the curiously quiet girl and risks everything to save her. As the experiment goes nightmarishly wrong, Wolgast secures her escape—but he can’t stop society’s collapse. And as Amy walks alone, across miles and decades, into a future dark with violence and despair, she is filled with the mysterious and terrifying knowledge that only she has the power to save the ruined world. Look for the entire Passage trilogy: THE PASSAGE | THE TWELVE | THE CITY OF MIRRORS Praise for The Passage “[A] blockbuster.”—The New York Times Book Review “Mythic storytelling.”—San Francisco Chronicle “Magnificent . . . Cronin has taken his literary gifts, and he has weaponized them. . . . The Passage can stand proudly next to Stephen King’s apocalyptic masterpiece The Stand, but a closer match would be Cormac McCarthy’s The Road: a story about human beings trying to generate new hope in a world from which all hope has long since been burnt.”—Time “The type of big, engrossing read that will have you leaving the lights on late into the night.”—The Dallas Morning News “Addictive.”—Men’s Journal “Cronin’s unguessable plot and appealing characters will seize your heart and mind.”—Parade",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Eclipse (Twilight Sagas)",
        "Authors": "By Meyer, Stephenie",
        "Description": "Readers captivated by Twilight and New Moon will eagerly devour the paperback edition Eclipse, the third book in Stephenie Meyer's riveting vampire love saga. As Seattle is ravaged by a string of mysterious killings and a malicious vampire continues her quest for revenge, Bella once again finds herself surrounded by danger. In the midst of it all, she is forced to choose between her love for Edward and her friendship with Jacob --- knowing that her decision has the potential to ignite the ageless struggle between vampire and werewolf. With her graduation quickly approaching, Bella has one more decision to make: life or death. But which is which?",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Spoken from the Heart",
        "Authors": "By Bush, Laura",
        "Description": "In this brave, beautiful, and deeply personal memoir, Laura Bush, one of our most beloved and private first ladies, tells her own extraordinary story.Born in the boom-and-bust oil town of Midland, Texas, Laura Welch grew up as an only child in a family that lost three babies to miscarriage or infant death. She vividly evokes Midland's brash, rugged culture, her close relationship with her father, and the bonds of early friendships that sustain her to this day. For the first time, in heart-wrenching detail, she writes about the devastating high school car accident that left her friend Mike Douglas dead and about her decades of unspoken grief.  When Laura Welch first left West Texas in 1964, she never imagined that her journey would lead her to the world stage and the White House. After graduating from Southern Methodist University in 1968, in the thick of student rebellions across the country and at the dawn of the women's movement, she became an elementary school teacher, working in inner-city schools, then trained to be a librarian. At age thirty, she met George W. Bush, whom she had last passed in the hallway in seventh grade. Three months later, \"the old maid of Midland married Midland's most eligible bachelor.\" With rare intimacy and candor, Laura Bush writes about her early married life as she was thrust into one of America's most prominent political families, as well as her deep longing for children and her husband's decision to give up drinking. By 1993, she found herself in the full glare of the political spotlight. But just as her husband won the Texas governorship in a stunning upset victory, her father, Harold Welch, was dying in Midland.  In 2001, after one of the closest elections in American history, Laura Bush moved into the White House. Here she captures presidential life in the harrowing days and weeks after 9/11, when fighter-jet cover echoed through the walls and security scares sent the family to an underground shelter. She writes openly about the White House during wartime, the withering and relentless media spotlight, and the transformation of her role as she began to understand the power of the first lady. One of the first U.S. officials to visit war-torn Afghanistan, she also reached out to disease-stricken African nations and tirelessly advocated for women in the Middle East and dissidents in Burma. She championed programs to get kids out of gangs and to stop urban violence. And she was a major force in rebuilding Gulf Coast schools and libraries post-Katrina. Movingly, she writes of her visits with U.S. troops and their loved ones, and of her empathy for and immense gratitude to military families.  With deft humor and a sharp eye, Laura Bush lifts the curtain on what really happens inside the White House, from presidential finances to the 175-year-old tradition of separate bedrooms for presidents and their wives to the antics of some White House guests and even a few members of Congress. She writes with honesty and eloquence about her family, her public triumphs, and her personal tribulations. Laura Bush's compassion, her sense of humor, her grace, and her uncommon willingness to bare her heart make this story revelatory, beautifully rendered, and unlike any other first lady's memoir ever written.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Scribner",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "400 Calorie Fix : Slim Is Simple : 400 Ways to Eat 400 Calorie Meals",
        "Authors": "By Liz Vaccariello, Mindy Hermann",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press, Inc.",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Savor the Moment (The Bride Quartet, Book 3)",
        "Authors": "By Roberts, Nora",
        "Description": "New Love takes the cake in the third novel in #1 New York Times bestselling author Nora Roberts's Bride Quartet—in a stunning French flap  edition  Wedding baker Laurel McBane is surrounded by romance working at Vows wedding  planning company with her best friends Parker, Emma, and Mac. But she's too low-key to appreciate all the luxuries  that their clients seem to long for. What she does appreciate is a strong, intelligent man, a man just like Parker's  older brother Delaney, on whom she's had a mega-crush since childhood. But some infatuations last  longer than others, and Laurel is convinced that the Ivy League lawyer is still out of her reach. Plus, Del is too  protective of Laurel to ever cross the line with her-or so she thinks. When Laurel's quicksilver moods get the better  of her-leading to an angry, hot, all-together mind-blowing kiss with Del—she'll have to quiet the doubts in her  mind to turn a moment of passion into forever...Don't miss the other books in the Bride QuartetVision in WhiteBed of RosesHappy Ever After",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Cook This, Not That!: Kitchen Survival Guide",
        "Authors": "By Zinczenko, David and Goulding, Matt",
        "Description": "Did you know the average dinner from a chain restaurant costs nearly $35 a person and contains more than 1,200 calories? That's hard on your wallet and your waistline, and few people understand this better than the authors of Eat This, Not That! After years of helping consumers navigate America's daunting culinary landscape – and literally thousands of weight-loss success stories – Dave and Matt have finally turned their nutritional savvy to the place with the greatest impact – your kitchen. The hundreds of recipes contained inside this book will help you and your loved ones eliminate body fat, get in shape, and lead fitter, happier lives. But make no mistake – this is no rice-and-tofu cookbook. The genius of Cook This, Not That! is that it teaches you how to save hundreds – sometimes thousands – of calories by recreating America's most popular restaurant dishes, including Outback Steakhouse's Roasted Filet with Port Wine Sauce, Uno Chicago Grill's Individual Deep Dish Pizza, and Chili's Fire Grilled Chicken Fajita. Alongside this you'll find other priceless advice, such as:· The 37 Ways to Cook a Chicken Breast, A Dozen 10-Minute Pasta Sauces, The Ultimate Sandwich Matrix, and other on-the-go cooking tips.· Scorecards that let you easily compare the nutritional quality of the carbohydrates, fats, and proteins that go into building every meal you eat.  · The truth about how seemingly healthy foods such as wheat bread, salmon, and low-fat snacks are secretly sabotaging your health.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Dead And Gone (Sookie Stackhouse/True Blood, Book 9)",
        "Authors": "By Harris, Charlaine",
        "Description": "In the ninth novel in the #1 New York Times bestselling Sookie Stackhouse series, the werewolves and shifters come out of the closet and throw the small town of Bon Temps into a tailspin...Except for cocktail waitress Sookie Stackhouse, folks in Bon Temps, Louisiana, knew little about vamps—and nothing about Weres. Until now. The Weres and shifters have finally revealed their existence to the ordinary world, and the backlash may have claimed the life of someone Sookie knew. But her determination to find out who is responsible for the murder is put aside in the face of a far greater danger. A race of unhuman beings—older, more powerful, and more secretive than vampires or werewolves—is preparing for war. And Sookie will find herself an all-too-human pawn in their battle...",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Committed: A Skeptic Makes Peace with Marriage",
        "Authors": "By Gilbert, Elizabeth",
        "Description": "The #1 New York Times bestselling follow-up to Eat, Pray, Love--an intimate and erudite celebration of love—from the author of Big Magic: Creative Living Beyond Fear.At the end of her bestselling memoir Eat, Pray, Love, Elizabeth Gilbert fell in love with Felipe, a Brazilian-born man of Australian citizenship who'd been living in Indonesia when they met. Resettling in America, the couple swore eternal fidelity to each other, but also swore to never, ever, under any circumstances get legally married. (Both were survivors of previous bad divorces. Enough said.) But providence intervened one day in the form of the United States government, which-after unexpectedly detaining Felipe at an American border crossing-gave the couple a choice: they could either get married, or Felipe would never be allowed to enter the country again. Having been effectively sentenced to wed, Gilbert tackled her fears of marriage by delving into this topic completely, trying with all her might to discover through historical research, interviews, and much personal reflection what this stubbornly enduring old institution actually is. Told with Gilbert's trademark wit, intelligence and compassion, Committed attempts to \"turn on all the lights\" when it comes to matrimony, frankly examining questions of compatibility, infatuation, fidelity, family tradition, social expectations, divorce risks and humbling responsibilities. Gilbert's memoir is ultimately a clear-eyed celebration of love with all the complexity and consequence that real love, in the real world, actually entails.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "A Framework for Understanding Poverty 4th Edition",
        "Authors": "By Ruby K. Payne",
        "Description": "",
        "Category": "",
        "Publisher": "aha! Process, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Eat This Not That! 2010: The No-Diet Weight Loss Solution",
        "Authors": "By Zinczenko, David and Goulding, Matt",
        "Description": "Eat All Your Favorite Foods—And Watch the Pounds Disappear!Two years after the runaway success of the original Eat This, Not That!, co-authors Matt and Dave noticed an interesting trend: Restaurants were actually cleaning up their menus! With consumers avoiding the country's worst calorie offenses, some restaurants saw fit to remove them from the menu entirely. Consider this:· After Chili's Awesome Blossom took the runner-up spot on the \"Worst Foods in America\" list, Chili's removed the appetizer from their menu entirely.· Pepperidge Farm followed suit after being placed on the Worst Foods list and discontinued their Roasted Chicken Pot Pie.· When Jamba Juice earned a citation on the Worst Drinks in America list, the chain stopped serving the largest size of their Chocolate Moo'd smoothie and recommitted itself to becoming one of the healthiest restaurant chains in the nation. The problem is, as the old crop of calorie atrocities were eliminated, a new army of gut-bombs emerged in their place. That's why the authors created Eat This, Not That! 2010, to empower you with the knowledge to battle a food industry bent on sabotage your waistline with unwanted and unnecessary calories. In this new-and-expanded edition, you'll find fresh restaurant and supermarket comparisons, an encyclopedia of food packaging lies, and the invaluable guide to eating healthy on a budget. Essentially you'll learn how to make effortless food swaps that will help you strip away 10, 20, 30 pounds or more.Did you know:· Choosing Prime Rib over Baby Back Ribs at Outback will save you more than 2,000 calories?· You can save nearly 500 calories and more than 20 grams of fat just by ordering your banana split at Dairy Queen instead of Baskin-Robbins?· A Stouffer's White Meat Chicken Pot Pie has as much saturated fat as 6 scoops of ice cream? (Choose our alternative and save more than 900 calories!)",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Frankenstein: Lost Souls",
        "Authors": "By Koontz, Dean R.",
        "Description": "#1 New York Times bestselling author Dean Koontz brings his fertile imagination and unparalleled storytelling abilities to one of the most timeless—and terrifying—creations in all of fiction: the legend of Frankenstein. In Lost Souls, Koontz puts a singular twist on this classic tale of ambition and science gone wrong and forges a new legend uniquely suited to our times—a story of revenge, redemption, and the razor-thin line that separates humanity from inhumanity as we consider a new invitation to apocalypse.  The work of creation has begun again. Only now things will be different. Victor Leben, once Frankenstein, has not only seen the future—he’s ready to populate it. Using stem cells, “organic” silicon circuitry, and nanotechnology, he will engender a race of superhumans—the perfect melding of flesh and machine. With a powerful, enigmatic backer eager to see his dream come to fruition and a secret location where the enemies of progress can’t find him, Victor is certain that this time, nothing and no one can stop him.It is up to five people to prove him wrong. In their hands rests nothing less than the survival of humanity itself. They are drawn together in different ways, by omens sinister and wondrous, to the same shattering conclusion: Two years after they saw him die, the man they knew as Victor Helios lives on. Detectives Carson O’Connor and Michael Maddison; Victor’s engineered wife, Erika 5, and her companion Jocko; and the original Victor’s first creation, the tormented Deucalion, have all arrived at a small Montana town where their old alliance will be renewed—and tested—by forces from within and without, and where the dangers they face will eclipse any they have yet encountered. Yet in the midst of their peril, love will blossom, and joy, and they will discover sources of strength and perseverance they could not have imagined. They will need all these resources, and more. For a monumental battle is about to commence that will require all their ingenuity and courage, as it defines what we are to be . . . and if we are to be at all.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Flat Belly Diet!",
        "Authors": "By Vaccariello, Liz (EDT), Sass, Cynthia (EDT), and Katz, David L. (FRW)",
        "Description": "Join the million-plus people who have found the answer to losing their belly fat while eating satisfying and delicious foods. With the Flat Belly Diet! you can: - Lose inches in just 4 days- Drop up to 15 pounds in 32 days- Boost your energy as the weight falls off! Prevention, America's most trusted healthy-living magazine, presents the New York Times-bestseller Flat Belly Diet in paperback--now with a new foreword by Dr. David L. Katz describing new research about the many health and weight loss benefits of this amazing eating plan. Enjoy delicious dishes such as Seared Wild Salmon with Mango Salsa, Slow Cooker Chili, and Pumpkin-Maple Cheesecake--and you will lose belly inches and greatly enhance your likelihood of living a longer and healthier life.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Master Your Metabolism Cookbook",
        "Authors": "By Michaels, Jillian",
        "Description": "COOKING COMPANION TO MASTER YOUR METABOLISM Master Your Metabolism, the phenomenal diet bestseller by Jillian Michaels, has been help­ing millions of people become hotter and healthier without their having to obsess over food or exercise. The key is ditching fad diets and chemical-filled Franken-foods in order to optimize your metabolic function and maximize your overall health.  Through the Master Your Metabolism plan, Jillian has taught readers how to balance their hormones naturally so their bodies become energetic, thriving, fat-burning machines. Now Jillian makes it even easier for you by bringing the Master program right into your kitchen. With more than 125 recipes specifically designed for the Master Diet and including health tips tailored to enhance your nutrition and weight loss, The Master Your Metabolism Cookbook will help make living a long, healthy life easier—and tastier.  Jillian understands that your life is busy and your time is precious. She believes that being healthy shouldn’t financially strap you. That’s why she designed these recipes with a professional recipe developer to provide you  with healthy bites for when you’re in a hurry. The Master Your Metabolism Cookbook deliv­ers simple, great-tasting meals with minimal ingredients that can be made in thirty min­utes or less! Mastering healthy eating and living has never been easier.",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "Harmony",
        "Price Starting With ($)": "15.98",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Fearless: Imagine Your Life Without Fear",
        "Authors": "By Lucado, Max",
        "Description": "Each sunrise seems to bring fresh reasons for fear.They're talking layoffs at work, slowdowns in the economy, flare-ups in the Middle East, turnovers at headquarters, downturns in the housing market, upswings in global warming. The plague of our day, terrorism, begins with the word terror. Fear, it seems, has taken up a hundred-year lease on the building next door and set up shop. Oversized and rude, fear herds us into a prison of unlocked doors. Wouldn't it be great to walk out?Imagine your life, wholly untouched by angst. What if faith, not fear, was your default reaction to threats? If you could hover a fear magnet over your heart and extract every last shaving of dread, insecurity, or doubt, what would remain? Envision a day, just one day, where you could trust more and fear less.Can you imagine your life without fear?",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Aftershock: Protect Yourself and Profit in the Next Global Financial Meltdown",
        "Authors": "By Wiedemer, David, Wiedemer, Robert A., and Spitzer, Cindy S.",
        "Description": "\"A practical guide to preparing for the next phase of the financial meltdownFrom the authors who were the first to predict Phase I of our current economic downturn-in their landmark 2006 book, America's Bubble Economy-comes their insightful sequel discussing their predictions for the next phase of the Bubble Economy.It may seem like the worst has come and gone, but it hasn't. With their proven track record of accurate predictions-which most financial professionals and economists missed-the authors explain how and why the next phase of the financial meltdown is about to hit. Things are not going back to how they were before. Instead, we are moving through uncharted territory, with new challenges and opportunities that few people can anticipate. Written ina straightforward and accessible style, Aftershock shows readers how to seek safety and profits in these dynamic economic conditions.Discusses how to protect assets, businesses, and jobs before and during the second wave of financial meltdownProvides clear and accurate advice on how to profit from the collapsing bubblesOffer focused guidance regarding real estate, which will continue to be a pressing concern for manyThe authors' first book was chosen by Kiplinger's as one of the 30 Best Business Books of2006, and its accuracy has been hailed by Paul Farrell of Dow Jones MarketWatch when he said \"America's Bubble Economy's Predictions, though ignored, were accurate.\" Don't miss out on these time tested author's proven advice for how to mange your money during the coming financial meltdown\"--Provided by publisher.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "The CalorieKing Calorie, Fat & Carbohydrate Counter 2010",
        "Authors": "By Borushek, Allan",
        "Description": "Lists the number of calories, fat grams, and carbohydrates in basic, brand-name, and fast foods.",
        "Category": " Health & Fitness , Diet & Nutrition , Food Content Guides",
        "Publisher": "Family Health Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "The Spy (An Isaac Bell Adventure)",
        "Authors": "By Cussler, Clive and Scott, Justin",
        "Description": "Detective Isaac Bell, hero of The Chase and The Wrecker, returns in the remarkable new adventure from the #1 New York Times-bestselling author. It is 1908, and international tensions are mounting as the world plunges toward war. When a brilliant American battleship gun designer dies in a sensational apparent suicide, the man's grief-stricken daughter turns to the legendary Van Dorn Detective Agency to clear her father's name. Van Dorn puts his chief investigator on the case, and Isaac Bell soon realizes that the clues point not to suicide but to murder. And when more suspicious deaths follow, it becomes clear that someone-an elusive spy-is orchestrating the destruction of America's brightest technological minds... and the murders all connect to a top- secret project called Hull 44. But that is just the beginning. As the intrigue deepens, Bell will find himself pitted against German, Japanese, and British spies, in a mission that encompasses dreadnought battleships, Teddy Roosevelt's Great White Fleet, Chinatown, Hell's Kitchen, and the Brooklyn Navy Yard. Isaac Bell has certainly faced perilous situations before, but this time it is more than the future of his country that's at stake- it's the fate of the world.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Mackenzie's Heroes: Mackenzie's PleasureMackenzie's Magic (NYT bestselling Author)",
        "Authors": "By Howard, Linda",
        "Description": "Mackenzie's PleasureNavy SEAL Zane Mackenzie was a pro. No mission had ever gotten the better of him—until now. Saving the ambassador's gorgeous daughter, Barrie Lovejoy, had been textbook—except for their desperate night of passion. And though his job as a soldier had ended with her freedom, his duties as a husband had only just begun. For he would sooner die than let the enemy harm the mother of his child.Mackenzie's MagicTalented trainer Maris Mackenzie was wanted for horse theft, but with no memory of that fateful day, she had little chance of proving her innocence or eluding the villains behind the prize stallion's disappearance. Her only hope for salvation? The stranger in her bed.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Bullet (Anita Blake, Vampire Hunter)",
        "Authors": "By Hamilton, Laurell K.",
        "Description": "Watch a video                    The music came back up and the next group of little girls, slightly older, came out. There was a lot of that in the next hour and change. I liked dance, and it was no reflection on the kids, but my will to live began to seep away on about the fifth group of sequined children...  Anita Blake is back in St. Louis and trying to live a normal life-as normal as possible for someone who is a legal vampire executioner and a U. S. Marshal. There are lovers, friends and their children, school programs to attend. In the midst of all the ordinary happiness a vampire from Anita's past reaches out. She was supposed to be dead, killed in an explosion, but the Mother of All Darkness is the first vampire, their dark creator. It's hard to kill a god. This dark goddess has reached out to her here-in St. Louis, home of everyone Anita loves most. The Mother of All Darkness has decided she has to act now or never, to control Anita, and all the vampires in America.  The Mother of All Darkness believes that the triumvirate created by master vampire Jean-Claude with Anita and the werewolf Richard Zeeman has enough power for her to regain a body and to immigrate to the New World. But the body she wants to possess is already taken. Anita is about to learn a whole new meaning to sharing her body, one that has nothing to do with the bedroom. And if the Mother of All Darkness can't succeed in taking over Anita's body for herself, she means to see that no one else has the use of it, ever again.  Even Belle Morte, not always a friend to Anita, has sent word:  \"Run if you can...\"",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Physical Examination and Health Assessment (Jarvis, Physical Examination & Health Assessment)",
        "Authors": "By Jarvis, Carolyn",
        "Description": "With a clear, student-friendly approach, this text provides a solid understanding of how to perform a health assessment. Head-to-toe presentations show the steps of a physical examination in a logical sequence. Detailed illustrations, summary checklists, and new learning resources ensure that you learn all the skills you need to know. It's easy to see why this text is, far and away, #1 in this market!Clear, approachable style of writing.Over 1,000 full-color illustrations present anatomy and physiology plus examination techniques.A two-column format distinguishes normal findings from abnormal findings, using color, step-by-step photos.Summary checklists in each body system chapter provide a quick review of exam steps.Documentation examples show the charting of normal findings.Extensive coverage of culture reflects the importance of diversity and cultural awareness.Nursing Diagnoses reflecting the most recent NANDA Taxonomy II terminology.Lifespan content is integrated throughout the text to show common variations for all age groups.Developmental Care sections cover age-specific content for pediatric, pregnant, and older adult patients.Clinical case studies cover focused assessment techniques for patients of different ages in different clinical situations.Spanish language translation chart includes key phrases for better communication during a physical examination.More than 100 color photographs and drawings are added.Abnormal Findings section, in full-color, large-photo atlas format, now differentiates abnormal findings for the student from those for advanced practice.Promoting a Healthy Lifestyle boxes highlight essential health promotion material, based on Healthy People 2010 guidelines.Unique Reassessment of the Hospitalized Patient chapter provides a focus for hospital-based assessments.Functional Assessment of the Older Adult chapter covers the special assessment techniques and findings for geriatric clients.A companion CD-ROM helps you apply your skills to realistic patient scenarios, with additional in-depth case studies, a complete head-to-toe examination video, printable health promotion handouts, heart and lung sounds, new bedside reassessment, and the 20 Most Common Conditions.",
        "Category": " Medical , Nursing , Assessment & Diagnosis",
        "Publisher": "Saunders",
        "Price Starting With ($)": "7.89",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Whiplash (An FBI Thriller)",
        "Authors": "By Coulter, Catherine",
        "Description": "Yale professor Dr. Edward Kender's father is undergoing chemotherapy when the supply of a critical accompanying drug suddenly runs out. Unwilling to accept the drug company's disingenuous excuse of production line problems, Dr. Kender hires private investigator Erin Pulaski to prove that something more sinister is going on at Schiffer Hartwin. Meanwhile, in Maryland, married FBI agents Lacey Sherlock and Dillon Savich are investigating a rather unusual case: Senator David Hoffman is experiencing a ghostly apparition with possible malicious intent. The case is baffling, and Sherlock and Savich are not sure what to believe, even after witnessing the disturbing specter for themselves. They're no closer to cracking the case when a call comes in from Connecticut: A top foreign Schiffer Hartwin employee has been found murdered behind the drug company's U.S. headquarters. Unbeknownst to the FBI, Erin Pulaski had uncovered a bombshell in her investigation: The Culovort shortage is set to bring in a windfall profit in excess of two billion dollars. Upon learning of the murder, Erin is certain it has something to do with her findings, but she risks exposing herself by coming forward. As the feds move in, the case becomes even more complicated for Erin, since the murder of a foreign national on federal land can mean only that the pharmaceutical house has a secret of epic proportions-one it would do anything to keep hidden.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Step-Up to Medicine",
        "Authors": "By Agabegi, Steven S. and Agabegi, Elizabeth, M.d.",
        "Description": "Written especially for third-year medical students, this review and study guide covers the range of pathology encountered during the internal medicine clerkship and the corresponding end-rotation NBME shelf examination. The book blends a bulleted outline format with only the necessary amount of explanatory detail, with material organized by body system. Case questions serve as a self-assessment tool, allowing students to think through clinical scenarios without answer choices influencing their thought process. This second edition contains margin key facts and pearls. In light of the recent emphasis on evidence-based medicine, there is a new section in the appendix introducing the basics of biostatistics, and new material on key concepts required for critically appraising the medical literature. There is a new test presenting 100 USMLE-style clinical vignette-based questions with answers. Color clinical photos and b&w medical images are included. The book is for students preparing for the medicine clerkship, shelf exams, and the USMLE Step 2. Author information is not given. Annotation ©2008 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Medical , Test Preparation & Review",
        "Publisher": "Lippincott Williams & Wilkins",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Flat Belly Diet! Cookbook: 200 New MUFA Recipes",
        "Authors": "By Vaccariello, Liz and Sass, Cynthia (EDT)",
        "Description": "Belly fat is not only unsightly, it's deadly; it has been linked to a long list of adverse health conditions, including heart disease, diabetes, and breast cancer. Prevention's Flat Belly Diet, a revolutionary plan that's already helped more than one million people lose weight around their middles, may help target dangerous belly fat with monounsaturated fats (better known as MUFAs)—found in delicious foods like nuts and seeds, vegetable oils, olives, avocados, and dark chocolate.   \"The food...tastes so good, and there's so much of it!\"   On the Flat Belly Diet, it's important to enjoy these foods, in the right amounts, with every meal. The Flat Belly Diet! Cookbook - by Liz Vaccariello with Cynthia Sass, MPH, RD - makes that easy. All of the recipes were carefully developed to make sure every meal includes just the right amount of MUFAs and meets the plan's 400-calorie guideline, so readers can mix and match meals to suit their taste. And there's no need to count calories. All the work has already been done!   \"I had to get over all those years of denying myself.... I'm so excited by this diet.\"   Packed with 200 dishes that feature these scrumptious fat-fighting MUFA-rich foods, as well as more than 50 lush photographs, this book gives readers plenty to whet their appetites: -Great-to-wake-up-to dishes like Banana Pancakes with Walnut Honey and Eggs Florentine with Sun-Dried Tomato Pesto -International favorites like Thai Corn and Crab Soup and Caribbean Chicken Salad -Cozy comfort food like Spaghetti with Roasted Cauliflower and Olives and Turkey Meat Loaf with Walnuts and Sage -Quick, satisfying snacks like Tex-Mex Snack Mix, Peanut Butter Spirals, and Nutty Chicken Nuggets -Sweet treats like Super-Rich Chocolate Cake with Maple Frosting and Peach and Blueberry Tart with Pecan Crust",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Stones into Schools: Promoting Peace with Books, Not Bombs, in Afghanistan and Pakistan",
        "Authors": "By Bryan, Mike and Mortenson, Greg",
        "Description": "From the author of the #1 bestseller Three Cups of Tea, the continuing story of this determined humanitarian’s efforts to promote peace through education     In this dramatic first-person narrative, Greg Mortenson picks up where Three Cups of Tea left off in 2003, recounting his relentless, ongoing efforts to establish schools for girls in Afghanistan; his extensive work in Azad Kashmir and Pakistan after a massive earthquake hit the region in 2005; and the unique ways he has built relationships with Islamic clerics, militia commanders, and tribal leaders. He shares for the first time his broader vision to promote peace through education and literacy, as well as touching on military matters, Islam, and women?all woven together with the many rich personal stories of the people who have been involved in this remarkable two-decade humanitarian effort.     Since the 2006 publication of Three Cups of Tea, Mortenson has traveled across the U.S. and the world to share his vision with hundreds of thousands of people. He has met with heads of state, top military officials, and leading politicians who all seek his advice and insight. The continued phenomenal success of Three Cups of Tea proves that there is an eager and committed audience for Mortenson’s work and message.",
        "Category": " Political Science , Human Rights",
        "Publisher": "Viking",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "In Defense of Food: An Eater's Manifesto",
        "Authors": "By Pollan, Michael",
        "Description": "#1 New York Times Bestseller from the author of How to Change Your Mind, The Omnivore's Dilemma, and Food Rules  Food. There's plenty of it around, and we all love to eat it. So why should anyone need to defend it? Because in the so-called Western diet, food has been replaced by nutrients, and common sense by confusion--most of what we’re consuming today is longer the product of nature but of food science. The result is what Michael Pollan calls the American Paradox: The more we worry about nutrition, the less healthy we see to become. With In Defense of Food, Pollan proposes a new (and very old) answer to the question of what we should eat that comes down to seven simple but liberating words: \"Eat food. Not too much. Mostly plants.\" Pollan’s bracing and eloquent manifesto shows us how we can start making thoughtful food choices that will enrich our lives, enlarge our sense of what it means to be healthy, and bring pleasure back to eating. \"Michael Pollan [is the] designated repository for the nation's food conscience.\" -Frank Bruni, The New York Times \" A remarkable volume . . . engrossing . . . [Pollan] offers those prescriptions Americans so desperately crave.\" -The Washington Post \"A tough, witty, cogent rebuttal to the proposition that food can be redced to its nutritional components without the loss of something essential... [a] lively, invaluable book.\" --Janet Maslin, The New York Times \"In Defense of Food is written with Pollan's customary bite, ringing clarity and brilliance at connecting the dots.\" -The Seattle TimesMichael Pollan’s most recent book Cooked: A Natural History of Transformation--the story of our most trusted food expert’s culinary education--was published by Penguin Press in April 2013, and in 2016 it serves as the inspiration for a four-part docuseries on Netflix by the same name.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Private",
        "Authors": "By Patterson, James and Paetro, Maxine",
        "Description": "The police can't help youFormer Marine helicopter pilot Jack Morgan runs Private, a renowned investigation company with branches around the globe. It is where you go when you need maximum force and maximum discretion. The secrets of the most influential men and women on the planet come to Jack daily--and his staff of investigators uses the world's most advanced forensic tools to make and break their cases.The press will destroy youJack is already deep into the investigation of a multi-million dollar NFL gambling scandal and the unsolved slayings of 18 schoolgirls when he learns of a horrific murder close to home: his best friend's wife, Jack's former lover, has been killed. It nearly pushes him over the edge. Instead, Jack pushes back and devotes all of Private's resources to tracking down her killer.Only one place to turn: Private But Jack doesn't have to play by the rules. As he closes in on the killer and chooses between revenge and justice, Morgan has to navigate a workplace love affair that threatens to blow the roof off his plans. With a plot that moves at death-defying speeds, Private is James Patterson sleekest, most exciting thriller ever.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "MLA Handbook for Writers of Research Papers, 7th Edition",
        "Authors": "By Gibaldi, Joseph (EDT)",
        "Description": "This authoritative guide published by the Modern Language Association outlines how to document sources in a research paper using MLA style, for scholars and students at universities and secondary schools. It provides advice on all aspects of writing papers, from selecting a topic, the mechanics of writing, and plagiarism, to submitting the paper, abbreviations, and documenting a variety of sources. Reorganized and revised, this edition has been updated to include tips on research and writing in the online environment, simplified guidelines for citing works published on the internet, and new recommendations for citing works such as digital files and graphic narratives. It also has expanded discussion of when documentation is not needed, and revised guidelines for preparing a printed paper, citing works in newspapers and articles in reference works, and the punctuation of titles of works, and techniques for finding reliable sources online. It has a new companion website. Annotation ©2009 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Language Arts & Disciplines , Style Manuals",
        "Publisher": "American Greetings",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Lucid Intervals: A Stone Barrington Novel",
        "Authors": "By Woods, Stuart",
        "Description": "A brand-new page-turning Stone Barrington novel from the perennially entertaining New York Times-bestselling author. It seems like just another quiet night at Elaine's. Stone Barrington and his former cop partner, Dino, are enjoying some pasta when in walks former client and all around sad sack Herbie Fisher...with a briefcase containing $14 million in cash. Herbie claims to have won the money on a lucky lotto ticket, but he also says he needs a lawyer-and after a single gunshot breaks the window above his head and sends diners scrambling, Stone and Dino suspect Herbie might need a bodyguard and a private investigator, too.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Jesus Calling: Enjoying Peace in His Presence (with Scripture References)",
        "Authors": "By Young, Sarah",
        "Description": "After many years of writing her own words in her prayer journal, missionary Sarah Young decided to be more attentive to the Savior's voice and begin listening for what He was saying. So with pen in hand, she embarked on a journey that forever changed her'and many others around the world. In these powerful pages are the words and Scriptures Jesus lovingly laid on her heart. Words of reassurance, comfort, and hope.  Words that have made her increasingly aware of His presence and allowed her to enjoy His peace. Jesus is calling out to you in the same way. Maybe you share the author's need for a great sense of 'God with you'. Or perhaps Jesus seems distant without you knowing why. Or maybe you have wandered farther from Him that you ever imagined you would. Here is a year's worth of daily readings from Young's journals to bring you closer to Christ and move your time with Him from monologue to a dialogue. Each day is written as if Jesus Himself were speaking to you. Because He is. Do you hear Him calling?",
        "Category": " Religion , Christian Living , Inspirational",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Tosca Reno's Eat Clean Cookbook: Delicious Recipes That Will Burn Fat and Re-Shape Your Body!",
        "Authors": "By Reno, Tosca and Knight, Chris (FRW)",
        "Description": "With simple-to-prepare yet exotic and delicious recipes such as Moroccan Pumpkin Soup and Roasted Bison Tenderloin with Apple Butter Sauce, Tosca shows us that eating clean can be as delicious and stimulating to the palate as it is satisfying and beneficial. She teases your tastebuds and challenges your preconceptions, but she also understands that time is a precious commodity, so her recipes are easy to prepare. Get: Over 150 delicious recipes, each with a gorgeous, mouth-watering full-page photo by renowned food photographer Donna Griffith; The finest foods the world has to offer, with simple instructions for preparation; Inspiring lifestyle photographs of Tosca; Tips, tricks, advice and information for those new to the art of cooking.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Robert Kennedy",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    }
]