[
    {
        "Title": "Great Grains (Feed Your Family Right)",
        "Authors": "By Drachman, Linda and Wynne, Peter",
        "Description": "Gathers recipes for appetizers, breads, pancakes, cookies, main dishes, salads, soups, and desserts featuring wheat, corn, oats, rice, barley, millet, rye, amaranth, buckwheat, and quinoa",
        "Category": " Cooking , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Alejandro's Gift (Rise and Shine)",
        "Authors": "By Long, Sylvia (ILT) and Albert, Richard E.",
        "Description": "This uplifting story about one man's gift to the desert and the gift he receives in return has a powerful environmental lesson.",
        "Category": " Juvenile Fiction , Nature & the Natural World , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Simply Delicious (Bk. 1)",
        "Authors": "By Allen, Darina",
        "Description": "",
        "Category": "",
        "Publisher": "Irish Books & Medi",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "NOLS Cookery: 4th Edition (NOLS Library)",
        "Authors": "By National Outdoor Leadership School (U. S.)",
        "Description": "",
        "Category": "",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Baby at the Farm: A Touch-and-Feel Book (Touch-And-Feel Books (Little Simon))",
        "Authors": "By Katz, Karen",
        "Description": "Images of baby farm animals snuggling with a happy young toddler are combined with interactive touch-and-feel elements that add texture to fluffy chicks, a woolly lamb and more. By the author of the best-selling Where Is Baby's Belly Button? 200,000 first printing.",
        "Category": " Juvenile Fiction , Interactive Adventures",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Learning the UNIX Operating System (In a Nutshell)",
        "Authors": "By Strang, John, Todino, Grace, and Peek, Jerry D.",
        "Description": "If you are new to UNIX, this concise introduction will tell you just what you need to get started and no more. Why wade through a 600-page  book when you can begin working productively in a matter of minutes? It's an ideal primer for Mac and PC users of the Internet who need to  know a little bit about UNIX on the systems they visit.This book is the most effective introduction to UNIX in print. The  fourth edition covers the highlights of the Linux operating system.  It's a  handy book for someone just starting with UNIX or Linux, as well as someone  who encounters a UNIX system on the Internet.  And it now includes a quick-reference card.Topics covered include:Linux operating system highlightsLogging in and logging outWindow systems (especially X/Motif)Managing UNIX files and directoriesSending and receiving mailRedirecting input/outputPipes and filtersBackground processingBasic network commandsv",
        "Category": " Computers , Operating Systems , UNIX",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Latin Poetry in Verse Translation by L.R. Lind, Ed.",
        "Authors": "By Ed. L.R. Lind",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Houghton Mifflin Soar to Success: Paperback Level 4 Oil Spill! (Read Soar to Success 1999)",
        "Authors": "By Read (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "AutoCAD 2000 For Dummies",
        "Authors": "By Smith, Bud E. and Middlebrook, Mark",
        "Description": "With AutoCAD 2000 For Dummies, you'll quickly discover just how easy it is to create professional-quality designs and drawings. Authors Mark Middlebrook and Bud Smith show you how to set up a design, draw and edit lines, add text and dimensions, even incorporate AutoCAD documents into your Web pages-all while avoiding those common gotchas.\" Whether you're a new AutoCAD user or you've just upgraded to AutoCAD 2000, this easy-to-use reference delivers all the answers you need to get up to speed.Inside, find helpful advice on how to:* Discover the new AutoCAD 2000 features-and put them to work* Take full advantage of color and lineweight with the new AutoCAD 2000 approach* Use both menu and toolbar access to commands* Set up a drawing so that it prints without problems* Speed up your work by using the command line as an accelerator* Enhance your Web pages with the new AutoCAD 2000 Web access features* Increase accessibility of your AutoCAD drawings by using AutoCAD DesignCenter",
        "Category": " Computers , Desktop Applications , Desktop Publishing",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Planning A Small Yard (101 Essential Tips)",
        "Authors": "By Brookes, John (EDT)",
        "Description": "Offers advice for landscaping a small yard, including design considerations, boundary structures, lighting, pots and containers, and more",
        "Category": " Gardening , Lawns",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "The Art of Excellence: Chefs, Cuisine, Cities, & Cognacs",
        "Authors": "By Shaw, David",
        "Description": "",
        "Category": " Travel , Restaurants",
        "Publisher": "Bon Vivant Publishing, Inc.",
        "Price Starting With ($)": "7.36",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Body Dynamics",
        "Authors": "By MacArthur, John",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Broken (The Rafferty Brothers)",
        "Authors": "By Walker, Shiloh",
        "Description": "The national bestselling author of Fragile returns with a luscious new blend of sex and suspense.   Quinn Rafferty is working as a bounty hunter for a private detective agency in St. Louis when a new neighbor catches his eye. He's drawn to her-but he has his own soul to mend before he can worry about anyone else.  Sarah McElyea is on the run, but not for the usual reasons a woman goes on the lam. She has a plan for her future. And as much as she finds herself attracted to her gruff, tough neighbor, she can't risk telling him the secrets she's hiding.  But Quinn must get closer to Sarah when she turns out to be the target of his new missing persons case, and both Quinn and Sarah will have to expose their true feelings-as well as their fragile hearts-if their love is to survive.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "A Very Simple Crime",
        "Authors": "By Jerkins, Grant",
        "Description": "A twisting debut novel of murder and dark family secrets from a riveting new voice in crime fiction.   A murdered woman. A grieving husband. And their son-a mentally handicapped adult with a history of violent outbursts. A very simple case. Or is it?  Leo Hewitt, an Assistant DA once blamed for setting free a notorious child-killer, is eager to redeem himself with this intimate and grisly crime. As he digs below the surface he discovers more than he ever anticipated-including an emotionally disturbed wife, a husband who'd do anything to escape his disastrous marriage, and an accused young man with no apparent means of defense. But with each shocking new revelation, Leo is only led deeper and deeper into the darkness-an inescapable trap of blood bonds and twisted family secrets.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Spider, Spin Me a Web",
        "Authors": "By Block, Lawrence",
        "Description": "Essays discuss organic structure, typography, the use of real characters, point of view, foreshadowing, flashbacks, details, back stories, and plot",
        "Category": " Reference , Writing Skills",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "The International Cookie Cookbook",
        "Authors": "By Baggett, Nancy",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , International",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Tarzan at the Earth's Core",
        "Authors": "By Burroughs, Edgar",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Star Spangled Beer: A Guide to America's New Microbreweries and Brewpubs",
        "Authors": "By Erickson, Jack",
        "Description": "",
        "Category": " Cooking , Beverages , Beer",
        "Publisher": "Redbrick Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "The Block",
        "Authors": "By Litwin, Bob, Silverman, Chip",
        "Description": "",
        "Category": "",
        "Publisher": "Scribe Publishing",
        "Price Starting With ($)": "11.37",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Spanish Phrase Book (Eyewitness Travel Guides)",
        "Authors": "By DK Publishing",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Come, Sit, Stay (Simple Solutions Series)",
        "Authors": "By Moore, Arden and Jones, Buck (ILT)",
        "Description": "",
        "Category": " Pets , Reference",
        "Publisher": "Lumina Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "When Friends Ask About Adoption: Question & Answer Guide for Non-Adoptive Parents and Other Caring Adults",
        "Authors": "By Bothun, Linda",
        "Description": "",
        "Category": " Family & Relationships , Adoption & Fostering",
        "Publisher": "Swan Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Murder Alfresco (Sunny McCoskey Napa Valley Mysteries)",
        "Authors": "By Gordon, Nadia",
        "Description": "Walking home late one night from a party, Napa Valley restaurant owner Sunny McCoskey happens upon the shocking sight of a murdered woman, bound and hanging from the tree of a local vineyard. Shortly before, she'd seen a truck leaving a local winery, driving without its headlights on. Was it the murderer? And did the murderer see her as well? Sunny's investigation introduces her to a whole new array of colorful characters and suspects, including a hardy contingent of Northern California surfers and a shady community of houseboaters. With the help of her lively and irreverent crew of friends, Sunny uncovers dark motives amid the cool chardonnays, and finds herself the focus of the killer's unwelcome attention.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Nature of Jade",
        "Authors": "By Caletti, Deb",
        "Description": "A girl grappling with Panic Disorder finds comfort—and love—with a boy who is hiding a terrible secret in this poignant and romantic novel from Printz Honor medal winner and National Book Award finalist Deb Caletti.Jade DeLuna is too young to die. She knows this, and yet she can’t quite believe it, especially when the terrifying thoughts, loss of breath, and dizzy feelings come. Since being diagnosed with Panic Disorder, she’s trying her best to stay calm, and visiting the elephants at the nearby zoo seems to help. That’s why Jade keeps the live zoo webcam on in her room, and that’s where she first sees the boy in the red jacket. A boy who stops to watch the elephants. A boy carrying a baby. His name is Sebastian, and he is raising his son alone. Jade is drawn into Sebastian’s cozy life with his son and his activist grandmother on their Seattle houseboat, and before she knows it, she’s in love. Jade knows the situation is beyond complicated, but she hasn’t felt this safe in a long time. And she owes it to Sebastian, her boy with the great heart. Her boy who is hiding a terrible secret. A secret that will force Jade to decide between what is right, and what feels right…",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "A Grandparent's Journal",
        "Authors": "By Running Press",
        "Description": "",
        "Category": "",
        "Publisher": "Running Pr Book Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "The White House, An Historic Guide",
        "Authors": "By Monkman, President Betty C.",
        "Description": "",
        "Category": "",
        "Publisher": "U.S. Independent Agencies and Commission",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Gioranni Cinardi's Complete Guide to Drawing by Search Press Ltd (2006-05-03)",
        "Authors": "By Search Press Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Search Press",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Heart of a Champion",
        "Authors": "By Jones, Thomas and Sheila",
        "Description": "",
        "Category": "",
        "Publisher": "Dpi",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Wench: A Novel (P.S.)",
        "Authors": "By Perkins-Valdez, Dolen",
        "Description": "Wench by Dolen Perkins-Valdez is startling and original fiction that raises provocative questions of power and freedom, love and dependence. An enchanting and unforgettable novel based on little-known fact, Wench combines the narrative allure of Cane River by Lalita Tademy and the moral complexities of Edward P. Jones’s The Known World as it tells the story of four black enslaved women in the years preceding the Civil War. A stunning debut novel, Wench marks author Perkins-Valdez—previously a finalist for the 2009 Robert Olen Butler Short Fiction Prize—as a writer destined for greatness.",
        "Category": " Fiction , African American , Historical",
        "Publisher": "Amistad",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "American Idol (The Journey to Stardom)",
        "Authors": "By Josh Murray",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Lift and Learn New Testament Stories",
        "Authors": "By Zobel-Nolan, Allia, Chambliss, Maxie (ILT), and Hunter, Linda (ILT)",
        "Description": "Parents and young kids alike will love this big lift-the-flap concept book for the New Testament. This large board book is a terrific educational tool for families to teach young children ideas about learning, and at the same time, go a bit deeper into stories and truths presented in the New Testament. Great for young children ages 3-6, this board book helps them to explore concepts such as opposites, sounds, colors, counting, and action words. Kids will explore the book by opening dozens of surprise-filled flaps, as they read about Jesus and his friends. Parents will appreciate the book's ability to expose young children to ways of looking at things that go beyond normal illustrated books. This special lift-the-flap book transforms favorite New Testament Bible stories into the perfect place to explore early-learning concepts. Old Testament lift-the-flap board book is also available.",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Eat, drink, be merry, and live longer",
        "Authors": "By Johnson, Harry Julius",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Drugs and Youth: Medical, Psychiatric, and Legal Facts",
        "Authors": "By Brenner, Joseph Hayyim",
        "Description": "",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "9.12",
        "Publish Date": {
            "Month": "June",
            "Year": "1970"
        }
    },
    {
        "Title": "Python in a Nutshell",
        "Authors": "By Martelli, Alex",
        "Description": "Ask any Python aficionado and you'll hear that Python programmers have it all: an elegant language that offers object-oriented programming support, a readable, maintainable syntax, integration with C components, and an enormous collection of precoded standard library and extension modules.  Moreover, Python is easy to learn but powerful enough to take on the most ambitious programming challenges. But what Python programmers have lacked is one concise and clear reference resource, with the appropriate measure of guidance in how best to use Python's great power. Now Python in a Nutshell fills this need.In the tradition of O'Reilly's \"In a Nutshell\" series, this book offers Python programmers one place to look when they need help remembering or deciphering the syntax of this open source language and its many modules.  This comprehensive reference guide makes it easy to look up all the most frequently needed information--not just about the Python language itself, but also the most frequently used parts of the standard library and the most important third-party extensions.Python in a Nutshell focuses on Python 2.2 (and all its point releases), currently the most stable and widespread Python release. This book includes:A fast-paced tutorial on the syntax of the Python language itselfAn explanation of object-oriented programming in Python, covering both the classic and new-style object modelsCoverage of other core topics, including exceptions, modules, strings, and regular expressionsA quick reference for Python's built-in types and functions, as well as the key modules in the Python standard library, including sys, os, time, thread, math, and socket, among many othersReference material on important third-party extensions, such as Numeric and TkinterInformation about extending Python and embedding it into other applicationsPython in a Nutshell provides a solid, no-nonsense quick reference to information that programmers rely on the most. This latest addition to the best-selling \"In a Nutshell\" series will immediately earn its place in any Python programmer's library.",
        "Category": " Computers , Programming Languages , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Looking at Paintings",
        "Authors": "By Kennet, Frances",
        "Description": "A children's guide to learning about art shows what to look for in a painting and explains why each artist paints differently and their methods of painting",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "The coming of war;: An account of the remarkable events leading to the War of 1812",
        "Authors": "By Albert H. Z Carr",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Additions",
        "Authors": "By Better Homes and Gardens Books (EDT)",
        "Description": "Advice to give a homeowner confidence to understand a major home addition.Expert know-how for carpentry, wiring, plumbing, and foundation work.Instructions on how to tie into existing structures, traffic patterns, livability, and foundation details.Design and subcontracting information for various aspects of additions.Ideas and expertise from America’s most trusted resource for home improvement inspires homeowners.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Lasik Laser Vision Correction (Doctor to Patient Series)",
        "Authors": "By Mark E. Whitten, MD., L. Edward Perraut, MD., John D. Mitchell, MD",
        "Description": "",
        "Category": "",
        "Publisher": "MedWorld Publishing",
        "Price Starting With ($)": "7.91",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Southern Living The Half-Hour Hostess: All Fun, No Fuss: Easy Menus, 30-Minute Recipes, and Great Party Ideas",
        "Authors": "By Southern Living Magazine (COR) and Gordon, Rebecca Kracke (CON)",
        "Description": "From the most casual outdoor get-togethers to holiday gatherings that call for a little more planning,The Half-Hour Hostess makes it easy to entertain the Southern Living way.Between hectic work schedules, carpool duties, and volunteer activities, busy folks want to stop and take time to reconnect with their friends and families. But who has the time? Now you can entertain the easy way! Forget fussy dinner parties and complicated soirées- the recipes and ideas for our festive little gatherings come together in a mere 30 minutes or less. Instead of hosting a 5-course Christmas dinner, invite the girls over for a shopping break featuring Caramel-Cream Macchiato Coffee and Cream-Cheese Olive Spread. Send each of them home with a clever little Caramel Shopping Bag table decoration that you can assemble in just 15 minutes. With quick recipes, great decorating ideas, and countless tips,The Half-Hour Hostess helps readers get everything done in a snap. Taking its cue from the popular \"Half-Hour Hostess\" column in Southern Living magazine, every recipe in this book is ready in 30 minutes or less. We throw out the idea of traditional entertaining and replace it with fun and fast gatherings instead of the fussy parties that you'd expect in a traditional entertaining book. With a photograph-or two-on every spread, each turn of the page offers ideas that are as much fun to look at as they are to use. Seeing just what the recipe or decoration will look like will help readers put together a party in style.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "Christmas Around the World (Day in the Life Series)",
        "Authors": "By Naythons, Matthew",
        "Description": "Discover the magic of Christmas as seen through the lenses of fifty photographers who spanned the globe to capture the season in all its splendor. Christmas Around the World explores this most joyous holiday, as celebrated across six continents.Visit the enchanting Dutch city of Gouda, where once a year the lights are darkened and the city glows with candlelight. Experience the vibrant celebration of Las Posadas in Mexico...last-minute shopping and the dizzying commotion in London and New York...the reverence and beauty of the Pope's mass in St. Peter's Basilica.Share the truly international meaning of the holiday spirit: sacred processions in Ethiopia, Mexico, Belgium, and, of course, Bethlehem; families from the countrysides of Quebec, Canada, and Great Britain sharing the excitement of Christmas Morning; a moment's peace with the troops in Bosnia on Christmas Eve; carolers in Ireland; and a school for Santas in Alaska.Whether capturing a timeless tradition or a slice of modern-day life, Christmas Around the World offers an often poignant, always celebratory salute to this spirited holiday season.",
        "Category": " Social Science , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Writers Reference",
        "Authors": "By Hacker, Diana",
        "Description": "",
        "Category": "",
        "Publisher": "Bedford/St Martins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Be Very Afraid",
        "Authors": "By S. K. McClafferty",
        "Description": "",
        "Category": "",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Programming in C",
        "Authors": "By Kochan, Stephen G.",
        "Description": "",
        "Category": "",
        "Publisher": "Hayden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "General Foods Kitchens frozen foods cookbook; modern living with frozen foods. Drawings by Mary Ronin and William Ronin.",
        "Authors": "By General Foods Corporation",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Cats: A Celebration in Words & Paintings (Words & Paintings Series)",
        "Authors": "By Exley, Helen (EDT)",
        "Description": "",
        "Category": " Pets , Cats , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Review for Usmle: United States Medical Licensing Examination, Step 2 (The National Medical Series for Independent Study)",
        "Authors": "By Goljan, Edward F. (EDT)",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Williams & Wilkins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Sunset Ideas for Cooking Vegetables",
        "Authors": "By Ed, Sunset",
        "Description": "",
        "Category": "",
        "Publisher": "Sunset Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Everything Middle East Book: The Nations, Their Histories, and Their Conflicts (Everything (History & Travel))",
        "Authors": "By Fellure, Jacob M.",
        "Description": "Fellure (Middle East Cross-Cultural Association) explains the history, culture, and politics of the region in simple terms in this reference for general readers and students in high school and up. He examines early civilizations of the region, the roots of Judaism, Christianity, and Islam, and the histories of six countries, and discusses tough issues such as Islamic militancy, ethnic divisions, and historical memory. The appealing layout, with its larger print, accessible language, and boxed facts, lacks only one thing: photos. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " History , Middle East , General",
        "Publisher": "Adams Media Corporation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "How to Prepare for the SAT II World History (BARRON'S HOW TO PREPARE FOR THE SAT II WORLD HISTORY)",
        "Authors": "By Roupp, Heidi and Hitchens, Marilynn Giroux",
        "Description": "Two SAT II practice tests with answers are presented, and reflect questions in the current actual SAT II World History exam. Extensive review material chronicles human history from the earliest known societies to the modern technology-driven world community. Subject matter is organized chronologically for easy reference and review, as well as in categories covering major events, ideas, and personages. This new edition presents an ex-panded series of recall questions and answers at the end of each unit.",
        "Category": " Study Aids , SAT",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Royal Wedding: Official Souvenir",
        "Authors": "By Patrick Montague-Smith et al",
        "Description": "",
        "Category": "",
        "Publisher": "The Royal Jubilee Trusts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "Punctuation Made Easy (Learning Made Easy)",
        "Authors": "By Cipriano, Jeri",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Lt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Pendragon Before the War (Book One of the Travelers)",
        "Authors": "By Jablonski, Carla and Machale, D. J. (CRT)",
        "Description": "Before Bobby Pendragon. Before Saint Dane. Before the war . . . Every territory of Halla has a Traveler. They lived for years—some even for decades—before learning of their true destiny. What was life like for Bobby Pendragon’s fellow Travelers before they joined him in the fight to save every time and place that has ever existed? What led up to their becoming the guardians of Halla? The answers are here! In this first of three thrilling Pendragon prequels, read about Vo Spader’s death-defying adventures in the underwater world of Cloral, Gunny Van Dyke’s race to find a murderer in 1930’s Manhattan on First Earth, and the tough challenges Kasha faced on Eelong well before Bobby Pendragon arrived . . .",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Everything Creative Writing Book: All You Need to Know to Write a Novel, Play, Short Story, Screenplay, Poem, or Article",
        "Authors": "By Whiteley, Carol",
        "Description": "Offers how-to advice on the creative writing process. Separate chapters offer discussions of the different facets of writing children's books, short stories, novels, screenplays, functional and literary nonfiction, and poetry. More general chapters offer advice on getting ideas, planning, researching, organizing drafting, editing, evaluating, rhetorical devices, overcoming writer's block, working with others, and getting published. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Simply Vegan: Quick Vegetarian Meals",
        "Authors": "By Wasserman, Debra and Mangels, Reed",
        "Description": "",
        "Category": "",
        "Publisher": "Vegetarian Resource Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Magic Moving Alphabet Book",
        "Authors": "By Moore, Frank",
        "Description": "26 designs, one for each letter of the alphabet, that come to life and give the illusion of motion when viewed through the moiré screen provided.",
        "Category": " Juvenile Nonfiction , Games & Activities , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "Better Homes and Gardens Let's Pretend (Fun projects for kids to do)",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Shares recipes, games, and ideas for things to make, including a toy camera, binoculars, paper hat, stamps, mailbag, and drum",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Simply Ball Workout",
        "Authors": "By Jennifer Pohlman, Rodney Searle",
        "Description": "",
        "Category": "",
        "Publisher": "Hinkler Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Overcoming Depression: A Step-by-Step Approach to Gaining Control Over Depression",
        "Authors": "By Gilbert, Paul",
        "Description": "St. John's Wort, Prozac, psychotherapy, support groups--today's individual suffering from depression has a laundry list of treatments to choose from.  For many, Paul Gilbert's self-help manual Overcoming Depression--based on the highly effective technique of cognitive behavioral therapy--will provide a lifeline to recovery and a better future, as a way to understand and thus resist the downward slide of depression, and as a resource to supplement therapy or medication.    Cognitive behavioral therapy, which treats emotional disorders by changing negative thought-patterns, is now internationally established as a key method for overcoming conditions such as depression, anxiety, panic attacks, and eating disorders. The principle behind this form of therapy is that our thoughts have a major impact on our emotions: a person who goes through life thinking \"I am unlovable,\" or \"I'll never achieve anything,\" will find constant evidence to support his or her beliefs.  In Overcoming Depression, Gilbert explains the many forms and causes of depression and lays out clinically proven techniques for dealing with this debilitating condition.  This book will help people gain insight into problem areas such as perfectionism, shame, anger, and aggression, and how these areas can become exacerbated by depression. Overcoming Depression illustrates a systematic program of treatment by which people can monitor their thoughts, learn to recognize negative patterns, and challenge them.  With step-by-step suggestions, case examples, thought-monitoring sheets, and practical ideas for gaining control over depression, Gilbert offers a course of action for those suffering from depression to change the way they think about themselves and their problems.     The Second Edition of Overcoming Depression presents new statistics and findings from the last three years, and offers new chapters on causes for depression including \"Biology and Stress,\" \"How Evolution May Have Shaped Depression,\" and \"Early Life, Psychological and Social Aspects.\" In a new chapter on guilt Gilbert differentiates between guilt and shame, and examines the relationship between guilt and depression and how to deal with those who make us feel guilty. Finally, a new preface and a new brief discussion of St. John's Wort complete the text.",
        "Category": " Psychology , Mental Health",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Sinatra",
        "Authors": "By Havers, Richard and Schwartz, Jonathan (FRW)",
        "Description": "Highlighted by more than eight hundred photographs spanning seventy years, a visual biography of one of America's most famous singer-actors offers a portrait of his personal life, his music, his film career, and more, accompanied by information on his recordings, arrangements, and lyrics and a listing of his movies.",
        "Category": " Music , Genres & Styles , Pop Vocal",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "7.61",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Prevention's Guide to High-Speed Healing",
        "Authors": "By Rodale Press (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Fine Communications",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Eat Smart Lose Weight",
        "Authors": "By Thomas, Karen",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Karen Brown's Austrian Country Inns and Castles (Karen Brown's Austria Charming Inns & Itineraries)",
        "Authors": "By Brown, Clare and Brown, Karen",
        "Description": "Provides information on more than sixty hotels and taverns in Austria",
        "Category": " Travel , General",
        "Publisher": "Globe Pequot Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Who's Who and Where's Where in the Bible (Bible Reference Library)",
        "Authors": "By Miller, Stephen M.",
        "Description": "Stephen M. Miller's Who's Who and Where's Where in the Bible spent most of 2005 on the CBA best-seller lists and won the 2006 Retailer's Choice Award for non-fiction. Now it's available in a handy pocket-sized format. This new edition contains all of the text, illustrations, and maps of the original, an easy-to-read A-Z dictionary that offers fresh and surprising insights about the most important people and places in the Bible-five hundred in all. This captivating book will appeal to Bible newcomers as well as long-time Christians, especially in this go-anywhere package!",
        "Category": " Religion , Biblical Reference , General",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Understanding Administrative Law (Understanding Law Series)",
        "Authors": "By Fox, William F.",
        "Description": "",
        "Category": "",
        "Publisher": "Matthew Bender & Co",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Fund",
        "Authors": "By Narea, H. T.",
        "Description": "U.S. defense intelligence operative Kate Molares is investigating a suspicious international money trail.  Her instincts place her at the center of a plot involving a terrifying new kind of terrorism—financial terrorism— perpetrated by a suave, handsome Middle Eastern hedge fund mogul.   His goal is to wreck the West by bringing the global economy to its knees.Kate's mission takes her from the defense intelligence command center on the outskirts of Washington, D.C. to the oil-fueled economy of Caracas, Venezuela; from the Beaux-Arts buildings of Old Havana in Cuba to a hedge fund king’s magnificent back-country estate in Greenwich, Connecticut; from the United Nations to the site of a deadly Islamic conspiracy in the Iberian Peninsula. Kate is in a race against time to fit together the pieces of this global puzzle…or risk the catastrophic destruction of the world’s financial markets.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "The Da Vinci Code Illustrated Screenplay: Behind the Scenes of the Major Motion Picture",
        "Authors": "By Goldsman, Akiva, Brown, Dan (FRW), Howard, Ron (FRW), Grazer, Brian (FRW), and Calley, John (AFT)",
        "Description": "The Da Vinci Code Illustrated Screenplay goes behind the scenes of one of the most highly anticipated movies of all time, created by Academy Award®–winning filmmakers Ron Howard, Brian Grazer, and Akiva Goldsman.  Offering unprecedented access to the tightly guarded “closed set,” and a view of the filmmaking process that has never been seen publicly, screenwriter Goldsman provides a backstage look at the incredible journey to bring Dan Brown’s record-setting novel to the big screen.  Goldsman’s richly rendered screenplay is included here in its entirety.  It offers a fascinating new way to experience the story—and includes a number of moments (and even full scenes) that do not appear in the final cut of the movie. Lavishly illustrated with 275 images of the actors and filmmakers—from both the movie set and the film itself—this behind-the-scenes features include: • Filming in the Louvre in the dead of night, and re-creating a 400-foot section of the museum’s Grand Gallery on a soundstage—down to the precise architectural details, and complete with 120 oil-painting masterpieces  • The full digital and soundstage re-creation of the Church of Saint-Sulpice • The transformation of Lincolnshire’s Lincoln Cathedral into London’s Westminster Abbey, and the reproduction of Sir Isaac Newton’s enormous tomb• Handwritten notes on pages from Ron Howard’s script • The evolution of script dialogue as it progressed from an early draft of the screenplay to final shooting form • Dozens of never-before-seen storyboards that were used to block out scenes before filming commenced  For any fan of the filmmaking process, and of the extraordinary movie and novel, this exquisitely produced book will be an invaluable companion.",
        "Category": " Performing Arts , Screenplays",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Joe Camp's Benji, Fastest Dog in the West",
        "Authors": "By Gina Ingoglia",
        "Description": "",
        "Category": "",
        "Publisher": "Western Publishing Company, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Quick & Delicious Bread Machine Recipes",
        "Authors": "By Garrett, Norman A.",
        "Description": "\"Here are recipes from all over the world, America, all regions of Europe, Latin America, Scandinavia, the Mediterranean area. You'll have a hard time deciding which to try first....There is also a good troubleshooting chapter....\"--Food.    128 pages, 6 x 9.",
        "Category": " Cooking , Courses & Dishes , Bread",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Grill It! Good Housekeeping Favorite Recipes (Favorite Good Housekeeping Recipes)",
        "Authors": "By Levine, Ellen (EDT)",
        "Description": "Fire up the grill--and sales, too! Good Housekeeping welcomes a delicious new cookbook in the same attractive and handy lie-flat, concealed spiral format as its popular Blend It! and Bake It!  With more than 150 delicious grilling recipes featuring everything from pizza to steak to veggies, the cooking experts at Good Housekeeping show barbecue lovers how to prepare a flawless feast. Luscious photos offer an array of dishes that go far beyond the usual--although, of course, you'll also learn how to make the perfect burger. Try Goat Cheese and Tomato Bruschetta, Polynesian Drumsticks, Kansas City Ribs, Shrimp Sonoma, Campfire Corn with Herb Butter, and much more. Whether your grill uses charcoal, gas, or electricity, all the basics are here, including useful accessories, terrific marinades, ideas for flavoring the fire, and precise cooking times.",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Hearst",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Citizen You: Doing Your Part to Change the World",
        "Authors": "By Weber, Karl, Tisch, Jonathan M., and Booker, Cory A. (FRW)",
        "Description": "Just when the world needs it most, a new style of social engagement  is emerging: Active Citizenship. A key member of one of New York’s  most civic-minded families—one that has supported many of America’s  notable institutions and deserving programs—Jonathan Tisch has devoted a lifetime to “active citizenship.” It’s an idea that uses the power of practical creativity and grassroots participation to solve seemingly intractable problems. In Citizen You, Tisch challenges readers to join this movement and points the way toward making our world a better place, one person and one neighborhood at a time.      Tisch has filled Citizen You with accounts of people who you’ll meet, such inspirational individuals as: Scott Harrison, who has used the networking and marketing skills he developed as a night club promoter  to help over a million people in the developing world get access for the first time to clean, safe drinking water.Steffi Coplan, whose Broadway2Broadway project brought  out the hidden musical talents of kids at an inner city school.Eric Schwarz, who decided to do something about America’s under-performing schools, and parlayed a single classroom mentoring project into the nationwide Citizens Schools movement.Chris Swan, who is training a new generation of “citizen engineers” to make sure that the projects they build aren’t just structurally sound but also environmentally and socially sustainable. Dave Nelson, who traded his role as an executive at IBM for a job at a struggling nonprofit that teaches kids about the power of entrepreneurship—and discovered a host of new challenges and rewards in the process.Through these and many other remarkable stories, you’ll learn how today’s active citizens are  transforming thinking about social change. Rather than short-term fixes and hand-me-down charity, they’re striving to build sustainable, systemic solutions to our most challenging problems, building and empowering communities rather than fostering dependency.  And they’re using a host of new tools, from online networking and private-public partnerships to corporate engagement and social entrepreneurship, to redefine how change can happen. Citizen You is a potent antidote to pessimism. At a time of unprecedented challenges on the national and world stage, when active citizenship is not a choice but a necessity, Citizen You dares us to reshape the social, political, and intellectual structures that have long confined us, and offers fresh thinking that redefines the very concept of activism. For more information and ideas about how to be an active citizen go to www.citizenyou.org",
        "Category": " Political Science , Civics & Citizenship",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "After 50: Spiritually Embracing Your Own Wisdom Years",
        "Authors": "By Wicks, Robert J.",
        "Description": "",
        "Category": " Religion , Christian Education , General",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Lost Summer of Louisa May Alcott",
        "Authors": "By Mcnees, Kelly O'connor",
        "Description": "In the bestselling tradition of Loving Frank and March comes a novel for anyone who loves Little Women.  Millions of readers have fallen in love with Little Women. But how could Louisa May Alcott-who never had a romance-write so convincingly of love and heart-break without experiencing it herself? Deftly mixing fact and fiction, Kelly O'Connor McNees imagines a love affair that would threaten Louisa's writing career-and inspire the story of Jo and Laurie in Little Women. Stuck in small-town New Hampshire in 1855, Louisa finds herself torn between a love that takes her by surprise and her dream of independence as a writer in Boston. The choice she must make comes with a steep price that she will pay for the rest of her life.",
        "Category": " Fiction , Biographical",
        "Publisher": "Penguin Adult HC/TR",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "College Success Strategies (Penguin Academics)",
        "Authors": "By Holschuh, Jodi Patrick and Nist, Sherrie L.",
        "Description": "",
        "Category": " Study Aids , College Guides",
        "Publisher": "Longman Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "100 Amazing Facts About the Negro with Complete Proof: A Short Cut to The World History of The Negro",
        "Authors": "By Rogers, J. A.",
        "Description": "First published in 1934 and revised in 1962, this book gathers journalist and historian Joel Augustus Rogers' columns from the syndicated newspaper feature titled Your History. Patterned after the look of Ripley's popular Believe It or Not the multiple vignettes in each episode recount short items from Rogers's research. The feature began in the Pittsburgh Courier in November 1934 and ran through the 1960s.",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Wesleyan University Press",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "Unsung Heroes of Pro Basketball (Pro Basketball Library)",
        "Authors": "By Hill, Ray",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Country Italian Cooking",
        "Authors": "By Publications Editors",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Edge Of Recall",
        "Authors": "By Heitzmann, Kristen",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Great Wheel",
        "Authors": "By MacLeod, Ian R.",
        "Description": "In a wretched third world of the future, a young priest from England pursues the mystery of a disease.Although Father John has lost his faith, he does his best to administer prayers and medicine to the people of a Borderer town in what long ago was northern Africa. He wonders why so many in the Endless City are dying of bludrut - myeloid leukemia - and begins to suspect that the reason is the koiyl leaf, which the people chew as an opiate.Investigating, John encounters poverty, politics. He travels to a far valley of radioactive death, his guide a witch-woman. And as he questions a Europe grown too perfect and falls in love with a Borderer, he is visited, constantly, disturbingly, by childhood memories of harvest fairs at Hemhill and a wonderful older brother.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "20.16",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Dial B for Birder!: The Private Files of a Real-Life Bird Detective",
        "Authors": "By Oberman, Lola",
        "Description": "",
        "Category": " Nature , Animals , Wildlife",
        "Publisher": "Northword Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Tinker Bell: Two Magical Tales (Disney Fairies / A Stepping Stone Book)",
        "Authors": "By Clarke, Judith Holmes (ILT), Thorpe, Kiki, Brown, Adrienne (ILT), and Pickens, Charles (ILT)",
        "Description": "Fly with Tink and her fairy friends in The Trouble with Tink and Tink, North of Neverland, two magical tales full of adventure and illustrated with beautiful full color artwork, all-in-one lovely jacketed hardcover. You can even bring a bit of Pixie Hollow into your own room—a free Tinker Bell poster is printed on the back of the jacket!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Microwaving Poultry and Seafood (Microwave Cooking Library)",
        "Authors": "By Methven, Barbara",
        "Description": "Presents recipes for cooking dishes such as sesame-ginger chicken, Hungarian turkey goulash, marinated halibut steaks, and crab cakes in a microwave oven",
        "Category": " Cooking , General",
        "Publisher": "Prentice-Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Cooking Light Annual Recipes 2007: EVERY RECIPE...A Year's Worth of Cooking Light Magazine",
        "Authors": "By Cooking Light (EDT)",
        "Description": "Get a whole year’s worth of the most flavorful, healthy, good-for-you recipes from Cooking Light in Cooking Light Annual Recipes 2007! Dig into some of our bestdesserts, soups, salads, stews, one-dish meals, sandwiches, breads, rolls, muffins, biscuits, sides, and international dishes, bursting with unforgettable flavors. Try elegant Roast Chicken with Mint-Cilantro Pesto…crunchy Crab Cakes with Red Pepper Mayonnaise…chic Oven-Roasted Tomatoes with Goat Cheese…comforting, down-home Pork Chops with Country Gravy…and creamy Café au Lait Chiffon Pie. And you’ll also get: • More than 1,000 healthy Cooking Light recipes • Secrets, tips, and how-tos from the magazine • Luscious, full-color recipe photos that look good enough to eat• Three recipe indexes, so you can find what you need…fast! • Recipes judged best-of-the-best by the editors at Cooking Light • Detailed nutritional analysis for every recipePLUS The Holiday Cookbook! Celebrate the season with The Holiday Cookbook, our annual section in Cooking Light Annual Recipes dedicated to offering you ideas on what to serve, when to serve it, and how best to serve it. We provide a generous helping of make-ahead tips and menu suggestions to take the hustle and bustle out of the holidays. Our festive dinners and creative ideas ensure that the time you spend in the kitchen is, indeed, time well-spent.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Exploring the Bible with Children",
        "Authors": "By Furnish, Dorothy Jean",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1975"
        }
    },
    {
        "Title": "Angelina's Lucky Penny (Angelina Ballerina)",
        "Authors": "By Mason, James",
        "Description": "",
        "Category": " Juvenile Fiction , Performing Arts , Dance",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "First Aid Cpr Aed Program: Participants Booklet",
        "Authors": "By American National Red Cross (EDT)",
        "Description": "",
        "Category": " Health & Fitness , First Aid",
        "Publisher": "Amer Red Cross",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Is There Really a Human Race?",
        "Authors": "By Curtis, Jamie Lee and Cornell, Laura (ILT)",
        "Description": "Is there really a human race?Is it going on now all over the place?When did it start?Who said, \"Ready, Set, Go\"?Did it start on my birthday?I really must know.With these questions, our hero's imagination is off and running. Is the human race an obstacle course? Is it a spirit? Does he get his own lane? Does he get his own coach?Written with Jamie Lee Curtis's humor and heart and illustrated with Laura Cornell's worldly wit, Is There Really a Human Race? Is all about relishing the journey and making good choices along the way&#8212because how we live and how we love is how we learn to make the world a better place, one small step at a time.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Everyday Speaking for All Occasions: How to Express Yourself with Confidence and Ease",
        "Authors": "By Susan Partnow, Elaine Partnow",
        "Description": "",
        "Category": "",
        "Publisher": "GuildAmerica Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "My Year Inside Radical Islam: A Memoir",
        "Authors": "By Gartenstein-ross, Daveed",
        "Description": "My Year Inside Radical Islam is a memoir of first a spiritual and then a political seduction. Raised in liberal Ashland, Oregon, by parents who were Jewish by birth but dismissive of strict dogma, Daveed Gartenstein-Ross yearned for a religion that would suit all his ideals. At college in the late nineties he met a charismatic Muslim student who  grounded his political activism with thoughtful religious conviction. Gartenstein-Ross reflects on his experience of converting to Islam-a process that began with a desire to connect with both a religious community and a spiritual practice, and eventually led him to sympathize with the most extreme interpretations of the faith, with the most radical political implications.  In the year following graduation, Gartenstein-Ross went to work for the al-Haramain Islamic Foundation, a charity dedicated to fostering Wahhabism, Saudi Arabia's austere form of Islam-a theological inspiration for many terrorist groups, including al-Qaeda. Shortly after he left al-Haramain-when his own fan-aticism had waned-the foundation was charged by the U.S. government as being a source of funds for terrorist organizations. Gartenstein-Ross, by this time a lawyer at a prominent firm, volunteered to be questioned by the FBI. They already knew who he was.  The story of how a good faith can be distorted and a decent soul can be seduced away from its principles, My Year Inside Radical Islam provides a rare glimpse into the personal interface between religion and politics.",
        "Category": " Religion , Islam , General",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Joint Structure & Function: A Comprehensive Analysis",
        "Authors": "By Norkin, Cynthia C. and Levangie, Pamela K.",
        "Description": "New edition of a lucid textbook for students of physical therapy, sports training, and related disciplines. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Medical , Allied Health Services , Physical Therapy",
        "Publisher": "F.A. Davis Publications",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Leaderless Jihad: Terror Networks in the Twenty-First Century",
        "Authors": "By Sageman, Marc",
        "Description": "In the post-September 11 world, Al Qaeda is no longer the central organizing force that aids or authorizes terrorist attacks or recruits terrorists. It is now more a source of inspiration for terrorist acts carried out by independent local groups that have branded themselves with the Al Qaeda name. Building on his previous groundbreaking work on the Al Qaeda network, forensic psychiatrist Marc Sageman has greatly expanded his research to explain how Islamic terrorism emerges and operates in the twenty-first century.In Leaderless Jihad, Sageman rejects the views that place responsibility for terrorism on society or a flawed, predisposed individual. Instead, he argues, the individual, outside influence, and group dynamics come together in a four-step process through which Muslim youth become radicalized. First, traumatic events either experienced personally or learned about indirectly spark moral outrage. Individuals interpret this outrage through a specific ideology, more felt and understood than based on doctrine. Usually in a chat room or other Internet-based venues, adherents share this moral outrage, which resonates with the personal experiences of others. The outrage is acted on by a group, either online or offline.Leaderless Jihad offers a ray of hope. Drawing on historical analogies, Sageman argues that the zeal of jihadism is self-terminating; eventually its followers will turn away from violence as a means of expressing their discontent. The book concludes with Sageman's recommendations for the application of his research to counterterrorism law enforcement efforts.",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "University of Pennsylvania Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Prospects : A Portrait of Minor League Baseball",
        "Authors": "By Deal, David (PHT)",
        "Description": "",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Alter Communications Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Kingdom Power: Receiving the Power of the Promise: A Study in the Book of Acts",
        "Authors": "By Hayford, Jack W. and Snider, Joseph",
        "Description": "Spirit-filled believers will find new resources for understanding the Bible and applying biblical themes to their day-to-day lives in these interactive study guides. Written from a Pentecostal/Charismatic viewpoint, these interactive studies introduce believers to the books of the Bible and offer a thorough and balanced understanding of key themes of the Bible. By studying the themes of the books, as well as the books themselves, these interactive studies offer groups and individuals a Spirit-filled perspective of the Bible's message for today.",
        "Category": "",
        "Publisher": "Nelson Reference & Electronic Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "The Maltese (Terra-Nova)",
        "Authors": "By Morgan, Diane",
        "Description": "Get breed-specific advice on grooming this dog's challenging coat and how to prevent and treat common health problems. Written by an expert, this book contains valuable information on a variety of topics that are essential for cultivating health and happiness in a canine companion—including feeding, grooming, and training. In addition to an extensive, veterinarian-approved health chapter, the book comes with a bonus DVD that features socialization, safety, and training advice from a professional dog trainer—plus detailed information from a veterinarian on what happens at the vet and how to perform regular health checks at home.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "TFH Publications, Inc.",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Valley of the Vines",
        "Authors": "By Joy Packer",
        "Description": "",
        "Category": "",
        "Publisher": "J.B.Lippincott",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Boredom Busters for Dogs: 40 Tail-Wagging Games and Adventures",
        "Authors": "By Moustaki, Nikki",
        "Description": "Here’s a Dog Fancy book for dog owners who work more hours than they’d like to&#133;and for dog owners who own super-active dogs without real jobs to do (like herding sheep or retrieving ducks for ten hours a day). Boredom swiftly sets in on the domestic canine, and what usually follows is destructive, bad behavior that drives owners bonkers. Before you and your dog go bonkers together, Boredom Busters for Dogs holds forty great solutions to enriching your pet’s world in meaningful, fun ways. Author Nikki Moustaki has collected a toy box full of great games, interactive toys, and pawsitively stimulating puzzles to keep even suburban Border Collie happy and out of mischief. The book presents enrichment ideas categorized by solo activities, interactive social exercises, and ways to enhance the dog’s environment by offering variations or his own special places to play. In the chapter &#147;Solo Enrichment,” the author utilizes every dog’s favorite things&#151;food and toys&#151;to motivate him to play and discover treats on his own. In &#147;Social Enrichment,” the old adage that &#147;two dogs are better than one” is the common denominator for the games and activities used to keep canine pals occupied. &#147;Environmental Enrichment” gives owners ideas how to provide their dogs with places they can call their own, including digging pits, wading pools, tire swings, and more. Activities for dog and owner are the topic of &#147;Variance Enrichment,” listing a dozen enjoyable day trips and outings, from hiking and cruising around time to doggy dancing and agility trials.",
        "Category": " Pets , Dogs , General",
        "Publisher": "CompanionHouse Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Maltese (Complete Pet Owner's Manual)",
        "Authors": "By Siino, Betsy Sikora and Fulda, Joe",
        "Description": "The diminutive and appealing Maltese is noted for its silky, floor-length white coat, which requires frequent grooming. Barron's comprehensive series of Pet Owner's Manuals   advise both current and prospective owners on the care of virtually every kind of pet, including a wide variety of dog and cat breeds, hamsters and other small caged animals, birds, fish, reptiles, amphibians, and even scorpions and tarantulas. The author of each book is a specialist in his or her field, which guarantees readers solid advice and instruction that helps them know what to look for when acquiring a pet, feeding, housing, maintaining health care, and where applicable, grooming and training. All Pet Owner's Manuals  are filled with high-quality color photos and informative line art.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Math Instinct: Why You're a Mathematical Genius (Along with Lobsters, Birds, Cats, and Dogs)",
        "Authors": "By Devlin, Keith",
        "Description": "There are two kinds of math: the hard kind and the easy kind. The easy kind, practiced by ants, shrimp, Welsh corgis?and us?is innate.What innate calculating skills do we humans have? Leaving aside built-in mathematics, such as the visual system, ordinary people do just fine when faced with mathematical tasks in the course of the day. Yet when they are confronted with the same tasks presented as ?math,” their accuracy often drops.But if we have innate mathematical ability, why do we have to teach math and why do most of us find it so hard to learn? Are there tricks or strategies that the ordinary person can do to improve mathematical ability? Can we improve our math skills by learning from dogs, cats, and other creatures that ?do math”? The answer to each of these questions is a qualified yes. All these examples of animal math suggest that if we want to do better in the formal kind of math, we should see how it arises from natural mathematics.From NPR’s ?Math Guy”?The Math Instinct will provide even the most number-phobic among us with confidence in our own mathematical abilities.",
        "Category": " Mathematics , History & Philosophy",
        "Publisher": "Thunder's Mouth Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "New Concepts of Hypnosis: Theories, Techniques and Practical Applications",
        "Authors": "By Gindes, Bernard C.",
        "Description": "",
        "Category": " Psychology , Hypnotism",
        "Publisher": "Wilshire Book Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "THE BRIDGE OVER THE RIVER KWAI. Translated by Xan Fielding.",
        "Authors": "By Pierre Boulle",
        "Description": "",
        "Category": "",
        "Publisher": "Vanguard Press",
        "Price Starting With ($)": "19.23",
        "Publish Date": {
            "Month": "January",
            "Year": "1954"
        }
    },
    {
        "Title": "Ingo",
        "Authors": "By Dunmore, Helen",
        "Description": "A whisper on the tide Sapphire's father mysteriously vanishes into the waves off the Cornwall coast where her family has always lived. She misses him terribly, and she longs to hear his spellbinding tales about the Mer, who live in the underwater kingdom of Ingo. Perhaps that is why she imagines herself being pulled like a magnet toward the sea. But when her brother, Conor, starts disappearing for hours on end, Sapphy starts to believe she might not be the only one who hears the call of the ocean. In a novel full of longing, mystery, and magic, Helen Dunmore takes us to a new world that has the power both to captivate and to destroy.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    }
]