[
    {
        "Title": "The Bridge Book: For Advanced Players",
        "Authors": "By Stewart, Frank",
        "Description": "",
        "Category": "",
        "Publisher": "Devyn Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "4000 Things You Should Know About",
        "Authors": "By Farndon, John",
        "Description": "",
        "Category": "",
        "Publisher": "Miles Kelly Publishing Ltd.",
        "Price Starting With ($)": "6.71",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Rusty Wallace : The Decision to Win",
        "Authors": "By Zeller, Bob and Wallace, Rusty",
        "Description": "",
        "Category": " Sports & Recreation , Motor Sports",
        "Publisher": "David Bull Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Greatest Counselor in the World: A Fresh, New Look at the Holy Spirit",
        "Authors": "By Ogilvie, Lloyd",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Vine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Serious Strength Training",
        "Authors": "By Bompa, Tudor O. and Cornacchia, Lorenzo",
        "Description": "Describes exercises for building muscles, explains the proper nutrition needed for weight training, and provides a six-phase workout program",
        "Category": " Sports & Recreation , Training",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Totline Theme-A-Saurus ~ The Great Big Book of Mini Teaching Themes",
        "Authors": "By Warren, Jean and Walker, Cora L.",
        "Description": "Classroom-tested ideas! Around-the-curriculum activities are organized into imaginative units. A great resource for implementing a child-directed program. Children learn best when all their senses are activated and involved. 8 1/2\"x11\".pages.",
        "Category": " Education , Preschool & Kindergarten",
        "Publisher": "Warren Publishing House, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Articles of War",
        "Authors": "By Arvin, Nick",
        "Description": "George Tilson is an eighteen-year-old farm boy from Iowa. Enlisted in the Army during World War II and arriving in Normandy just after D-day, he is nicknamed Heck for his reluctance to swear. From summers of farm labor Heck is already strong. He knows how to accept orders and how to work uncomplainingly. But in combat Heck witnesses a kind of brutality unlike anything he could have imagined. Fear consumes his every thought and Heck soon realizes a terrible thing about himself: He is a coward. Possessed of this dark knowledge, Heck is then faced with an impossible task.",
        "Category": " Fiction , War & Military",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The Puzzle of the Soviet Church: An Inside Look at Christianity and Glasnost",
        "Authors": "By Hill, Kent R.",
        "Description": "Traces the relationship of Marxism and religion, looks at the modern history of the Russian church, and assesses the influence of glasnost on religious freedom",
        "Category": " Political Science , General",
        "Publisher": "Multnomah Pub",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "The Almanac of Political Corruption, Scandals & Dirty Politics",
        "Authors": "By Long, Kim",
        "Description": "Watergate. Billygate. Iran-Contra. Teapot Dome. Monica Lewinsky.American history is marked by era-defining misdeeds, indiscretions, and the kind of tabloid-ready scandals that politicians seem to do better than anyone else. Now, for the first time, one volume brings together 300 years of political wrongdoing in an illustrated history of politicians gone wild—proving that today’s scoundrels aren’t the first, worst, and surely won’t be the last….From high crimes to misdemeanors to moments of licentiousness and larceny, this unique compendium captures in complete, colorful detail the foibles, failings, peccadilloes, dirty tricks, and astounding blunders committed by politicians behaving badly. Amid stories of brawlers, plagiarists, sexual predators, tax evaders, and the temporarily insane, this almanac tells all about:•The only (so far!) president to be arrested while in office: Ulysses S. Grant, who was allegedly issued a ticket for racing his horse and buggy through the streets of Washington, D.C. •The former New Jersey state senator David J. Friedland, who disappeared during a scuba diving accident in 1985. It turns out he staged the accident and served nine years in prison after being captured in the Maldives. •Tape-recorded instructions from highbrow president Franklin Delano Roosevelt on how his staff should carry out some low-down political tricks•The bizarre story of U.S. congressman Robert Potter, who castrated two men he suspected of having affairs with his wife. Potter won election to the state house while in jail—but was kicked out for cheating at cards.•Texas congressman Henry Barbosa Gonzalez: he was charged with assault in 1986 after he shoved and hit a man who called him a communist. Gonzalez was seventy years old at the time. At once shocking and hilariously funny, here’s a book that exposes the history of American politics, warts and all—and makes for hours of jaw-dropping, fascinating, illuminating reading.",
        "Category": " History , United States , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Do You Know TV Stars?: 100 challenging questions about sitcom characters, soap opera villains, heroes and heavies, news anchors and talk show hosts",
        "Authors": "By Robinson, Guy",
        "Description": "For anyone who likes to get behind the scenes!How much do you really know about your favorite actors and actresses?--Their best and worst moments, on-screen and off--TV's juiciest roles, biggest personalities and a few new stars on the horizon--Fascinating stuff that the tabloids missed...and much, much more!100 challenging questions about sitcom characters, soap opera villains, heroes and heavies, news anchors and talk show hosts",
        "Category": " Performing Arts , Television , General",
        "Publisher": "Sourcebooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Good Karma: How to Find It and Keep It",
        "Authors": "By Oliver, Joan Duncan",
        "Description": "",
        "Category": "",
        "Publisher": "DUNCAN BAIRD PUBLISHING",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Defoliation: What Are Our Herbicides Doing To Us? (A Ballantine/Friends of the Earth book)",
        "Authors": "By Thomas Whiteside",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "6.11",
        "Publish Date": {
            "Month": "March",
            "Year": "1970"
        }
    },
    {
        "Title": "Tell the Truth, Tyler (Happy Day® Books: Level 3)",
        "Authors": "By McConnaughhay, Jodee",
        "Description": "Explore the world of Happy Day® Books—filled with fun-to-read stories that teach Christian values. Level 3 books are specifically designed for independent readers and use longer stories, greater vocabulary, paragraphs, and more complex subjects.",
        "Category": " Religion , Christian Ministry , Children",
        "Publisher": "Standard Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Jews, God, and History",
        "Authors": "By Dimont, Max I.",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1964"
        }
    },
    {
        "Title": "Free Money? for Small Businesses and Entrepreneurs (FREE MONEY FOR SMALL BUSINESS AND ENTREPRENEURS)",
        "Authors": "By Blum, Laurie",
        "Description": "Recommended by the L.A. Times, Nation?s Business, Women?s Enterprise, D & B Reports, Small Business Opportunities, and Income Opportunities \"Blum?s book offers valuable tips and navigates fund-seekers through the foundation application and proposal process.\" ?Entrepreneur Laurie Blum knows her way around free money. Her books and fund-raising company have helped thousands of small businesses and entrepreneurs raise sweet capital at little or no cost to themselves. Now, with this Fourth Edition of her bestselling guide, she helps you make the most of the recovering economy by finding the money you need to expand your business, launch a new venture, or buy that new equipment you?ve been waiting for. Nearly one-third of the entries are new with this edition, and all other listings are completely updated. Inside, you?ll find:More than 700 listings of private foundations, government agencies, and sources that provide free or low-cost capital to small businesses and entrepreneurs.Step-by-step instructions on where and how to apply for a grant and how to write a winning proposalA user-friendly format that lists sources by both state and type of businessComplete information on virtually every type of money award available, including: outright grants (money you don?t have to give back), equity investments, letters of credit, and direct low-interest loans, often with extended time periods for repaymentFully updated listings that include contact names, application requirements and procedures, disbursement policies, amounts available, addresses, telephone numbers, and fax numbers",
        "Category": " Business & Economics , Small Business",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Self Instructional Workbook for Emergency Care",
        "Authors": "By Bergeron, J. David",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice-Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "Exploring Psychology, Fifth Edition (Study Guide)",
        "Authors": "By Myers, David G.",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Worth Publishers",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Tamar: A Novel of Espionage, Passion, and Betrayal",
        "Authors": "By Peet, Mal",
        "Description": "\"This beautifully structured and highly suspenseful story of the Dutch Resistance is positively Hitchcockian in its examination of the darker reaches of the human heart.\" – BooklistWhen her grandfather dies, Tamar inherits a box containing a series of clues and coded messages. Out of the past, another Tamar emerges, a man involved in the terrifying world of resistance fighters in Nazi-occupied Holland half a century before. His story is one of passionate love, jealousy, and tragedy set against the daily fear and casual horror of the Second World War –  and unraveling it is about to transform Tamar’s life forever.",
        "Category": " Young Adult Fiction , Historical , Military & Wars",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Russia's Revolution: Essays 1989-2006",
        "Authors": "By Aron, Leon",
        "Description": "It is more the de-revolution that Aron (Russian studies, American Enterprise Institute) discusses in 21 essays describing events and trends in the Soviet Union then Russia for 15 yeas from what he characterizes as the cleansing firestorm of glasnost to Vladimir Putin's increasingly risky post-2003 restoration. He wrote the essays during the periods they recount, and so provide a diary of his impressions. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " History , Europe , Russia & the Former Soviet Union",
        "Publisher": "Aei Press",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "BIBLE STORIES of Boys and Girls",
        "Authors": "By Jane Werner",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "8.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "Proclamation 3: Aids for Interpreting the Lessons for the Church Year, Series B : Advent Christmas",
        "Authors": "By Brueggermann, Walter",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Fortress Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Best DVDs You've Never Seen, Just Missed or Almost Forgotten: A Guide for the Curious Film Lover",
        "Authors": "By Nichols, Peter M. (EDT) and Scott, A. O. (INT)",
        "Description": "Want to look further than the nearest mega-plex?At last, a guide for you.A.O. Scott Stephen HoldenCaryn James Dave KehrPeter M. NicholsIf just trudging to the latest Hollywood blockbuster doesn't appeal to you, The Best DVDs You've Never Seen, Narrowly Missed or Almost Forgotten is the perfect companion. Inside, the film critics of The New York Times have made their top choices for those movies that are unjustly obscure, overlooked or just plain forgotten. * Newly updated reviews of 500 films---all available on DVD!* Sophisticated, intelligent, entertaining, provoking---these films run the gamut.* Each critic's top 10 picks from the book* Introduction by A. O. Scott, chief movie critic for The New York Times The perfect gift for any serious movie buff, no matter what they prefer, from Waiting for Guffman to Happy, Texas, The Opposite of Sex to Belle Epoque. Film noir, documentaries, drama, Westerns, animation, comedies, foreign films, even a few must-see TV shows on DVD---The Best DVDs You've Never Seen, Narrowly Missed or Almost Forgotten has it all.",
        "Category": " Performing Arts , Film , Reference",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Jokes for Children",
        "Authors": "By Kohl, Marguerite & Frederica Young",
        "Description": "",
        "Category": "",
        "Publisher": "Hill",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Pen Pals: A Cartoon Collection",
        "Authors": "By Brookins, Gary, Gorell, Bob",
        "Description": "",
        "Category": "",
        "Publisher": "Richmond Times-Dispatch",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "Cookies, Brownies & Bars",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Ottenheimer Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Illustrated Encyclopedic Dictionary of Building and Construction Terms",
        "Authors": "By Brooks, Hugh",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Prentice-Hall",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "December",
            "Year": "1975"
        }
    },
    {
        "Title": "Nine Months and Counting",
        "Authors": "By Ferrarella, Marie and Temte, Myrna",
        "Description": "A single night of passion changes the lives of two women forever, in Marie Ferrarella's Baby in the Middle, about two friends who come together for the purpose of procreation, and The Forever Night by Myrna Temte, in which comfort leads to passion, pregnancy, and a shocking proposal. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Campbell's Slow Cooker Recipes by Campbell's editors (2009) Hardcover",
        "Authors": "By Campbell's editors",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Lt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Baby Piggy and the Giant Bubble (Can You Imagine) (Jim Henson's Muppet Babies)",
        "Authors": "By Gutelle, Andrew",
        "Description": "",
        "Category": "",
        "Publisher": "Muppet Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Time Management for Busy People",
        "Authors": "By Roesch, Roberta",
        "Description": "Streamlined for busy people who don’t have time to sit down and read a whole book, Time Management for Busy People lets you zero in on the information you need now. You’ll learn mental tricks that can get you to work a few minutes early; discover how to use computers and technology to save time all day long; master the secret of doing two things at once; and even find private time for yourself. Plus you get dozens of quizzes, checklists, and worksheets so you can keep track of the things you must do, the things you should do, and the things you want to do.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Chanukah",
        "Authors": "By Greenfeld, Howard",
        "Description": "Relates the heroic deeds of the Maccabees, honored by Jews throughout the world during the eight days of Chanukah",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Henry Holt and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1976"
        }
    },
    {
        "Title": "The Nature of Greek Myths",
        "Authors": "By Kirk, G. S.",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1975"
        }
    },
    {
        "Title": "The Memoirs of Barry Lyndon, Esq. (Oxford World's Classics)",
        "Authors": "By Thackeray, William Makepeace and Sanders, Andrew (EDT)",
        "Description": "First published in 1844, this is Thackeray's earliest substantial work of fiction and perhaps his most original. The text is that of Saintbury's 1908 Oxford edition which incorporates Thackeray's revisions.",
        "Category": " Fiction , Classics",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "The Great Philosophers: The Lives and Ideas of History's Greatest Thinkers",
        "Authors": "By Law, Stephen",
        "Description": "Spanning over 2500 years of humanity’s quest for understanding, “The Great Philosophers” explores the fundamental ideas that have changed our view of the world.   Interesting biographical portraits, intellectual breakthroughs and a focused explanation of the grand ideas of 50 of the most influential minds ranging from Buddha, Plato Kierkegaard, Sartre and Nietzsche. Highly accessible and thought provoking it is the perfect introduction to philosophy.",
        "Category": " Philosophy , History & Surveys , General",
        "Publisher": "Quercus",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Oxford Companion to World War II",
        "Authors": "By Dear, Ian (EDT) and Foot, M. R. D. (EDT)",
        "Description": "Despite Korea, despite Vietnam, despite a dozen smaller conflicts, a generation of Americans refers to World War II simply as \"the War.\" Indeed, there has been nothing like it in human history: a single war that spanned three continents--a war which saw more men and women under arms, more deaths, and more destruction than any other. Now Oxford University Press provides the definitive one-volume reference to this cataclysmic event. The Oxford Companion to World War II brings together an international team of 140 experts to cover every aspect of the conduct and experience of the conflict, from grand strategic decisionmaking to the struggles of daily life. More than 1,700 entries--ranging from brief identifications to in-depth articles on complex subjects--bring the far-flung elements and events of the war into focus. Here are essays on overarching themes and broad topics, such as the origins of the war, diplomacy, the Greater East Asia Coprosperity Sphere, and the Final Solution. Military campaigns and battles, of course, receive extensive attention: entries include the Fall of France, Operation Barbarossa, and the Battle of Midway, as well as such smaller events as the sinking of the Scharnhorst and the fall of Wake Island. Scores of analytical biographies range from the national leaders--Hitler, Stalin, Tojo, Roosevelt, Churchill--to an array of military and political figures, from Dietrich Bonhoeffer to Ho Chi Minh, from Marshal Timoshenko to General von Manstein. World War II was also an era of technological leaps, covert exploits, and horrific atrocities--and the Companion gives thorough coverage to each, with articles on weapons ranging from tanks to E-boats to rockets, on intelligence organizations (ranging from the O.S.S. to Smersh), and on the German Einstatzgruppen and Todt organization. The Companion also provides exceptional coverage beyond the military and political spheres, revealing the war as it affected the millions of noncombatants. In addition to exploring the economics and social policies of belligerent states, the Companion addresses such topics as children--explaining how hundreds of thousands were evacuated from threatened cities, thrown into combat, killed by bombing raids, or made into orphans. Indeed, the Companion's emphasis on the social history and daily experience of the war makes it the most complete one-volume reference on this critical chapter in history. In addition to thousands of entries, conveniently arranged in an a-to-z format, the book also features hundreds of maps, charts, tables, and evocative photographs. There is no finer resource on the war that shaped the modern world.  Features * More than 1,750 entries ranging from brief identifications to in-depth articles * More than 140 leading international experts have contributed, including David Kennedy, Martin Gilbert, Robert Dallek, Yogi Akashi, Ben-Ami Shillony, Heinz-Dietrich Lowe, Norman Davies, Wilhelm Diest, and many more * Massively illustrated with more than 100 evocative photographs and supplemented by 100 maps, thirty diagrams, and over 170 tables, charts and graphs * Articles on every aspect of the war, including: --surveys of countries, from economics to politics to military structure --portraits of wartime leaders, including generals, admirals, political figures, and heads of state--military campaigns and battles, from the Doolittle Raid to Operation Overlord, from Kassarine Pass to the Warsaw Uprising --intelligence organizations and exploits, from the Abwehr to Smersh, from codebreaking to commando raids --military technology, ranging from submarines to aircraft carriers, from fighter planes to V-1 and V-2 missiles, from the Enigma machine to radar * In-depth coverage of the social aspects of the war, such as the role of women, children, war production, and life under occupation",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "9.45",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "I Am Number Four Movie Tie-in Edition (Lorien Legacies, 1)",
        "Authors": "By Lore, Pittacus",
        "Description": "The first book of the #1 New York Times bestselling series and the inspiration for the hit movie from Dreamworks!John Smith seems like an ordinary teenager, living a normal life with his guardian Henri in Paradise, Ohio. But for John, keeping a low profile is essential, because he is not an ordinary teenager. He’s an alien from the planet Lorien, and he’s on the run. A group of evil aliens from the planet Mogadore, who destroyed his world, are hunting anyone who escaped. Nine Loric children were sent to Earth to live in hiding until they grew up and developed their Legacies, powers that would help them fight back—and help them save us. Three of them are now dead. John is Number Four, and he knows he’s next….Michael Bay, director of Transformers, raved: “Number Four is a hero for this generation.” This epic story is perfect for fans of action-packed science fiction like The 5th Wave series by Rick Yancey, The Maze Runner series by James Dashner, and Orson Scott Card’s Ender’s Game. The battle for Earth’s survival wages on. Read all of the books: #2: The Power of Six, #3: The Rise of Nine, #4: The Fall of Five, #5: The Revenge of Seven, #6: The Fate of Ten, and #7: United as One.Don’t miss the first book in the brand-new I Am Number Four spin-off series: Generation One.",
        "Category": " Young Adult Fiction , Science Fiction , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "How to Buy the Best Sailboat: An Updated Edition of the Leading Consumer Guide With a New Chapter on Selling a Boat",
        "Authors": "By Gustafson, Charles",
        "Description": "Tells how to establish selection criteria, including price, construction, performance, and equipment, and discusses financing, moorage, insurance, and maintenance",
        "Category": " Sports & Recreation , Sailing",
        "Publisher": "Hearst Marine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Evaluating Training Programs: The Four Levels",
        "Authors": "By Kirkpatrick, Donald L.",
        "Description": "An updated edition of the bestselling classic Donald Kirkpatrick is a true legend in the training field: he is a past president of ASTD, a member of Training magazine&apos;s \"HRD Hall of Fame,\" and the recipient of the 2003 \"Lifetime Achievement Award in Workplace Learning and Performance\" from ASTD In 1959 Donald Kirkpatrick developed a four-level model for evaluating training programs. Since then, the \"Kirkpatrick Model\" has become the most widely used approach to training evaluation in the corporate, government, and academic worlds. Evaluating Training Programs provided the first comprehensive guide to Kirkpatrick&apos;s Four Level Model, along with detailed case studies of how the model is being used successfully in a wide range of programs and institutions. This new edition includes revisions and updates of the existing material plus new case studies that show the four-level model in action. Going beyond just using simple reaction questionnaires to rate training programs, Kirkpatrick&apos;s model focuses on four areas for a more comprehensive approach to evaluation: Evaluating Reaction, Evaluating Learning, Evaluating Behavior, and Evaluating Results. Evaluating Training Programs is a how-to book, designed for practitiners in the training field who plan, implement, and evaluate training programs. The author supplements principles and guidelines with numerous sample survey forms for each step of the process. For those who have planned and conducted many programs, as well as those who are new to the training and development field, this book is a handy reference guide that provides a practical and proven model for increasing training effectiveness through evaluation. In the third edition of this classic bestseller, Kirkpatrick offers new forms and procedures for evaluating at all levels and several additional chapters about using balanced scorecards and \"Managing Change Effectively.\" He also includes twelve new case studies from organizations that have been evaluated using one or more of the four levels--Caterpillar, Defense Acquisition University, Microsoft, IBM, Toyota, Nextel, The Regence Group, Denison University, and Pollack Learning Alliance.",
        "Category": " Business & Economics , Training",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Atlas of Life on Earth",
        "Authors": "By Dixon, Dougal, Jenkins, Ian, Moody, Richard, and Zhuravlev, Andrey",
        "Description": "",
        "Category": "",
        "Publisher": "Borders Press",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "I Told the Mountain to Move",
        "Authors": "By Raybon, Patricia",
        "Description": "Raised in a strict, church-going family, award-winning writer Patricia Raybon was shocked to find herself struggling in adulthood with a lifeless marriage and an unsettling distance from God. She set out to rebuild her prayer life, searching for a connection that would transform her household and impact others. But as her prayer journey took off, life interrupted with a mountain of hard, personal challenges. Suddenly in the “school of prayer,” the Christopher Award-winner and popular college professor found herself not only on her knees praying, but at her desk—writing this powerful, inspiring, funny, personal, brave, redemptive account of her quest to rediscover, in the midst of modern-day challenges, God's greatest lesson on life-changing prayer.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "SaltRiver",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "THE HISTORIC HOTELS OF SCOTLAND /ANGLAIS",
        "Authors": "By Wendy Arnold~Robin Morrison",
        "Description": "",
        "Category": "",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Jeanne Jones' Homestyle Cooking Made Healthy: 200 Classic American Favorites Low in Fat With All the Original Flavor",
        "Authors": "By Jones, Jeanne",
        "Description": "Dietary denial is not part of the American dream! And now, thanks to internationally renowned food writer Jeanne Jones, Americans can have their cake and eat it too-- Devil's Food Cake with Fudge Frosting, that is. It's just one of more than 200 beloved comfort foods-- from Deviled Eggs and Barbecued Beef Sandwiches to Creamy Potato Salad, Stuffed Pork Chops, and Cinnamon Sour Cream Coffee Cake-- all \"made over\" to be significantly lower in calories, fat, and sodium without sacrificing any of the taste!Each recipe is carefully explained with numbered steps, so there's never the possiblity of losing your place mid-dish, and each one includes an at-a-glance calorie and fat savings chart as well as a complete listing of the specific nutrients-- plus lots of serving ideas, recipe variations, storage tips, and cooking hints. Sprinkled throughout you'll also find charming American recipe lore, fascinating behind-the-scenes stories of how the most popular recipes were created. And in addition to her expertly-planned party menus, there's an extensive chapter of 33 amazing dessert recipes that includes Apple Crisp, Boston Cream Pie, and Strawberry Shortcake.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "A More Perfect Constitution: Why the Constitution Must Be Revised: Ideas to Inspire a New Generation",
        "Authors": "By Sabato, Larry J.",
        "Description": "\"The reader can't help but hold out hope that maybe someday, some of these sweeping changes could actually bring the nation's government out of its intellectual quagmire...his lively, conversational tone and compelling examples make the reader a more than willing student for this updated civics lesson.\" --The Hill   The political book of the year, from the acclaimed founder and director of the Center for politics at the University of Virginia.A More Perfect Constitution presents creative and dynamic proposals from one of the most visionary and fertile political minds of our time to reinvigorate our Constitution and American governance at a time when such change is urgently needed, given the growing dysfunction and unfairness of our political system . Combining idealism and pragmatism, and with full respect for the original document, Larry Sabato's thought-provoking ideas range from the length of the president's term in office and the number and terms of Supreme Court justices to the vagaries of the antiquated Electoral College, and a compelling call for universal national service-all laced through with the history behind each proposal and the potential impact on the lives of ordinary people. Aware that such changes won't happen easily, but that the original Framers fully expected the Constitution to be regularly revised, Sabato urges us to engage in the debate and discussion his ideas will surely engender. During an election year, no book is more relevant or significant than this.",
        "Category": " History , Americas (North, Central, South, West Indies)",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Mystery on the Underground Railroad (12) (Real Kids Real Places)",
        "Authors": "By Marsh, Carole",
        "Description": "Four children visit an Underground Railroad exhibit and end up trying to solve the disappearance of a professor and some artifacts from the exhibit.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Carole Marsh Mysteries",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Fundamentals of Analytical Chemistry (Saunders Golden Sunburst Series)",
        "Authors": "By Skoog, Douglas A., West, Donald M., and Holler, F. James",
        "Description": "Readability combined with a systematic and rigorous approach characterizes this classic text. Extensive coverage of the principles and practices of quantitative chemistry ensures suitability for chemistry majors.",
        "Category": " Science , Chemistry , Analytic",
        "Publisher": "Brooks Cole",
        "Price Starting With ($)": "7.37",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Gourmet Cooking with 5 Ingredients",
        "Authors": "By Jones, Barbara C. and Anderson, Deborah",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , General",
        "Publisher": "Cookbook Resources, LLC",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Night Launch",
        "Authors": "By Cohen, Stephen Paul and Garn, Jake",
        "Description": "As the first Soviet-American space mission is about to be launched, the crew prepares to make aeronautic history, but one person aboard is a spy with terrorist ties who could steer the shuttle toward tragedy",
        "Category": " Fiction , General",
        "Publisher": "Popular Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "The Principal Challenge: Leading and Managing Schools in an Era of Accountability (Jossey Bass Education Series)",
        "Authors": "By Codding, Judy B. (EDT) and Tucker, Marc S. (EDT)",
        "Description": "A Blueprint for Developing Tomorrow's School LeadersBased on two years of research supported by Carnegie Corporation of New York, The Broad Foundation, and the New Schools Venture Fund, The Principal Challenge focuses directly on the causes and cures of the crisis in school leadership. Marc Tucker, Judy Codding, and a stellar list of experts from the United States and abroad paint a revealing portrait of what it means to be a principal now, how and why most graduate schools of education have failed to provide the training principals need, what the military and business sectors do to create and support their leaders and managers, what the state of the art in professional training looks like, what other nations are doing to address this problem, and how to apply the very best practices in the world to solve the crisis in school leadership.This book is honest and hard-hitting. And it offers realistic solutions. Based on the thorough analysis provided by the chapter authors, the editors of The Principal Challenge offer an imaginative proposal for a new kind of institution that will train school principals to be turn-around artists. Drawing on the new forms of executive development programs in our business schools, they propose a similar program for school principals. The approach involves a close collaboration between the new institution and entire school districts, combining face-to-face instruction with web-based delivery. The innovative curriculum they describe, like the best approaches in business and industry, uses carefully developed cases, simulations, games, action projects, seminars and journaling, The editors offer a clear conception of what it might mean to be an instructional leader, a way of thinking about what it takes for a principal to be a strategic thinker, an approach that principals can use to take advantage of the best current thinking on knowledge management and professional development, a conception of the principal as school designer, an emphasis on the use of data to drive planning, and a host of tested ideas that principals can use to lead their schools to better results.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "A Deadly Pate (Fran Kirk Series)",
        "Authors": "By Furie, Ruthe",
        "Description": "When her aunt's reputation as a gourmet chef is challenged by the poisoning death of a rival, Fran Kirk travels to France to discover who besides her aunt may have wanted the victim to die. Original.",
        "Category": "",
        "Publisher": "Avon Books (Mm)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Creative Wall Decorating (Creating Your Home Series)",
        "Authors": "By Betterway Books",
        "Description": "",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Betterway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Kidfun Activity Book",
        "Authors": "By Feldscher, Sharla and Lieberman, Susan",
        "Description": "Designed for children ages two-and-a-half to eight, hundreds of creative, fun, practical, and educational games and activities are guaranteed to ward off boredom in many ordinary situations, from riding in the car to waiting in line. Original.",
        "Category": "",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Religions of Japan: Many Traditions Within One Sacred Way (Religious Traditions of the World)",
        "Authors": "By Earhart, H. Byron",
        "Description": "Traces the history of Japanese religious customs, describes modern religious practices, and explains the Japanese world view",
        "Category": " Religion , Buddhism , General",
        "Publisher": "Harper San Francisco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "German Shepherd Dog: A Comprehensive Guide to Owning and Caring for Your Dog (Comprehensive Owner's Guide)",
        "Authors": "By Samms, Susan",
        "Description": "Since the breed’s creation at the turn of the twentieth century, the German Shepherd Dog has been one of the world’s most sought-after purebred dogs, prized for his intelligence, handsome looks, and uncanny versatility. This Comprehensive Owner’s Guide serves as an ideal introduction to this dog of dogs, that serves humankind as a companion, protector, police dog, herding dog, military dog, search and rescue dog, Seeing Eye dog, and therapy dog, to name a few of the breed’s modern-day roles.. The breed’s origins are retold in the first chapter, beginning with the efforts of Max Emil Friedrich von Stephanitz to standardize the sheep-herding dogs in Germany in the 1890s and following the breed’s importation to the United States, where the German Shepherd Dog has been a favored companion, show dog, and competition trial dog since the 1920s. The chapter on the breed’s characteristics focuses on owner suitability, describing the GSD’s physical and mental traits, versatility, agility, and requirements.  The breed standard is presented in the third chapter, giving the readers a clear view of how the ideal GSD should look, act, and move.New owners will welcome the well-prepared chapter on finding a reputable breeder and selecting a healthy, sound puppy. Chapters on puppy-proofing the home and yard, purchasing the right supplies for the puppy as well as house-training, feeding, and grooming are illustrated with photographs of handsome adults and puppies. In all, there are over 135 full-color photographs in this useful and reliable volume. The author’s advice on obedience training will help the reader better mold and train into the most well-mannered dog in the neighborhood. The extensive and lavishly illustrated chapter on healthcare provides up-to-date detailed information on selecting a qualified veterinarian, vaccinations, preventing and dealing with parasites, infectious diseases, and more. Sidebars throughout the text offer helpful hints, covering topics as diverse as historical dogs, breeders, or kennels, toxic plants, first aid, crate training, carsickness, fussy eaters, and parasite control. Fully indexed.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "CompanionHouse Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Parables the Greatest Stories Ever Told: 12 Studies for Individuals or Groups (Lifeguide Bible Studies)",
        "Authors": "By White, John",
        "Description": "",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Intervarsity Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "The Freelance Writer's Handbook: How to Succeed in a Competitive Business",
        "Authors": "By Hensley, Dennis E. and Miller, Holly G.",
        "Description": "Discusses competition, effective submissions, query letters, topic selection, writing formats, interviews, multiple sales, and the financial aspects of being a writer",
        "Category": " Language Arts & Disciplines , Journalism",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "The Spell of the Yukon",
        "Authors": "By Service, Robert W.",
        "Description": "",
        "Category": " Poetry , American , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "St. Mary's Catholic Church, Alexandria, Virginia: The Oldest Catholic Parish in the Commonwealth of Virginia",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "The LaVor Group",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Unofficial Guide to Bed & Breakfasts and Country Inns in the Mid-Atlantic (Unofficial Guides)",
        "Authors": "By Sturm, Barbara",
        "Description": "For Travelers Who Want More Than the Official Line!Five Reasons Why This Is the Best B&B Series You Can Buy:* Complete Coverage. Profiles and evaluations of 300 top inns and B&Bs in all price categories, from budget to deluxe, plus a directory of 300 other great places to stay, and lovely illustrations.* Critical Evaluations. Objective ratings and rankings of each B&B (other B&B guides read like promotional brochures).* Personal Inspections. Each B&B personally inspected by independent travel professionals (most other guides are written by the innkeepers themselves).* Honest Selection Process. Each B&B chosen on its own merits; no fees are accepted (other guides charge innkeepers).* Ideal for Families & Pet Lovers. Identifies pet- and kid-friendly places, and recommends the best rooms",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "World's Easiest Pocket Guide To Finding Your First Full-Time Job",
        "Authors": "By Burkett, Larry, Save, Ken (ILT), and Strauss, Ed",
        "Description": "'The World's Easiest Pocket Guide' brand is filling a vacuum in the bookselling marketplace with an introductory level series on subjects affecting important lifestyle issues. Each product features a highly recognizable author writing on topics of his or her expertise.Shortly after leaving home or college, most young adults are unprepared for making practical life decisions and planning for their futures. Leading financial expert Larry Burkett has created this practical pocket guide to help young adults make sound financial decisions from the start. Filled with bite-sized chunks of trustworthy advice, readers will be better equipped to choose the right first job or career.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Palace Circle: A Novel",
        "Authors": "By Dean, Rebecca",
        "Description": "Palace intrigue, romance, and illicit affairs—Rebecca Dean has written a glorious novel that will sweep Philippa Gregory fans off their feet.Delia Chandler, an eighteen-year-old Southern girl, marries Viscount Ivor Conisborough just before World War II, becoming part of the Windsor court. It’s every girl’s dream come true. But Delia is jolted from her pleasant life when she realizes, after the birth of her two daughters, that Ivor chose her only to bear an heir to his estate. Shortly thereafter, she begins an affair with her husband’s handsome, titled, and frequently scandalous best friend.When Conisborough is appointed as an adviser to King Fuad of Egypt, Delia exchanges one palace circle for another, far different one. While she sees Egypt as a place of exile, her two daughters regard Egypt as their home. Only when war comes to Cairo—and Delia finally reveals the secret she has kept for so long—can she begin to heal the divisions separating her from those she loves.Rebecca Dean’s irresistible combination of real events and masterful storytelling will keep readers fascinated until the very last page.",
        "Category": " Fiction , Historical",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "HORSE CALLED STARFIRE (Bank Street Level 3*)",
        "Authors": "By Boegehold, Betty Virginia Doyle",
        "Description": "Follows the adventures of a young Native American boy and his horse, Starfire",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Bank Street",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "The Unwritten Rules of Friendship: Simple Strategies to Help Your Child Make Friends",
        "Authors": "By Elman, Natalie Madorsky and Kennedy-Moore, Eileen",
        "Description": "A practical parenting handbook explains how to enhance any child's social skills by identifying individual social strengths and weaknesses, using case studies, drills, and exercises designed to help a child understand the complexities of social interactions and build lasting relationships with others. Original.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Government in America: People, Politics, and Policy: Advanced Placement Edition",
        "Authors": "By Wattenberg, Martin P., Lineberry, Robert L., and Edwards, George C. (EDT)",
        "Description": "",
        "Category": " Political Science , American Government , General",
        "Publisher": "Pearson",
        "Price Starting With ($)": "8.03",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Success God's Way: Achieving True Contentment And Purpose",
        "Authors": "By Stanley, Charles F.",
        "Description": "\"Success is defined by a continuing desire to be the person God called you to be and to achieve those goals that God helps you to set,\" says Charles Stanley. In Success God's Way, Stanley teaches God's principles for success, including ten steps to help you reach God's goals in your life, and what to do about the seven success blockers that entangle believers.\"Dr. Stanley has defined success in a timeless manner?knowing and doing the will of God. When a person knows Christ personally and consistently obeys the principles of Scripture, he is prepared for success God's way.\" ?Franklin Graham, Chairman and CEO, Samaritan's Purse; CEO, Billy Graham evangelistic Association\"In a society that increasingly judges the success of individuals by the clothes they wear, the car they drive, the club they belong to, or the career they choose, the church desperately needs to reaffirm biblical standards. Once again, Dr. Stanley has brought clear focus to a timely issue. Success God's Way challenges readers to reexamine whether or not they are sacrificing genuine, lasting success on the altar of a worldly, temporary counterfeit and therefore sesttling for a lot less than what God wants to give them.\" ?Anne Graham Lotz, International Bible Teacher and Bestselling Author\"In an age when our thinking is skewed, our zeal is waning, and our desire for excellence is deadened by apathetic self-centeredness, this book presents many biblical insights that challenge us to hear God's Word to Joshua to meditate on God's Word and be strong and courageous so we can have success.\" ?Kay Arthur, Precept Ministries International",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "What Your Handwriting Reveals",
        "Authors": "By Hughes, Albert E.",
        "Description": "",
        "Category": " Self-help , Handwriting Analysis",
        "Publisher": "Wilshire Book Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "101 Things The Devil Can't Do",
        "Authors": "By Sparks, Maisie (EDT)",
        "Description": "The author who brought you the inspirational 101 Things God Can't Do now shows you101 Things the Devil Can't Do. Filled with instant encouragement, this little treasure shows you thatThe Devil can't win.The Discourager can't keep you depressed.The Bad Habit can't ruin your life anymore.Satan can't get God's glory or God's children.101 Things the Devil Can't Do turns discouragement into encouragement, transforms trouble into an opportunity for overcoming, and reminds Christians that they can stand victorious in the love of God.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Our Potomac, from Great Falls Through Washington, D.C.",
        "Authors": "By Sewell, Roy (PHT) and Sewell, Roy",
        "Description": "",
        "Category": " Photography , Subjects & Themes , Regional",
        "Publisher": "Image Publishing",
        "Price Starting With ($)": "13.61",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Twelve seconds to the moon: A story of the Wright brothers",
        "Authors": "By Young, Rosamond McPherson",
        "Description": "",
        "Category": "",
        "Publisher": "Journal Herald",
        "Price Starting With ($)": "43.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Your Power To Heal (Incredible Natural Ways to Manage Your Weight, Fight Diabetes, Etc.)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "FC&A",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "First 200 Words in German (Little Library) (English and German Edition)",
        "Authors": "By Khan, Christa and Sleight, Katy (ILT)",
        "Description": "Labeled scenes feature German words and their English equivalents, grouped around subjects such as clothing, toys, animals, transportation, and opposites",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Kingfisher Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Complete Horse Riding Manual",
        "Authors": "By Micklem, William",
        "Description": "Horses allow ordinary people to do extraordinary things, and this extraordinary book shows you how.Now revised and updated, the Complete Horse Riding Manual covers dressage, show jumping, and cross-country riding, detailing everything you need to know to compete in these events, whether you are a beginner or more experienced rider.Complete Horse Riding Manual is brimming with advice on finding the best horse for you, training a young horse, forming the ultimate horse-and-rider team, boosting and maintaining your own physical fitness and suppleness, and building the fitness and stamina of your horse.",
        "Category": " Pets , Reference",
        "Publisher": "DK",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Eve of the Emperor Penguin",
        "Authors": "By Murdocca, Sal (ILT) and Osborne, Mary Pope",
        "Description": "The #1   bestselling chapter book series of all time celebrates 25 years with new   covers and a new, easy-to-use numbering system! Jack and Annie arrive on the one continent they haven’t visited before:   Antarctica! What can they hope to learn about happiness in such a barren   place? Only the penguins know for sure…Jack and Annie are about to find   out!Formerly numbered as Magic Tree House #40, the title of this book is now Magic Tree House Merlin Mission #12: Eve of the Emperor Penguin. Did you know that there’s a Magic Tree House book for every kid? Magic Tree House: Adventures with Jack and Annie, perfect for readers who   are just beginning chapter books Merlin Missions: More challenging adventures for the   experienced reader Super Edition: A longer and more dangerous adventure Fact Trackers: Nonfiction companions to your favorite Magic Tree House   adventures Have more fun with Jack and Annie at MagicTreeHouse.com!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Adventures of Hercules",
        "Authors": "By Conklin, Thomas",
        "Description": "Hercules, the half-human son of Zeus, follows a series of exciting adventures in which he challenges a deadly hydra, overpowers the giant Antaeus, tames the wild horses of King Diomedes, defeats the queen of the Amazons, and more. Original.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Essential French (Usborne Essential Guides) (English and French Edition)",
        "Authors": "By Irving, Nicole and Colvin, Leslie",
        "Description": "",
        "Category": " Juvenile Nonfiction , Reference , Dictionaries",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Madagascar: Escape 2 Africa: Lost in Africa",
        "Authors": "By Katschke, Judy (ADP)",
        "Description": "Track down Alex, Marty, Gloria, Melman, and those crazy penguins as they set out from Madagascar to go home, but end up in the African plains—where they have the time of their lives!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Blood Harvest",
        "Authors": "By Gottesfeld, Gary",
        "Description": "Rena Halbrook welcomes the visit of her dear friend Maura McKinney, but she does not welcome a crucifixion on her property, and with the help of reporter Charlie Halleran, she attempts to find the killer, who may be Maura",
        "Category": " Fiction , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Secrets of Paris: A Novel",
        "Authors": "By Rice, Luanne",
        "Description": "Irresistible, long sought by readers, and now in paperback for the first time, Secrets of Paris shows New York Times bestselling author Luanne Rice at her most incandescent—a deeply moving story of true love, abiding friendship, and a once perfect marriage in precarious balance.   Lydie McBride has always embraced life to the fullest. But when an unthinkable tragedy strikes her family, everything she believes in is shattered. Her art-historian husband, Michael, watches the passion disappear from Lydie’s eyes and from their marriage, and hopes an assignment to Paris will help them reclaim a love that once seemed unassailable. But the City of Lights holds secrets and seductions for them both, including the mysteries of an alluring Frenchwoman with whom Michael will work. And Lydie’s unexpected friendship with two dramatically different women will enable her to find a new life. Will there be a place for the man with whom she always wanted to share that life . . . if she can find him again?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "I'll Walk Alone: A Novel",
        "Authors": "By Clark, Mary Higgins",
        "Description": "THE QUEEN OF SUSPENSE IS BACK! Mary Higgins Clark’s new novel—the thirtieth and most spine-chilling of her long career as America’s most beloved author of suspense fiction— is about the newest and most up-to-date of crimes: identity theft. Who has not read about—or experienced—with a sinking feeling the fear that someone else out there may be using your credit cards, accessing your bank account, even stealing your identity. In I ll Walk Alone, Alexandra “Zan” Moreland, a gifted, beautiful interior designer on the threshold of a successful Manhattan career, is terrified to discover that somebody is not only using her credit cards and manipulating her financial accounts to bankrupt her and destroy her reputation, but may also be impersonating her in a scheme that may involve the much more brutal crimes of kidnapping and murder. Zan is already haunted by the disappearance of her own son, Matthew, kidnapped in broad daylight two years ago in Central Park—a tragedy that has left her torn between hope and despair. Now, on what would be Matthew’s fifth birthday, photos surface that seem to show Zan kidnapping her own child, followed by a chain of events that suggests somebody—but who? Zan asks herself desperately, and why?—has stolen her identity. Hounded by the press, under investigation by the police, attacked by both her angry ex-husband and a vindictive business rival, Zan, wracked by fear and pain and sustained only by her belief, which nobody else shares, that Matthew is still alive, sets out to discover who is behind this cruel hoax. What she does not realize is that with every step she takes toward the truth, she is putting herself— and those she loves most—in mortal danger from the person who has ingeniously plotted out her destruction. Even Zan’s supporters, who include Alvirah Meehan, the lottery winner and amateur detective, and Father Aiden O’Brien, who thinks that Zan may have confessed to him a secret he cannot reveal, believe she may have kidnapped little Matthew. Zan herself begins to doubt her own sanity, until, in the kind of fast-paced explosive ending that is Mary Higgins Clark’s trademark, the pieces of the puzzle fall into place with an unexpected and shocking revelation. Deeply satisfying, I’ll Walk Alone is Mary Higgins Clark at the top of her form.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "Oh. My. Gods.",
        "Authors": "By Childs, Tera Lynn",
        "Description": "When Phoebe's mom returns from Greece with a new husband and plans to move to an island in the Aegean Sea, Phoebe's well-plotted senior year becomes ancient history. Now, instead of enjoying a triumphant track season and planning for college with her best friends, Phoebe is trying to keep her head above water at the &#129;berexclusive Academy. If it isn't hard enough being the new kid in school, Phoebe's classmates are all descendents of the Greek gods! When you're running against teammates with superpowers, dealing with a stepsister from Hades, and nursing a crush on a boy who is quite literally a god, the drama takes on mythic proportions!",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Speak",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "The Last Pope (A Vatican Novel)",
        "Authors": "By Rocha, Luis Miguel",
        "Description": "Almost thirty years after the world was stunned by the shocking death of Pope John Paul I, journalist Sarah Monteiro finds an envelope stuffed in her mailbox. The contents hold the key to uncovering the truth about that mysterious death. Drawn into a vortex in which deadly mercenaries, crooked politicians, and princes of the Church itself have formed an alliance of deception, Sarah must decide between revealing the truth and saving her own soul.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Rainbow Fish & Friends Star of the Sea",
        "Authors": "By Gail Donovan",
        "Description": "",
        "Category": "",
        "Publisher": "Holiday House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "A Dance With Deception: Revealing the Truth Behind the Headlines",
        "Authors": "By Colson, Charles",
        "Description": "Charles Colson never pulls punches in confronting the myths of modern life in light of God's truth. In A Dance With Deception, he shatters politically correct assumptions about such issues as media morality, public education, and gays in the military while challenging Christians to be salt and light in a world of deception.",
        "Category": " Religion , Christianity , History",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Beat the Slots",
        "Authors": "By Jensen, Marten",
        "Description": "Slots are now the casino's most popular casino game with more players than ever looking to win the big jackpot.  Jensen shows you the secrets of profitable machines and how to increase your chances for a big jackpot!  Written in conversational style, this easy-to-read book has information on not only finding and beating the best machines, but how to earn points, free rooms and meals, and even cash back by joining the slots clubs.  Lots of information, including the basics of play, how to find the machines and casinos with the most frequent and largest payoffs, the different types of machines, the history of slots, insider advice on how to avoid losing machines (in airports, by show lines) and how to find the most profitable machines.  164 pages",
        "Category": " Games , Gambling , General",
        "Publisher": "Cardoza",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Thirty First Floor",
        "Authors": "By Peter Wahloo",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1971"
        }
    },
    {
        "Title": "The Ultimate College Survival Guide",
        "Authors": "By Worthington, Janet Farrar and Farrar, Ronald",
        "Description": "Offers new college students advice on packing, dorm life, opening a bank account, homesickness, selecting classes, managing time, preparing for tests, extracurricular activities, dating, and choosing a major",
        "Category": "",
        "Publisher": "Petersons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Mark Twain: Unabridged Library Classics (Greenwich unabridged library classics)",
        "Authors": "By Twain, Mark",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "Nancy: Life of Lady Astor",
        "Authors": "By Sykes, Christopher",
        "Description": "",
        "Category": "",
        "Publisher": "Panther",
        "Price Starting With ($)": "6.91",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "The God File",
        "Authors": "By Hollon, Frank Turner",
        "Description": "",
        "Category": "",
        "Publisher": "Macadam",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Opera: A New Way of Listening",
        "Authors": "By Waugh, Alexander",
        "Description": "With the help of dozens of extracts on the accompanying music CD, Alexander Waugh examines the different categories of voice and how to recognize them, and explores the relationship between the words and the music. He looks at the elements of live performance - from the star singers and producers to the chorus and orchestra - before taking a unique look behind the scenes at an opera house, following the preparations for an opera through rehearsals and set-building to the opening night.The heart of the book explores eight of the world's best-loved operas, including Mozart's action-packed Don Giovanni, Bizet's sensuous Carmen, and Puccini's impassioned Tosca. A key song from each opera is featured on the CD and analyzed moment-by-moment on an annotated \"timeline,\" while the text discusses the musical and dramatic importance of the opera as a whole and looks at other celebrated operas by the same composer. With a listeners' guide to a further fifty essential operas, Opera: A New Way of Listening provides everything you need to know to enjoy the drama and beauty of this rich art.",
        "Category": " Music , Genres & Styles , Opera",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Children's Clothing of the 1800s (Historic Communities (Paperback))",
        "Authors": "By Kalman, Bobbie and Schimpky, David",
        "Description": "Introduces children's form of dress during the 19th century, and the making of clothing and its care",
        "Category": " Juvenile Nonfiction , History , United States , General",
        "Publisher": "Crabtree Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Hugs to Brighten Your Day: Stories, Sayings, and Scriptures to Encourage and Inspire (Hugs Series)",
        "Authors": "By Moore, Ashley and Robertson, Korie",
        "Description": "When the skies of your life are gray and you feel as if the rainbow will never appear after the rain, Hugs to Brighten Your Day is the perfect remedy to clear away your gloom! Bursting with page after page of uplifting messages, encouraging stories, and poignant sayings, this delightful little book is sure to turn your gray skies blue! Part of the best-selling Hugs series, this pick-me-up will energize your spirits and light up your day.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Seasons of the Heart from the Salesian Collection",
        "Authors": "By Sara Tarascio",
        "Description": "",
        "Category": "",
        "Publisher": "Salesian Missions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Trees of Christmas",
        "Authors": "By Metcalfe, Edna",
        "Description": "Photographs of Christmas trees, decorated in the traditional styles of twenty-three countries, are accompanied by a descriptive text and detailed instructions for making the ornaments",
        "Category": " Religion , General",
        "Publisher": "Abingdon Pr",
        "Price Starting With ($)": "16.66",
        "Publish Date": {
            "Month": "September",
            "Year": "1979"
        }
    },
    {
        "Title": "The Foliage Garden: Creating Beauty Beyond Bloom",
        "Authors": "By Overy, Angela and Proctor, Rob (PHT)",
        "Description": "Explaining how to use combinations of foliage plants to create stunning variations in color, size, and texture, this practical gardening book describes more than four hundred foliage plants and provides a complete guide to foliage gardening. 15,000 first printing.",
        "Category": " Gardening , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "The Enduring Years",
        "Authors": "By Claire Rayner",
        "Description": "",
        "Category": "",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "10.78",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Maryland and Delaware Canoe Trails",
        "Authors": "By Gertler, Edward",
        "Description": "",
        "Category": " Sports & Recreation , Canoeing",
        "Publisher": "Seneca Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Reasons",
        "Authors": "By McDowell, Josh and Stewart, Don",
        "Description": "In a convenient question-and-answer format, the authors address many of the commonly asked questions about the Bible and evolution.",
        "Category": " Religion , Religion & Science",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Audrey: A Life in Pictures",
        "Authors": "By Carol Krenz",
        "Description": "",
        "Category": "",
        "Publisher": "Metro Books",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Smith's Bible Dictionary",
        "Authors": "By Smith, William, Peloubet, F. N., and Peloubet, M. A.",
        "Description": "A classic reference, this comprehensive Bible dictionary provides a wealth of basic background information in a very affordable format.  Nelson's edition is revised and edited by F. N. and M. A. Peloubet to be even more applicable to today's Bible student.  It includes more than 400 illustrations and special articles in addition to page after page of basic information.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Thomas Nelson Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "Martin Yan Quick and Easy",
        "Authors": "By Giblin, Sheri (PHT), Yan, Martin, and Jan, Stephanie Liu (PHT)",
        "Description": "The companion volume to Martin Yan's new PBS series of the same name, this cookbook is the ideal introduction to Asian cooking. Wok-full of great tips and techniques, plus sources for easily locating unusual ingredients, here are more than 150 truly easy recipes that taste great and cook up fast -- all in under 30 minutes! Classic potstickers with spicy dipping sauce can be made ahead and frozen for impromptu guests-to-impress dinners. Korean-Style Lamb Chops pair up perfectly with crisp-and-tender Flash-Fried Asparagus and Long Beans. For those who like it hot, Three-Alarm Firecracker Shrimp packs a spicy punch with a menage a trois of chiles until Coconut Custard creaminess cools things down. Basics include the recipe for mastering steamed rice, a glossary of terms (know your miso from your mirin), and striking photographs throughout illustrating the food, essential equipment, and helpful techniques. No one is as well-known or well-loved for bringing Asian food into our home kitchens. With foolproof recipes conjured up fast, Martin Yan works his magic once again!",
        "Category": " Cooking , Regional & Ethnic , Asian",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    }
]