[
    {
        "Title": "A Perfect Peace",
        "Authors": "By Oz, Amos",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "The Age of Energy: Varieties of American Experience, 1865-1915",
        "Authors": "By Howard Mumford Jones",
        "Description": "",
        "Category": "",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1971"
        }
    },
    {
        "Title": "Let History Judge: The Origins and Consequences of Stalinism",
        "Authors": "By Roy A. Medvedev",
        "Description": "",
        "Category": "",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "ICGA Proceedings 1989",
        "Authors": "By Schaffer, J. David (EDT)",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Morgan Kaufmann",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "The Success Factor",
        "Authors": "By Lecker, Sidney",
        "Description": "Describes the qualities of a successful person, discusses the importance of self-image, and offers advice on setting goals",
        "Category": " Psychology , General",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Lionhearts: Heroes of Israel",
        "Authors": "By Bar-Zohar, Michael (EDT)",
        "Description": "A best-seller in Israel, a volume of heroic stories from Zionist history represents the collaboration of fifty of its leading political, military, and cultural figures, including Benjamin Netanyahu and Yitzhak Shamir. 50,000 first printing.",
        "Category": " Biography & Autobiography , Cultural Heritage",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Good-bye Book",
        "Authors": "By Chorao, Kay (ILT) and Viorst, Judith",
        "Description": "His mother and father are getting dressed to go out to dinner together. He doesn't want them to go! They're going out and leaving him with a sitter. He hates that a lot! He pleads with them. He bargains with them. He threatens to run away to a family that doesn't ever go out for the evening. He tells them he's sick, with a temperature of maybe a hundred and ten. And he tells them he won't -- he'll never -- say good-bye. Every child, and every child's parent, will recognize this oh-so-familiar struggle between grown-ups trying to go out for an evening and a child who is fiercely determined to make them stay. It's hard to say good-bye -- but maybe a book that helps you to laugh can make saying good-bye a little easier.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Beating the Dow: A High-Return, Low-Risk Method for Investing in the Dow Jones Industrial Stocks With As Little As $5,000",
        "Authors": "By Downes, John and O'Higgins, Michael",
        "Description": "O'Higgins shows how all investors can get spectacular results with below-average risk by investing in the 30 stocks that make up the Dow Jones Industrial Average. First published (hardcover) in 1991. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Miss Lonelyhearts & the Day of the Locust",
        "Authors": "By West, Nathanael",
        "Description": "Two short novels, one set in New York and the other in Hollywood, dramatically depict the extremes of the human condition and the destructive forces pervading modern American life",
        "Category": " Fiction , Literary",
        "Publisher": "New Directions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Welcoming Your Second Baby (Family & Childcare)",
        "Authors": "By Lansky, Vicki",
        "Description": "Explains how to prepare a first child for the birth of a second and offers tips on coping with rivalries, jealousy, regression, adoption, new space needs, miscarriage, and other key factors",
        "Category": " Family & Relationships , General",
        "Publisher": "Book Peddlers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "A New Headstart",
        "Authors": "By Dominic A. Brandy, MD, Dominic A. Brandy, MD",
        "Description": "",
        "Category": "",
        "Publisher": "Longmeadow Press",
        "Price Starting With ($)": "10.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Salads",
        "Authors": "By Rahaniotis, Angela (Editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Brimar",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The First Emperor of China: The Greatest Archeological Find of Our Time",
        "Authors": "By Cotterell, Arthur",
        "Description": "Provides a detailed view of the Chinese emperor Ch'in Shih-huang-ti, and discusses how the discovery of an entire larger-than-life ceramic army buried with him, reveals many facts about ancient China",
        "Category": "",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.92",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "The Everyday Guide to the Bible: a Friendly and Informative Guide to the Old and New Testaments",
        "Authors": "By Smith, Carol",
        "Description": "A simple introductory guide to the Bible with time lines, definitions, and book-by-book synopses.",
        "Category": "",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Winning On Wall Street",
        "Authors": "By Zweig, Martin E. and Goldfischer, Morrie (EDT)",
        "Description": "Renowned financier Martin Zweig guides readers to smart investing in the 1990s stock market with proven strategies on how to make informed buy and sell decisions, pick winners, spot major bull and bear trends early, and more. This constant bestseller was first published in 1986 and first revised in 1990, with 77,000 trade paperback copies sold.",
        "Category": " Business & Economics , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Desert Shield: The Build-Up : The Complete Story (Power Series)",
        "Authors": "By Dorr, Robert F.",
        "Description": "Describes the deployment of American military forces in Saudi Arabia and the Persian Gulf for Operation Desert Shield, discusses naval and ground operations, and outlines the preparations for battle in the desert",
        "Category": " History , General",
        "Publisher": "Motorbooks Intl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Showing America a New Way Home: Expanding Opportunities for Home Ownership (Jossey Bass Public Administration Series)",
        "Authors": "By Johnson, James A",
        "Description": "Since 1968 Fannie Mae, the nation's largest financial institution and a major force in the housing market, has provided more than $1.5 trillion in housing financing. Fannie Mae's chairman and CEO James A. Johnson - the most significant leader in our country's housing finance system - has dedicated his organization to reducing housing costs, eliminating mortgage discrimination, and expanding opportunities for the millions of Americans who dream of owning their own homes. In this book, Johnson explains the major forces shaping current patterns of home ownership and describes new ways of making homes more affordable to all Americans. He shows how recent forces like the investor-based mortgage system, advances in technology, changing demographics, and other factors are converging to create the greatest increase in home ownership since the post-World War II housing boom.Johnson reveals the details of the plans Fannie Mae is pursuing in order to increase home ownership, strengthen the housing industry and boost the economy. He relates the history of home ownership to the cultural, economic, and political landscape of the United States. And his exploration of discrimination and the many other barriers that keep people from buying homes today will be of particular interest to real estate executives, mortgage bankers, community leaders, policy makers, and potential home owners.",
        "Category": " Business & Economics , General",
        "Publisher": "Jossey-Bass Inc Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Art of Happiness at Work",
        "Authors": "By Dalai Lama XIV and Cutler, Howard C.",
        "Description": "From the authors who brought you the million-copy bestseller The Art of Happiness comes an exploration of job, career, and finding the ultimate happiness at work.Over the past several years, Howard Cutler has continued his conversations with the Dalai Lama, asking him the questions we all want answered about how to find happiness in the place we spend most of our time. Work-whether it's in the home or at an office-is what mostly runs our lives. We depend on it to eat, to clothe and shelter ourselves, and to take care of our families. Beginning with a direct correlation between productivity and happiness, Dr. Cutler questions His Holiness about the nature of work. In psychiatry and according to the Dalai Lama, our motivation for working determines our level of satisfaction. The book explores three levels of focus: survival, career, and calling. Once again, Cutler walks us through the Dalai Lama's reasoning so that we know how to apply the wisdom to daily life. This practical application of Buddhist ideas is an invaluable source of strength and peace for anyone who earns a living.",
        "Category": " Religion , Buddhism , General",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Effect of Living Backwards",
        "Authors": "By Julavits, Heidi",
        "Description": "Following her acclaimed debut, The Mineral Palace, Heidi Julavits presents a quirky, compelling novel about two sisters, a bizarre event, and the elusive nature of truth—a New York Times Notable Book.Does Alice really hate her sister, or is that love? Was she really enrolled in grad school, or was that an elaborate hoax? Is this really a hijacking, or is it merely the effect of living backwards?“Heidi Julavits—no stranger to edgy, dark topics—takes liberties with conventional notions of hijacking and hostages, weaving humor in a zingy and brainy spectrum...If you can take successive shots of wit with gulps of moral inquisition, then this fine book is for you.”—Milwaukee Journal Sentinel",
        "Category": " Fiction , Literary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Second Assistant: A Tale from the Bottom of the Hollywood Ladder (Lizzie Miller)",
        "Authors": "By Naylor, Clare and Hare, Mimi",
        "Description": "Los Angeles Times bestsellerA fast-paced, breezy read about life at the bottom of the Hollywood food chain, for fans of The Devil Wears Prada and The Nanny Diaries No political science degree could ever prepare Elizabeth Miller for her new job as a second assistant at The Agency, whose clients include everyone you’ve never met—but you know who they’re sleeping with. A former congressional intern in Washington, Lizzie made a bid for a life change that landed her a job a world away, where ethics and First Amendment debates take a backseat to pleading the Fifth for Ritalin-snorting boss Scott Wagner. He’s the hottest young agent in Hollywood, who devotes his days to playing online poker—that is, when he’s not closing a $30 million deal for one of his AAA-list clients. And while getting six-hundred-dollar highlights from Cameron’s colorist or organizing the strippers for George’s birthday party come close to causing heart failure for this East Coast girl, the real dangers lurk elsewhere. But Lizzie is a  survivor, and no Machiavellian assistant, lecherous producer, or power struggle at The Agency can douse her nascent dreams of climbing up the Hollywood ladder. But first she has to run down to the Coffee Bean to pick up that triple espresso, or Scott is going to throw something....",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Actual : A Novella",
        "Authors": "By Bellow, Saul",
        "Description": "The Nobel Prize and National Book Award-winning novelist introduces Harry Trellman, an aging businessman and lifelong outsider whose forty years of longing for an interior decorator is fulfilled, thanks to a billionaire friend. Reprint.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Trusting Heart",
        "Authors": "By Williams, Redford B.",
        "Description": "Describes techniques designed to neutralize Type A behaviors--such as hostility, cynicism, and anger--that may induce health problems and to encourage the emotionally and physically beneficial aspects of a Type A personality",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "The Dance of Deception: A Guide to Authenticity and Truth-Telling in Women's Relationships",
        "Authors": "By Lerner, Harriet Goldhor",
        "Description": "When The Dance of Deceptionwas published, Lerner discovered that women were not eager to identify with the subject. \"Well, I don't do deception\" was a common resonse.We all \"do deception\", often with the intention to protect ourselves and the relationships we depend on. The Dance of Deceptionunravels the ways (and whys) that women show the false and hide the real -- even to our own selves. We see how relationships are affected by lying and faking, by silence and pretending and by brave -- but misguided -- efforts to tell the truth.Truth-telling is at the heart of what is most central in women's lives. It is at the foundation of authenticity and creativity, intimacy and joy. Yet in the name of \"honesty\", we can bludgeon each other. We can approach a difficult issue with such a poor sense of timing and tact that we can actually shut down the lines of communication rather than widening the path of truth-telling.Sometimes Lerner's advice takes a surprising turn -- for example, when she asks us to engage in a bold act of pretending in order to discover something \"more real\"; or when she tells us not to parachute down on our family to bring up a \"hot issue\" without laying the necessary groundwork first.Whether the subject is affairs, family secrets, sexual faking or the challenge of \"being oneself\", Lerner helps us to discover, speak and live our own truths.",
        "Category": " Psychology , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Casey at the Bat",
        "Authors": "By Thayer, Ernest Lawrence and Hull, Jim",
        "Description": "Best loved minor classic newly equipped with zany, startling illustrations by Hull. 57 illustrations.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "Working Papers, Financial Accounting, Tools for Business Decision Making",
        "Authors": "By Kimmel, Paul D., Weygandt, Jerry J., and Kieso, Donald E.",
        "Description": "This exciting introduction arms readers with a practical set of tools and the confidence they need to use those tools effectively in making business decisions. It begins with a macro view of accounting information by presenting real financial statements. The authors clearly establish how a financial statement communicates the financing, operating, and investing activities of a business.",
        "Category": " Business & Economics , Accounting , Financial",
        "Publisher": "Wiley",
        "Price Starting With ($)": "6.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "A Goal is a Dream with a Deadline: Extraordinary Wisdom for Entrepreneurs, Managers, and Other Smart People",
        "Authors": "By Helzel, Leo B.",
        "Description": "Presents a collection of aphorisms contributed by business professionals",
        "Category": " Business & Economics , General",
        "Publisher": "Mcgraw Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Government and Environmental Politics: Essays on Historical Developments since World War Two",
        "Authors": "By Lacey, Michael J. (EDT)",
        "Description": "",
        "Category": " Political Science , Public Policy , Environmental Policy",
        "Publisher": "Woodrow Wilson Center Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "The Confederate Reader: How the South Saw the War",
        "Authors": "By Harwell Richard B.",
        "Description": "",
        "Category": "",
        "Publisher": "Dorset House Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Campaigns and Elections (Ballots and Bandwagons)",
        "Authors": "By Sullivan, George",
        "Description": "Studies the history of American presidential campaign management, showing the strategy and tactics the candidates have used over the decades to give themselves positive exposure and their opponents negative exposure.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Silver Burdett Pr",
        "Price Starting With ($)": "7.73",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Dictionary of Philosophy and Religion: Eastern and Western Thought",
        "Authors": "By W. L. Reese",
        "Description": "",
        "Category": "",
        "Publisher": "Harvester Press Ltd.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The New York Times Century of Business",
        "Authors": "By Norris, Floyd (EDT) and Bockelmann, Christine (EDT)",
        "Description": "",
        "Category": " Business & Economics , Reference",
        "Publisher": "Mcgraw Hill",
        "Price Starting With ($)": "5.46",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Birthdays Are No Piece of Cake (Festive Peanuts)",
        "Authors": "By Schulz, Charles M.",
        "Description": "Concerned about another birthday? You're not alone! Even the eternally youthful Peanuts characters worry about getting older. Face the challenges of aging right along with Charlie Brown, Linus, and all the gang as they question the benefits of being \"older and wise.\" The warmth and good cheer of these timeless cartoons will make this and every birthday a little easier to take.",
        "Category": " Humor , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Culinary Renaissance: Creative Food Processor Recipes",
        "Authors": "By Greer, Anne Lindsay",
        "Description": "",
        "Category": "",
        "Publisher": "Cuisinarts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1980"
        }
    },
    {
        "Title": "Judicial Power and the Constitution: Selections from the Encyclopedia of the American Constitution",
        "Authors": "By Levy, Leonard W., Karst, Kenneth L., and Mahoney, Dennis J. (EDT)",
        "Description": "",
        "Category": " Law , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Grant Us Courage: Travels Along the Mainline of American Protestantism",
        "Authors": "By Balmer, Randall Herbert",
        "Description": "In 1950, Christian Century ran a series of articles on twelve churches, some large, some small, each representing a strand of American mainline Protestantism. Now, nearly fifty years later, Randall Balmer--author and host ofMine Eyes Have Seen the Glory, the acclaimed book and PBS series on American evangelicism--has revisited each of these twelve churches to take the pulse of Protestantism today. The result is a remarkable narrative, graced with touches of local color and memorable portraits of the people involved, and filled with deft observations and carefully nuanced insights about Protestantism at century's end.Much as he did in Mine Eyes Have Seen the Glory, Balmer crisscrosses America to give us a first-hand look at how Christianity has fared in the last half-century. What emerges is a church challenged by diminished influence, but with signs of hope for the future. For instance, he takes us to West Hartford, Connecticut, where we learn how a gregarious pastor, Bob Heppenstall, rekindled the spirit of the First Church of Christ Congregational--still housed in its stately, classic New England meetinghouse--that had suffered from inept management until recent years. And in Ames, Iowa, at the Collegiate United Methodist Church, we watch George White struggle to regain his church's once dominant voice in the religious life of the town, a voice now dimmed by the growth of fundamentalism. Some churches have held steadfastly to long-established roles, such as the Washington Prairie Lutheran Church, in Decorah, Iowa, which has been a model of continuity, serving its Norwegian-American community in much the same way since it was founded in 1851. And Balmer also visits some thriving churches, such as Hollywood's First Presbyterian Church, led by the great preacher John Lloyd Ogilvie, who was recently appointed chaplain of the U.S. Senate. In Minneapolis, Balmer encounters Mount Olivet Lutheran Church, a congregation that has not only increased its membership, but can now call itself the biggest Lutheran church in the world.In Grant Us Courage, one of our most thoughtful chroniclers of the American scene offers an intimate look at mainline Protestantism at the close of the century. We come away with the feeling of having been there, of having listened to the voices of an important segment of Christian life, and of having found a deeper understanding of religious life in America today.",
        "Category": " Law , Public",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Fda Follies: An Alarming Look At Our Food And Drug Policies",
        "Authors": "By Burkholz, Herbert",
        "Description": "This is the story of how the Food and Drug Administration failed in its mission to protect the national health during the years of the Reagan-Bush presidencies.Undeterred by the FDA's notorious secretiveness and its penchant for treating critics as pariahs, the novelist and investigative journalist Herbert Burkholz has unearthed a wealth of damning information about the FDA. The book shows how a decade of indifference turned this vital agency responsible for ensuring the safety of our food and drugs into a partner with industry - and the consumer's worst friend.The FDA Follies is a fascinating saga, revealing in full for the first time: how a few generic drug manufacturers bribed FDA reviewers into getting their products to the marketplace early, how a determined band of AIDS activists took on the FDA and forever changed the way our drugs are approved and marketed, how the FDA and the blood bank industry let precious years slip by while the nation's blood supply was contaminated with the HIV virus, how the agency approved faulty heart valves that killed and silicone breast implants that flattered women while maiming them, and how those famous killer grapes from Chile were actually poisoned in the FDA's own laboratories.The book concludes with an analysis of how a reformed agency under new and active leadership in the 1990s is struggling to retrieve its credibility and authority and become once again the proper guardian of the national health.",
        "Category": " Social Science , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Founding: A Dramatic Account of the Writing of the Constitution",
        "Authors": "By Barbash, Fred",
        "Description": "Reveals the explosive issues and the political battles which gave birth to the most important document in United States history",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Linden Pub",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Campaigning With Grant (The American Civil War)",
        "Authors": "By Porter, Horace",
        "Description": "In 1863 Horace Porter, then a captain, met Ulysses S. Grant as Grant commenced the campaign that would break the Confederate siege at Chattanooga. After a brief stint in Washington, Porter rejoined Grant, who was now in command of all Union forces, and served with him as a staff aide until the end of the war. Porter was at Appomattox as a brevet brigadier general, and this work, written from notes taken in the field, is his eyewitness account of the great struggle between Lee and Grant that led to the defeat of the Confederacy.",
        "Category": " History , United States , General",
        "Publisher": "Konecky & Konecky",
        "Price Starting With ($)": "6.69",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "A Drop of Oil, a Drop of Blood",
        "Authors": "By Jahanbani, A. N.",
        "Description": "",
        "Category": "",
        "Publisher": "Cat Trax Pub",
        "Price Starting With ($)": "7.69",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Attempts to join society: A novel",
        "Authors": "By Thornley, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Beaufort Books Publishers",
        "Price Starting With ($)": "6.15",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "100 Questions and Answers About Hypertension",
        "Authors": "By Manger, William Muir and Gifford, Ray W",
        "Description": "100 Questions and Answers About Hypertension introduces the fundamentals of high blood pressure and the latest drug treatments. The authors, leaders in the National Hypertension Association, have written this helpful introduction so readers can take an active role in their own treatment. This book is a concise guide to the causes of, and latest treatments for hypertension.",
        "Category": " Medical , Cardiology",
        "Publisher": "Wiley-Blackwell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "This Green Oasis: A History of Baker Park, 1928-2003",
        "Authors": "By Richard Lebherz",
        "Description": "",
        "Category": "",
        "Publisher": "This Green Oasis",
        "Price Starting With ($)": "19.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Dangerous Dilemmas",
        "Authors": "By Palfrey, Evelyn",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Devil to Pay",
        "Authors": "By Parkinson, Cyril Northcote",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "17.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Chienne de Guerre: A Woman Reporter Behind the Lines of the War in Chechnya",
        "Authors": "By Nivat, Anne and Darnton, Susan (TRN)",
        "Description": "Two years ago, when she was thirty years old, Anne Nivat decided to see first-hand what war was all about. Russia had just launched its second brutal campaign against Chechnya. And though the Russians strictly forbade Westerners from covering the war, the aspiring French journalist decided she would go. There are two very real dangers in Chechnya: being arrested by the Russians and being kidnapped by the Chechens. Nivat strapped her satellite phone to her belly, disguised herself in the garb of a Chechen peasant, and sneaked across the border. She found a young guide, Islam, to lead her illegally through the war zone. For six months they followed the war, travelling with underground rebels and sleeping with Chechen families or in abandoned buildings. Anne trembled through air raids; walked through abandoned killing fields; and helped in the halls of bloody hospitals. She interviewed rebel leaders, government officials, young widows, and angry fighters, and she reported everything back to France. Her reports in Libération led to antiwar demonstrations outside the Russian embassy in Paris. Anne's words move. They are not florid, but terse, cool, dramatic. More than just a war correspondent's report, Chienne de Guerre is a moving story of struggle and self-discovery?the adventures of one young woman who repeatedly tests her own physical and psychological limits in the extremely dangerous and stressful environment of war.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Best American Mystery Stories 2003 (The Best American Series)",
        "Authors": "By Penzler, Otto (EDT) and Connelly, Michael (EDT)",
        "Description": "Since its inception in 1915, the Best American series has become the premier annual showcase for the country's finest short fiction and nonfiction. For each volume, a series editor reads pieces from hundreds of periodicals, then selects between fifty and a hundred outstanding works. That selection is pared down to twenty or so very best pieces by a guest editor who is widely recognized as a leading writer in his or her field. This unique system has helped make the Best American series the most respected -- and most popular -- of its kind.   This seventh installment of the premier mystery anthology boasts pulse-quickening stories from all reaches of the genre, selected by the world-renowned mystery writer Michael Connelly. His choices include a Prohibition-era tale of a scorned lover's revenge, a Sherlock Holmesinspired mystery solved by an actor playing the famous detective onstage, stories of a woman's near-fatal search for self-discovery, a bar owner's gutsy attempt to outwit the mob, and a showdown between double-crossing detectives, and a tale of murder by psychology. This year's edition features mystery favorites as well as talented up-and-comers, for a diverse colleciton sure to thrill all readers.James Crumley Pete Dexter Brendan DuBois Elmore Leonard Walter Mosley Joyce Carol Oates",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Art of Creative Thinking",
        "Authors": "By Nierenberg, Gerard",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Market That Beats the Market: How to Profit in Technology Stocks and Funds",
        "Authors": "By Gianturco, Michael",
        "Description": "Forbes science and technology columnist Michael Gianturco explains in direct, pithy, easy-to-understand language what to buy, when to buy, how much to pay, how many stocks or funds to hold, and when to sell. He identifies the seven most common mistakes in technology investing. If you use a computer, he explains which program to use to pick technology stocks and funds and tells you exactly how to set it up. He examines each of the major technology groups in detail and states clear investment rules for each. And he names specific technology stocks and funds to help you get started.",
        "Category": " Business & Economics , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Prozac and the New Antidepressants: What You Need Know abt Prozac Zoloft Paxil Wellbutrin Effeco Serzone Luvox More",
        "Authors": "By Appleton, William S.",
        "Description": "Provides an insightful look at Prozac and other antidepressant drugs--such as Paxil, Wellbutrin, Zoloft, Serxone, and others--while giving answers to many common questions and furnishing practical information in a user-friendly layout. Original.",
        "Category": " Health & Fitness , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Mind's Eye: Readings from Scientific American",
        "Authors": "By Jeremy M. Wolfe",
        "Description": "",
        "Category": "",
        "Publisher": "W.H. Freeman & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Self-Nurture: Learning to Care for Youself as Effectively as You Care forEveryone Else",
        "Authors": "By Domar, Alice D. and Dreher, Henry",
        "Description": "An expert on women and stress advises women to \"nurture\" themselves, offering readers a \"relationship quadrant\" for resolving relationship issues, strategies for turning negative thoughts into positive ones, and creative ideas for spending quality, guilt-free personal time. Reprint.",
        "Category": " Psychology , Psychopathology , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Why Do Clocks Run Clockwise? And Other Imponderables",
        "Authors": "By Feldman, David",
        "Description": "Here are the answers to questions that have been keeping you and your loved ones up nights, questions that have driven families to feuds, questions that nag and nag just won't let go. Have you ever wondered juts what purpose those warning labels on mattresses are supposed to serve? Or what happens to the trend that wears off tires? And how many meals have you spent pondering the perennially baffling question of why hot dogs come ten to a package while hot dog buns come in eight?  Why Do Clocks Run Clockwise? has the solutions to these and scores of other Imponderables. David Feldman's witty and irresistible compendium of knowledge goes where other reference books fear to trend, uncovering closely guarded secrets, revealing long-hidden facts, and, like all other invaluable works of detection, never letting well enough alone. Whether you want to settle those arguments about the difference between a kit and a caboodle, or just curious about dry cleaning, Teflon, Wayne Gretzky, or chocolate bunnies, Why Do Clocks Run Clockwise? is indispensable.",
        "Category": "",
        "Publisher": "Perennial Library - Harper & Row",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "A Ship Made of Paper: A Novel",
        "Authors": "By Spencer, Scott",
        "Description": "No novelist alive knows the human heart better than Scott Spencer does. No one tells stories about human passion with greater urgency, insight, or sympathy. In A Ship Made of Paper, this artist of desire paints his most profound and compelling canvas yet.   Daniel Emerson lives with Kate Ellis and is like a father to her daughter, Ruby. But he cannot control his desire for Iris Davenport, the African-American woman whose son is Ruby's best friend. During a freak October blizzard, Daniel is stranded at Iris's house and they begin a sexual liaison that eventually imperils all their relationships, Daniel's profession, their children's well-being, their own race- blindness, and their view of themselves as essentially good people.   A Ship Made of Paper captures all the drama, nuance, and helpless intensity of sexual and romantic yearning, and it bears witness to the age-old conflict between the order of the human community and the disorder of desire.",
        "Category": " Fiction , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Kaffir Boy",
        "Authors": "By Mathabane, Mark",
        "Description": "A Black writer describes his childhood in South Africa under apartheid and recounts how Arthur Ashe and Stan Smith helped him leave for America on a tennis scholarship",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "McNally's Dare (Sanders, Lawrence)",
        "Authors": "By Sanders, Lawrence and Lardo, Vincent",
        "Description": "The dowager duchess of Palm Beach dies, leaving behind a fabulous fortune and a handsome young heir - and Archy McNally is left trying to figure out who's who.When a young waiter working Malcolm \"Nifty\" MacNiff's annual Tennis Everyone! benefit is found dead in Nifty's otherwise pristine swimming pool, it's Archy McNally, south Florida's most famous Discreet Inquirer, who rushes in to salvage the town's reputation and solve the unfortunate crime. Palm Beach is already in a tizzy over the arrival of its newest millionaire, Lance Talbot, just in from Switzerland to claim his inheritance after the demise of his grandmother.Poor Jeff Rodgers has barely been pulled from the water when Palm Beach's rumor mill goes into overdrive. Why has Dennis Darling, crack reporter for Bare Facts magazine, descended on the fair island? Just how did handsome Lance escape the avalanche that took his mother's life, and brought him back to his Florida family? And just who is the alluring Baroness Holga von Brecht, the well-preserved woman on Lance's arm, whose ageless features have Palm Beach matrons lusting after her beauty secrets? When an old school chum of Holga's is made redundant, Archy works overtime to snare a double murderer.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Sinus Survival: A Self-Help Guide for Allergies, Bronchitis, Colds, and Sinuses",
        "Authors": "By Ivker, Robert S.",
        "Description": "Discusses treatment alternatives for sinus and allergy sufferers, including traditional and holistic techniques, and presents preventative recommendations",
        "Category": "",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Introduction to Organizational Behavior: A Situational Approach",
        "Authors": "By Stuart-Kotze, R.",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "Serious Cycling for the Beginner",
        "Authors": "By Adams, Ray",
        "Description": "",
        "Category": "",
        "Publisher": "Anderson World",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1977"
        }
    },
    {
        "Title": "A Simple Monk: Writings on His Holiness the Dalai Lama",
        "Authors": "By Morgan, Tom (EDT), Wright, Alison (PHT), and Thurman, Robert (INT)",
        "Description": "Lavish color photographs and wrap-around text celebrate the peripatetic spiritual leader of Tibetan Buddhism. Unidentified contributors present such perspectives as ocean of wisdom, the god in exile, and human rights and universal responsibility. There is no index or bibliography. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Religion , Buddhism , General",
        "Publisher": "New World Library",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Her Face in the Mirror: Jewish Women on Mothers and Duaghters",
        "Authors": "By Moskowitz, Faye (EDT)",
        "Description": "A beautiful exploration of the difficult and affirming relationship between mothers and their daughters in the lives of Jewish women.",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Rabin of Israel",
        "Authors": "By Slater, Robert",
        "Description": "The historic elevation of Yitzhak Rabin to prime minister of Israel in 1992 brought new hope for lasting peace in the Middle East. His Labor party's triumph signaled a new attitude on the part of the Israeli people, a desire for an end to decades of wearying conflict.Yet this man in whom so many have placed their hopes remains an enigma. Rabin, a fierce and uncompromising military leader whose actions as chief of staff of the Israeli Defense Forces during the Six Day War led to Israeli control of the West Bank and the Golan Heights, seemed poised to surrender at least part of those gains in the name of peace.Robert Slater, whose acclaimed biography of Moshe Dayan was nominated for the National Jewish Book Award, gives us a fully realized portrait of Rabin based on interviews with Rabin's colleagues, friends, family and Rabin himself, in this, the first biography of the prime minister.Rabin emerges as a shy, diffident, even mysterious man, whose changing fortunes seem to echo the contradictions within himself. His first tenure as prime minister during the mid-1970s was marked by both his resolute actions during the Entebbe hostage crisis and his ignominious resignation as the result of a petty financial scandal. Yet Rabin was returned to office at one of the most crucial moments in Israel's history.",
        "Category": " History , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Nuts, Bolts, and Gut-Level Management",
        "Authors": "By Shave, Gordon A",
        "Description": "",
        "Category": "",
        "Publisher": "Parker Pub. Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "A Little Book of Campfire Songs",
        "Authors": "By Denington, Brian (EDT) and Denington, Brian (ILT)",
        "Description": "",
        "Category": " Music , Printed Music , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Microeconomic Theory and Applications",
        "Authors": "By Browning, Edgar K. and Zupan, Mark A.",
        "Description": "",
        "Category": " Business & Economics , Economics , Microeconomics",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "5.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Candyfreak: A Journey through the Chocolate Underbelly of America",
        "Authors": "By Almond, Steve",
        "Description": "Perhaps you remember the whipped splendor of the Choco-Lite, or the luscious Caravelle bar, or maybe the sublime and perfectly balanced Hershey's Cookies 'n Mint. The Marathon, an inimitable rope of caramel covered in chocolate. Oompahs. Bit-O-Choc. The Kit Kat Dark. Steve Almond certainly does. In fact, he was so obsessed by the inexplicable disappearance of these bars—where'd they go?—that he embarked on a nationwide journey to uncover the truth about the candy business. There, he found an industry ruled by huge conglomerates, where the little guys, the last remaining link to the glorious boom years of the candy bar in America, struggle to survive. Visiting the candy factories that produce the Twin Bing, the Idaho Spud, the Goo Goo Cluster, the Valomilk, and a dozen other quirky bars, Almond finds that the world of candy is no longer a sweet haven. Today's precious few regional candy makers mount daily battles against corporate greed, paranoia, and that good old American compulsion: crushing the little guy.  Part candy porn, part candy polemic, part social history, part confession, Candyfreak explores the role candy plays in our lives as both source of pleasure and escape from pain. By turns ecstatic, comic, and bittersweet, Candyfreak is the story of how Steve Almond grew up on candy—and how, for better and worse, candy has grown up, too.",
        "Category": " Technology & Engineering , Food Science , General",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Night Watch: A Long Lost Adventure In Which Sherlock Holmes Meets FatherBrown",
        "Authors": "By Kendrick, Stephen",
        "Description": "When the mutilated body of a priest is discovered in a London church during a secret meeting between the Archbishop of Canterbury and the representatives of the great world religions, Sherlock Holmes is called in and seemingly solves the case in record time, until Father Brown arrives to reveal a few \"loose ends.\" Reprint.",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Kohn Pedersen Fox: Buildings and Projects 1976-1986",
        "Authors": "By Chao, Sonic and Abramson, T.",
        "Description": "Shows courthouses, news-broadcasting facilities, banks, hotels, and office buildings designed by the American architectural firm",
        "Category": " Architecture , Individual Architects & Firms , General",
        "Publisher": "Rizzoli",
        "Price Starting With ($)": "5.81",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Kids in the Wild: A Family Guide to Outdoor Recreation",
        "Authors": "By Ross, Cindy and Gladfelter, Todd",
        "Description": "Provides practical information for introducing children to wilderness adventures, suggests nature activities, and discusses child's gear and safety issues",
        "Category": " Sports & Recreation , Outdoor Skills",
        "Publisher": "Mountaineers Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Hush Songs",
        "Authors": "By Thomas, Joyce Carol and Joysmith, Brenda (ILT)",
        "Description": "A collection of African-American lullabies enhanced by the improvisational styles of such artists as Harry Belafonte and Oscar Brown, Jr. is accompanied by piano scores, introductory notes, and historical information.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Country & Ethnic",
        "Publisher": "Hyperion Book CH",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Free for All: Defending Liberty in America Today",
        "Authors": "By Kaminer, Wendy",
        "Description": "A lawyer, social critic, and columnist at The American Prospect, Wendy Kaminer has said that she likes to think words have power but knows they don't cast spells. She argues with her readers and expects them to argue back. Her taste for liberty, her legal training, wit, and innate contrarianism help her elude the usual political labels and inform her writings on censorship, feminism, pop psychology, religion, criminal justice, and a range of rights and liberties at issue in the culture wars.In this new collection, Kaminer has her sights set on the fate civil liberties in America. Opening with a powerful overview of liberty's tenuous hold on this \"land of the free,\" Kaminer offers incisive, original investigations of political freedom in our frightened, post-September 11 world and reviews perennial threats to sexual and religious liberty, free speech, privacy, and the right to be free from unwarranted, unprincipled prosecutions. She writes with a sense of the past, an understanding of the present, and concern about the future of American freedom.Lindsay Nelson has written a Discussion Guide to Free For All for Unitarian Universalist Communities.Wendy Kaminer is the author of many books, including I'm Dysfunctional, You're Dysfunctional: The Recovery Movement and Other Self-help Fashions; A Fearful Freedom: Women's Flight from Equality; It's All the Rage: Crime and Culture; True Love Waits; and most recently Sleeping with Extra-Terrestrials: The Rise of Irrationalism and the Perils of Piety. Her articles and reviews have appeared in numerous publications including The New York Times, The Wall Street Journal, The Nation, The Atlantic Monthly, and Newsweek, and her commentaries have aired on National Public Radio.",
        "Category": " Law , Civil Rights",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Motley Fool Investment Guide: How The Fool Beats Wall Street's Wise Men And How You Can Too",
        "Authors": "By Gardner, David, Gardner, Tom, and Motley Fool, Inc. (COR)",
        "Description": "For Making Sense of Investing Today...the Fully Revised and Expanded Edition of the Bestselling The Motley Fool Investment Guide  Today, with the Internet, anyone can be an informed investor. Once you learn to tune out the hype and focus on meaningful factors, you can beat the Street.  The Motley Fool Investment Guide, completely revised and updated with clear and witty explanations, deciphers all the new information -- from evaluating individual stocks to creating a diverse investment portfolio.  David and Tom Gardner have investing ideas for you -- no matter how much time or money you have. This new edition of The Motley Fool Investment Guide is built for today's investor, sophisticate and novice alike, with updated information on:   Finding high-growth stocks that will beat the market over the long term Identifying volatile young companies that traditional valuation measures may miss Using Fool.com and the Internet to locate great sources of useful information",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Moments to Remember: The Art of Creating Scrapbook Memories",
        "Authors": "By Packham, Jo",
        "Description": "Through simple instructions and detailed tips, readers can learn how to best preserve their memories in an organized and decorative scrapbook presentation.",
        "Category": " Design , Book",
        "Publisher": "Andrews Mcmeel Pub",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Architecture As Response: Preserving the Past, Designing for the Future : Einhorn Yaffee Prescott",
        "Authors": "By Greer, Nora Richter and Einhorn Yaffee Prescott (COR)",
        "Description": "",
        "Category": " Architecture , Individual Architects & Firms , General",
        "Publisher": "Rockport Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Crossed Currents: Navy Women from Wwi to Tailhook",
        "Authors": "By Ebbert, Jean and Hall, Marie-Beth",
        "Description": "Crossed Currents is the first history of women in the U.S. Navy. Since the World War I service of Yeoman (F) Loretta Perfectus Walsh - the first U.S. servicewoman not a nurse - through the Gulf War and the recent Tailhook scandal, women have struggled for acceptance within the U.S. Navy. This book tells a fascinating story of two currents crossing and recrossing, sometimes conflicting, sometimes converging. One current is the Navy's attempt to include women gradually without losing its traditional values. The other is that of women challenging the Navy's assumptions, their aspirations rising as their opportunities widen. And as any sailor knows, where currents cross the waters are troubled. Jean Ebbert and Marie-Beth Hall have written a comprehensive and inspiring history that covers Tailhook in depth and shows why it was to be expected. Crossed Currents will make waves.",
        "Category": " History , Military , Naval",
        "Publisher": "Brassey's Inc",
        "Price Starting With ($)": "21.83",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "The Bourbaki Gambit",
        "Authors": "By Djerassi, Carl",
        "Description": "This novel, like Jurassic Park, hinges on the real-world technology incorporated in the polymerase chain reaction (PCR), one of the most important breakthroughs in biomedical science. The 1993 Nobel Prize in chemistry recognized the immense significance of PCR, which is a process for quickly generating and then infinitely replicating fragments of genetic material.An impostor takes all of the credit in Carl Djerassi's fictionalized account of PCR's discovery and development. As the scientific community eventually discovers, Professor Diana Skordylis is not really one of their own, she is four of their own--three men and a woman--who publish their collaborative work under the Skordylis pseudonym. Two of them American, one Japanese, and one Austrian, they average around sixty-five years of age. Their archetype is a famous group of French mathematicians who actually have been publishing collectively for several decades under the nom de plume of Nicolas Bourbaki.Revenge is the Skordylis group's initial motivation. Victims of subtle age discrimination, they have all seen their research budgets and faculty privileges curtailed; two have been forcibly retired. Each Skordylis project they complete, each paper they publish under her name, is a satisfying poke at a scientific community that marginalized its senior members.But PCR is different. It is not only their best work, it is among the best work done by any scientist in recent memory. Professional jealousy soon threatens Diana Skordylis's life, as some group members struggle with the urge to claim their share of the fame and separately seek out PCR's most innovative applications.Djerassi writes engagingly--and from experience--about the collaborative nature at the heart of the scientific enterprise and the desire for personal recognition in the hearts of most scientists; about the graying of Western science; and about the human frailties and humanistic concerns of its practitioners.",
        "Category": " Fiction , Literary",
        "Publisher": "Univ of Georgia Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Acupuncture",
        "Authors": "By Duke, Marc",
        "Description": "Investigates the origins and development of acupuncture in China and discusses its relevancy for modern medical practice in the West",
        "Category": "",
        "Publisher": "Pyramid House",
        "Price Starting With ($)": "29.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Reflections in a Writer's Eye: Travel Pieces",
        "Authors": "By Wilson, Angus",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Perestroika and East-West Economic Relations: Prospects for the 1990's (Geonomics Institute for International Economic Advancement)",
        "Authors": "By Kraus, Michael and Liebowitz, Ronald D. (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "New York University Press",
        "Price Starting With ($)": "9.66",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "I Love You with All My Heart",
        "Authors": "By Baronian, Jean Baptiste, Kern, Noris, and Kern, Noris (ILT)",
        "Description": "When Polo the polar bear hears that his mother loves him with all her heart, he sets out to discover just what this means, asking various animal friends and, finally, his mother herself.",
        "Category": " Juvenile Fiction , Family , Multigenerational",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "6.11",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Contemporary Crafts for the Home",
        "Authors": "By Kraus, Bill",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Rockport Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "A Rainy Afternoon With God (Illuminationbooks)",
        "Authors": "By Cawley, Catherine B.",
        "Description": "",
        "Category": " Religion , Meditations",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Brain Game",
        "Authors": "By Aero, Rita and Weiner, Elliot",
        "Description": "THE BRAIN GAME27 CLASSIC INTELLIGENCE TESTS THAT WILL REVEAL YOUR UNIQUE ABILITIESThis is the ultimate do-it-yourself book for your brain.Test yourself--and find out the results!Get an accurate profile of your intellectual strengths.Explore the skills of your left brain.Explore the skills of your right brain.Determine your own IQ.These tests have never before been available to the public in one book!Computer Science Aptitude TestGeneral Mathematics TestScience Vocabulary InventoryArt Judgment TestPurdue creativity TestOpposites TestReading Comprehension TestMinnesota Vocabulary TestMemory Recognition TestEmbedded Figures Test and many more... Play THE BRAIN GAME!Find out how smart you are. Get smarter while you do it.Copyright &Copy 1983 by Rita Aero and Elliot Weiner",
        "Category": " Psychology , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "The Civil War: Day by Day",
        "Authors": "By Bowman, John S.",
        "Description": "",
        "Category": "",
        "Publisher": "Dorset Pr",
        "Price Starting With ($)": "6.09",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Great Gambles of the Civil War",
        "Authors": "By Katcher, Philip",
        "Description": "",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Castle",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Seeing Through Places: Reflections on Geography and Identity",
        "Authors": "By Gordon, Mary",
        "Description": "Mary Gordon, bestselling author of Spending and The Shadow Man, investigates the role that place plays in the formation of identity -- the connections between how we experience place and how we become ourselves. From her grandmother's house, which stood at the center of her childhood life, to a rented house on Cape Cod, where she began to mature as a writer, Mary Gordon navigates the reader through these spaces and worlds with subtlety and style. Wise, humorous, and intelligent, Seeing Through Places illuminates the relationship between the physical, emotional, and intellectual architectures of our lives, showing us the far-reaching power that places ultimately have in influencing a life.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Christmas decorations from Williamsburg's folk art collection: Step-by-step illustrated instructions for Christmas ornaments that can be made at home",
        "Authors": "By Abby Aldrich Rockefeller Folk Art Collec",
        "Description": "",
        "Category": "",
        "Publisher": "Distributed by Holt, Rinehart and Winston",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Home You Made For Me <i>celebrating A Mother's Love</i>",
        "Authors": "By Kinkade, Thomas",
        "Description": "A perfect gift for Mother's Day and for those who want an innovative way to honor the woman who has nurtured and supported them through life.  The Home You Made for Me is a celebration of all the beautiful things a mother is to her children.  Featuring the exquisite art of Thomas Kinkade, this elegant gift book includes quotes, Bible verses, and poetry dedicated to mothers everywhere for the homes they have provided for their children.  There will be blank pages to record special memories and offer heartfelt appreciation to Mothers, as well as a dedication page for gift giving.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Natural History of the Ussr",
        "Authors": "By Knystautas, Algirdas",
        "Description": "",
        "Category": "",
        "Publisher": "TRAFALGAR SQUARE +",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Politics of Bad Faith: The Radical Assault on America's Future",
        "Authors": "By Horowitz, David",
        "Description": "The author of Radical Son explores the history of the radical idea from its nineteenth-century socialist origins to present-day attitudes toward multiculturalism, the ACLU, social equality, radical feminism, the AIDS epidemic, and more. 20,000 first printing.",
        "Category": " Political Science , Political Ideologies , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Depression, the Mood Disease (A Johns Hopkins Press Health Book)",
        "Authors": "By Mondimore, Francis Mark",
        "Description": "Discusses the symptoms, diagnosis, and treatment of depression, offers advice on living with the condition, and looks at mood disorders in children and the elderly, drug and alcohol abuse, and panic attacks",
        "Category": " Psychology , Mental Health",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "International Governance: Protecting the Environment in a Stateless Society (Cornell Studies in Political Economy)",
        "Authors": "By Young, Oran R",
        "Description": "How can the global environment be safeguarded in the absence of a world government? In the vanguard of efforts to address this critical question, Oran R. Young draws on environmental issues to explore the nature of international governance. Young's analysis invokes the distinction between \"governance,\" a social function involving the management of interdependent individuals or groups, and \"government,\" a set of formal organizations that makes and enforces rules.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Cornell University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "The Opening of the American Mind",
        "Authors": "By Levine, Lawrence W.",
        "Description": "In response to recent books attacking the contemporary university and blaming educators for a decline in American culture, the author argues that the \"opening up\" of American education and of a changing society are inextricably linked",
        "Category": " Education , Organizations & Institutions",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "When the Belly Button Pops, the Baby's Done: A Month-by-Month Guide to Surviving (and Loving) Your Pregnancy",
        "Authors": "By Craker, Lorilee",
        "Description": "“This is your brain…This is your brain on progesterone!”        Have the hormones  of pregnancy pushed you slightly over the edge? Here’s permission to give in and  have a few belly laughs as a mother of two and a panel of experienced moms revel  in the humorous side of pregnancy. This warm and funny month-by-month guide contains  serious wisdom for pregnant moms looking to have a joyful pregnancy.  Reassuring  and helpful for both body and soul, Lorilee and her Pregnant Pals address the whole  mother–as only good friends can–with sidebars, checklists, quotables, and down-to-earth  help such as:  ·Tips on conquering nausea, narcolepsy, and general nuttiness ·How  to panic-proof your pregnancy ·Good food and good exercise for great pregnant bods ·Chic, no-tents-allowed fashion tips ·Survival strategies for labor day Serving  up spiritual encouragement for the whole nine months, this is the essential pregnancy  book for Christian moms!",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "WaterBrook",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "A Country of Strangers: Blacks and Whites in America",
        "Authors": "By Shipler, David K.",
        "Description": "An incisive study of race in America analyzes a range of black-white stereotypes and misconceptions, the ways in which blacks and whites interpret each other's behavior, the divisive assumptions that damage relations, and more. 60,000 first printing. BOMC Feat. Tour.",
        "Category": " Social Science , Discrimination & Race Relations",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Where Next, Columbus?: The Future of Space Exploration",
        "Authors": "By Neal, Valerie (EDT)",
        "Description": "In the decades since the launch of Sputnik, the world has thrilled to the long-dreamed-of moon walks of the Apollo astronauts, marvelled at spectacular photographs of the outer planets brought to us by Voyager, and watched in horror as the Challenger exploded before our eyes. No longer the terrifying realm of science fiction, space has been hailed by popular culture as the \"final frontier,\" the focal point of future exploration. Yet today there is no strong consensus about our future in space. Where should we go next? Mars? Deep space? Should we continue to send humans into space? Is it worth the cost to explore space at all? Now, a curator of space history at the Smithsonian, Valerie Neal, has assembled a noted group of writers and thinkers--among them Stephen Jay Gould, Carl Sagan, Timothy Ferris, Robert L. Forward, and Stephen J. Pyne--to consider such questions. The result is an intriguing collection of essays that offer stimulating insights into the exploration of new worlds.  Boasting an oversize format and more than fifty color illustrations, this engaging volume offers readers a fascinating look at exploration's past and future. Several pieces vividly depict the actual experience of space travel and the many scientific findings made along the way. Harrison H. Schmitt, the last astronaut to set foot on the moon, provides an often spellbinding account of that adventure, in the process making a compelling case for human rather than robotic explorers (during the examination of a boulder, Schmitt made a discovery that a mere circuit-board would have missed--and that is to say nothing of the poetic earth-rise he describes).  But robots get equal time. Edward C. Stone, Project Scientist for the Voyager missions, describes other worlds as seen from the camera-eye of a machine millions of miles away: the roiling storm systems on Jupiter, the complexity of Saturn's rings, and the spectacular nitrogen geysers on Triton, one of Neptune's major satellites. Looking towards the future, Stephen Jay Gould pleads for a manned mission to Mars, one which would scour the Red Planet for signs of life (paleontologists have found fossilized bacteria in Earth silica, Gould explains, and similar fossils on Mars may be the key to proving that life once existed there). And physicist Robert L. Forward offers detailed plans for actual starships that could send astronauts to the nearest star system in a single lifetime--and with today's technology.    Where Next, Columbus? is an utterly absorbing contribution to a debate that may help define the twenty-first century. With colorful illustrations, a spacious oversized format, and ten fascinating essays--all but one of which have never been published before--this volume will intrigue anyone interested in space travel or our place in the universe.",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Old Times (Pinter, Harold)",
        "Authors": "By Pinter, Harold",
        "Description": "Like Pinter's earlier plays. Pinter deals with bare essentials. There are only three characters -- a man named Deeley, his wife, Kate, and Anna, a friend of Kate's whom they have not seen in 20 years. Beneath the surface of their taut, witty conversation lurks suggestions of darkness, until the present is overwhelmed with intimations of some frightening past.",
        "Category": " Drama , European , English, Irish, Scottish, Welsh",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Dog Tricks",
        "Authors": "By Benjamin, Carol Lea and Haggerty, Arthur J.",
        "Description": "The renown dog trainer explains the secrets of successful trick teaching, including useful, emergency, humorous and just plain silly tricks for all breeds of dog",
        "Category": " Pets , Dogs , General",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "Allies: Pearl Harbor To D-day",
        "Authors": "By Eisenhower, John S. D.",
        "Description": "Dwight D. Eisenhower once remarked that \"the history of alliances is a history of failure.\" This provocative, absorbing work, based on a study by the General and written by his son, is a history of one of the great exceptions, the most successful military alliance the world has ever seen?the Anglo-American military alliance of World War II. At once a study of the prodigious undertaking that brought millions of men and women together to defeat the Axis and a portrait of the great personalities who built and sustained the alliance, Allies offers vivid glimpses of war at the working level: on a convoy crossing the Atlantic, with a secret landing party on the coast of northern Africa, and with armored units in Tunisia. Eisenhower has crafted a powerful narrative and a most valuable contribution to the literature of World War II.",
        "Category": " History , Military , World War II",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Living on Fire: A Collection of Poems",
        "Authors": "By Adair, Virginia",
        "Description": "A new collection of poems from the author of Ants on the Melon offers up clear, moving lines on a variety of topics, including blindness, mortality, and the desert. 15,000 first printing.",
        "Category": " Poetry , American , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Soar... If You Dare: And Use Your Secret Powers for Success: To Make Your Dreams Come True !",
        "Authors": "By Ball, James R.",
        "Description": "",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Goals Inst",
        "Price Starting With ($)": "7.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    }
]