[
    {
        "Title": "Huckleberry Finn",
        "Authors": "By Twain, Mark, Edwards, June, and Neidigh, Sherry",
        "Description": "A 19th-century boy, floating down the Mississippi River on a raft with a runaway slave, becomes involved with a feuding family, two scoundrels pretending to be royalty, and Tom Sawyer's aunt, who mistakes him for Tom.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Heinemann/Raintree",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1980"
        }
    },
    {
        "Title": "Boys Against Girls (Boy/Girl Battle)",
        "Authors": "By Naylor, Phyllis Reynolds",
        "Description": "The Hatford-Malloy feud continues in this fast-paced sequel to The Boys Start the War and The Girls Get Even (both Delacorte, 1993). Their egos still smarting from the humiliation they suffered on Halloween at the hands of their female neighbors, the Hatford boys try to frighten them with tales of the abaguchie, a creature of local legend. A funny series of plans for revenge and retaliation from both sides follows. Ultimately, the children call a truce when they are united by a common cause-sharing a joke at their parents' expense. Although this title sums up the background of the story clearly, it relies on the earlier books for characterization. The girls come across as stereotypes-an athlete, a bookworm, and an aspiring actress-and the boys are virtually indistinguishable from one another. Nevertheless, fans of the previous books will enjoy this installment.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Story of Hiawatha : Adapted From Longfellow",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "Advise & Dissent: Memoirs of South Dakota and the U.S. Senate",
        "Authors": "By Abourezk, James G.",
        "Description": "The life story of the founder of ADC, from his parents' farm in South Dakota to the halls of the Senate, where he refused to compromise his principles.",
        "Category": " Political Science , General",
        "Publisher": "Lawrence Hill Books",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Saving the World (Maximum Ride, Book 3)",
        "Authors": "By Patterson, James",
        "Description": "There's one last chance to save the world in the third book in the Maximum Ride series, SAVING THE WORLD AND OTHER EXTREME SPORTS. The time has arrived for Max and her winged \"flock\" to face their ultimate enemy and discover their original purpose: to defeat the takeover of \"Re-evolution\"--a sinister experiment to re-engineer a select population into a scientifically superior master race...and to terminate the rest. Max, Fang, Iggy, Nudge, Gasman, and Angel have always worked together to defeat the forces working against them--but can they save the world when they are torn apart, living in hiding and captivity, halfway across the globe from one another?",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Break No Bones: A Novel (9) (A Temperance Brennan Novel)",
        "Authors": "By Reichs, Kathy",
        "Description": "To some, the dead are a commodity. For Tempe Brennan, they hold the key to cracking a horrific crime ring.    Among the ancient remains in a Native American burial ground, Tempe discovers a fresh skeleton -- and what began as an ordinary teaching stint at an archeology field school in Charleston, South Carolina, fast becomes a heated investigation into an alarming pattern of homicides. The clues hidden in the bones lead to a street clinic where a monstrous discovery awaits, and Tempe -- whose personal life is in upheaval, with two men competing for her -- can't afford any distractions as she pieces together a shattering and terrifying puzzle.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "The Land of Mango Sunsets",
        "Authors": "By Frank, Dorothea Benton",
        "Description": "Her sleazy husband left her for a lingerie model who's barely more than a teenager, and her kids are busy with their own lives. But before Miriam Elizabeth Swanson can work herself up into a true snit about it all, her newest tenant, Liz, arrives from Birmingham with plenty of troubles of her own.  And then Miriam meets a man named Harrison, who makes her laugh, makes her cry, and makes her feel like a brand-new woman. It's almost too much for one Manhattan quasi-socialite to handle—so Miriam's escaping to the enchanted and mysterious land of Sullivans Island, deep in the low country of South Carolina, a place where she can finally get her head on straight—and figure out that it's not pride that's going to keep her warm at night . . .",
        "Category": " Fiction , Women",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Fire Duke: Keepers of the Hidden Ways Book One",
        "Authors": "By Rosenberg, Joel",
        "Description": "There are Hidden Ways built into the structure of existence -- linking the New World and the Newer . . . dating back to a time before time.When he brought college friends Maggie and Ian home to North Dakota, Torrie Thorsen anticipated a carefree vacation -- not werewolves, Norse gods and inconceivable worlds. But the Thorsen destiny leads them all to where the family's history began -- through secret portals into a place of legend and peril. For here, where the blade of Torrie's father once loyally served the House of the Sky, son and father both must suffer for ancient transgressions. And with war clouds gathering above the Middle Dominion, an unlikely champion will raise his sword in defense of captive friends . . . to prevent the fiery coming of the End of All Days.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Eos",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Strange Encounters: Tales of the Unexplained (Sparrow Books)",
        "Authors": "By Powers, Harrison",
        "Description": "",
        "Category": "",
        "Publisher": "Watermill Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Murder at Union Station: A Capital Crimes Novel",
        "Authors": "By Truman, Margaret",
        "Description": "When Washington’s splendid Union Station opened its doors in 1908, the glorious structure epitomized capital stylishness. Today, restored and refurbished, the station is again a hub of activity where the world’s most famous and infamous people meet–and often collide.  Now, in Margaret Truman’s new Capital Crime novel, this landmark locale becomes the scene of a sensational shooting whose consequences ricochet from seedy bars to the halls of Congress.Historic Union Station means nothing to the elderly man speeding south on the last lap of what turns out to be a one-way journey from Tel Aviv to D.C.–on a train that will soon land him at Gate A-8 and, moments later, at St. Peter’s Gate. This weary traveler, whose terminal destination is probably hell, is Louis Russo, former mob hit man and government informer. Two men are at the station to meet him. One is Richard Marienthal, a young writer whose forthcoming book is based on Russo’s life. The other is the man who kills him.Russo has returned to help promote Marienthal’s book, which, although no one has been allowed to read it, already has some people shaking in their Gucci boots. The powerful fear the contents will not only expose organized crime’s nefarious business, but also a top-secret assignment abroad that Russo once masterminded for a very-high-profile Capitol Hill client. As news of Russo’s murder rockets from the MPD to the FBI and the CIA, from Congress to the West Wing, the final chapter of the story begins its rapid-fire unfolding.In addition to the bewildered Marienthal and his worried girlfriend, there is an array of memorable characters: rock-ribbed right-wing Senator Karl Widmer; ruthless New York publisher Pamela Warren; boozy MPD Detective Bret Mullin; shoe-shine virtuoso Joe Jenks; dedicated presidential political adviser Chet Fletcher; and President Adam Parmele himself–not to mention freelance snoops, blow-dried climbers, and a killer or two. There’s no place like the nation’s capital, and as her myriad fans know, Margaret Truman always gets it right. Murder at Union Station is a luxury express, nonstop delight.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "How to Be a Christian in an Unchristian World",
        "Authors": "By Ridenour, Fritz",
        "Description": "",
        "Category": "",
        "Publisher": "Gospel Light Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1972"
        }
    },
    {
        "Title": "Introduction to Database Systems (SYSTEMS PROGRAMMING SERIES)",
        "Authors": "By Date, C. J.",
        "Description": "",
        "Category": " Computers , Databases , General",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "July",
            "Year": "1982"
        }
    },
    {
        "Title": "Database: A Primer (Micro computer books)",
        "Authors": "By Date, C. J.",
        "Description": "Explains what a database is, briefly outlines how computers work with databases, and tells how databases are designed, indexed, searched, and protected against unauthorized use",
        "Category": " Computers , General",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1983"
        }
    },
    {
        "Title": "Home Buying For Dummies, 3rd edition",
        "Authors": "By Brown, Ray and Tyson, Eric",
        "Description": "Though fun and exciting, buying a home can also be complicated and confusing—and most people learn the hard way that a wrong move can cost dearly. In order to find the perfect home at the best price, you must have skill, foresight, and a little guidance from experienced professionals.Home Buying for Dummies, Third Edition provides just that! Packed with invaluable advice in an objective, down-to-earth style that will have you sitting in your dream home in no time, this friendly guide contains everything you need to know to play the home buying game. It has the tools you need to:Improve your credit score and select a mortgageChoose a time and place to buyDetermine the price you want to payAssemble an all-star real estate teamMake use of the wonderful world of the InternetNegotiate your best dealInspect and protect your homeHandle and become responsible for the titleCope with buyer’s remorseFeatured in this guide are tips and tricks on things you should do after you seal the deal, as well as things you ought to know about real estate investing. Also included is advice on how to sell your house, as well as a sample real estate purchase contract and a good inspection report. Don’t get chewed up by the real estate market—Home Buying for Dummies, Third Edition will lead you to the home you want!",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Let the Journey Begin: God's Roadmap for New Beginnings",
        "Authors": "By Lucado, Max",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Afterglow (Contemporary Romance)",
        "Authors": "By Coulter, Catherine",
        "Description": "Despite their best intentions, two very different people--outspoken, free-spirited romance writer Chelsea Lattimer and David Winter, a proper, aristocratic physician--find themselves drawn together by romantic chemistry. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Barefoot Princess (Lost Princesses, Book 2)",
        "Authors": "By Dodd, Christina",
        "Description": "Once upon a time...in a kingdom high in the Pyrenees, three young princesses were forced to flee the chaos in their land -- vanishing without a trace and lost to their people...until the day a courageous prince can bring each princess home.Life in exile has taught the passionate Princess Amy to hate injustice, and on the enchanting English isle of Summerwind, she finds injustice personified in the powerful and wickedly handsome Jermyn Edmondson, marquess of Northcliff. Since he has stolen the islanders' livelihood, Amy decides to steal him. She kidnaps the arrogant nobleman, chains him with his own manacles, and holds him for ransom.It's a simple plan, destined to succeed. Surely Jermyn's uncle will pay his ransom. Alas, his uncle would be delighted if someone killed his nephew and left him to inherit the title and fortune. And holding the furious, guileful, sensual Jermyn chained in her basement provides a challenge to Amy's restraint...and her virtue.How could such a little revenge and blackmail go so passionately wrong?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Surrender to a Wicked Spy (The Royal Four, Book 2)",
        "Authors": "By Bradley, Celeste",
        "Description": "They are known simply as The Royal Four—but there’s nothing simple about the elite band of spies who serve the King in secrecy. Their missions are dangerous, their love lives are scandalous…and each man in the Royal Four has his own secrets. This is the story of the spy known as The Lion…SURRENDER TO A WICKED SPYOlivia Calwell’s new husband, Dane, is everything she could have ever hoped for in a man. The handsome Lord Greenleigh is charming, debonair, even a bit mysterious…and just thinking of their wedding night makes Olivia blush with pleasure. Yet she can’t help but wonder what exactly Dane does all day. His hushed meetings with strangers, his odd comings and goings—it is all enough to drive Olivia mad! Could her beloved husband be involved in something dangerous? Could he even be spying for France?Spy Dane Calwell knows the new Lady Greenleigh is poised, well educated, and utterly captivating. But he’s just discovered that Olivia is also the most curious creature he has ever met! Most wives don’t give a whit what their husbands do all day. Why must Olivia ask so many questions—and meddle in matters that do not concern her? Truth be told, Dane finds Olivia’s amateur sleuthing enchanting…even a little sexy. But when Olivia gets too close to the mission at hand, Dane must try to stop her before it’s too late—or risk losing his beautiful wife forever…",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Christmas Cards from the Edge",
        "Authors": "By Cach, Lisa, Ashley, Jennifer, and Neale, Naomi",
        "Description": "A raucous collection of stories follows three women as they, desperate to return to New York City on Christmas Eve, become trapped in a place where they, while dealing with a colorful cast of characters, decide to be quite naughty, and not very nice. Original.",
        "Category": " Fiction , Romance , Collections & Anthologies",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "One Golden Ring",
        "Authors": "By Bolen, Cheryl",
        "Description": "A marriage of convenience leads to wicked mischief under the mistletoe and a deal with the devil himself, but when the magic of the Season sets in, true love just may be brought to light. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Search for a New Dawn",
        "Authors": "By Delinsky, Barbara",
        "Description": "New York Times bestselling author Barbara Delinsky touches the heart and spirit with this charming story, first published in 1982, of a young woman's search for passion and renewal. No one could have imagined naïve and pampered Rory Matthews in the wilderness of the Yukon Territory—least of all Rory herself. But arriving unexpectedly to join her brother on a scientific expedition was Rory's way of putting her spoiled, rich-girl ways behind her. Though she came prepared for the rough challenge of the land, she wasn't ready for the raw power of nature she discovered in the arms of Eric Clarkson. As majestic and rugged as the land around her, Eric was a man who perplexed her as much as he intrigued her . . . a man who infuriated her even as he offered a passionate, fulfilling new beginning to her life.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "White Rose",
        "Authors": "By Ladd, Linda",
        "Description": "Cassandra Delaney, a Confederate spy known as the notorious \"White Rose,\" finds herself caught in a passionate duel of wits with Derek Courtland, an Australian blockade runner whose mission is to abduct the lovely spy to save her life",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Topaz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Photographing Babies & Toddlers",
        "Authors": "By Hedgecoe, John",
        "Description": "It's your child's first birthday, so you drag him to a discount photo \"studio\" where he is propped up in front of a phony backdrop, a strange toy stuffed in his hand, and sternly instructed to smile. You'd cry too if it happened to you! Don't rely on someone else to immortalize the essence of your baby's charm on film. Do it yourself with professional tips from master photographer and best-selling author, John Hedgecoe. Illustrated with more than 150 adorable baby photos, this book offers inspiration and instruction.  Produce top-quality images of your baby in a variety of situations, formal or informal, posed or candid, alone or in a group. From breakfastime to bathtime, you can capture any moment successfully whatever your camera. Preserve forever the precious moments of your baby's first three years like no one else can.",
        "Category": " Photography , Techniques , General",
        "Publisher": "Collins & Brown",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Every Child Can Succeed: Making the Most of Your Child's Learning Style",
        "Authors": "By Tobias, Cynthia Ulrich",
        "Description": "This enlightening source shows parents how to utilize a “learning styles” approach to help their kids live up to their potential and find success in life.",
        "Category": " Family & Relationships , Education",
        "Publisher": "Focus on the Family Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Return of the Warrior (Brotherhood of the Sword, Book 2)",
        "Authors": "By MacGregor, Kinley",
        "Description": "Fearless men, their allegiance is to each other, to the oppressed, and to the secret society known as the Brotherhood of the Sword -- and they must never surrender to the passionate yearnings of their noble hearts.Fiercely devoted to her people and her land, Queen Adara refuses to let a power-mad usurper steal her crown. But the only way to protect what is hers is to seek out the man she married in childhood.A proud, tormented warrior, Christian of Acre owes allegiance only to the mysterious Brotherhood -- and has no wish to be king over anyone but himself. Now a bold and beautiful stranger has appeared in his rooms, tempting him with an irresistible seduction and demanding he accompany her back to their kingdoms ... or, at the very least, provide her with an heir to her throne. Though he cannot abandon the brave regal lady to her enemies, Christian dares not give in to his traitorous body's desires. Yet how can he deny the passion that is rightfully his and the ecstasy that awaits him in Adara's kiss?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "God's Little Instruction Book (God's Little Instruction Books)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "An Unlikely Governess (Avon Romantic Treasure)",
        "Authors": "By Ranney, Karen",
        "Description": "An impoverished gentlewoman with no marital prospects in sight, Beatrice Sinclair takes a job as governess to a terrified and lonely child from a noble family, only to discover that the dark rumors about the family and her growing fascination with the young duke's adult cousin, Devlen Gordon, could spell danger for both herself and her charge. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Alpha Bravo Delta Guide to the  U.S. Navy (Alpha Bravo Delta Guides)",
        "Authors": "By Helfers, John",
        "Description": "A detailed overview of the U.S Navy-from the origins and complete histories to the battles and weaponry.  Here are comprehensive accounts and descriptions of the battles, weaponry, and personnel, from the enlisted man to the top-ranking officers-featuring fascinating detail on the bloodiest battles, the greatest successes and most devastating setbacks, and much more.",
        "Category": " History , Military , Naval",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Tempestuous Eden",
        "Authors": "By Graham, Heather",
        "Description": "While on a perilous mission to rescue Blair Morgan--an American woman--from a war-torn Central American country, special agent Craig Taylor and Blair are hurled into a world of political intrigue and betrayal as their passion for each other rages out of control. Reprint.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Zebra Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Covenant (Abram's Daughters #1)",
        "Authors": "By Lewis, Beverly",
        "Description": "Book 1 of Abram's Daughters series from bestselling author Beverly Lewis. Years of secrecy bind the tiny community of Gobbler's Knob together more than the present inhabitants know, and the Plain folk who farm the land rarely interact with the fancy locals.  So when Sadie is beguiled by a dark-haired English boy, it is Sadie's younger sister, Leah, who suffers from her sister's shameful loss of innocence. And what of Leah's sweetheart, Jonas Mast, sent to Ohio under the Bishop's command? Drawn into an incomprehensible pact with her older sister, Leah finds her dreams spinning out of control, even as she clings desperately to the promises of God. The Covenant begins a powerful Lancaster portrait of the power of family and the miracle of hope.",
        "Category": " Fiction , Literary",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Home Improvement 1-2-3: Expert Advice from The Home Depot (Home Depot ... 1-2-3)",
        "Authors": "By Home Depot",
        "Description": "The first edition of Home Improvement 1-2-3 was one of the best-selling home improvement books in the history of DIY. The soup-to-nuts approach made it the handbook for home repair across America.This new edition includes everything from advice on everyday maintenance to repair to new construction. It introduces new technology and new products. At every turn, the book offers expert advice on issues that confront homeowners every day.All-new how-to photography provides even greater assurance of success for novices and experts alike. Throughout the book, Home Depot professionals share their “Wisdom of the Aisles” with insights, tips, and shortcuts. This project-driven book is the beginner’s text, expert’s handbook, and everything in between. Clear, concise instructions on virtually every aspect of home improvement, repair, and maintenance:Time-tested projectsInnovative products Tips from Home Depot proFrom painting to plumbing, this book provides the facts:New technologyThe latest materialsThe best applicationsToday’s toolsThis comprehensive reference guide will appeal to buy-it-yourselfers as well as do-it-yourselfers:Home maintenance strategies Specific materials lists Buyer’s guides",
        "Category": " House & Home , Repair",
        "Publisher": "The Home Depot",
        "Price Starting With ($)": "27.78",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Visions of Sugar Plums (A Stephanie Plum Holiday Novel)",
        "Authors": "By Evanovich, Janet",
        "Description": "It's five days before Christmas and things are not looking merry for Fugitive Apprehension Agent Stephanie Plum. She hasn't got a tree. She hasn't bought any presents. The malls are jam-packed with staggering shoppers. There's not a twinkle light anywhere to be seen in her apartment-and there's a strange man in her kitchen.Sure, this has happened to Stephanie Plum before. But this guy is different. He's mysterious, sexy-and has his own agenda. His name is Diesel, and he's on a mission. The question is, what does he want with her?  Can he help her find a little old toy maker who has skipped out on his bail right before Christmas? Can he survive the Plum family holiday dinner?  Can he get Stephanie a tree that doesn't look like it was grown next to a nuclear power plant? These questions and more are keeping Stephanie awake at night. Not to mention the fact that she needs to find a bunch of nasty elves, her sister Valerie has a Christmas \"surprise\" for the Plums, her niece Mary Alice doesn't believe in Santa anymore, and Grandma Mazur has a new stud muffin. So bring out the plastic reindeer, strap on your jingle bells, and get ready to celebrate the holidays-Jersey style.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "129.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "AN Angel's Wish",
        "Authors": "By Kingsley, Mary",
        "Description": "When his daughter Jennie wishes to see her mother for Christmas, David Fairfax, Marquess of Stowe, tries to deny the feelings that have emerged at the sight of his estranged wife Tess, and soon Jennie's clever scheme to reunite her parents works all too well, and David and Tess get a second chance at love. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "A Loving Scoundrel: A Malory Novel (Malory-Anderson Family)",
        "Authors": "By Lindsey, Johanna",
        "Description": "THE MALORYS ARE BACK!  Johanna Lindsey brings to glorious life her beloved aristocratic family of adventurous rogues and spirited ladies as the Malorys confront the shocking news that Jeremy, the rakehell son of gentleman pirate James Malory, has fallen in love.  When Jeremy Malory hires Danny, a young woman who grew up on London's streets disguised as a boy, as his upstairs maid, he secretly intends to make her his mistress. But Danny surprises him with her dreams of becoming a refined lady and a gentleman's wife. As she transforms from urchin to elegant beauty before Jeremy's eyes, she unwittingly captivates the charming scoundrel. Now high society tongues are wagging: Who is this mysterious newcomer, and what is the truth about her past? No matter that a life-long adversary will go to any lengths to ensure Danny's downfall, Jeremy, who vowed never to succumb to matrimony, finds his resolve weakening as he pursues a woman whose strong, passionate nature rivals his own and promises the kind of challenge a Malory man can't resist.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Holiday Present",
        "Authors": "By Lindsey, Johanna",
        "Description": "Now together for the first time, Johanna Lindsey&#39;s two classic Christmas tales, long beloved by her fans, available with a beautiful keepsake Christmas ornament!The Present: The love story that began the Mallory dynasty. Miracles have been known to happen in this season of peace and giving and love, as this dramatic story of a mysterious exotic gypsy that became the bride of a duke shows.Home for the Holidays: A treasured gift of love, tenderness, and ecstasy unbound. An enchanting story of a young impoverished gentlewoman and the mysterious gentleman whose heart is melted by her beauty.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The House on Hope Street: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "In eighteen years of marriage, Liz and Jack Sutherland had built a family, a successful  law practice, and a happy home near San Francisco, on Hope Street. Then, in an instant,  it all fell apart.   It began like any other Christmas morning. But for Jack Sutherland,  a five-minute errand ends in tragedy. And suddenly, Liz is alone, in the wake of  an unbearable loss.  How can she go on without her husband, her partner, her best  friend? How can she grieve when she must console five devastated children, including  one with special needs?   Powered by her children's love, Liz finds the strength  to return to work, to become both mother and \"daddy.\" One by one the holidays come  and go, until a devastating accident sends her oldest son to the hospital—and brings  Dr. Bill Webster into her life. Bill becomes a friend to Liz as he slowly heals her  shattered son.  With the first anniversary of Jack's death approaching, and with  it another Christmas in the house on Hope Street, a new relationship offers new hope,  and Liz reflects on the little blessings that give strength when nothing else is  left. But she will face one more crisis before she can look ahead to the beginning  of a new life.  The House on Hope Street is about learning to live again after you  think life is over. It is about cherishing small miracles, and believing in big ones.  It is above all about hope.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "No Place Like Home (Holiday Classics)",
        "Authors": "By Michaels, Fern",
        "Description": "Join beloved bestselling author Fern Michaels in her first holiday novel, a spirited, touching tale of three dynamic siblings who will do anything to bring their grandmother home for Christmas.   The Cisco triplets are appalled by their widowed father's behavior. He seems to care more about his gold-digging fiancée than he does about his own son and daughters. Even worse, Dad put their spunky grandmother -- head of the family candy company -- in a nursing home against her will. Setting out to spring Granny Cisco, college seniors Sara, Hannah, and Sam soon prove that trouble comes in threes. Apparently, so does love. . . . As the triplets get their grandmother the medical care that will make her independent again, all three find unexpected romance. If everything goes according to plan, there's going to be quite a crowd at Granny's house come Christmas -- and more proof than ever that there's no place like home for the holidays.   Includes a discussion with Fern Michaels and an excerpt from her new Cisco family novel, Family Blessings",
        "Category": " Fiction , Literary",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Twelve Days",
        "Authors": "By Hill, Teresa",
        "Description": "The Christmas holidays mark a dramatic turning point in the lives of Rachel and Sam McRae, a married couple from Baxter, Ohio, whose marriage is falling apart in the face of misunderstandings, lost dreams, old secrets, and self-sacrifice. Reissue.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Accident: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "Accident is a powerful and  ultimately triumphant novel of lives shattered and  changed  by one devastating moment.  Although frequent business meetings keep her husband,   Brad, away from home, Page Clarke feels blessed  with her happy family and comfortable  marriage.  They have a house near San Francisco and she keeps  busy looking after  their seven-year-old son, Andy,  and their teenage daughter, Allyson. Allyson,  at fifteen, is trying her wings and one  weekend, instead of an evening with her  friend Chloe,  the girls lie and go out with two older high  school boys. But a Saturday  night that was supposed  to be fun ends in tragedy when their car collides  head-on  with another. At the hospital,  Page finds Chloe's divorced father, Trygve, and,   unable to locate Brad, she leans on his strength  throughout the the long hours  of tormenting  questions. Will Allyson live? Will any of them? Were the  teenagers  drinking? Using drugs? Who was at  fault? And where is her husband? Without Brad  by her  side Page feels her life start to come apart as she  is forced to confront  the fact that Allyson may  not live, and if she does, she may never be the  same  again.  In an inspiring novel that  explores how many people are affected by one  tragic  accident and how they survive it, Danielle Steel  brings us close to the  characters whose lives are  as familiar as our own... and who live, as we all  do,  in a world where everything can change in a  single moment.",
        "Category": " Fiction , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Full Tilt (Max Holt)",
        "Authors": "By Evanovich, Janet and Hughes, Charlotte",
        "Description": "He lives life in the fast lane and she's along for the ride-with no brakes....Jamie Swift has one priority in quiet Beaumont, South Carolina: running the local newspaper. Romance runs second. But with the arrival of her silent partner, the notoriously mysterious and sexy Maximillian Holt, Jamie's life gets shaken up. Max claims he's here to give his brother-in-law a vote of confidence. A former wrestler, Frankie Fontana's now taking his shots in the political ring. Beaumont could use a mayor with scruples, but what it gets is a crime-and what Jamie gets is a story that's taking her for a ride on the wild side, complete with two assassins, a washed-up stripper, and an insane poacher. Between a spray of bullets and a fast getaway could it get any more romantic-or dangerous? Max and Jamie are betting their lives on a long shot.",
        "Category": " Fiction , Romance , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Dessert Circus: Extraordinary Desserts You Can Make At Home (Pbs Series)",
        "Authors": "By Torres, Jacques, Wright, Christina, Kruid, Kris, and Uher, John (PHT)",
        "Description": "Master the building blocks of dessert making and you can create anything. That is the simple philosophy of Jacques Torres, host of the public television series Dessert Circus and executive pastry chef at the world-renowned Le Cirque 2000 restaurant. In Dessert Circus he stays true to his principles. Learn how to temper chocolate (simply bringing melted chocolate to the right temperature) and you can make Chocolate-Covered Almonds. Learn to make sorbet (no harder than buying an ice cream machine) and you can make a Palette of Sorbets, a chocolate palette artfully topped with five different fruit sorbets. Master the recipe for Classic Genoise cake and you have the starting point for everything from Banana Moon Cakes to a raspberry mousse-filled ladybug.Jacques explains it all in clear, plain language, like a teacher at your side. He doesn't just tell you what to do, he tells you why you are doing it that way. Dessert Circus isn't just a stunning collection of a hundred astonishing desserts, it is a primer in the basics of dessert chemistry. You will learn about ingredients and how they react when mixed, kneaded, chilled, or heated and be taught the red flags of warning--the signs that something is not going right--and what you might be able to do to save the situation.Dessert Circus satisfies your every craving. Chocoholic? Revel in homemade Peanut Butter Cups. Want something simple and homey? How about Decorative Shortbread Cookies or Old-fashioned Macaroons? If you think creaminess is the hallmark of a dessert to die for, open up to classic Creme Brulee and soon-to-be-classic Tiramisu. There are fruit desserts (try Roosted Whole Peaches with Fresh Almonds and Pistachios), pastries, (Napoleons, Baba au Rhum), and frozen finales.But that's not all. Jacques has included recipes for all his signature desserts. Appreciate the architecture of New York City without ever leaving your kitchen by making The Manhattan, chocolate cake layered with a bittersweet chocolate cream constructed in the shape of a skyscraper. Enjoy winter any time of year with The Snowman, a little man made not out of snow but snowy white meringue and filled with tart lemon curd. If you're really feeling your baking oats, there is the final chapter, For the Truly Adventurous. Make a Cookie Tree, a Croquembouche (a pyramid of small cream puffs), or a wedding cake for sixty.Each recipe is rated for its level of difficulty so you can start with desserts that match your level of experience and work your way up to those more challenging. Every recipe is accompanied by a color photograph of the finished dessert and step-by-step photographs where appropriate.If you love dessert, you'll love Dessert Circus.",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Moonspun Magic (Magic Trilogy)",
        "Authors": "By Coulter, Catherine",
        "Description": "Strongly attracted to Damien Carstairs, Baron Drago, but repelled by his brutishness, Victoria Abermarle turns instead to his twin brother, Rafael, who is passionate yet gentle, in a story of fierce sibling rivalries and desire. by the author of Calypso Magic and Midsummer Magic. Reissue.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Dessert Circus at Home: Fun, Fanciful, And Easy-To-make Desserts",
        "Authors": "By Torres, Jacques, Wright, Christina, and Kruid, Kris",
        "Description": "Celebrated pastry chef Jacques Torres has finally answered the sweet dream of his readers: a dessert cookbook specially designed for the home cook! A follow–up of his first book, Dessert Circus, this new cookbook offers mouthwatering desserts that can easily be made in the home kitchen. He has taken his incredible scientific knowledge of ingredients and baking and used that to develop foolproof recipes for Mochachino Cake, Apple Crisp, Babka, and Upside–Down Lemon Cake and playful desserts like Chocolate Mousse and Porcupine. He also lets children get in on the fun with recipes for homemade Lollipops, Marshmallows, Chocolate Balloons, and Graham Crackers.",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Silhouette Christmas Stories 1989",
        "Authors": "By Marilyn Pappano, Lass Small, Bay Matthews, Brittany Young",
        "Description": "",
        "Category": "",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "The Aristocrat",
        "Authors": "By Coulter, Catherine",
        "Description": "American Brent Asher, a professional quarterback, is stunned when he learns that he has inherited an English estate and the title of Vicount Asherwood, but he soon discovers that he has also inherited a troublesome group of English relatives, including a cousin whom he must marry to gain a fortune. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Let It Snow",
        "Authors": "By Michaels, Fern, Chamberlin, Holly, Henley, Virginia, and Evanick, Marcia",
        "Description": "A delightfully merry collection of Yuletide romance stories includes Virginia Henley's Christmas Eve, in which Eve Barlow is stranded with arrogant firefighter Clint Kelly during a snowstorm and discovers that he has the power to melt her icy heart, as well as other works by Fern Michaels, Holly Chamberlin, and Marcia Evanick. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Sky's The Limit, Graduate!",
        "Authors": "By Shea, Chris",
        "Description": "This Graduate book is filled with wonderful illustrations and words of encouragement for the new graduate. Her poem takes the reader through stages in school from childhood to graduation with the 123s and ABCs of life and learning. Chris is the illustrator of the best-selling gift books God Thinks You're Wonderful and Merry Christmas with Love. She has become a favorite of gift buyers in Barnes and Noble & Borders who see huge potential for her little gift books.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Pieces of My Sister's Life: A Novel",
        "Authors": "By Arnold, Elizabeth Joy",
        "Description": "Two sisters who shared everything. One unforgivable moment. And a second chance…There’s something to talk about in every chapter of Elizabeth Joy Arnold’s poignant, insightful debut novel—the perfect summer read for all those who loved Elisabeth Robinson’s The True and Outstanding Adventures of the Hunt Sisters, Judy Blume’s Summer Sisters, and Jodi Picoult’s My Sister’s Keeper.Once, Kerry and Eve Barnard did everything together: sailing the Block Island harbor with their father, listening to their neighbor Justin’s magical fairy tales, and all the while longing for their absent mother. They were twin girls arm in arm, secrets entwined between two hearts. Until the summer of their seventeenth birthday, when their extraordinary bond was shattered. And thirteen years later, it will take all the courage they can summon to put the pieces back together—at a time when it matters most.…",
        "Category": " Fiction , Psychological",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Little Women / Secret Garden Flip Book (Puffin Classics)",
        "Authors": "By Burnett, Frances Hodgson and Alcott, Louisa May",
        "Description": "",
        "Category": "",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Gentle Little Lion (Little Animal Adventures)",
        "Authors": "By Jensen, Patricia, Clement, Claude, and Geneste, Marcelle",
        "Description": "By roaring for the first time Little Lion lets his father know he can stop worrying about his not acting like a lion. Includes facts about lion behavior.",
        "Category": "",
        "Publisher": "Readers Digest Assn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Pictorial history of the Mafia",
        "Authors": "By Maclean, Don",
        "Description": "",
        "Category": "",
        "Publisher": "Pyramid Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "So You're Thinking About Contemporary Worship",
        "Authors": "By Carson, Tim and Carson, Kathy",
        "Description": "",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Christian Board of Publication",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Island of Lost Maps: A True Story of Cartographic Crime",
        "Authors": "By Harvey, Miles",
        "Description": "The Island of Lost Maps tells the story of a curious crime spree: the theft of scores of valuable centuries-old maps from some of the most prominent research libraries in the United States and Canada. The perpetrator was Gilbert Joseph Bland, Jr., an enigmatic antiques dealer from South Florida, whose cross-country slash-and-dash operation had gone virtually undetected until he was caught in 1995–and was unmasked as the most prolific American map thief in history. As Miles Harvey unravels the mystery of Bland’s life, he maps out the world of cartography and cartographic crime, weaving together a fascinating story of exploration, craftsmanship, villainy, and the lure of the unknown.",
        "Category": " True Crime , General",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Love at First Beep (Wall - E Step into Reading Step 2)",
        "Authors": "By Jordan, Apple, Tilley, Scott (ILT), Tate, Elizabeth (ILT), Egan, Caroline (ILT), and Kim, Seung Lee (ILT)",
        "Description": "WALL•E IS THE last trash-collecting and trash-condensing robot on Earth. When he encounters EVE, a probe robot sent to evaluate signs of vegetation, his lonely life suddenly changes and he falls in love. Can this robot romance survive? Find out in this Step 2 reader, based on the Disney•Pixar movie, WALL•E.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Louis D. Brandeis: Justice for the People",
        "Authors": "By Strum, Philippa",
        "Description": "Traces the life and career of the great Supreme court justice and discusses his involvement with labor unions, trust busting, women's suffrage, unemployment legislation, and Zionism",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Schocken",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Captive Secrets",
        "Authors": "By Michaels, Fern",
        "Description": "\"This bestselling author is as polished as they come.\"PUBLISHERS WEEKLYFury van der Rhys is the daughter of Sirena, the beautiful Sea Siren, who rode the high seas as commander of a frigate, plundering the ships of the Dutch East India Company. Brandishing her mother's sword, Fury sets sail for the coast of Africa to challenge Amalie, the gorgeous black-hearted pretender to her mother's legacy, and to fight for the tall, dark-eyed Spaniard they both love and have sworn to have....",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "The Love Affair of an English Lord: A Novel (The Boscastles)",
        "Authors": "By Hunter, Jillian",
        "Description": "Award-winning author Jillian Hunter both amuses and delights with another irresistible tale of scandal and seduction.When Chloe Boscastle is caught indiscreetly kissing a man in a park, her brother Grayson–the protective patriarch of the Boscastle family–sends her off to a country manor to stay until the scandal in town subsides.Soon after Chloe’s banishment begins, she is shocked to learn that her neighbor Dominic Breckland, the devilish Viscount Stratfield, has been killed in his bed. But she is even more stunned to discover the dangerously handsome “victim” taking refuge in her lingerie closet one night. By some miracle Dominic has survived his attack–and wishes the world to believe him dead. Can the alluring Lady Chloe keep his secret? Dominic uses all his masculine charm to persuade her as they work together to unmask his enemy. Of course, being caught sheltering a seductive scoundrel could further mar Chloe’s already tarnished reputation. But, really, what’s a little scandal to a lady in love?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Heaven's Price: A Novel",
        "Authors": "By Brown, Sandra",
        "Description": "#1 New York Times bestselling author Sandra Brown has created a sensation with her contemporary novels. In Heaven’s Price she offers a sexy, tender, and funny story about a woman who thinks she knows her destiny, until she learns that her fate—and her heart—have something else in store.   Blair Simpson embraces a life most people merely dream about. Devoting her nights—as well as her days—to dancing in the chorus line of Broadway musicals and in occasional TV commercials, she has never considered another career. But when an injury sends her to a small town for six long months of recuperation, she finds herself surrounded by couples who are raising families and building dreams together. And there she meets a man who forces her to come to terms with a part of herself she has long denied.   From Blair’s first encounter with her new landlord, Sean Garrett, the powerful sexual attraction between them catches her off guard. For the first time she’s unable to lose herself in dancing, as Sean’s passion and tenderness urge her to open her life to him. More than anything, Sean wants to build a future with fiery, raven-haired Blair. But Blair’s own passion for dance has ruled her for so long, she may not be able to break its hold—even if it costs her the love she had thought she’d never find.   “Ms. Brown’s larger-than-life heroes and heroines make you believe all the warm, wonderful, wild things in life.”—Rendezvous",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Kidnapped: Being Memoirs of the Adventures of David Balfour in the Year 1751 (Puffin Classics)",
        "Authors": "By Stevenson, Robert Louis",
        "Description": "After being kidnapped by his villainous uncle, sixteen-year-old David Balfour escapes and becomes involved in the struggle of the Scottish highlanders against English rule",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Playing My Mother's Blues",
        "Authors": "By Wesley, Valerie Wilson",
        "Description": "Dani Carter was seven years old -- her sister, Rose, seventeen -- when their beautiful, impetuous mother, Maria, walked out of their lives, abandoning her husband and family for a love affair. Over the decades that followed, Dani has married a successful man and given birth to a wonderful son. But love has long been missing from her marriage, propelling her into the arms of another and inspiring troubling thoughts of escape. The sins of the mother, Dani fears, have been visited upon the daughter.Now that she finds herself in a similar heartbreaking situation, Dani can't help but wonder who Maria really was. It's a puzzle that may soon be completed, after a lifetime of searching for missing pieces. Maria, calling herself Mariah, is about to reenter her daughters' worlds, bearing secrets and bitter truths . . . and, perhaps, long-awaited answers to what could possibly drive a mother to sacrifice what was dearest to her heart.Playing My Mother's Blues",
        "Category": " Fiction , Psychological",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "The Paid Companion",
        "Authors": "By Quick, Amanda",
        "Description": "“Once again, the incomparable Quick has whipped up a delectable Regency romance” (Booklist)—about an ice-cold business agreement that turns into something far more heated…   The Earl of St. Merryn needs a woman. His intentions are purely practical—he simply wants someone sensible and suitably lovely to pose as his betrothed for a few weeks among polite society. He has his own agenda to pursue, and a false fiancée will keep the husband-hunters at bay while he goes about his business. The simplest solution is to hire a paid companion. After all, the sorry women who must accept such employment are sure to be grateful for any favor...   When he encounters Miss Elenora Lodge, he believes his problem is solved. Her dowdy attire and pinned-up hair cannot hide her fine figure and the fire in her golden eyes. And her unfortunate circumstances—and secret dreams of a life onstage—make the Earl’s offer undeniably appealing.    But St. Merryn is clearly hiding something, and things seem oddly amiss in his gloomy Rain   Street home. Elenora is soon to discover that his secrets are even darker than his décor—and this lark will be a more dangerous adventure than she’d been led to believe. And Arthur, Earl of St. Merryn, will find that the meek and mild companion he’d envisioned has become both a partner in his quest to catch a killer—and an outspoken belle of the ball who stirs a bothersome passion in his practical heart...",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Lawless (Loving Jack)",
        "Authors": "By Roberts, Nora",
        "Description": "Half-Apache gunslinger Jake Redman meets his match in the lovely but stubborn Sarah Conway, who is determined to make her home in the untamed wilds of the Arizona Territory. Reprint.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "To Tame a Highland Warrior (Highlander, Book 2)",
        "Authors": "By Moning, Karen Marie",
        "Description": "Only her love could gentle his savage soul—He was born to a clan of warriors of supernatural strength, but Gavrael McIllioch abandoned his name and his Highland castle, determined to escape the dark fate of his ancestors. Hiding his identity from the relentless rival clan that hunted him, he called himself Grimm to protect the people he cared for, vowing never to acknowledge his love for ravishing Jillian St. Clair. Yet even from afar he watched over her, and when her father sent an urgent summons, \"Come for Jillian,\" he raced to her side—into a competition to win her hand in marriage.Why had he run from her so many years before? And why return now to see her offered as a prize in her father's manipulative game? Furious, Jillian vowed never to wed. But Grimm was the man she loved, the one who urged her to marry another. He tried to pretend indifference as she tempted him, but he could not deny the fierce desires that compelled him to abduct her from the altar. She was the only woman who could tame the beast that raged within him—even as deadly enemies plotted to destroy them both....",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Special Ops (Brotherhood of War, Book 9)",
        "Authors": "By Griffin, W. E. B.",
        "Description": "A new novel by the creator of The Aviators chronicles the exploits of American Special Forces troops who fought a covert war against Cuban revolutionary Che Guevara in the Congo in 1964. Reprint.",
        "Category": " Fiction , Historical",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The New Breed (Brotherhood of War, Book 7)",
        "Authors": "By Griffin, W. E. B.",
        "Description": "From the blistering jungles of Vietnam to the far-flung battlefields of the African Congo, they faced the turmoil of a new era. It was a different kind of war. But the courage and skill of these young fighting men were an American tradition. Like their fathers before them, they rose up to the ultimate challenge of military valor, holding their own in a storm of clashing cultures. They were America's new breed. The proudest and the best...",
        "Category": " Fiction , War & Military",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Berets (Brotherhood of War)",
        "Authors": "By Griffin, W.E.B.",
        "Description": "",
        "Category": "",
        "Publisher": "Jove",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Heart of Honor (Heart Trilogy, Book 1)",
        "Authors": "By Martin, Kat",
        "Description": "Krista Hart, publisher of the weekly London ladies' gazette Heart to Heart, is not afraid to speak her mind. Even on such unpopular issues as social reform—risking her reputation and her very safety—Krista will not be intimidated, although she knows full well she is the target of angry opposition for her outspoken views.When she encounters a powerful Viking descendant imprisoned as a local sideshow attraction, Krista angrily demands his release. Although she tells herself that freeing Leif Draugr is simply the right thing to do, she can't deny being attracted to the fierce Nordic chieftain, especially after her father transforms him into a \"proper\" English gentleman.But as anonymous threats against Krista become more and more aggressive, it is Leif who must face the unseen enemies desperate to silence her, even as they push her closer into the embrace of a warrior prepared to do whatever it takes to make her his.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Marley & Me tie-in: Life and Love with the World's Worst Dog",
        "Authors": "By Grogan, John",
        "Description": "Is it possible for humans to discover the key to happiness through a bigger-than-life, bad-boy dog? Just ask the Grogans.John and Jenny were just beginning their life together. They were young and in love, with not a care in the world. Then they brought home Marley, a wiggly yellow furball of a puppy. Life would never be the same.Marley grew into a barreling, ninety-seven-pound streamroller of a Labrador retriever. He crashed through screen doors, gouged through drywall, and stole women's undergarments. Obedience school did no good -- Marley was expelled.But just as Marley joyfully refused any limits on his behavior, his love and loyalty were boundless, too. Marley remained a model of devotion, even when his family was at its wit's end. Unconditional love, they would learn, comes in many forms.Marley & Me is John Grogan's funny, unforgettable tribute to this wonderful, wildly neurotic Lab and the meaning he brought to their lives.",
        "Category": " Pets , Dogs , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Professional Photographer's Survival Guide",
        "Authors": "By Rotkin, Charles E.",
        "Description": "Advice on a successful career as a photographer discusses the building of a portfolio, getting jobs, completing assignments, legal responsibilities, and basic operating needs",
        "Category": "",
        "Publisher": "Amphoto Books",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Dorothy and the Wizard in OZ",
        "Authors": "By L. Frank Baum",
        "Description": "",
        "Category": "",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Appaloosa (A Cole and Hitch Novel)",
        "Authors": "By Parker, Robert B.",
        "Description": "When Virgil Cole and Everett Hitch arrive in Appaloosa, they find a town suffering at the hands of a renegade rancher who’s already left the city marshal and one of his deputies dead. Cole and Hitch are used to cleaning up after scavengers, but this one raises the stakes by playing not with the rules—but with emotion.Watch a QuickTime trailer for this book.",
        "Category": " Fiction , Westerns",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Gunman's Song (A Gunman's Reputation Novel)",
        "Authors": "By Cotton, Ralph W.",
        "Description": "AND THE LAST SHALL BE FASTLawrence Shaw once got a boost out of being the quickest gun alive. Now he’s partial to telling gunfighter stories rather than living them. But that doesn’t stop every ornery shootist with an itchy trigger finger from trying to pull iron on Fast Larry Shaw…or a group of gamblers from wagering five grand on who will kill him…or a gang of cutthroat saddle tramps from slaying his wife while in search of him.Racked with guilt for not saving his beloved, Shaw vows to shorten the life expectancy of her murderers—and any other hardcase who even thinks of sending hot lead his way.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "How to Understand Your Bible",
        "Authors": "By Job, John and Sterrett, T. Norton",
        "Description": "",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "IVP Connect",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1974"
        }
    },
    {
        "Title": "Rodrick Rules (Diary of a Wimpy Kid, Book 2) by Jeff Kinney (2008) Paperback",
        "Authors": "By Jeff Kinney",
        "Description": "",
        "Category": "",
        "Publisher": "Amulet Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Pyramid (Eyewitness Books)",
        "Authors": "By Putnam, James",
        "Description": "Illus. with full-color photos. Unlock the secrets to the  mysterious monuments of the ancient world--from Egyptian pyramids, built before the invention of the wheel, to amazing Aztec and Maya edifices.",
        "Category": "",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Portable Hawthorne: Revised and Expanded Edition (Viking Portable Library)",
        "Authors": "By Hawthorne, Nathaniel and Cowley, Malcolm",
        "Description": "Includes many stories and letters, selected passages from his novels and journals, and all of \"The Scarlet Letter.\"",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1977"
        }
    },
    {
        "Title": "Insiders",
        "Authors": "By Rogers, Rosemary",
        "Description": "Gorgeous, captivating, the object of every man's desire, Eve Mason's dreams of super model stardom have lured her into the California world of glamour and the media--where pleasure is an addictive drug...and beauty is a commodity to be bought, sold and degraded. But the whirlpool of lies and betrayals will not drag her under--even as it pulls her into the web of a dangerous lover. Because Eve is determined to taste the one fruit sweeter than wealth and fame: tender, uninhibited love.",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Gross Out!: Animals That Do Disgusting Things (Penguin Young Readers, Level 4)",
        "Authors": "By Clarke, Ginjer L. and Mueller, Pete (ILT)",
        "Description": "Did you know that the horned lizard squirts blood out of its eyes to scare off predators? Learn more about this creature as well as the leech, the naked mole rat, the hagfish, and many more creepy critters in this sickening and super science book. Not for the faint of heart, this revolting reader will be a favorite among boys and everyone interested in the strange and unusual!",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Dallas",
        "Authors": "By Raintree, Lee",
        "Description": "",
        "Category": "",
        "Publisher": "Dell Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1981"
        }
    },
    {
        "Title": "Tom Sawyer & Huckleberry Finn (Wordsworth Classics)",
        "Authors": "By Twain, Mark",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Your Credit Score: How To Fix, Improve, And Protect the 3-Digit Number that Shapes Your Financial Future",
        "Authors": "By Weston, Liz Pulliam",
        "Description": "",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Ft Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Dear Friend",
        "Authors": "By Orrico, Stacie and Riddle, Melissa",
        "Description": "One of the most touching songs of the past year was \"Dear Friend\" by Christian music phenomena Stacie Orrico. What many people don't know is that this powerful song was written by Stacie specifically for a real-life struggle that her close friend was going through. The core message of the song is the bond of unconditional love and support between friends. The design of this gift book and the tender message of this song will appeal to women of all ages. Included with each book is a CD single if the song Dear Friend.",
        "Category": " Religion , Inspirational",
        "Publisher": "J Countryman Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Why Did the Underwear Cross the Road?",
        "Authors": "By Korman, Gordon",
        "Description": "When Justin Zeckendorf is teamed up with two of the smartest girls in his fourth grade class for a good deed contest, his zany ideas almost cost them their chance to win",
        "Category": "",
        "Publisher": "Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "100 Ways To Motivate Yourself: Change Your Life Forever",
        "Authors": "By Chandler, Steve",
        "Description": "\"If you take the best of Wayne Dyer and add it to the best of Anthony Robbins, what you would have would only be half as good as Steve Chandler.\"--Dale Dauten, Chicago Tribune\"Some books that can help you awaken and begin to change are ones by Steve Chandler, who, I am reading lately. Great stuff. I'm becoming a fan of Steve Chandler.\"--Joe Vitale, best-selling author of The Attraction Factor and contributor to The Secret\"Steve Chandler lights you up with the glow of his internal neon. [He is] one of the funniest men I've ever known--what he proposes is so rock solid and reassuring.\"--Lisa Schnebly, The Arizona Republic\"100 Ways to Motivate Yourself is wonderful, inspirational, honest, and courageous. It speaks from every page. It is definitely a book I will recommend to my clients and friends.\"--Devers Branden, coauthor of What Love Asks of UsWith the third refreshed edition of 100 Ways to Motivate Yourself, Steve Chandler helps you create an action plan for living your vision, in business and in life. It features 100 proven methods to positively change the way you think and act--methods based on feedback from the hundreds of thousands of corporate and public seminar attendees Chandler speaks to each year. The book now also includes techniques and breakthroughs he has created for individual coaching clients.100 Ways to Motivate Yourself will help you break through the negative barriers and banish the pessimistic thoughts that are preventing you from fulfilling your lifelong goals and dreams. This edition also contains new mental and spiritual techniques that give readers more immediate access to action and results in their lives. If you're ready to finally make a change and reach your goals, Steve Chandler challenges you to turn your defeatist attitude into energetic, optimistic, enthusiastic accomplishments.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Career Pr Inc",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "How to Negotiate Successfully in Real Estate",
        "Authors": "By Hoffman, Anthony",
        "Description": "Provides guidance in making successful real estate deals by explaining how to use body-language, power phrases, and charisma while negotiating with owners, real-estate agents, attorneys, title companies, appraisers, and financiers",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Glacier Impressions",
        "Authors": "By Reddy, John (PHT) and Nickou, Kerry (PHT)",
        "Description": "",
        "Category": " Photography , Subjects & Themes , Regional",
        "Publisher": "Farcountry Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Bachelor's Puzzle",
        "Authors": "By Pella, Judith",
        "Description": "The local church ladies society and their eligible daughters decide to make a quilt for the new circuit-riding preacher and try to outdo one another to gain the attention of the young minister, whose endearing mistakes may not cover up his deception.",
        "Category": " Fiction , Christian , Historical",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Pretty Committee Strikes Back",
        "Authors": "By Harrison, Lisi",
        "Description": "A tragic haircut leaves Kristen looking manlier than a New York Jets linebacker. Will she be condemned to a season of trying to find cute hats when, as everyone knows, hats are so over? Meanwhile, Claire got everything she wants -- new camo Converse high-tops, bag and bags of gummies, and best of all, her first ever cell phone, from Massie. Although Claire's now an official member of the Clique, presents don't matter to her -- all she really wants is her first kiss from Cam, of course!",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Poppy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Zahir",
        "Authors": "By Coelho, Paulo",
        "Description": "La nueva novela del aclamado autor de El Alquimista y Once Minutos acerca del poder de una obsesión, y la búsqueda de un hombre que intenta recuperar un amor perdidoEl narrador de El Zahir es un aclamado autor de renombre internacional que vive en Francia y disfruta de los privilegios que le otorgan su fama y su dinero. Esther, su esposa de hace diez años, es corresponsal de guerra y a pesar de su éxito profesional, y su relativa libertad de los confines tradicionales del matrimonio, se enfrenta a una crisis existencial que la atormenta silenciosamente. Un día, Esther desaparece con su amigo Mikhail —quien podría o no ser su amante— y, perplejas ante la ausencia de indicios, las autoridades deciden cuestionar al narrador. Todos se preguntan si Esther fue secuestrada o asesinada, o si fue que simplemente decidió abandonar un matrimonio que la dejaba insatisfecha. El narrador no tiene las respuestas pero poco a poco comienza a interrogarse sobre su propia existencia.Sin embargo un día, Mikhail, el hombre con quien Esther fue visto por última vez, encuentra al narrador y promete llevarlo a donde se encuentra su mujer. Se embarcan un viaje que los lleva del suntuoso glamour de Paris, a Kazakhstan, el lugar de origen de Mikhail. Y es en este misterioso lugar, marcado por una historia a la vez trágica y espiritualmente poderosa, que el narrador comienza a hacer sorprendentes descubrimientos sobre si mismo.Esta evocadora novela escrita por el aclamado autor de los bestsellers internacionalesEl Alquimista y Once Minutos es la fascinante historia de una obsesión por recuperar un amor perdido, y una búsqueda por comprender cómo se relaciona con la libertad, la realización personal, y la necesidad que cada cual tiene de alcanzar sus metas.",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Pageant",
        "Authors": "By Lasky, Kathryn",
        "Description": "Sarah Benjamin, a Jewish teenager on the brink of Kennedy's New Frontier, wonders if she can endure four more years of Stuart Hall, Indianapolis's most exclusive, very Christian, and impossibly stuffy school for girls.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Eclipse",
        "Authors": "By Patterson, Richard North",
        "Description": "The spellbinding story of an American lawyer who takes on a nearly impossible case—the defense of an African freedom fighter against his corrupt government’s charge of murderDamon Pierce’s life has just reached a defining moment: a gifted California lawyer, he’s being divorced by his wife and his work often seems soulless. Then he receives a frantic e-mail from Marissa Brand Okari—a woman he loved years ago—and decides to risk everything to respond to her plea for help. Marissa’s husband, Bobby Okari, is the charismatic leader of a freedom movement in the volatile west African nation of Luandia, which is being torn apart by the world’s craving for its vast supply of oil. Bobby’s outspoken opposition to the exploitation of his homeland by PetroGlobal—a giant American oil company with close ties to Luandia’s brutal government—has enraged General Savior Karama, the country’s autocratic ruler. After Bobby leads a protest rally during a full eclipse of the sun, everyone in his home village is massacred by government troops. And now Bobby has been arrested and charged with the murder of three PetroGlobal workers. Still drawn to Marissa, Pierce agrees to defend Bobby, hoping to save both Bobby and Marissa from almost certain death.  But the lethal politics of Luandia may cost Pierce his life instead. Culminating in a dramatic show trial and a desperate race against time, Eclipse combines a thrilling narrative with a vivid look at the human cost of the global lust for oil. Here is Richard North Patterson at his compelling best, confirming his place as our most provocative author of popular fiction.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Henry Holt",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Lean and Luscious Favorites: The World's Best 301 Lowfat Recipes: Delicious, Easy to Prepare, Fun, and Healthful!",
        "Authors": "By Hinman, Bobbie, Snyder, Millie, and Crist, Vonnie Winslow (ILT)",
        "Description": "Discover for yourself why Lean and Luscious has become the word-of-mouth cookbook phenomenon! Authors Bobbie Hinman and Millie Snyder showcase their own favorite recipes in this special new book. These easy-to-make, easy-to-eat dishes are deliciously low in fat, calories, and cholesterol. They?re also: Fun, quick, and convenient Enjoyable for anyone Compatible with weight-reduction and fitness diets Complete with detailed counts of calories, fat, cholesterol, fiber, carbohydrates, sodium, and proteinThe Lean and Luscious series is beloved by cooks everywhere. Now, with recipes that are easy to prepare and a pleasure to eat, you too can prove to yourself that good health doesn?t have to mean sacrificing taste!About the AuthorsBobbie Hinman is the author of The Meatless Gourmet. She lives in Wilmington, Delaware.Millie Snyder is the author of Light Fantastic! She lives in Charleston, West Virginia.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Holy communion: What it means and how to prepare for it",
        "Authors": "By Charles Lewis Slattery",
        "Description": "",
        "Category": "",
        "Publisher": "Parish Press",
        "Price Starting With ($)": "16.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1926"
        }
    },
    {
        "Title": "Coming Home: Timeless Wisdom for Families",
        "Authors": "By Dobson, James C.",
        "Description": "In Coming Home, Dr. James Dobson offers practical wisdom and help on a wide range of marriage and family issues. These selections from Dr. Dobson's 90-second radio feature, Focus on the Family Commentary, provide wisdom and inspiration for the various family relationships. Some provide an encouraging boost, while others give a gentle nudge that we all need occasionally to maintain healthy priorities at home. Families young and old will find this lovely gift book charming and insightful.",
        "Category": " Family & Relationships , General",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Italy: The Beautiful Cookbook",
        "Authors": "By HarperCollins",
        "Description": "",
        "Category": "",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "You Can Teach Your Child Successfully: Grades 4-8",
        "Authors": "By Beechick, Ruth",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Mott Media",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "A Girl Named Helen Keller (Scholastic Reader Level 3)",
        "Authors": "By Trivas, Irene (ILT) and Lundell, Margo",
        "Description": "An easy-to-read version of the remarkable story of Helen Keller and her special teacher, Ann Sullivan, provides illustrations of a one-hand manual alphabet at the end of the book. Original.",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Fodor's Greece, 1997",
        "Authors": "By Paulus, Little Conrad (EDT)",
        "Description": "The best guide to Greece, completely updatedCity walks, mountain drives and hikes, seaside spelunkingMedieval monasteries, sanctuaries from mythologyHot spots for nightlife, shopping, beaches, sailing, and windsurfingWhere to stay and eat, no matter what your budgetRooms with a view in traditional hotels, sybaritic resorts, historic restorations, and family-run pensionsWaterside tavernas, souvlaki joints, ouseri, and smart city restaurants for Greek and foreign foodFresh, thorough, practical--from writers you can trustCosts, hours, descriptions, and tips by the thousandsAll reviews based on visits by savvy writer-residents39 pages of maps, vacation itineraries, and moreImportant Contacts A to Z; Smart Travel Tips; Fodor's Choice; Festivals; Pleasures & Pastimes; New & Noteworthy; complete index.",
        "Category": " Travel , Europe , Greece",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Mount St. Helens: The Continuing Story (in pictures)",
        "Authors": "By Quiring, James P.",
        "Description": "",
        "Category": " Travel , Pictorials",
        "Publisher": "KC Publications, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "James Bond: The Secret World of 007",
        "Authors": "By Dougall, Alastair, Stewart, Roger (ILT), and Worrall, Dave (EDT)",
        "Description": "A detailed photographic journey into the James Bond films, published with the assistance of their producers, includes dynamic stills from the movies, details on major characters, descriptions of high-tech Bond gadgets, and an updated biography of the master spy.",
        "Category": " Performing Arts , Film , General",
        "Publisher": "DK",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    }
]