[
    {
        "Title": "McPherson Goes to Work",
        "Authors": "By McPherson, John",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Essays That Will Get You into College",
        "Authors": "By Burnham, Amy, Kaufman, Daniel, and Dowhan, Chris",
        "Description": "",
        "Category": " Study Aids , College Entrance",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Student Companion to Accompany Biochemistry, 5th Edition",
        "Authors": "By Stryer",
        "Description": "",
        "Category": " Science , Life Sciences , Biochemistry",
        "Publisher": "W. H. Freeman",
        "Price Starting With ($)": "5.71",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Origins of the First World War (Origins of Modern Wars)",
        "Authors": "By Joll, James",
        "Description": "Joll's (emeritus, U. of London) acclaimed narrative, first published in 1984, and now revised and updated to reflect the latest research, is a wide-ranging analysis of the historical forces at work in the Europe of 1914, and the very different ways historians have subsequently attempted to understand them. This title initiates a major new Longman series. Printed on acidic paper. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , Military , World War I",
        "Publisher": "Longman Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Harvard Business Review on Breakthrough Thinking",
        "Authors": "By Drucker, Peter Ferdinand, Leonard, Dorothy, Amabile, Teresa, Rayport, Jeffrey, Morley, Elleen, Silver, Andrew, and Suzy, Wetlaufer",
        "Description": "Proven strategies for fostering and managing creativity do exist--the Harvard Business Review has published some of the best thinking on how to organize for innovation. This collection highlights leading ideas for incorporating the power of creativity into your strategic outlook. The Harvard Business Review Paperback Series is designed to bring today's managers and professionals the fundamental information they need to stay competitive in a fast-moving world. Here are the landmark ideas that have established the Harvard Business Review as required reading for ambitious businesspeople in organizations around the globe.Articles include: How to Kill Creativity by Teresa Amabile; Spark Innovation Through Empathic Design by Dorothy Leonard and Jeffrey F. Rayport; Putting Your Company's Whole Brain to Work by Dorothy Leonard and Susan Straus; A Film Director's Approach to Managing Creativity by Eileen D. Morley and Andrew Silver; What's Stifling the Creativity at CoolBurst? by Suzy Wetlaufer; The Discipline of Innovation by Peter F. Drucker; Interpretive Management: What General Managers Can Learn from Design by Richard K. Lester, Michael J. Piore, and Kamal M. Malek; and Value Innovation: The Strategic Logic of High Growth by W. Chan Kim and Rene A. Mauborgne.",
        "Category": " Business & Economics , Management",
        "Publisher": "Harvard Business Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Best of Mr. Food: Quick and Easy Recipes",
        "Authors": "By Ginsburg, Art",
        "Description": "The host of the Mr. Food Show shares tips and secrets from his kitchen, including 175 easy-to-prepare, budget-minded recipes that can be easily replicated by most people.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Navajo Coyote Tales",
        "Authors": "By Morgan, William (COM)",
        "Description": "Coyote encounters Rabbit, Fawn's Stars, Crow, Snake, Skunk Woman, and Horned Toad in these 6 delightful, English-language adaptations of traditional Navajo Coyote stories collected by anthropologist William Morgan and translated by him and linguist Robert W. Young.",
        "Category": " Fiction , Fairy Tales, Folk Tales, Legends & Mythology",
        "Publisher": "Gibbs Smith, Publisher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Aerobics for Women",
        "Authors": "By Mildred Cooper, Kenneth Cooper",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Up, Down, and Around",
        "Authors": "By Ayres, Katherine and Westcott, Nadine Bernard (ILT)",
        "Description": "\"An inviting introduction to the wonder of plants, food, and gardening. . . . Will be a favorite of teachers, students, and home readers alike.\"— KIRKUS REVIEWSFrom seeds dropping into soil to corn bursting from its stalks, from children chasing butterflies to ants burrowing underground, everything in this vibrant picture book pulses with life —- in all directions! Sprightly illustrations set the mood for a rhythmic text that follows nature’s course to a feast of backyard bounty.",
        "Category": " Juvenile Fiction , Science & Nature , General",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Magic Toyshop (Usborne Picture Puzzles, What's the Difference?)",
        "Authors": "By Allman, Howard (PHT), Barlow, Amanda (ILT), Moller, Ray (PHT), Cox, Phil Roxbee, Tyler, Jenny, and Heath, Rupert (EDT)",
        "Description": "",
        "Category": " Juvenile Fiction , Sports & Recreation , Games",
        "Publisher": "USBORNE PUBLISHING",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Gospel parallels : synopsis of the first three Gospels with alternative readings from the manuscripts and noncanonical parallels : text used is the ... the Huck-Lietzmann synopsis, 9th ed., 1936",
        "Authors": "By Throckmorton, Burton Hamilton",
        "Description": "",
        "Category": "",
        "Publisher": "T. Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Sinai : The Great and Terrible Wilderness",
        "Authors": "By Bernstein, Burton",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "Eldest, Limited Edition (Inheritance, Book 2)",
        "Authors": "By Paolini, Christopher",
        "Description": "This deluxe edition of the runaway international bestseller includes:·A sneak peek at Book III·An exclusive, full-color foldout poster of Glaedr by award-winning artist John Jude Palencar·A revealing excerpt of the history of Alagaësia ·Never-before-seen art by the author, including an image of Brom’s elf ring·A complete and comprehensive list of people, places, things, and dwarf clansDarkness falls. . . . Swords clash. . . . Evil reigns.Eragon and his dragon, Saphira, have just saved the rebel state from destruction by the mighty forces of King Galbatorix, cruel ruler of the Empire. Now Eragon must travel to Ellesméra, land of the elves, for further training in magic and swordsmanship, the vital skills of the Dragon Rider. It is the journey of a lifetime, filled with awe-inspiring new places and people, each day a fresh adventure. But chaos and betrayal plague him at every turn, and Eragon isn’t sure whom he can trust.Meanwhile, his cousin Roran must fight a new battle back home in Carvahall–one that puts Eragon in even graver danger.Will the king's dark hand strangle all resistance? Eragon may not escape with even his life. . . .",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Off Armageddon Reef",
        "Authors": "By Weber, David",
        "Description": "The Terran Federation Navy fought desperately for over forty years, but the ruthless species known as the Gbaba slaughtered the human race's extra-Solar colonies one by one. Now the end had finally come; Earth herself lay under siege by an enemy humankind could not defeat.And so mankind undertook one last throw of the dice: Operation Ark. Earth's final colonizing expedition was meant to build a new civilization, on a planet so distant even the Gbaba might never find it and without the high-tech infrastructure whose emissions might betray its location. To protect and conceal that expedition, the Navy's final fleet was prepared to die to the test ship. Lieutenant Commander Nimue Alban volunteered to serve on the flagship of that fleet, knowing that she and everyone else aboard it would die...which was exactly what happened.So she was a little surprised to wake up in a cave on a planet called Safehold. She was even more surprised to discover that she'd been dead for eight centuries ... and that the fanatic administrators of Operation Ark had used mind-control techniques to create a false, brutally suppressive religion in which, every single Safeholdian believed - one whose entire purpose was to forbid invention and innovation forever.Everyone on Safehold know the Church was the consecrated custodian of God's will. Everyone knew forbidden technology was the work of the Devil. And everyone knew that anyone who dabbled in the for-bidden must be destroyed, test everyone's soul be lost forever to damnation.But a tiny faction within Operation Ark's leadership remembered the truth and believed in human dignity and freedom. They've left Nimue Alban to oppose that monstrous creation, and they've given her a carefully hidden cache of technology and the capabilities of the android body in which her memories, loves, hopes, and dreams live on. Now it's her job to somehow provoke the technological progress - and freedom of thought and belief - the Church of God Awaiting has worked centuries to crush.Nimue Alban spent her entire life fighting against the inevitable destruction of her species. Now she's about to discover that dying in humanity's defense was the easy part.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor",
        "Price Starting With ($)": "6.22",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Button Box",
        "Authors": "By Chamberlain, Sarah (ILT), Reid, Margarette S., and Chamerlain, Sarah (ILT)",
        "Description": "\"Simple toys are best, and when they're done as well as this, simple books as well.\"'Bulletin of the Center for Children's BooksAn imaginative little boy explores the many pleasures that can be found in'and made from'his grandmother's button box.NCSS-CBC Notable Children's Trade Book in the Field of Social Studies\"Chamberlain's bold linoleum cuts, with gentle color added, portray the buttons in loving detail and give the book an appropriately old-fashioned flavor.\"'Kirkus Reviews\"Besides inspiring some flights of fancy for readers, the book will suggest many uses to parents and librarians for games, history lessons, and puppetry.\"'Booklist",
        "Category": " Juvenile Fiction , Concepts , Counting & Numbers",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Cardinal Virtues",
        "Authors": "By Greeley, Andrew M.",
        "Description": "Father Lar and his new, young assistant, Father Jamie, discover a sinister, secret organization called \"Corpus Christi,\" a cult practicing evil clandestine rites, at work in their wealthy suburban parish",
        "Category": " Fiction , Religious",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "TRADING PLACES. [Hardcover]",
        "Authors": "By F. Michaels",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Star Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Larousse Treasury of Country Cooking",
        "Authors": "By Marie Maronne, Rose Montigny",
        "Description": "",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "How to make money in Wall Street",
        "Authors": "By Rukeyser, Louis",
        "Description": "The host of the public-television program Wall Street Week offers tips on investing in stocks, bonds, commodities, and mutual funds",
        "Category": " Business & Economics , General",
        "Publisher": "Dolphin Books",
        "Price Starting With ($)": "11.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Conquer the Crash: You Can Survive and Prosper in a Deflationary Depression (Wiley Trading)",
        "Authors": "By Prechter, Robert R., Jr.",
        "Description": "1>\"A must-read book.\" —Martin D. Weiss PhD, author of the best-selling Ultimate Safe Money Guide Will deflation and depression really happen What causes deflation and depression Can the Fed prevent deflation? Where can you find the few exceptionally sound banks, insurers, gold dealers and other essential service providers that can help you protect your wealth How should you arrange your finances and your life in order to survive the depression, prosper while it's happening, and take advantage of the unprecedented opportunity coming at the next major bottom Not one in ten thousand investors will think to ask these questions, even as their financial institutions may be lurching toward insolvency You will find the answers in this boo \"This book outlines brilliantly and simply the rationale for how and why the bubble developed. Prechter will go down in history as a legend for having predicted the secular bull market and now having provided a lucid description of the economic cataclysm that unfortunately lies ahead. I urge you to read this book and give it to your loved ones. It provides great tactical advice on how to prepare yourself financially. Reading this book could make the difference between agony and comfort over the next 20 years.\" —David Tice, President, Prudent Bear Funds",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "John Wiley & Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Maida Heatter's Book of Great Chocolate Desserts",
        "Authors": "By Heatter, Maida",
        "Description": "An acknowledged connoisseur and adept of desserts compiles the quintessential collection on chocolate desserts, from perfect cookies to the ultimate white chocolate mousse, including advice on techniques and equipment",
        "Category": " Cooking , Specific Ingredients , Chocolate",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1980"
        }
    },
    {
        "Title": "The 8th Confession (Women's Murder Club, 8)",
        "Authors": "By Patterson, James and Paetro, Maxine",
        "Description": "Join the Women's Murder Club on an exhilarating thrill ride as love and murder test their friendships like never before.Someone is killing the richest people in the city-and the Women's Murder Club will pay a high price for hunting him. At the party of the year, San Francisco's most glamorous couple is targeted by a killer-and it's the perfect murder. While Detective Lindsay Boxer investigates the high-profile killings, a saintly street preacher is brutally executed. Reporter Cindy Thomas inquires into this neglected case and discovers the victim may have had very dark secrets. As the search for two criminals tests the limits of the Women's Murder Club, Lindsay sees sparks fly between Cindy and Lindsay's partner, Detective Rich Conklin. The Club now faces its toughest challenge: Will love destroy all that the four friends have built?",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Disturbing the Universe",
        "Authors": "By Freeman Dyson",
        "Description": "The world-famous mathematician, physicist, and theoretical astronomer writes of his own experiences and offers portraits of Hans Bethe, Robert Oppenheimer, and Dick Feynman as he brings to light the nature of science and the dilemmas confronting the scientist",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "21.27",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Pain and the Possibility",
        "Authors": "By Ripple, Paula",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Ave Maria Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "Harvard Business Review on Change (Harvard Business Review Paperback Series)",
        "Authors": "By Collins, James, Kotter, John P., Pascale, Richard, Duck, Jeanie Daniel, Porras, Jerry, and Athos, Anthony",
        "Description": "The Harvard Business Review paperback series is designed to bring today's managers and professionals the fundamental information they need to stay competitive in a fast-moving world. Here are the landmark ideas that have established the Harvard Business Review as required reading for ambitious business people in organizations around the globe. From the seminal article \"Leading Change\" by John Kotter to Paul Strebel on why employees so often resist change, Harvard Business Review on Change is the most comprehensive resource available for embracing corporate change--and using it to your company's greatest advantage. Articles include: Leading Change: Why Transformation Efforts Fail by John P. Kotter; Building Your Company's Vision by James C. Collins and Jerry I. Porras; Managing Change: The Art of Balancing by Jeanie Daniel Duck; The Reinvention Roller Coaster: Risking the Present for a Powerful Future by Tracy Goss, Richard T. Pascale, and Anthony G. Athos; Changing the Mind of the Corporation by Roger Martin; Why Do Employees Resist Change? by Paul Strebel; Reshaping an Industry: Lockheed Martin's Survival Story by Norman R. Augustine; and Successful Change Programs Begin with Results by Robert H. Schaffer and Harvey A. Thomson.",
        "Category": " Business & Economics , Management",
        "Publisher": "Harvard Business Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "America Unbound: The Bush Revolution in Foreign Policy",
        "Authors": "By Daalder, Ivo H. and Lindsay, James M.",
        "Description": "George W. Bush has launched a revolution in American foreign policy. He has redefined how America engages the world, shedding the constraints that friends, allies, and international institutions impose on its freedom of action. He has insisted that an America unbound is a more secure America.  How did a man once mocked for knowing little about the world come to be a foreign policy revolutionary? In America Unbound, Ivo H. Daalder and James M. Lindsay dismiss claims that neoconservatives have captured the heart and mind of the president. They show that George W. Bush has been no one's puppet. He has been a strong and decisive leader with a coherent worldview that was evident even during the 2000 presidential campaign.  Daalder and Lindsay caution that the Bush revolution comes with significant risks. Raw power alone is not enough to preserve and extend America's security and prosperity in the modern world. The United States often needs the help of others to meet the challenges it faces overseas. But Bush's revolutionary impulse has stirred great resentment abroad. At some point, Daalder and Lindsay warn, Bush could find that America's friends and allies refuse to follow his lead. America will then stand alone&#151;a great power unable to achieve its most important goals.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Bechtel: Building a Century, 1898-1998",
        "Authors": "By Bechtel",
        "Description": "",
        "Category": " Technology & Engineering , Engineering (General)",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "43.95",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Breaking Dawn (The Twilight Saga, Book 4)",
        "Authors": "By Meyer, Stephenie",
        "Description": "When you loved the one who was killing you, it left you no options. How could you run, how could you fight, when doing so would hurt that beloved one? If your life was all you had to give, how could you not give it? If it was someone you truly loved?To be irrevocably in love with a vampire is both fantasy and nightmare woven into a dangerously heightened reality for Bella Swan. Pulled in one direction by her intense passion for Edward Cullen, and in another by her profound connection to werewolf Jacob Black, a tumultuous year of temptation, loss, and strife have led her to the ultimate turning point. Her imminent choice to either join the dark but seductive world of immortals or to pursue a fully human life has become the thread from which the fates of two tribes hangs.Now that Bella has made her decision, a startling chain of unprecedented events is about to unfold with potentially devastating, and unfathomable, consequences. Just when the frayed strands of Bella's life-first discovered in Twilight, then scattered and torn in New Moon and Eclipse-seem ready to heal and knit together, could they be destroyed... forever?The astonishing, breathlessly anticipated conclusion to the Twilight Saga, Breaking Dawn illuminates the secrets and mysteries of this spellbinding romantic epic that has entranced millions.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "A Dangerous Age: A Novel",
        "Authors": "By Gilchrist, Ellen",
        "Description": "The winner of the National Book Award returns with a moving story of a family of women drawn together by the trials of the times.The women in the Hand family are no strangers to either controversy or sadness. Those traits seem, in fact, to be a part of their family’s heritage, one that stretches back through several generations and many wars. A Dangerous Age is a celebration of the strength of these women and of the bonds of blood and shared loss that hold them together. Louise, Winifred, and Olivia are reconnecting the pieces of their lives and rediscovering love, but each is unwittingly on a collision course with a seemingly distant war that is really never more than a breath away. By turns humorous and heartbreaking, this finely honed novel about the centuries-old struggle for women who are left to carry on with life when their men go off to war is by a writer the Washington Post says “should be declared a national cultural treasure.”",
        "Category": " Fiction , War & Military",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Thank You for All Things: A Novel",
        "Authors": "By Kring, Sandra",
        "Description": "At twelve, Lucy Marie McGowan already knows she’ll be a psychologist when she grows up. And her quirky and conflicted family provides plenty of opportunity for her to practice her calling. Now Lucy, her “profoundly gifted” twin brother, Milo, her commitment-phobic mother, and her New Age grandmother are leaving Chicago for Timber Falls, Wisconsin, to care for her dying grandfather—a complex and difficult man whose failure as a husband and father still painfully echoes down through the years.Lucy believes her time in the rural town where the McGowan story began will provide a key piece to the puzzle of her family’s broken past, and perhaps even reveal the truth about her own missing father. But what she discovers is so much more—a lesson about the paradoxes of love and the grace of forgiveness that the adults around her will need help in remembering if their family is ever to find peace and embrace the future. By turns heart-wrenching and heart-mending, Thank You for All Things is a powerful and poignant novel by a brilliant storyteller who illustrates that when it comes to matters of family and love, often it is the innocent who force others to confront their darkest secrets.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Bantam Discovery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "If I Die in a Combat Zone: Box Me Up and Ship Me Home",
        "Authors": "By O'Brien, Tim",
        "Description": "A classic from the New York Times bestselling author of The Things They Carried \"One of the best, most disturbing, and most powerful books about the shame that was / is Vietnam.\"—Minneapolis Star and TribuneBefore writing his award-winning Going After Cacciato, Tim O'Brien gave us this intensely personal account of his year as a foot soldier in Vietnam. The author takes us with him to experience combat from behind an infantryman's rifle, to walk the minefields of My Lai, to crawl into the ghostly tunnels, and to explore the ambiguities of manhood and morality in a war gone terribly wrong. Beautifully written and searingly heartfelt, If I Die in a Combat Zone is a masterwork of its genre.Now with Extra Libris material, including a reader’s guide and bonus content.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Crown",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Get Your Sparkle On: Create and Wear the Gems that Make You Shine",
        "Authors": "By Cain, Lindsay and Weir, Sarah B.",
        "Description": "Lindsay Cain, owner of Femmegems design-your-own jewelry boutiques, makes high-fashion fantasies a reality with step-by-step instructions for creating brilliant earrings, bracelets, necklaces, and moreall of which would cost a fortune if bought in a store. On top of the 25 divinely easy projects, she's packed the pages with loads of advice on finding a unique personal style, repurposing forgotten hand-me-downs, and recreating jewelry box buried treasures. With a hip attitude and juicy insider tips, Lindsay has included looks for everyone. Prepsters, princesses, glamour girls, beach babes, brides, and more, will all be inspired to created unique, sophisticated pieces for themselves or to give to friends. Lush, full-color photographs of finished baubles, bangles, and beads plus playful illustrations throughout make this a glittering gem of a book.",
        "Category": " Crafts & Hobbies , Jewelry",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Vendetta for the Saint",
        "Authors": "By Leslie Charteris",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "6.65",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "High Performance Heart: Effective Training with the HRM for Health, Fitness and Competition",
        "Authors": "By Maffetone, Philip and Mantell, Matthew",
        "Description": "Increase your physical performance and stamina, reduce your resting heart rate, train more effectively with less pain and drudgery, live longer and healthier, and perform better in sports with expert advice from sports physician Philip Maffetone. Foreword by Mark Allen. Revised and updated ed.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "MBI",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Marley: A Dog Like No Other: A Special Adaptation for Young Readers",
        "Authors": "By Grogan, John",
        "Description": "This nonfiction book has been faithfully adapted for young readers from the #1 New York Times bestselling memoir Marley & Me by John Grogan!   Marley, a lovable Labrador retriever, is always getting himself into trouble. Some may say he is the world's worst dog. But those who know and love Marley understand that nothing can stop his loyalty, exuberance, and passion—not even the Grogans' screen door! How this big, rambunctious dog becomes the heart of the Grogan family is the story of Marley.",
        "Category": " Juvenile Nonfiction , Animals , Dogs",
        "Publisher": "Collins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Heart of Darkness and The Secret Sharer",
        "Authors": "By Conrad, Joseph",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1950"
        }
    },
    {
        "Title": "Fowl Weather",
        "Authors": "By Tarte, Bob",
        "Description": "In Bob Tarte's home, pandemonium is the order of the day, and animals literally rule the roost—thirty-nine of them at last count. Whether it's the knot-tying African grey parrot, or the overweight cat who's trained Bob to hold her water bowl just above the floor, or the nightmarish duck who challenges him to a shoving match, this menagerie, along with his endlessly optimistic wife, Linda, provides daily lessons on the chaos inherent in our lives. But not until this modern-day Noah's Ark hits stormy weather—and Bob's world spins out of control—does he realize that this exuberant gaggle of animals provides his spiritual anchor. It is their alien presence, their sense of humor, and their impulsive behavior that both drive Bob crazy and paradoxically return him to sanity. With the same sly humor and dead-on character portraits that made Enslaved by Ducks such a rousing success, Tarte proves that life with animals offers a wholly different perspective on the world.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "The Only Three Questions That Count: Investing by Knowing What Others Don't",
        "Authors": "By Fisher, Kenneth L., Chou, Jennifer, Hoffmans, Lara W., and Cramer, James J. (FRW)",
        "Description": "The Only Three Questions That Count is the first book to show you how to think about investing for yourself and develop innovative ways to understand and profit from the markets. The only way to consistently beat the markets is by knowing something others don’t know. This book will show you how to do just that by using three simple questions. You’ll see why CNBC’s Mad Money host and money manager James J. Cramer says, \"I believe that reading his book may be the single best thing you could do this year to make yourself a better investor.In The Only Three Questions That Count, Ken Fisher challenges the conventional wisdoms of investing, overturns glib theories with hard facts, and blows up complacent beliefs about money and the markets. Ultimately, he says, the key to successful investing is daring to challenge yourself and whatever you believe to be true. Packed with more than 100 visuals, usable tools, and a glossary, The Only Three Questions That Count is an entertaining and educational experience in the markets unlike any other, giving you an opportunity to reap the huge rewards that only the markets can offer.",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Lillian Too's 168 Feng Shui Ways to a Calm and Happy Life",
        "Authors": "By Too, Lillian",
        "Description": "The world's bestselling feng shui author leads her many readers down the path to a lifetime of happiness and harmony. In the same format as the popular Lillian Too's 168 Feng Shui Ways to Declutter Your Home, her new tip-based guide examines the flow of energy, or chi, inside the home and afflictions caused by poor design. She gives simple remedies for finding romance and assuring a blissful marriage, and devotes an entire section to Flying Star feng shui, which determines exactly when certain areas are lucky or unlucky, so you can maximize their potential for peace and joy. Both tangible and intangible elements receive Too's careful attention, along with advice on doing regular feng shui updates and adding symbolic enhancements to the house.",
        "Category": " Body, Mind & Spirit , Feng Shui",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "New Ideas from Dead Economists: An Introduction to Modern Economic Thought",
        "Authors": "By Buchholz, Todd G.",
        "Description": "The classic introduction to economic thought, now updated in time for the publication of New Ideas from Dead CEOs This entertaining and accessible introduction to the great economic thinkers throughout history? Adam Smith, John Stuart Mill, Karl Marx, John Maynard Keynes, and more?shows how their ideas still apply to our modern world. In this revised edition, renowned economist Todd Buchholz offers an insightful and informed perspective on key economic issues in the new millennium: increasing demand for energy, the rise of China, international trade, aging populations, health care, and the effects of global warming. New Ideas from Dead Economists is a fascinating guide to understanding both the evolution of economic theory and our complex contemporary economy.",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "9 Things a Leader Must Do: How to Go to the Next Level--And Take Others With You",
        "Authors": "By Cloud, Henry",
        "Description": "Why do some leaders get and accomplish what they want as a matter of routine, while others seem to regularly experience frustration and setbacks?  Why do some leaders achieve their goals and reach new heights, while others barely \"hang in there\" and survive?  Based on his groundbreaking psychological study of the ways that successful individuals think and behave, Dr. Henry Cloud presents a simple yet profound roadmap to help leaders-and those who want to become leaders-arrive at greater levels of personal growth and corporate influence than they previously thought were possible.  The good news for all of us is that leadership success is not limited to vague notions of \"charisma\" nor traditional advantages like graduate degrees and connections, but much more to a pattern of thinking and moving forward that learns from mistakes and stays focused on goals.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Little Red Book of Sales Answers: 99.5 Real World Answers That Make Sense, Make Sales, and Make Money",
        "Authors": "By Gitomer, Jeffrey H.",
        "Description": "Salespeople need answers, fast! Now, one book brings together all the proven, tested, instant answers they'll ever want:  Little Red Book of Sales Answers . This is the legendary Jeffrey Gitomer, the world's #1 sales presenter and author of the inspirational 250,000-copy bestseller Little Red Book of Selling. This new book goes beyond anything Gitomer's ever done, offering 99.5 quick, fun-to-read, real-world answers guaranteed to make sense, and make money!",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "FT Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The War Against Hope: How Teachers' Unions Hurt Children, Hinder Teachers, and Endanger Public Education",
        "Authors": "By Paige, Rod",
        "Description": "Something is terribly wrong with America's public school system.For decades, we have seen test scores slide or stagnate (today fewer than twenty percent of our nation's twelfth graders are proficient in math, and our students rank near the bottom in science and math among the industrialized nations of the world) and achievement gaps persist or widen.So who's responsible for the ongoing failure of our education system? In The War Against Hope, former Secretary of Education Rod Paige pulls no punches in his critical analysis of America's crisis in the classroom. Without question, the greatest impediment to meaningful school reform is the enormous, self-aggrandizing power wielded by the teachers' unions.In this vital, well-documented book, Paige takes an unflinching look at the power-hungry union leaders who have consistently placed their ambitions ahead of the needs of the teachers and the students whom they claim to serve. He also traces the history of the National Education Association (NEA) from its humble beginnings as an advocate of education excellence to its early radicalization by left-wing ideology.The War Against Hope is a disturbing account of the corruption, greed, and skewed values that have assaulted our schools, betrayed our teachers, and forsaken our children for far too long.",
        "Category": " Education , Educational Policy & Reform , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Listening Is an Act of Love: A Celebration of American Life from the StoryCorps Project",
        "Authors": "By Isay, Dave (EDT)",
        "Description": "From more than ten thousand interviews, StoryCorps-the largest oral history project in the nation's history-presents a tapestry of American stories, told by the people who lived them to the people they love.StoryCorps began with the idea that everyone has an important story to tell. And since 2003, this remarkable project has been collecting the stories of everyday Americans and preserving them for future generations. In New York City and in mobile recording booths traveling the country-from small towns to big cities, at Native American reservations and an Army post-StoryCorps is collecting the memories of Americans from all ages, backgrounds, and walks of life. The project represents a wondrous nationwide celebration of our shared humanity, capturing for posterity the stories that define us and bind us together.In Listening Is an Act of Love, StoryCorps founder and legendary radio producer Dave Isay selects some of the most remarkable stories from the already vast collection and arranges them thematically into a moving portrait of American life. The voices here connect us to real people and their lives-to their experiences of profound joy, sadness, courage and despair, to good times and hard times, to good deeds and misdeeds.To read this book is to be reminded of how rich and varied the American storybook truly is, how resistant to easy categorization or caricature. Above all, this book honors the gift each StoryCorps participant has made, from the raw material of his or her life, to the Americans who will come after. We are our history, individually and collectively, andListening Is an Act of Love touchingly reminds us of this powerful truth.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Penguin Press HC, The",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "WOLFSBANE",
        "Authors": "By Craig Thomas",
        "Description": "",
        "Category": "",
        "Publisher": "Sphere",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Frommer's New England (Frommer's Complete Guides)",
        "Authors": "By Karr, Paul, Reckford, Laura M., Livesey, Herbert B., and Morris, Marie",
        "Description": "You'll never fall into the tourist traps when you travel with Frommer's. It's like having a friend show you around, taking you to the places locals like best. Our expert authors have already gone everywhere you might go -- they've done the legwork for you, and they're not afraid to tell it like it is, saving you time and money. No other series offers candid reviews of so many hotels and restaurants in all price ranges. Every Frommer's Travel Guide is up-to-date, with exact prices for everything, dozens of color maps, and exciting coverage of sports, shopping, and nightlife. You'd be lost without us!Frommer's New England features gorgeous full-color photos of the historic sights, stunning landscapes, and seaside towns that await you. Meticulously researched by a team of expert residents who know this region intimately, this is an extraordinary and highly personal guide to one of America's most scenic regions.Frommer's New England is packed with candid opinions on the best country inns and restaurants, lobster pounds, antique shops, foliage tours, beaches, hiking, biking, and other outdoor adventures. We've covered all the perennial favorites, from the Freedom Trail to the Berkshires and beyond, but we'll also take you off the beaten track to discover New England's best small towns and most pristine wild places. Whether you want a romantic getaway in a Vermont country inn or family fun on the Cape's best beaches, Frommer's will help you design the trip that's right for you. You'll even find a color fold-out map!",
        "Category": " Travel , United States , Northeast , New England (CT, MA, ME, NH, RI, VT)",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Breakthrough: Politics and Race in the Age of Obama",
        "Authors": "By Ifill, Gwen",
        "Description": "In The Breakthrough, veteran journalist Gwen Ifill surveys the American political landscape, shedding new light on the impact of Barack Obama’s stunning presidential victory and introducing the emerging young African American politicians forging a bold new path to political power. Ifill argues that the Black political structure formed during the Civil Rights movement is giving way to a generation of men and women who are the direct beneficiaries of the struggles of the 1960s. She offers incisive, detailed profiles of such prominent leaders as Newark Mayor Cory Booker, Massachusetts Governor Deval Patrick, and U.S. Congressman Artur Davis of Alabama (all interviewed for this book), and also covers numerous up-and-coming figures from across the nation. Drawing on exclusive interviews with power brokers such as President Obama, former Secretary of State Colin Powell, Vernon Jordan, the Reverend Jesse Jackson, his son Congressman Jesse Jackson Jr., and many others, as well as her own razor-sharp observations and analysis of such issues as generational conflict, the race/ gender clash, and the \"black enough\" conundrum, Ifill shows why this is a pivotal moment in American history. The Breakthrough is a remarkable look at contemporary politics and an essential foundation for understanding the future of American democracy in the age of Obama.",
        "Category": " History , United States , 20th Century",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "633 Squadron",
        "Authors": "By Smith, Frederick E.",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "How to Settle an Estate: A Manual for Executors and Trustees",
        "Authors": "By Plotnick, Charles K. and Leimberg, Stephan R.",
        "Description": "Explains an executor's duties and discusses probate, life insurance, bank accounts, debts, and estate taxes",
        "Category": " Law , Estates & Trusts",
        "Publisher": "Consumer Reports Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Thunder Point (Sean Dillon)",
        "Authors": "By Higgins, Jack",
        "Description": "1945. The day before Hitler commits suicide, he arranges for Nazi leader Martin Bormann to flee to South America in a German U-boat.1992. Terrorist Sean Dillon is saved from a Yugoslavian firing squad—if he agrees to help the British government retrieve the long-lost documents of Martin Bormann. The wreck of Bormann's U-boat has been discovered in the Caribbean, along with a secret list of Nazi sympathizers. The names include high-level citizens from the U.S. and Great Britain—and may implicate the Duke of Windsor himself. The evidence lies in a watertight briefcase on the bottom of the sea. And the desperate search to find it will send shockwaves across the world ...",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Book Whisperer: Awakening the Inner Reader in Every Child",
        "Authors": "By Anderson, Jeff (FRW) and Miller, Donalyn",
        "Description": "Donalyn Miller says she has yet to meet a child she couldn't turn into a reader. No matter how far behind Miller's students might be when they reach her 6th grade classroom, they end up reading an average of 40 to 50 books a year. Miller's unconventional approach dispenses with drills and worksheets that make reading a chore. Instead, she helps students navigate the world of literature and gives them time to read books they pick out themselves. Her love of books and teaching is both infectious and inspiring. The book includes a dynamite list of recommended \"kid lit\" that helps parents and teachers find the books that students really like to read.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Raphael Before Rome, Studies in the History of Art Volume 17",
        "Authors": "By Beck, James [Editor]",
        "Description": "",
        "Category": "",
        "Publisher": "National Gallery of Art",
        "Price Starting With ($)": "17.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Utopia (Barnes & Noble Classics)",
        "Authors": "By Rebhorn, Wayne A., More, Thomas, Sir, Saint, and Robinson, Ralph",
        "Description": "&&LDIV&&R&&LDIV&&R&&LI&&RUtopia&&L/I&&R, by &&LB&&RSir Thomas More&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&ROne of the most influential books in the Western philosophical and literary tradition, &&LB&&RSir Thomas More&&L/B&&R’s &&LI&&RUtopia&&L/I&&R appeared in 1516. The formidable Henry VIII had recently assumed the throne in England, and conflicting ideas about religion were fueling the Reformation throughout Europe. A scathing satire, &&LI&&RUtopia&&L/I&&R was hugely successful and vaulted More to the forefront of the growing humanist movement. &&L/P&&R&&LP&&RThe story of &&LI&&RUtopia&&L/I&&R is told by a mysterious sailor named Raphael Hythloday, who travels to the New World with the Italian explorer Vespucci and remains at a fort built at the farthest point reached. From there, he discovers a strange island kingdom named Utopia, a pagan and communist city-state in which language, social customs, dress, architecture, and education are identical throughout the country’s fifty-four cities. The Utopians have eliminated wealth, the nobility, and currency. Labor and goods are distributed equally and property is held in common. And there are no monasteries, alehouses, or academies to tempt a person to withdraw from society. &&L/P&&R&&LP&&RGiven More’s satiric leanings and eventual execution, is &&LI&&RUtopia&&L/I&&R simply an attack on Europe’s wickedness? Or is it a philosophical tract extolling the ideal way to live? Ultimately,&&LI&&R Utopia&&L/I&&R navigates a course between the desire to create perfection and the pragmatic understanding that perfection, given the fallibility of mankind, is impossible.&&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LSTRONG&&RWayne A. Rebhorn&&L/B&&R&&L/B&&R is Celanese Centennial Professor of English at the University of Texas at Austin. He has written extensively on Renaissance literature in English, Italian, French, Spanish, and Latin, on authors from Boccaccio through More and Shakespeare down to Milton.&&L/P&&R&&L/DIV&&R",
        "Category": " Political Science , General",
        "Publisher": "Sterling Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Process of Change (The Guilford Family Therapy Series)",
        "Authors": "By Papp, Peggy",
        "Description": "A guide for students and practitioners interested inexploring paradoxical and strategic interventions from a systems perspective, this book provides first-hand documentation of Papp`srich repertoire of clinical interventions , the results she has achieved with them, and step-by-step process by which the implementations are implemented. Her work is vividly illustrated by candid and detailed case studies that reveal, not only how the technique is applied, but also how it was arrived at and why it is particularly suited to the situation at hand.",
        "Category": " Psychology , Psychotherapy , General",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1983"
        }
    },
    {
        "Title": "Contemporary Cases In U.S. Foreign Policy: From Terrorism To Trade",
        "Authors": "By Carter, Ralph G. (EDT)",
        "Description": "Finding that the foreign policy process in the United States of the post-Cold War period has become \"more open, pluralistic, and deeply partisan,\" Carter (political science, Texas Christian U.) has selected these 15 case studies of US foreign policy to illustrate to students both the range and diversity of issues facing policy makers and the variety of participants in the policy making process, with most cases featuring jurisdictional competition between the executive and legislative branches of government. He presents case studies of intervention policy related to Bosnia, Colombia, and Osama Bin Laden in Sudan and Afghanistan; national security and defense policy as it pertains to the Bush doctrine of \"preemption\" and the war in Iraq, North Korea's nuclear program, creation of the Department of Homeland Security, and the rejection of the Comprehensive Test Ban Treaty; trade policy in the cases of steel import tariffs, the Cuba embargo, and Sino-American relations; and struggles over multilateralism in relation to the Kyoto Protocol; the International Criminal Court; reform of the International Monetary Fund; and the rights of prisoners detained by the United States in its so-called \"war on terrorism.\" Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Cq Pr",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The Out-of-Sync Child has Fun: Activities for Kids with Sensory Integration Dysfunction",
        "Authors": "By Kranowitz, Carol Stock and Wylie, T. J. (ILT)",
        "Description": "This companion volume to The Out-of-Sync Child presents activities that parents of kids with Sensory Integration Dysfunction can do at home with their child to strengthen their child's abilities-and have some fun together along the way.",
        "Category": " Family & Relationships , Learning Disabilities",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Everything Etiquette Book (Everything Series)",
        "Authors": "By Segaloff, Nat",
        "Description": "Featuring thousands of quick tips and helpful suggestions on how to deal with a range of sticky situations, this easy-to-use social reference also includes etiquette hints on such modern issues as e-mail and dating in the 1990s. Original.",
        "Category": " Reference , Etiquette",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Cold Cuisine",
        "Authors": "By Hecht, Helen",
        "Description": "Presents thirty-nine menus and more than two hundred recipes for preparing chilled foods including soups, cold cut dishes, entree salads, entree mousses, and desserts which can be made in advance and are designed for summer entertaining",
        "Category": " Cooking , General",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "16.21",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "College Parodies",
        "Authors": "By Will Lieberson",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Love the One You're With: A Novel",
        "Authors": "By Giffin, Emily",
        "Description": "How do you know if you've found the one? Can you really love the one you're with when you can't forget the one who got away? Emily Giffin, author of the New York Times bestselling novels Something Borrowed, Something Blue, and Baby Proof, poses these questions—and many more—with her highly anticipated, thought-provoking new novel Love the One You're With. Ellen and Andy's first year of marriage doesn't just seem perfect, it is perfect. There is no question how deep their devotion is, and how naturally they bring out the best in each other. But one fateful afternoon, Ellen runs into Leo for the first time in eight years. Leo, the one who brought out the worst in her. Leo, the one who left her heartbroken with no explanation. Leo, the one she could never quite forget. When his reappearance ignites long-dormant emotions, Ellen begins to question whether the life she's living is the one she's meant to live. At once heartbreaking and funny, Love the One You're With is a tale of lost loves and found fortunes—and will resonate with anyone who has ever wondered what if.",
        "Category": " Fiction , Women",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Fondues from Around the World",
        "Authors": "By Klever, Eva and Klever, Ulrich",
        "Description": "Nearly 200 recipes for fish, cheese and meat fondues, oriental hot pots, tempura, sukiyaki, and dessert fondues. Advice on accompanying wines and bread recipes are also given.",
        "Category": " Cooking , Reference",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Winter in Madrid: A Novel",
        "Authors": "By Sansom, C. J.",
        "Description": "A #1 internationally bestselling novel set in post-Civil War Spain by the author of Dominion and the Matthew Shardlake Tudor Mystery seriesSeptember 1940: the Spanish Civil War is over, Madrid lies in ruin, while the Germans continue their march through Europe, and General Franco evades Hitler's request that he lead his broken country into yet another war. Into this uncertain world comes a reluctant spy for the British Secret Service, sent to gain the confidence of Sandy Forsyth, an old school friend turned shady Madrid businessman. Meanwhile, an ex-Red Cross nurse is engaged in a secret mission of her own. Through this dangerous game of intrigue, C. J. Sansom's riveting tale conjures a remarkable sense of history unfolding and the profound impact of impossible choices.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Far Western Frontier, 1830-1860 (New American Nation Series)",
        "Authors": "By Billington, Ray Allen",
        "Description": "",
        "Category": "",
        "Publisher": "Harper and Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1962"
        }
    },
    {
        "Title": "Counter-Insurgency Warfare Theory and Practice",
        "Authors": "By Galula, David",
        "Description": "",
        "Category": "",
        "Publisher": "Praeger",
        "Price Starting With ($)": "16.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Air Force One",
        "Authors": "By Collins, Max Allan",
        "Description": "The President's airplane is hijacked by terrorists who threaten to kill the hostages one by one--including the President's wife and daughter--until their demands are met",
        "Category": " Fiction , Media Tie-In",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "8.3",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Holcroft Covenant",
        "Authors": "By Ludlum, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "10.6",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Indoor Grilling: Great Tips and Recipes for Oven and Stovetop Grilling",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " Cooking , Health & Healing , Low Cholesterol",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Haley's Cleaning Hints",
        "Authors": "By Haley, Graham and Haley, Rosemary",
        "Description": "Offers tips for cleaning around the home using common household products with multiples uses.",
        "Category": " House & Home , Cleaning & Caretaking",
        "Publisher": "Three H Productions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Third Girl",
        "Authors": "By AGATHA CHRISTIE",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Phoenix and the Carpet",
        "Authors": "By Nesbit, Edith",
        "Description": "Robert, Anthea, Cyril, and Jane embark on a series of adventures in which anything is possible, after they discover a mysterious egg wrapped in a magic wish carpet",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Italy: True Tales of Life on the Road (Travelers' Tales)",
        "Authors": "By Calcagno, Anne (EDT)",
        "Description": "Collects stories of travels in Italy by such authors as Tim Parks, Frances Mayes, Matthew Spender, Stanley Crouch, and Mary Taylor Simeti",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Travelers' Tales Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Chicken Soup for the Grandma's Soul: Stories to Honor and Celebrate the Ageless Love of Grandmothers (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), and Thieman, Leann (COM)",
        "Description": "Whether you're a veteran grandma or a Nana-to-be, this collection of stories will warm your heart and make you laugh about the universal experiences of being a grandmother: the phone call that announces your baby will become a mom herself; the first time you hold the most beautiful grandson or granddaughter in the world; and the day you're on baby-sitting duty and realize that major issues are minor infractions best solved with love instead of lectures.This book celebrates the memories we make and the times we cherish with grandmothers: the women who can both spoil and be stern; who provide unconditional love and invaluable wisdom; who can share sage advice while sharing an ice cream. Chicken Soup for the Grandma's Soul is the perfect thank-you to grandmothers everywhere- those special women who enrich our lives with joy and love.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "HCI",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Ask Again Later: A Novel",
        "Authors": "By Davis, Jill A.",
        "Description": "Emily has a tendency to live with one foot out the door. When her mother dramatically announces, \"They've found a lump,\" Emily gladly leaves behind her career, her boyfriend, and those pesky, unans­werable questions about who she is and what she's doing with her life to be by her mother's side. But back in her childhood bedroom, Emily realizes that she hasn't run fast or far enough—especially when she opens the door, quite literally, to find her past staring her in the face.",
        "Category": " Fiction , Women",
        "Publisher": "Ecco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "All We Ever Wanted Was Everything: A Novel",
        "Authors": "By Brown, Janelle",
        "Description": "On the day Paul Miller’s pharmaceutical company goes public, he informs his wife, Janice, that their marriage is over and that the new fortune is his alone. Meanwhile, in Los Angeles, the Miller’s older daughter, Margaret, has been dumped by her hot actor boyfriend and is failing at her job, kind of spectacularly. Sliding toward bankruptcy, Margaret bails and heads for home, where her confused and lonesome teenage sister, Lizzie, is struggling with problems of her own: She’s become the school slut.From behind the walls of their Georgian colonial bunker, the Miller women wage battle with divorce lawyers, debt collectors, drug-dealing pool boys, evangelical neighbors, and country club ladies–and in the process all illusions and artifice fall away, forcing them to reckon with something far scarier and more consequential: their true selves.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Ambition (Private, Book 7)",
        "Authors": "By Brian, Kate",
        "Description": "ï»¿ The higher you climb, the farther you have to fall....   Reed Brennan knew being elected president of exclusive Billings Hall would change her life. What she didn't count on was being dumped by her boyfriend, Josh Hollis, or being held responsible for a fire that destroyed Easton Academy's oldest building.   And now the administration wants to shut Billings down. Forever.   As president, it's up to Reed to save Billings Hall. What better way to win over the headÂ­master than to host a glam fund-raising event in New York City? Everyone needs a date, and the newly single Reed is the most eligible girl on campus. All of Easton's hottest boys are angling to take her out, and for once, Reed's biggest problem is which one to choose.   Reed has never felt so popular or powerful -- until the police start asking questions about Cheyenne Martin's death. Excited party buzz quickly turns to whispered rumors and dark moods, and one thing becomes clear: There is someone who wants to see Billings, and Reed, go down. And they will do anything to make it happen.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Caring For Your Cherished Possessions",
        "Authors": "By Levenstein, Mary Kerney and Biddle, Cordelia Frances",
        "Description": "A practical guide to caring for cherished heirlooms, antiques, and other valuable possessions describes the best methods of cleaning, preserving, restoring, and protecting china, furniture, art, fabrics, and more. Original.",
        "Category": " House & Home , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "The Buffet Book",
        "Authors": "By McLean, Alex (PHT), Peck, Carole, Bryant, Hart, and Bryant, Carolyn Hart",
        "Description": "The Buffet Book is filled with reassuring, practical advice about every detail of buffet entertaining, and includes advance preparation tips throughout. Stunning photographs showcase inspired ideas for buffet table designs and locations: an all-through-the-house party in a charming farmhouse; a picnic buffet in a flower garden; a glittering champagne dinner in a formal dining room. Whatever the occasion or season, from a soup buffet for ten to a wedding luncheon for fifty, a buffet is the perfect choice for the way we live now.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Viking",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "The South (Williams-Sonoma New American Cooking)",
        "Authors": "By Williams, Chuck, Williams, Chuck (EDT), Overton, Ray, and Beisch, Leigh (PHT)",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The House on the Gulf",
        "Authors": "By Haddix, Margaret Peterson",
        "Description": "NOTHING IS AS IT SEEMS.   When Britt's older brother, Bran, lands a summer job house-sitting in Florida, it seems like a great opportunity. Britt's family has just recently moved to Florida, and could use the extra money while her mom finishes college. There's only one problem: Britt starts to suspect her family isn't supposed to be there.   Britt starts poking around, and makes a startling discovery -- the owners of the house aren't who Bran says they are. So whose house are they living in, and why has Bran brought them there?",
        "Category": " Juvenile Fiction , Family , Multigenerational",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Elizabeth Blackwell: Girl Doctor (Childhood of Famous Americans)",
        "Authors": "By Doremus, Robert (ILT) and Henry, Joanne Landers",
        "Description": "The life of the first woman doctor in the United States, who worked in England and America to open the field of medicine to women",
        "Category": " Juvenile Fiction , Health & Daily Living , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Breaking News",
        "Authors": "By MacNeil, Robert",
        "Description": "Famous for his nearly forty years in broadcasting, Robert MacNeil is one of the most respected television journalists in America. Now, in Breaking News, a blistering, behind-the-scenes novel about network news today, he writes with wit about the world he knows best - a world in which crazed competition drives serious journalists into the tabloid feeding frenzies Americans increasingly see on their screens.Anchorman Grant Munro is at the pinnacle of what should be a brilliant career. Covering every story from the Kennedy assassination to the Clinton sex scandals, Munro has won the admiration, respect, and trust of his viewers. About to turn sixty, Munro suddenly feels his career threatened - especially when Bill Donovan, a handsome reporter with little experience, vies for his anchor post. Resentfully dragged into a media circus where \"soft news\" and tabloid values are becoming staples of nightly news, Munro negotiates a minefield of scheming, greed, and betrayal to hold on to the job and values he prizes.",
        "Category": " Fiction , General",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Passenger to Frankfurt: An Extravaganza",
        "Authors": "By Christie, Agatha",
        "Description": "A tale of international intrigue unfolds from the brief encounter of two individuals at Frankfurt airport",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dodd, Mead",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "June",
            "Year": "1970"
        }
    },
    {
        "Title": "Sabotage After Divorce",
        "Authors": "By Dewayne, Cartlynne",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "McClain Printing Co",
        "Price Starting With ($)": "14.81",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Snake Tattoo",
        "Authors": "By Barnes, Linda",
        "Description": "Carlotta Carlyle, a private detective, is hired to find a missing teenager and tries to help a police lieutenant clear his name",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "WW III: World in Flames",
        "Authors": "By Slater, Ian",
        "Description": "NATO armored dividions have broken out from near-certain defeat in the Soviet-ringed Dortmund/Bielefeld Pocket on the North German Plain. Despite being faster than the American planes, Russian MiG-25s and Sukhoi-15s are unable to maintain air superiority over the western Aleutians...On every front, the war that once seemed impossible blazes its now inevitable path of worldwide destruction. There is no way to know how it will end....",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Dangerous Business: The Risks of Globalization for America",
        "Authors": "By Choate, Pat",
        "Description": "From one of the most respected and vigorous economic thinkers in Washington, a wake-up call about the perils of unfettered globalization. In this impassioned, prescient book, Pat Choate shows us that while increased worldwide economic integration has some benefits for our fiscal efficiency, it also creates dependencies, vulnerabilities, national security risks, and social costs that now outweigh its advantages. He takes the long view of developments such as technology-driven progress, the offshoring of jobs, and open trade, arguing that current U.S. policies are leading to worldwide economic and political instability, in much the same way as before the Great Depression.Choate writes convincingly about the Defense Department’s growing dependence on foreign sources for its technologies, the leasing of parts of our interstate highway system to overseas investors, China’s economic mercantilism, and international currency manipulation that damages the dollar. We have been borrowing heavily from foreign lenders, who by 2009 will own more than half of the Treasury debt, a third of U.S. corporate bonds, and a sixth of U.S. corporate assets—all of which, if handled improperly, could trigger a global economic collapse.But our economic forecast need not be dire. Choate sees a way out of these dilemmas and presents politically viable steps the United States can take to remain sovereign, prosperous, and secure. He presents bold new research that identifies the special interests and structural corruption that have overtaken our democracy—and shows how they can be corrected. He illustrates how our policy-making and legislative process, currently beholden to the highest bidder, can be transformed from one of corporatism and elitism into one of greater transparency. Clear-eyed and persuasive, this is sure to be one of the most widely discussed books of the year.",
        "Category": " Political Science , Public Policy , Economic Policy",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Healthy Firehouse Cookbook: Low-Fat Recipes from America's Fire Fighters",
        "Authors": "By Bonanno, Joseph T.",
        "Description": "A New York City firefighter and fitness trainer presents more than two hundred delicious recipes that emphasize healthy, wholesome, and low-fat cookery from firefighters across the country. 50,000 first printing. Tour.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.77",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The American Heritage Children's Thesaurus",
        "Authors": "By Hellweg, Paul",
        "Description": "How do you choose the best word for a sentence? The American Heritage(R) Children's Thesaurus has a wide range of entries and carefully selected synonyms which will add color and precision to writing at every level. With its innovative design, The American Heritage(R) Children's Thesaurus encourages students to distinguish among an array of synonyms by testing each word against an example sentence. Synonyms are grouped according to meaning and usage, helping students learn to think analytically and to be selective. This unique book will expand children's vocabularies while teaching them valuable new word skills. Features include more than 35,000 synonyms,  a clear sample sentence for every sense of every entry, lively full-color photographs throughout, and more than 100 antonyms and word-group features.",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Beating the Odds: Raising Academically Successful African American Males",
        "Authors": "By Hrabowski, Freeman A., Maton, Kenneth I., and Greif, Geoffrey L.",
        "Description": "Today, young Black men are more likely to be killed or sent to prison than to graduate from college. Yet, despite all the obstacles, some are achieving at the highest academic and professional levels.      Beating the Odds tells their remarkable stories and shows us what African American families have done to raise academically successful sons, sons who are among the top two percent of African American males in terms of SAT scores and grades. The result of extensive and innovative research, Beating the Odds goes beyond mere analysis--and beyond the relentlessly negative media images--to show us precisely how young Black men can succeed despite the roadblocks of racism, the temptations of crime and drugs, and a popular culture that values being \"cool\" over being educated. By interviewing parents and children from a range of economic and educational backgrounds and from both single and two-parent homes, the authors identify those constants that contribute to academic achievement and offer step-by-step guidance on six essential strategies for effective parenting: child-focused love; strong limit-setting and discipline; continually high expectations; open, consistent, and strong communication; positive racial identity and positive male identity; and full use of community resources. The proof of the effectiveness of such strategies is in the sons themselves, who speak eloquently in these pages about their struggles and successes in both the classroom and the often hostile world that surrounds it.    Essential reading for parents, teachers, and school administrators, Beating the Odds offers insight, guidance, and hope for anyone concerned about the plight of young African American men and the society they live in.",
        "Category": " Education , Multicultural Education",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "10.0",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Job-winning Answers to the Hardest Interview Questions",
        "Authors": "By Hawley, Casey",
        "Description": "",
        "Category": "",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Art of the State: Vermont",
        "Authors": "By Landau, Diana (EDT) and Mantell, Suzanne",
        "Description": "Describes natural and manmade wonders, historical sites, and culture of Vermont",
        "Category": " Art , American , General",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "A Dinner to Die For (Jill Smith Mystery)",
        "Authors": "By Dunlap, Susan",
        "Description": "When Mitch Biekma, the young owner of the hot new Berkeley restaurant Paradise, is found dead, poisoned by his own carrot soup, Detective Jill Smith probes the competition in the chic restaurant business",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dell Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Double Dutch (Aladdin Fiction)",
        "Authors": "By Draper, Sharon M.",
        "Description": "secrets  Delia loves Double Dutch more than just about anything, and she's really good at it -- so good she and her teammates have a shot at winning the World Double Dutch Championships. Delia would die if she couldn't jump -- but Delia has a secret, and it could keep her off the team next year.  Delia's friend Randy has a secret too, one that has him lonely and scared. And while Delia and Randy struggle to keep their secrets, their school is abuzz with rumors about what malicious mischief the terrible Tolliver twins -- who just may have a secret of their own -- are planning.  Delia and Randy's secrets collide on what should be the happiest day of Delia's life, and the collision threatens to destroy their friendship. Why can't life be as easy for Delia as Double Dutch?",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Gilda Joyce, Psychic Investigator",
        "Authors": "By Allison, Jennifer",
        "Description": "Ever since her father died, kooky Gilda Joyce has been working hard to sharpen her psychic skills. She's determined to communicate with spirits from the Other Side and become a crack investigator of spooky, twisted mysteries. After wrangling an invitation to visit San Francisco relatives, Gilda discovers just how much her dreary, tight-lipped uncle and his strange, delicate daughter need her help to uncover the terrible family secret that has a tortured ghost stalking their home.From poignant to hair-raising and hilarious, this is a behind-the-scenes, tell-all account of the very first case in the illustrious career of Gilda Joyce, Psychic Investigator.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Dutton Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Captivated & Entranced: An Anthology (The Donovan Legacy)",
        "Authors": "By Roberts, Nora",
        "Description": "His interest in her was purely professional&#133;or so he told himself.Nash Kirkland had sought out Morgana Donovan, self-proclaimed witch, to help him research his latest screenplay. The hardheaded skeptic didn't believe for a minute she was what she professed to be, but Nash somehow found himself falling under her bewitching spell. Nash had never trusted his feelings. How could he be sure the irresistible passion he felt was real and not just some conjurer's trick?Obviously Sebastian Donovan was a fraud, but fiercely protective Mary Ellen Sutherland was desperate to find a missing baby and had run out of leads. So, reluctantly, the skeptical private investigator agreed to enlist Sebastian's help. Soon she had to admit&#151;grudgingly&#151;that this man had some pretty remarkable gifts. Especially his extraordinary ability to penetrate her tough facade and awaken her heart.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Great American Learning Vacations: Hundreds of Workshops, Camps and Tours That Will Satisfy Your Curiosity and Enri ch Your Life",
        "Authors": "By Consolo, Paula (EDT)",
        "Description": "The most authoritative and comprehensive guide to vacations with a purpose in the United States, from restoring a 19th-century hand-hewn log house in Florida to painting desertscapes in Taos, New Mexico, and searching for humpback whales off the Alaska coast.   Archaeological digs, arts and crafts workshops, birding, campus vacations, cooking schools, cultural tours, environmental cruises, foreign-language immersion programs, garden tours, music programs, nature camps, New Age centers, painting workshops, photography workshops and tours, spas and fitness centers, volunteer vacations (research and public and community service), whale-watching cruises, writing conferences and workshops.  Profiles of major organizations offering trips in each field.  In-depth reviews of hundreds of perennially popular workshops, camps, programs, and tours.What makes one program better than others and how to choose one that's right for you.  Details on what you'll eat--from homemade banana-bread French toast in a Colonial inn to fish grilled over an open fire.  Specifics on where you'll sleep--luxury hotels, antiques-filled town houses, single-sex bunk rooms, college dorms, even yurts and tepees.   How much it costs and what you get for your money.  Where to turn for more information--umbrella organizations, magazines, newsletters, and books.",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "It's Hard to Be Hip over Thirty",
        "Authors": "By Viorst, Judith",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Judith Krantz: Three Complete Novels",
        "Authors": "By Krantz, Judith",
        "Description": "Three novels, Mistral's Daughter, Princess Daisy, and I'll Take Manhattan, by the best-selling author are gathered in one volume.",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Black Marble",
        "Authors": "By Wambaugh, Joseph",
        "Description": "Southern California and the world of dog shows provide the backgrounds for an unprecedented dognapping-extortion scheme and an unusual love affair, involving a Vodka-swilling detective sergeant, a gung-ho female detective, a Junior League veteran, and a master dog groomer",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dell Publishing",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1980"
        }
    },
    {
        "Title": "Curriculum Adaptations for Students With Learning and Behavior Problems: Principles and Practices",
        "Authors": "By Patton, James R. and Hoover, John J.",
        "Description": "Shows how to meet the needs of students with less severe learning and behavior problems through curriculum adaptations and modifications, for use in elementary and secondary special and inclusive education classrooms. Contains chapters on fundamentals of curricula and curriculum adaptation, identifying curriculum adaptation needs, implementing adaptations, collaboration and curriculum adaptation, and related issues such as placement and family concerns.  Includes discussion questions, sample forms, and instructions for specific curriculum adaptations. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Education , Special Education , Learning Disabilities",
        "Publisher": "Pro-Ed",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    }
]