[
    {
        "Title": "Can't Live with 'Em, Can't Live Without 'em: Dealing with the Love/Hate Relationships in Your Life",
        "Authors": "By Stoop, David A. and Arterburn, Stephen F.",
        "Description": "Living in a love-hate relationship-with your spouse, kids, parents, friends, co-workers, and even God-can leave you feeling confused and furious. But the practical strategies presented in this book will help you overcome your most agonizing relational predicaments. Drawing on a wealth of experience as therapists and as best-selling authors, David Stoop and Stephen Arterburn provide you with:Insightful analysis of the \"problem behind the problem behind the problem\" in love-hate relationshipsHands-on questionnaires and exercises to help you sort out your mixed-up feelingsReal-life case studies that show how you can protect yourself from abuse without cutting yourself off from people you care aboutProfessional advice to help you work through your bitterness and disappointment and manage the healing act of forgiveness",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Thomas Nelson Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Complete Conditioning for Golf (Complete Conditioning for Sport)",
        "Authors": "By Westcott, Wayne L. and Draovitch, Pete",
        "Description": "",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Jew in the medieval world;: A source book: 315-1791",
        "Authors": "By Marcus, Jacob Rader",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "7.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Making Your Children's Ministry the Best Hour of Every Kid's Week",
        "Authors": "By Miller, Sue, Staal, David, Hybels, Bill (FRW), and Barna, George (FRW)",
        "Description": "Promiseland is Willow Creek’s highly successful children’s ministry. Using examples from Promiseland and churches of all sizes around the country, this book provides step by step guidance and creative application exercises to help churches develop a thriving children’s ministry—one that strives to be the best hour of every kid’s week. Included are Scripture-based principles and practical resources for church staff members and volunteers who agree with the critical role children’s ministry plays in a local church. Making Your Children’s Ministry the Best Hour of Every Kid’s Week, based on twenty-eight years of experience at Willow Creek, explains four ministry foundations: Mission, Vision, Values, and Strategy. Content includes: Detailed answers to questions facing every children’s ministry: • What does Jesus expect from children’s ministry? • How can we evangelize lost kids and disciple saved kids at the same time, and should we? • How do we engage kids so they don’t become bored? • How do we get better at recruiting and leading volunteers? • How can our ministry be a safe place for children? • Six specific ministry values that address the needs of today’s children • Practical first steps for ministries that want to get serious about change • Clear indicators of success in children’s ministry",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Portrait of Oregon (Portrait of America (Graphic Arts Center Pub Co))",
        "Authors": "By Schafer, Rick and Keith, Sandra",
        "Description": "Images of Oregon's magnificent and increasingly popular coastline, its dramatic mountains and lush valleys, its high desert country and its urban communities will enthrall and surprise even the most seasoned Oregonian.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Graphic Arts Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Pictures of the Times: A Century of Photography from The New York Times",
        "Authors": "By Galassi, Peter (EDT), Kismaric, Susan (EDT), and Safire, William (EDT)",
        "Description": "Gathers over 150 historic photographs from the twentieth century",
        "Category": "",
        "Publisher": "The Museum of Modern Art, New York",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Miller's Antiques Checklist: Porcelain",
        "Authors": "By Miller, Judith and Miller, Martin",
        "Description": "",
        "Category": "",
        "Publisher": "Avery",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "How to Analyze Fiction",
        "Authors": "By William Kenney",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Soccer Techniques, Tactics & Teamwork",
        "Authors": "By Bauer, Gerhard",
        "Description": "Discusses the structure and rules of the game of soccer, the different phases of the training process, game tactics, and preparing for competition",
        "Category": " Juvenile Nonfiction , Sports & Recreation , Soccer",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Lady Who Liked Clean Restrooms: The Chronicle Of One Of The Strangest Stories Ever To Be Rumoured About Around New York",
        "Authors": "By Donleavy, J. P",
        "Description": "Not since The Ginger Man has J.P. Donleavy succeeded in both delighting and irking his readers as he has with The Lady Who Like Clean Restrooms. This stylish novella tells the tale of Jocelyn Guenevere Marchantiere Jones, whose Scarsdale life comes to an abrupt end when her husband goes in search of a bit of \"fresh flesh.\" Soon she is fending for herself in New York City, where finding a clean restroom will prove to be the least of her concerns.",
        "Category": " Fiction , Women",
        "Publisher": "Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "American Railway: Its Construction, Development, Management, and Appliances",
        "Authors": "By Clarke, Thomas (CON)",
        "Description": "Contains the recollections of many of the major figures responsible for the development of the rail system, along with the original illustrations from their reports",
        "Category": " Transportation , General",
        "Publisher": "Castle",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Better Than Life",
        "Authors": "By Pennac, Daniel and Homel, David (TRN)",
        "Description": "This magical volume begins by recalling the tender triangular relationship of a parent, a storybook and a child who loves to be read to.Years later, the enchanted child has become a reluctant teenaged reader. How, Pennac asks, does the love of reading begin? How is it lost? And how can it be regained - by everyone from children to adults?Delving into his experiences as a parent, a writer and a teacher, Pennac uncovers new ways to restore the enchantment of reading and draws up a liberating Readers Bill of Rights, including the right to skip pages, the right to read anything, the right to not defend your tastes, and the right to escapism.",
        "Category": " Literary Criticism , General",
        "Publisher": "Coach House Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The New Quilt 1 : Dairy Barn Quilt National (New Quilt One) (v. 1)",
        "Authors": "By Dairy Barn Quilt National, Dairy Barn Quilt National",
        "Description": "This is the catalog of quilt National '91. It containes color photos and artist's statements for each piece in the exhibit,",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Good Kids, Bad Habits: The RealAge Guide to Raising Healthy Children",
        "Authors": "By Trachtenberg, Jennifer, M.D.",
        "Description": "When kids start going on TV binges or devouring fistfuls of cookies, it's easy to say, \"They'll grow out of it.\" More likely, they're acquiring bad habits that could lead to childhood obesity and chronic adult diseases, from diabetes and depression to heart trouble and osteoporosis. But by making simple changes now, you can help your children avoid these problems later. Good Kids, Bad Habits supplies the tools you need, starting with the unique RealAge® Healthy Kids Test. Based on the proven RealAge Test, which measures biological—not calendar—age, the Healthy Kids Test reveals where children are doing fine and where they're headed for health trouble. Regardless of the problem—from sleeplessness to video-game addiction—Dr. Jen has seen and solved it all, working with parents and kids together. Her insightful tips, preventive steps, and kid smarts, learned from working with thousands of children, make this book invaluable. It will help your kids grow into the healthiest adults they can be—while still allowing them to be kids.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "A Year In The World - Journeys Of A Passionate Traveller Later Printing edition by Mayes, Frances (2006) Paperback",
        "Authors": "By Mayes, Frances",
        "Description": "",
        "Category": "",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Bartending For Dummies (For Dummies (Lifestyles Paperback))",
        "Authors": "By Foley, Ray",
        "Description": "When you are serving drinks at a bar, you should have at least basic knowledge of about 200 of the most popular cocktails in your head. A cocktail is, according to Webster's New World Dictionary, “any of various alcoholic drinks made of a distilled liquor mixed as with wine, fruit juice, or soda water and usually iced.” There are thousands of different drink mixes with thousands of different names that people desire.Whether you are planning a small cocktail party at your home, planning to start a new career, or just want to know how to make a given drink, Bartending For Dummies offers a wonderful place to start. This clearly written, easy-to-understand guide can help anyone toCreate more than 1,000 different drinksSet up and stock your home barShake, stir, strain, and serve like a proMake over 100 great shootersBuy enough supplies for partiesThis book takes the mystery out of mixology. Can you put together a perfect martini? Or create the consummate cosmopolitan? From classic drinks to today's coolest cocktails, this comprehensive A-to-Z guide shows you how to mix up whatever libations you or your guests might desire.Bartending For Dummies also covers the following topics and more:The tools required to make any drinkInformation on every type of alcohol including where they come from, how they’re made, and how to store and serve themAlphabetical listing of almost a thousand cocktail recipesHow to make pousse-cafés (layered drinks), punches, and non-alcoholic drinksThere are thousands of bars around the world stocked with everything from beer to vodka. Bartending For Dummies is the ingredient that no bar should be without. This book can help you to be that impressive bartender by showing you everything you need to know about tending a bar.",
        "Category": " Cooking , Beverages , Bartending",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Little Book of Scottish Verse",
        "Authors": "By National Gallery of Scotland (ILT)",
        "Description": "",
        "Category": "",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "The Gym Workout (Fitness, Health and Nutrition)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " Health & Fitness , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "The Help",
        "Authors": "By Stockett, Kathryn",
        "Description": "The #1 New York Times bestselling novel and basis for the Academy Award-winning film—a timeless and universal story about the lines we abide by, and the ones we don’t—nominated as one of America’s best-loved novels by PBS’s The Great American Read.Aibileen is a black maid in 1962 Jackson, Mississippi, who’s always taken orders quietly, but lately she’s unable to hold her bitterness back. Her friend Minny has never held her tongue but now must somehow keep secrets about her employer that leave her speechless. White socialite Skeeter just graduated college. She’s full of ambition, but without a husband, she’s considered a failure.Together, these seemingly different women join together to write a tell-all book about work as a black maid in the South, that could forever alter their destinies and the life of a small town...",
        "Category": " Fiction , Women",
        "Publisher": "G.P Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Mind Children",
        "Authors": "By Sherry Small Sundick",
        "Description": "",
        "Category": "",
        "Publisher": "Sherry Small Sundick",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Secret Speech",
        "Authors": "By Smith, Tom Rob",
        "Description": "Tom Rob Smith-the author whose debut, Child 44, has been called \"brilliant\" (Chicago Tribune), \"remarkable\" (Newsweek) and \"sensational\" (Entertainment Weekly)-returns with an intense, suspenseful new novel: a story where the sins of the past threaten to destroy the present, where families must overcome unimaginable obstacles to save their loved ones, and where hope for a better tomorrow is found in the most unlikely of circumstances . . . THE SECRET SPEECHSoviet Union, 1956. Stalin is dead, and a violent regime is beginning to fracture-leaving behind a society where the police are the criminals, and the criminals are innocent. A secret speech composed by Stalin's successor Khrushchev is distributed to the entire nation. Its message: Stalin was a tyrant. Its promise: The Soviet Union will change.  Facing his own personal turmoil, former state security officer Leo Demidov is also struggling to change. The two young girls he and his wife Raisa adopted have yet to forgive him for his part in the death of their parents. They are not alone. Now that the truth is out, Leo, Raisa, and their family are in grave danger from someone consumed by the dark legacy of Leo's past career. Someone transformed beyond recognition into the perfect model of vengeance.From the streets of Moscow in the throes of political upheaval, to the Siberian gulags, and to the center of the Hungarian uprising in Budapest, THE SECRET SPEECH is a breathtaking, epic novel that confirms Tom Rob Smith as one of the most exciting new authors writing today.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "The Chesapeake Bay Book, Fifth Edition (A Great Destinations Guide)",
        "Authors": "By Blake, Allison",
        "Description": "Follow Blake along the eastern and western shores of the bay - canoeing through tidal marshes, exploring colonial U.S. history, enjoying the best crab in the world, wandering through historic Annapolis - and you won't miss a beat!",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Countryman Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Animal Go-round",
        "Authors": "By Ling, Mary and Morris, Johnny",
        "Description": "Find out how animal's grow in this original revolving picture book. Do you know how to make an animal grow? You'll soon find out in this original revolving picture book. Young children will have hours of fun as they watch their favorite baby animals grow before their eyes.",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "DK Preschool",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Everybody's Guide to Book Collecting",
        "Authors": "By Lovett, Charlie",
        "Description": "",
        "Category": "",
        "Publisher": "Write Brain Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Indians of the American Southwest",
        "Authors": "By Walker, Steven L.",
        "Description": "",
        "Category": " History , Americas (North, Central, South, West Indies)",
        "Publisher": "Camelback Design Group Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Catholicism",
        "Authors": "By McBrien, Richard P.",
        "Description": "Examines the character of the contemporary Catholic Church, the roots of the present crisis in Catholicism, and the Catholic doctrines concerning human existence, Jesus Christ, Christian existence, and the nature and mission of the Church",
        "Category": "",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "7.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "O Holy Night",
        "Authors": "By Hogan, Julie K. (EDT)",
        "Description": "",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Ideals Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Nobody's Perfect",
        "Authors": "By Matlin, Marlee and Cooney, Doug",
        "Description": "\"She's practically perfect,\" Megan said thoughtfully. She repeated the new girl's name, practicing the way Ms. Endee had written it on the whiteboard. \"Alexis Powell.\"   Megan has spent forever planning her positively purple birthday sleepover. She's even made glittery purple invitations for every girl in her class. Then a new girl, Alexis, joins their class. Alexis seems perfect: She's smart, pretty, and rules the soccer games on the playground. But no matter how hard Megan tries to be a friend to Alexis, the new girl is aloof or rude. At first, Megan thinks Alexis is shy. Then Megan starts to fear that Alexis is treating her differently because she's deaf. When the girls are forced to collaborate on a science fair project, Megan learns the truth -- and realizes that nobody's perfect.   Once again Marlee Matlin draws on experiences from her own childhood to tell Megan's story. In this funny, poignant book, readers will root for Megan, a spirited young girl who doesn't let anything stand in her way.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Swedish Silver. (Collectors’ Library.)",
        "Authors": "By Erik Andren",
        "Description": "",
        "Category": "",
        "Publisher": "Collectors' Library / Gramercy, 1950",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "Christmas With Mary Engelbreit: Here Comes Santa Claus",
        "Authors": "By Engelbreit,Mary",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The cake cook book",
        "Authors": "By Rushing, Lilith",
        "Description": "",
        "Category": "",
        "Publisher": "Chilton Books",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Why I Am Still a Catholic",
        "Authors": "By Ryan, Kevin (EDT) and Ryan, Marilyn (EDT)",
        "Description": "What draws—and binds—thoughtful, educated people to a Church so often criticized by outsiders (and even members) as \"authoritarian\" or \"out of step with the times?\" This collection of personal accounts answers that question in diverse, fascinating, and deeply moving ways. Novelist William Kienzle discusses his years in the seminary, explaining why he eventually left the priesthood—but not the Church.  Kathleen Howley reveals how God replaced alcohol in her life, and why the traditional Latin Mass holds so much more appeal than the folk Masses of her youth. Former baseball commissioner Bowie Kuhn compares his feelings for the Church with his lifelong belief in \"team loyalty.\" Jon Hassler vividly recalls two very different childhood friends—and the attractions of both evil and goodness. These writers, and numerous others, offer a remarkable portrait of today's Catholic Church, creating a new understanding of how its presence has endured for nearly two thousand years, and why it continues to thrive.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Fun with Mommy and Me: More Than 300 Together-Time Activities for You and Your Child, Birth to Age Five",
        "Authors": "By Nurik, Cindy Bunin and Schonberger, Jane",
        "Description": "Offers over three hundred activities--including games, recipes, and craft projects--organized by developmental stage for infants, and by calendar month for toddlers, and designed to help mothers educate and bond with their children.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Incredible Journey to the Planets",
        "Authors": "By Nicholas Harris",
        "Description": "",
        "Category": "",
        "Publisher": "Orpheus",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Detours, Tow Trucks, and Angels in Disguise: Finding Humor and Hope in Unexpected Places (Life and Ministry of Jesus Christ)",
        "Authors": "By Kent, Carol",
        "Description": "Laughter and tears. Somehow they go hand in hand. Just when you’re in the midst of sobbing, laughter erupts. It’s in these moments of laughter and tears that we often find unexpected truth. In this heart-warming collection of true-to-life vignettes, best-selling author Carol Kent combines inspirational stories, hilarity, and sorrow to illustrate the joys and trials of life.Sometimes God is where you least expect Him to be: “Sometimes months or even years after experiencing a life event, I figure out the why,” she writes in Detours, Tow Trucks, and Angels in Disguise. “As I view the situation in the light of God’s Word and ask Him to reveal what He wants to teach me—only then do I discover the truth He wanted me to learn.”You’ll laugh and cry as you listen to God’s voice in the funny, poignant, and inspirational stories and situations that make life so worth living. And you’ll find yourself reflecting on the stories of your own life, seeing God’s grace at work in you.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Among the Barons (4) (Shadow Children)",
        "Authors": "By Haddix, Margaret Peterson",
        "Description": "Luke Garner, an illegal third child, spent his first twelve years in hiding. For the past four months Luke has lived among others, using the identity of Lee Grant, at the Hendricks School for Boys. But just as things are finally starting to go right, Lee's little brother Smits arrives at the school and Luke finds himself caught in a tangle of lies that gets more complex with every passing day.  Can Luke trust Smits to keep his secret? And can he trust Smits's menacing bodyguard, Oscar?",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "America Is...",
        "Authors": "By Borden, Louise and Schuett, Stacey (ILT)",
        "Description": "In words and pictures, this is a salute to our great country, the land of freedom for us and for people all over the world.  In her poetic text, Louise Borden evokes with bold strokes many aspects of our nation -- its farmlands, its prairies, its cattle country, its cities, its rivers, and the many kinds of people who live and work here. Mountains and deserts, waterfalls and beaches -- each of our states has special things to see and enjoy. And all over this country, our flag flies, with fifty stars for our current fifty states and thirteen broad stripes for our original thirteen colonies.  A few years ago, Louise Borden spoke to a group of schoolchildren in a library in Birmingham, England. When she finished, the very first question was, \"What's it like to live in America?\" This book is her answer. Readers of all ages will join in this salute to the place we call home, celebrated here in a simple, inspiring text and in lovely, atmospheric, full-color pictures.",
        "Category": " Juvenile Nonfiction , History , United States , General",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Fourth Angel",
        "Authors": "By Chazin, Suzanne",
        "Description": "Georgia Skeehan is a rookie fire marshal with the New York City Fire Department, and, coming from a family of firefighters, she has it in her blood. She is a proud woman - and not a little ambitious. But she is also a caring mother and daughter who finds herself in the middle of a love affair and an investigation that will test her faith at every level.The novel opens with an inferno of unprecedented violence and baffling origin that devours a small Manhattan building and the fifty people unfortunate enough to be inside. Georgia suspects the fire may have been started by something the city has never seen before: a kitchen-sink concoction with the thermal power of rocket fuel. Though rare over the last decade, these fires are so ferocious they can melt a building's steel framework in minutes.Georgia is determined to uncover the truth, but as a rookie and a woman, she is repeatedly sidelined by powerful insiders who both fear and ridicule her efforts. She soon unearths more startling information connecting the blaze to three others that have gone unsolved - and to several eerie letters from someone calling himself \"The Fourth Angel.\" But before she can begin to sort through the evidence, she is torn apart by the bizarre behavior of her partner and by the seeming betrayal of another marshal, a man she has begun to trust with her heart. As Georgia gropes for answers, personally and professionally, the Fourth Angel tightens his grip on his real quarry, and plots an even more catastrophic and fiery finale.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P Putnam's Sons",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Facts At Your Fingertips",
        "Authors": "By Reader's Digest Association",
        "Description": "A comprehensive resource filled with nearly half a million intriguing bits of knowledge and trivia encompasses facts about The Universe and Our Planet, Life on Earth, The Human Body, The History of Mankind, Peoples and Nations, Culture and Entertainment, The Global Economy, Science and Invention, and Ready Reference, all highlighted by hundreds of illustrations, charts, maps, and diagrams.",
        "Category": " Reference , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "6.84",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "America, this beautiful land",
        "Authors": "By Aylesworth, Thomas G.",
        "Description": "",
        "Category": "",
        "Publisher": "Longmeadow Press",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Daily Telegraph' Illustrated History of the Second World War",
        "Authors": "By Ray, John",
        "Description": "This is a modern account of the 1939-45 conflict, illustrated with state-of-the-art graphics and hundreds of photographs. From the controversial origins of the Second World War to the course of each campaign, Dr. John Ray's narrative incorporates all the revelations of recent years. Ever since the secret of 'Enigma' was revealed, the history of many battles and campaigns has had to be rewritten. The opening of Russian archives has led to major changes in our understanding of the greatest land battles in history.Concise, fast-moving and utterly compelling, this new account of the Second World War is both comprehensive and easy to follow. Dr. John Ray investigates the social, political and military background to the war and the strengths and weaknesses of the Axis and Allied armed forces. He traces the course of the conflict across all campaigns from Poland in 1939 to Manchuria in 1945. He examines the role of key military and political leaders and never loses sight of the sometimes enormous gulf between how battles were planned and what actually happened on the ground.",
        "Category": " History , Military , World War II",
        "Publisher": "Weidenfeld & Nicolson",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Twins' Little Sister (Sweet Valley Twins)",
        "Authors": "By Pascal, Francine",
        "Description": "Anxious to prove they are mature enough to help out with a much-hoped-for little brother or sister, the twins offer to babysit their neighbor's five-year-old daughter",
        "Category": "",
        "Publisher": "Sweet Valley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Pee Wees on Parade (Pee Wee Scouts)",
        "Authors": "By Delton, Judy",
        "Description": "With the upcoming Fourth of July parade just around the corner, Molly is frightened about riding a horse along with the other Pee Wees. Original.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Jubilee: Readings Through the Year from Alive Now",
        "Authors": "By Graham, George R. (EDT)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Upper Room",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Quilts Quilts and More Quilts! (From the Authors of the Best Seller Quilts! Quilts!! Quilts!)",
        "Authors": "By McClun, Diana and Nownes, Laura",
        "Description": "Offers patterns and instructions for making a variety of quilts, demonstrates useful techniques, and discusses borders, quilting, and binding",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "C&T Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Teaching True Love to a Sex-at-13 Generation",
        "Authors": "By Ludy, Eric and Ludy, Leslie",
        "Description": "No parent wants to admit that their child-even their well-educated, well-grounded, Christian child-could be having consensual sex before graduating middle school. Promise rings, parental contracts and disease warnings provide but meager defense against a culture overrun with weapons of mass seduction. While many factors contributing to the misguided messages received by children stand outside the realm of parental control-music videos, film, fashion-others, like the meaning of true love, can, and should be fostered at home. Eric and Leslie Ludy, authors of the bestselling When God Writes Your Love Story, present the shocking, unvarnished realities of today's sexual climate but they balance the bitter pill with a large dose of hopeful, practical advice for parents.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2012"
        }
    },
    {
        "Title": "The Official Guide for GMAT Review",
        "Authors": "By",
        "Description": "",
        "Category": " Study Aids , GMAT (Graduate Management Admission Test)",
        "Publisher": "Graduate Management Admission Council",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Bread for the Journey: A Daybook of Wisdom and Faith",
        "Authors": "By Nouwen, Henri J. M.",
        "Description": "When beloved author Henri Nouwen set out to record this daybook of totally new reflections, he suddenly found himself on \"a true spiritual adventure.\" For in these 366 original, interlocking morsels of daily wisdom, Nouwen provides both sustenance and a trail for us to follow, as he unveils, to his own surprise, his personal map of faith. From the delicate interplay of human experience to the surrender to Christ and the embrace of Christian community, that journey of Christian spirituality is explored and celebrated here in each eloquent, thought–provoking passage, \"The table is one of the most intimate places in our lives. It is there that we give ourselves to one another. When we say, 'Take some more, let me serve you another plate, let me pour you another glass, don't be shy, enjoy it,' we say a lot more than our words express. We invite our friends to become part of our lives. We want them to be nurtured by the same food and drink that nurture us. We desire communion.... Every breakfast, lunch, or dinner can become a time of growing communion with one another.\" Intimately personal and inspiring, Bread for the Journey is a daily feast of fresh insight into the challenges and deep joys of a life lived in close communion with God. Nouwen is a wise, loving companion who invites us along as he finds joy in the community of loss, true freedom in forgiveness of others, and hope in surprising places. Each daily meditation is a stepping–stone along a path of private discovery, offering Nouwen's seasoned yet fresh ideas on kindness, love, suffering, and prayer, the Church as God's people, and the importance of Jesus in one's life–reflecting, as a whole, Nouwen's own 'personal creed.' Bread for the Journey brims with daily nourishment and guidance for devoted followers and new friends alike –– food for thought on a yearlong journey of discovery and faith.",
        "Category": " Religion , Inspirational",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Steadfast Tin Soldier",
        "Authors": "By Andersen, Hans Christian, Mitchell, Adrian, and Heale, Jonathan (ILT)",
        "Description": "Written in the original's poetic style, this charming story tells the story of a one-legged tin soldier who falls in love with a paper-doll ballerina, and through a series of trials and tribulations, their love prevails.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Anthologies",
        "Publisher": "DK Preschool",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Violence Proof Your Kids Now: How to Recognize the 8 Warning Signs and What to Do About Them, For Parents, Teachers, and other Concerned Caregivers",
        "Authors": "By Karres, Erika V. Shearin and Loomans, Diane (FRW)",
        "Description": "With images from the Columbine tragedy etched in our minds, America is facing a crisis of epidemic proportion. Disaffected youth are rapidly becoming the norm, while grades and self-esteem plummet and violence in our schools escalates. We all want to keep our kids safe, but what can we do? We can't lock them in the house forever.In Violence Proof Your Kids Now, an award-winning, nationally recognized school violence expert shows every parent and teacher how to identify and deal with the current youth crisis. Erika V. Shearin Karres, a survivor of the twentieth century's single most violent episode, the Holocaust, consciously chose to become an \"antiviolence expert.\" She has distilled her thirty-plus years of research into eight tell-tale signs of a violent child and offers seventy-seven successful strategies to keep our kids safe.",
        "Category": " Family & Relationships , Life Stages , School Age",
        "Publisher": "Red Wheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "In Her Place: inner views and outer places",
        "Authors": "By Fleming, Peggy",
        "Description": "",
        "Category": "",
        "Publisher": "three sisters press",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Spotlight of Faith: Understanding What It Means To Walk With God",
        "Authors": "By Crowder Bill",
        "Description": "Offers guidance from biblical characters about relationships and character, defeat and failure, insight on obedience and rebellion, and sacrifice and selfishness.",
        "Category": " Religion , Ethics",
        "Publisher": "Our Daily Bread Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "I Saw the Lord: A Wake-Up Call for Your Heart",
        "Authors": "By Lotz, Anne Graham",
        "Description": "When we call ourselves Christians, we expect that our love for Jesus, our hunger for His presence, our urgent longing to see Him again will be a constant, motivating force in our lives, writes Anne Graham Lotz. Yet sometimes …in the busyness of our days or the duties of our jobs or the familiar habits of our worship or the everyday routine of our homes, the longing becomes complacency, and we sleep through opportunities to be with Him.Anne knows from personal experience that it’s then, as we’re drifting in comfortable complacency, that we most need a wake-up call—a jolt that pushes us to seek out a revival of our passion for Jesus that began as a blazing fire but somehow has died down to an ineffective glow.The revival we need now is not a tent meeting or a series of church services designed to save the lost. It’s something completely different: authentic, personal revival.In I Saw the Lord, Anne shares the revival lessons she has carried to audiences throughout the world, showing you how you can experience an authentic, deeper, richer relationship with God in a life-changing, fire-blazing revival.It begins here. Now. Open this book and hear the wake-up call. Then get ready for the fire of revival to fall … on you!",
        "Category": " Religion , Biblical Commentary , Old Testament",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Ultimate Stock Car",
        "Authors": "By Center, Bill",
        "Description": "A richly illustrated introduction to the history of stock car racing goes behind the scenes of a big race and into the factory to describe how these racing machines are built and fine-tuned to meet the challenges and speeds required of each racer on every track.",
        "Category": " Transportation , Automotive , General",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Earth From Above for Young Readers",
        "Authors": "By Arthus-Bertrand, Yann, Burleigh, Robert, and Giraudon, David (ILT)",
        "Description": "Presents aerial photographs of various scenes from around the world including fishermen in Morrocco, a farm on the island of Crete, and a mangrove forest in New Caledonia.",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "6.19",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "The Experts Book of Sewing Tips and Techniques: From the Sewing Stars-Hundreds of Ways to Sew Better, Faster, Easier (Rodale Sewing Book)",
        "Authors": "By Klaman, Stacey L., Amig, Marya Kissinger (EDT), Kunkel, Karen, Weaver, Susan (EDT), and Fimbel, Barbara",
        "Description": "Presents time-saving techniques, suggestions for selecting materials, and tips for creating clothing and home decorations that look professionally made",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Dilbert and the Way of the Weasel: A Guide to Outwitting Your Boss, Your Coworkers, and the Other Pants-Wearing Ferrets in Your Life",
        "Authors": "By Adams, Scott",
        "Description": "Back after a four–year hiatus, New York Times bestselling author Scott Adams presents an outrageous look at work, home and everyday life in his new book, Dilbert and the Way of the Weasel.  Building on Dilbert's theory that 'All people are idiots', Adams now says, 'All people are idiots. And they are also weasels.' Just ask anyone who worked at Enron. In this book, Adams takes a look into the Weasel Zone, the giant grey area between good moral behaviour and outright felonious activities. In the Weasel Zone, where most people reside, everything is misleading, but not exactly a lie. Building on his popular comic strip, Adams looks into work, home and everyday life and exposes the way of the weasel for everyone to see. With appearances from all the regular comic strip characters, Adams and Dilbert are at the top of their game – master satirists who expose the truth while making us laugh our heads off.",
        "Category": " Business & Economics , Management",
        "Publisher": "Business",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Crock-Pot Slow Cooker Favorite Recipes",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "New Quick & Easy Diabetic Desserts",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Splenda Cookbook",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Scarlett",
        "Authors": "By Cassidy, Cathy",
        "Description": "Scarlett's in trouble at school. Again. With black fingernails and dyed ketchup-red hair, she's not your average twelve-year-old Londoner. So her mum—sick of trying to get her into another school—ships Scarlett to her father's cottage in Ireland. Having to learn Gaelic in a one-room schoolhouse and enduring a new stepmum and younger stepsister is just too much. Scarlett wants to leave—until she meets Kian. He seems too good to be true with his dark, rugged looks, kind nature, and horse named Midnight. As Kian helps Scarlett let go of her anger, she begins to accept her family, her friendships, and most of all, her dreams. A captivating new novel from a writer reviewers have called \"a British import with a refreshingly light touch.\" —School Library Journal on Indigo Blue.",
        "Category": " Juvenile Fiction , Social Themes , Adolescence & Coming of Age",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "British Pottery and Porcelain",
        "Authors": "By Fisher, Stanley W.",
        "Description": "",
        "Category": "",
        "Publisher": "Bell Pub. Co.",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Lifestyle Discipleship: The Challenge of Following Jesus in Today's World",
        "Authors": "By Petersen, Jim",
        "Description": "How can we attempt to influence people who care little about religion, let alone their personal spiritual growth? Perhaps it is time to set our agenda aside and focus instead on where others are.Join Jim Petersen as he reexamines our assumptions about discipleship against the Scriptures in light of our world today.• Includes study guide",
        "Category": " Religion , Christian Ministry , Discipleship",
        "Publisher": "Navpress Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Extraordinary Meals from Ordinary Ingredients: 919 Fabulously Fast and Frugal Recipes, Each with a Secret Ingredient!",
        "Authors": "By Reader's Digest Editors",
        "Description": "",
        "Category": "",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "5,000 Miles to Freedom: Ellen and William Craft's Flight from Slavery",
        "Authors": "By Fradin, Dennis B. and Fradin, Judith Bloom",
        "Description": "What would it take for slaves to escape from slavery in the Deep South, 1,000 miles from freedom and then on to England during the period of the Fugitive Slave Act? For most slaves the thought of escape was unimaginable. But fear did not stop Ellen and William Craft from chasing freedom.An inspiring and riveting story of two amazing people stopping at nothing to fight for freedom and racial equality, this thrilling true tale chronicles Ellen and William Craft's lives from their flight from slavery in Georgia to their rise to world-wide fame as heroes of the Abolitionist movement.Illustrated with period artwork, newspaper clippings, and archival photographs, 5,000 Miles to Freedom captures the unforgiving realities of slave life, the political hatred between North and South, and, above all, the extraordinary achievements of this remarkable couple.National Geographic supports K-12 educators with ELA Common Core Resources.Visit www.natgeoed.org/commoncore for more information.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "National Geographic Kids",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "John, Paul, George & Ben",
        "Authors": "By Smith, Lane",
        "Description": "Once there were four lads...John [Hancock],Paul [Revere],George [Washington],and Ben [Franklin].Oh yes, there was also Tom [Jefferson], but he was annoyingly independent and hardly ever around.These lads were always getting into trouble for one reason or another. In other words, they took a few...liberties. And to be honest, they were not always appreciated.This is the story of five little lads before they became five really big Founding Fathers.",
        "Category": " Juvenile Fiction , Historical , United States , Colonial & Revolutionary Periods",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Time Hackers",
        "Authors": "By Paulsen, Gary",
        "Description": "You ever open your locker and find that some joker has left something really weird inside?Seventh-grader Dorso Clayman opens his locker door to find a dead body.Thirty seconds later it disappears. It’s not the first bizarre thing that has appeared in his locker and then vanished.Something’s going on. Somebody has decided to make Dorso and his buddy Frank the target of some strange techno-practical jokes. The ultimate gamesters have hacked into the time line, and things from the past are appearing in the present. Soon, the jokes aren’t funny anymore—they’re dangerous. Dorso and Frank have got to beat the time hackers at their own game by breaking the code, before they get lost in the past themselves.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Kathleen: The Celtic Knot (Girls of Many Lands)",
        "Authors": "By Howell, Troy (ILT) and Parkinson, Siobhan",
        "Description": "Twelve-year-old Dubliner Kathleen Murphy is given the chance to take Irish dancing lessons in 1937 and discovers she has a talent for it. Simultaneous.",
        "Category": " Juvenile Fiction , Historical , Europe",
        "Publisher": "Amer Girl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Lawn Boy",
        "Authors": "By Paulsen, Gary",
        "Description": "One day I was 12 years old and broke. Then Grandma gave me Grandpa's old riding lawnmower. I set out to mow some lawns. More people wanted me to mow their lawns. And more and more. . . . One client was Arnold the stockbroker, who offered to teach me about \"the beauty of capitalism. Supply and Demand. Diversify labor. Distribute the wealth.\" \"Wealth?\" I said. \"It's groovy, man,\" said Arnold.If I'd known what was coming, I might have climbed on my mower and putted all the way home to hide in my room. But the lawn business grew and grew. So did my profits, which Arnold invested in many things. And one of them was Joey Pow the prizefighter. That's when my 12th summer got really interesting.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Wendy Lamb Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "600 Decorating Tips & Finishing Touches: A Collection of Beautiful Ideas and Projects to Transform Your Living Spaces",
        "Authors": "By Tessa Evelegh",
        "Description": "",
        "Category": "",
        "Publisher": "HERMES HOUSE",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Sociobiology Debate",
        "Authors": "By Caplan, Arthur L.",
        "Description": "",
        "Category": "",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1979"
        }
    },
    {
        "Title": "I Love Lucy: The Complete Picture History of the Most Popular TV Show Ever",
        "Authors": "By McClay, Michael and Gaffner-McClay, Deanna",
        "Description": "Now, for Lucy fans everywhere, comes a long-awaited tribute to the most popular series in television history. Created by a real insider who, as the son of Desilu's publicity director, literally grew up on the I Love Lucy lot, this is the only book of its kind authorized by the Lucille Ball estate. The only book with an introduction by Lucie Arnaz, the daughter of Lucille Ball and Desi Arnaz. The only book that's a complete pictorial history of every Lucy episode. The only book to draw from dozens of exclusive interviews with the show's stars and creators, featuring over 1,000 photographs, many never before published and in full color.",
        "Category": " Performing Arts , Television , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The American Dream: The 50's (Our American Century)",
        "Authors": "By Time-Life Books, Stolley, Richard B",
        "Description": "Examines the politics, suburbia, automobiles, art and entertainment, cold war, television, and sports of the 1950s.",
        "Category": "",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Help! I'm Trapped in My Lunch Lady's Body",
        "Authors": "By Strasser, Todd",
        "Description": "When Jake, Josh, and Andy switch bodies with three very different lunch ladies, school lunch will never be the same as students get in line for big laughs. Original.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "When LaGuardia Was Mayor: New York's Legendary Years",
        "Authors": "By Heckscher, August",
        "Description": "",
        "Category": "",
        "Publisher": "Norton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Marilu Henner's Total Health Makeover",
        "Authors": "By Henner, Marilu and Morton, Laura",
        "Description": "When Was The Last Time You Felt Really Healthy?Now's the time to create the healthy, balanced life you want -- and become the truly vibrant, happy person you were meant to be. Combining good humor with solid science, Marilu Henner provides essential information on every aspect of health and fitness, including:Detoxing your bodyPreventing or alleviating health conditions from obesity to cancerThe secrets of stress reductionReal food and the organic way to fuel your bodyFree yourself forever from diets and disease-causing toxins, boost your energy, lower and maintain your weight -- and change your life.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Clara Joins the Circus",
        "Authors": "By Pellowski, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Parents' Magazine Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Learn to Play the Piano and Keyboard: A Step-by-step-guide",
        "Authors": "By French, Nick",
        "Description": "",
        "Category": " Music , Musical Instruments , Piano & Keyboard",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Fabulous Gourmet Food Processor Cookbook",
        "Authors": "By Gethers, Judy",
        "Description": "250 easy, step-by-step recipes for tantalizing gourmet delights you can make with a flick of the switch or a turn of the wrist:• Spreads, pâtés, and dips• Mousse, soufflé, and quiche• Stocks and soups• Sauces and butters• Breads, biscuits, and rolls• Pies, pastries, and cakes• And much, much more   The Fabulous Gourmet Food Processor Book also contains:• Invaluable tips for easy use of your machine• A unique Table of Foods, describing proper preparation• A Table of Equivalents—stop guessing how many whole apples equal a cup of diced apples• A Dictionary of Food Processor Parts• A Glossary of Cooking Terms• Ten sample menus from formal to casual• Special menus for a cocktail party and buffet brunch• Illustrations to clarify instructions • A Special Time-Saver: A guide to what you can prepare and freeze in advance",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "Better Homes and Gardens Fix and Freeze Cookbook",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Shares recipes for single-serving and family-size main dishes, soups, stews, sandwiches, side dishes, appetizers, and desserts which can be made ahead of time and frozen for future use",
        "Category": " Cooking , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Road to Reality: Coming Home to Jesus from an Unreal World",
        "Authors": "By Yohannan, K. P. and Lutzer, Erwin W. (FRW)",
        "Description": "",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Gospel for Asia",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Ace the Technical Interview: Includes Y2K Job Opportunities",
        "Authors": "By Rothstein, Michael F.",
        "Description": "Gathers more than 2,000 technical interview questions, looks at the interview process, offers advice on preparation and performance, and includes discussions of Year 2000 date conversion job opportunities",
        "Category": " Computers , Computer Science",
        "Publisher": "Computing Mcgraw-Hill",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Social Life of Information",
        "Authors": "By Brown, John Seely and Duguid, Paul",
        "Description": "To see the future we can build with information technology, we must look beyond mere information to the social context that creates and gives meaning to it. For years, pundits have predicted that information technology will obliterate the need for almost everything&#151;from travel to supermarkets to business organizations to social life itself. Individual users, however, tend to be more sceptical. Beaten down by info-glut and exasperated by computer systems fraught with software crashes, viruses, and unintelligible error messages, they find it hard to get a fix on the true potential of the digital revolution. John Seely Brown and Paul Duguid help us to see through frenzied visions of the future to the real forces for change in society. They argue that the gap between digerati hype and end-user gloom is largely due to the 'tunnel vision' that information-driven technologies breed. We've become so focused on where we think we ought to be&#151;a place where technology empowers individuals and obliterates social organizations&#151;that we often fail to see where we're really going and what's helping us get there. We need, they argue, to look beyond our obsession with information and individuals to include the critical social networks of which these are always a part. Drawing from rich learning experiences at Xerox PARC, from examples such as IBM, Chiat/Day Advertising, and California's 'Virtual University', and from historical, social, and cultural research, the authors sharply challenge the futurists' sweeping predictions.They explain how many of the tools, jobs, and organizations seemingly targeted for future extinction in fact provide useful social resources that people will fight to keep. Rather than aiming technological bullets at these 'relics', we should instead look for ways that the new world of bits can learn from and complement them. Arguing elegantly for the important role that human sociability plays, even&#151;perhaps especially&#151;in the world of bits, The Social Life of Information gives us an optimistic look beyond the simplicities of information and individuals. It shows how a better understanding of the contribution that communities, organizations, and institutions make to learning, working and innovating can lead to the richest possible use of technology in our work and everyday lives.",
        "Category": " Business & Economics , Information Management",
        "Publisher": "Harvard Business Review Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Four Seasons of Chester County, Vol. 1",
        "Authors": "By Hamer, Red",
        "Description": "",
        "Category": "",
        "Publisher": "Four Seasons Book Publishers",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "What in the World Is Going On?: 10 Prophetic Clues You Cannot Afford to Ignore",
        "Authors": "By Jeremiah, David",
        "Description": "Is the current economic and political crisis actually prophesied in the Bible? If so, what are we to do about it? It is hard to piece together all this information in a way that gives a comprehensive picture of what the end times will look like. That's why so many theories abound. And that's why Dr. David Jeremiah has writtenWhat In the World Is Going On?, a unique book that cuts through the hundreds of books and numerous theories to identify the essential 10 most important bible prophecies. There is no other book like this. You'll find it the ultimate study tool for understanding the future. You'll have a greater sense of comfort that, even in these crazy times, God is indeed in control. If bible prophecy as always been a mystery to you, Dr. Jeremiah's book will help you solve the mystery. At last, bible prophecy can make sense, and make a difference. It's never been more important. What In the World Is Going On? is shocking and eye-opening but essential reading in these turbulent days.Brings bible prophecy to light on:- The oil crisis- The resurgence of Russia- The new axis of evil- The importance of Israel- The new powers of the European Union",
        "Category": " Religion , Biblical Studies , Prophecy",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Amish: The Enduring Spirit",
        "Authors": "By Hauslein, Leslie Ann",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Math For Fun Projects",
        "Authors": "By Kenyon, Tony (ILT) and King, Andrew",
        "Description": "Offers a variety of projects and activities involving numbers, fractions, patterns, shapes, diagrams, logic, plotting points, and measuring sizes, weight, and time",
        "Category": " Juvenile Nonfiction , Mathematics , General",
        "Publisher": "Copper Beech Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Essential Klimt",
        "Authors": "By Laura Payne",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Cancer Schmancer",
        "Authors": "By Drescher, Fran",
        "Description": "Starting where Enter Whining left off, the star of The Nanny reveals how she overcame many obstacles and challenges, including cancer, and shares the hilarious insights and wisdom she learned along the way. 125,000 first printing.",
        "Category": " Medical , Oncology",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Grace in Thine Eyes (Lowlands of Scotland Series #4)",
        "Authors": "By Higgs, Liz Curtis",
        "Description": "Glen of Loch Trool. Spring 1808. Davina McKie is a bonny lass of seventeen, as clever as they come and a gifted musician. Unable to speak since childhood, she is doted on by her belligerent younger brothers, Will and Sandy, who vow to protect their silent sister.When the lads are forced to depart the glen, Jamie McKie intends to brighten his daughter’s summer by escorting Davina to the Isle of Arran. Her cousins make her welcome at the manse, and the parish delights in hearing their talented fiddler.But when she catches the eye of a handsome young Highlander on Midsummer Eve, sheltered Davina is unprepared for the shocking events that follow.A timeless story of passion and revenge, of lost innocence and shattered dreams, Grace in Thine Eyes explores the sorrow of unspeakable shame and the gift of immeasurable grace.A Reader’s Guide and Scottish Glossary Are Included",
        "Category": " Fiction , Historical , General",
        "Publisher": "WaterBrook",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The boundary riders",
        "Authors": "By Phipson, Joan",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace & World",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "The Natural Health Cookbook: More Than 150 Recipes to Sustain and Heal the Body",
        "Authors": "By Jacobi, Dana",
        "Description": "The best of twenty years of natural-foods cooking from Natural Health magazine features multiethnic recipes that maximize the healing power in foods, including soups, vegetables, salads, sauces, and desserts that are easy to prepare using wholesome natural ingredients. 25,000 first printing.",
        "Category": " Cooking , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Whys of a Philosophical Scrivener",
        "Authors": "By Gardner, Martin",
        "Description": "A noted author and science writer defends his personal attitudes toward the fundamental issues of classical philosophy, discussing the awesome mystery surrounding science and life and explaining why he considers himself a theist",
        "Category": " Philosophy , History & Surveys , General",
        "Publisher": "Quill",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "July",
            "Year": "1983"
        }
    },
    {
        "Title": "A Short Course in Photography: An Introduction to Black and White Photographic Technique (4th Edition)",
        "Authors": "By London, Barbara and Stone, Jim",
        "Description": "",
        "Category": " Photography , Techniques , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "New Complete Dog Training Manual",
        "Authors": "By Fogle, Bruce and White, Patricia Holden",
        "Description": "Accompanied by gorgeous full-color photographs and in-depth annotations, a wonderful dog training and behavior modification resource reveals how to establish routines, implement commands, break bad habits, and much more.",
        "Category": " Pets , Reference",
        "Publisher": "DK",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Greatest Quarterbacks",
        "Authors": "By King, Peter",
        "Description": "",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Time Inc",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "I'm a Big Sister!",
        "Authors": "By Randall, Ronne and Stephenson, Kristina (ILT)",
        "Description": "Ellie is excited about becoming a big sister when her parents bring home a new baby.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Parragon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2012"
        }
    },
    {
        "Title": "Desserts for All Occasions (Favorite Brand Name Recipes)",
        "Authors": "By Consumer Guide",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "Beekman House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Seashore (Eyewitness Books)",
        "Authors": "By Parker, Steve",
        "Description": "Full-color photos. The secrets of sea otters, crabs, seashells, and more are revealed in this unique photographic overview of plant and animal life inhabiting the world's coastlines.",
        "Category": "",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Wind and Weather (Child's First Library of Learning)",
        "Authors": "By Berry, C. E.",
        "Description": "Presents information about the weather in an illustrated question and answer format.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    }
]