[
    {
        "Title": "Man Meets Dog",
        "Authors": "By Konrad Z Lorenz",
        "Description": "The Noble-laureate ecologist's examination of the history, traditions, and nature of the relationship between human beings and domesticated dogs and cats",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Corpus Juris Humorous: In Brief: A Compilation of Outrageous, Unusual, Infamous and Witty Judicial Opinions from 1256 A.D. to the Present",
        "Authors": "By McClay, John B. and Matthews, Wendy L.",
        "Description": "The legal system isn't usually considered a wellspring of laughter, but every once in a while, a jovial judge is faced with a case of such absurdity that it fairly demands an equally amusing response. Presented here are some 100 of the most outrageous cases and judicial rulings ever handed down, dating from the present day back to the 13th century and covering such fertile legal--and laughable--grounds as a blowtorch-wielding hairdresser, the case of the bovine house-wrecker, the man who sued himself for breach of trust and other ticklish torts. From the case of Schwartz vs. Warwick-Philadelphia Corporation, which shows that brotherly love takes a backseat to backside injury when a slip and fall has plaintiffs seeking damages for their dented posteriors, to Aetna Insurance vs. Sachs, concerning a poodle who piddled on a priceless rug, these judicial rulings offer an hilarious perspective on the law and those who administer it.",
        "Category": " Humor , General",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "The Generosity Factor: Discover the Joy of Giving Your Time, Talent, and Treasure",
        "Authors": "By Blanchard, Kenneth H. and Cathy, S. Truett",
        "Description": "A modern day parable teaching the joy of generosity, service, and relationships.In the tradition of the best-seller The One Minute Manager, authors Ken Blanchard and fast-food entrepreneur S. Truett Cathy (Chic-Fil-A) create a parable that demonstrates the virtues of generosity.The Broker is a young man on the way up the corporate ladder who has found a niche for making money through high-tech investing. His imposing home, his chauffeur-driven limousine, his deep-sea fishing boat, and his rubbing shoulders with leading New York executives create the illusion of success, yet deep inside he is restless and feels insignificant. He reads an article about The Executive, the CEO of a very large and successful company, who claims the greatest joy in his life is his ability to give to others. This piques The Broker's curiosity. He thinks he might get a competitive edge by meeting with The Executive.The Broker is impressed by all the antique and collector automobiles in the first floor lobby of The Executive's office building. 'He must really worship cars,' he tells The Assistant. 'Not at all,' The Assistant says. 'He displays these extraordinary machines to inspire us--to remind us that each of us is unique.'The Broker's worldview continues to be shaken and turned upside down as he talks to The Executive and hears the principles that form his life. The Executive describes the plan he has developed that turns giving into a tremendous pleasure. He calls it The Generosity Factor--a way to give time, talent, treasure, and touch to those in need.The advice The Broker receives and the relationship he develops with The Executive provide a pleasant surprise and a unique twist on what it means to truly succeed--whether in business, at home, or in life.",
        "Category": " Religion , Christian Life , Professional Growth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "A Patent Lie",
        "Authors": "By Goldstein, Paul",
        "Description": "Forced out of his high-powered Manhattan law firm and stuck in a dead-end solo practice, Michael Seeley, the tough-but-wounded hero of Errors and Omissions, cannot say no when his estranged brother, Leonard, head of research at upstart biotech Vaxtek, Inc., flies in from California to beg him to take over the company’s lawsuit for patent infringement of its pathbreaking AIDS vaccine after the sudden death of the lead trial lawyer. The financial and moral stakes of the case are staggering, and Seeley suspects that murder cannot be ruled out as a hardball litigation tactic of big-pharma adversary St. Gall Laboratories. As Seeley travels between San Francisco and Silicon Valley to prepare for trial, dark facts surface concerning the vaccine’s discovery by Vaxtek scientist Alan Steinhardt and its alleged theft by St. Gall researcher Lily Warren. Ethical quandaries deepen into mortal danger as the trial, under the stern prodding of federal judge Ellen Farnsworth, rushes to its unexpected end. A timely and fascinating look at how the law operates at its most arcane yet financially consequential, A Patent Lie is further evidence that Paul Goldstein is an emerging master of the legal thriller.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "The SS (The Third Reich)",
        "Authors": "By Time-Life Books",
        "Description": "Traces the history of the SS, describes their role in World War II and the Holocaust, and looks at their training and indoctrination",
        "Category": " History , General",
        "Publisher": "Time Life Books",
        "Price Starting With ($)": "6.94",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Developing Superior Work Teams: Building Quality and the Competitive Edge",
        "Authors": "By Kinlaw, Dennis C.",
        "Description": "",
        "Category": "",
        "Publisher": "Lexington Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "DNA Leadership Through Goal-Driven Management",
        "Authors": "By Ball, James R.",
        "Description": "",
        "Category": " Business & Economics , Leadership",
        "Publisher": "The Goals Institute",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Walking in Baltimore: An Intimate Guide to the Old City",
        "Authors": "By Shivers, Frank R.",
        "Description": "Twelve walking tours of Baltimore celebrate the city's past and present and highlight places of special interest and historical significance",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Johns Hopkins University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Surfing the Edge of Chaos: The Laws of Nature and the New Laws of Business",
        "Authors": "By Pascale, Richard T., Milleman, Mark, and Gioja, Linda",
        "Description": "Surfing the Edge of Chaos is a brilliant, powerful, and practical book about the parallels between business and nature—two fields that feature nonstop battles between the forces of tradition and the forces of transformation. It offers a bold new way of thinking about and responding to the personal and strategic challenges everyone in business faces these days.",
        "Category": " Business & Economics , Management",
        "Publisher": "Currency",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "George Bush: Man of Integrity",
        "Authors": "By Wead, Doug and Bush, George",
        "Description": "In several in-depth interviews, the Vice President discusses his lengthy political career and reveals his thoughts on issues such as abortion, a balanced budget, national defense, religious freedom, and the Equal Rights Amendment",
        "Category": "",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "A family harvest: Being the recipes and record of good eating from the shores of Maryland and the rocky Berkshires of Massachusetts",
        "Authors": "By Snow, Jane Moss",
        "Description": "",
        "Category": "",
        "Publisher": "Bobbs-Merrill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Forget-About-Meat Cookbook.",
        "Authors": "By Brooks, Karen",
        "Description": "Information on kitchen utensils, seasonings, and essential amino acids prefaces suggestions for appetizing, meatless dishes and nutritious sweets",
        "Category": " Cooking , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1974"
        }
    },
    {
        "Title": "Joey Pigza Swallowed the Key (Joey Pigza Books)",
        "Authors": "By Gantos, Jack",
        "Description": "Joey Pigza can't sit still. He can't pay attention, he can't follow the rules, and he can't help it -- especially when his meds aren't working. Joey's had problems ever since he was born, problems just like his dad and grandma have. And whether he's wreaking havoc on a class trip or swallowing his house key, Joey's problems are getting worse. In fact, his behavior is so off the wall that his teachers are threatening to send him to the special-ed center downtown.Joey knows he's really a good kid, but no matter how hard he tries to do the right thing, something always seems to go wrong. Will he ever get anything right?",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Boxes",
        "Authors": "By Sleator, William",
        "Description": "Annie's Uncle Marco goes on one of his mysterious trips, leaving her in charge of two sealed boxes on one condition: she must not open either one while he is away. But she is tempted...and soon she has unleashed the unspeakable. The creatures inside the box are crab-like and grotesque. And they possess a power Annie could never have imagined: the power to transmute time. \"Sleator is the master of the creepy-crawly, and his inventiveness is at full power here.\" --The Horn Book",
        "Category": " Juvenile Fiction , Horror",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "No! I Don't Want to Join a Book Club: Diary of a Sixtieth Year",
        "Authors": "By Ironside, Virginia",
        "Description": "Read Virginia Ironside's posts on the Penguin Blog.A screamingly funny and poignant story about embracing life beyond middle age  Marie Sharp is heading toward sixty and is just fine with it. She’s already had plenty of excitement in her life: sex and drugs in the freewheeling sixties, career and children, marriage and divorce. Now she’s ready to settle into a quiet, blissfully boring routine. No Italian classes or gym memberships or bicycle trips across Europe, thank you very much! Marie just wants to put her feet up and “start doing old things.”  She’s even sworn off men! But as it turns out, life still has some surprises in store, the biggest of which is a new grandson on the way. What’s more, Archie, her old childhood crush, suddenly reenters her life, and her closest friend falls seriously ill. Armed with a biting sense of humor, Marie wrestles with a life that refuses to follow her plans—and may still offer more possibilities than she realizes.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Barbie Loves Her Sisters (Look-Look)",
        "Authors": "By Muldrow, Mona and Fugikawa, Scott (ILT)",
        "Description": "Barbie and her sisters take a vacation at the seashore, where they visit the beach, ride a bicycle along the boardwalk, work in the garden, and play games inside during a summer storm.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Junie B., First Grader (at last!) (A Stepping Stone Book(TM))",
        "Authors": "By Brunkus, Denise (ILT) and Park, Barbara",
        "Description": "Meet the World's Funniest First Grader—Junie B. Jones! Hurray, hurray for a brand-new school year! With over 50 million books in print, Barbara Park's New York Times bestselling chapter book series, Junie B. Jones, is a classroom  favorite and has been keeping kids laughing—and reading—for over 20  years! In the 18th Junie B. Jones book, being in first grade means  having  to get used to a whole new classroom. And a whole new teacher.  And a whole new bunch  of strange children. But here's the worst thing  of all: When Junie B. tries to read  words on the chalkboard, she can’t  seem to see what everyone else is seeing! Is it possible she might  actually end up wearing glasses?USA TODAY: \"Junie B. is the darling of the young-reader set.\"   Publisher's Weekly: \"Park convinces beginning readers that Junie B.—and reading—are lots of fun.\"   Kirkus Reviews: \"Junie's swarms of young fans will continue to delight in her unique take on the world….A hilarious, first-rate read-aloud.\"   Time Magazine: \"Junie B. Jones is a feisty six-year-old with an endearing penchant for honesty.\"",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Complete Scarsdale Medical Diet",
        "Authors": "By Tarnower, Herman",
        "Description": "",
        "Category": "",
        "Publisher": "bantam books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Customer Satisfaction: The Other Half of Your Job (A Fifty-Minute Series Book)",
        "Authors": "By Scott, Dru",
        "Description": "",
        "Category": " Business & Economics , Customer Relations",
        "Publisher": "Crisp Publications",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Paradox of American Democracy: Elites, Special Interests, and the Betrayal of Public Trust",
        "Authors": "By Judis, John B.",
        "Description": "A thoughtful reflection on democracy in twentiethcentury America discusses the institutions that once fed it and threaten to destroy it, taking on special interest politics and arguing for a greater articulation of the needs of the nation.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Romantic Rebellion: Romantic Versus Classic Art",
        "Authors": "By Clark, Kenneth McKenzie",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1974"
        }
    },
    {
        "Title": "Dalmatians",
        "Authors": "By Pisano, Beverly",
        "Description": "",
        "Category": "",
        "Publisher": "TFH Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Healthy Eating During Menopause",
        "Authors": "By Marilyn Glenville PhD, Lewis Esson",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "In Exile From The Land of Snows",
        "Authors": "By Avedon, John",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Are Those Kids Yours?: American Families With Children Adopted From Other Countries",
        "Authors": "By Register, Cheri",
        "Description": "\"Cheri Register has given us a thought-provoking glimpse into the deeply complex world of international adoption: the children who grow up in it, the parents who raise them, the parents left behind, and the ethical questions it raises for us all.\"---Betty Jean Lifton Author of Lost and Found: The Adoption Experience\"Well-written and a pleasure to read. `Are Those Kids Yours?' provides an insightful, comprehensive resource for individuals contemplating, awaiting, or bringing up an internationally adopted child. In a clear manner, Register raises appropriate questions, stimulates new thoughtfulness and provides well-founded answers for parents of transracially adopted children....It will be of interest and usefulness to these children as they grow up, to their extended families and friends, and to adoption and mental health professionals who may be involved in various stages of their lives. A welcome addition to current resources, `Are Those Kids Yours?' is worth reading and re-reading once again.\"---Claudia Jewett Jarratt Author of Adopting the Older child\"Essential reading for international adoptive families, those considering intercountry adoption, and professionals serving these families. Cheri Register explores the ethics, both political and personal, of intercountry adoption, and the special responsibilities of families parenting a child from another country. Fascinating reading.\"---Susan Freivalds Executive Director Adoptive Families of America\"'Are Those Kids Yours?' describes the joys and pains, the pleasures and worries that families experience when they adopt children from abroad in poignant, yet realistic terms. The author draws upon her own experiences as a mother of two korean daughters and those of other families who have adopted children from Asian and Latin American countries. While strongly endorsing intercountry adoption, Cheri Register warns of the difficulties and disappointments families are likely to experience.\"---Rita I. Simon The American University Author of Transracial Adoptees and Their Families\"A treasure trove for international families...highly informative and superbly helpful. Register explores the past, present, and future of cross-cultural adoptions, with an emphasis on helping children understand their own histories. Personal anecdotes from international families make this book an enriching experience.\"---Jean Nelson-Erichsen Supervisor of Social Work Los Ninos International Adoption Center",
        "Category": " Family & Relationships , Adoption & Fostering",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Dear Folks.",
        "Authors": "By Juliet Lowell (William F. Brown, illus.)",
        "Description": "",
        "Category": "",
        "Publisher": "Putnam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Jenny Craig's No Diet Required",
        "Authors": "By Craig, Jenny",
        "Description": "Recommends a healthy diet and lifestyle to maintain desirable weight, and shares seasonal menus and recipes for main and side dishes",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Let's Stir It Up! Kids' Cookbook & Earth Friendly Fun",
        "Authors": "By Pratt, Dianne and Winter, Janet (ILT)",
        "Description": "Offers recipes for breakfast foods, salads, main and side dishes, and desserts, and provides information on the Earth, ecology, animals, and foods",
        "Category": " Juvenile Nonfiction , Cooking & Food",
        "Publisher": "Harvest Hill Press",
        "Price Starting With ($)": "5.16",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Writer's Digest Character Naming Sourcebook",
        "Authors": "By Kenyon, Sherrilyn, Blythe, Hal, and Sweet, Charlie",
        "Description": "The Ultimate Guide to Choosing Character NamesBack in print and better than ever, The Writer's Digest Character Naming Sourcebook has been updated and expanded to help you find character names and their meanings quickly and easily!This one-of-a-kind resource was specifically designed with the writer in mind. Inside you'll find:25,000+ first names and surnames, and their meanings, listed by originNames and surnames from more than 45 countriesA reverse lookup of names by meaningAn alphabetical index of namesAn explanation of naming practices and historical context for each originA list of the top ten most popular names in the United States every year from 1880-2003Instruction on how to create believable names that fit your characters and your storyThis exciting new edition also includes advice from a number of best-selling authors, includingElizabeth George, Alexander McCall Smith, Homer Hickam, Marian Keyes, Big Fish authorDaniel Wallace, and others. You'll get the inside scoop on their naming methods, plus the stories behind the names of their most famous characters.So throw out your old telephone books and baby-naming guides - The Writer's Digest Character Naming Sourcebook meets all your naming needs!",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.57",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Psychology: In Modules",
        "Authors": "By Straub, Richard",
        "Description": "",
        "Category": " Psychology , Reference",
        "Publisher": "Worth Publishers",
        "Price Starting With ($)": "6.71",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Study Guide for Crooks/Baur's Our Sexuality, 9th",
        "Authors": "By Baur and Crooks",
        "Description": "Thoroughly revised! This valuable resource gives students a fun and interesting way to practice the material. Each chapter includes practice tests (which include multiple-choice, essay, and true/false questions), learning objectives, concept maps, key terms, concept checks with page references to the text, and crossword puzzles. New anatomical drawings for students to label are included in this edition.",
        "Category": " Psychology , Social Psychology",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Introduction to Sociology",
        "Authors": "By Giddens, Anthony, Appelbaum, Richard P, and Duneier, Mitchell",
        "Description": "Taking a topical approach to the subject and treating conceptual material only as it arises in the discussion, Giddens (London School of Economics, UK), Duneier (City U. of New York and Princeton U., US), and Appelbaum (U. of California at Santa Barbara, US) undergraduate-level introduction to sociology. Twenty chapters discuss the standard concerns of the field, including socialization, groups and organizations, conformity and deviance, class and inequality, ethnicity and race, political power and social movements, education and the mass media, health and illness, urbanization and the environment, and globalization. Among the primary themes cited by the authors as motivating the character of the proceedings are the globalization of social life, the importance of comparative study, the necessity of a historical approach to sociology, issues of gender, and links between macro and micro levels of analysis. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Social Science , Sociology , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Vistas Student Textbook: Introduccion a la lengua espanola",
        "Authors": "By Donley, Philip M., Blanco, Jose A., Dellinger, Mary Ann, and Garcia, Maria Isabel",
        "Description": "",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Vista Higher Learning",
        "Price Starting With ($)": "6.9",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Capability Maturity Model: Guidelines for Improving the Software Process",
        "Authors": "By Curtis, Bill (EDT), Paulk, Mark C., and Weber, Charles V.",
        "Description": "The first part of the book describes the evolution of the CMM (Capability Maturity Model), the concepts of software process maturity, the structure of the model, how to interpret and use it, and the case study of IBM Houston.  The second part consists of the key practices of the CMM, which describe the software management engineering practices of a maturing software process.  Also includes a number of useful appendices. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Computers , Data Processing",
        "Publisher": "Addison-Wesley Professional",
        "Price Starting With ($)": "29.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Laurence Olivier On Screen (Quality Paperbacks)",
        "Authors": "By Hirsch, Foster",
        "Description": "Traces the career of the distinguished British actor, discusses his approach to acting, and examines his major roles on film",
        "Category": " Performing Arts , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "You Can If You Think You Can",
        "Authors": "By Peale, Norman Vincent",
        "Description": "",
        "Category": "",
        "Publisher": "Foundation for Christian Living",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Nixon's Shadow: The History of an Image",
        "Authors": "By Greenberg, David",
        "Description": "How an image-obsessed president transformed the way we think about politics and politicians. To his conservative supporters in 1940s southern California, Richard Nixon was a populist everyman; to liberal intellectuals of the 1950s, he was \"Tricky Dick,\" a devious manipulator; to 1960s radicals, a shadowy conspirator; to the Washington press corps, a pioneering spin doctor; to his loyal Middle Americans, a victim of liberal hatred; to recent historians, an unlikely liberal. Nixon's Shadow rediscovers these competing images of the protean Nixon, showing how each was created and disseminated in American culture and how Nixon's tinkering with his own image often backfired. During Nixon's long tenure on the national stageand through the succession of \"new Nixons\" so brilliantly described hereAmericans came to realize how thoroughly politics relies on manipulation. Since Nixon, it has become impossible to discuss politics without asking: What is the politician's \"real\" character? How authentic or inauthentic is he? What image is he trying to project? More than what Nixon did, this fascinating book reveals what Nixon meant.16 pages of photographs.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Red River",
        "Authors": "By Tademy, Lalita",
        "Description": "Hailed as \"powerful,\"\"accomplished,\" and \"spellbinding,\" Lalita Tademy's first novel Cane River was a New York Times bestseller and the 2001 Oprah Book Club Summer Selection. Now with her evocative, luminous style and painstaking research, she takes her family's story even further, back to a little-chronicled, deliberately-forgotten time...and the struggle of three extraordinary generations of African-American men to forge brutal injustice and shattered promise into a limitless future for their children... RED RIVERFor the newly-freed black residents of Colfax, Louisiana, the beginning of Reconstruction promised them the right to vote, own property-and at last control their own lives.Tademy saw a chance to start a school for his children and neighbors. His friend Israel Smith was determined to start a community business and gain economic freedom. But in the space of a day, marauding whites would \"take back\" Colfax in one of the deadliest cases of racial violence in the South. In the bitter aftermath, Sam and Israel's fight to recover and build their dreams will draw on the best they and their families have to give-and the worst they couldn't have foreseen. Sam's hidden resilience will make him an unexpected leader, even as it puts his conscience and life on the line. Israel finds ironic success-and the bitterest of betrayals. And their greatest challenge will be to pass on to their sons and grandsons a proud heritage never forgotten-and the strength to meet the demands of the past and future in their own unique ways. An unforgettable achievement, a history brought to vibrant life through one of the most memorable families in fiction, RED RIVER is about fathers and sons, husbands and wives-and the hopeful, heartbreaking choices we all must make to claim the legacy that is ours.",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Blue Jay's Dance: A Birth Year",
        "Authors": "By Erdrich, Louise",
        "Description": "During the last ten years, Louise Erdrich has written seven critically acclaimed and best-selling books and has also given birth to three children. In The Blue Jays' Dance, her first major work of nonfiction, she brilliantly and poignantly examines the joys and frustrations, the compromises and insights, the difficult struggles and profound emotional satisfactions she experienced in the course of one twelve-month period - from a winter pregnancy through a spring and summer of new motherhood to a fall return to writing.Erdrich illuminates afresh the large and small events that mothers - parents - everywhere will recognize and appreciate. A keenly spiritual observer of the natural world, she turns a poet's eye to the harmony of growth and change, of beginnings and endings, of love and longing. From the vantage point of a small house in New England, she looks out to the North Dakota horizon of her childhood and inward to an infant's first glimpse of a wild bird.The Blue Jay's Dance takes the mundane routines of everyday life and renders them marvelous, even while it records the odyssey of a woman's deepening awareness of the rhythms that bind families together. Once again, Louise Erdrich discovers the universal within the particular moment and gives full-bodied expression to that most common and yet most mysterious of all human tasks: the passing on of life.",
        "Category": " Social Science , Sociology , Marriage & Family",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "White Rose:  Una Rosa Blanca (A Ballantine Readers' Circle Book)",
        "Authors": "By Ephron, Amy",
        "Description": "1. Based on what you know about William Hearst and yellow journalism, do you think Karl Decker and Eugene Bryson embellished their accounts? Do you think Evangelina is not as innocent as they portrayed her and that there's a possibility that she led an uprising at the Isle of Pines? 2. What are your thoughts on newspapermen 'making the news?' Are actions like Hearst's ever justified? It has been speculated that the newspaper moguls of this era were working in conjunction with the government. Do you believe that there is truth to this speculation? 3. Between the unique romance, a major historical event, and a good old-fashioned spy story, White Rose has something for nearly everyone. What elements of this novel drew you in the most? 4. This seems like a novel that can be enjoyed by men and women alike. Any thoughts on this? 5. Which characters intrigued you the most? Why? 6. This novel is essentially a love story, a triangle, hence the juxtaposition of the chapters with Katherine Decker in Washington, D.C. What significance did Katherine's perspective contribute to the story? 7. There are plans to adapt White Rose into a movie, and a rumor that Hearst will play a bigger role in the movie version. If you were the casting director, who would you choose to play the parts of Evangelina, Carlos, Karl, and Katherine? 8. Were you able to figure out the clues in the poem that Evangelina wrote for Karl to help him break her out of prison? 9. Ms. Ephron's style is minimalistic. Did you feel the short, cinematic chapters transported you into late nineteenth century Cuba? 10. Do you think today's tabloid journalism is rooted in yellow journalism? 11. Have you read other novels or nonfiction about this period in Cuban history? If so, did you find consistencies in regard to the events depicted in White Rose? 12. What were your favorite moments in White Rose? 13. Can you think of other historical events and figures--that have not been previously mined--that would make for similarly exciting",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Mother's Book",
        "Authors": "By Child, Lydia Maria Francis",
        "Description": "Child's 1831 book on childhood and motherhood, with its \"plain, practical good-sense, written with earnestness and simplicity of style,\" offers chapters on Early Cultivation of Intellect, Amusements and Employments, Politeness, Management during the Teens, and Views of Matrimony. This facsimile edition was published in cooperation with Old Sturbridge Village.",
        "Category": " History , General",
        "Publisher": "Applewood Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "The Hand Of God: A Collection of Thoughts and Images Reflecting the Spirit of the Universe",
        "Authors": "By Begley, Sharon (INT) and Reagan, Michael (EDT)",
        "Description": "If it was once thought that to look into the heavens was to look into the face of God, then the brilliant and striking images we're now seeing from deep in space, many from the Hubble Space Telescope, provide a glimpse of an eternally careful handiwork once invisible to the naked eye. We can now look into the outermost reaches of space, with spiral galaxies cartwheeling against an infinitude of black space, exploding supernovas and stellar nurseries, vast clouds of dark dust slowly parting to reveal the luminous star clusters of a nebula. Until recently, neither astronomers nor the public had ever seen such wondrous phenomena like this before at such close range. The deep space images of embryonic solar systems, black holes, and dying stars are now within our reach-and they're changing the way we look at our universe, ourselves, and God. Hundreds of years ago, science and belief fought a bitter war resulting in a longstanding split between reason and faith. But as the 20th century draws to a close, the Big Bang theory and discoveries in the laws of the constants provide ample evidence of the fine-tuning required to bring about our universe, leading scientists to wonder: Could such a carefully balanced cosmology be merely an accident' The Hand of God sheds new light on the timeless relationship between maker and made, creator and creation. These remarkable images provide an awe-inspiring background for quotes by scientists, poets, artists, astronauts, and others who have struggled eloquently to make sense of the universe and God's hand in it.",
        "Category": " Religion , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Women Who Raised Me: A Memoir",
        "Authors": "By Rowell, Victoria",
        "Description": "The story of a remarkable woman's rise out of the foster-care system to attain the American dream—and of the unlikely series of women who lifted her up in marvelous and distinctive ways Born as a ward of the state of Maine—the child of an unmarried Yankee blueblood mother and an unknown black father—Victoria Rowell beat the odds. Unlike so many other children who fall through the cracks of our overburdened foster-care system, her experience was nothing short of miraculous, thanks to several extraordinary women who stepped forward to love, nurture, guide, teach, and challenge her to become the accomplished actress, philanthropist, and mother that she is today.Rowell spent her first weeks of life as a boarder infant before being placed with a Caucasian foster family. Although her stay lasted for only two years, at this critical stage Rowell was given a foundation of love by the first of what would be an amazing array of women, each of whom presented herself for different purposes at every dramatic turn of Rowell's life. In this deeply touching memoir, Rowell pays tribute to her personal champions: the mothers, grandmothers, aunts, mentors, teachers, and sisters who each have fascinating stories to tell. Among them are Agatha Armstead, Rowell's longest-term foster mother, a black Bostonian on whose rural Maine farm Rowell's fire to reach for greatness was lit; Esther Brooks, a Paris-trained prima ballerina, Rowell's first mentor at the Cambridge School of Ballet; Rosa Turner, a Boston inner-city fosterer who taught Rowell lessons of independence; Sylvia Silverman, a mother and teacher whose home in a well-kept middle-class suburban neighborhood prepared Rowell for her transition out of foster care and into New York City's wild worlds of ballet and acting and adulthood.In spite of support from individuals and agencies, Rowell nonetheless carried the burden of loneliness and anxiety, common to most foster children, particularly those \"orphans of the living\" who are never adopted. Heroically overcoming those obstacles, Rowell also reaches a moment when she can embrace her biological mother, Dorothy, and, most important, accept herself.Ultimately, The Women Who Raised Me is a story that belongs to each of us as it shines a glowing light on the transformational power of mentoring, love, art, and womanhood.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Sadie-in-Waiting (Life, Faith & Getting It Right #2) (Steeple Hill Cafe)",
        "Authors": "By Jones, Annie",
        "Description": "When Sadie--former Dogwood Blossom Queen, pharmacist's wife, mother of two, and daughter of a man who fancies himself King Solomon (or King Lear?)--accepts the position of graveyard superintendent of Wileyville, Kentucky, a journey into the past with her sisters brings a stunning revelation and an understanding of what she has been waiting for. Original.",
        "Category": " Fiction , Religious",
        "Publisher": "Steeple Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The New Encyclopedia of the Opera",
        "Authors": "By Ewen, David.",
        "Description": "",
        "Category": "",
        "Publisher": "Hill",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Bat Mitzvah: A Jewish Girl's Coming of Age",
        "Authors": "By Goldin, Barbara Diamond and Weihs, Erika (ILT)",
        "Description": "Examines the role of women in Judaism by celebrating the recent tradition of the Bat Mitzvah ceremony, begun in 1922, with real-life stories of girls and women in their own voices. By the author of Just Enough Is Plenty.",
        "Category": " Juvenile Nonfiction , Religion , Judaism",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Metabolic Typing Diet: Customize Your Diet To: Free Yourself from Food Cravings: Achieve Your Ideal Weight; Enjoy High Energy and Robust Health; Prevent and Reverse Disease",
        "Authors": "By Wolcott, William L. and Fahey, Trish",
        "Description": "Customize Your Diet to Your Own Unique Body Chemistry  For hereditary reasons, your   metabolism is unique.  Cutting-edge research shows that no single diet works well   for everyone–the very same foods that keep your best friend slim may keep you overweight   and feeling unhealthy and fatigued. Now, William Wolcott, a pioneer in the field   of metabolic research, has developed a revolutionary weight-loss program that allows   you to identify your \"metabolic type\" and create a diet that suits your individual   nutritional needs. In The Metabolic Typing Diet, Wolcott and acclaimed science writer   Trish Fahey provide simple self-tests that you can use to discover your own metabolic   type and determine what kind of diet will work best for you. It might be a low-fat,   high carbohydrate diet filled with pasta and grains, or a high-fat, high-protein   diet focused on meat and seafood, or anything in between. By detailing exactly which   foods and food combinations are right for you, The Metabolic Typing Diet at last   reveals the secret to shedding unwanted pounds and achieving optimum vitality with   lasting results. The Metabolic Typing Diet will enable you to: - Achieve and maintain   your ideal weight - Eliminate sugar cravings - Enjoy sustained energy and endurance - Conquer   indigestion, fatigue, and allergies - Bolster your immune system - Overcome anxiety,   depression, and mood swings",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Feast of Love (Vintage Contemporaries)",
        "Authors": "By Baxter, Charles",
        "Description": "Late one night, a man wakes from a bad dream and decides to take a walk through his neighborhood.  After catching sight of two lovers entangled on the football field, he comes upon Bradley Smith, friend and fellow insomniac, and Bradley begins to tell a series of tales--a luminous narrative of love in all it’s complexity.We meet Kathryn, Bradleys’ first wife, who leaves him for another woman, and Diana, Bradley’s second wife, more suitable as a mistress than a spouse. We meet Chlo? and Oscar, who dream of a life together far different from the sadness they have known. We meet Esther and Harry, whose love for their lost son persists despite his contempt for them. And we follow Bradley on his nearly magical journey to conjugal happiness.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Vidia and the Fairy Crown (Disney Fairies)",
        "Authors": "By Clarke, Judith Holmes (ILT) and Driscoll, Laura",
        "Description": "Vidia can be nasty and selfish, but is she a thief? When she is falsely accused of stealing Queen Clarion’s crown, she begins an investigation that leads her on a wild-goose chase to the far corners of the Home Tree. Will Vidia be able to clear her name in time?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "God's Promises for a Sensational Life",
        "Authors": "By Thomas Nelson Publishers",
        "Description": "Inspired by the 2002 theme for Women of Faith conferences, this collection compiles dynamic quotes spanning the wisdom of centuries. Each quote is accompanied by a parallel portion of Scripture, with an emphasis on the practical and spiritual experiences of today's women. This charming little book is a treasury of quotations and scriptures that demonstrate God's infinite mercy and grace for a woman's sensational life. A lovely gift of encouragement for any woman at any time of the year.",
        "Category": " Religion , Inspirational",
        "Publisher": "J Countryman Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Golden Wisdom (Golden Wisdom Timeless Inspirations)",
        "Authors": "By Natalie Walker Whitlock",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Developing Child: Using Jungian Type to Understand Children",
        "Authors": "By murphy, elizabeth",
        "Description": "Introduces parents and teachers to Jungian psychological type theory, reveals how personality develops in children, and suggests ways to help children of all types grow and develop their talent. Published by Consulting Psychologists Press, Inc., 3803 E. Bayshore Road, PO Box 10096, Palo Alto, CA 94303. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Psychology , Developmental , Child",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Walking Paris: Thirty Original Walks in and Around Paris",
        "Authors": "By Desmons, Gilles",
        "Description": "",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "Passport Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Black Dog of Fate: An American Son Uncovers His Armenian Past",
        "Authors": "By Balakian, Peter",
        "Description": "The first-born son of his generation, Peter Balakian grew up in a close, extended family, sheltered by 1950s and '60s New Jersey suburbia and immersed in an all-American boyhood defined by rock 'n' roll, adolescent pranks, and a passion for the New York Yankees that he shared with his beloved grandmother. But beneath this sunny world lay the dark specter of the trauma his family and ancestors had experienced--the Turkish government's extermination of more than a million Armenians in 1915, including many of Balakian's relatives, in the century's first genocide.In elegant, moving prose, Black Dog of Fate charts Balakian's growth and personal awakening to the facts of his family's history and the horrifying aftermath of the Turkish government's continued campaign to cover up one of the worst crimes ever committed against humanity. In unearthing the secrets of a family's past and how they affect its present, Black Dog of Fate gives fresh meaning to the story of what it means to be an American.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "LOVE KNOTS",
        "Authors": "By Flint, Mike (ILT) and Gordon, Lori Heyman",
        "Description": "Takes a humorous look at situations where couples frequently misunderstand each other, and points the way toward more meaningful communication",
        "Category": " Psychology , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "The Everything Get-A-Job Book",
        "Authors": "By Graber, Steven and Lipsman, Mark",
        "Description": "Provides information and advice on such topics as using the Internet to find a job, writing effective resumes and cover letters, using headhunters and employment agencies, and making the most of networking opportunities.",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The Schwarzbein Principle Cookbook",
        "Authors": "By Schwarzbein, Diana, Deville, Nancy, and Jaffe, Evelyn Jacob",
        "Description": "Dr. Schwarzbein teams up with acclaimed professional chef Evelyn Jacob to whip up 300 delicious, healing recipes that prove that eating the Schwarzbein way doesn’t have to be difficult, boring or fat-free! With easy-to-follow directions, tips and comprehensive nutritional breakdowns, the book offers healthy entrees and accompaniments for any meal, with delicacies like: breakfast burritos, mushroom-gorgonzola omelettes with walnuts, chicken saté with peanut sauce, crustless quiche, hot artichoke cheese dip, pecan-baked brie, lobster bisque, Asian shrimp, mint pesto chicken, beef stroganoff, Thai basil beef, barbecued spareribs and kielbasa with sauerkraut. Take a look at the also!",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Health Communications Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "This Side of Eternity",
        "Authors": "By McMillan, Rosalyn",
        "Description": "From the beloved author of The Flip Side of Sin, One Better, Blue Collar Blues, and the national bestseller Knowing comes a beautiful and evocative story of one family's struggle for survival amid the hope and trauma of the civil rights movement in Tennessee. In what promises to be her most memorable book to date, Rosalyn McMillan brings to life one of the most extraordinary chapters in American history.  Rich in the tradition of Southern storytelling, This Side of Eternity is the tale of an African-American family's determination to stay together and to survive in any way they can in a world of discrimination, limited opportunity, and unendurable poverty. With powerful, penetrating language and richly developed characters, McMillan deftly weaves historical events into a compelling, unforgettable saga reminiscent of Gone With the Wind.  When Anne Russell's father is killed in an accident on the job in the late 1960s, her family must survive on its own through labor strikes, civil rights protests, and a racial tension that permeates every aspect of their daily lives. Struggling with the explosive social issues around her and the inertia of a family unwilling to seize a better life, Anne begins to make it on her own and embody the proud, indefatigable spirit of those around her who would succeed in changing the world.  Anne grows to learn, however, that changing the world can often be easier than changing the people around you, including those you love most. As the years pass, and the lessons of the movement that so affected Anne's family begin to fade, Anne finds herself continually trying to hold everyone together, despite their ongoing attempts to break everything apart. As children grow into adults, and parents into grandparents, the struggle for freedom and opportunity remains as daunting and relevant as when Anne was a child. Just as she once fought to save her siblings from the doldrums of poverty, she must now do the same for her own children.  This Side of Eternity is a truly unforgettable book that shows the strength of faith and family against the backdrop of the African-American experience through the civil rights movement and beyond. Rosalyn McMillan's finest work yet, it is guaranteed to rank among the best and brightest African-American fiction being written today.",
        "Category": " Fiction , Literary",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Combat Syndrome X, Y and Z",
        "Authors": "By Holt, Stephen",
        "Description": "",
        "Category": "",
        "Publisher": "Wellness Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Faith Encounter: Experience the Ultimate with Jesus",
        "Authors": "By Myers, Bill and Ross, Michael",
        "Description": "",
        "Category": " Religion , Prayerbooks , Christian",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Sequoyah and the Cherokee Alphabet (Alvin Josephy's Biography Series of American Indians)",
        "Authors": "By Lewis, T. (ILT) and Cwiklik, Robert",
        "Description": "A biography of the Cherokee Indian who invented a method for his people to write and read their own language",
        "Category": "",
        "Publisher": "Silver Burdett Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Frogs, Toads, and Treefrogs (Complete Pet Owner's Manuals)",
        "Authors": "By Bartlett, Richard D. and Bartlett, Patricia Pope",
        "Description": "This manual includes detailed instructions for maintaining a proper terrarium, taking preventative measures against parasites and disease, ensuring a healthful diet for your amphibians, profiles of popular species, and more.",
        "Category": " Pets , Reptiles, Amphibians & Terrariums",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "The Prince of West End Avenue: A Novel",
        "Authors": "By Isler, Alan",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Escape",
        "Authors": "By Palmer, Laura and Jessop, Carolyn",
        "Description": "The dramatic first-person account of life inside an ultra-fundamentalist American religious sect, and one woman’s courageous flight to freedom with her eight children.When she was eighteen years old, Carolyn Jessop was coerced into an arranged marriage with a total stranger: a man thirty-two years her senior. Merril Jessop already had three wives. But arranged plural marriages were an integral part of Carolyn’s heritage: She was born into and raised in the Fundamentalist Church of Jesus Christ of Latter-Day Saints (FLDS), the radical offshoot of the Mormon Church that had settled in small communities along the Arizona-Utah border. Over the next fifteen years, Carolyn had eight children and withstood her husband’s psychological abuse and the watchful eyes of his other wives who were locked in a constant battle for supremacy.Carolyn’s every move was dictated by her husband’s whims. He decided where she lived and how her children would be treated. He controlled the money she earned as a school teacher. He chose when they had sex; Carolyn could only refuse—at her peril. For in the FLDS, a wife’s compliance with her husband determined how much status both she and her children held in the family. Carolyn was miserable for years and wanted out, but she knew that if she tried to leave and got caught, her children would be taken away from her. No woman in the country had ever escaped from the FLDS and managed to get her children out, too. But in 2003, Carolyn chose freedom over fear and fled her home with her eight children. She had $20 to her name.Escape exposes a world tantamount to a prison camp, created by religious fanatics who, in the name of God, deprive their followers the right to make choices, force women to be totally subservient to men, and brainwash children in church-run schools. Against this background, Carolyn Jessop’s flight takes on an extraordinary, inspiring power. Not only did she manage a daring escape from a brutal environment, she became the first woman ever granted full custody of her children in a contested suit involving the FLDS. And in 2006, her reports to the Utah attorney general on church abuses formed a crucial part of the case that led to the arrest of their notorious leader, Warren Jeffs.",
        "Category": " Religion , Cults",
        "Publisher": "Broadway",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Architecture--San Francisco: The guide",
        "Authors": "By Woodbridge, John and Woodbridge, Sally",
        "Description": "",
        "Category": " Architecture , General",
        "Publisher": "distributed ... by Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Leadership Jazz: The Essential Elements of a Great Leader",
        "Authors": "By De Pree, Max",
        "Description": "Leadership in the workplace, says Max DePree, is like playing jazz; it's more an art than a science. Today's successful managers are attuned to the needs and ideas of their followers and even step aside at times to be followers themselves. As a result, they spark vitality and productivity from their work force. They culivate communication and spontaneity, diversity and creativity, and the unique potential of every person in the organization to contribute to the success of the team. In Leadership Jazz you'll learn -How to hold people accountable but still give them space to make mistakes. - How to balance the needs of your employees with those of the company. - How to inspire change and innovation and maintain a sense of stability. - How to practice the art of delegation. - How to work constructively with creative people. - How to assess candidates for senior positions. - And much more!",
        "Category": " Business & Economics , Motivational",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Tartuffe",
        "Authors": "By Moliere",
        "Description": "",
        "Category": " Literary Criticism , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1974"
        }
    },
    {
        "Title": "Elizabeth Costello: Fiction",
        "Authors": "By Coetzee, J M",
        "Description": "J.M. Coetzee's latest novel, The Schooldays of Jesus, is now available from Viking. Late Essays: 2006-2016 will be available January 2018. Since 1982, J. M. Coetzee has been dazzling the literary world. After eight novels that have won, among other awards, two Booker Prizes, and most recently, the Nobel Prize, Coetzee has once again crafted an unusual and deeply affecting tale. Told through an ingenious series of formal addresses, Elizabeth Costello is, on the surface, the story of a woman's life as mother, sister, lover, and writer. Yet it is also a profound and haunting meditation on the nature of storytelling.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "French Picture Word Book",
        "Authors": "By Steadman, Barbara (ILT) and Cirker, Hayward (EDT)",
        "Description": "Here's a pleasant and effective way for students of French to build and strengthen vocabulary skills. The book consists of 15 carefully rendered scenes (14 double-page and one single-page), each devoted to a different theme or topic: Au Zoo (At the Zoo), À la Ferme (On the Farm), La Chambre de Jeune Fille (Girl's Bedroom), La Chambre de Garçon (Boy's Bedroom), La Salle de Classe (Classroom), La Salle de Séjour (Living Room), La Salle de Bain (Bathroom), Au Dîner (At Dinner), Le Supermarché, (Supermarket), À la Plage (At the Beach), and five more.Each illustration contains dozens of common objects, clearly labeled in French. By studying the illustrations, students can learn over 500 words for common household items, clothing, foods, vehicles, furniture, names of animals, parts of the body, types of stores and public buildings, and many more.To help reinforce words and meanings, all the scenes in this book are ideal for coloring. In addition, a complete list of French words (with definite articles) and English translations will be found at the back of the book. The result is an attractive and useful language resource that will appeal to any student of basic French, child or adult.",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Freud and Man's Soul: An Important Re-Interpretation of Freudian Theory",
        "Authors": "By Bettelheim, Bruno",
        "Description": "Has Sigmund Freud been seriously misunderstood? The author of The Uses of Enchantment argues that mistranslation has distorted Freud's work in English and led students to see a system intended to cooperate flexibly with individual needs as a set of rigid rules to be applied by external authority. This provocative argument cuts through the myths to reveal a greater, more compassoinate and also far more disturbing figure.\"VITAL...an eloquent attempt to reclaim Freud's reputation in America.\" —THE NEW YORK TIMES \"Lucid and provocative.\" —THE LOS ANGELES TIMES BOOK REVIEW",
        "Category": " Psychology , Psychopathology , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "The Code: The Five Secrets of Teen Success",
        "Authors": "By Asgedom, Mawi",
        "Description": "Having been raised in a civil war in his native east Africa and then moved to a refuge camp in the Sudan, Mawi Asgedom came to America where he struggled with poverty while trying to make his dreams come true--graduating from Harvard in 1999 on a full-scholarship and becoming an inspiring lecturer throughout the country. Teacher's Guide available. Simultaneous. 15,000 first printing.",
        "Category": " Young Adult Nonfiction , Social Topics , Self-Esteem & Self-Reliance",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "America's Bubble Economy: Profit When It Pops",
        "Authors": "By Wiedemer, David, Wiedemer, Robert A., Spitzer, Cindy, and Janszen, Eric",
        "Description": "America’s Bubble Economy is the first book to focus on several simultaneous financial bubbles that are interacting to temporarily boost—and ultimately threaten—the United States and world economies. Filled with expert analysis and straight talk, this book will show you how to turn the coming economic transformation into a once-in-a-lifetime wealth-building opportunity.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Stay With Me",
        "Authors": "By Freymann-Weyr, Garret",
        "Description": "Sixteen-year-old Leila Abranel was born some twenty years after her sisters. Her elegant sisters from her father’s first marriage have lives full of work, love affairs, and travel. Leila doesn’t know either of them very well, but she loves hearing about them—details of Rebecca’s ruined marriage, Clare’s first job, and the strings of unsuitable boyfriends. When Rebecca kills herself, Leila wants to know why. She starts by spending time with Clare and finally comes to know her as a person instead of a story. With Clare’s reluctant help, Leila tracks down Rebecca’s favorite places and tries to find her sister’s friends. Along the way, Leila meets Eamon. Eamon is thirty-one and writes for television. He thinks Leila is beautiful and smart, but he does not, he tells her, date teenagers. And yet, the months go by and Leila turns seventeen and learns that you can love someone you are not dating. Maybe letting Eamon love her back is a mistake. Maybe she’ll never know why Rebecca did what she did. Maybe, Leila, decides, most people have a hard time figuring out which way is left or knowing when to let go and when to stay.",
        "Category": " Young Adult Fiction , Family , Siblings",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "My Life and Dr. Joyce Brothers: A Novel in Stories",
        "Authors": "By Cherry, Kelly",
        "Description": "The narrator, a victim of childhood incest, looks back on her relationships with men, her brother, and the male psychiatrists who have treated her",
        "Category": " Fiction , Literary",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "The Vanishing Act Of Esme Lennox",
        "Authors": "By O'Farrell, Maggie",
        "Description": "In the middle of tending to the everyday business at her vintage-clothing shop and sidestepping her married boyfriend’s attempts at commitment, Iris Lockhart receives a stunning phone call: Her great-aunt Esme, whom she never knew existed, is being released from Cauldstone Hospital—where she has been locked away for more than sixty-one years. Iris’s grandmother Kitty always claimed to be an only child. But Esme’s papers prove she is Kitty’s sister, and Iris can see the shadow of her dead father in Esme’s face. Esme has been labeled harmless—sane enough to coexist with the rest of the world. But she's still basically a stranger, a family member never mentioned by the family, and one who is sure to bring life-altering secrets with her when she leaves the ward. If Iris takes her in, what dangerous truths might she inherit? A gothic, intricate tale of family secrets, lost lives, and the freedom brought by truth, The Vanishing Act of Esme Lennox will haunt you long past its final page.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "The Sea Lady",
        "Authors": "By Drabble, Margaret.",
        "Description": "Humphrey Clark and Ailsa Kelman spent a summer together as children in Ornemouth, a town by the gray North Sea. Now, as they journey back to receive honorary degrees from a new university there—Humphrey on the train, Ailsa flying—they take stock of their lives, their careers, and their shared personal entanglements, romantic and otherwise. Humphrey is a successful marine biologist, happiest under water, but now retired; Ailsa, scholar and feminist, is celebrated for her pioneering studies of gender. Their mutual pasts unfold in an exquisite portrait of English social life in the latter half of the twentieth century.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Nonverbal Selling Power",
        "Authors": "By Gschwandtner, Gerhard and Garnett, Pat",
        "Description": "",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "Taking the Wrap : A Mandy Dyer Mystery",
        "Authors": "By Johnson, Dolores",
        "Description": "In her seventh adventure, Denver's intrepid dry-cleaner/sleuth, Mandy Dyer, encounters a baffling case of mistaken identity---or is it? After dining at a local mountaintop restaurant, Mandy's friend Laura discovers that someone has taken her coat and left another in its place. The only clue to the owner's identity is an unfamiliar dry-cleaning mark. Mandy's casual inquiries turn serious when a dead body is discovered dressed in Laura's missing coat. An investigation of the remote and forbidding crime scene puts Mandy right in the path of a mysterious mountain ambush and a very slippery foe.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "ULTIMATE ESPRESSO MACHINE COOKBOOK",
        "Authors": "By Lacalamita, Tom, Metz, Simon (PHT), and Davis, Laurie (ILT)",
        "Description": "The author of The Ultimate Pasta Machine Cookbook presents a full-color guide to the automatic home espresso maker, offering more than eighty-five recipes for coffee-based drinks, snacks, and sweets. 25,000 first printing.",
        "Category": " Cooking , Beverages , Coffee & Tea",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "The teaching of bioethics",
        "Authors": "By Commission on the Teaching of Bioethics",
        "Description": "",
        "Category": "",
        "Publisher": "The Hastings Center, Institute of Society, Ethics and the Life Sciences",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Sacred Dust",
        "Authors": "By Hill, David",
        "Description": "To an outsider, Prince George County, Alabama, would appear to be an idyllic, peaceful community of neighbors who have known one another their entire lives. For those who have the courage to look deeper, one scratch of the surface reveals a place of fierce loyalties, submerged passions and a violence reserved for anyone foolish enough to defy a time-honored way of life. At the center of this community - and of this astonishing novel - is Rose of Sharon. Cut off by the death of her son and by her own fears from the only life she ever imagined, Rose has become numb to her neighbors' petty jealousies and to the casual brutalities of her husband, Dashnell.As she goes about the business of making a home for her husband and caring for a mother whose disappointment in her permeates every frail connection they achieve, Rose observes life around her with a merciless and razor-sharp eye. She sees the legacy of hate that shapes the lives of her family and friends in their small southern town; the men whose misplaced pride finds its only solace in occasional eruptions of savagery; and the women who ward off loneliness and desperation with their hurtful gossip. Rose privately opposes the things she sees, but keeping the secrets of Prince George County has become second nature. Until one night when those secrets are shattered by a single gunshot and Rose makes a decision from which there is no turning back. With one life-altering act, Rose finally dares to tell the truth - and earns her one chance at redemption.",
        "Category": " Fiction , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Overcoming Depression: Its Causes and How to Overcome It",
        "Authors": "By Caroline Shreeve",
        "Description": "Discusses the symptoms of depression, describes the various types of therapy, and offers guidance on dealing with stress",
        "Category": "",
        "Publisher": "Thorsons Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Byrne (Burgess, Anthony)",
        "Authors": "By Burgess, Anthony",
        "Description": "When Anthony Burgess died in 1993 he left the complete Byrne, a novel in epic verse. This is the first American publication.Byrne tells the astonishing story of an Irish artist who, in the early years of this century, goes rapidly to the bad, bedding and abandoning women everywhere, debasing his talents as a composer and painter, and finally ending up within Hitler's Third Reich, at which point he vanishes. After his disappearance, the story passes to his twin sons, one a doubting priest, the other suffering from a debilitating disease, who move across the troubled face of contemporary Europe before encountering their father in one final apocalyptic confrontation.",
        "Category": " Fiction , Literary",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Comprehensive Book of Gardening",
        "Authors": "By Wright, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Not Avail",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Deviant Ways",
        "Authors": "By Mooney, Chris",
        "Description": "A former FBI profiler whose life had been shattered by a psychopath's unspeakable crime, Jack Casey has started over as a detective in a posh coastal community outside Boston, but his new life is threatened by the arrival of the Sandman, a demented killer who stalks entire families and neighborhoods, who uses hidden cameras to track his crimes and his new adversary, Jack. A first novel.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Purpose Driven Life Selected Thoughts and Scriptures for the Graduate",
        "Authors": "By Warren, Rick",
        "Description": "Based on the New York Times bestseller, The Purpose Driven® Life, this keepsake book provides a priceless reminder for graduates of the bountiful life God has planned for them through understanding His purpose for their life. Carefully selected by author Rick Warren, the thoughts and Scriptures inside these pages will help new graduates simplify future decisions, develop a deeper meaning for their life, and most importantly, prepare them for eternity. \"Timeless, profound, compelling, and transforming, The Purpose Driven® Life is a priceless gift for everyone who wants to know their purpose and fulfill their destiny.\" Bruce Wilkinson, Author, The Prayer of Jabez.",
        "Category": " Religion , Spirituality",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "American Indians (Chicago History of American Civilization)",
        "Authors": "By Hagan, William T.",
        "Description": "",
        "Category": "",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "Niv Handy Concordance",
        "Authors": "By Kohlenberger, John R., III and Goodrick, Edward W.",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "The Poyson Garden (Elizabeth I Mysteries, Book 1)",
        "Authors": "By Harper, Karen",
        "Description": "Living in exile in the English countryside, the twenty-five-year old Princess Elizabeth awaits her fate during the waning years of her ill and childless half sister's reign. Despite an occasional truce, there has always been bad blood between Queen Mary and the princess since Elizabeth's mother, Anne Boleyn, replaced Mary's mother, Catherine of Aragon, in the heart of King Henry VIII. Elizabeth has already survived imprisonment in the Tower of London after a rebellion is raised in her name, and now the half sisters live in an uneasy detente that is threatened by the arrival of a murderer who moves too easily through the secret society of Queen Mary's court.Little does Elizabeth know that in the autumn of 1558, she will be called upon to explore not only England's rural heartland, but also her own heart. At great risk to her person and her nation's future, she plunges herself into an investigation of a multiple murder, where she might very well become a master poisoner's next victim.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "A Hometown Christmas",
        "Authors": "By Hogan, Julie K.",
        "Description": "",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Ideals Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Great Events of the 20th Century",
        "Authors": "By Time Magazine (EDT)",
        "Description": "With more than two hundred incredible photographs, this intriguing reference chronicles the pivotal events of the past one hundred years, looking at the music, art, science, warfare, politics, disasters, tragedies, and victories that touched our lives and changed the face of humankind.",
        "Category": " History , Modern , 20th Century",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "With Malice Toward None: The Life of Abraham Lincoln",
        "Authors": "By Stephen Oates",
        "Description": "Presents a portrait of Lincoln as an uncommonly complex man of compassion and ambition, honesty and political acumen, and wit and morbid melancholy, using dramatic narration and graphic scenes to illuminate all sides and characteristics of a remarkable man. Bibliogs",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Betty Crocker's New American Cooking",
        "Authors": "By Crocker, Betty",
        "Description": "Designed to reflect the new taste for lighter, more natural and wholesome foods, this cookbook provides more than 350 kitchen-tested, step-by-step recipes",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Elephants on Acid: And Other Bizarre Experiments (Harvest Original)",
        "Authors": "By Boese, Alex",
        "Description": "When Tusko the Elephant woke in his pen at the Lincoln Park Zoo on the morning of August 3, 1962, little did he know that he was about to become the test subject in an experiment to determine what happens to an elephant given a massive dose of LSD. In Elephants on Acid, Alex Boese reveals to readers the results of not only this scientific trial but of scores of other outrageous, amusing, and provocative experiments found in the files of modern science. Why can&apos;t people tickle themselves? Would the average dog summon help in an emergency? Will babies instinctually pick a well-balanced diet? Is it possible to restore life to the dead? Read Elephants on Acid and find out!",
        "Category": " Reference , Curiosities & Wonders",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Baseball's Book of Firsts",
        "Authors": "By Garner, Carolyn",
        "Description": "",
        "Category": "",
        "Publisher": "World Pubns",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Creative Cuisine - Italian Cooking",
        "Authors": "By Ferguson, Judith",
        "Description": "",
        "Category": "",
        "Publisher": "World Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Christmas With Southern Living Cookbook",
        "Authors": "By Southern Living",
        "Description": "Shares holiday recipes for appetizers, breads, cakes, pies, pastries, cookies, candies, and deserts",
        "Category": " Cooking , Holiday",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The Indian Bride (Inspector Sejer)",
        "Authors": "By Fossum, Karin and Barslund, Charlotte (TRN)",
        "Description": "Karin Fossum's fourth chilling crime novel finds Inspector Sejer on the hunt for a brutal killer in a good town gone bad. When long-time bachelor Gunder Jomann goes to India for two weeks and comes home married, the town of Elvestad is stunned. Then, on the day his bride is supposed to arrive, the battered body of a woman is found on the outskirts of town. The \"good people of Elvestad\" can't believe that anyone among them could be capable of such a crime. But in his quiet way, Inspector Konrad Sejer understands that no one is completely innocent'not the café owner who knows too much, the girl who wants the attention that comes with being a witness, or the bodybuilder with no outlet for his terrible strength.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Science Projects for the Intermediate Grades",
        "Authors": "By Schneider, Michael S.",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Fearon Teacher AIDS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1971"
        }
    },
    {
        "Title": "The Chinese Emperor",
        "Authors": "By Levi, Jean",
        "Description": "In ancient China, where laws, the bureaucracy, espionage, and mind-control are all founded on Taoist principles, the first August Emperor's pride swells as his power grows and in a search for immortality he becomes obsessed to the brink of madness",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    }
]