[
    {
        "Title": "The Small House at Allington (The World's Classics)",
        "Authors": "By Trollope, Anthony",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "Intense Moments with the Savior: Learning to Feel",
        "Authors": "By Gire, Ken",
        "Description": "",
        "Category": "",
        "Publisher": "Billy Graham Evangelistic Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Presidents Speak: The Inaugural Addresses of the American Presidents from Washington to Clinton (Henry Holt Reference Book)",
        "Authors": "By Lott, Davis Newton and United States President (COR)",
        "Description": "A complete, annotated anthology of US presidential inaugural addresses. Each speech is annotated with details of national and world history of the time period, explanations of literary and biblical references, and personal notes on each president. Contains biographical profiles of the presidents, including presidents who weren't inaugurated. Appendices include the Declaration of Independence, the Articles of Confederation, and the Constitution. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , United States , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Running to the Mountain: A Midlife Adventure",
        "Authors": "By Katz, Jon",
        "Description": "Jon Katz, a respected journalist, father, and husband, was turning fifty. His writing career had taken a dubious turn, his wife had a demanding career of her own, his daughter was preparing to leave home for college, and he had become used to a sedentary lifestyle. Wonderfully witty and insightful, Running to the Mountain chronicles Katz's hunger for change and his search for renewed purpose and meaning in his familiar world.Armed with the writings of Thomas Merton and his two faithful Labradors, Katz trades in his suburban carpool-driving and escapes to the mountains of upstate New York. There, as he restores a dilapidated cabin, learns self-reliance in a lightning storm, shares a bottle of Glenlivet with unexpected ghosts, and helps a friend prepare for fatherhood, he confronts his lifelong questions about spirituality, mortality, and his own self-worth. He ultimately rediscovers a profound appreciation for his work, his family, and the beauty of everyday life--and provides a glorious lesson for us all.",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Plumbing (Home repair and improvement)",
        "Authors": "By Time-Life Books",
        "Description": "Close-up, cutaway, and exploded diagrams and step-by-step instructions guide the homeowner in unclogging drains, repairing faucets and toilets, working with pipe, and updating indoor and outdoor plumbing",
        "Category": "",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Basic Wiring (Home Repair and Improvement)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Barron's Math Workbook for the Sat I",
        "Authors": "By Leff, Lawrence S.",
        "Description": "",
        "Category": " Mathematics , General",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Mary's Prayers and Martha's Recipes",
        "Authors": "By Tenney, Tommy",
        "Description": "",
        "Category": " Religion , Meditations",
        "Publisher": "Destiny Image Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "A Hero For Our Time: An Intimate Story of the Kennedy Years",
        "Authors": "By Martin, Ralph G.",
        "Description": "A portrait of John and Jacqueline Kennedy profiles the Kennedy family, their marriage, JFK's political career, and the era that they dominated",
        "Category": " History , General",
        "Publisher": "Fawcett Crest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Learn Italian the Fast and Fun Way/With Pull-Out Bilingual Dictionary (Learn the Fast & Fun Way)",
        "Authors": "By Danesi, Marcel",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Loving Your Partner Without Losing Your Self",
        "Authors": "By Beveridge, Martha Baldwin",
        "Description": "Many men and women enter relationships with high hopes and romantic passion, only to find themselves feeling angry, hurt, disappointed, and frustrated. They may begin to doubt whether they’ll ever free themselves from painful patterns and rediscover their passion. The majority of relationship books focus on how partners interact. But the advice offered is often impossible to follow because it ignores two essential issues that each mate must address and master &#151; personal development and boundary healing. Martha Beveridge guides readers toward trusting, committed relationships that allow room for each partner’s individuality.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Hunter House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "When I'm in His Presence: Devotional Thoughts on Worship for Women (Inspirational Library)",
        "Authors": "By Donihue, Anita Corrine",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Baseball Top 10",
        "Authors": "By Buckley, James and Fischer, David",
        "Description": "The best fact-filled quiz book on baseball. Baseball Top 10 is a compendium of more than 225 Top 10 lists covering every aspect of America's National Pastime. Find out what are the... most home runs by a switch hitter, most strikeouts in a career, highest career batting averages by position, most Gold Gloves won for each position, highest percentage of Hall of Fame votes received, recent champions of international leagues, most recent All-Star Game MVPs, longest last names in history, recent college and Olympic champions, most career World Series home runs, and more than 200 others! The categories include... player, teams, single-season, career, single-game, decade, pitching, batting, fielding, home runs, stolen bases, World Series, ballparks, broadcasting, international, and dozens more. Includes statistics from the 2001 MLB regular season and 2001 World Series.",
        "Category": " Juvenile Nonfiction , Sports & Recreation , Baseball & Softball",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Essential Dracula",
        "Authors": "By Haworth-Maden, Clare",
        "Description": "The villianous count's inglorious past is chronicled in an informative, finely illustrated survey of his materializations in myth, fact, and fiction--including Bram Stoker's brilliant novel-- and his portrayal by the likes of Bela Lugosi and Christopher Lee.",
        "Category": "",
        "Publisher": "Crescent Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Juliet, Naked: a novel",
        "Authors": "By Hornby, Nick",
        "Description": "From the beloved New York Times– bestselling author, a quintessential Nick Hornby tale of music,   superfandom, and the truths and lies we tell ourselves about life and love. Annie loves Duncan—or   thinks she does. Duncan loves Annie, but then, all of a sudden, he doesn’t. Duncan really loves Tucker Crowe, a   reclusive Dylanish singer-songwriter who stopped making music ten years ago. Annie stops loving Duncan, and   starts getting her own life. In doing so, she initiates an e-mail correspondence with Tucker, and a   connection is forged between two lonely people who are looking for more out of what they’ve got. Tucker’s been   languishing (and he’s unnervingly aware of it), living in rural Pennsylvania with what he sees as his one hope for   redemption amid a life of emotional and artistic ruin—his young son, Jackson. But then there’s also the new material   he’s about to release to the world: an acoustic, stripped-down version of his greatest album, Juliet—  entitled, Juliet, Naked. What happens when a washed-up musician looks for another chance?   And miles away, a restless, childless woman looks for a change? Juliet, Naked is a powerfully engrossing,   humblingly humorous novel about music, love, loneliness, and the struggle to live up to one’s promise.    Watch a Video",
        "Category": " Fiction , Literary",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Animals of the World Jigsaw Book (Jigsaw Books)",
        "Authors": "By Fleming, Garry",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Five Mile Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Planning Programs for Adult Learners: A Practical Guide for Educators, Trainers, and Staff Developers (Jossey-Bass Higher and Adult Education Series)",
        "Authors": "By Caffarella, Rosemary S.",
        "Description": "A practical guide to planning adult educational programs, drawing on classic and current literature. Covers planning models, identifying program ideas, developing objectives, evaluation plans, staffing, budgets and marketing, coordinating facilities, and preparing reports. Includes checklists, worksheets, and chapter highlights and exercises. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Education , Adult & Continuing Education",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.81",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Schaum's Outline of Theory and Problems of Probability and Statistics (Schaum's outline series in mathematics)",
        "Authors": "By Spiegel, Murray R.",
        "Description": "",
        "Category": " Mathematics , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "Spanish For Gringos",
        "Authors": "By Meisel, Paul (ILT), Harvey, William C., and Meisel, Paul",
        "Description": "Today it's more important than ever for English-speakers to have some working knowledge of Spanish. In this book, author William Harvey shows that you learn Spanish most easily when you understand the \"message\"--not when you memorize grammar rules. This informal self-teaching course is for you if you lack the time or patience for traditional language training. You'll learn key Spanish phrases and get tips that will help you comprehend the spoken language. You'll also learn to pronounce words and phrases so that a Latin-American can understand you.",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Approval Addiction",
        "Authors": "By Meyer, Joyce",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Faith",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "On the Surface of Things",
        "Authors": "By Frankel, Felice and Whitesides, G. M.",
        "Description": "How many electrons can dance on the head of a pin? What do DNA strands look like when chased by an electrical charge? Using innovative photographic technology, MIT artist-in-residence Felice Frankel finds startling abstract beauty in the undulations of liquid crystal film, the gymnastics of plastic microstructures, the migratory trudge of bacteria, and other scientific wonders.What do these experiments teach us, and how might such scientific innovations affect our world? A fascinating text by world-renowned Harvard chemistry professor George M. Whitesides explains each photograph, describing why and how each of these phenomena occur.",
        "Category": " Science , Physics , Optics & Light",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Learn and Play in the Garden",
        "Authors": "By Herd, Meg and Elton, Andrew (PHT)",
        "Description": "A variety of hands-on activities provides young readers with a fun-filled introduction to natural science and horticulture in a guide that includes instructions for planting and cultivating vegetables, creating an herb garden, making a scarecrow, and more. Original.",
        "Category": "",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Daughters of Painted Ladies: America's Resplendent Victorians",
        "Authors": "By Elizabeth Pomada, Michael Larsen",
        "Description": "",
        "Category": "",
        "Publisher": "E P Dutton",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Jacoby on Bridge",
        "Authors": "By Jacoby, James",
        "Description": "A handbook on bridge offers tips on bidding and strategy and discusses sample hands",
        "Category": " Games , Card Games , Bridge",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Decorating Details: Projects and Ideas for a More Comfortable, More Beautiful Home",
        "Authors": "By Stewart, Martha and Martha Stewart Living (EDT)",
        "Description": "A companion volume to the authors' popular How to Decorate offers elegant, do-it-yourself projects for putting the finishing touches on one's dream home, filled with three hundred full-color photographs. Original. 125,000 first printing.",
        "Category": " House & Home , Decorating & Furnishings",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "In Search of Bible Trivia Vol. 2/Believers Edition",
        "Authors": "By Phillips, Bob",
        "Description": "",
        "Category": "",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "The Beloved: Reflections on the Path of the Heart (Compass)",
        "Authors": "By Gibran, Kahlil and Walbridge, John (TRN)",
        "Description": "Exquisite writings on love, marriage, and the spiritual union of souls add a fresh dimension to our understanding of the philosophy of love and the transformation of one's life through its all-encompassing power.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Wicked Games: A Jane Lawless Mystery (Dead Letter Mysteries)",
        "Authors": "By Hart, Ellen",
        "Description": "Jane Lawless has worked hard to make her Minneapolis restaurant a success, and she's finally reaping the financial rewards. Yet even the demands and excitement of being a popular restauranteurs and living the good life don't bring the same satisfaction they once did. Jane needs a bigger challenge. A mystery to solve. The thrill of the chase...When Jane rents her quaint third-story apartment to a new tenant, children's book author Elliot Beauman, she unwittingly opens the door to a sinister, decades-old mystery that has been waiting patiently to unfold--in her own house. Meanwhile, Jane assist a detective in tracking down clues about her new neighbor, Patricia, whose husband died mysteriously. Patricia is eager to become friends, or more...even though she knows Jane is immersed in a long-distance relationship with the attractive but secretive Dr. Julia Martinsen. little does Jane know that a strange man upstairs, an attractive neighbor, and a volatile love affair are just the beginning of her problems.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St. Martin's Dead Letter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Moodswing: The Third Revolution in Psychiatry",
        "Authors": "By Ronald R. Fieve",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Song of the Magdalene",
        "Authors": "By Napoli, Donna Jo",
        "Description": "Chosen as an ALA Best Book for Young Adults and an American Bookseller Pick of the List, a novel portrays the childhood and youth of Mary Magdalene, darkened by epilepsy and brightened by love. Reprint.",
        "Category": " Young Adult Fiction , Religious , General",
        "Publisher": "Point",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "One with the Night (The Companion Series)",
        "Authors": "By Squires, Susan",
        "Description": "Jane Blundell’s keen intellect and wit have always set her apart from her marriage-minded peers. But such differences are nothing compared to the change that comes upon her when she is infected by a blood sample in her father’s laboratory. Suddenly, her veins resonate with a terrifying, exhilarating power. Dr. Blundell takes Jane to the Scottish highlands where she collides with the only man who can understand her hunger—and slake her unending desire… Callan Kilkenny has returned to England from Marrakech, still filled with self-loathing at the deeds he committed in the name of a beautiful, depraved vampire. Now that he has tracked down Dr. Blundell in hopes of a cure he has also found a kindred spirit in Jane. Her passion and her blood calls to Callan, fueling a carnal need that shocks them both with its intensity. But others have come in search of the cure, too…for reasons that are sinister and deadly. And to save Jane and the rest of their kind, Callan must risk everything—even his last chance at redemption…",
        "Category": " Fiction , Romance , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Tempest (The Arden Shakespeare)",
        "Authors": "By Shakespeare, William and Kermode, Frank (EDT)",
        "Description": "",
        "Category": " Drama , Shakespeare",
        "Publisher": "Routledge Kegan & Paul",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1962"
        }
    },
    {
        "Title": "Jolly Jokes for Older Folks",
        "Authors": "By Phillips, Bob",
        "Description": "Bestselling author Bob Phillips has compiled yet another great collection of quirky quips and zany zingers that will charm and delight the young-at-heart and everyone who appreciates a little laughter in their lives.Stories of wacky waiters, loony lawyers, and daffy doctors will entertain readers while providing conversation starters for coffee or other get-togethers.An exasperated salesman abandoned his car in a no-parking zone and left this note:\"I've circled this block 20 times. I have an appointment and must keep it or lose my job. Forgive us our trespasses.\"Upon returning, he found this note:\"I've circled this block 20 years. If I don't give you a ticket, I'll lose my job. Lead us not into temptation.\"Patient: Doctor, doctor, I have a serious memory problem. I can't remember a thing.Doctor: How long have you had this problem?Patient: What problem?Alphabetized so readers can find just the right joke to suit their fancy, Jolly Jokes for Older Folks provides lighthearted moments for everyone who's been around long enough to laugh at themselves and others.",
        "Category": " Humor , Form , Jokes & Riddles",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The movies;: The sixty-year story of the world of Hollywood and its effect on America, from pre-nickelodeon days to the present,",
        "Authors": "By Griffith, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "8.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Message and Existence: Introduction to Christian Theology",
        "Authors": "By Gilkey, Langdon",
        "Description": "",
        "Category": "",
        "Publisher": "Seabury",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "People: Seventy-Five Years of Oscar Style",
        "Authors": "By People Magazine (New York, N. Y.) (EDT)",
        "Description": "A fashion guide to the Oscars looks back on seventy-five years of glitz, glamour, and gauche, focusing on the dresses and disasters that have garnered day-after headlines for three quarters of a century. 40,000 first printing.",
        "Category": " Performing Arts , Film , General",
        "Publisher": "People Book",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Paleo Diet for Athletes: A Nutritional Formula for Peak Athletic Performance",
        "Authors": "By Friel, Joe and Cordain, Loren",
        "Description": "Loren Cordain, Ph.D., follows his success of The Paleo Diet with the first book ever to detail the exercise-enhancing effects of a diet similar to that of our Stone Age ancestors.When The Paleo Diet was published, advocating a return to the diet of our ancestors (high protein, plenty of fresh fruits and vegetables), the book received brilliant reviews from the medical and nutritional communities. Jennie Brand-Miller, coauthor of the bestselling Glucose Revolution, called it \"without a doubt the most nutritious diet on the planet.\" Doctors Michael and Mary Dan Eades, authors of Protein Power, said, \"We can't recommend The Paleo Diet highly enough.\"Now Dr. Cordain joins with USA triathlon and cycling elite coach Joe Friel to adapt the Paleo Diet to the needs of athletes. The authors show:o Why the typical athletic diet (top-heavy with grains, starches, and refined sugars) is detrimental to recovery, performance, and healtho How the glycemic load and acid-base balance impact performanceo Why consumption of starches and simple sugars is only beneficial in the immediate post-exercise periodAt every level of competition, The Paleo Diet for Athletes can maximize performance in a range of endurance sports.",
        "Category": " Sports & Recreation , Training",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Living Language  German All the Way Manual: Learn at Home or On The Go",
        "Authors": "By Lasting, Ingeborg and Singer, Heidi, Ph.D.",
        "Description": "",
        "Category": "",
        "Publisher": "Living Language",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Russia, Belarus & Ukraine (Insight Guides)",
        "Authors": "By Hutchings, Jane",
        "Description": "A travel guide intended for general readers, this updated reprint originally published in 1999 is a collaboration of personnel from Insight Guides and the Discovery Channel. It introduces history, culture, and notable places, and offers tips for traveling along with recommendations on food, lodging, language, nightlife, and shopping, as well as cultural coverage of the women of Russia, the mafia, religion, art, literature, music, freedom of speech, and film. Illustrated with abundant color photos and maps. Annotation ©2006 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Travel , Russia",
        "Publisher": "Insight Guides",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Secret Cardinal",
        "Authors": "By Grace, Tom",
        "Description": "Inspired by true events, masterful storyteller Tom Grace delivers his most provocative novel yet. In The Secret Cardinal, ex-Navy SEAL Nolan Kilkenny returns in an adventure that races from the grandeur of the Vatican across the vastness of Asia, ultimately involving China, the Mafia, and the conclave of cardinals that will elect the next pope.When Kilkenny is invited to Rome to consult on the functioning of the Vatican Library, he is still grieving the death of his wife and son, and welcomes the distraction of the seemingly simple assignment. But Pope Leo XIV has a startlingly different task in mind for him. In a private audience, Kilkenny learns of an unreported atrocity committed against the underground Church in China and its link to Yin Daoming, the long-imprisoned Bishop of Shanghai who has served thirty years of a life sentence in a Chinese laogai for refusing to renounce the Church of Rome. The pope wants Yin free and asks Kilkenny to devise a plan to accomplish this ostensibly impossible task.With help from the U.S. president, American Special Forces, and the CIA, Kilkenny assembles a team of ten men and one woman that will use some of the most advanced weapons, aircraft, and computer technology to execute this extraordinary mission.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Vanguard Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Outwitting History: The Amazing Adventures of a Man Who Rescued a Million Yiddish Books",
        "Authors": "By Lansky, Aaron",
        "Description": "“Incredible . . . Inspiring . . . Important.” —Library Journal, starred review “A marvelous yarn, loaded with near-calamitous adventures and characters as memorable as Singer creations.” —The New York Post      “What began as a quixotic journey was also a picaresque romp, a detective story, a profound history lesson, and a poignant evocation of a bygone world.” —The Boston Globe “Every now and again a book with near-universal appeal comes along: Outwitting History is just such a book.” —The Sunday Oregonian As a twenty-three-year-old graduate student, Aaron Lansky set out to save the world’s abandoned Yiddish books before it was too late. Today, more than a million books later, he has accomplished what has been called “the greatest cultural rescue effort in Jewish history.” In Outwitting History, Lansky shares his adventures as well as the poignant and often laugh-out-loud stories he heard as he traveled the country collecting books. Introducing us to a dazzling array of writers, he shows us how an almost-lost culture is the bridge between the old world and the future—and how the written word can unite everyone who believes in the power of great literature.A Library Journal Best Book A Massachusetts Book Award Winner in Nonfiction An ALA Notable Book",
        "Category": " Antiques & Collectibles , Books",
        "Publisher": "Algonquin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Code Name: Princess: A Novel (SEAL and Code Name)",
        "Authors": "By Skye, Christina",
        "Description": "When a beautiful hotel investigator teams up with an irresistible Navy SEAL, going undercover could take them over the top . . .  Two FBI agents are dead. A top-secret government lab animal has been stolen. Now Hawk MacKenzie just walked in on a naked woman in his hotel shower. She says she’s royalty and has the attitude to match.  Whether this arousing female is a true blue-blood or not, the combat-trained Navy SEAL isn’t letting her out of his sight.Actually a hotel investigator in disguise, Jess Mulcahey can’t believe she’s being held against her will by this gorgeous commando who’s about to blow her cover. Lucky for her, she’s good at narrow escapes. But just when she hits the road, dodging bullets and outwitting cold-blooded pursuers, her luck bottoms out . . . and Hawk is her only hope of protection. A few stolen hours in a stalled elevator show Jess a different, more sensual side to the hard-edged SEAL. Now the two are closing in on their missing government secrets and trying hard to ignore their memories. . . . But they’re about to discover that the most dangerous revelations come from an unguarded heart. . . .",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "What Is a Healthy Church? (9Marks: Building Healthy Churches)",
        "Authors": "By Dever, Mark",
        "Description": "Guides both pastors and members to recognize key characteristics of a healthy church and then challenge each person to do his or her part in developing those characteristics in the local church body.",
        "Category": " Religion , Institutions & Organizations",
        "Publisher": "Crossway",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Double Jeopardy",
        "Authors": "By Bernhardt, William",
        "Description": "Travis Byrne, a smart Dallas cop who decided in mid-career to trade his badge for a law degree, has seen a lot of scum in his time - but no one as low, mean, and vicious as Al Moroconi. Moroconi has been hauled in on the charge of orchestrating a monstrous crime against a young woman. The first defense attorney on the case disappears under highly suspicious circumstances. Now, appointed by a federal judge, Travis is obliged to speak for the defense.Much as he despises Moroconi, Travis is a professional: he'll do everything he can to get Moroconi off, even in the face of a death threat from the Mob. But just as the trial is getting under way, Moroconi shoots his way out of court custody, steals a car, and vanishes into the Dallas underworld - taking Travis's reputation with him.No sooner does Moroconi disappear than Travis becomes ensnared in a web of corruption and betrayal, in which nothing is what it appears to be. The FBI is after Travis for a murder he didn't commit. The Mob wants to kill him for a secret hit list he doesn't have. Running for his life, Travis comes to the horrifying realization that the charge against Moroconi is just a cover for something much bigger and more foul....",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "The Fundamentals of Contract Bridge (Including the New Point-Count Method, Plus Expert Instruction on All Phases of the Game) (Pocket Books # 50042)",
        "Authors": "By Goren, Charles H.",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "6.61",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "3 Bowls: Vegetarian Recipes from an American Zen Buddhist Monastery",
        "Authors": "By Farrey, Seppo Ed, O'Hara, Myochi Nancy, Roshi, Eido T. Shimano (FRW), and Dai Bosatsu Zendo (Monastery) (COR)",
        "Description": "3 BOWLS presents the outstanding vegetarian specialties that draw thousands of visitors each year to Dai Bosatsu Zendo, a traditional Zen monastery in New York's Catskill Mountains. From Sesame Crepes with Portobello Mushrooms in Port Cream Sauce and Spaghetti with Chipotle and Garlic to Coconut-Pecan Carrot Cake with Orange Cream-Cheese Frosting, these recipes are deftly creative, yet all are simple to prepare.",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Rux Martin/Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Ken Hom: Travels with a Hot Wok",
        "Authors": "By Hom, Ken",
        "Description": "Offers tips on wok cooking and includes more than 160 recipes for appetizers, soups, fish, meat, poultry, vegetables, and desserts.",
        "Category": " Antiques & Collectibles , Performing Arts",
        "Publisher": "Dk Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Unquiet Dreams (Connor Grey, Book 2)",
        "Authors": "By Del Franco, Mark",
        "Description": "Fueled by a mysterious new drug, Celtic fairies and Teutonic elves battle for turf and power-with humans caught in the middle. As the body count rises, Connor Grey uncovers a vast conspiracy that threatens to destroy not only the city, but the world.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Dark Legend (The Carpathians (Dark) Series, Book 7)",
        "Authors": "By Feehan, Christine",
        "Description": "Awakening in the dark with an unquenchable thirst for blood, an immortal man searches the streets of Paris for prey and hears the gentle voice of Francesca Del Ponce, a healer, and as he finds himself succumbing to forbidden desire with this kind woman, he finds a love like he has never known and an unexpected glimpse of salvation. Original.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Four Seasons of Italian Cooking: Harvest Recipes from the Farms and Vineyards of the Italian Countryside",
        "Authors": "By Time-Life Books (EDT), Richardson, Alan, and Battifarano, A. J.",
        "Description": "Gathers seasonal Italian recipes for antipasto, breads, soups, salads, meat, poultry, seafood, vegetables, and desserts",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Mathematics Assessment: Myths, Models, Good Questions, and Practical Suggestions",
        "Authors": "By Stenmark, Jean Kerr",
        "Description": "",
        "Category": "",
        "Publisher": "National Council of Teachers of Mathematics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Eye Illusions/Pink Cover",
        "Authors": "By Anderson, Jim",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Modern Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "St. Raven (Rogue Series)",
        "Authors": "By Beverley, Jo",
        "Description": "From the New York Times bestselling author of Hazard—a sizzling and sensual novel of fortune and fate… A Lady with a Quest…Cressida Mandeville agrees to Lord Crofton’s vile proposal, but secretly she has other plans. She will trick the loathsome man, find her father’s hidden wealth, and save her family from ruin. All goes well, until a daring highwayman stops their carriage, whirls Cressida up onto his dark horse, and demands a kiss…. A Duke with a Conscience…Tristan Tregallows, Duke of St. Raven, doesn’t plan to rescue a damsel in distress, but he can hardly leave an innocent in Crofton’s power. One kiss confirms his prisoner’s innocence, but instead of grateful, she is furious. When he discovers that Cressida is on a quest, one that will take her into the darkest parts of Regency society, St. Raven knows he must become her partner and protector. But he doesn’t expect the dangers to his heart….",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Wolf's Trap",
        "Authors": "By Gagliani, W. D.",
        "Description": "Wisconsin police officer and werewolf, Nick Lupo uses his heightened senses to unleash the creature within to stop a bloodthirsty serial killer in his tracks. Original.",
        "Category": " Fiction , Horror",
        "Publisher": "Dorchester Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Maximize Your Vitality & Potency",
        "Authors": "By Wright, Jonathan V. and Lenard, Lane",
        "Description": "Offers natural ways for men to ease the signs of aging--such as fatigue, weakened bones, an enlarged prostate, and loss of sexual drive--instead of relying on synthetic male hormones that generate harmful side effects. Original. IP.",
        "Category": " Health & Fitness , Alternative Therapies",
        "Publisher": "Smart Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Abducted Heiress (The Secret Clan, 1)",
        "Authors": "By Scott, Amanda",
        "Description": "Molly Gordon, the Maid of Dunsithe, would be the wealthiest woman in Scotland...if anyone could find her fortune. But spirited away by her greedy uncle, she is kept captive on a misty island, separated from her treasure and the rest of her family, perhaps forever. She longs for a hero to rescue her. But when Sir Finlay Mackenzie, the fiery warrior, gains possession of Molly, her defiance and his temper lead them into a battle of wills. Armed with the right to marry her or barter her, he finds a proud princess who resists his passion and fights his every command. Now the real adventures begin as together Molly and Fin face danger, desire, and the fate that will drive them until they can open their hearts to magic-and to love.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Forever",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Dan Rather: An Intimate and Revealing Look at the Newsman and Newsmaker",
        "Authors": "By King",
        "Description": "",
        "Category": "",
        "Publisher": "Tower & Leisure Sales Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Old Testament and Criticism",
        "Authors": "By Armerding, Carl",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Wm. B. Eerdmans Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Hot & Heavy",
        "Authors": "By Hill, Sandra",
        "Description": "Preparing for a special ops mission in northern Iraq, Lieutenant Ian MacLean, an adrenaline-loving bachelor, comes face to face with Madrene Olgadottir, a gorgeous female warrior mysteriously transported from a thousand years in the past. Original.",
        "Category": " Fiction , Romance , Time Travel",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "THE GOLF INSTRUCTOR: An Illustrated Guide from Tee to Green",
        "Authors": "By Hobbs, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Quantum Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Modern Art (Essential Art)",
        "Authors": "By Blake, Robin",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "SECRET AT SOLAIRE (NANCY DREW 111)",
        "Authors": "By Keene, Carolyn",
        "Description": "While staying at the exclusive Spa Solaire outside Tucson, Arizona, Nancy and her friends witness a series of strange events, beginning with a sabotage and ending with a kidnapping. Original.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Creative Color Schemes for Your Home (Creating Your Home Series)",
        "Authors": "By Writer's Digest, Eaglemoss Publications Ltd",
        "Description": "Provides advice for choosing the proper decorating colors to reflect mood and to complement the natural lighting and size of a room",
        "Category": " House & Home , Decorating & Furnishings",
        "Publisher": "Betterway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Spectacular Australia",
        "Authors": "By Phillip Mathews",
        "Description": "",
        "Category": "",
        "Publisher": "Phillip Mathews Book Publisher",
        "Price Starting With ($)": "9.58",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Sweetbriar",
        "Authors": "By Deveraux, Jude",
        "Description": "New York Times bestselling author Jude Deveraux’s timeless historical romance set in the Kentucky wilderness featuring a woman who’s life was changed forever in a few terrifying moments.When her wagon train is ambushed by renegade Shawnees, beautiful young Linnet Tyler is the sole adult survivor. Taken prisoner, alone in a harsh land, she faces an uncertain, terrifying future with a steely courage that belies her fragile beauty. Thanks to his Shawnee grandmother, Devon Macalister is as much at ease roaming the forest trails with his Indian cousins as he is in the little settlement of Sweetbriar where he makes his home, and he is determined to rescue this lovely captive. But the dangers of winning Linnet’s freedom and their hazardous journey through the wilderness to safety are nothing compared to the perilous dictates of both their hearts.",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "America's national parks",
        "Authors": "By Aylesworth, Thomas G.",
        "Description": "",
        "Category": "",
        "Publisher": "LONGMEADOW/BISON",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Reflections for Living Life More Fully",
        "Authors": "By Tully, Brock",
        "Description": "",
        "Category": "",
        "Publisher": "Hay House Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "A Tale of Two Vikings",
        "Authors": "By Hill, Sandra",
        "Description": "",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Dorchester Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Love Talker",
        "Authors": "By Peters, Elizabeth",
        "Description": "Laurie has finally returned to Idlewood, the beloved family home deep in the Maryland woods where she found comfort and peace as a lonely young girl. But things are very different now. There is no peace in Idlewood. The haunting sound of a distant piping breaks the stillness of a snowy winter's evening. Seemingly random events have begun to take on a sinister shape. And dotty old Great Aunt Lizzie is convinced that there are fairies about -- and she has photographs to prove it. For Laurie, one fact is becoming disturbingly clear: there is definitely something out there in the woods -- something fiendishly, cunningly, malevolently human -- and the lives of her aging loved ones, as well as Laurie's own, are suddenly at serious risk.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Freak Out!: Animals Beyond Your Wildest Imagination (Penguin Young Readers, Level 4)",
        "Authors": "By Clarke, Ginjer L. and Mueller, Pete (ILT)",
        "Description": "Did you know that the viperfish uses a glowing lure to attract its prey? Or that a giant squid has eyeballs the size of volleyballs? This book is full of facts about all sorts of freaky animals!",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "This Is the Dachshund",
        "Authors": "By Adler, Leonore Loeb",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1966"
        }
    },
    {
        "Title": "Can You See What I See? Animals (Scholastic Reader, Level 1): Read-and-Seek",
        "Authors": "By Wick, Walter",
        "Description": "Bestselling author/photographer Walter Wick creates a new Level 1 reader series with lots of photographic search-and-find fun--especially for beginning readers!From the photographer of the bestselling I Spy books and creator of the Can You See What I See? series is a new rhyming, search-and-find reader series--especially for the newest reader! Readers can use the picture clues to search for dozens of hidden trinkets and toys!This book builds confidence in new readers and provides hours of fun as well!",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "John Hedgecoe's Complete Guide To Photography: A Step-by-Step Course from the World's Best-Selling Photographer",
        "Authors": "By Hedgecoe, John",
        "Description": "A Step-by-Step Course from the World's Best-Selling Photographer John Hedgecoe. \"An excellent way of teaching the technical aspects of photography through hands-on exercises. A first-rate addition to all collections.\"--LJ. \"Hedgecoe has revolutionized photo books....Highly recommended.\"--Popular Photography.   224 pages (all in color), 6 5/8 x 10 1/4.",
        "Category": " Photography , General",
        "Publisher": "Sterling",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Kitchen Coach: Weeknight Cooking",
        "Authors": "By Bushman, Jennifer and Williams, Sallie Y.",
        "Description": "Kitchen Coach Jennifer Bushman can help you get good food on the table Monday to Friday and enjoy making it! She'll help you set up an efficient kitchen and identify the weeknight cooking challenges you may face--working late, keeping to a budget, pleasing picky eaters, juggling family schedules--then guide you to great recipes to suit your need or mood of the day. You and your family will be glad you cooked!* \"What to Cook\" chart to solve your \"What's for dinner?\" questions* Meal-planning cues--from Easy Preparation to Something Special* 150 simple, healthy recipes for all kinds of weeknight situations* Sensational salads, hearty pastas, fresh fish entrees, and tempting chicken recipes* Themed dishes for \"comfort food\" or sophisticated \"spa cooking\" nights, and more* Fun foods for kids--including wraps, tacos, pizza, and foods-on-a-stick\"Jennifer is a working woman's dream. . . . There is something for everyone's palate in this book. If you love to cook, or just love to eat, this is all you need!\"--Elizabeth Vargas, anchor, ABC News\"Jennifer Bushman's creative dishes can stir even the most jaded, overworked cook. This is an invaluable book to help survive our rushed, stressed modern lives.\"--Shirley O. Corriher, author of CookWise\"Finally a book that matches . . . [Jennifer's] vibrant, lively, and creative personality. . . . Every kitchen needs Jennifer as their 'kitchen coach'!\"--Joanne Weir, host of the PBS series Weir Cooking in the City and author of Weir Cooking in the City\"Jennifer Bushman's . . . enthusiasm reaches right out from the page and there is no reason not to cook once you have Jennifer's book in hand.\"--John Ash chef, teacher, and author of John Ash Cooking One on One\"Jennifer Bushman, champion cooking teacher, personifies a true Kitchen Coach: always guiding, encouraging, and inspiring.\"--Flo Braker, author of The Simple Art of Perfect Baking and Sweet Miniatures",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Great Quotes from Great Leaders",
        "Authors": "By McKee, Michael (ILT) and Anderson, Peggy (EDT)",
        "Description": "From George Washington to Martin Luther King, JR., to Margaret Thatcher, Great Quotes from Great Leaders offers the insights and wisdom of the world's most inspirational and dynamic leaders. You will not only be uplifted by the quotes and intrigued by the biographical sketches provided, you will be moved to share these thoughts with colleagues.",
        "Category": " Reference , Quotations",
        "Publisher": "Weiser",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "How to build a coin collection",
        "Authors": "By Fred Reinfeld",
        "Description": "",
        "Category": "",
        "Publisher": "Sterling Pub. Co",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Principles of Marketing, Activebook 2.0",
        "Authors": "By Kotler, Philip, Armstrong, Gary",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "7.13",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Grand Canyon (Nature in Action)",
        "Authors": "By Cone, Patrick",
        "Description": "Discusses the origin of the types of rock from which the Grand Canyon was carved, how the canyon came into existence, the animals, plants, and humans who live there, and its present status",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , General",
        "Publisher": "First Avenue Editions ™",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Its All Your Fault: How To Make It As A Hollywood Assistant",
        "Authors": "By Robinson, Bill and Morris, Ceridwen",
        "Description": "An Essential Guide to Landing -- and Keeping -- Your first Hollywood Job  A position as an assistant to a producer, agent, director, studio executive, or star can be the path to a fabulous career -- or a one-way ticket to hell. How can the aspiring Hollywood assistant quickly learn the inside track to success while avoiding the land mines? It's All Your Fault is the answer. Written by two former Hollywood assistants who've been there and done that, It's All Your Fault is bursting with hard-earned advice, from figuring out who's who and who isn't to sex, drugs, and other work-related issues. Filled with outrageous anecdotes and countless celebrity stories, It's All Your Fault proves an indispensable addition to the nightstand of every wannabe Hollywood mover and shaker.",
        "Category": " Humor , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Clinical Phonetics (2nd Edition)",
        "Authors": "By Shriberg, Lawrence D. and Kent, Raymond D.",
        "Description": "",
        "Category": " Medical , Audiology & Speech Pathology",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "8.72",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Nitrogen Fix",
        "Authors": "By Hal Clement",
        "Description": "",
        "Category": "",
        "Publisher": "Ace",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "Last Bridge Home (Sedikhan)",
        "Authors": "By Johansen, Iris",
        "Description": "He was a dangerously seductive stranger . . . Jon Sandell. Confident, controlled, a man with many secrets—and one remarkable power: the ability to read a woman's mind, to touch her soul, to know her every waking desire.Who rocked her world . . . Now he's on a vital mission: to rescue a woman who doesn't even know she's in danger from the ruthless agents who wish her harm. But who will protect her from him?With breathless intrigue . . . Alone in her ivy-covered cottage, Elizabeth Ramsey welcomes Jon's sudden appearance, for he is a link to the husband she loved and tragically lost. Until this mesmerizing stranger reveals his true intentions: to lure her from her ordered home and into his violent, passionate, precarious world. . . .And desperate desire. . . . Soon, alone in a secluded mountain lodge, Elizabeth will walk a glittering tightrope between fear and fascination, unable to tell friend from foe, lover from enemy. Caught in a sensual game of love and lies, she must find the truth before she loses her life.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Only Love (Only Series, 4)",
        "Authors": "By Lowell, Elizabeth",
        "Description": "′There is no finer guarantee of outstanding romance than the name of Elizabeth Lowell′ - Romantic Times. Cast adrift during the War Between the States, Shannon Conner grew to womanhood in a lonely cabin high in the Colorado Rockies. Though stubborn and courageous, Shannon is ill-prepared to deal with the predatory Culpepper brothers - and the intoxicating ardour of the man who defends her honour, Rafael ′Whip′ Moran. A loner and a wanderer, a man tied to no place or promise, Whip aids the wary young ′widow′ who has a walk like honey and a determined grip on her shotgun. But neither the Culpeppers nor grizzlies are as dangerous to Whip as the passion Shannon offers him - a passion that could cost Whip the freedom that is as much a part of him as his soul.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Joyful Songs",
        "Authors": "By Barrows, Cliff",
        "Description": "",
        "Category": "",
        "Publisher": "The Billy Graham Evangelistic Association",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Complete Bartender, Revised Edition",
        "Authors": "By Robyn M. Feller",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley Publishing Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Piano Teacher: A Novel",
        "Authors": "By Lee, Janice Y. K.",
        "Description": "\"A rare and exquisite story . . . Transports you out of time, out of place, into a world you can feel on your very skin.\" —Elizabeth GilbertJanice Y.K. Lee's latest novel, The Expatriates, is now available from Penguin   The New York Times bestseller  In the sweeping tradition of The English Patient, Janice Y.K. Lee's debut novel is a tale of love and betrayal set in war-torn Hong Kong. In 1942, Englishman Will Truesdale falls headlong into a passionate relationship with Trudy Liang, a beautiful Eurasian socialite. But their affair is soon threatened by the invasion of the Japanese as World War II overwhelms their part of the world. Ten years later, Claire Pendleton comes to Hong Kong to work as a piano teacher and also begins a fateful affair. As the threads of this spellbinding novel intertwine, impossible choices emerge-between love and safety, courage and survival, the present, and above all, the past.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Culinary Herbs",
        "Authors": "By Van Burnt, Elizabeth R.",
        "Description": "",
        "Category": " Cooking , Methods , General",
        "Publisher": "Brooklyn Botanic Garden",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Seduction In Mind: A Novel",
        "Authors": "By Johnson, Susan",
        "Description": "He could offer her only one thing — a week of intimate pleasure....Samuel Lennox and Miss Alexandra Ionides cordially invite you to a most provocative game of seductionIt shall last for seven days, during which Lennox, Viscount Ranelagh, will wield his celebrated prowess with the London ladies in an attempt to add Miss Alex’s name to his list of conquests. The infamous list is long, though the duration of each liaison has been brief — and as the viscount will assure anyone, that is precisely how he likes it.The lady, for her part, an accomplished artist and benefactress of various charities, has no wish to be a mere plaything. Although a week of intimate pleasure with a man of Ranelagh’s legendary skills would be memorable...As for the other players — irate parents, designing debutantes, a scheming ex-mistress, even a love-struck young man with ideals — all seem intent on meddling. But the viscount is single-minded when it comes to seduction, and Miss Alex is in his sights.Come see who wins in this amorous game!",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Adventures of Little Polar Bear",
        "Authors": "By De Beer, Hans",
        "Description": "",
        "Category": "",
        "Publisher": "North-South Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Wicked (St. John-Duras)",
        "Authors": "By Johnson, Susan",
        "Description": "Serena Blythe's plan to escape a life of servitude had gone terribly awry. So she took the only course left to her. She sneaked aboard a sleek yacht about to set sail--and found herself face-to-face with a dangerous, sensual stranger. Beau St. Jules, the Earl of Rochefort, had long surpassed his father's notoriety as a libertine. Less well known was his role as intelligence-gatherer for England. Yet even on a mission to seek vital war information, he couldn't resist practicing his well-polished seduction on the beautiful, disarmingly innocent stowaway. And in the weeks to come, with battles breaking out on the continent and Serena's life in peril, St. Jules would risk everything to rescue the one woman who'd finally captured his heart.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Horse and Pony Stories (Red Hot Reads)",
        "Authors": "By Ambrus, Victor G. (ILT) and Pullein-Thompson, Christine (EDT)",
        "Description": "A thoroughbred collection with a diverse selection of twenty stories and extracts by such authors as Anna Sewell, Leo Tolstoy, C. S. Lewis, Helen Griffiths, Saki, Monica Dickens, Walter Farley, and Arthur Conan Doyle.",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Memory Makers",
        "Authors": "By Covert, James T.",
        "Description": "",
        "Category": "",
        "Publisher": "Frank Amato Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "The Dog Who Loved Too Much: Tales, Treatments and the Psychology of Dogs",
        "Authors": "By Dodman, Nicholas H.",
        "Description": "Do you have a problem pooch? What do you do with a dog who attacks the telephone whenever it rings? Or one who chases imaginary rabbits down imaginary holes?  Or one who is terrified ofmicroblinds...or turns into Cujo every time company arrives?In this warm, compassionate, entertaining, and very informative book, Dr. Nicholas Dodman, one of the premier veterinary behaviorists in the country, tells real-life stories from his practice that illustrate his unique approach to correcting unwanted behaviors.   By making key changes in a dog's diet, exercise regime, environment, and training, Dr. Dodman has been able to work wonders with  even the most difficult problems.  Utilizing revolutionary discoveries in canine behaviorism and pharmacology, Dr. Dodman has given  hope and help to owners whose only previous options were obedience schools, or if these failed--euthanasia.  Whether you own a problem dog or just want to better understand the complex, intelligent mind of your canine companion, this is a book you won't want to miss.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Horses & Friends Poster Book",
        "Authors": "By Burns, Deborah",
        "Description": "Horses love company and often form meaningful friendships with animals of other species. These 30 charming pull-out posters offer glimpses of playful and tender relationships between horses and dogs, cats, goats, birds, and more. Featuring delightful images that showcase the adorable and heartwarming bond between horses and their unconventional stable companions, this collection shines a light on the many ways horses shower their fellow animals with love. Kids of all ages will enjoy seeing how these very different animals support and entertain each other.",
        "Category": " Juvenile Nonfiction , Animals , Horses",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Fever (A Medical Thriller)",
        "Authors": "By Cook, Robin",
        "Description": "Charles Martel is a brilliant cancer researcher who discovers that his own daughter is the victim of leukemia. The cause: a chemical plant conspiracy that not only promises to kill her, but will destroy him as a doctor and a man if he tries to fight it...",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Faithcare: Ministering to All God's People Through the Ages of Life",
        "Authors": "By Aleshire, Daniel O.",
        "Description": "",
        "Category": " Religion , Christian Ministry , Pastoral Resources",
        "Publisher": "Westminster John Knox Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Advanced Placement Exam Calculus Abced (REA test preps)",
        "Authors": "By Worku, Tefera, Brook, Donald E., and Smith, Donna M.",
        "Description": "",
        "Category": "",
        "Publisher": "Research & Education Assn",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Dog Lover's Companion (Nature Companions)",
        "Authors": "By McGreevy, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "Chain Sales Marketing",
        "Price Starting With ($)": "6.76",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Exile's Return (Conclave of Shadows, Book 3)",
        "Authors": "By Feist, Raymond E.",
        "Description": "Saved by a mage's intervention from certain death, Kaspar, the evil Duke of Olasko, is lord no more -- reduced to an exile's existence and forced to wander the harshest realms of the world he once enslaved.Merciless deserts, forbidding mountains, and vast oceans now separate the once powerful despot from his former seat of power -- his dark dreams of vengeance overwhelmed by the daily struggle for survival. But there is a larger drama that will entangle the broken dictator. An evil devastating and deadly seeks entrance to the land -- the mystical tool of a dark empire hungry for conquest and destruction -- and Kaspar has inadvertently discovered the key.  Suddenly, Midkemia's last hope is a disgraced and exiled duke whose history is written in blood, and who now must wield his sword as her champion . . . if he so chooses..",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Horse: Comprehensive Guide to Breeds, Riding and Management",
        "Authors": "By MacGregor-Morris, Pamela",
        "Description": "",
        "Category": "",
        "Publisher": "Longmeadow Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    }
]