[
    {
        "Title": "Portrait of Scotland",
        "Authors": "By COLIN BAXTER",
        "Description": "",
        "Category": "",
        "Publisher": "Lomond Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "No Wonder They Call Him the Savior",
        "Authors": "By Lucado, Max",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Astonishing But True Golf Facts",
        "Authors": "By Zullo, Allan",
        "Description": "Perfect for golf fans young and old, Astonishing but True Golf Facts highlights the most amazing-and amusing-moments from the sport's rich historyGolf's half-a-millennium history is filled with memorable events, remarkable achievements, and truly bizarre occurrences that likely will never be duplicated. These incredible moments are chronicled inAstonishing but True Golf Facts , a compendium of fascinating tidbits from golf's storied past.Golf enthusiasts will be amazed as they read of the high-and low-points of their beloved sport, such as the amateur golfer who beat odds of over a billion to one to score two holes in one during a single round, the inventor who plays with clubs made from the recycled metals of nuclear missiles, the tournament that was held up by a flock of crows, and the golf fan who was struck twice by errant drives during the 1996 U.S. Open.These true golfing stories are sure to be a source of inspiration, amusement, and astonishment to duffers and serious golfers everywhere.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Awakening (Norton Critical Editions)",
        "Authors": "By Chopin, Kate and Culley, Margo (EDT)",
        "Description": "The text is that of the first edition of the novel, published by Herbert S. Stone in 1899. It has been annotated by the editor and includes translations of French phrases and information about New Orleans locales, customs, and lore, the Bayou region, and Creole culture. \"Bibliographical and Historical Contexts\", expanded and introduced by a new Editor’s Note, presents biographical, historical, and cultural documents contemporary with the novel’s publication. Included are a biographical essay by the acclaimed Chopin biographer Emily Toth, \"An Etiquette/Advice Book Sampler\" with selections from the conduct books of the period in which Chopin lived and wrote, and period fashion plates from Harper’s Bazar. A comprehensive \"Criticism\" section, introduced by a new Editor’s Note, contains expanded selections from hard-to-find contemporary reviews of the novel; two letters of mysterious origin written in response to the novel; and Chopin’s \"Retraction,\" which followed The Awakening’s negative reception. These are followed by twenty-seven interpretive essays, twelve of them new to the Second Edition, that provide a variety of perspectives on The Awakening, including essays by Cynthia Griffin Wolff, Nancy Walker, Elizabeth Fox-Genovese, Paula A. Treichler, Sandra M. Gilbert, Lee R. Edwards, Patricia S. Yaeger, Elizabeth Ammons, and Elaine Showalter. A Chronology of Chopin’s life and an updated Selected Bibliography are also included.",
        "Category": " Fiction , Literary",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Splish Splash!",
        "Authors": "By Kessler, Ethel",
        "Description": "",
        "Category": "",
        "Publisher": "Parents' Magazine Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Woman Of The Boundary Waters: Canoeing, Guiding, Mushing, and Surviving (Minnesota)",
        "Authors": "By Kerfoot, Justine",
        "Description": "The Boundary Waters region of Minnesota and Ontario is a vast wilderness of quiet beauty, visited and loved by many, but home to only a rugged few. In 1928, Justine Kerfoot arrived, a Northwestern University graduate headed for medical school until her family lost both their Illinois homes in the stock market crash. Thrust into year-round life at her mother's fledgling summer resort, Justine was confronted with learning survival in the frigid north woods, a challenge she met with extraordinary verve and recounts with great candor and humor in this remarkable book.Kerfoot has paddled all the lakes and streams in this border country, and she knows them well. Her lyrical descriptions of wildlife and seasonal environments express the deep reverence for nature that has become her way of life. In a new afterword, she reflects on the impact of restricted wilderness status on the region - called the Boundary Waters Canoe Area Wilderness since 1978 - and on her own convictions about people living in the wild.",
        "Category": " History , United States , State & Local , Midwest (IA, IL, IN, KS, MI, MN, MO, ND, NE, OH, SD, WI)",
        "Publisher": "Univ Of Minnesota Press",
        "Price Starting With ($)": "7.64",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Founding Sisters and the Nineteenth Amendment (Turning Points in History, 7)",
        "Authors": "By Clift, Eleanor",
        "Description": "An extraordinary new series intended to capture extraordinary moments in history.-Chicago TribuneTURNING POINTS features preeminent writers offering fresh, personal perspectives on the defining events of our time.Available NowEleanor Clift, Founding Sisters and the Nineteenth AmendmentAlan Dershowitz, America Declares IndependenceThomas Fleming, The Louisiana PurchaseWilliam Least Heat-Moon, Columbus in the AmericasScott Simon, Jackie Robinson and the Integration of BaseballForthcoming TitlesDouglas Brinkley on the March on WashingtonWilliam F. Buckley Jr. on the Fall of the Berlin WallSir Martin Gilbert on D-DayMartin Goldsmith on the Beatles Coming to AmericaKweisi Mfume on the Emancipation Proclamation",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Conversations with the Other Side",
        "Authors": "By Browne, Sylvia and Francine",
        "Description": "The author of Adventures of a Psychic offers a dissertation on life, the afterlife, and reincarnation. (New Age)",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Hay House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Mr. Biddle and the Birds,",
        "Authors": "By Adams, Adrienne (ILT) and Anderson, John Lonzo",
        "Description": "Mr. Biddle builds a flying contraption that requires the cooperation of his four bird friends",
        "Category": "",
        "Publisher": "Charles Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Abstract, Tales of Wickedness and Sorrow",
        "Authors": "By Byron, Goodloe",
        "Description": "",
        "Category": "",
        "Publisher": "Brown Bag",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Laughing Snowman",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "6579247",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "January",
            "Year": "2016"
        }
    },
    {
        "Title": "The male climacteric",
        "Authors": "By Ruebsaat, Helmut J",
        "Description": "Examines the physical, psychological, and social causes of the climacteric, its effects on a man's sexual and social life, and ways to regain physical and emotional health",
        "Category": "",
        "Publisher": "Hawthorn Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Hasib Sabbagh: From Palestinian Refugee to Citizen of the World",
        "Authors": "By Deeb, Mary-Jane (EDT) and King, Mary E. (EDT)",
        "Description": "",
        "Category": " History , General",
        "Publisher": "UPA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The Spontaneous Fulfillment of Desire: Harnessing the Infinite Power of Coincidence",
        "Authors": "By Chopra, Deepak",
        "Description": "As elegant as his bestselling How to Know God and as practical as his phenomenal The Seven Spiritual Laws of Success, this groundbreaking new book from Deepak Chopra contains a dramatic premise: Not only are everyday coincidences meaningful, they actually provide us with glimpses of the field of infinite possibilities that lies at the heart of all things. By gaining access to this wellspring of creation, we can literally rewrite our destinies in any way we wish.From this realm of pure potential we are connected to everything that exists and everything that is yet to come. “Coincidences” can then be recognized as containing precious clues about particular facets of our lives that require our attention. As you become more aware of coincidences and their meanings, you begin to connect more and more with the underlying field of infinite possibilities. This is when the magic begins. This is when you achieve the spontaneous fulfillment of desire.At a time when world events may leave us feeling especially insignificant and vulnerable, Deepak Chopra restores our awareness of the awesome powers within us. And through specific principles and exercises he provides the tools with which to create the magnificent, miraculous life that is our birthright.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Soul's Perfection (Journey of the Soul's Service, Book 2)",
        "Authors": "By Browne, Sylvia",
        "Description": "Explores the mystery surrounding the meaning of life and offers the theory that humans are the part of God that experiences life, allowing God, the intellect behind creation, to fully know his creations.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Hay House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Helping/Manners LGBs (Little Golden Book)",
        "Authors": "By Golden Books",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "Last Days: 2",
        "Authors": "By Oates, Joyce Carol",
        "Description": "A collection of eleven stories that explores the experiences of Americans abroad, in locations such as Berlin, Warsaw, and Africa",
        "Category": " Fiction , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "9.68",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Meet Molly",
        "Authors": "By Tripp, Valerie",
        "Description": "While her father is away fighting in World War II, Molly finds her life full of change as she eats terrible vegetables from the victory garden and plans revenge on her brother for ruining her Halloween.",
        "Category": " Juvenile Fiction , Historical , Military & Wars",
        "Publisher": "American Girl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "The Betrayal (Abram's Daughters)",
        "Authors": "By Lewis, Beverly",
        "Description": "Separated from her beloved Jonas after he takes a six-month carpenter's apprenticeship in Ohio, Leah hopes that their relationship will endure but finds herself challenged by an unexpected test facing their families. Simultaneous.",
        "Category": " Fiction , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Zen for Cats",
        "Authors": "By Beard, Henry and Barrett, Ron (ILT)",
        "Description": "The popular humorist and author of French for Cats presents a complete guide to Buddhism feline style, covering such topics as Horigami (the art of Messing up Important Papers by Sitting on Them) and Shojin Ryori (macrobiotic foods for cats). 100,000 first printing.",
        "Category": " Humor , General",
        "Publisher": "Villard Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "For One More Day",
        "Authors": "By Albom, Mitch",
        "Description": "This is the story of Charley, a child of divorce who is always forced to choose between his mother and his father. He grows into a man and starts a family of his own. But one fateful weekend, he leaves his mother to secretly be with his father - and she dies while he is gone. This haunts him for years. It unravels his own young family. It leads him to depression and drunkenness. One night, he decides to take his life. But somewhere between this world and the next, he encounters his mother again, in their hometown, and gets to spend one last day with her - the day he missed and always wished he'd had. He asks the questions many of us yearn to ask, the questions we never ask while our parents are alive. By the end of this magical day, Charley discovers how little he really knew about his mother, the secret of how her love saved their family, and how deeply he wants the second chance to save his own.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "11.48",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Tropical Gangsters",
        "Authors": "By Klitgaard, Robert",
        "Description": "Selected as one of the six best nonfiction books of 1990 by the editors f the New York Times Book Review, this is a compelling and entertaining account of the author&#39;s two-and-a-half year adventure in Equatorial Guinea, and his efforts to get this small bankrupt African nation on the path of structural development.",
        "Category": " Social Science , Criminology",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Stroke/Head Injury: A Guide to Functional Outcomes in Physical Therapy Management (Rehabilitation Institute of Chicago Procedure Manual)",
        "Authors": "By Charness, Ann and Schneider, Frederick (EDT)",
        "Description": "",
        "Category": " Medical , Surgery , General",
        "Publisher": "Aspen Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "The Country Kitchen (American Country)",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Offers advice on decorating a kitchen, discusses layout, storage, wallpaper, flooring, and cabinets, and looks at antique silverware, utensils, and dinnerware",
        "Category": " House & Home , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "The Wolf: The Ecology and Behavior of an Endangered Species",
        "Authors": "By Mech, L. David",
        "Description": "Comprehensive study of the wolf's habits, behavior, and relationship with other animals and the environment",
        "Category": " Nature , Animals , Mammals",
        "Publisher": "Univ Of Minnesota Press",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "The Big Turnoff: Confessions of a TV-Addicted Mom Trying to Raise a TV-Free Kid",
        "Authors": "By Currey-Wilson, Ellen",
        "Description": "Alternately hilarious and trenchant in its observations about our media-crazed culture, this is the true tale of a TV-addicted mother's struggle to kick the habit and keep the boob tube out of her son's daily existence. Like most parents, Ellen Currey-Wilson and her husband aspired to be better parents than their own. Currey-Wilson, who shared most of her childhood with The Beverly Hillbillies, maintained intimate relationships with Mary, Rhoda, and Phyllis, and remained up-to-date on the fictional history of every character on Friends, longs for her son, Casey, to know the people around him better than he knows the Teletubbies. And, like most parents, she goes a bit overboard. In her revealing and outspoken take on parenting, Currey-Wilson recounts her increasingly outlandish behavior—such as literally throwing herself in front of the TV set at her son's playmates' houses to prevent any inadvertent watching—and the intermittent fits of insecurity that find her worrying whether Casey might be ostracized for not knowing the theme song to SpongeBob SquarePants. But something remarkable happens as TV assumes a backseat to real life: Currey-Wilson's relationships with her laidback husband, new-age sister, eccentric mother, and remarkably self-possessed son begin to deepen and grow. In an age when it's easier to flip on the TV than to interact with people, The Big Turnoff shows what happens when one woman decides to buck the trend.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Thought Leaders: Insights on the Future of Business (J-B BAH Strategy & Business Series)",
        "Authors": "By Kurtzman, Joel (EDT)",
        "Description": "The Best Ideas on Business?from Today?s Visionary Leaders and ThinkersIn this unprecedented collection of interviews and profiles, twelve of the world?s most remarkable business leaders and thinkers tell companies what it will take to prosper in the next century. Visionary and inspiring, the contributors offer compelling insights into such topics as the strategic uses of technology, building sustainable business growth, and realizing a new corporate core while anticipating key business functions and competencies for the future. The cast includes such renowned pundits as C.K. Prahalad, Charles Handy, Gary Hamel, and Warren Bennis. Also heard are a number of powerful new voices including those of Minoru Makihara, president of Mitsubishi; Jean Rene-Fourtou, CEO of the French pharmaceutical-chemical giant Rhone-Poulenc; and Paul Romer, the brilliant Stanford economist. Always fascinating and often provocative, this work speaks to everyone who had rather be ready for tomorrow today.",
        "Category": " Business & Economics , Management",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Investment Clubs: A Team Approach to the Stock Market",
        "Authors": "By Shaw, Kathryn",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Dearborn Trade Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Right Way to Invest in Mutual Funds (Money America's Financial Advisor)",
        "Authors": "By Updegrave, Walter",
        "Description": "An associate editor of Money gives priceless advice on one of the best investments available. Thanks to mutual funds, a vast number of ordinary people have enough money to buy a home, educate their children, and provide for their future.",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Guide to Managerial Communication: Effective Business Writing and Speaking (5th Edition)",
        "Authors": "By Munter, Mary",
        "Description": "",
        "Category": " Business & Economics , Education",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Strategic Human Resource Management",
        "Authors": "By Greer, Charles R.",
        "Description": "This book deals with the interaction between strategy and human resources, as approached from a general managerial perspective. Updated and revised, the Second Edition provides students with a comprehensive overview of human resource issues applied to the most current technological advances and updated investments in employment practices.   The book provides an investment perspective of human resources and covers the human resource general and legal environment, strategy formulation, planning, strategy implementation, the performance impact of human resource practices and resource evaluation.   For managers and executives involved with human resource issues.",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Team Players and Teamwork: The New Competitive Business Strategy (Jossey Bass Business & Management Series)",
        "Authors": "By Parker, Glenn M.",
        "Description": "A quick, clear way to learn about teamwork, with a useful framework for identifying critical roles of team players.--Peter BlockThis handbook will help you focus on what makes a good team player. It draws on stories of more than fifty team-driven organizations?including Xerox, Honeywell, General Motors, and 3M?to give you proven evidence of the qualities of high performing teams.You'll discover:Four styles of team players critical to an effective, dynamic teamThe right balance of styles to create a productive teamHow to get team members to support, challenge, and inspire one another to achieve stellar resultsA useful framework for identifying team rolesHere's a practical guide for your team leaders and members who need to maintain their competitive advantage through teamwork.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Inspiring Active Learning: A Handbook for Teachers",
        "Authors": "By Harmin, Merrill",
        "Description": "Based on mutual respect, collaboration, and dignity, offers practical strategies to help students work more willingly, diligently, and intelligently.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Assn for Supervision & Curriculum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "A Passion for Teaching",
        "Authors": "By Levine, Sarah L. (EDT), McVay, Scott (EDT), and Frost, Kit (PHT)",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "Assn for Supervision & Curriculum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "It's Our Serve",
        "Authors": "By Junior League of Long Island",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Junior League of Long Island",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "John Hedgecoe's Complete Guide To Black & White Photography",
        "Authors": "By Hedgecoe, John",
        "Description": "\"A guide to beginning b&w photographic techniques. Discusses principles of basic composition and framing, and...still lifes, portraits, and landscapes. Includes instructions on setting up a home darkroom, processing film, and printing pictures, and advanced techniques....\"--RRBN.   160 pages (all in color), 6 5/8 x 10 1/4.",
        "Category": "",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Endless Night",
        "Authors": "By AGATHA CHRISTIE",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "9.52",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Amish Ways",
        "Authors": "By Seitz, Ruth Hoover and Seitz, Blair (PHT)",
        "Description": "Discusses the lifestyle, art, education, and business of Amish people in Lancaster County, Ohio, and Ontario",
        "Category": " Social Science , Sociology , Rural",
        "Publisher": "RB Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "A Holiday for Murder",
        "Authors": "By Christie, Agatha",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Transformative Assessment",
        "Authors": "By Popham, W. James",
        "Description": "Arguing that formative assessment can fundamentally transform the way a teacher teachers, Popham (emeritus professor, University of California-Los Angeles Graduate School of Education and Information Studies) cuts through the jargon and hype to explain what formative assessment is and isn't, and what it can and can't do. He reviews the research supporting formative assessment's effectiveness, and asserts that familiarity with this research is the key to preserving both teacher sanity and district funds. He offers step-by-step guidance on how to build frameworks for formative assessment and how to carry out each of the process's four levels: teachers' instructional adjustments, students' learning tactic adjustments, a classroom climate shift, and school-wide implementation. The book is for teachers and school administrators. Annotation ©2008 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Testing & Measurement",
        "Publisher": "ASCD",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Leadership for Learning: How to Help Teachers Succeed",
        "Authors": "By Glickman, Carl D.",
        "Description": "A guide for school leaders explains how to become involved in the teaching and learning process to improve student performance.",
        "Category": " Education , General",
        "Publisher": "Association for Supervision & Curriculum Development",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "How To Say It (R) To Girls: Communicating with Your Growing Daughter (How to Say It... (Paperback))",
        "Authors": "By Gruver, Nancy, Boltin, Jill (ART), and Howalt, Paul (ILT)",
        "Description": "The expert guide to girl talk. How to Say It(r) to Girls provides a wellspring of practical advice for parents on how to broach uncomfortable subjects with girls of all ages, or how to simply open the lines of communication. This book offers concrete words, phrases, and sample dialogues to help parents figure out what to say and how best to say it.",
        "Category": " Family & Relationships , Life Stages , Teenagers",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The Price of Motherhood: Why the Most Important Job in the World is Still the Least Valued",
        "Authors": "By Crittenden, Ann",
        "Description": "In the pathbreaking tradition of Backlash and The Second Shift, Labor of Love opens the last frontier in the fight for women's equality: the economic penalties of motherhood.In this provocative book, award-winning economics journalist Ann Critten argues that although women have been liberated, mothers have not. Drawing on hundreds of interviews around the country and the most current research in economics, history, child development, and law, she shows how mothers are systematically disadvantaged and made depent by a society that praises the labor of love but undervalues and even exploits those who perform it.The costs of motherhood are apparent everywhere. College-educated women pay a \"mommy tax\" of more than a million dollars in lost income when they have a child. Family law deprives mothers of financial equality in marriage. Most child care is excluded from the GDP, at-home mothers are not counted in the labor force, and the social safety net simply leaves them out. With passion and clarity, Critten dismantles the principal argument for the status quo: that it's a woman's \"choice.\" She demonstrates, on the contrary, that proper recognition and reward for mothers' essential contributions would only enhance the welfare of all.Bold and galvanizing, full of innovative solutions, Labor of Love offers a much-needed accounting of the price mothers pay to carry out society's most important job.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Metropolitan Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Mobilizing the Community to Help Students Succeed",
        "Authors": "By Price, Hugh B.",
        "Description": "As president of the National Urban League, Price (Brookings Institution) implemented community-based strategies to motivate students to succeed in school. In this volume, he explains how educators, parents, and business and civic leaders can use those strategies to spur student achievement in any school, by providing recognition, having parades and fairs to celebrate achievement, rewarding good behavior, supporting literacy, and starting an honor society, for example. Annotation ©2008 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Philosophy, Theory & Social Aspects",
        "Publisher": "ASCD",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Helping the Struggling Adolescent: A Counseling Guide",
        "Authors": "By Parrott, Les",
        "Description": "",
        "Category": " Religion , Christian Education , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Improving Student Learning One Teacher at a Time",
        "Authors": "By Pollock, Jane E.",
        "Description": "This volume outlines how teachers can use curriculum, instructional planning and delivery, assessment, feedback, record keeping, and reporting to improve student learning. Pollock presents modifications of fundamental practices that have evolved from the work of educators and theorists such as Madeline C. Hunter and J.F. Herbart. Each chapter also addresses computer software and information-sharing advances in teaching and perspectives of educators who have used her approach. Pollock is the director of an education consulting firm, an adjunct faculty member at several colleges, and coauthor of Classroom Instruction That Works. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Association for Supervision & Curriculum Development",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Big Picture: Education Is Everyone's Business",
        "Authors": "By Littky, Dennis and Grabelle, Samantha",
        "Description": "Littky (director and founder, Metropolitan Regional Career and Technical Center) is one of the cofounders of Rhode Island's Metropolitan Regional Career and Technical Center. Here, writing for the broadest possible audience, he describes the philosophy that lies behind the school, frequently using examples from his experiences there to illustrate his ideas about the nature of learning, the purpose of education, ways to encourage kids to want to learn, empowering students' families, and measuring achievement. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Philosophy, Theory & Social Aspects",
        "Publisher": "ASCD",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Best Schools: How Human Development Research Should Inform Educational Practice",
        "Authors": "By Armstrong, Thomas and Elkind, David (FRW)",
        "Description": "Armstrong urges his fellow educators to abandon the Academic Achievement Discourse, which is responsible for such disasters as uniform testing and No Child Left Behind. He offers instead the Human Development Discourse, describes its features and benefits, and traces its legacy through some of the most respected thinkers of the past. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , General",
        "Publisher": "Association for Supervision & Curriculum Developme",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Transforming Schools: Creating a Culture of Continuous Improvement",
        "Authors": "By Zmuda, Allison, Kuklis, Robert, and Kline, Everett",
        "Description": "This guide for school leaders uses the principles of systems thinking to explain how a culture of continuous improvement may be created and sustained. Topics include (for example) identifying the core beliefs of a school, developing a shared vision, integrating teacher concerns into the action plan, and embracing collective accountability. Zmuda is an education consultant for ASCD in Alexandria, Virginia. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Educational Policy & Reform , General",
        "Publisher": "Association for Supervision & Curriculum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Thunder from the Sea",
        "Authors": "By Harlow, Joan Hiatt",
        "Description": "",
        "Category": "",
        "Publisher": "Aladdin Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Invisible Fran (3) (Franny K. Stein, Mad Scientist)",
        "Authors": "By Benton, Jim",
        "Description": "Goosebumps and Bill Nye the Science Guy fans, meet Franny!There’s nothing better than being a mad scientist—at least according to Franny. So she’s making it her mission to help her classmates discover their own inner mad scientists. All Franny needs for her latest experiment is a few volunteers, a half-completed two-headed robot, and an invisibility potion. Only this experiment just might prove to be Franny’s most difficult. Because what do you do when your classmates don’t know anything about mad science—and there’s a doubly dumb robot running amok to prove it?",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Art and Science of Teaching: A Comprehensive Framework for Effective Instruction (Professional Development)",
        "Authors": "By Marzano, Robert J.",
        "Description": "Consultant Marzano (also education, Cardinal Stritch U.) understands that classroom teachers strive to use instructional strategies based on sound science and research, but have difficulty choosing one of the many theories and applications currently available and also cannot always tailor a theory or application to meet the needs of an individual student. He presents a model teachers can use on the spot to diagnose needs and ask appropriate questions of themselves, starting with what they can do to establish and communicate learning goals, track student progress and celebrate success. Other model-questions address helping students deepen their understanding of new knowledge, engaging students, establishing and maintaining classroom rules and procedures, communicating expectations and organizing lessons into a cohesive unit. The result is a strong self-study guide along with a good text for inservice or discussion groups. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , General",
        "Publisher": "Association for Supervision & Curriculum Development",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Educator's Guide to Preventing and Solving Discipline Problems",
        "Authors": "By Boynton, Mark and Boynton, Christine",
        "Description": "This book considers how teachers can prevent and deal with discipline issues, focusing on children who occasionally break the rules. They describe the important elements of discipline; building-wide strategies and philosophies; and relationship, monitoring, parameter, and consequence strategies. The last section emphasizes techniques for problem students, such as bullies, those with anger issues, oppositional defiant disorder, or ADHD. Mark and Christine Boynton are both former teachers and principals. Annotation ©2006 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Administration , General",
        "Publisher": "ASCD",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "A Survey of the New Testament",
        "Authors": "By Gundry, Robert Horton",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Pressure Cooking for Everyone",
        "Authors": "By Rodgers, Rick, Ward, Arlene, and Russell, Kathryn (PHT)",
        "Description": "The pressure's on! These days who isn't looking to get a great meal on the table without a lot of time in the kitchen? Fast, foolproof, and extremely versatile, Pressure Cooking for Everyone is the answer for every busy cook. Now that pressure cookers are safe and easier to use than ever before (gone are the days of spaghetti-sauce-on-the-ceiling fiascos), author and acclaimed cooking teacher Rick Rodgers is here to prove that nearly everything can be cooked betterand fasterunder pressure. An enclosed system, pressure cooking locks in flavor and nutrients. From Hearty Lentil and Pasta Soup to Five-Spice Pork Roast, Butternut Squash Risotto, and even creamy Orange-Chocolate Marble Cheesecake (who knew?), Pressure Cooking for Everyone reveals the secrets behind dozens of succulent dishes. Chock-full of great information and lavishly illustrated with beautiful color photographs, Pressure Cooking for Everyone is the perfect companion to every pressure cooker.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Weight Watchers New Complete Cookbook",
        "Authors": "By Weight Watchers International (EDT)",
        "Description": "Today, Weight Watchers knows that losing weight is all about balance and variety and Weight Watchers New Complete Cookbook reflects that trend. Whether it's a quick after-work meal, a fancy dinner, a family favorite or an exotic new entrée you crave, Weight Watchers has whipped up a batch of tasty recipes that combine fresh, wholesome ingredients with low-fat cooking techniques in a recipe collection you'll use for years to come.  Sprinkled throughout Weight Watchers New Complete Cookbook are handy tips for leftovers, the inside scoop on how Weight Watchers tamed the calories and fat, and helpful hints for getting meals on the table faster. What's more, each recipe includes POINTS® as well as complete nutrition information. As a bonus, you'll find basics on the Weight Watchers 1.2.3. SUCCESS™ PLAN and great ideas for helping you on the road to weight loss.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Weight Watchers Publishing Group",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Cliffs Notes on Dostoevsky's Crime and Punishment",
        "Authors": "By Roberts, James Lamar, Carey, Gary, and Roberts, James Lamar (EDT)",
        "Description": "Cliffs Test Preparation Guides help students prepare for and improve their performance on standardized tests ACT Preparation Guide CBEST Preparation Guide CLAST Preparation Guide ELM Review GMAT Preparation Guide GRE Preparation Guide LSAT Preparation Guide MAT Preparation Guide MATH Review for Standardized Tests MSAT Preparation Guide Memory Power for Exams Police Officer Examination Preparation Guide Police Sergeant Examination Preparation Guide Police Management Examinations Preparation Guide Postal Examinations Preparation Guide Praxis I: PPST Preparation Guide Praxis II: NTE Core Battery Preparation Guide SAT Preparation Guide SAT II Writing Preparation Guide TASP Preparation Guide TOEFL Preparation Guide with 2 cassettes Advanced Practice for the TOEFL with 2 cassettes Verbal Review for Standardized Tests Writing Proficiency Examinations You Can Pass the GED Cliffs Quick Reviews help students in introductory college courses or Advanced Placement classes Algebra I Algebra II Anatomy & Physiology Basic Math and Pre-Algebra Biology Calculus Chemistry Differential Equations Economics Geometry Linear Algebra Microbiology Physics Statistics Trigonometry Cliffs Advanced Placement Preparation Guides help high school students taking Advanced Placement courses to earn college credit AP Biology AP Calculus AB AP Chemistry AP English Language & Composition AP English Literature & Composition AP United States History Cliffs Complete Study Editions are comprehensive study guides with complete text, running commentary and glossary Chaucer's Prologue Chaucer's Wife of Bath Hamlet Julius Caesar King Henry IV, Part I King Lear Macbeth The Merchant of Venice Othello Romeo and Juliet The Tempest Twelfth Night See inside back cover for listing of Cliffs Notes titles Registered trademarks include: GRE, MSAT, the Praxis Series, and TOEFL (Educational Testing Service): AP, Advanced Placement Program, and SAT (College Entrance Examination Board); GMAT (Graduate Management Admission Council); and LSAT (Law School Admission Council.) Crime and Punishment",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1963"
        }
    },
    {
        "Title": "Justice Deferred",
        "Authors": "By Williams, Len",
        "Description": "A terrifying novel inspired by a true story follows a father in search of his lost son, and closure--a journey that will take him into the heart of the nation's criminal justice system and force a confrontation with a cold-hearted killer.",
        "Category": " Fiction , Legal",
        "Publisher": "Welcome Rain Publishers",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Cliffsnotes Babbitt",
        "Authors": "By Carey, Gary",
        "Description": "Shooting arrows at American business and the ethic of self-advancement, Lewis gives us Babbitt, a social-climbing, hopelessly middle-class oaf. By skewering the borgeousie, Babbitt gives us social criticism and a new type of character that reappears in American arts and letters.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliff Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "Cliffs Notes: Jude the Obscure",
        "Authors": "By Thompson, Frank H. (EDT)",
        "Description": "A sad tale of thwarted love, interrupted dreams, and life complications, Jude The Obscure is a chronicle of poverty and puts a focused eye on social conventions. The book caused such a shock when first published that Hardy gave up fiction entirely, writing only in poetry from that time on.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliff Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1966"
        }
    },
    {
        "Title": "CliffsNotes on Hardy's Tess of the d'Urbervilles",
        "Authors": "By Force, Lorraine M.",
        "Description": "Cliffs Test Preparation Guides help students prepare for and improve their performance on standardized tests ACT Preparation Guide CBEST Preparation Guide CLAST Preparation Guide ELM Review GMAT Preparation Guide GRE Preparation Guide LSAT Preparation Guide MAT Preparation Guide MATH Review for Standardized Tests MSAT Preparation Guide Memory Power for Exams Police Officer Examination Preparation Guide Police Sergeant Examination Preparation Guide Police Management Examinations Preparation Guide Postal Examinations Preparation Guide Praxis I: PPST Preparation Guide Praxis II: NTE Core Battery Preparation Guide SAT Preparation Guide SAT II Writing Preparation Guide TASP Preparation Guide TOEFL Preparation Guide with 2 cassettes Advanced Practice for the TOEFL with 2 cassettes Verbal Review for Standardized Tests Writing Proficiency Examinations You Can Pass the GED Cliffs Quick Reviews help students in introductory college courses or Advanced Placement classes Algebra I Algebra II Anatomy & Physiology Basic Math and Pre-Algebra Biology Calculus Chemistry Differential Equations Economics Geometry Linear Algebra Microbiology Physics Statistics Trigonometry Cliffs Advanced Placement Preparation Guides help high school students taking Advanced Placement courses to earn college credit AP Biology AP Calculus AB AP Chemistry AP English Language & Composition AP English Literature & Composition AP United States History Cliffs Complete Study Editions are comprehensive study guides with complete text, running commentary and glossary Chaucer's Prologue Chaucer's Wife of Bath Hamlet Julius Caesar King Henry IV, Part I King Lear Macbeth The Merchant of Venice Othello Romeo and Juliet The Tempest Twelfth Night See inside back cover for listing of Cliffs Notes titles Registered trademarks include: GRE, MSAT, the Praxis Series, and TOEFL (Educational Testing Service): AP, Advanced Placement Program, and SAT (College Entrance Examination Board); GMAT (Graduate Management Admission Council); and LSAT (Law School Admission Council.) Tess of the D'urbervilles",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliff Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1966"
        }
    },
    {
        "Title": "How You Are Changing: For Discussion or Individual Use (Learning About Sex)",
        "Authors": "By Graver, Jane",
        "Description": "Discusses sexuality from a Christian perspective",
        "Category": " Juvenile Nonfiction , Religious , Christian , General",
        "Publisher": "Concordia Pub. House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "THE FOURTH HAND. John. Irving",
        "Authors": "By Irving, John",
        "Description": "",
        "Category": "",
        "Publisher": "Random House (2001).",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Special Applications: Motor Drives, Underwater Photography and Auxiliary Systems (The Nikon Handbook Series)",
        "Authors": "By Joseph D. Cooper, Joseph C. Abbott",
        "Description": "",
        "Category": "",
        "Publisher": "Amphoto",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "How Many Americans",
        "Authors": "By Bouvier, Leon F., Grant, Lindsey, and Ras, B. (EDT)",
        "Description": "Assesses the impact of immigration on the environment, and argues for less immigration and behavioral changes to minimize environmental harm",
        "Category": " Social Science , General",
        "Publisher": "Sierra Club Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Art of Teaching Reading",
        "Authors": "By Calkins, Lucy McCormick and Cunningham, Peter (PHT)",
        "Description": "Written in Calkins' graceful and passionate style, The Art of Teaching Reading serves as an eloquent and desperately needed reminder of what matters most in teaching.Incredibly valuable resource for current and future teachers and educators. Offers a wealth of practical classroom examples to demonstrate principles and methods in practice.\"I can think of no one in New York City who is more trusted by school people than Lucy,\" - Judith Rizzo, Deputy Chancellor for Instruction, New York City Board of Education.In The Art of Teaching Reading, nationally acclaimed educator Lucy Calkins offers a compelling glimpse into the methods, insights and day-to-day classroom practices which have helped hundreds of teachers do more in the teaching of reading than most dreamt possible. This is the story of brilliant teachers whose children learn to read with eagerness and to talk and write in stunning ways about their reading. Full of inspirational classroom stories,The Art of Teaching Reading is even more powerful when one considers that the methods Calkins describes are transforming teaching practices across the largest school district in the world.Lucy Calkins is a Professor of Curriculum and Teaching at Teachers College, Columbia University, and an acclaimed speaker, with frequent keynote addresses at conferences across the country. She is also the author (or co-author) of numerous books, including the best-selling sister volume, The Art of Teaching Writing (Heinemann),Raising Lifelong Learners: A Parents' Guide (Perseus Books), and A Teacher's Guide to Standardized Reading Tests: Knowledge is Power (Heinemann).",
        "Category": " Education , Teaching Methods & Materials , Reading & Phonics",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Great Italian Cookbook",
        "Authors": "By Italian Academy of Cookery",
        "Description": "Features over 1000 recipes for traditional and contemporary Italian dishes",
        "Category": " Cooking , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "8.46",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "CliffsNotes on Virgil's The Aeneid",
        "Authors": "By Milch, Robert J.",
        "Description": "Cliffs Test Preparation Guides help students prepare for and improve their performance on standardized tests ACT Preparation Guide CBEST Preparation Guide CLAST Preparation Guide ELM Review GMAT Preparation Guide GRE Preparation Guide LSAT Preparation Guide MAT Preparation Guide MATH Review for Standardized Tests MSAT Preparation Guide Memory Power for Exams Police Officer Examination Preparation Guide Police Sergeant Examination Preparation Guide Police Management Examinations Preparation Guide Postal Examinations Preparation Guide Praxis I: PPST Preparation Guide Praxis II: NTE Core Battery Preparation Guide SAT Preparation Guide SAT II Writing Preparation Guide TASP Preparation Guide TOEFL Preparation Guide with 2 cassettes Advanced Practice for the TOEFL with 2 cassettes Verbal Review for Standardized Tests Writing Proficiency Examinations You Can Pass the GED Cliffs Quick Reviews help students in introductory college courses or Advanced Placement classes Algebra I Algebra II Anatomy & Physiology Basic Math and Pre-Algebra Biology Calculus Chemistry Differential Equations Economics Geometry Linear Algebra Microbiology Physics Statistics Trigonometry Cliffs Advanced Placement Preparation Guides help high school students taking Advanced Placement courses to earn college credit AP Biology AP Calculus AB AP Chemistry AP English Language & Composition AP English Literature & Composition AP United States History Cliffs Complete Study Editions are comprehensive study guides with complete text, running commentary and glossary Chaucer's Prologue Chaucer's Wife of Bath Hamlet Julius Caesar King Henry IV, Part I King Lear Macbeth The Merchant of Venice Othello Romeo and Juliet The Tempest Twelfth Night See inside back cover for listing of Cliffs Notes titles Registered trademarks include: GRE, MSAT, the Praxis Series, and TOEFL (Educational Testing Service): AP, Advanced Placement Program, and SAT (College Entrance Examination Board); GMAT (Graduate Management Admission Council); and LSAT (Law School Admission Council.) The Aeneid",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1963"
        }
    },
    {
        "Title": "The Jungle (Cliffs Notes)",
        "Authors": "By Thompson, F. H. (EDT)",
        "Description": "Cliffs Test Preparation Guides help students prepare for and improve their performance on standardized tests ACT Preparation Guide CBEST Preparation Guide CLAST Preparation Guide ELM Review GMAT Preparation Guide GRE Preparation Guide LSAT Preparation Guide MAT Preparation Guide MATH Review for Standardized Tests MSAT Preparation Guide Memory Power for Exams Police Officer Examination Preparation Guide Police Sergeant Examination Preparation Guide Police Management Examinations Preparation Guide Postal Examinations Preparation Guide Praxis I: PPST Preparation Guide Praxis II: NTE Core Battery Preparation Guide SAT Preparation Guide SAT II Writing Preparation Guide TASP Preparation Guide TOEFL Preparation Guide with 2 cassettes Advanced Practice for the TOEFL with 2 cassettes Verbal Review for Standardized Tests Writing Proficiency Examinations You Can Pass the GED Cliffs Quick Reviews help students in introductory college courses or Advanced Placement classes Algebra I Algebra II Anatomy & Physiology Basic Math and Pre-Algebra Biology Calculus Chemistry Differential Equations Economics Geometry Linear Algebra Microbiology Physics Statistics Trigonometry Cliffs Advanced Placement Preparation Guides help high school students taking Advanced Placement courses to earn college credit AP Biology AP Calculus AB AP Chemistry AP English Language & Composition AP English Literature & Composition AP United States History Cliffs Complete Study Editions are comprehensive study guides with complete text, running commentary and glossary Chaucer's Prologue Chaucer's Wife of Bath Hamlet Julius Caesar King Henry IV, Part I King Lear Macbeth The Merchant of Venice Othello Romeo and Juliet The Tempest Twelfth Night See inside back cover for listing of Cliffs Notes titles Registered trademarks include: GRE, MSAT, the Praxis Series, and TOEFL (Educational Testing Service): AP, Advanced Placement Program, and SAT (College Entrance Examination Board); GMAT (Graduate Management Admission Council); and LSAT (Law School Admission Council.) The Jungle",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1970"
        }
    },
    {
        "Title": "A Passage To India (Cliffs Notes)",
        "Authors": "By Ostrander, Norma",
        "Description": "This novel puts colonialism under the microscope and examines racism in India during the period of English colonization. Forster gives us a tale of a rare friendship and the delicate threads that keep it alive - or allow it to fall apart.This concise supplement to E.M. Forster's A Passage to India helps students understand the overall structure of the novel, actions and motivations of the characters, and the social and cultural perspectives of the author.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1964"
        }
    },
    {
        "Title": "Shakespeare's Richard II (Cliffs Notes)",
        "Authors": "By Calandra, Denis M.",
        "Description": "This is the drama of a king too fine and dandy to be an effective ruler. Faulted with incompetence and hoodwinked by his court, he loses his kingdom as the result of following his pleasure's course.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliff Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1960"
        }
    },
    {
        "Title": "How to Fight Cancer & Win",
        "Authors": "By Fischer, William L.",
        "Description": "",
        "Category": "",
        "Publisher": "Agora Health Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Mom’s Needs, Dad’s Needs: Keeping Romance Alive Even After the Kids Arrive",
        "Authors": "By Harley, Willard F., Jr.",
        "Description": "",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Long Life Cookbook (Long Life Book)",
        "Authors": "By Casale, Anne",
        "Description": "A compilation of nearly two hundred recipes specifically created to meet the needs of people over age fifty",
        "Category": " Cooking , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Agamemnon, The Choephori & The Eumenides (Cliffs Notes)",
        "Authors": "By Milch, Robert",
        "Description": "One of the most successful playwrights of ancient Greece, Aeschylus wrote nearly 90 plays, but today only 7 survive. Credited with introducing a second actor onstage, his plays retell the battles, victories, and social ramifications of life in the golden days of Athens. These plays are 2,500 years old and still performed, for they speak directly to the human psyche.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliff Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1967"
        }
    },
    {
        "Title": "James' Daisy Miller & Turn of the Screw (Cliffs Notes)",
        "Authors": "By Roberts, James L.",
        "Description": "The original CliffsNotes study guides offer a look into critical elements and ideas within classic works of literature.CliffsNotes on Daisy Miller & Turn of the Screw takes you into two of Henry James' classic works, one that centers on a pretty, spontaneous American girl traveling abroad and the other about the haunting of a governess in charge of two orphans.Following the stories of young travelers who venture beyond their native United States, this study guide explores James' special brand of realism. Profiles of the author's life, background, and style allow a glimpse into his frequent focus — the differences between American innocence and European sophistication. Other features that help you figure out this important work includeCharacter descriptions and plot summaries for each novelSummaries and commentaries for both booksEssays on James' techniques and contributions to the art of fictionReview questions for each of the two worksClassic literature or modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1965"
        }
    },
    {
        "Title": "Working Across Boundaries: Making Collaboration Work in Government and Nonprofit Organizations (JOSSEY BASS NONPROFIT & PUBLIC MANAGEMENT SERIES)",
        "Authors": "By Linden, Russell M.",
        "Description": "Working Across Boundaries is a practical guide for nonprofit and government professionals who want to learn the techniques and strategies of successful collaboration. Written by Russell M. Linden, one of the most widely recognized experts in organizational change, this no nonsense book shows how to make collaboration work in the real world. It offers practitioners a framework for developing collaborative relationships and shows them how to adopt strategies that have proven to be successful with a wide range of organizations. Filled with in-depth case studies—including a particularly challenging case in which police officers and social workers overcome the inherent differences in their cultures to help abused children—the book clearly shows how organizations have dealt with the hard issues of collaboration. Working Across Boundaries includes Information on how to select potential partnersGuidelines for determining what kinds of projects lend themselves to collaboration and which do notSuggestions on how to avoid common pitfalls of collaborationStrategies proven to work consistentlyThe phases most collaborative projects go throughThe nature of collaborative leadership",
        "Category": " Business & Economics , Nonprofit Organizations & Charities , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Beyond : Visions Of The Interplanetary Probes",
        "Authors": "By Benson, Michael and Clarke, Arthur C. (FRW)",
        "Description": "Since the 1960s the National Aeronautics and Space Administration has been sending unmanned satellites to explore the planets, moons, and sun. These probes have amassed a stunning visual record of other worlds, revealing not one but scores of new frontiers, from rust-red Mars to the ethereal rings of Saturn.Author Michael Benson has spent years compiling and digitally processing the best of these images. In Beyond this \"deskbound cosmic pilgrim\" (Atlantic Monthly) has pulled together the most spectacular of them into one volume that presents these photographs for the first time as art. The resulting book consists of two parts: the first is a spectacular visual tour of the solar system, with views ever bit as compelling as the work of the great landscape photographers on earth; the second is a series of essays that explain the story behind these photographs: the history of the probes' journeys, how they work, and why they were built. This book shows us how modern science has revealed the astonishing beauty and mystery of the solar system and its awe-inspiring worlds far beyond any places human beings have ever directly observed.",
        "Category": " Photography , General",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "8.3",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Austen's Emma (Cliffs Notes)",
        "Authors": "By Roundtree, Thomas J.",
        "Description": "The original CliffsNotes study guides offer a look into key elements and ideas within classic works of literature.CliffsNotes on Emma explores a satiric novel that stabs at manners and social classes, all the while delivering entertainment in a mild comic tone and sharing a lesson for the moralist.Following the heroine’s slow and bumpy growth from self-deception to self-knowledge, this study guide provides summaries and commentaries on each chapter within the three-volume plot structure.Other features that help you figure out this important work includeLife and background of the authorIntroduction to and synopsis of the novelCritical analysis of plot, setting, point of view, characters, theme, and styleReview questions and selected bibliography for further researchClassic literature or modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "CliffsNotes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1967"
        }
    },
    {
        "Title": "Lilo and Stitch Read-Aloud Storybook",
        "Authors": "By Hapka, Catherine",
        "Description": "Get ready for some nonstop fun and adventure with Lilo & Stitch, the story of a lonely Hawaiian girl who unknowingly adopts an escaped alien as her pet! Kids can relive all the excitement of Disney’s newest animated feature film with this 64-page, full-color Read-Aloud Storybook.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Red Pony, Chrysanthemums and Flight (Cliffs Notes)",
        "Authors": "By Carey, G. K.",
        "Description": "This short novel concerns a boy's initiation into manhood. A gift of a horse brings with it many lessons for our young protagonist, and we watch as he wrestles with growing up.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1978"
        }
    },
    {
        "Title": "Shakespeare's As You Like It (Cliffs Notes)",
        "Authors": "By Smith, Tom (EDT)",
        "Description": "As You Like It tracks the travails of young lovers and despotic rulers as they chase one another from the palace of Duke Frederick to the Forest of Arden. Shakespeare's classic work weaves together greedy inheritors, despotic rulers, a cross-dressing princess, and some magic before drawing to a dramatic close.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "The Crucible (Notes)",
        "Authors": "By Paton, Alan",
        "Description": "",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1968"
        }
    },
    {
        "Title": "Gryphon in Glory (Witch World: The Gryphon Saga) (Del Rey Books)",
        "Authors": "By Andre Norton",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "Lean and Green: Profit for Your Workplace and the Environment",
        "Authors": "By Gordon, Pamela J.",
        "Description": "When it comes to believing that business can be profitable and environmentally sensitive, cynics abound on both sides. But in Lean and Green, Pamela Gordon proves that capitalism and environmentalism are not mutually exclusive-quite the contrary. She shows how \"green\" business practices enable organizations to save millions, even billions of dollars each year. Lean and Gree chronicles over one hundred examples of how people in twenty different organizations around the world-from clerks, farmers, and city employees to chemists and executives-have strengthened environmental practices and the balance sheet. She details waste-saving, profit-building acts as basic as Linda Gee at LSI Logic digging out usable pre-worn shoe covers to wear in the clean room, and as broad as the city of Santa Monica paving residential streets with white top to reduce urban heat and increase surface longevity. Drawing on her background as a leading business consultant, Gordon shows readers precisely how to sell their environmental ideas to management. She describes how to make the case in no-nonsense business terms, set concrete goals that the new practices will achieve, measure the economic results of the new practices, and make sure the right people hear about the results so that environmental initiatives continue. Each chapter includes a \"Making It Easy\" list of action steps for implementing lean and green improvements in the workplace easily and immediately. Lean and Green will inspire employees and employers alike to explore creative ways to simultaneously save the planet and bolster the bottom line.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "6.93",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Cover Her Face (Adam Dalgliesh Mystery Series #1)",
        "Authors": "By P. D James",
        "Description": "",
        "Category": "",
        "Publisher": "Popular Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Lord of the Rings and The Hobbit (Cliffs Notes)",
        "Authors": "By Hardy, Gene B.",
        "Description": "Join the journey through Middle-earth in the study guide of these two epic fantasies suggestive of life in medieval days, a classical battle between good and evil and the quest for a magical ring. This guide covers all four volumes of this unforgettable fantasy.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "CliffsNotes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1977"
        }
    },
    {
        "Title": "I Left My Back Door Open",
        "Authors": "By Sinclair, April",
        "Description": "A romantic voyage of self-discovery for African-American DJ Daphne Dupree begins when the lonely Chicagoan meets Skylar, a sexual harassment mediator, and finds that a budding and blossoming relationship can lead to a true vision of self. 75,000 first printing. Tour.",
        "Category": " Fiction , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "The Winter's Tale (Cliffs Notes)",
        "Authors": "By McLellan, Evelyn",
        "Description": "What happens when a king is dominated by jealousy? After ruining the lives of those close to him, he finally learns about life and is offered a second chance. A subplot of lovers torn by class differences ends with a measure of happiness, and the final scene of the drama is upbeat.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "John Wiley & Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Salinger's the Catcher in the Rye (Cliffs Notes)",
        "Authors": "By Kaplan, R. B. (EDT)",
        "Description": "",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1965"
        }
    },
    {
        "Title": "The Judgment (Charley Sloan Courtroom Thrillers)",
        "Authors": "By Coughlin, William Jeremiah",
        "Description": "The death of innocenceIn a rural area outside of Detroit, bodies are being found in the snow. One after another. Neatly washed, wrapped in platic, methodically laid out like sleeping angels. And very, very young.The birth of evilForty miles away and at the other end of the world, an honest cop, the deputy chief chief of police, has been framed for a corruption charge. In a world of big-city politics, he wants ace lawyer Charley Sloan to get him off.The only hopePulled into the two very different cases, Charley faces the heat of a perplexnig serial murder investigation and the heavey hitters of the Motor City's inner circle. Interviewing witnesses, putting together clues, Charley Sloan, a man who has been at the bottom and at the top, is about to uncover the explosive difference between true innocence-and the most dangerous guilt of all...The Judgement",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Tell Me Lies",
        "Authors": "By Crusie, Jennifer",
        "Description": "Maddie Faraday's life would be perfect--if it weren't forher cheating husbandher suspicious daughterher gossipy motherher secretive best friendher nosy neighbors,and that guy she lost her virginity to twenty years ago...In Tell Me Lies, Jennifer Cruise dishes up a funny, sexy, suspenseful novel about small-town secrets, big-time betrayals and the redemptive power of love, laughter and chocolate brownies.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Invent Business Opportunities No One Else Can Imagine",
        "Authors": "By Turock, Art",
        "Description": "",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Career Pr Inc",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Bearing an Hourglass (Incarnations of Immortality)",
        "Authors": "By Anthony, Piers",
        "Description": "Like On a Pale Horse, this second, complete-in-itself novel of the Incarnations of Immortality is a richly imagined and always fascinating story. And again, Piers Anthony adds to his gripping plot a serious, though-provoking study of good and evil. When life seemed pointless to Norton, he accepted the position as the Incarnation of Time, even though it meant living backward from present to past. The other seemily all-powerful Incarnates of Immortality—Death, Fate, War, and Nature—made him welcome. Even Satan greeted him with gifts. But he soon discovered that the gifts were cunning traps. While he had been distracted, he had become enmeshed in a complex scheme of the Evil One to destroy all that was good. In the end, armed with only the Hourglass, Norton was forced to confront the immense power of Satan directly. And though Satan banished him to Hell, he was resolved to fight on.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Real-World Intelligence: Organized Information for Executives",
        "Authors": "By Meyer, Herbert E.",
        "Description": "",
        "Category": "",
        "Publisher": "Grove Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Lotus in the Fire: The Healing Power of Zen",
        "Authors": "By Bedard, Jim",
        "Description": "In 1995, Jim Bedard, a martial artist and Zen student, was diagnosed with acute myeloid leukemia and given ten days to live. This is the story of how he used his spiritual strength to bring himself into full contact with a death sentence as well as with painful medical treatment, including chemotherapy and a bone marrow transplant. It is also the inspiring story of how the faith of his family, Zen teacher, close friends, and the Buddhist community helped him.  Bedard's story introduces us to Zen practices that can help us cope with emotional turmoil and physical pain. His words on compassion, on karma, on gratitude, on impermanence and the inevitability of death—all from a nonsmoking, meditating, aerobically fit vegetarian who became suddenly and \"terminally\" ill—are inspiring and sometimes funny. He explores, too, the fundamental question of suffering, its cause, and how the teachings of karma can help us accept illness, ultimately using it as an opportunity to deepen our spiritual lives.",
        "Category": " Philosophy , Zen",
        "Publisher": "Shambhala",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Fluffy's 100th Day At School",
        "Authors": "By Smith, Mavis (ILT) and McMullan, Kate",
        "Description": "Fluffy the guinea pig enjoys himself when Ms. Day's class has a party to celebrate the one hundredth day of school. Original.",
        "Category": "",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Curious George Visits the Zoo",
        "Authors": "By Rey, H. A., Rey, Margret, and Shalleck, Alan J. (EDT)",
        "Description": "Curious George and the man with the yellow hat visit the zoo. A hungry Curious George snatches a pail of bananas from the zoo keeper. Though he shouldn't have taken the bananas, George soon changes the zookeeper's shouts to praise with his clever, helpful ways.",
        "Category": " Juvenile Fiction , Animals , Apes, Monkeys, etc.",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Henry And Mudge First Book",
        "Authors": "By Rylant, Cynthia and Stevenson, Sucie",
        "Description": "The first book in the acclaimed Ready-to-Read series from Newbery Medalist Cynthia Rylant featuring Henry and his lovable 180-pound dog, Mudge.Henry, feeling lonely on a street without any other children, finds companionship and love in a big dog named Mudge.",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Henry And Mudge Take The Big Test: Ready-To-Read Level 2 (Paper)",
        "Authors": "By Rylant, Cynthia and Stevenson, Sucie (ILT)",
        "Description": "Henry helps his dog Mudge learn some manners in this tenth Ready-to-Read book of their adventures.Henry and his 180-pound dog Mudge are best friends forever. And they're off to a school for dogs so Mudge can learn some manners!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    }
]