[
    {
        "Title": "Murder In Scorpio (An Elizabeth Chase Mystery)",
        "Authors": "By Lawrence, Martha C.",
        "Description": "She's a California P.I. with something extra-an instinct for trouble and a special sense of danger. Elizabeth Chase is used to funny looks and disbelief when she tells people she uses the paranormal and astrology to help her investigations. But when Sergeant Tom McGowan of the Escondido Police Department needs help in exploring the not-so-accidental death of an old friend, he turns to her.Instantly, Elizabeth is absorbed by the case, and searches the stars and her sensitive psyche for answers. Janic Freeman, the dead woman, had a lot of friends, but as Elizabeth scans the artifacts of Janice's life and meets the people she know, she begins to pick up a few unpleasant auras that have the unmistakable color of evil. Trying to pin down Janice's last fateful day of life, Elizabeth charts her final moves-and follows the celestial signs to cold-blooded murder.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "How To Paint & Draw Landscapes",
        "Authors": "By Daniels, Alfred",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Petropolis",
        "Authors": "By Ulinich, Anya",
        "Description": "In her stunning debut novel, Anya Ulinich delivers a funny and unforgettable story of a Russian mail-order bride trying to find her place in America. After losing her father, her boyfriend, and her baby, Sasha Goldberg decides that getting herself to the United States is the surest path to deliverance. But she finds that life in Phoenix with her Red Lobster-loving fiancé isn't much better than life in Siberia, and so she treks across America on a misadventure-filled search for her long- lost father. Petropolis is a deeply moving story about the unexpected connections that create a family and the faraway places that we end up calling home.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Trevayne",
        "Authors": "By Ludlum, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Beyond Belief: Finding the Strength to Come Back",
        "Authors": "By Hamilton, Josh and Keown, Tim",
        "Description": "Josh Hamilton was the first player chosen in the first round of the 1999 baseball draft. He was destined to be one of those rare \"high-character \" superstars.  But in 2001, working his way from the minors to the majors, all of the plans for Josh went off the rails in a moment of weakness.  What followed was a 4-year nightmare of drugs and alcohol, estrangement from friends and family, and his eventual suspension from baseball. BEYOND BELIEF details the events that led up to the derailment. Josh explains how a young man destined for fame and wealth could allow his life to be taken over by drugs and alcohol. But it is also the memoir of a spiritual journey that breaks through pain and heartbreak and leads to the rebirth of his major-league career.Josh Hamilton makes no excuses and places no blame on anyone other than himself.  He takes responsibility for his poor decisions and believes his story can help millions who battle the same demons.  \"I have been given a platform to tell my story\" he says. \"I pray every night I am a good messenger.\"",
        "Category": " Self-help , Substance Abuse & Addictions , General",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "A Killer's Kiss (Victor Carl Series, 7)",
        "Authors": "By Lashner, William",
        "Description": "\"You want to know what deceit tastes like?It's sweet. Like honey.\"Over the course of his shady legal career, Victor Carl has made a host of bad decisions, but letting his ex-fiancée, Julia, fall back into his life and into his bed might be the worst. Julia's husband has just been murdered, her fingerprints are all over the crime scene, and $1.7 million in cash has inexplicably vanished. If Victor didn't know better, he might think Julia was setting him up.But Julia is drop-dead gorgeous and lust trumps reason 24/7 in Victor Carl's world. Victor wants to believe the Beatles were right, that all you need is love. But why are the cops accusing Victor of murder? And what is the murder weapon doing in his bedroom? And who is the dead woman in the freezer?Suddenly, the wary lawyer is no longer fighting to rekindle a lost love . . . he's fighting to save himself.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Paper Airplane Book",
        "Authors": "By Simon, Seymour",
        "Description": "How to build great paper airplanes and learn what makes them fly! What keeps a paper airplane in the air? How can you make a paper airplane go for a really long flight? How can you make a cool stunt plane that loops, turns, and dives at will?Learn the answers to these questions and many more!This book details not only how to design amazing paper airplanes, but also the principles of flight and how planes are able to fly. The Paper Airplane Book is full of experiments and suggestions that will allow readers to design their own airplanes while introducing them to the physics and science of flight.“Lots of information about the principles of flight and the ‘hows’ and ‘whys’ of airplane design.”—Children’s Literature“The principles of flight and airplane design are elucidated in this book of entertaining experiments with paper airplanes.”—Booklist",
        "Category": " Juvenile Nonfiction , Science & Nature , Physics",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1976"
        }
    },
    {
        "Title": "The Romney Gay A B C",
        "Authors": "By Gay, Romney",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "21.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1946"
        }
    },
    {
        "Title": "Schaum's Outline of Spanish Grammar (4th edition)",
        "Authors": "By Schmitt, Conrad J.",
        "Description": "Students can master Spanish grammar with this high-performance study guide. This book will help them cut study time, hone speaking and writing skills, and achieve their personal best on exams. Features quick drills for reinforcing grammar, verb charts, hundreds of exercises with carefully explained solutions, and thousands of practice test exercises with answers. Now updated to include the latest Latin American vernacular. Excellent for school and for travel.",
        "Category": " Language Arts & Disciplines , Translating & Interpreting",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Cruel Mother: A Meg Halloran Mystery",
        "Authors": "By Lapierre, Janet",
        "Description": "The Cruel Mother by Janet Lapierre released on Jun 24, 1991 is available now for purchase.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Worldwide Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "The Weekend Woodworker: 101 Easy-To-Build Projects",
        "Authors": "By Nelson, John A.",
        "Description": "Provides diagrams and instructions for making cupboards, toys, jewelry boxes, nightstands, wind chimes, clocks, benches, easels, and desks",
        "Category": " Technology & Engineering , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Wood Finishing (Art of Woodworking)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " Crafts & Hobbies , Woodwork",
        "Publisher": "Time Life Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Cabinetmaking (The Art of Woodworking)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " Crafts & Hobbies , Woodwork",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Shoes in the Freezer, Beer in the Flower Bed: And Other Down-Home Tips for House and Garden",
        "Authors": "By Wilen, Lydia and Wilen, Joan",
        "Description": "Practical, informative, and great fun to read, Shoes in the Freezer, Beer in the Flower Bed offers hundreds of time- and money-saving tips for preparing, cleaning, organizing, and maintaining your house and garden.And interspersed throughout the pages are folk beliefs and suggestions from every culture: for example, if you eat chocolate right before bed, you'll have romantic dreams; and if a cat appears at your wedding, your union will be blessed.",
        "Category": " House & Home , Repair",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Witch & Curse (Wicked)",
        "Authors": "By Holder, Nancy and Viguie, Debbie",
        "Description": "Holly Cathers's world shatters when her parents are killed in a terrible accident. Wrenched from her home in San Francisco, she is sent to Seattle to live with her relatives, Aunt Marie-Claire and her twin cousins, Amanda and Nicole.   In her new home, Holly's sorrow and grief soon give way to bewilderment at the strange incidents going on around her. Such as how any wish she whispers to her cat seems to come true. Or the way a friend is injured after a freak attack from a vicious falcon. And there's the undeniable, magnetic attraction to a boy Holly barely knows.   Holly, Amanda, and Nicole are about to be launced into a dark legacy of witches, secrets, and alliances, where ancient magics yield dangerous results. The girls will assume their roles in an intergenerational feud beyond their wildest imaginations...and in doing so, will attempt to fulfill their shared destiny.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Advanced woodworking (Home repair and improvement)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": "",
        "Publisher": "Time Life Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Guest Shot",
        "Authors": "By Locke, David",
        "Description": "At first everyone thought he was another crank caller, but after they started taping him for a talk show they, and the viewing audience, realized that he was a real-life serial killer, talking about his victims, and his next target.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "What Makes Day and Night",
        "Authors": "By Branley, Franklyn M",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Y Crowell Company",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "World Champion Openings (World Champion Series)",
        "Authors": "By Schiller, Eric",
        "Description": "",
        "Category": " Games , General",
        "Publisher": "Cardoza",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "A Handbook of Fighter Aircraft",
        "Authors": "By Crosby, Francis",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Reading the Man: A Portrait of Robert E. Lee Through His Private Letters",
        "Authors": "By Pryor, Elizabeth Brown",
        "Description": "Published to coincide with the 200th anniversary of the Confederate general's birth, a portrait based on his unpublished personal correspondence offers insight into the lesser-known complexities of his personality, in a collection of essays that covers such topics as Lee's early years, his relationships with family and slaves, and his thoughts on military strategy.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The New Annals of the Civil War",
        "Authors": "By Cozzens, Peter (EDT) and Girardi, Robert I. (EDT)",
        "Description": "Selected from nearly 700 articles that first appeared in the Philadelphia Weekly Times from 1877 to 1889. Corrections of misconceptions about the Civil War. Compelling perspectives on familiar campaigns, personalities, and controversies.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Grasslands (Audubon Society Nature Guides)",
        "Authors": "By Brown, Lauren",
        "Description": "Surveys the grassland areas of the United States and describes the plants and animals living in American prairies, fields, and meadows",
        "Category": " Science , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Majestic Horse",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Roman Baths, a view over 2000 years",
        "Authors": "By Cunliffe, Barry",
        "Description": "",
        "Category": "",
        "Publisher": "Bath Archaeological Trust",
        "Price Starting With ($)": "11.05",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "A Yuletide Ice Cube Fair (Big Idea Books / VeggieTales)",
        "Authors": "By Vann, Robert (ILT), Eddy, Ron (ILT), and Poth, Karen",
        "Description": "It's that wonderful time of year again---the Yuletide Ice Cube Fair! It's a time of festivity and fun as veggies gather to munch on snow cones, slurp down Slushies, and ice skate on the frozen pond. But the greatest part of all is the Ice Cube Carving Contest! The veggies have been busy! They've carved Christmas feasts, trees, angels, and more. Each one is trying to outdo the other in an effort to win the grand prize! But the smallest of all these ice entries is a carving done by Junior Asparagus---a tiny stable with a shepherd on one knee. Kids will discover that it's not what's grand, or bigger, or best that's most important on Christmas---it's Jesus! Sunday morning values, Saturday morning fun. Now that's the Big Idea! Through imaginative and innovative products, Zonderkidz is feeding young souls",
        "Category": " Juvenile Fiction , Religious , General",
        "Publisher": "Zonderkidz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Unlucky in Law (Nina Reilly)",
        "Authors": "By O'Shaughnessy, Perri",
        "Description": "Nina Reilly takes on the most dangerous and difficult case of her career in New York Times bestselling author Perri O’Shaughnessy’s latest thriller. An ingenious blend of forensic science, history, and gripping suspense, Unlucky in Law pits the tough but compassionate attorney against the most unbeatable adversary of all: the law. Nina has just received a last-minute call from her old boss and mentor in Monterey County, California, where she is enjoying the breathtaking scenery and spending time with her boyfriend, P.I. Paul van Wagoner.  Klaus Pohlmann is in desperate straits and begs Nina to take over a seemingly unwinnable case: A luckless two-time felon named Stefan Wyatt has robbed a grave and made off with the long-buried bones of a Russian émigré. When he is caught and arrested, further devastating evidence found in the grave suggests that Stefan is guilty of a far more deadly crime.A young woman, a classmate of Stefan’s, has been killed, and he is accused of her murder.  Now, as a result of California’s Third Strike law, Wyatt is looking at twenty-five years to life whether he’s convicted of grand theft or murder. Either way, he’s in big trouble. With her client’s blood DNA found in the dead woman’s apartment, Nina faces an uphill battle. Suspecting that her hapless client has been set up, Nina brings in a brilliant forensic pathologist who comes up with a startling theory about the case that could rewrite a crucial page of European history. As the evidence mounts against Nina’s client, Paul launches his own investigation into the shadowy past of the two-decades-old skeleton. But long-held secrets nearly get him killed and reveal a more insidious evil at work—and an extraordinary story dating back to tsarist Russia and the Romanov court. As Wyatt edges closer to the unluckiest verdict of his young life, Nina makes an astounding discovery that just might save her client—or expose a killer who could bury them all. Brilliantly  imagined  and  compulsively  readable,  Unlucky in Law  is a beguiling mix of wrenching drama and gripping action. And it is Perri O’Shaughnessy’s most accomplished novel to date.",
        "Category": " Fiction , Legal",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Fatal Flaw (Victor Carl Series, 3)",
        "Authors": "By Lashner, William",
        "Description": "Some victims deserve nothing less than the truth . . .Ethically adventurous Philadelphia lawyer Victor Carl usually does the right thing, but often for the wrong reasons. When old law school classmate Guy Forrest is accused of murdering his beautiful lover, Hailey Prouix, in their Main Line love nest, Carl agrees to represent him -- while keeping silent about his own prior romantic involvement with the victim, and his present determination to see that his client is punished for the brutal crime. But once Carl sets the machinery of retribution in motion, it may be impossible to stop it, even after his certainty begins to crack. Now Victor Carl must race across the country to uncover shocking truths: Who, really, was Hailey Prouix? And why is a killer still waiting in her shadow?",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Syndrome: A Thriller",
        "Authors": "By Case, John",
        "Description": "“A GLASS-SHATTERING, DIESEL-FUELED, HARD-CHARGING THRILL RIDE OF A READ . . . [John Case is] a confident master working at peak performance.”–LORENZO CARCATERRA   Author of Street Boys and SleepersDr. Jeff Duran suffers from severe panic attacks whenever he ventures outside his home office. And he is inexplicably haunted by mysterious memories. Then, after a troubled patient commits suicide–and her half sister, Adrienne Cope, blames Duran–his life spirals out of control. Suddenly targeted by unknown assassins, he and Adrienne must run for their very lives. Forced to trust each other, they must now work together to unlock the reason why one or both of them is marked for death. For beneath the intrigue lies a dark conspiracy that stretches halfway around the world–and a sinister plot that could change the course of history.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "How War Came: The Immediate Origins of the Second World War",
        "Authors": "By Watt, Donald Cameron",
        "Description": "Depicts the people and events that led to World War II and explains the political situation of that period",
        "Category": " History , Military , World War II",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "The Testament: A Novel (The Testament Series)",
        "Authors": "By Lustbader, Eric",
        "Description": "The hit international thriller from Eric Van Lustbader, the New York Times bestselling author of The Bourne LegacyFor centuries, a hidden splinter sect of the Franciscans has guarded secrets that could transform the world.  Now the safety of those secrets—and much more—depends on one man. Braverman “Bravo” Shaw always knew his father had secrets. But not until Dexter Shaw dies mysteriously does Bravo discover the enormity of his father's life as a high-ranking member of the Order of Gnostic Observatines. For more than eight hundred years, the Order has preserved an ancient cache of documents that could shake Christianity to its foundations.But the rival Knights of St. Clement will stop at nothing to obtain the treasure, and now Bravo is a target and a pawn in an ongoing war far larger and more deadly than any he could have imagined. From New York City to Washington, D.C., to Paris, to Venice, and beyond, the race is on for the quintessential prize...the Testament.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "The Mercy Rule (Dismas Hardy, Book 5)",
        "Authors": "By Lescroart, John T.",
        "Description": "Justice...Once Dismas Hardy was a cop. Now he spends his days in a lawyer's suit, billing hours to a corporate client in a downtown San Francisco office. Hardy's wife and kids like it that way. Then one client changes everything. Compassion...Graham Russo, a former baseball star, is charged with murdering his dying father. Was it suicide, the last desperate act of a dying man? Was it murder? Or mercy?Murder...Now, as a carnival of reporters, activists, cops, lovers, and families throng around the case, Dismas Hardy is going to trial with a client he doesn't trust, a key witness he cannot believe, and a system that almost destroyed him once. For Dismas, this case will challenge everything he believes about the law, about his family, and about himself. Because a chilling truth is beginning to emerge about an old man's lonely death. And what Dismas knows could put him next in line to die. . . .",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Qualitative Research Methods for the Social Sciences (4th Edition)",
        "Authors": "By Berg, Bruce L.",
        "Description": "This book offers the most comprehensive coverage of qualitative techniques of any book on the market today and does it in a way that is easy to read and follow. The author's central purpose remains a desire to instruct inexperienced researchers in ways of effectively collecting, organizing, and making sense of qualitative data, while stressing the importance of ethics in research and in taking the time to properly design and think through any research endeavor. After reading this book, fledgling researchers should be able to design, collect, and analyze data and then present their results to the scientific community.    Considers seven different data collection strategies in detail. Describes focus group interviewing, one of the fastest growing styles of data collection, in detail (Ch. 5), including a new Moderator's Guide that provides the inexperienced focus group facilitator with a step-by-step guide to how the interview should be conducted.  Maintains the emphasis on ethics in research (Ch. 3) including a new section on the President's apology for the Tuskegee Syphilis Study.    For anyone in the social sciences who needs to develop research methodology.",
        "Category": " Social Science , Research",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Man Who Cast Two Shadows (A Mallory Novel)",
        "Authors": "By O'Connell, Carol",
        "Description": "Formerly a child of the streets, now a brilliant computer hacker and NYPD sergeant, Kathleen Mallory's powerful intelligence is matched only by the ferocity with which she pursues her own unpredictable vision of right and wrong. And she will need every bit of that intensity now, in a murder case that strikes close to home in more ways than one.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "A Warrior's Passion",
        "Authors": "By Moore, Margaret",
        "Description": "A Warrior's Passion by Margaret Moore released on Oct 23, 1998 is available now for purchase.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "AMERICA in Prophecy",
        "Authors": "By White, E.G.",
        "Description": "",
        "Category": "",
        "Publisher": "Inspiration Books East",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "1918: War and Peace",
        "Authors": "By Dallas, Gregor",
        "Description": "A renowed historian traces the transition from war to peace across Europe following the Germany's surrender to the French in 1918, as seen from the perspective of five capitals--Berlin, Paris, Washington, London, and Moscow. 12,500 first printing.",
        "Category": " History , Military , World War I",
        "Publisher": "Overlook Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Unwanted Attentions",
        "Authors": "By Beck, K. K.",
        "Description": "Rebecca Kendall is being stalked by Benjamin Knapp, but when his blood is found in her car, she is accused of his murder, and the case seems simple--until Rebecca vanishes and is held hostage by Benjamin",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Walker & Co",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Fair Winds and Far Places",
        "Authors": "By Mann, Zane B.",
        "Description": "",
        "Category": "",
        "Publisher": "Dillon Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1978"
        }
    },
    {
        "Title": "Virginia at War, 1862",
        "Authors": "By Davis, William C. (EDT) and Robertson, James I. (EDT)",
        "Description": "As the Civil War entered its first full calendar year for the Old Dominion, Virginians began to experience the full ramifications of the conflict. Their expectations for the coming year did not prepare them for what was about to happen; in 1862 the war became earnest and real, and the state became then and thereafter the major battleground of the war in the East. Virginia emerged from the year 1861 in much the same state of uncertainty and confusion as the rest of the Confederacy. While the North was known to be rebuilding its army, no one could be sure if the northern people and government were willing to continue the war. The landscape and the people of Virginia were a part of the battlefield. Virginia at War, 1862 demonstrates how no aspect of life in the Commonwealth escaped the war's impact. The collection of essays examines topics as diverse as daily civilian life and the effects of military occupation, the massive influx of tens of thousands of wounded and sick into Richmond, and the wartime expansion of Virginia's industrial base, the largest in the Confederacy. Out on the field, Robert E. Lee's army was devastated by the Battle of Antietam, and Lee strove to rebuild the army with recruits from the interior of the state. Many Virginians, however, were far behind the front lines. A growing illustrated press brought the war into the homes of civilians and allowed them to see what was happening in their state and in the larger war beyond their borders. To round out this volume, indefatigable Richmond diarist Judith McGuire continues her day-by-day reflections on life during wartime. The second in a five-volume series examining each year of the war, Virginia at War, 1862 illuminates the happenings on both homefront and battlefield in the state that served as the crucible of America's greatest internal conflict.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "University Press of Kentucky",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "1945: The War That Never Ended",
        "Authors": "By Dallas, Gregor",
        "Description": "1945 is a monumental, multi-dimensional history of the end of World War II. Dallas narrates in meticulous detail the conflicts, contradictions, motives, and counter-motives that marked the end of the greatest military conflict in modern history and established lasting patterns of deceit, uncertainty, and distrust out of which the Cold War was born.Beginning with the siege of Berlin, Dallas describes in simple human terms the interactions of Roosevelt, Churchill, Stalin, Hitler, Zhukov, Truman, de Gaulle, Macmillan, along with others relatively unknown, vividly portraying the interpenetration of the daily with the epochal, the obscure with the great political events taking place on the world stage. A grand narrative of diplomatic mistakes, military accidents, and the chaos inherent in human affairs,1945 draws the reader into a profound reflection on the basic shaping forces of history, the arbitrary ways we objectify its conflicts, and the subtle, almost invisible filaments that enmesh public events with private passions.",
        "Category": " History , Military , General",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Death in the Cards: A Stain-busting Mystery (The Stain-Busting Mysteries)",
        "Authors": "By Short, Sharon",
        "Description": "Laundromat owner and stain removal expert Josie Toadfern knows her tiny twon&#39;s dirty clothes and most of its dirty little secrets. But an upcoming \"Psychic Fair\" is bringing a brand-new mess to Paradises, Ohio. The arrival of all manner of mystics and soothsayers has raised the dangerous ire of a local evangelist and his minions, as well as the more conservative citizens of Paradise—so it doesn&#39;t take a crystal ball to predict that murder will ultimately foul the fair. But Josie couldn&#39;t foresee that she&#39;d be the one to stubmle upon the body, or that her impeccable stain-sense would embroil her in the nasty homicidal happenings. And suddenly her attempt to psych out a killer has Josie&#39;s own future looking very grim indeed.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Webster's Easy Crossword Key",
        "Authors": "By WEBSTER'S",
        "Description": "",
        "Category": " Reference , Dictionaries",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "The American Civil War: 365 Days",
        "Authors": "By Wagner, Margaret E., Virga, Vincent (EDT), and Gallagher, Gary W. (INT)",
        "Description": "Wagner (a writer/editor in the Publishing Office of the Library of Congress) gathers a wealth of visual imagery related to the American Civil War from the collections of the Library of Congress, including daguerreotypes, etchings, maps, political cartoons, and paintings. Accompanying the 500 or so images on facing pages are brief textual descriptions of the events they depict, related diary entries and newspaper articles, or similar materials. The material is organized into thematic chapters bearing the titles: Irrepressible Conflict, Gathering Momentum, War in the East, Wartime Politics, Wan on the Water, Fighting for Freedom, Turning points, Army Life, War in the West, Behind the Lines, Valor and Sacrifice, and An Uneasy Peace. Oddly, a rather minor feature of the book is announced in the subtitle: each of the 365 textual pages includes a one-sentence reference to a significant event of a particular day during one of the years of the war. Annotation ©2006 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "8.59",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Beethoven: The Universal Composer (Eminent Lives)",
        "Authors": "By Morris, Edmund",
        "Description": "“Brilliant....This book is a perfect marriage—or should one say, duet—of subject and author, every word as masterly as the notes of the artist it illuminates.” — Christopher Buckley, Forbes“This is not just criticism but poetry in itself, with the additional—and inestimable—merit of being true.” — Washington Post Book World Pulitzer Prize-winning author Edmund Morris (The Rise of Theodore Roosevelt, Theodore Rex, Dutch) is one of America’s most distinguished biographers, known for his rich, compulsively readable prose style. His biography of Beethoven, one of the most admired composers in the history of music, is above all a study of genius in action, of one of the few giants of Western culture. Beethoven is another engaging entry in the HarperCollins’ “Eminent Lives” series of biographies by distinguished authors on canonical figures.",
        "Category": " Music , General",
        "Publisher": "HARPER COLLINS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Power to Get In: Using The Circle Of Leverage System To Get In Anyone's Door Faster, More Effectively & With Less Exp",
        "Authors": "By Boylan, Michael A.",
        "Description": "The Power to Get In deals with the single most common and frustrating problem for anyone who's in business, a job transition, or a move back into the work force: the problem of gaining access to the correct audience.  Today, no other skill is as directly connected to your ability to earn a living as the skill of getting in to see the right people.  Michael Boylan's step-by-step system, The Circle of Leverage, will help you cut through bureaucracy, identify the people you most need to see, and get in their doors.  Anyone with something to sell, abilities to offer, or ideas to present will find this book invaluable.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Tunnel Vision: A V. I. Warshawski Novel",
        "Authors": "By Paretsky, Sara",
        "Description": "Stubbornness has landed private eye V.I. Warshawski in big trouble at her Chicago office.  With her grand old Loop building set to be razed, she's become a hold-out tenant amid frayed wiring and scary, empty corridors.  Then she finds a homeless woman with three kids in the basement, and before she can rescue them, they disappear.  Worst of all, she's been implicated in a murder--after the body of Deirdre Messenger, a prominent lawyer's wife, turns up sprawled across her desk.V.I., who had volunteered with Deirdre at a women's shelter, suspects her death is linked to a case of upper-class domestic abuse so slickly concealed that the police refuse to believe it.  Increasingly at odds with the cops, V.I. is blindly plunging ahead after the truth.  And her path may lead to corruption at the highest levels.or deep into the abandoned tunnels beneath Chicago's streets, where secrets are hiding in the dark like a child's--or V.I.'s--worst nightmare.",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Mind's New Science: A History of the Cognitive Revolution",
        "Authors": "By Gardner, Howard",
        "Description": "The first full-scale history of the field of cognitive science traces the related areas of philosophy, psychology, and linguistics and debates the adequacy of computer models to discern the nature of knowledge and its representatives",
        "Category": " Psychology , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Trinity",
        "Authors": "By Uris, Leon",
        "Description": "Recounts the interrelationships, clashes, and common concerns of the Catholic, hill-farming Larkins of Donegal, the aristocratic and British Hubbles, and the Scottish-Presbyterian MacLeods of Belfast during the years from the 1840s famine to the 1916 Easter Rising",
        "Category": " Fiction , Sagas",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Photoreading Whole Mind System",
        "Authors": "By Scheele, Paul R.",
        "Description": "",
        "Category": "",
        "Publisher": "Learning Strategies Corp",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The New York Times Big Book of Science Questions and Answers, Vols.1 and 2",
        "Authors": "By C. Claiborne Ray",
        "Description": "",
        "Category": "",
        "Publisher": "New York Times Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Knight's Cross : A Life of Field Marshal Erwin Rommel",
        "Authors": "By Fraser, David",
        "Description": "An in-depth biography of Field Marshal Erwin Rommel written with the cooperation of Rommel's son, by a renowned military analyst and historian who is himself a general.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Dragonborn",
        "Authors": "By Lee, Jade",
        "Description": "In a world where dragons are almost extinct, Natiya must protect the dragon's egg entrusted to her care from a powerful slayer named Kiril until she herself can become Dragonborn, but she is caught off guard by her dangerous attraction to the enemy. Original.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Mobile Cellular Telecommunications: Analog and Digital Systems",
        "Authors": "By Lee, William C. Y.",
        "Description": "A reference that provides a complete technical description of the design, analysis, and maintenance of cellular systems, covering subjects such as cell-site antennas and mobile antennas, cochannel interference reduction, noncochannel interference, frequency management and channel assignment, and data links and microwaves. This second edition reflects changes in the technology over the past five years, and features new materials on the CDMA standard, microcell systems, and digital cellular systems. Contains b&w graphs, tables, and equations. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Technology & Engineering , Telecommunications",
        "Publisher": "McGraw-Hill Professional",
        "Price Starting With ($)": "6.26",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Best Hand I Ever Played, The: 52 Winning Poker Lessons from the World's Greatest Players",
        "Authors": "By Rosenbloom, Steve",
        "Description": "Witty interviews with Doyle Brunson, Amarillo Slim, Phil Gordon, Annie Duke, and other outstanding professional poker players describe the greatest hands of each player's career, along with professional tips, expert instruction, money-making tips, and more. Original.",
        "Category": " Games , Card Games , Poker",
        "Publisher": "ESPN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "What Paul Meant 2006",
        "Authors": "By Garry Willis",
        "Description": "",
        "Category": "",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Spike",
        "Authors": "By Moss, Robert and De Borchgrave, Arnaud",
        "Description": "",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "Evermore: A Novel of the Darkyn",
        "Authors": "By Viehl, Lynn",
        "Description": "The NEW YORK TIMES AND USA Today bestselling Darkyn series continues...  Jayr is proud to be the only female ever permitted to serve as seneschal to a Darkyn lord. But in her centuries of service to Master Byrne, she has fallen in love with him. Now, Byrne plans to step down and hand over the Jardin to another Kyn lord-a move that threatens not only Jayr's position, but her very life...",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "A History of the Middle East",
        "Authors": "By Mansfield, Peter",
        "Description": "For both historian and general reader, Mansfield presents a clear picture of the historical, political, and social history of the area from Bonaparte's invasion of Egypt to current events. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Why Do People Hate America?",
        "Authors": "By Sardar, Ziauddin and Davies, Merryl Wyn",
        "Description": "The controversial bestseller that caused huge waves in the UK! The Independent calls it \"required reading.\" Noam Chomsky says it \"contains valuable information that we should know, over here, for our own good, and the world's.\" We call it our biggest book so far and will be backing it from day one with guaranteed coop spending, a national publicity and review blitz, talk radio bookings, various retail sales aids including postcards, and of course the usual full court press on the Web and via email.This is NOT just another 9/11 book: it is the book for those of us trying to understand why America--and Americans--are targets for hate. Many people do hate America, in Europe, Asia, South America and Africa, as well as in the Middle East. Ziauddin Sardar and Merryl Wyn Davies explore the global impact of America's foreign policy and its corporate and cultural power, placing this unprecedented dominance in the context of America's own perception of itself. In doing so, they consider TV and the Hollywood machine as a mirror which reflects both the American Dream and the American Nightmare. Their analysis provides an important contribution to a debate which needs to be addressed by people of all nations, cultures, religions and political persuasions--and especially by Americans.Described by The Times Higher Education Supplement as \"packed with tightly argued points,\" the book is carefully researched and built to withstand the inevitable criticism that will be aimed at it. A book that some reviewers will love to hate and others will praise for its insights, it's guaranteed to cause a stir.",
        "Category": " Political Science , General",
        "Publisher": "Disinformation Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Agony and the Ecstasy: A Biographical Novel of Michelangelo",
        "Authors": "By Stone, Irving",
        "Description": "Irving Stone’s classic biographical novel of Michelangelo—the   #1 New York Times bestseller in which both the artist and the man are brought to vivid,   captivating life.  His time—the turbulent Renaissance, the years of   poisoning princes, warring Popes, and the all-powerful de'Medici   family... His loves—the frail and lovely daughter of Lorenzo de'Medici, the ardent   mistress of Marco Aldovrandi, and his last love, his greatest love—the   beautiful, unhappy Vittoria Colonna... His genius—a God-driven fury from which he wrested brilliant work that made   a grasp for heaven unmatched in half a millennium... His name—Michelangelo Buonarroti. Creator of the David, painter of the   ceiling in the Sistine Chapel, architect of the dome of St. Peter's,   Michelangelo lives once more in the tempestuous, powerful pages of Irving   Stone's towering triumph. A masterpiece in its own right, this biographical   novel offers a compelling portrait of one of the greatest artists the world   has ever known.",
        "Category": " Fiction , Literary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Lovers & Players: A Novel",
        "Authors": "By Collins, Jackie",
        "Description": "Dangerous sex, family secrets, irresistible power, mega money, and two murders equal one reckless week in New York...In Lovers & Players, the Diamond family rules. Red Diamond is an abusive and much-loathed billionaire. His three sons, Max, Chris, and Jett, are summoned to New York for a family meeting which rocks their world.Diahann, a beautiful black ex-singer, works as Red's housekeeper-a job her daughter, Liberty, does not approve of. A waitress and would-be singer herself, Liberty has dreams of her own and while she pursues them, Damon P. Donnell, married hip-hop mogul supreme, pursues her.Young New York heiress Amy Scott-Simon is engaged to marry Max. At her bachelorette party she runs into Jett. Jett has no idea who Amy is. She also doesn't realize who he is. A one-night fling leads to major complications.Now the lives of these characters will intertwine, forever changing their destinies, in this highly charged love story about family relationships and deadly choices.\"A decadent concoction sure to appeal...a fast lane take on the lives of the rich and fabulous.\"-Kirkus Reviews",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "4 Blondes",
        "Authors": "By Bushnell, Candace",
        "Description": "Blonde AmbitionCandace Bushnell created a sensation with her first book, Sex and the City, spawning an HBO series that has become a phenomenon. With her sharp insight and uncensored observations of the mating rituals of the Manhattan elite, Bushnell has become a celebrity in her own right—on television, on the newsstands, and in bookstores across the globe.In a new collection of stories, 4 Blondes, the romantic intrigues, betrayals, victories, and insecurities of four modern women are told with Bushnell's keen wit and sardonic eye. A beautiful B-list model in \"Nice N'Easy\" attaches herself yearly to the man with the largest summer house in the Hamptons, but she soon realizes that snagging a rich man and living in a fancy beach house won't necessarily bring her happiness. In \"Highlights (for Adults),\" a high-powered magazine columnist doesn't feel that she needs a man; an examination of her deteriorating marriage shows that her literary journalist husband could never live up to her sexual or emotional expectations. Too many expectations overwhelm Princess Cecilia in \"Platinum\"; her marriage to \"the world's most eligible bachelor\" leads to a descent into paranoia that she chronicles in her journal. And in \"Single Process,\" an aging \"It girl\" worries that she is getting too old to meet a local eligible bachelor, so she travels to London in search of a husband, where she makes pithy observations about the differences between British and American men.Once again, Bushnell returns to the land of the pretty and the powerful, breaking down bedroom doors with her wry humor and frank portrayals of love and lust among the \"It people.\"",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Hourglass (MIRA)",
        "Authors": "By Gage, Elizabeth",
        "Description": "Two girls and a boy, brought together by loneliness and tragedy, forge a friendship that will define their lives, and agree to meet at their favorite place in fifteen years, but when Kate returns to the small town of her youth, expecting to find no one, she is pleasantly surprised. Reprint.",
        "Category": " Fiction , Romance , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Stir-Fries & Sautes: Great Taste-Low Fat",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Gathers low-fat recipes for chicken, turkey, beef, pork, lamb, vegetables, fish, and shellfish, and includes nutritional information for each dish",
        "Category": " Cooking , Methods , Wok",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "German Stories/Deutsche Erzählungen: A Bilingual Anthology",
        "Authors": "By Steinhauer, Harry (EDT)",
        "Description": "This book is designed primarily to alleviate the agony that language learning in its early stages entails, when the foreign words in the sentence simply will not combine to make sense.  Legions of beginners give up when they could have made it with the aid of a book like this.  But for centuries schoolmasters have frowned on this device, calling it dirty names like crib, crutch, pony. But the truth is that highly educated and motivated people have learned to read a foreign language this way. The great German archaeologist Heinrich Schliemann, who knew many ancient and modern languages, acquired them by using Bernardin de Saint-Pierre's Paul et Virginie as a pony. There are many bilingual series, such as the Loeb Classics or the Bollingen series, which have gained high prestige.",
        "Category": " Literary Criticism , European , General",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "The Birder's Handbook: A Field Guide to the Natural History of North American Birds",
        "Authors": "By Dobkin, David, Ehrlich, Paul R., and Wheye, Darryl",
        "Description": "This is the most complete and authoritative reference book about the birds of North America—up to date and in field-guide format. The Birder's Handbook is the first of its kind: a portable library of fascinating information not included in your identification guide. For each of the 646 species of birds that breed in North America, The Birder's Handbook will tell you at a glance: * Where the bird nests, and which sex(es) build(s) the nest; * How many eggs the bird lays, what they look like, which patent incubates and for how long, and how the young are cared for; * Food preferences and foraging habits. You will also find information about displays and mating, wintering, conservation status, and much more. In addition, The Birder's Handbook contains some 250 short essays covering all aspects of avian natural history.",
        "Category": " Nature , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Vector (A Medical Thriller)",
        "Authors": "By Cook, Robin",
        "Description": "New York City cab driver Yuri                             Davydov is a disgruntled                             Russian emigre poised to lash              out at the adoptive nation he believes has denied              him the American Dream. A former technician in              the Soviet biological weapons system, Biopreparat,              Yuri possesses the knowledge to wreak havoc in his              new home. But before he executes his planned              piece de resistance of vengeance, he experiments              first on his suspicious live-in girlfriend, then on a              few poor-tipping fares....              Dr. Jack Stapleton and Dr. Laurie Montgomery              (both last seen in Chromosome 6) begin to              witness some unusual cases in their capacity as              forensic pathologists in the city's medical              examiner's office: a young, healthy black woman              dies of respiratory failure, a Greek immigrant              succumbs to a sudden, overwhelming pneumonia.              At the same time, the pair are pressured from              above to focus on a high-profile string of suspicious              deaths of prisoners in police custody. When an              unexpected breakthrough persuades Jack that these              seemingly unrelated deaths are really connected              murders, his colleagues and superiors are skeptical.              Only Laurie is somewhat convinced. But the              question soon becomes whether the pair will solve              the puzzle before Yuri unleashes into the streets of              New York the ultimate terror: a modern              bioweapon.              With signature skill, Robin Cook has crafted a              page-turning thriller rooted in up-to-the-minute              biotechnology. Vector is all-too-plausible fiction at              its terrifying best.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The social contract and Discourse on the origin and foundation of inequality among mankind",
        "Authors": "By Rousseau, Jean Jacques",
        "Description": "",
        "Category": "",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Invasive Procedures: A Novel",
        "Authors": "By Card, Orson Scott and Johnston, Aaron",
        "Description": "George Galen is a brilliant scientist, a pioneer in gene therapy. But Galen is dangerously insane – he has created a method to alter human DNA, not just to heal diseases, but to \"improve\" people – make them stronger, make them able to heal more quickly, and make them compliant to his will.Frank Hartman is also a brilliant virologist, working for the government's ultra-secret bio-hazard agency. He has discovered how to neutralize Galen's DNA-changing virus, making him the one man who stands in the way of Galen's plan to \"improve\" the entire human race.This taut thriller takes the reader a few years into the future, and shows the promise and danger of new genetic medicine techniques.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Science Fiction",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "My Best Puzzles in Logic and Reasoning (Dover Recreational Math)",
        "Authors": "By Phillips, Hubert C.",
        "Description": "To solve these 100 puzzles, the only things required are an unclouded mind, nerves of steel, and a grasp of such sentences as: \"No animal that does not prefer Beethoven to Mozart ever takes a taxi in Bond Street.\" They'll provide a challenge to the most sophisticated of puzzle solvers.",
        "Category": " Games , Puzzles",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2012"
        }
    },
    {
        "Title": "C++ How to Program",
        "Authors": "By Deitel, Paul J. and Deitel, Harvey M.",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Carpentry and Building Construction",
        "Authors": "By Feirer, John L",
        "Description": "",
        "Category": "",
        "Publisher": "Glencoe Of McGraw-Hill",
        "Price Starting With ($)": "6.1",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Cat Who Robbed a Bank",
        "Authors": "By Braun, Lilian Jackson",
        "Description": "When a visiting estate jeweler is found dead, prizewinning reporter Jim Qwilleran and his Siamese cats, Koko and Yum Yum, must do their best to find the purr-petrator in this delightful novel in the New York Times bestselling Cat Who series.As the Highland Games approach, Jim Qwilleran and the citizens of Pickax, Michigan, prepare to celebrate their Scottish heritage with such evens as bagpipe skirling and tossing the caber. But the traditional revelry is marred by troublesome rumors when a visiting jewelery dealer, renowned for his romantic streak (and his mysterious cash-only policy), is found dead in his hotel room. His assistant is missing—and soon, the winner of the caber-tossing content disappears as well. Qwilleran and his snooping Siamese are willing to go to any lengths to find the killer and set the town at ease. But first they'll have to contend with a highjacked bookmobile and an attempted bank robbery. Qwill has a lot of mysteries to sort out—not the least of which is Koko's sudden interest in photographs, pennies, and paper towels...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Fatal Voyage (4) (A Temperance Brennan Novel)",
        "Authors": "By Reichs, Kathy",
        "Description": "\"Fans of TV's CSI: Crime Scene Investigation should be in heaven\" (People) stepping into the world of forensic anthropologist Dr. Temperance Brennan, star of Kathy Reichs' electrifyingly authentic bestsellers.   She has a passion for the truth . . . and this time, it's taking her down.   A commercial airliner disaster has brought Tempe Brennan to the North Carolina mountains as a member of the investigative agency DMORT. As bomb theories abound, Tempe soon discovers a jarring piece of evidence that raises dangerous questions -- and gets her thrown from the DMORT team. Relentless in her pursuit of its significance, Tempe uncovers a shocking, multilayered tale of deceit and depravity as she probes her way into frightening territory -- where someone wants her stopped in her tracks.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "No Word from Winifred (Kate Fansler Novels)",
        "Authors": "By Cross, Amanda",
        "Description": "Kate Fansler abandons her academic pursuits to investigate the disappearance of Winifred Ashby--the honorary niece of noted British novelist Charlotte Stanton--who vanishes after agreeing to cooperate with a would-be biographer of her \"aunt.\"",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Introduction to organizational behavior",
        "Authors": "By Richard M. Steers",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Handy Science Answer Book (The Handy Answer Book Series)",
        "Authors": "By Bobick, James E. (EDT) and Balaban, Naomi E. (EDT)",
        "Description": "Presenting a fun and educational way to explore the wonders of the world of science this guide collects more than 1,300 the most commonly asked and interesting questions in a succinct, fun, and educational manner. Children and adults alike will enjoy uncovering some of life’s greatest mysteries, including how does a fax machine works, which color car is the safest, the difference between male and female lobsters, and what city have the record for most snowfall. With straightforward writing, more than 100 photographs, and dozens of graphs and tables, this guidebook is the perfect reference for solving the mysteries of science.",
        "Category": " Science , Reference",
        "Publisher": "Visible Ink Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Asynchronous Transfer Mode: Solution for Broadband Isdn (Computer Communications and Networking)",
        "Authors": "By Prycker, Martin De",
        "Description": "ATM has been selected as the world standard for broadband ISDN for the public network. The author provides a review of the functions of all network entities of the future broadband ISDN and ATM LANs, also explaining why options have been defined as such. Information for the specification, design, purchase and installation of ATM-based systems is covered. This new edition has been updated to reflect changes in the field since the 1990 first edition. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Technology & Engineering , General",
        "Publisher": "Ellis Horwood, Ltd.",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Polish Americans (Peoples of North America)",
        "Authors": "By Dolan, Sean, Toor, Rachel, and Blejwas, Stanislaus A.",
        "Description": "Discusses the history, culture, and religion of the Polish, factors encouraging their emigration, and their acceptance as an ethnic group in North America",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Chelsea House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Waddles Presents Aquatic Safety: American Red Cross Child Story Activity Book",
        "Authors": "By American National Red Cross",
        "Description": "",
        "Category": " Juvenile Nonfiction , Sports & Recreation , Water Sports",
        "Publisher": "Red Cross Store",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Saving Your Second Marriage Before It Starts",
        "Authors": "By Parrott, Les",
        "Description": "Sixty percent of second marriages fail. Yours can be among the ones that succeed. Relationship experts Les and Leslie Parrott show how you can beat the odds with flying colors and make remarriage the best thing that’s ever happened to you. Do you have the skills you need? Now is the time to acquire them--and build a future together that is everything marriage can and ought to be.Also available: men’s workbook, women’s workbook, and abridged audio cassette version",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Fish is Fish",
        "Authors": "By Lionni, Leo",
        "Description": "From beloved Caldecott winning picture book creator Leo Lionni, this charming tale of sticking together and imagination shows how powerful friendship can be.Two best friends, a minnow and a tadpole, are practically inseparable until the tadpole grows legs and decides to explore the world beyond the pond. When the tadpole, now a frog, returns to tell his friend of the extraordinary things he’s seen, the minnow, now a fish, tries to follow in his footsteps, but quickly finds that land is not what he expected. Friendship truly saves the day in this imaginative tale of a fish out of water.",
        "Category": "",
        "Publisher": "Dragonfly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1974"
        }
    },
    {
        "Title": "Raising Boys: Why Boys Are Different - And How to Help Them Become Happy and Well-Balanced Men",
        "Authors": "By Biddulph, Steve",
        "Description": "A friendly and practical guide to the stages and issues in boys'¬? development from birth to manhood.From award-winning psychologist Steve Biddulph comes an expanded and updated edition of RAISING BOYS, his international best seller published in 14 countries. His complete guide for parents, educators, and relatives includes chapters on testosterone, sports, and how boys' and girls' brains differ. With gentle humor and proven wisdom, RAISING BOYS focuses on boys' unique developmental needs to help them be happy and healthy at every stage of life.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Going Places with Children in Washington, DC",
        "Authors": "By Kathie Meizner",
        "Description": "",
        "Category": " Travel , Special Interest , Family",
        "Publisher": "Washington Book Distributors",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Jesus, Friend of Children",
        "Authors": "By Maxwell, Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "Review & Herald Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Freedom From Depression Workbook, The (Minirth Meier New Life Clinic Series)",
        "Authors": "By Carter, Les and Minirth, Frank B.",
        "Description": "Learn to manage depression in The Freedom from Depression Workbook. Les Carter, Ph.D., and Frank Minirth, M.D., introduces a 12-part interactive program that identifies moods and patterns which affect our feelings. With the help of this book, peel back the layers of what causes depression and learn to develop keys to lasting change.",
        "Category": " Self-help , Mood Disorders , Depression",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Losing Weight",
        "Authors": "By McQuillan, Susan and Saltzman, Edward, M.D.",
        "Description": "Provides readers with short-term and long-term goals for losing weight and keeping it off, as well as a personalized fitness program, menus for healthy eating, motivational tips, and practical weight-control advice. Original.",
        "Category": " Health & Fitness , Diets",
        "Publisher": "Alpha Communications",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Finite Mathematics Business Economic Life Sciences",
        "Authors": "By J.ETGEN GARRET",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Diffusion of Innovations, Fourth Edition",
        "Authors": "By Rogers, Everett M.",
        "Description": "Since the first edition of this landmark book was published in 1962,Everett Rogers's name has become \"virtually synonymous with the studyof diffusion of innovations,\" according to Choice. The second andthird editions of Diffusion of Innovations became the standardtextbook and reference on diffusion studies. Now, in the fourthedition, Rogers presents the culmination of more than thirty years ofresearch that will set a new standard for analysis and inquiry.The fourth edition is (1) a revision of the theoretical framework andthe research evidence supporting this model of diffusion, and (2) anew intellectual venture, in that new concepts and new theoreticalviewpoints are introduced. This edition differs from its predecessorsin that it takes a much more critical stance in its review andsynthesis of 5,000 diffusion publications. During the past thirtyyears or so, diffusion research has grown to be widely recognized,applied and admired, but it has also been subjected to bothconstructive and destructive criticism. This criticism is due in largepart to the stereotyped and limited ways in which many diffusionscholars have defined the scope and method of their field of study.Rogers analyzes the limitations of previous diffusion studies,showing, for example, that the convergence model, by whichparticipants create and share information to reach a mutualunderstanding, more accurately describes diffusion in most cases thanthe linear model. Rogers provides an entirely new set of case examples, from theBalinese Water Temple to Nintendo videogames, that beautifullyillustrate his expansive research, as well as a completely revisedbibliography covering all relevant diffusion scholarship in the pastdecade. Most important, he discusses recent research and currenttopics, including social marketing, forecasting the rate of adoption,technology transfer, and more. This all-inclusive work will beessential reading for scholars and students in the fields ofcommunications, marketing, geography, economic development, politicalscience, sociology, and other related fields for generations to come.",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Barons of the Sky",
        "Authors": "By Biddle, Wayne",
        "Description": "Presents the history of the aerospace weapons industry and of the extraordinary people and machines that created such companies as Lockheed, McDonnell Douglas, and Boeing",
        "Category": " Transportation , Aviation , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "The Prodigal Spy: A Novel",
        "Authors": "By Kanon, Joseph",
        "Description": "In a time of accusations, treachery and lies, some secrets were heartbreaking....Others were deadly.Once, Nick Kotlar tried to save his father. From the angry questions. From the accusations. From a piece of evidence that only Nick knew about and that he destroyed—for his father. But in the Red Scare of 1950 Walter Kotlar could not be saved. Branded a spy, he fled the country, leaving behind a wife, a young son—and a key witness lying dead below her D.C. hotel room.Now, twenty years later, Nick will get a second chance. Because a beautiful journalist has brought a message from his long-lost father, and Nick will follow her into Soviet-occupied Prague for a painful reunion. Confronting a father he barely remembers and a secret that could change everything, Nick knows he must return to the place where it all began: to unravel a lie, to penetrate a deadly conspiracy, and to expose the one person who knew the truth—and watched a family be destroyed.",
        "Category": " Fiction , Literary",
        "Publisher": "Island Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Always a Thief (Quinn)",
        "Authors": "By Hooper, Kay",
        "Description": "In a deadly game of skill and deception...A master thief is just the first wild card…The priceless, rarely displayed Bannister collection is about to be exhibited—and the show’s director, Morgan West, can’t ignore her growing uneasiness. She’s certain she hasn’t seen the last of the infamous cat burglar Quinn. But she never expected him to turn up at her apartment one dark night in desperate need of her help—help she can’t refuse. The mysterious master thief is playing a dangerous game, and it’s a game that just might get him killed.With Morgan’s help, Quinn sets a trap intended to catch someone far more elusive…and more deadly…than a thief. But an unseen threat shadows him in the fog-shrouded San Francisco night, an unknown adversary more cunning than any he has yet encountered. Now, just when the stakes are higher than even Quinn can imagine, no one can be trusted—and everything’s at risk.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "To Live Is Christ: Joining Paul's Journey of Faith",
        "Authors": "By Moore, Beth",
        "Description": "In To Live Is Christ, best-selling author Beth Moore travels on a spiritual odyssey through the life of one of Christianity’s most fervent journeymen, the apostle Paul, tracing his story from childhood to martyrdom. Proclaiming his faith as a benchmark in New Testament Scripture, Beth writes, \"I have accepted many of Paul’s words as a personal challenge. ‘I want to know Christ’ has become my plea. ‘To live is Christ and to die is gain’ has become my hope. And to borrow his words once more, ‘Not that I have already obtained all this . . . but I press on.’\"Paul’s undying passion for Christ continues to inspire and challenge those with a deep spiritual hunger for the things of God. Readers will be greatly refreshed by the obvious mercy of God that causes those who have failed him to repent and serve him wholeheartedly and effectively.",
        "Category": " Religion , Biblical Studies , New Testament , General",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Literary Landscapes of the British Isles",
        "Authors": "By David Daiches",
        "Description": "",
        "Category": "",
        "Publisher": "Paddington Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "Beneath the Skin",
        "Authors": "By French, Nicci",
        "Description": "",
        "Category": "",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Tarmac",
        "Authors": "By Heitman, Lynne",
        "Description": "After her best friend is murdered, airline executive Alex Shanahan inadvertantly uncovers a black market for used airplane parts. But the man behind the scam doesn't want to be found-and he's not about to let Alex cause him any turbulence.  \"Heitman melds the maze of today's airline industry with intrigue and mystery.\" (John J. Nance, bestselling author of Headwind)  \"Skillful...she gives us an insider's view.\" (The Sunday Boston Globe)",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Onyx",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Stalking Man",
        "Authors": "By Coughlin, William Jeremiah",
        "Description": "In a twisted trail of blood, he spelled out his name, The Stalking Man, hunting women in cities across the country the way his father had once taught him to hunt deer. He loved the moment of terror frozen on their faces when the all-too-horrifying realization would hit them-they were going to die a death more violent and ghastly than their worst nightmares...They had caught him once-he did his time and now he was \"cured.\" But he'd been sloppy then. This time he slithered through the country, striking with cunning and precision, laughing at the law as he outran them again and again. Now two men must piece together his macabre clues and stop a sadistic killer who's about to strike too close to home...",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Atoms, Electrons, and Change: A Scientific American Library Book",
        "Authors": "By Atkins, P. W.",
        "Description": "",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Marisol (American Girl Today)",
        "Authors": "By Soto, Gary",
        "Description": "When her parents move away from their close-knit central Chicago neighborhood and thus her dance classes, Marisol--a lively ten-year-old who loves to dance--realizes that she can keep her passion for dancing no matter where she lives.",
        "Category": " Juvenile Fiction , People & Places , United States , Hispanic & Latino",
        "Publisher": "American Girl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    }
]