[
    {
        "Title": "Cooking for Life",
        "Authors": "By Calbom, Cherie and Chelf, Vicki Rae",
        "Description": "The author of Juicing for Life presents 190 vitamin-rich gourmet recipes that use the juices and pulp from fruits and vegetables featuring step-by-step instructions and detailed ingredient lists. Original. 75,000 first printing. $100,000 ad/promo.",
        "Category": " Cooking , General",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1925"
        }
    },
    {
        "Title": "Let's Party Cookbook",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Favorite Recipes Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "A Comprehensible World: on Modern Science and Its Origins",
        "Authors": "By Bernstein, Jeremy",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "What Went Wrong? Western Impact and Middle Eastern Response",
        "Authors": "By Bernard Lewis",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "A Young Patriot: The American Revolution as Experienced by One Boy",
        "Authors": "By Murphy, Jim",
        "Description": "In the summer of 1776, Joseph Plumb Martin was a fifteen-year-old Connecticut farm boy who considered himself \"as warm a patriot as the best of them.\" He enlisted that July and stayed in the revolutionary army until hostilities ended in 1783. Martin fought under Washington, Lafayette, and Steuben. He took part in major battles in New York, Monmouth, and Yorktown. He wintered at Valley Forge and then at Morristown, considered even more severe. He wrote of his war years in a memoir that brings the American Revolution alive with telling details, drama, and a country boy's humor. Jim Murphy lets Joseph Plumb Martin speak for himself throughout the text, weaving in historical backfround details wherever necessary, giving voice to a teenager who was an eyewitness to the fight that set America free from the British Empire.",
        "Category": " Juvenile Nonfiction , History , United States , Colonial & Revolutionary Periods",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The O'Reilly Factor for Kids: A Survival Guide for America's Families",
        "Authors": "By O'Reilly, Bill and Flowers, Charles",
        "Description": "The bestselling author ofThe O'Reilly Factor, The No Spin Zone, and Who's Looking Out for You? talks straight to kids this time. He is as demanding, direct, and wry asever—but he's also more revealing too, sharing candid snapshots of his own childhood throughout.Bill O'Reilly, a former schoolteacher,  now an award-winning broadcast news journalist, husband, and father of two, joins forces with an experienced educator to bring you, America's youth, a code of ethics by which to live.In this latest book, Bill takes to task bullies, cheaters, advertisers who target you irresponsibly, and parents who fight for their children to win undeserved honors instead of earning them on their own merit.He lays bare the unvarnished truths about sex, money, smoking, drugs, alcohol, and friends. What he has to say about these issues may very well surprise you. He offers coping devices for those enduring a divorce, struggling with teacher, parent, or sibling relationships, and planning their futures. He also shares wisdom on such subjects as death, politics, and God.Whether you take the tests he's provided, take the advice he doles out, or just take a cue from the personal stories he shares, you're bound to make smarter choices in your life, and that's all Bill asks for.",
        "Category": " Young Adult Nonfiction , Social Science , Psychology",
        "Publisher": "HarperEntertainment",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Soviet Paradox-V288",
        "Authors": "By Seweryn, Bialer",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Science Matters: Achieving Scientific Literacy",
        "Authors": "By Trefil, James and Hazen, Robert M.",
        "Description": "Explains the basic scientific principles that govern our world, and shows how they manifest themselves in our everyday lives",
        "Category": " Science , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Coaching Pitchers, 2nd Edition",
        "Authors": "By McFarland, Joe Spanky",
        "Description": "",
        "Category": " Sports & Recreation , Coaching , Baseball",
        "Publisher": "Leisure Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "EATERS CHOICE : Third Edition, Completely Revised & Expanded",
        "Authors": "By Goor, Nancy and Goor, Ronald S.",
        "Description": "Eater's Choice, a nationwide bestseller, is recommended by doctors and professional dietitians more often than any other book for people who want to lower blood cholesterol and live longer, healthier lives. The cornerstone of the Goor series, this fully revised edition recommends recent groundbreaking methods to control cardiac risk factors and provides information about the latest cholesterol-lowering drugs. Updated food tables make it easier than ever to choose the right foods for your diet.",
        "Category": " Cooking , Health & Healing , Low Cholesterol",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Greater Health God's Way",
        "Authors": "By Omartian, Stormie",
        "Description": "",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Chordant Distribution",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Computers on the Battlefield: Can They Survive?",
        "Authors": "By Debastiani, Richard J.",
        "Description": "",
        "Category": "",
        "Publisher": "National Defense University",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Hope for the Flowers",
        "Authors": "By Paulus, Trina",
        "Description": "Stripe, an ambitious young caterpillar, abandons his struggle to reach the top when he meets a lovely yellow butterfly",
        "Category": " Religion , Inspirational",
        "Publisher": "Paulist Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Soviet policy toward the Middle East since 1970 (Praeger special studies in international politics and government)",
        "Authors": "By Freedman, Robert O.",
        "Description": "",
        "Category": "",
        "Publisher": "Praeger",
        "Price Starting With ($)": "5.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Heritage of World Civilization, Volume I: To 1650 (5th Edition)",
        "Authors": "By Kagan, Donald, Ozment, Steven E., Turner, Frank M., Craig, Albert M., and Graham, William A.",
        "Description": "",
        "Category": " History , World",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "King Arthur",
        "Authors": "By Goodrich, Norma Lorre",
        "Description": "The many readers who are enthralled with the enduring legend of Camelot will be drawn to this fascinating book, which \"may become the definitive work in the effort to prove the historical authenticity of King Arthur.\"--UPI",
        "Category": " History , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Merlyn's Pen : Fiction Essays, and Poems by America's Teens, Volume 2",
        "Authors": "By Stahl, R. James (EDT)",
        "Description": "Presents a collections of stories, poems, and other writings by teenagers, and includes questions for discussion",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Merlyn's Pen Inc",
        "Price Starting With ($)": "7.71",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Cathedral Within",
        "Authors": "By Shore, William H.",
        "Description": "The founder and executive director of Share Our Strength profiles a variety of social entrepreneurs who are drawing on the resources of America's private sector to improve public life, including Nancy Carstedt of the Chicago Children's Choir and Alan Khazei of City Year. 30,000 first printing.",
        "Category": " Social Science , Volunteer Work",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Dominique Moceanu: An American Champion An Autobiography",
        "Authors": "By Moceanu, Dominique and Woodward, Steve",
        "Description": "At thirteen, Dominique Moceanu burst into the gymnastic spotlight by becoming the youngest U.S. national gymnastics champion ever.  Her awesome performance at all the major 1995 U.S. competitions, and at the World Championships, wowed the crowds--and won her countless medals.  Now, at onlyseventy pounds and four feet, five inches, Dominique is psyched to take the 1996 Summer Olympics by storm.  Under the guidance of her renowned coach, BelaKarolyi, Dominique will perform dynamic gymnastic routines sure to dazzle fans around the world!  In her own words, Dominique talks about her passion forgymnastics, her years of training, her favorite events, her coach, her teammates, her family, and everything else you want to know about her life in and out of the gym.  Dominique Moceanu's leap to stardom is an American dream come true.",
        "Category": " Juvenile Fiction , Biographical , United States",
        "Publisher": "New York, New York, U.S.A.: Ba",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Angel Sanctuary, Vol. 3",
        "Authors": "By Yuki, Kaori and Yuki, Kaori (ILT)",
        "Description": "Despite Setsuna's efforts to deny his love for his sister, he can't allow her to leave the country without letting her know how he feels, but how can she feel about love that borders on incest? She may never live to find out, because an angel has been sent down from heaven just for her-just to make sure that she dies! The two demons from hell, Kurai and Arachne, are still trying to bring out the avenging angel in Setsuna, but first they must deal with the mysterious, seemingly immortal Kira. Even if a way is found to bring the angel Alexiel out of Setsuna, can Tokyo survive the transformation?",
        "Category": " Comics & Graphic Novels , Manga , General",
        "Publisher": "VIZ Media LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Holding the Vision: An Experiential Guide",
        "Authors": "By Redfield, James and Adrienne, Carol",
        "Description": "How can the Tenth Insight Change My Life? The insights found in The Celestine Prophecy and The Tenth Insight have touched the lives of many millions of people; they are not theoretical When we become aware of how they work, coincidences and serendipitous encounters increase for us. As our level of consciousness expands, our vision of the world is transformed, and we get a glimpse into the heart of creation. And as we learn how thought and visualization precede reality, we can begin to harness them to benefit our own future and the future of the earth. The perfect companion volume for The Tenth Insight, this hands-on guide was written to help individuals and groups implement the ideas found in that book. It provides detailed explanations and exercises on Tenth Insight topics: previous lifetimes, soul groups, birth visions, the use of dreams and prayers, the afterlife, and the World Vision. It helps us experience firsthand how our own lives fit into the eternal cycles... teaches us how to discover our own personal missions...and reveals how we can all take part in the ultimately joyful world changes described in The Tenth Insight.",
        "Category": " Body, Mind & Spirit , Occultism",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "The Quilter's Guide to Rotary Cutting (Contemporary Quilting)",
        "Authors": "By Poster, Donna",
        "Description": "Shows how to speed-cut thirty basic shapes with a rotary cutter, and includes instructions for twenty pieced quilts in seven sizes",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "The Dolphin Guide to Cape Cod, Martha's Vineyard, Nantucket Illustrated with Maps & Photographs",
        "Authors": "By Fran Blake",
        "Description": "",
        "Category": "",
        "Publisher": "A Dolphin Book",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Five-Minute Flower Arranger",
        "Authors": "By Newdick, Jane",
        "Description": "Step-by-step, illustrated instructions offer advice on fast and effortless flower arranging with special tips on color schemes, seasonal selections, and simple mechanics",
        "Category": " Gardening , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "WIE Managing for Excellence: The Guide to Developing High Performance in Contemporary Organizations (Wiley Management Series on Problem Solving, Decision Making and Strategic Thinking)",
        "Authors": "By Bradford, David L. and Cohen, Allan R.",
        "Description": "\"Managing for Excellence is above all usable. Its helpful, down-to-earth advice can transform any leader from merely good to positively outstanding. These are the ideas managers can not only admire but act on as well-the highest compliment for a manager's guidebook.\" -Rosabeth Moss Kanter Author of The Change MastersThe bestseller that revolutionized management's vision of itselfIn the mid-1980s, the notion that the most successful managers are no longer heroic, but share power and responsibility, was so revolutionary that it bordered on heresy. But the ideas championed by David Bradford and Allan Cohen in Managing for Excellence proved so effective that, virtually overnight, thousands of skeptical upper-level managers became true believers.Managing for Excellence isn't just for CEOs, presidents, and veeps-the battle-tested methods laid out in this book help middle managers turn the strategic designs of upper management into reality. Bradford and Cohen reveal how great managers succeed by bringing out the best in their employees. They show managers how to:* Develop a cohesive team that jointly owns critical management issues* Deal with difficult problems head-on and make core decisions through consensus* Encourage healthy competition against objective standards of excellence* Be decisive leaders while encouraging input from team members* Manage daily procedures, adapt to change, and maintain a vision of the future simultaneously",
        "Category": " Business & Economics , Management",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Storm Over the Land: A Profile of the Civil War",
        "Authors": "By Carl Sandburg",
        "Description": "",
        "Category": "",
        "Publisher": "Konecky & Konecky",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Psychology Applied to Work: An Introduction to Industrial and Organizational Psychology",
        "Authors": "By Muchinsky, Paul M.",
        "Description": "A text in industrial/organization (I/O) psychology, with sections on research methods, personnel psychology, organizational psychology, and the work environment, featuring case studies, questions, field notes, and cartoons.  This fifth edition is revised to reflect dramatic changes in the field, and contains new chapters on organizations and teams, organizational behavior, and stress and well-being at work, and a chapter examining the changing nature of work and its effects on individuals and society. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Psychology , Industrial & Organizational Psychology",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "LifeKeys: Discovering Who You Are, Why You're Here, What You Do Best",
        "Authors": "By Kise, Jane A. G., Stark, David, and Hirsh, Sandra Krebs",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Transnational Terror (AEI-Hoover Policy Studies)",
        "Authors": "By Bell, J. Bowyer",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Aei Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Think Big",
        "Authors": "By Murphey, Cecil and Carson, Ben",
        "Description": "In Think Big, which emanates from the last chapter of his best-selling Gifted Hands, Dr. Ben Carson prescribes his personal formula for success. And who could better advise than one who transformed his own life from that of being a ghetto kid with problems in school to becoming the most celebrated pediatric neurosurgeon in the world? With an acrostic, Dr. Carson spells out his philosophy of living: T -Talents/time: Recognize as gifts from God  H -Hope for good things and be honest  I -insight from people and good books  N -Be nice to all people  K -Knowledge: Recognize as they key to living  B -Books: Read them actively  I -In-depth learning skills: Develop them  G -God: Never get too big for Him -- Think Big does not offer pat answers, or promise a life of ease, but it does show how a person should view problems, evaluate them, react to them, and eventually overcome them. The philosophy in Think Big can be applied by all individuals to their own lives and help them to make the most of the gifts that God has given them.",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Peddling Prosperity: Economic Sense and Nonsense in an Age of Diminished Expectations (Norton Paperback)",
        "Authors": "By Krugman, Paul",
        "Description": "This wonderfully  received book finds him in top form, observing  the years he's dubbed \"the age of  diminished expectations.\" The past twenty  years have been an era of economic  disappointment in the United States. They have  also been a time of intense economic debate, as  rival ideologies contend for policy influence.  But strange things have happened to economic  ideas on their way to power: they've been  hijacked by policy entrepreneurs—economic  snake-oil salesmen, right or left, who offer  easy answers to hard problems. Supply-siders  rose to power with Ronald Reagan and not only  cured nothing but left behind a $3 trillion  debt. Krugman finds an unhappy parallel in those who shape policy within the Clinton  administration.",
        "Category": " Business & Economics , Economic History",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Chobits, Volume 2",
        "Authors": "By Clamp",
        "Description": "Having left the country for a cram school in the city, Hideki Motosuwa has humorous and unusual experiences with Chi, a \"persocom,\" or miniature android and personal computer.",
        "Category": " Comics & Graphic Novels , Manga , General",
        "Publisher": "TokyoPop",
        "Price Starting With ($)": "6.98",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "No Man for Murder",
        "Authors": "By Ellis, Melvin Richard",
        "Description": "A seventeen-year-old boy seems to have no believable alibi when he is accused of murdering the brutal owner of a mistreated coon dog.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "1973"
        }
    },
    {
        "Title": "Subsequent Performances",
        "Authors": "By Miller, Jonathan",
        "Description": "",
        "Category": " Performing Arts , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "War Is Kind and Other Poems (Dover Thrift Editions)",
        "Authors": "By Crane, Stephen",
        "Description": "A unique stylist and one of the most innovative and talented writers of his generation, Stephen Crane (1871–1900) won lasting fame as a novelist (The Red Badge of Courage, Maggie: A Girl of the Streets) and short story writer. Described by William Dean Howells as a writer whose genius seemed to \"spring to life fully armed,\" Crane also produced impressive free-form verse. This excellent anthology contains nearly all of Crane's verse, including two complete books of poems: The Black Riders and Other Lines, which garnered immediate praise; and War Is Kind, ablaze with vivid imagery. Here, too, are rewarding selections from his uncollected poetic works. Thought by some critics to anticipate the Imagist movement of the twentieth century, Crane's poems are usually brief, cadenced, and rhymeless, rich in drama and symbolism, and spiritually penetrating.",
        "Category": " Poetry , European , English, Irish, Scottish, Welsh",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2016"
        }
    },
    {
        "Title": "Curious George",
        "Authors": "By Rey, H. A.",
        "Description": "In this, the original book about the curious monkey, George is taken from the jungle by the man in the yellow hat to live in a new home, but--oh, what happened! Though trying to be good, George is still very curious and takes a swim in the ocean, escapes from jail, and goes for a flying ride on a bunch of balloons. This treasured classic is where it all began for the curious, loveable monkey and is a must have for any children's book collection.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1973"
        }
    },
    {
        "Title": "The Big Show: High Times and Dirty Dealings Backstage at the Academy Awards",
        "Authors": "By Pond, Steve, Streiber, Art (PHT), Regan, Lara Jo (PHT), and Striek, David (PHT)",
        "Description": "An unprecedented look at the machinations behind everyone's favorite Hollywood circus and what it reveals about the business of moviemaking.Oscar parties. Oscar pools. Oscar style. Oscar predictions. The Oscars breed their own peculiar mania and a billion people worldwide are alleged to watch the broadcast every year. While that figure may be the Academy's big white lie, the Oscars draw a viewership well into the hundreds of millions--a tremendous audience for what is essentially a television program. But this is no ordinary show. Love it or loathe it, the Oscars are an irresistible spectacle: a gloriously gaudy, glitzy, momentous, and foolish window into the unholy alliance of art and commerce that is the film industry. The Oscar statuette is a totem of such potency that millions are spent and careers laid on the line in the reckless pursuit of an eight-pound chunk of gold-plated britannium.   The Big Show is a chronicle of the past fifteen years of the Academy Awards, the most tumultuous decade in Oscar's seventy-six year history. Written by the only journalist ever given carte blanche access to the planning, production, and backstage intrigue of the Oscars, it offers an unguarded, behind-the-scenes glimpse of this singular event, along with remarkable insight into how the Oscars reflect the high-stakes politics of Hollywood, our obsession with celebrities (not to mention celebrities' obsession with themselves), and the cinematic state of the union.",
        "Category": " Performing Arts , Film & Video , History & Criticism",
        "Publisher": "Faber & Faber",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Resurgence Of The Real: Body, Nature, And Place In A Hypermodern World",
        "Authors": "By Spretnak, Charlene",
        "Description": "The closing years of this century find Americans skeptical of modern institutions—the political system, the gloablized economy, the public schools—and their abilities to solve the most basic problems of our time. Amid the rising tide of discontent, the public debates—including the ”culture wars”—seem to be a mere spinning of wheels.In a penetrating analysis of our times, Charlene Spretnak asserts that both the liberal and conservative sides in those debates are situated in the very orientation that created the modern crisis: the mechanistic worldview with Homo economicus at the center. The grand claims of modernity no longer inspire confidence because its destructive effects seem to be multiplying. The author, an influential public intellectual, speaks poignantly to our growing sense of what has been lost and what is slipping away.Yet Charlene Spretnak argues persuasively that the intensification of the modern crises is not inevitable and is already being challenged by an impressive network of corrective efforts. The new acceptance of holistic medicine (forced by the healthcare crisis, the new understandings in science of nature’s powers of dynamic creativity and self-organization, the new political opposition of community-based activists to the forces of globalization, and the new surge of independence efforts by ancient nations that have been devoured by modern states—all are part of an emergent value system that counters the modern conception of liberty as a flight from body, nature and place.After identifying ”epochal rumblings” embedded in the nightly news in the 1990s, Charlene Spretnak illuminates the sources of the modern condition with exceptional clarity. Moreover, she reframes ”the other history” of the modern era: the ecospiritual lineage of movements that resisted the corrosive effects of the industrialized modern world. These include the Arts and Crafts movement, the cosmological schools of painting, the stream of Modernist writers and artists who did not embrace the ”machine aesthetic” after World War One, and Gandhi’s ”Constructive Program.” The grassroots movements today that are forging a new politics of local and regional revitalization beyond left-and-right are heir to a rich tradition, to which the author brings original interpretations.Finally, Charlene Spretnak concludes her wideranging exploration with an engaging story of an American heartland city in the near future that has largely decoupled from the destructive dynamics of the globalized economy and initiated a range of pragmatic alternatives in its region.Both a sharp critique and a graceful performance of the art of the possible, The Resurgence of the Real changes the way we thing about living in the modern world.",
        "Category": " Philosophy , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Dreamtime: A Collection of Short Stories",
        "Authors": "By Steiner, Robert F.",
        "Description": "",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "iUniverse, Inc.",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Speak",
        "Authors": "By Anderson, Laurie Halse",
        "Description": "Laurie Halse Anderson’s award-winning, highly acclaimed, and controversial novel about a teenager who chooses not to speak rather than to give voice to what really happened to her marks ten years in print with this special anniversary edition. Bonus material created for this edition includes a new introduction and afterword from the author, resources, and discussion guide. Will also include a preview of Anderson’s newest book, Wintergirls. The quintessential edition for all fans of this powerfully moving book.",
        "Category": " Young Adult Fiction , Social Themes , General",
        "Publisher": "Speak",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Intimacy",
        "Authors": "By Jean-Paul Sartre",
        "Description": "",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1948"
        }
    },
    {
        "Title": "Change One",
        "Authors": "By Hastings, John, Jaret, Peter, and Hermann, Mindy",
        "Description": "Filled with personal stories, vital lessons, visual guides, easy exercises, and a wealth of ideas, a revolutionary twelve-week program shows readers how to look at food in a new light, which will help them to change their eating habits, promoting successful and permanent weight loss.",
        "Category": " Health & Fitness , Diet & Nutrition , Weight Loss",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Great movie series",
        "Authors": "By South Brunswick, A. S. Barnes",
        "Description": "",
        "Category": "",
        "Publisher": "A. S. Barnes",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Triple Take: A Novel",
        "Authors": "By Moore, Y. Blak",
        "Description": "After serving ten years for armed robbery, Jonathan “JC” Cole is about to get out of the joint, and he has one thing on his mind: revenge against the three men—former childhood friends, now powerful crime lords—who betrayed him to save their own skins. Richard “Richkid” Kidman is a Playa with a capital P, at one time controlling a stable of twelve women. Alonzo “Zo” Johnson is one of the richest drug dealers in the Windy City. And Eugene “Lil G” Pierce ranks among the most successful con men on the East Coast.JC feels that the time has come for him to claim what is rightfully his. His misfortune was his ex-friends’ stepping-stone, and now it is time for them to pay up—in spades. He doesn’t want to kill them, he just wants to take everything away.He does this with the help of his woman, Champagne; his best friend, Rat; and Rat’s girlfriend, Shaunna. They form a family of sorts, with JC as the leader and Champagne as the fierce mother hen, together embarking on an exciting journey into the underworld of Chicago.",
        "Category": " Fiction , African American , Urban",
        "Publisher": "Villard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Sociology: A Down-to-Earth Approach (6th Edition)",
        "Authors": "By Henslin, James M.",
        "Description": "",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "8.4",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Accidental President: How 413 Lawyers, 9 Supreme Court Justices, and 5,963,110 Floridians (Give or Take a Few) Landed George W. Bush in the White House",
        "Authors": "By Kaplan, David A.",
        "Description": "For thirty-seven days after the disputed presidential election of 2000, we watched great theater, as George W Bush and Al Gore slugged it out in the swamp. You may think you've read it all before, but now Newsweek's David A. Kaplan goes behind the scenes of the sanctimony and machinations. In his critically acclaimed bestseller, The Silicon Boys, Kaplan took us inside Silicon Valley. In The Accidental President, he does the same for this epic moment in American history -- a harmonic convergence of politics and law, media and culture.With his mordant wit and incisive storytelling, Kaplan tells us how -- contrary to popular belief -- the Supreme Court's ruling for Bush was not a foregone conclusion and why the dissenting justices thought, until the last second, they could lure the one equivocating colleague they'd derisively nicknamed \"Flipper.\" We're in the room when Gore decides that, more than any great lawyer, the one person he needs in Recountland is . . . Erin Brockovich. We learn which Bush partisan covertly marionetted the strings behind Katherine Harris. And we're treated to sketches of the characters they called Secret Squirrel and the Fine-Looking Man and of the political operative who jumped from a moving train.Through it all -- butterflies and boils; concessions, recantations, and fraternal recriminations; lawyers, more lawyers, and 181 invocations of the phrase \"uncharted waters\" -- Kaplan paints a picture of an extraordinary episode for the country. There are few heroes in this tale. No person or institution comes out looking very good. \"Rule of law\" simply meant trying to figure out a way around the law -- realpolitik by any other name.The outcome of Bush versus Gore was a colossal fortuity, an election gone bad, made worse by an inconceivable coincidence of accidents. A lucky tactical call here, a confusing ballot there -- amid all the folly and hypocrisy, these are what landed Bush in the White House. Different turns might have cast destiny the other way. Bush is our nation's first accidental president, just as Gore would have been. Bush may thrive or stumble in office. But either way, few will forget how he got there after November 7, 2000.This is the definitive story of those thirty-seven days and why they matter.",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.4",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Moments Together For Couples: Devotions for Drawing Near to God and One Another",
        "Authors": "By Rainey, Dennis and Rainey, Barbara",
        "Description": "In the midst of the stress and pressure of everyday life, Moments Together for Couples will give you and your mate a chance to pause, relax and draw upon the strength of the Lord. This easy-to-use devotional helps you set aside anywhere from 5 to 30 minutes every day with your spouse to grow closer to God and closer to each other.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Regal",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Disney's Talespin Ghost Ship",
        "Authors": "By Helfer, Andrew",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Book",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "A Random Walk Down Wall Street, Fourth Edition 1985",
        "Authors": "By Malkiel, Burton G.",
        "Description": "Drawing from his experiences as a securities analyst, economist, and investor, the author explores the workings of Wall Street and offers helpful hints on determining the value and potential of stocks",
        "Category": "",
        "Publisher": "W. W. Norton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Encyclopedia of Drug Abuse",
        "Authors": "By O'Brien, Robert, Cohen, Sidney",
        "Description": "Discusses the effects of the major addictive drugs and provides information on the social, medical, and legal aspects of drug addiction",
        "Category": "",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Diana in Search of Herself: Portrait of a Troubled Princess",
        "Authors": "By Smith, Sally Bedell",
        "Description": "Diana in Search of Herself is the first authoritative biography of one of the most fabled women of the century. Even those who knew Princess Diana will be surprised by author Sally Bedell Smith's insightful and haunting portrait of Diana's inner life.For all that has been written about Diana--the books, the commemorative magazines, the thousands of newspaper articles--we have lacked a sophisticated understanding of the woman, her motivations, and her extreme needs. Most books have been exercises in hagiography or character assassination, sometimes both in the same volume. Sally Bedell Smith, the acclaimed biographer, former New York Times reporter, and Vanity Fair contributing editor, has written the first truly balanced and nuanced portrait of the Princess of Wales, in all her emotional complexity.Drawing on scores of interviews with friends and associates who had not previously talked about Diana, Ms. Smith explores the events and relationships that shaped the Princess, the flashpoints that sent her careening through life, her deep feelings of unworthiness, her view of men, and her perpetual journey toward a better sense of self. By making connections not previously explored, this book allows readers to see Diana as she really was, from her birth to her tragic death.Original in its reporting and surprising in its conclusions about the severity of Diana's mental-health problems, Diana in Search of Herself is the smartest and most substantive biography ever written about this mesmerizing woman.",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "Crown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "TNIV New Testament",
        "Authors": "By Zondervan",
        "Description": "The classic translation in today’s language, now available in an inexpensive softcover editionThe TNIV was completed by the Committee on Bible Translation, the same body that translated the NIV. The updated language reflects improvements in biblical scholarship and changes in English usage. Today’s New International Version is a conservative evangelical translation for this generation and the next.Features: · The full text of the New Testament · “A Word to the Reader” explains the TNIV     translation philosophy · Easy-to-read, single-column design · Includes a New Testament concordance · Available in an inexpensive softcover edition",
        "Category": " Bibles , New International Version , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Charles & Diana In America",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Do I Have to Give Up Me to Be Loved by You?",
        "Authors": "By Paul, Jordan and Paul, Margaret",
        "Description": "",
        "Category": " Self-help , Personal Growth , Self-Esteem",
        "Publisher": "Compcare Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Uncle John's Unstoppable Bathroom Reader",
        "Authors": "By Bathroom Readers' Institute",
        "Description": "Now in its 16th year, The Bathroom Reader ? which seems to have replaced the tie as the most popular Father's Day gift idea ? has become a movement, with satisfying, easily digested new selections sure to wipe away bathroom boredom. Handily arranged by length ? ?short” (a quick read), ?medium” (1 to 3 pages), and ?long” (for those extended visits) ? the book covers everything from Americana to The Name Game to Pop Science and Wordplay. Readers can learn the origins of superglue, sample news stories about underwear, read about animals famous for 15 minutes, and learn of unknown heroes of the Wild West. This broad assortment eliminates ennui while wittily educating readers trapped in airports, cars, buses, or lavatories.",
        "Category": " Reference , Trivia",
        "Publisher": "Portable Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The History of the Greenbrier: America's Resort",
        "Authors": "By Conte, Robert",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Trans Allegheny Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Classic Makeup and Beauty (DK Living)",
        "Authors": "By King, Dave (PHT), Quant, Mary, and Barrymore, Maureen (PHT)",
        "Description": "A guide to creative makeup uses self-analysis charts to explain how to select products for different skin types, face shapes, and coloring; demonstrates essential steps in applying makeup; and offers a gallery of looks to re-create",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Night Draws Near: Iraq's People in the Shadow of America's War",
        "Authors": "By Shadid, Anthony",
        "Description": "From the only journalist to win a Pulitzer Prize for his reporting from Iraq, here is a riveting account of ordinary people caught between the struggles of nationsLike her country, Karima—a widow with eight children—was caught between America and Saddam. It was March 2003 in proud but battered Baghdad. As night drew near, she took her son to board a rickety bus to join Hussein’s army. “God protect you,” she said, handing him something she could not afford to give—the thirty-cent fare.The Washington Post’s Anthony Shadid also went to war in Iraq although he was neither embedded with soldiers nor briefed by politicians. Because he is fluent in Arabic, Shadid—an Arab American born and raised in Oklahoma—was able to disappear into the divided, dangerous worlds of Iraq. Day by day, as the American dream of freedom clashed with Arab notions of justice, he pieced together the human story of ordinary Iraqis weathering the terrible dislocations and tragedies of war.  Through the lives of men and women, Sunnis and Shiites, American sympathizers and outraged young jihadists newly transformed into martyrs, Shadid shows us the journey of defiant, hopeful, resilient Iraq. Moving from battle scenes to subdued streets enlivened only by the call to prayer, Shadid uses the experiences of his characters to illustrate how Saddam’s downfall paved the way not only for democracy but also for an Islamic reawakening and jihad. Night Draws Near—as compelling as it is human—is an illuminating and poignant account from a repoter whose coverage has drawn international attention and acclaim.",
        "Category": " Political Science , Political Freedom",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Woman's day dough crafts",
        "Authors": "By Bodger, Lorraine",
        "Description": "",
        "Category": "",
        "Publisher": "Sedgewood Press",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Divided Lives: The Public and Private Struggles of Three American Women",
        "Authors": "By Walsh, Elsa",
        "Description": "Despite the large number of books devoted to women's issues in the last twenty years, Washington Post  reporter Elsa Walsh felt that the literature was missing a crucial element--the voices of women themselves. Setting out to probe the myriad layers of women's lives and to illuminate the interior struggles women face at work and at home, Walsh spent over two years interviewing three highly successful women about their lives.What she found in talking with former 60 Minutes correspondent Meredith Vieira, conductor and first lady of West Virginia Rachel Worby, and Dr. Alison Estabrook, chief of breast surgery at the country's second largest hospital, was that at crucial moments, these women who seemingly \"have it all\" had trouble fitting together the many pieces of their lives. In sharing the stories of Vieira, Worby, and Estabrook, Walsh provides real life, flesh-and-blood examples of the constant negotiations and compromises every woman must make to reconcile the innumerable and conflicting demands of her career, her family, her own sense of self-worth and satisfaction. Clear-sighted and compassionate, Divided Lives is an important book for all American women today.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "The Best Plays Theater Yearbook 2002-2003",
        "Authors": "By Jenkins, Jeffrey Eric (EDT)",
        "Description": "(Limelight). Includes  Book of Days, Dublin Carol, I Am My Own Wife, Imaginary Friends, The Mercy Seat, Our Lady of 121st Street, Stone Cold Dead Serious, Take Me Out, Talking Heads, Yellowman .",
        "Category": " Performing Arts , Theater , General",
        "Publisher": "Limelight Editions",
        "Price Starting With ($)": "7.6",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Truth About Same Sex Marriage: 6 Things You Need to Know About What's Really at Stake",
        "Authors": "By Lutzer, Erwin W.",
        "Description": "Dr. Erwin W. Lutzer, pastor of the Moody Church in Chicago and esteemed theologian, responds to the attacks that marriage has sustained over the past several years. In this revised and updated version of his bestselling book, Dr. Lutzer clearly and accurately depicts the truth about what is at stake here. He addresses the questions that we're all asking:<BR><BR>-How did we get to this point?<BR>-Why is marriage, as God intended it, better-and healthier?<BR>-How can I talk to my kids about this?<BR>-How do I responsibly read, watch, and filter the news?<BR>-Is there still hope?<BR><BR>We don't need to choose between loving homosexuals and opposing same-sex marriages. Biblically, love is defined not as license to legitimatize sinful behavior of any kind, but love helps us see that there is a better way. We must be concerned enough to speak out about any action, heterosexual or homosexual, that violates God's intended plan for marriage and the family.<SPAN class=Apple-converted-space> </SPAN>",
        "Category": " Religion , Christian Life , Social Issues",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Digital Fortress: A Thriller",
        "Authors": "By Brown, Dan and Sabath, Bruce (NRT)",
        "Description": "A masterful thriller by the author of the #1 New York Times  bestseller The Da Vinci CodeWhen the NSA’s invincible code-breaking machine encounters a mysterious code it cannot break, the agency calls its head cryptographer, Susan Fletcher, a brilliant, beautiful mathematician.  What she uncovers sends shock waves through the corridors of power.  The NSA is being held hostage—not by guns or bombs—but by a code so complex that if released would cripple U.S. intelligence. Caught in an accelerating tempest of secrecy and lies, Fletcher battles to save the agency she believes in.  Betrayed on all sides, she finds herself fighting not only for her country but for her life, and in the end, for the life of the man she loves.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Macmillan Audio",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Javits: The Autobiography of a Public Man",
        "Authors": "By Javits, Jacob Koppell",
        "Description": "A personal memoir by the New York Republican senator depicts his long political career, his many political colleagues including Dewey, Rockefeller, and LBJ, the consequences of Watergate, and the future of his party",
        "Category": " Political Science , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "In the Company of Soldiers: A Chronicle of Combat",
        "Authors": "By Atkinson, Rick",
        "Description": "\"A beautifully written and memorable account of combat from the top down and bottom up as the 101st Airborne commanders and front-line grunts battle their way to Baghdad.... A must-read.\"—Tom BrokawFor soldiers in the 101st Airborne Division, the road to Baghdad began with a midnight flight out of Fort Campbell, Kentucky, in late February 2003. For Rick Atkinson, who would spend nearly two months covering the division for The Washington Post, the war in Iraq provided a unique opportunity to observe today's U.S. Army in combat. Now, in this extraordinary account of his odyssey with the 101st, Atkinson presents an intimate and revealing portrait of the soldiers who fight the expeditionary wars that have become the hallmark of our age. At the center of Atkinson's drama stands the compelling figure of Major General David H. Petraeus, described by one comrade as \"the most competitive man on the planet.\" Atkinson spent virtually all day every day at Petraeus's elbow in Iraq, where he had an unobstructed view of the stresses, anxieties, and large joys of commanding 17,000 soldiers in combat. And all around Petraeus, we see the men and women of a storied division grapple with the challenges of waging war in an unspeakably harsh environment. With the eye of a master storyteller, a brilliant military historian puts us right on the battlefield. In the Company of Soldiers is a compelling, utterly fresh view of the modern American soldier in action.",
        "Category": " History , Military , General",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Runner's World Complete Book of Women's Running: The Best Advice to Get Started, Stay Motivated, Lose Weight, Run Injury-Free, Be  Safe, and Train for Any Distance (Runner's World Complete Books)",
        "Authors": "By Scott, Dagny and Barrios, Dagny Scott",
        "Description": "\"Listen to those millions of women runners. Listen to their quiet breaths as they talk in predawn pairs, before the rest of the family wakes-- the lessons and questions they share to the rhythm of steady footsteps. 'I never thought I could...' 'I feel so much stronger...' 'I'm ready to take on a new challenge...'Women develop a special sorority on the roads. This bond is an understanding based on acceptance, an appreciation of how far they have come, a knowing wink that says how much is yet to be gained. And so they talk and share and grow-- and run. Singly and in groups, swiftly and slowly, they run.\"--Dagny ScottChoose the best clothes and accessories * Lose weight permanently * Train for any race, from a 5-K to a marathon * Run through Menopause * Be safe wherever you run * Deal with self-consciousness and body image * Prevent and treat injuries * Run during pregnancy * Eat for maximum energy",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Missing Peace: The Inside Story of the Fight for Middle East Peace",
        "Authors": "By Ross, Dennis",
        "Description": "A gripping personal narrative of the struggle for Israeli-Palestinian peace Dennis Ross, the chief Middle East peace negotiator in the presidential administrations of George H. W. Bush and Bill Clinton, is that rare figure who is respected by all parties: Democrats and Republicans, Palestinians and Israelis, presidents and people on the street in Jerusalem, Ramallah, and Washington, D.C.The Missing Peace is far and away the most candid inside account of the Middle East peace process ever published. The maneuverings of both sides, and of the United States as well, are described. For the first time, the backroom negotiations, the dramatic and often secretive nature of the process, and the reasons for its faltering are on display for all to see.Ross recounts the peace process in detail from 1988 to the breakdown of talks in early 2001 that prompted the so-called second Intifada. It's all here: Camp David, Oslo, Geneva, Egypt, and other summits; the assassination of Yitzak Rabin; the rise and fall of Benjamin Netanyahu; the very different characters and strategies of Rabin, Yasir Arafat, and Bill Clinton; and the first steps of the Palestinian Authority. The issues Ross explains with unmatched clarity-n-egotiations over borders, Israeli security, the Palestinian \"right of return\"--are the issues behind today's headlines. The Missing Peace explains, as no other book has, why Middle East peace is so difficult to achieve.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "18.48",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Banishing Verona: A Novel",
        "Authors": "By Livesey, Margot",
        "Description": "Zeke is twenty-nine and working as a carpenter and painter in London. Verona is thirty-seven, headstrong, and seven months pregnant. When the two meet in a house that Zeke is renovating, they fall in love, only to  be separated less than 24 hours later when Verona mysteriously disappears. After much searching, Zeke discovers that Verona has travelled to Boston to help Henry, her brother, disentangle himself from some shady financial matters. As impulsively as he fell for Verona, Zeke decides to follow her to Boston. It is here that both lovers take on further and more desperate searches of their own, and Livesey's sophisticated novel, Banishing Verona, evolves into the most surprising and suspenseful of modern love stories.",
        "Category": " Fiction , Literary",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Like a Watered Garden: A Novel (Garden Gates)",
        "Authors": "By Hill, Patti Ann",
        "Description": "",
        "Category": " Fiction , Religious",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Real Truth About Teens and Sex: From Hooking Up to Friends with Benefits -- What Teens Are Thinking, Doing, andTalking About, and How to Help Them Make Smart Choices",
        "Authors": "By Weill, Sabrina",
        "Description": "The former editor-in-chief of Seventeen magazine draws on hundreds of letters, e-mails, interviews, and a nationwide survey to provide a revealing look at teens and sex, covering such topics as virginity, celibacy, the role of the media, birth control, sexually transmitted diseases, peer pressure, sex education, and the latest trends.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Personal Injuries",
        "Authors": "By Turow, Scott",
        "Description": "A gripping, suspenseful, deeply satisfying new novel about corruption, deceit, and love.Robbie Feaver (pronounced \"favor\") is a charismatic personal injury lawyer with a high profile practice, a way with the ladies, and a beautiful wife (whom he loves), who is dying of an irreversible illness. He also has a secret bank account where he occasionally deposits funds that make their way into the pockets of the judges who decide Robbie's cases.Robbie is caught by the Feds, and, in exchange for leniency, agrees to \"wear a wire\" as he continues to try to fix decisions. The FBI agent assigned to supervise him goes by the alias of Evon Miller. She is lonely, uncomfortable in her skin, and impervious to Robbie's charms. And she carries secrets of her own.As the law tightens its net, Robbie's and Evon's stories converge thrillingly. Scott Turow takes us into, the world of greed and human failing he has made immortal inPresumed Innocent, The Burden of Proof, Pleading Guilty, and The Laws of Our Fathers, all published by FSG. He also shows us enduring love and quiet, unexpected heroism. Personal Injuries is Turow's most reverberant, most moving novel-a powerful drama of individuals trying to escape their characters.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Farrar & Rinehart incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The New Senate: Liberal Influence on a Conservative Institution, 1959-1972",
        "Authors": "By Foley, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Bringing Up Boys: Practical Advice and Encouragement for Those Shaping the Next Generation of Men",
        "Authors": "By Dobson, James C.",
        "Description": "Here’s sensible advice and caring encouragement on raising boys from the nation’s most trusted parenting authority, Dr. James Dobson.With so much confusion about the role of men in our society, it’s no wonder so many parents and teachers are asking questions about how to bring up boys. Why are so many boys in crisis? What qualities should we be trying to instill in young males? Our culture has vilified masculinity and, as a result, an entire generation of boys is growing up without a clear idea of what it means to be a man.In the runaway bestseller Bringing Up Boys, Dr. Dobson draws from his experience as a child psychologist and family counselor, as well as extensive research, to offer advice and encouragement based on a firm foundation of biblical principles.",
        "Category": " Religion , Christian Living , Family & Relationships",
        "Publisher": "Tyndale Momentum",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "A Girl's Gotta Do What a Girl's Gotta Do",
        "Authors": "By Baty, Kathleen",
        "Description": "Sassy single gal, high-powered exec in high heels, carefree college co-ed, harried soccer mom-- no matter who you are, you deserve to feel secure doing your own thing anytime, anywhere. With a little help from the Safety Chick, it's a cinch. Sharing lessons she's learned--the hard way--along with proven tips from a battery of experts in street smarts, Kathleen Baty gets specific about what to pack for a business trip, where it's safe to shop online, when to report a creepy co-worker, and how to tell that guy who's bothering you at the bar to get lost-- for good. Complete with step-by-step instructions on how to stop an assailant dead in his tracks with your words, your hands, or, if necessary, a few easy-to-use self-defense weapons, this book is a master class in personal safety for women of all ages.\"Many women believe that violence is a mystery that can be understood only by men, but Kathleen Baty knows better. Throughout this book she shows that intuition is deep, brilliant, and powerful.\"--Gavin de Becker, from the Foreword",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Recovering From Rape 2E",
        "Authors": "By Ledray, Linda E., Ph.D.",
        "Description": "From clinical psychologist Linda E. Ledray, Recovering from Rape is a comprehensive handbook offering emotional support and practical guidance to survivors and their loved ones in coping and overcoming the trauma of rape. If you have been sexually assaulted, you are probably experiencing a mix of fear, anger, and depression. If you are a relative, friend, or lover of someone who has been assaulted, you too may be deeply affected by the incident and by the survivor’s reaction to it. However, working together, survivors and their loved ones can recover and may even be able to turn the recovery into an opportunity for positive change and growth. The experiences of survivors recounted throughout this book reassure readers that others have pulled through. Dr. Ledray helps survivors realize that no matter what they did—wore a low-cut blouse, accepted a ride from a stranger, invited an acquaintance home—they did not deserve to be raped. She guides them from guilt or disbelief through bitterness and despair to the decision to take back control of their lives.In addition, this comprehensive handbook explains what to expect at the police station, at the hospital, and, if necessary, in court. It covers such health issues as incest, STD treatments, and post-traumatic stress disorder, and legal information on prosecution and bail, DNA testing, and rape law.An essential resource, Recovering from Rape helps readers learn the most effective ways of dealing with their feelings immediately following an assault, during the subsequent few months, and beyond.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "A Yellow Raft in Blue Water: A Novel",
        "Authors": "By Dorris, Michael",
        "Description": "Michael Dorris has crafted a fierce saga of three generations of Indian women, beset by hardships and torn by angry secrets, yet inextricably joined by the bonds of kinship. Starting in the present day and moving backward, the novel is told in the voices of the three women: fifteen-year-old part-black Rayona; her American Indian mother, Christine, consumed by tenderness and resentment toward those she loves; and the fierce and mysterious Ida, mother and grandmother whose haunting secrets, betrayals, and dreams echo through the years, braiding together the strands of the shared past.",
        "Category": " Fiction , Native American & Aboriginal",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Firing Line (The Destroyer, No. 41)",
        "Authors": "By Murphy, Warren",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "King Edward The Seventh",
        "Authors": "By Philip Magnus",
        "Description": "",
        "Category": "",
        "Publisher": "E.P. Dutton New York 1964",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Mary Emmerling's At Home In The Country: Recipes and Menus for a Year of Entertaining",
        "Authors": "By Emmerling, Mary Ellisor",
        "Description": "Menus for holidays, picnics, and family gatherings include more than one hundred recipes for soups, meat, fowl, salads, desserts, and more, plus useful entertaining ideas",
        "Category": " Cooking , Reference",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "The World of Rottweilers",
        "Authors": "By Nicholas, Anna Katherine",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "7.36",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Much Ado About Nothing (No Fear Shakespeare) (Volume 11)",
        "Authors": "By Shakespeare, William and Crowther, John (EDT)",
        "Description": "Read Shakespeare’s plays in all their brilliance—and understand what every word means!   Don’t be intimidated by Shakespeare! These popular guides make the Bard’s plays accessible and enjoyable.Each No Fear guide contains:The complete text of the original playA line-by-line translation that puts the words into everyday languageA complete list of characters, with descriptionsPlenty of helpful commentary",
        "Category": " Study Aids , Book Notes",
        "Publisher": "Sparknotes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Cup Of Comfort For Sisters",
        "Authors": "By Sell, Colleen (EDT)",
        "Description": "",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Cup of Comfort",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Making patterns from finished clothes",
        "Authors": "By Bensussen, Rusty",
        "Description": "",
        "Category": "",
        "Publisher": "Sterling Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Hiking Guide to Maine",
        "Authors": "By Keim, Mike",
        "Description": "",
        "Category": "",
        "Publisher": "Keim Publications",
        "Price Starting With ($)": "8.64",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Sublime Smoke: Bold New Flavors Inspired by the Old Art of Barbecue",
        "Authors": "By Jamison, Cheryl Alters and Jamison, Bill",
        "Description": "Offers general tips on preparing smoked foods and includes recipes for appetizers, soups and salads, beef, pork, lamb and veal, poultry, shellfish, vegetables, and side dishes",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Harvard Common Press",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "How to run a small business",
        "Authors": "By Lasser, J.K.",
        "Description": "Setting up, managing, and operating a small business successfully are discussed in detail",
        "Category": "",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Blackbird House",
        "Authors": "By Hoffman, Alice",
        "Description": "Alice Hoffman weaves a web of tales, all set in Blackbird House. This small farm on the outer reaches of Cape Cod is a place that is as bewitching and alive as the characters we meet: Violet, a brilliant girl who is in love with books and with a man destined to betray her; Lysander Wynn, attacked by a halibut as big as a horse, certain that his life is ruined until a boarder wearing red boots arrives to change everything; Maya Cooper, who does not understand the true meaning of the love between her mother and father until it is nearly too late. From the time of the British occupation of Massachusetts to our own modern world, family after family's lives are inexorably changed, not only by the people they love but by the lives they lead inside Blackbird House.These interconnected narratives are as intelligent as they are haunting, as luminous as they are unusual. Inside Blackbird House more than a dozen men and women learn how love transforms us and how it is the one lasting element in our lives. The past both dissipates and remains contained inside the rooms of Blackbird House, where there are terrible secrets, inspired beauty, and, above all else, a spirit of coming home.",
        "Category": " Fiction , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Damn Good Resume Catalog (Damn Good Resume Catalog A Course in Resume Writing with 200 Damn Good Exa Special edition by Yana Parker (2002) Paperback",
        "Authors": "By Yana Parker",
        "Description": "",
        "Category": "",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Female Stress Syndrome: How To Recognize and Live With It",
        "Authors": "By Lanoil, Georgia",
        "Description": "Focusing on the female body and mind, this guide discusses stresses unique to women and describes how to recognize and manage the \"syndrome.\"",
        "Category": "",
        "Publisher": "Newmarket Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Under God",
        "Authors": "By Mac, Toby, Tait, Michael, Willis, Leanna, and Tobymac",
        "Description": "In the same uncompromising style of Jesus Freaks, bestselling authors Michael Tait and TobyMac of dc Talk now urge readers to take their stand for America's future--by examining our past. Using unforgettable accounts of both famous and little-known Americans, Under God examines the stories of men and women who forged our nation. Against these, they pair the dark side of America's legacy--racism, slavery, injustice--in order that a new generation might seek God's face and avoid repeating sins of the past. The authors draw on the resources of WallBuilders, a national organization that distributes historical, legal, and statistical information and helps citizens become active in their communities.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "They Thought for Themselves: Daring to Confront the Forbidden",
        "Authors": "By Roth, Sid",
        "Description": "",
        "Category": "",
        "Publisher": "Messianic Vision Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Widow's Wealth Map: Six Steps to Beginning Again",
        "Authors": "By Ford, Scott D.",
        "Description": "",
        "Category": "",
        "Publisher": "Robinson Hoxton Publishing, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Media Unlimited: How the Torrent of Images and Sounds Overwhelms Our Lives",
        "Authors": "By Gitlin, Todd",
        "Description": "A provocative new exploration of our media-saturated lives-a worthy successor to Marshall McLuhan's Understanding Media.Everyone knows that the media is all around us, but no one quite understands its effect on our lives. Critics and analysts focus on this show or that celebrity, but they miss the true import of our total immersion in a fast-moving sea of sounds and images. As he did with television in Inside Prime Time and with the culture wars inThe Twilight of Common Dreams, Todd Gitlin once again recasts the world we think we know. InMedia Unlimited, a remarkable and original look at our media-saturated, speed-addicted world, he makes us stare, as if for the first time, at the biggest picture of all.Ranging from video games to elevator music, action movies to reality shows, punditry to Internet exhibitionists, Gitlin evokes a world of relentless sensation and nonstop stimulus. Far from signaling a \"new information age\" or a rescue from passivity, the media torrent, as he shows, fosters disposable emotions and casual commitments, and threatens to make democracy a sideshow.A charged polemic, Media Unlimited reveals the glut of manufactured images and sounds as one of the defining features of our civilization, and as a perverse culmination of Western hopes for freedom.",
        "Category": " Social Science , Media Studies",
        "Publisher": "Metropolitan Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Men'sHealth Longevity Program: A 12-Week Plan for Bolster Your Health, Get Lean, Boost Your Brainpower, Power Up, Feel Great Now and Later and Keep the Sex Hot",
        "Authors": "By Goldberg, Ken",
        "Description": "Introduces a comprehensive twelve-week program for men that emphasizes a mind-body approach to health and longevity, and presents a variety of activities that range from aerobic exercise to anti-stress techniques and nutrition.",
        "Category": "",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "We Are All The Same: A Story of a Boy's Courage and a Mother's Love",
        "Authors": "By Wooten, Jim",
        "Description": "The extraordinary story of the little South African boy whose bravery and fierce determination to make a difference despite being born with AIDS has made him the human symbol of the world's fight against the disease, told by the veteran American journalist whose life he changed.  Five million more people contracted HIV last year alone. We've all seen the statistics, and they numb us; on some level our minds shut down to a catastrophe of this scope. As with other such immense human tragedies in the past, it can take the story of one special child's life to make us open our minds and our hearts.  While the majority of all AIDS cases occur in Africa, a South African boy named Nkosi Johnson did not become \"an icon of the struggle for life,\" in Nelson Mandela's words, because he was representative but because he was so very remarkable. Everyone who met Nkosi Johnson was struck by his blinding life force, his powerful intelligence and drive, his determination to make something of his short life. By the time of his death, the work he had done in his eleven years on earth was such that The New York Times ran his obituary on the front page, as did many other papers, and tributes appeared on the evening news broadcasts of every major network.  Nkosi Johnson did not live to tell his own story, but one writer whose life he changed has taken up the work of telling it for him. Luckily for the world that writer is Jim Wooten. In his hands, We Are All the Same is a powerful testament to the strength of the human spirit, even as it bears witness to the scope of the tragedy that is unfolding in Africa and around the world, cutting down millions of boys and girls like Nkosi Johnson before they can reach their promise. Written with the brevity and power of a parable, We Are All the Same is a book that is meant to be read by all of us, of all ages and walks of life. Its beginning and ending are terribly sad, but in the middle is the extraordinarily inspiring story of a very unlucky little boy who said, Never mind. I'm going to make my life matter. And he did.",
        "Category": " Health & Fitness , Diseases , AIDS & HIV",
        "Publisher": "Penguin Press HC, The",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Days are Just Packed: A Calvin and Hobbes Collection (Volume 12)",
        "Authors": "By Watterson, Bill",
        "Description": "Zounds! Spaceman Spiff, Stupendous Man, the ferocious tiger Hobbes, and the rest of Calvin&#39;s riotous imagination are all included in The Days Are Just Packed.Calvin, the self-proclaimed \"Boy of Destiny,\" continues to save the universe with his alter egos, Spaceman Spiff and Stupendous Man, at least until Miss Wormwood or his mother bring him back to reality. Susie, Calvin&#39;s nemesis and love interest, remains Calvin&#39;s favorite target. And when he&#39;s not recovering from a ferocious tiger attack, Calvin creates hideous snowmen, plays a moral cat-and-mouse game with Santa, conducts his infamous Dad polls, and combats the monsters under his bed.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Slowness",
        "Authors": "By Kundera, Milan and Asher, Linda (TRN)",
        "Description": "After the gravity of The Unbearable Lightness of Being and Immortality, Slowness comes as a surprise: it is certainly Kundera's lightest novel, a divertimento, an opera buffa, with, as the author himself says, \"not a single serious word in it\"; then, too, it is the first of his novels to have been written in French (in the eyes of the French public, turning him definitively into a \"French writer\").Disconcerted and enchanted, the reader follows the narrator of Slowness through a midsummer's night in which two tales of seduction, separated by more than two hundred years, interweave and oscillate between the sublime and the comic. In the eighteenth-century narrative, the marvelous Madame de T. summons a young nobleman to her chateau one evening and gives him an unforgettable lesson in the art of seduction and the pleasures of love.In the same chateau at the end of the twentieth century, a hapless young intellectual experiences a rather less successful night. Distracted by his desire to be the center of public attention at a convention of entomologists, Vincent loses the beautiful Julie - ready and willing though she is to share an evening of intimacy and sexual pleasure with him - and suffers the ridicule of his peers.A \"morning-after\" encounter between the two young men from different centuries brings the novel to a poignant close: Vincent has already obliterated the memory of his humiliation as he prepares to speed back to Paris on his motorcycle, while the young nobleman will lie back on the cushions of his carriage and relive the night before in the lingering pleasure of memory.",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "The Best, Worst, & Most Unusual: Noteworthy Achievements, Events, Feats & Blunders of Every Conceivable Kind",
        "Authors": "By Felton, Bruce and Fowler, Mark",
        "Description": "In this, the biggest volume of bizarre knowledge ever, seekers of unique trivia will find the answers to many fascinating questions. It includes every possible field, from astronomy to taxidermy, sculpture to sociology. The authors have scoured hundreds of public records, news reports, critical opinions, and statistics to cull the absurd, the great, and the not-so-wonderful from all walks of life. The findings are often humorous, occasionally appalling, sometimes downright strange—but always compelling.",
        "Category": " Reference , Curiosities & Wonders",
        "Publisher": "Galahad",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Next Dominant Species",
        "Authors": "By Lawrence, Milo",
        "Description": "",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Altos Pub Co",
        "Price Starting With ($)": "6.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Somewhere in Ireland A Village is Missing an Idiot",
        "Authors": "By Feherty, David",
        "Description": "Golf’s multitalented combination of Dave Barry, P.J. O’Rourke, and Rick Reilly, David Feherty is the nation’s funniest and most popular on-screen golf personality. His \"Sidespin\" column is the most popular feature in Golf Magazine, and his first novel, A Nasty Bit of Rough, cracked the New York Times bestseller list. Now, at long last, an omnibus of Feherty’s best nonfiction hilarity. Somewhere in Ireland, A Village is Missing an Idiot is a collection of Feherty’s most popular Golf Magazine columns, intermingled with his most outrageous work from Golfonline.com. As an added bonus, readers will be treated to some notorious pieces from his work at the British publication Golf Monthly. Edited by and with a running commentary by Feherty, and accompanied by some of the priceless letters to the editor from readers across the country and around the globe complaining about Feherty’s perversity, Somewhere in Ireland is the perfect Father’s Day gift for the crankiest duffer in every family.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Rugged Land",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    }
]