[
    {
        "Title": "The Official Fajita Cookbook",
        "Authors": "By Miller, Richard L.",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Texas Monthly Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Cats: A Complete Pet Owner's Manual",
        "Authors": "By Helga Fritzsche",
        "Description": "Contains instructions for feeding and training a cat, and providing it with proper health care, supplemented with information about cat behavior and anatomy",
        "Category": "",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Maine, Vermont, New Hampshire: With the Best Coastal Drives and Outlet Shopping",
        "Authors": "By McNeely, Scott (EDT) and Magalaner, Jillian L.",
        "Description": "The best guide to the area, packed with essentialsWhere to cast a line, pitch a tent, or ski, hike, and bikeScenic coastal and mountain drives and walking tours of charming villages and historic citiesGreat places to shop--from country crafts fairs to fine antiques shops, from designer boutiques to discount outletsWhere to stay and eat, no matter what your budgetGrand resorts, charming inns, motels, and bargain B&BsPosh restaurants and cozy cafés, steak houses and fish houses, country kitchens, bistros, and lobster poundsFresh, thorough, practical--off and on the beaten pathCosts, hours, descriptions, and tips by the thousandsAll reviews based on visits by savvy writer-residents23 pages of maps, 10 vacation itineraries, and moreImportant contacts and smart travel tips Fodor's Choice What's Where Pleasures & Pastimes, the don't-miss activities New & Noteworthy Festivals Further reading and videos to watch Complete index",
        "Category": " Travel , United States , Northeast , New England (CT, MA, ME, NH, RI, VT)",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Turnaround",
        "Authors": "By Pelecanos, George P.",
        "Description": "On a hot summer afternoon in 1972, three teenagers drove into an unfamiliar neighborhood and six lives were altered forever.Thirty five years later, one survivor of that day reaches out to another, opening a door that could lead to salvation.  But another survivor is now out of prison, looking for reparation in any form he can find it.THE TURNAROUND takes us on a journey from the rock-and-soul streets of the '70s to the changing neighborhoods of D.C. today, from the diners and auto garages of the city to the inside of Walter Reed Army Medical Hospital, where wounded men and women have returned to the world in a time of war.  A novel of fathers and sons, wives and husbands, loss, victory and violent redemption, THE TURNAROUND is another compelling, highly charged novel from George Pelecanos, \"the best crime novelist in America.\" -Oregonian",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Concise Encyclopedia Of Garden Flowers",
        "Authors": "By Papworth, David",
        "Description": "Describes and illustrates over 450 garden flowers and includes instructions on the best way to grow each flower and encourage blooming",
        "Category": " Technology & Engineering , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Just Say Nu: Yiddish for Every Occasion (When English Just Won't Do)",
        "Authors": "By Wex, Michael",
        "Description": "A cross between Henry Beard's Latin for All Occasions and Ben Schott's Schott's Original Miscellany, JUST SAY NU is a practical guide to using Yiddish words and expressions in day-to-day situations. Along with enough grammar to enable readers to put together a comprehensible sentence and avoid embarrassing mistakes, Wex also explains the five most useful Yiddish words–shoyn, nu, epes, takeh,and nebakh–what they mean, how and when to use them, and how they can be used to conduct an entire conversation without anybody ever suspecting that the reader doesn’t have the vaguest idea of what anyone is actually saying. Readers will learn how to shmooze their way through such activities as meeting and greeting; eating and drinking; praising and finding fault; maintaining personal hygiene; going to the doctor; driving; parenting; getting horoscopes; committing crimes; going to singles bars; having sex; talking politics and talking trash.Now that Stephen Colbert, a Catholic from South Carolina and host of the \"Colbert Report,\" is using Yiddish to wish viewers a bright and happy Chanukah, people have finally started to realize that there’s nothing in the world that can’t be improved by translating it into Yiddish. Wex’s JUST SAY NU is the book that’s going to show them how.",
        "Category": " Language Arts & Disciplines , Translating & Interpreting",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Guide to Owning a Beagle",
        "Authors": "By Vallila, Andrew",
        "Description": "Describes behavioral and health issues of the breed, and offers advice for their feeding, grooming, training, and breeding",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Afghan Hounds (Kw Dog Breed Library)",
        "Authors": "By Pisano, Beverly",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "A Dictionary of Modern English Usage (Wordsworth Reference)",
        "Authors": "By Fowler, H. W.",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Ultimate Encyclopedia of Cats Cat Breeds & Cat Care",
        "Authors": "By Alan Edwards",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House,",
        "Price Starting With ($)": "7.19",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Understanding Arabs: A Guide for Westerners (Interact Series, 5)",
        "Authors": "By Nydell, Margaret K.",
        "Description": "",
        "Category": "",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Dogs",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Colour Nature Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Complete Book of the Dog",
        "Authors": "By Sayer, Angela",
        "Description": "Covers the evolution and history of dogs including anatomy and lifestyle, breeds and champions, and training and obedience",
        "Category": " Technology & Engineering , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Force of Nature (Troubleshooters, Book 11)",
        "Authors": "By Brockmann, Suzanne",
        "Description": "Hard-driving suspense and intense passion are the hallmarks of bestselling author Suzanne Brockmann’s pulse-pounding thrillers. In her tales of daring, danger, courage, and desire, men and women of action fight fiercely, love deeply, and time after time raise the bar for adventure to new heights. Brockmann’s latest novel is no exception. Florida private investigator and ex-cop Ric Alvarado’s life is spiraling out of control. His beautiful new girl Friday, Annie Dugan, is far more interested in fieldwork than filing, and despite Ric’s best efforts to ignore the attraction, sparks are flying between them. Then one of Ric’s clients turns femme fatale and tries to gun down an innocent man. Thanks to quick thinking and even quicker reflexes, Ric comes to the rescue, only to learn he’s done a very good deed for some very bad people. Suddenly Ric finds himself deep undercover with Annie, working for notorious crime boss Gordon Burns. One mistake from Ric’s painfully inexperienced partner and they’re both dead.FBI agent Jules Cassidy’s life isn’t in much better shape. For years the FBI has been trying to prove Gordon Burns’s ties to terrorist activity. Now, thanks to Ric and Annie, Jules has found a way into the lion’s den. But in the course of his investigation he comes face-to-face with Robin Chadwick, the charismatic but self-destructive and closeted movie star for whom Jules feels a powerful attraction. Robin’s in town promoting his latest film–and Gordon Burns is a star-struck movie buff.  With Robin and Jules’s help, Ric and Annie are soon entrenched in Burns’s organization, surrounded by killers who may already have executed an FBI infiltrator. Before long the couple realizes that many more lives besides their own will be at stake if they make a false move. As the heat between them reaches dangerous levels, so do the risks they’re willing to take–in the line of duty, for the sake of loyalty, and in the name of something that runs even deeper.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "From Generation to Generation: How to Trace Your Jewish Genealogy and Personal History",
        "Authors": "By Kurzweil, Arthur",
        "Description": "In this detailed guide to Jewish genealogy, an American authority offers advice based on his own experiences tracing his family history back several centuries",
        "Category": " Reference , Genealogy & Heraldry",
        "Publisher": "Schocken Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "Water Wishes (Magic Elements 1, paper)",
        "Authors": "By Loehr, Mallory",
        "Description": "Nine-year-old Polly and her younger brother, Sam, find a corked bottle at the beach. Inside is an ancient parchment promising three wishes. Before their adventure is over, older brother Joe will disappear and Polly and Sam will have to journey under the sea to get him back! This first book in the new Magic Elements quartet combines magic and adventure in an easy-to-read format perfect for the in-between reader.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "First Great Triumph: How Five Americans Made Their Country a World Power",
        "Authors": "By Zimmermann, Warren",
        "Description": "“We were sure that we would win, that we should score the first great triumph in a mighty world-movement.” — Theodore Roosevelt, 1904  Americans like to think they have no imperial past. In fact, the United States became an imperial nation within five short years a century ago (1898-1903), exploding onto the international scene with the conquest of Cuba, Puerto Rico, the Philippines, Hawaii, Guam, Samoa, and (indirectly) Panama. How did the nation become a player in world politics so suddenly—and what inspired the move toward imperialism in the first place?  The renowned diplomat and writer Warren Zimmermann seeks answers in the lives and relationships of five remarkable figures: the hyper-energetic Theodore Roosevelt, the ascetic naval strategist Alfred T. Mahan, the bigoted and wily Henry Cabot Lodge, the self-doubting moderate Secretary of State John Hay, and the hard-edged corporate lawyer turned colonial administrator Elihu Root. Faced with difficult choices, these extraordinary men, all close friends, instituted new political and diplomatic policies with intermittent audacity, arrogance, generosity, paternalism, and vision. Zimmermann's discerning account of these five men also examines the ways they exploited the readiness of the American people to support a surge of expansion overseas. He makes it clear why no discussion of America's international responsibilities today can be complete without understanding how the United States claimed its global powers a",
        "Category": " History , United States , 19th Century",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Paisley Goes with Nothing",
        "Authors": "By Mullen, Jim and Rubenstein, Hal",
        "Description": "With an irresistible combination of sharp wit, shrewd insight, and great common sense, Paisley Goes with Nothing offers men an invaluable arsenal of survival tactics for the modern world, including Two Easy Pieces (Buying a Suit), A Medium Is the Message - But So Is an Extra Large (What Your Wardrobe Says About You), Father Knew Zip (How to Shave), Geeks Bearing Gifts (Buying Presents), House by You (Entertaining on Your Turf), and dozens more that are as useful and enlightening as they are ingeniously, universally funny.An indispensable resource for every man - and a godsend for those in search of the perfect gift - Paisley Goes with Nothing is society's last hope for keeping the word gentleman from becoming obsolete.",
        "Category": " Humor , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Charged With the Spirit: Mission Is for Everyone",
        "Authors": "By Donders, Joseph G.",
        "Description": "",
        "Category": "",
        "Publisher": "Orbis Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "300 Years of Kitchen Collectibles",
        "Authors": "By Franklin, Linda Campbell",
        "Description": "Offers illustrations and current auction prices for antique stoves, containers, kitchen utensils, appliances, and cookbooks",
        "Category": " Antiques & Collectibles , Kitchenware",
        "Publisher": "Krause Publications",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Groovitude: A Get Fuzzy Treasury (Volume 3)",
        "Authors": "By Conley, Darby",
        "Description": "Debuting in 1999, Get Fuzzy has rocketed to the top of the charts. Get Fuzzy has become a hit cartoon with its bitingly funny portrait of single life with pets.And why not? The laughs come fast and furious. Get Fuzzy features Rob Wilco, a single, mild-mannered advertising executive who&#39;s the so-called guardian of Bucky and Satchel, anthropomorphic scamps that still live by their animal instincts. Bucky, a temperamental cat who carries a boom box and goes on spending sprees, definitely calls the shots in this eclectic household, while Satchel is a kindly canine with a sensitive soul who tries to remain neutral, even though he bears the brunt of his feline companion&#39;s mischief.Between the three of them, the Wilco household faces a whole host of trials and tribulations that classify them as family. Satchel wants his boundaries respected. Bucky refuses to eat vegetables but insists on snarfing up Rob&#39;s plants. Rob tries to meet women, but his pets continually subvert his efforts. In every frame, Get Fuzzy depicts the hilarious war between the species, giving the animals an equal footing in hilarious one-upmanship.Get Fuzzy is the comic strip for everyone who loves their pets with an attitude. That said, Groovitude is Get Fuzzy at its finest.Contains cartoons from The Dog Is Not a Toy and Fuzzy Logic.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "6.98",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "What Happened to the Dinosaurs? (Let's-Read-and-Find-Out Science 2)",
        "Authors": "By Simont, Marc (ILT) and Branley, Franklyn Mansfield",
        "Description": "What happened to the dinosaurs?For millions of years these fantastic creatures roamed our planet. Then, suddenly, they all disappeared. Scientists wonder why. What could have caused this huge extinction 65 million years ago?In this enlarged edition, distinguished writer Franklyn M. Branley and award-winning artist Marc Simont provide the perfect introduction to an always fascinating subject - the disappearance of the dinosaurs.Outstanding Science Trade Books for Children 1989 (NSTA/CBC)",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , Weather",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Crafts For Hanukkah (Holiday Crafts for Kids)",
        "Authors": "By Ross, Kathy and Holm, Sharon Lane (ILT)",
        "Description": "Offers twenty simple projects that kids can make with everyday objects to celebrate the holiday season, including step-by-step instructions and lists of materials",
        "Category": " Juvenile Nonfiction , Crafts & Hobbies",
        "Publisher": "Millbrook Press ™",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "The Age of Speed: Learning to Thrive in a More-Faster-Now World",
        "Authors": "By Poscente, Vince",
        "Description": "Is our 24/7, CrackBerry, more-faster-now culture eating us alive or setting us free? For everyone feeling trampled by the speed of life and business, author Vince Poscente reveals why harnessing the power of speed is the ultimate solution for our time-starved era. The Age of Speed shows this and other groundbreaking revelations at work with case studies drawn from renegade companies such as Netflix, Geico, and Nintendo. With smart personal revelations, addictively clever pop science, practical case studies, and a fresh voice, The Age of Speed is a fast, fun read.",
        "Category": " Self-help , Self-Management , Time Management",
        "Publisher": "Bard Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Transformers:  The Fantasy, the Fun, the Future",
        "Authors": "By Brereton, Erin",
        "Description": "The subject of major motion pictures, successful TV series, comic books, and more, Transformers come to life in this exciting resource. Fans will love this collection of factoids, movie information, history, and more related to their favorite Transformers.",
        "Category": " Performing Arts , General",
        "Publisher": "Triumph Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Jamaica Tag-Along",
        "Authors": "By Havill, Juanita and O'Brien, Anne Sibley",
        "Description": "Discouraged by her big brother from being a tag-along, little Jamaica nevertheless is nice to a younger boy who wants to play with her and ends up having lots of fun",
        "Category": " Juvenile Fiction , People & Places , United States , African American",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "The Self-Hypnosis Diet: Use the Power of Your Mind to Reach Your Perfect Weight",
        "Authors": "By Gurgevich, Steven, Ph.D. and Gurgevich, Joy",
        "Description": "Emphasizing the importance of the subconscious mind-body connection, a renowned hypnosis expert and a behavioral nutritionist present successful techniques that enable individuals to reach and maintain their ideal weight based on their own needs.",
        "Category": " Self-help , Self-Hypnosis",
        "Publisher": "Sounds True, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Cats (First Pets)",
        "Authors": "By Petty, Kate",
        "Description": "Describes the characteristics and behavior of cats, shows different breeds, and tells how to properly handle a cat",
        "Category": " Juvenile Nonfiction , Animals , Cats",
        "Publisher": "Barrons Juveniles",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "The Light of Meridian (W.I.T.C.H. No. 7)",
        "Authors": "By Komorn, Julie and Kormorn, Julie (ADP)",
        "Description": "Will, Irma, Taranee, Cornelia, and Hay Lin (W.i.t.c.h.) are five ordinary friends with an extraordinary secret: they each have the power to control a natural element-air, water, fire, earth, and finally, the mysterious \"Heart of Candracar.\" The girls use their powers to guard against evil and to uncover the truth behind mysterious portals leading to other worlds. Between school, family, and a new interest in boys, these girls had enough to worry about! But now they have the secret to turn into a group of friends with special powers . . . destined to fight the evil Prince Phobos in the magic world of Metamoor. W.i.t.c.h. combines fashion and fantasy, magic and middle school, heroism and humor, friendship and family, teamwork and transformation, in a wholesome mix proven to charm the tween girl market. Introducing a hybrid format that combines four-color comics with a traditional chapter book format.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Volo",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Hope Was Here (2001 Newbery Honor Book)",
        "Authors": "By Bauer, Joan",
        "Description": "When sixteen-year-old Hope and the aunt who has raised her move from Brooklyn to Mulhoney, Wisconsin, to work as waitress and cook in the Welcome Stairways diner, they become involved with the diner owner's political campaign to oust the town's corrupt mayor.When sixteen-year-old Hope and the aunt who has raised her move Mulhoney, Wisconsin, to work as waitress and cook in a diner, they become involved with the diner owner's political campaign to oust the town's corrupt mayor.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "An Acquaintance With Darkness [Paperback] by Ann Rinaldi",
        "Authors": "By Ann Rinaldi",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Family Circle's 2000 Hints and Tips: For Cooking, Cleaning, Organizing, and Simplyfying Your Life",
        "Authors": "By Family Circle Books",
        "Description": "An Invaluable Collection of Time- and Money-Saving Tips Designed to Make Your Life More LivableYOUR TIME Keep your car's glove compartment stocked with fast-food coupons and take-out restaurant menus so you can choose and pick up dinner on the way home from work.YOUR HOME Creaky wood floors? Sprinkle some talcum powder between the floorboards. This will fill in the tiny gaps caused by shrinkage and imperfections in the wood.YOUR SELF Give yourself a \"secret\" foot massage. Keep a firm rubber ball under your desk and rub your foot over it, from heel to toe.Is closet clutter driving you nuts?Look no further for ways to utilize space you may not even know you have.Are you loco over laundry?In these pages you'll find the best stain removal chart ever.Is a drippy faucet making you flip?Here is the best fix-it advice there is for everything from squeaky floors to creaky doors.Do leftovers love your rent-free cold storage?Learn just how long it's safe to keep those space-stealing bits and pieces.Whether it's a problem, an annoyance, or a domestic dilemma you just can't solve, Family Circle 2000 Hints & Tips has all the answers.  It's the only book you'll turn to again and again, like an old friend whose advice you know you can trust, and who'll always be there in your time of need.Organized in a way that relates directly to what's important --your time, your home, yourself--FAMILY CIRCLE 2000 HINTS AND TIPS puts simple solutions at your fingertips. Is closet clutter driving you nuts? Look no further for ways to utilize space you may not even know you had. Loco over laundry? Within these pages you'll find the best stain-removal chart ever. Is a flickering lamp making you flip out? Here's the best fix-it advice there is for everything from squeaky floors to leaky faucets. Do leftovers love your rent-free cold-storage? Learn just how long it's safe to keep those space-stealing bits and pieces.Be it a problem, an annoyance, or a domestic dilemma you just can't solve, FAMILY CIRCLE 2000 HINTS AND TIPS has the answer. In short, this is a book you'll turn to again and again. And, like that trusted friend, it will always be there when you need it.FAMILY CIRCLE 2000 HINTS AND TIPS is compiled by the EDITORS OF FAMILY CIRCLE, whose mission, so well demonstrated in this book, is to help busy men and women create the best possible lives for themselves and their families. -->",
        "Category": " Family & Relationships , General",
        "Publisher": "Main Street Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Guerrilla Marketing for Writers : 100 Weapons to Help You Sell Your Work",
        "Authors": "By Levinson, Jay Conrad, Frishman, Rick, and Larsen, Michael",
        "Description": "",
        "Category": " Language Arts & Disciplines , Publishers & Publishing Industry",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "The Family Tree Resource Book for Genealogists",
        "Authors": "By Carmack, Sharon Debartolo (EDT) and Nevius, Erin (EDT)",
        "Description": "The ONE Book Every Genealogist Must Have!Whether you're a novice or a pro, The Family Tree Resource Book for Genealogists provides you with the information you need to trace your roots across the U.S.Research summaries, tips and techniques, with maps for every U.S. stateDetailed county-level data, essential for unlocking the wealth of records buried in the county courthouseWebsites and contact information for libraries, archives, and genealogical and historical societiesBibliographies for each state to help you further your researchContributions from top genealogists Emily Anne Croom, David A. Fryxell, Rhonda R. McClure, Maureen A. Taylor, andJames W. WarrenYou will love having this wealth of state and county information at your fingertips, all in an easy-to-use format and from the trusted authors of Family Tree Books!",
        "Category": " Reference , Genealogy & Heraldry",
        "Publisher": "Family Tree Books",
        "Price Starting With ($)": "7.82",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Planting for Color (The Horticulture Gardener's Guides)",
        "Authors": "By Chivers, Sue",
        "Description": "A guide to choosing plants for color shows readers how make the proper selections, whether the goal is to create a spontaneous-looking garden or a more formal, designed look. Original.  10,000 first printing.",
        "Category": " Gardening , Garden Design",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Pro Football Hall of Fame Presents: Their Deeds and Dogged Faith",
        "Authors": "By Rathet, Mike",
        "Description": "",
        "Category": "",
        "Publisher": "Rutledge Books, Distributed by Kampmann",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Judy Moody Was in a Mood, Not a Good Mood, A Bad Mood (Book No. 1)",
        "Authors": "By McDonald, Megan and Reynolds, Peter (ILT)",
        "Description": "The book that started it all—now in paperback!Judy Moody was in a mood. Not a good mood. A bad mood. A mad-faced mood.Judy Moody doesn’t have high hopes for third grade. But she does have an abundance of individuality and attitude, and when Mr. Todd assigns the class a special Me Project, she really gets a chance to express herself! Megan McDonald’s spirited text and Peter Reynolds’s wry illustrations will delight any kid who’s known a bad mood or a bad day - and managed to laugh anyway.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Raising a Thinking Preteen",
        "Authors": "By Shure, Myrna B.",
        "Description": "In her bestselling Raising a Thinking Child, Myrna B. Shure introduced her nationally acclaimed \"I Can Problem Solve\" program, which helps four to seven-year-olds develop essential skills to resolve daily conflicts and think for themselves. With Raising a Thinking Preteen, Shure has tailored this plan especially for eight-to twelve-year-olds as they approach the unique challenges of adolescence.The preteen years are often the last opportunity for parents to teach their children how to think for themselves. This book is the only source with a proven plan to help them do just that.",
        "Category": " Family & Relationships , Conflict Resolution",
        "Publisher": "Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Finding Work Without Losing Heart: Bouncing Back from Mid-Career Job Loss",
        "Authors": "By Byron, William J.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Adams Media Corporation",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "U.S. Versus Them: How a Half-Century of Conservatism Has Undermined America's Security",
        "Authors": "By Scoblic, J. Peter",
        "Description": "Evaluates the formidable consequences of the Bush administration's conservative foreign policy on national security, tracing the path of conservatism throughout the past half century while making sobering predictions about the nation's vulnerability to nuclear terrorism.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Powerful Conversations: How High Impact Leaders Communicate",
        "Authors": "By Harkins, Philip J.",
        "Description": "\"Phil Harkins has it exactly right. To be a leader is to communicate powerfully—as he does in this thoughtful book.\"- Robert B. Reich,  Professor of Social and Economic PolicyBrandeis University. Powerful Conversations breed a powerful organization. POWERFUL CONVERSATIONS is packed with goal-oriented strategies, tools, and real-life examples from great leaders. Use its deliberate, directed techniques to achieve exceptional levels of performance, create and maintain valuable relationships, and forward the goals of both yourself and your organization with every word you speak. Mastering the three stages of a Powerful Conversation—from shared feelings and beliefs, to an exchange of wants and needs, closing with action steps and mutual commitments—will help you exercise more control over your interactions, and greatly enhance both your leadership skills and your success. Look inside to discover:  How to plan, conduct, and measure Powerful Conversations;  Using the Tower of Power as a tool in coaching;  The four Cs of Trust—clarity, caring, consistency, and commitment Five strategies to satisfy—and keep—your best employees Tools to turn the company grapevine from a poisonous plant into a pathway for learning Determining your leadership competencies through the Leadership Assessment Instrument Targeting Passionate Champions to drive an Agenda for Change. Leaders across the country are praising POWERFUL CONVERSATIONS: \"Phil Harkins has it exactly right. To be a leader is to communicate powerfully—as he does in this thoughtful book.\" - Robert B. Reich, Professor of Social and Economic Policy, Brandeis University. \"Powerful Conversations have made a real difference in the effectiveness of the Operations Senior Leadership Team. We are delivering unprecedented results thanks to the clearer communication and improved working relationships.\" - Larry Gundrum, Senior Vice President, Kraft Foods. \"In my business, Powerful Conversations are leading to believability and a growing sense of achievability  by our employees that they can drive a massive agenda for change.\" - Linda Coughlin, Managing Director, Scudder Kemper Investments, Inc. \"In a fast forward world, candor and clarity are prerequisites for success. POWERFUL CONVERSATIONS is a must read book for leading into the 21st century.\" -  Steve Ozonian, Chairman and CEO, Prudential Real Estate and Relocations Solutions. \"A powerful guide, both savvy and wise, to emotional intelligence in action. Phil Harkins has given us an essential handbook for leaders at any level.\" - Daniel Goleman, Author, Working with Emotional Intelligence.",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Carbohydrate Addict's Lifespan Program: A Personalized Plan for becoming Slim, Fit, and Healthy your 40s 50s 60s and Beyond",
        "Authors": "By Heller, Richard F.",
        "Description": "Drawing from their breakthrough research into the carbohydrate-insulin connection, which made The Carbohydrate Addict's Diet such a huge bestseller, the Hellers offer the comprehensive, straightforward STAR Program: a plan that is Simple, Targeted, Adaptable, and Rewarding.By following this simple program, you'll reap the outstanding rewards of reduced cravings and weight, along with increased energy and health. On the LifeSpan program, virtually all foods are allowed - in enjoyable and satisfying quantities. As your cravings drop, you'll choose from a variety of nutrition, activity, stress-reduction, and other lifestyle options that maximize continued weight loss and good health. You'll find tempting meal plans and dozens of delicious recipes, along with special hints for dining out, eating alone, entertaining, vacations, and family celebrations.The Carbohydrate Addict's LifeSpan Program will help you personalize a plan for getting trim and staying vigorous through the best years of life - all without struggle or sacrifice.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Zathura: Zorgons Attack! (Zathura: The Movie)",
        "Authors": "By Weiss, Ellen",
        "Description": "An out of this world picture book includes scenes from the new Zathura feature film being released November 23rd, which stars Tim Robbins, Dax Shepard, Josh Hutcherson, and Jonah Bobo. Original. 100,000 first printing.",
        "Category": " Juvenile Fiction , Science Fiction",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Writer's Little Helper",
        "Authors": "By Smith, James V.",
        "Description": "Big Fiction Advice from a Little BookThere is nothing little about the dynamic fiction-writing advice inside The Writer's Little Helper. With big ideas, time-saving tips, and revision-made-easy charts, James V. Smith, Jr. offers effective guidance in short, easily checklists, Q&As, and practical tools.This book gives you everything you need to:Create great charactersMaintain a compelling paceCraft believable dialogueExpand your creativityRevise your work to perfectionAttract agent's and editor's attentionAnd much, much more! The unique format of the book allows you to read from start to finish or to focus just on areas where your fiction needs work. With valuable and surprising tips on every page, The Writer's Little Helper is sure to become your biggest fiction writing aid.",
        "Category": " Language Arts & Disciplines , Writing , Authorship",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Dear Barbie: Let's Have a Sleepover (Look-Look)",
        "Authors": "By S. I. Artists (ILT) and Lasser, Bonnie",
        "Description": "Barbie tells the story of her sister Stacie's friend Emily, who became homesick when she slept over at their house",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "My Grandma is Great",
        "Authors": "By Goldsack, Gaby and Walker, Sara (ILT)",
        "Description": "A young boy describes his grandmother's good qualities.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Paragon Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "My Grandpa Is Great",
        "Authors": "By Parragon Inc. (COR)",
        "Description": "A young girl describes her grandfather's good qualities.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "It Happened at Grand Canyon (It Happened In Series)",
        "Authors": "By Berger, Todd R.",
        "Description": "The Grand Canyon is an American icon, a scenic wonder like no other. From the several Native American tribes who have called Grand Canyon home to swashbuckling pioneers to an airliner collision over the canyon that led to the formation of the FAA, It Happened at Grand Canyon tells the history of this colossal, magnificent place.",
        "Category": " Travel , Parks & Campgrounds",
        "Publisher": "TwoDot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "FIRE's Guide to Student Fees, Funding, and Legal Equality on Campus",
        "Authors": "By Lorence, Jordan",
        "Description": "",
        "Category": " Law , General",
        "Publisher": "Foundation for Individual Rights in Education",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Of Danish ways",
        "Authors": "By Ingeborg S MacHaffie",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.45",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "What Happened to Heather Hopkowitz?",
        "Authors": "By Herman, Charlotte",
        "Description": "Ages 8 and up. Fourteen-year-old Heather Hopkowitz can’t imagine life without bacon, cheeseburgers, or bowling on Friday nights. But she gives them all up when she spends an entire month as the guest of an Orthodox Jewish family while her parents are away on vacation. As Heather begins to appreciate the traditional rituals, she considers becoming observant. What will her friends think? What will her parents think?",
        "Category": " Young Adult Fiction , Short Stories",
        "Publisher": "The Jewish Publication Society",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Squanto: The Pilgrim Adventure",
        "Authors": "By Jassem, Kate",
        "Description": "After agreeing to be an interpreter for a group of English explorers, Squanto is unable to return home for fourteen years, at which time he discovers his tribe is extinct",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "The Disappearance of the Outside: A Manifesto for Escape",
        "Authors": "By Codrescu, Andrei",
        "Description": "The author recounts his life in Romania and in America, relating his thoughts on revolution, freedom, and the world today",
        "Category": "",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "South America (Insight Guide South America)",
        "Authors": "By Insight",
        "Description": "",
        "Category": "",
        "Publisher": "Hungry Minds Inc,U.S.",
        "Price Starting With ($)": "14.44",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Honus and Me: A Baseball Card Adventure",
        "Authors": "By Gutman, Dan",
        "Description": "With more than 2 million books sold, the Baseball Card Adventures bring the greatest players in history to life!Joe Stoshack lives for baseball. He knows everything there is to know about the game—except how to play well. His specialty is striking out. Stosh feels like a real loser, and when he takes a low-paying job cleaning a bunch of junk out of his neighbor's attic, he feels even worse—until he comes across a little piece of cardboard that takes his breath away. His heart is racing. His brain is racing. He can hardly believe his eyes. Stosh has stumbled upon a T-206 Honus Wagner—the most valuable baseball card in the world! But he's about to find out that it's worth a lot more than money. Because it turns out Stosh has the incredible ability to travel through time using baseball cards—and now he’s headed back to 1909, when Honus Wagner played for the Pittsburgh Pirates in a World Series for the record books.With historical photos and back matter to separate the facts from the fiction, New York Times bestselling author Dan Gutman takes readers on a page-turning trip through baseball’s past.",
        "Category": " Juvenile Fiction , Sports & Recreation , Baseball & Softball",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Bible Devotions for Bedtime (Bedtime Bible Stories)",
        "Authors": "By Partner, Daniel and Hoit, Richard (ILT)",
        "Description": "Going a step beyond Bible stories, this fun devotional book challenges children ages five to eight to stop and think about the meaning of each account. More than five dozen devotions are drawn from the breadth of Scripture-from the Creation to Revelation-and are brightly illustrated, in full color, for young readers' pleasure. Bible Devotions for Bedtime is perfect for parents wanting to spend spiritual \"quality time\" with their kids! It's an ideal follow up to Barbour's Bible Stories for Bedtime.",
        "Category": " Juvenile Nonfiction , Religion , Biblical Studies",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Royally Jacked (The Romantic Comedies)",
        "Authors": "By Burnham, Niki",
        "Description": "Valerie's life is pretty good. While she's not the most popular girl in school, she does have decent grades, great friends, and a potential boyfriend. All a girl could want.  Then her mother announces that (1) she's gay, and (2) she's leaving Valerie's dad for her girlfriend. Not what Valerie envisioned for her future. And just when Valerie is getting over this bombshell, her father tells her he's gotten a new job as protocol chief for the royal family of some obscure European country.  Valerie's world has come unglued. She can either stay in Virginia with her mom and her über-organized, veggie-burger-eating girlfriend, or go with her dad, leaving everything she knows for some place she's never heard of. Valerie opts to go, and quickly discovers that it was a mistake -- until she meets the prince, and all bets are off!",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Holland",
        "Authors": "By Herman Scholten",
        "Description": "",
        "Category": "",
        "Publisher": "Bears Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Legendary Lighthouses (Lighthouses (Chelsea House))",
        "Authors": "By Grant, John and Jones, Ray",
        "Description": "Presents stories and photographs of lighthouses all over the United States, from the North Atlantic and Maine down to the South Atlantic, to California and the Pacific Northwest, and the Western Great Lakes. Contains 125 color photographs of the lighthouses, their geographical surroundings, and details of their lamps and structures.  Recounts historical tales and legends, and interviews contemporary subjects, also discussing preservation efforts on behalf of lighthouses. No references. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Travel , Pictorials",
        "Publisher": "Globe Pequot Pr",
        "Price Starting With ($)": "6.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Oracle PL/SQL Programming, Third Edition",
        "Authors": "By Feuerstein, Steven and Pribyl, Bill",
        "Description": "Nearly a quarter-million PL/SQL programmers--novices and experienced developers alike--have found the first and second editions of Oracle PL/SQL Programming to be indispensable references to this powerful language. Packed with examples and recommendations, this book has helped everyone, from Oracle Forms developers to database administrators, make the most of PL/SQL. This new edition is a comprehensive update of the original book, covering all versions of PL/SQL through Oracle9i Release 2. It adds much-requested new chapters on how to create and run PL/SQL programs, call Java methods from within PL/SQL, and define and use database triggers. An extensive new chapter--designed especially for experienced PL/SQL developers--describes PL/SQL's runtime architecture and how to use knowledge of Oracle internals to get the best performance from PL/SQL.The book contains information about the latest Oracle9i PL/SQL features, including:Record-based DML: You can now use records in INSERT and DELETE statements.Table functions: These are functions that return a result set (in the form of a PL/SQL collection). Such functions existed in Oracle8i but they are now much expanded.New and improved datatypes: Oracle now offers dramatically improved support for timestamps, time zone management, and interval calculations. In addition, the XMLType datatype has now been implemented.Inheritance for object types: You can now define a hierarchy of object types (which were first introduced in Oracle8). Enhancements to PL/SQL collections.  PL/SQL now supports multiple-level collections (nesting collections withincollections), as well as associative arrays (previously called index-by tables), which allow you to index by PLS_INTEGER and VARCHAR2.Native compilation of PL/SQL code: PL/SQL source code can now optionally be compiled into native object code that is linked into Oracle. The book is divided into six parts:Part I, Programming in PL/SQL Part II, PL/SQL Program Structure Part III, PL/SQL Program Data Part IV, SQL in PL/SQLPart V, PL/SQL Application ConstructionPart VI, Advanced PL/SQL TopicsEven if you've been a PL/SQL developer for years, you'll find an enormous amount of new and revised information in this third edition and on its companion web site. If you're new to PL/SQL, you'll find Oracle PL/SQL Programming an invaluable companion on the road to mastery.",
        "Category": " Computers , Database Management , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "6.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Calliope: a handbook of 47 poetic forms and figures of speech",
        "Authors": "By Lipson, Greta and Romantowski, Jane",
        "Description": "",
        "Category": "",
        "Publisher": "Good Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "English Essayists",
        "Authors": "By DOBREE, Bonamy",
        "Description": "",
        "Category": "",
        "Publisher": "Collins",
        "Price Starting With ($)": "19.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1946"
        }
    },
    {
        "Title": "Junior Girl Scout Handbook",
        "Authors": "By Girl Scouts",
        "Description": "Describes the history of Girl Scouting and its programs, and presents year-long activities for Juniors",
        "Category": " Juvenile Nonfiction , Gardening",
        "Publisher": "Girl Scouts of the USA",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Cinderella (Strawberry Shortcake; Berry Fairy Tales)",
        "Authors": "By Megan E. Brytan",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Race to the Tower of Power (Backyardigans)",
        "Authors": "By Aikins, Dave (ILT), Lukas, Catherine, and Peltzman, Adam",
        "Description": "Pablo and Tyrone, playing as supervillains Yucky Man and Dr. Shrinky, race against superheroes Uniqua and Austin--also known as Weather Woman and Captain Hammer--for control over the Key of the Wold, located in the Tower of Power.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Grammatically Correct",
        "Authors": "By Stilman, Anne",
        "Description": "How does good writing stand out?If its purpose is to convey facts, findings, or instructions, it need be read only once for its content to be clear. If its purpose is to entertain or to provoke thought, it makes readers want to come back for more.Revised and updated, this guide covers four essential aspects of good writing:Individual words - spelling variations, hyphenation, frequently confused homonyms, frequently misused words and phrases, irregular plurals and negatives, and uses of capitalization and type style to add special meaningsPunctuation - the role of each mark in achieving clarity and affecting tone, and demonstration of how misuses can lead to ambiguitySyntax and structure - agreement of subject and verb, parallel construction, modifiers, tenses, pronouns, active versus passive voice, and moreStyle - advice on the less hard-and-fast areas of clarity and tone, including sentence length and order, conciseness, simplification, reading level, jargon and clichés, and subtletyFilled with self-test exercises and whimsical literary quotations, Grammatically Correct steers clear of academic stuffiness, focusing instead on practical strategies and intuitive explanations.Discussions are designed to get to the heart of a concept and provide a sufficient sense of when and how to use it, along with examples that show what ambiguities or misinterpretations might result if the rules are not followed. In cases where there is more than one acceptable way to do something, the approach is not to prescribe one over another but simply to describe the options.Readers of this book will never break the rules of language again - unintentionally.",
        "Category": " Language Arts & Disciplines , Grammar & Punctuation",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Get the Most from Your Digital Camera: The Ultimate Guide to Digital Cameras, Software, Printing and Technique",
        "Authors": "By Joinson, Simon",
        "Description": "",
        "Category": " Photography , Techniques , Digital",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Animals in Action (Child's First Library of Learning)",
        "Authors": "By Berry, C. E.",
        "Description": "Questions and answers, photographs, drawings, cartoon characterizations, charts, and diagrams provide information on physical properties and behavior of animals.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "8.58",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Things Around Us (Child's First Library of Learning)",
        "Authors": "By Time-Life Books",
        "Description": "Questions and answers present some of life's everyday mysteries, such as why steel rusts, why soap gets things clean, and how plants grow",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Bound for Oregon",
        "Authors": "By Van Leeuwen, Jean and Watling, James (PHT)",
        "Description": "\"Basing her story on the published accounts of her true-life heroine, Mary Ellen Todd, Van Leeuwen describes a family's tumultuous journey along the Oregon Trail in 1852.\" --Publishers WeeklyWith only a guide book to show them the way, the Todd family sets out from their Arkansas home on a two thousand mile trek to claim unchartered Oregon Territory. Crossing rough terrain and encountering hostile people, the Todds show their true pioneering spirit. But as winter draws near, will the Todds have the strength to complete their journey? And if they make it, will Oregon fulfill their dreams?“This is a convincing picture of a pioneer journey that does a good job of showing the tremendous sacrifices people made to follow their dream of a better life.” –School Library Journal",
        "Category": " Juvenile Fiction , Historical , United States , 19th Century",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "9.67",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Claggett Center: A personal review and guide",
        "Authors": "By Fallowfield, Wm. H",
        "Description": "",
        "Category": "",
        "Publisher": "the author",
        "Price Starting With ($)": "17.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Ice Age 2: Join the Pack! (I Can Read Book 2)",
        "Authors": "By Artful Doodlers (ILT) and O'Ryan, Ellie",
        "Description": "It is not easy being the last mammoth on earth. Thankfully, Manny has found a herd to call his own. But when the ice around them starts melting, the pack must find a way to escape the oncoming flood.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "All About Magnifying Glasses (Do-It-Yourself Science)",
        "Authors": "By Berger, Melvin and Freem, Elroy (ILT)",
        "Description": "Describes what magnifying glasses can do and provides suggestions for experiments using them",
        "Category": "",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "9.67",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Won't Somebody Play with Me?",
        "Authors": "By Kellogg, Steven",
        "Description": "Angry because she thinks her friends no longer want to play with her, Kim imagines ways of gaining revenge",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "A Perfect Picnic (Sesame Street)",
        "Authors": "By Albee, Sarah",
        "Description": "",
        "Category": "",
        "Publisher": "Dalmatian Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Surprise for a Princess (Step into Reading)",
        "Authors": "By RH Disney (COR), Weinberg, Jennifer Liberts, Marrucchi, Elisa (ILT), and Emslie, Peter (ILT)",
        "Description": "It’s Princess Aurora’s birthday, and the good fairies want to prepare a surprise for her without using any magic. Young readers will enjoy the fun and mayhem that ensues in this Step 2 reader based upon the Disney classic, Sleeping Beauty.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Taps: A Novel",
        "Authors": "By Morris, Willie",
        "Description": "The final work by one of America’s most beloved authors, TAPS returns to the stretch of southern delta that Willie Morris made famous with his award-winning classic NORTH TOWARD HOME and the enormously popular tales of his inimitable dog Skip. Morris said he put everything he knew into this novel, and the result is the crowning achievement of his career -- a tender, powerful, very American story about the vanishing beauty of the South and the fleeting boyhood of a young man coming of age in a time of war.It is 1951 when sixteen-year old Swayze Barksdale watches the young men of Fisk's Landing, Mississippi, march off to a faraway place called Korea. Too young to serve overseas, Swayze is soon called to unexpected duty at home: a local boy is an early casualty of the war, and Swayze is enlisted to play \"Taps\" at his graveside. Gradually, Swayze begins to pace his life around these all too frequent funerals, where his horn sounds the tragic note of the times.Still, life in Fisk’s Landing goes on, with its comforting rhythms, hilarious mishaps, moments of pure joy. Young love blossoms, age-old hatreds flare. A cast of eccentric characters help shepherd Swayze into adulthood and teach him what it means to be a patriot, a son, a lover, a friend. Ultimately, when \"Taps\" is played for someone he holds very dear, Swayze learns what it means to be man.Wonderfully assured, infinitely wise, TAPS showcases Willie Morris at his most accomplished and resonant, as he takes readers on one last fictional journey through his South, a place as familiar to him \"as water or grass or sunlight.\"  Sure to be an instant classic, TAPS is a beautiful, unforgettable story about ordinary people whose lives proceed with the same inevitability as the seasons until day is done.",
        "Category": " Fiction , Literary",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Strangers in Death",
        "Authors": "By Robb, J. D.",
        "Description": "Technology may be different in 2060 New York, yet the city is still a place of many cultures and great divides. And as ever, some murders receive more attention than others, especially those in which the victim is a prominent businessman, found in his Park Avenue apartment, tied to the bed - and strangled - with cords of black velvet.It doesn't surprise Lieutenant Eve Dallas that Thomas Anders's scandalous death is a source of titillation and speculation for the public - and humiliation for his family. While everyone else in the city is talking about it, those close to Anders aren't so anxious to do so. Fortunately, because Dallas's billionaire husband, Roarke, happens to own the prime real estate where Anders's sporting-goods firm was headquartered, she has some help with access. Before long, she's knocking on doors - or barging through them - to look for the answers she needs.But the facts don't add up. Physical evidence suggests that the victim didn't struggle. The security breach in the highly fortified apartment indicates that the killer was someone close to Anders, but everyone's alibi checks out, from the wife who was off in the tropics to the loving nephew who stands to inherit millions. Was this a crime of passion - or a carefully planned execution?It's up to Dallas to solve a sensational case where all involved guard secrets from one another - and strangers may be connected in unexpected, and deadly, ways.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Putnam Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Dark Room: A Novel",
        "Authors": "By Seiffert, Rachel",
        "Description": "1. What does Seiffert imply about the relationship of the individual to the atrocities? Do Helmut, Lore and Micha’s responses to their situations differ according to their proximity to the events? 2. ‘I am a camera. I see the world from one particular standpoint, and my interpretation of events is based on that view.’ To what extent can this metaphor be used to describe the novel? 3. The Dark Room has been described by The Guardian as ‘cold and devoid of emotional involvement’. Do you agree? Do the three-part structure and the prose style of the novel add or detract from the emotional pull of the story? 4. 'The novel ends on a note of optimism. The truth has been confronted and, with the birth of a child, Seiffert holds out the hope that the shadows of the past may be about to lift' (Sunday Telegraph). Do you see this book as a redemptive novel? 5. How does Seiffert’s investigation of the most difficult moral issues of the past century -- the legacy of atrocity -- challenge our prejudices and preconceptions about the Nazi era? 6. Each of us is an individual; each of us has individual responsibility for our own actions. Each of us is also a member of a family, of families; each of us is a citizen of a state, a member of a nation. Can we, must we, take responsibility for them, for their actions too?",
        "Category": " Fiction , Historical",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Home for a Bunny",
        "Authors": "By Brown, Margaret Wise",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1983"
        }
    },
    {
        "Title": "What's for Lunch? - Arch Books",
        "Authors": "By Streff, Michael (ILT) and Bader, Joanne",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Concordia Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "A Bride for Donnigan (Women of the West #7)",
        "Authors": "By Oke, Janette",
        "Description": "Donnigan, who dreams of having a wife and helpmate, lives on the western frontier, while Kathleen, who yearns for adventure, lives thousands of miles away, but their love develops through letters. Original.",
        "Category": " Fiction , Religious",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "I Am Madame X",
        "Authors": "By Diliberto, Gioia",
        "Description": "The life of Virginie Gautreau, the notorious beauty of Madame X, John Singer Sargent's most famous and scandalous portrait, provides inspiration for this absorbing and intriguing novel.In this novel, Gioia Diliberto tells Virginie's story, drawing on the sketchy facts of Virginie's life to re-create her tempestuous personality and the captivating milieu of nineteenth-century Paris. Born in New Orleans to two of Louisiana's prominent Creole families and raised at Parlange, her grandmother's lush plantation. Virginie fled to France with her mother and sister during the Civil War. The family settled in Paris among other expatriate Southerners and hoped, through their French ancestry, to insinuate themselves into high society. They soon were absorbed into the fascinating and wealthy world of grand ballrooms, dressmakers' salons, luxurious country estates, and artists' ateliers. Because of Virginie's striking appearance and vivid character, her mother pinned the family's hopes for social acceptance on her daughter, who became a \"professional beauty\" and married a French banker. Even before Sargent painted her portrait, Virginie's reputation for promiscuity and showy self-display made her the subject of vicious Paris gossip.I Am Madame X is a compulsively readable immersion in Belle Epoque Paris. It is also the story of a great work of art, illuminating the struggle between Virginie and Sargent as they fought to control the outcome of a painting that changed their lives and affected the course of art history.",
        "Category": " Fiction , Literary",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Autumn Bridge",
        "Authors": "By Matsuoka, Takashi",
        "Description": "In the year 1311, in the highest tower of Cloud of Sparrows Castle, a beautiful woman sits by the window, watching as enemies gather below and fires spread through the night. As she calmly awaits her fate, she begins to write, carefully setting down on a scroll the secret history of the Okumichi clan…of the gift of prophecy they share and the extraordinary destiny that awaits them. For six centuries, these remarkable writings lay hidden—until they are uncovered by an American woman, a missionary named Emily Gibson, who arrived in Edo harbor in 1861, in flight from a tragic past. Soon an extraordinary man would enter her life: Lord Genji of the Okumichi clan, a nobleman with a gift of prophecy who must defend his embattled family—and confront forbidden feelings for an outsider in his midst. Emily, too, soon finds herself at a turning point; courted by two westerners, she knows her heart belongs to the one man she cannot have. But Emily has found a mission of her own: translating Genji’s ancestral history, losing herself in an epic tale of heroism and forbidden love. For here is the story of Lady Shizuka, the beautiful witch-princess who has enchanted Okumichi men for generations…of Genji’s ancestors, Lord Hironobu and Lord Kiyori, and of the terrible betrayals that befell them…and of Genji’s parents: a wastrel father and his child bride whose tragic love has shaped Genji as a leader and as a man. As Emily sifts through the fragile scrolls, she begins to see threads of her own life woven into the ancient writings. And as past and present collide, a hidden history comes to life, and with it a secret prophecy that has been shrouded for centuries, and may now finally be revealed. Takashi Matsuoka’s spellbinding novel is infused with spectacle, intricately woven, magically told. Autumn Bridge is a feast for the senses, a work of truly dazzling storytelling.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.98",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Loose lace!",
        "Authors": "By Faulkner, Keith",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Going Broke: Why Americans Can't Hold On To Their Money",
        "Authors": "By Vyse, Stuart",
        "Description": "Over the last three decades, debt, bankruptcy, and home foreclosures have risen to epidemic levels. To make matters worse, the personal savings rate is at its lowest point since the Great Depression. Why, in the richest nation on earth, can't Americans hold on to our money?Winner of the prestigious William James Book Award for Believing in Magic and an authority on irrational behavior, Stuart Vyse offers a unique psychological perspective on the financial behavior of the many Americans today who find they cannot make ends meet, illuminating the causes of our wildly self-destructive spending habits. But unlike other authors, he doesn't entirely blame the victim. Bringing together fascinating studies of consumer behavior, he argues that the mountain of debt burying so many of us is the inevitable byproduct of America's turbo-charged economy and, in particular, of social and technological trends that undermine our self-control. Going Broke illuminates everything from the rise of the credit card, to the increase in state lotteries and casino gambling, to the expansion of new shopping opportunities provided by toll-free numbers, home shopping networks, big-box stores, and the Internet, revealing how vast changes in American society over the last 30 years have greatly complicated our relationship with money. Vyse concludes both with personal advice for the individual who wants to achieve greater financial stability and with pointed recommendations for economic and social change that will help promote the financial health of all Americans.Engagingly written, with startling insights into modern consumerism and with poignant human-interest stories of people facing financial failure, Going Broke offers a provocative new perspective on American economic behavior that is likely to stir controversy and serious debate.",
        "Category": " Psychology , Social Psychology",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Secret Missions",
        "Authors": "By Gannon, Michael",
        "Description": "German agent Peter Krug, an ardent Nazi, slips secretly into Florida to collect vital data on America's aircraft capabilities, but his mission is threatened by Father Anthony D'Angelo, a worldly and courageous priest. By the author of Operation Drumbeat. $25,000 ad/promo.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Fool's Gold",
        "Authors": "By Snyder, Zilpha Keatley",
        "Description": "Reluctant to admit that he suffers from claustrophobia and anxious not to alienate his friends, Rudy tries to find a way to distract them from pursuing their plan of exploring an abandoned gold mine",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Enemy of God (The Arthur Books #2)",
        "Authors": "By Cornwell, Bernard",
        "Description": "With The Winter King, the first volume of his magnificent Warlord Chronicles, Bernard Cornwell established himself as the storyteller who could reinvent the legend of King Arthur for our time.Now with Enemy of God, Cornwell's magical re-creation continues.  Having defeated the last holdouts of civil war in southern Britain, Arthur has secured Mordred's throne.  But he must still face raging conflicts between the old ways and the new, as well as foes more powerful and more dangerous--because they pose as friends. Brilliantly written and peopled with the familiar faces of legend along with new ones, Enemy of God is an immensely powerful continuation of a modern classic.",
        "Category": " Fiction , Historical , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Girl Who Heard Dragons",
        "Authors": "By McCaffrey, Anne",
        "Description": "An illustrated compilation of the previously uncollected fiction of the million-copy-selling fantasy author includes a brand-new novella about Pern, the author's very popular fantasy world. National ad/promo.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "10.77",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Collectible Dolls (Warman's Companion)",
        "Authors": "By Herlocher, Dawn",
        "Description": "This easy-to-carry guide showcases 100 of the world's most popular and historically significant dolls of all time, including models from the Alexander Doll Company, Barbie, American Girl, and Ideal, as well as German bisque, among others.Featuring brilliant color photos you can turn to for reliable and ready assistance with identification, this book also covers price adjustment factors, tips about obtaining and caring for dolls, manufacturer data, and club contact information.More than 15,000 people worldwide are card-carrying members of the United Federation of Doll Clubs, always seeking fresh ideas for identifying and preserving dollsToday's most popular collectible dolls hail from companies around the globe, including Alexander Doll Company, German Bisque dolls, Simon & Halbig, and Barbie & FriendsDoll collecting continues to carve out an impressive share of the collectibles market, with more than $650 million spent per year on the hobby?Grab-n-go-sized guide features an enviable collection of seven to 30-inch dolls produced between the early 1800s through the presentDelightful, delicate and dynamic dolls have appealed to the young and young at heart for generations.",
        "Category": " Antiques & Collectibles , Dolls",
        "Publisher": "Krause Publ",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Roget's 21st Century Thesaurus (21st Century Reference)",
        "Authors": "By Kipfer, Barbara Ann, Roget, Peter Mark, and Princeton Language Institute (COR)",
        "Description": "An innovative thesaurus, the most up-to-date available in English, becomes available for the first time in trade paperback, offering more than one million word choices, hundreds of recently coined Americanisms, and a newly designed Concept Index. Reprint.",
        "Category": "",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.78",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Sources of Conflict in the 21st Century: Regional Futures and U.S. Strategy",
        "Authors": "By United States Air Force (COR), Project Air Force (U. S.) (COR), Khalilzad, Zalmay (EDT), and Lesser, Ian O. (EDT)",
        "Description": "As the millenium approaches, defense analysts begin to wonder how many of today's leading adversaries will remain adversaries. Will longstanding allies change their orientation? Who will be called on to intervene, and where? Can we expect stability, or chaos?This book examines current political trends and potential sources of conflict in three critical regions - Asia, the Greater Middle East, and Europe and the former Soviet Union - through the year 2025. The authors describe possible alternative strategic \"worlds,\" including a projection of today's mixed political climate, a more benign world in which the great powers are at peace and are actively cooperative, and a world beset with economic, demographic, and political turmoil. Additional chapters provide a detailed discussion of regional trends and their meaning for strategy and planning. Through thoughtful analysis of current trends and the careful projection of the political-military climate of the future, defense planners will be better equipped to take on the challenges of the 21st century.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Rand Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Bridegroom: Stories",
        "Authors": "By Jin, Ha",
        "Description": "From the remarkable Ha Jin, winner of the National Book Award for his celebrated novel Waiting, a collection of comical and deeply moving tales of contemporary China that are as warm and human as they are surprising, disturbing, and delightful.In the title story, the head of security at a factory is shocked, first when the hansomest worker on the floor proposes marriage to his homely adopted daughter, and again when his new son-in-law is arrested for the \"crime\" of homosexuality. In \"After Cowboy Chicken Came to Town,\" the workers at an American-style fast food franchise receive a hilarious crash course in marketing, deep frying, and that frustrating capitalist dictum, \"the customer is always right.\"Ha Jin has triumphed again with his unforgettable storytelling in The Bridegroom.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Messenger",
        "Authors": "By Lowry, Lois",
        "Description": "Messenger is the masterful third novel in the Giver Quartet, which began with the dystopian bestseller The Giver, now a major motion picture. Matty has lived in Village and flourished under the guidance of Seer, a blind man known for his special sight. Village once welcomed newcomers, but something sinister has seeped into Village and the people have voted to close it to outsiders. Matty has been invaluable as a messenger. Now he must risk everything to make one last journey through the treacherous forest with his only weapon, a power he unexpectedly discovers within himself.From the Trade Paperback edition.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Facilitation at a Glance",
        "Authors": "By Bens, Ingrid M. and Goldman, Michael (EDT)",
        "Description": "",
        "Category": " Business & Economics , Facility Management",
        "Publisher": "Participative Dynamics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Why We Really Love Dogs",
        "Authors": "By Levin, Kim",
        "Description": "The magic of photographer Kim Levin's photos and touching prose combine to create another poignant essay about the unique and endearing qualities of dogs. This poetic duet of picture and word celebrates the many facets of dogs-the silly things they do, the sweet way they look, the funny moves they make-which all combine to make them so darn lovable. Why We Really Love Dogs celebrates the myriad reasons people love their dogs. Because . . . *they compete for cuteness *they sit for cookies *they just plain look funny In America alone, 40 million people own more than 50 million dogs. Of those dedicated dog owners, about 13 million Americans say they're as attached to their dogs as they are to their best friends. Everyone who has ever treasured a favorite dog will appreciate this collection of heartwarming words and images to pay homage to the special human/pet bond.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "How to Design and Build Children's Play Equipment/05934",
        "Authors": "By Hildebrand, Ron, Bergquist, Craig, and Beckwith, Jay",
        "Description": "Provides diagrams and instructions for building playhouses, horizontal ladders, climbing bars, clubhouses, sandboxes, slides, and swings",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "The Smartest Investment Book You'll Ever Read: The Simple, Stress-Free Way to Reach Your Investment Goals",
        "Authors": "By Solin, Daniel R.",
        "Description": "Achieve financial security in 90 minutes or less.  Daniel Solin cuts through financial propaganda to show readers exactly how assets should be invested, using trusted, brand name fund managers like Fidelity and Vanguard. Solin's easy-to-follow plan allows investors to create and monitor their portfolios in 90 minutes or less a year, explaining how to assess risk and how to allocate assets to maximize returns and minimize volatility. Readers will also learn how to avoid the biggest mistakes investors make, from buying into media hype to giving their hard earned cash to hyperactive brokers and investment advisors.",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The War on the Bill of Rights and the Gathering Resistance",
        "Authors": "By Hentoff, Nat",
        "Description": "\"The Constitution,\" said Supreme Court Justice Antonin Scalia ominously in March, 2003, \"just sets minimums. Most of the rights that you enjoy go way beyond what the Constitution requires.\" In The War on the Bill of Rights—and the Gathering Resistance, nationally syndicated columnist and Village Voice mainstay Nat Hentoff draws on untapped sources—from reporters, resisters, and civil liberties law professors across the country to administration insiders—to piece together the true dimensions of the current assault on the Constitution and the Bill of Rights. The first draft of the USA PATRIOT Act to go to Congress included the suspension of habeas corpus. The proposed sequel (PATRIOT Act II) would make it possible to revoke U.S. citizenship, and, for the first time in history, authorize secret arrests. Both Patriot Acts increase electronic surveillance of Americans, with minimal judicial supervision. Hentoff refocuses attention on domestic surveillance initiatives established by unilateral executive actions, such as Operation TIPS and the Total Information Awareness System, both still quietly functioning. Hentoff chronicles the inevitable rise of citizen's groups against these gross infringements, comparing today's Bill of Rights Defense Committees to Samuel Adams's Sons of Liberty, whose campaign against the British helped to precipitate the American Revolution. Afforded little coverage in the major media, the Bill of Rights Defense Committees now have spread to nearly one hundred cities and towns nationwide. Hentoff quotes Lance Morrow, who wrote, \"If Americans win a war (not just against Saddam Hussein but the longer-term struggle) and lose the Constitution, they will have lost everything.\"Nat Hentoff, a prolific author and journalist and weekly columnist in the Village Voice, has won the National Press Foundation Award for Distinguished Contributions to Journalism, and the American Bar Association Certificate of Merit for Coverage of the Criminal Justice System, as well as the Thomas Szasz Award for Outstanding Contribution to the Cause of Civil Liberties.",
        "Category": " History , United States , 20th Century",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    }
]