[
    {
        "Title": "Oktoberfest",
        "Authors": "By Frank De Felitta",
        "Description": "",
        "Category": "",
        "Publisher": "Warner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The Squandering of America: How the Failure of Our Politics Undermines Our Prosperity",
        "Authors": "By Kuttner, Robert",
        "Description": "The incomes of most Americans today are static or declining. Tens of millions of workers are newly vulnerable to layoffs and outsourcing. Health care and retirement burdens are increasingly being shifted from employers to individuals. Two-income families find they are working longer hours for lower wages, with decreased social support. As wealth has become more concentrated, the economy has become more recklessly speculative, jeopardizing not only the prospects of ordinary Americans, but the solvency of the entire system. What links these trends, writes Robert Kuttner in this provocative, engaging, and necessary book, is the consolidation of political and economic power by a narrow elite, who blocks the ability of government to restore broad prosperity to the majority of citizens.Kuttner—one of our most lucid economic critics—explores the roots of these problems and outlines a persuasive, bold alternative. In BusinessWeek, The Boston Globe, and The American Prospect, he has established himself as a prophetic voice connecting economics and politics. Here he demonstrates how our economy has fallen hostage to a casino of financial speculation, creating instability as well as inequality. He debunks alarmist claims about supposed economic hazards, such as Social Security and Medicare, and exposes the genuine dangers: hedge funds and private equity run amok, sub-prime lenders, Wall Street middlemen, and America’s dependence on foreign central banks. He describes how globalization of commerce has been used by business less to promote free trade than to escape the balanced regulation that delivered widespread abundance in the decades after World War II.While our financial security has weakened under President George W. Bush, Kuttner also faults many Democrats for failing to offer compelling alternatives. Now, with financial markets in crisis and public opinion supporting a more active role for government, he offers a new model of managed capitalism that can deliver security and opportunity, and rekindle democracy as a check on concentrated wealth.Here is a passionate, articulate naming of the problem and a call for reform. The Squandering of America sets out a path for reclaiming our democratic politics—and our prosperity.",
        "Category": " Political Science , Public Policy , Economic Policy",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "American Business - A Two Minute Warning",
        "Authors": "By Grayson, C. Jackson, Jr. and O'Dell, Carla",
        "Description": "In less than two decades -- about \"two minutes\" in world history time -- Japan will succeed the United States as the world's productivity leader, and in the twenty-first century this Pacific nation will become the world's economic leader. The United States will drop back to number two or three in the global economy, burdened with a large foreign debt, and faced with a relatively lower standard of living, following the path of decline of Great Britain and other former world leaders.  So predict C. Jackson Grayson, Jr., and Carla O'Dell, two of the world's leading authorities on productivity, unless American government, management, and labor can work together-and soon -- to revive American productivity growth and bolster the quality of American products and services. Showing how hundreds of companies including Xerox, Federal Express, Ford, IBM, and Motorola are successfully responding to the competitive challenge, the authors make a compelling case that American industry can benefit from the lessons of history, learn to adjust, and thus retain its world economic leadership.  Speaking directly to managers, Grayson and O'Dell offer a wealth of practical suggestions for American business in their specific ten-part \"Agenda for Adjustment.\" Based on their experience with successful firms, the Agenda spells out workable recommendations for improvement -- from operating systems and organization structure, to employment stability and compensation systems.  American Business: A Two-Minute Warning also addresses the role of government in industrial revitalization. Grayson and O'Dell contend that much of what is recommended for government action tackles the wrong problems. Not only will such proposed responses fail, they argue, but they will make the situation worse. They then make specific suggestions for what government should -- and should not -- do.  The stakes are enormous. Few single issues will have a greater impact than productivity and quality on the everyday lives, aspirations, and futures of Americans and their children. Grayson and O'Dell's message' grow or decline. A two-minute warning. And there are no timeouts left.",
        "Category": " Business & Economics , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "The Leading Edge: Ceo's Who Turned Their Companies Around : What They Did and How They Did It",
        "Authors": "By Potts, Mark",
        "Description": "Interviews with ten successful CEO's reveal the actions and strategies that made leading competitors out of companies that were struggling",
        "Category": " Business & Economics , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Edge City: Life on the New Frontier",
        "Authors": "By Garreau, Joel",
        "Description": "First there was downtown. Then there were suburbs. Then there were malls. Then Americans launched the most sweeping change in 100 years in how they live, work, and play. The Edge City.From the Trade Paperback edition.",
        "Category": " Social Science , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "The Companion Guide to Jugoslavia [Yugoslavia]",
        "Authors": "By Cuddon, J. A.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Buildings of the District of Columbia (Buildings of the United States)",
        "Authors": "By Scott, Pamela and Lee, Antoinette J.",
        "Description": "Series copy: America's architectural heritage is incredibly rich--from Alaska's log cabins and Iowa's silos, to Michigan's automobile plants and the District of Columbia's monuments. Now, in Buildings of the United States, a monumental project commissioned by the Society of Architecural Historians, we have the first state-by-state survey American architecture reflecting the geographic, climatic, and ethnic diversity of the country.  It records the works of national and international masters of American architecture, as well as works by unknown hands. From pre-Columbian ruins to modern skyscrapers, from churches, courthouses, and theatres, to factories, barns, and gas stations, the volumes balance coverage of urban, suburban, and rural architecture. The authors of the volumes are architectural historians with a distinct and thorough knowledge of the states about which they have written. Each volume is profusely illustrated with photographs and line drawings, many of which were commissioned for the work.    Destined to become a national treasure, Buildings of the United States is the authoritative reference on our architectural heritage and will become delight to the general reader and traveler as well as an indispensable source book for scholars and students of architectural history, preservation, and urban planning.      The public architecture of Washington D.C. is well-known throughout the world. The Capitol, the White House, and other major monuments are familiar to millions of people who have never visited the city. Less familiar are many notable public and private buildings located in the central city and scattered throughout Washington's residential neighborhoods, ranging from the eighteenth-century port city of Georgetown to the mid-twentieth-century urban renewal area known as the Southwest Quadrant.    Tracing the evolution of the district's architectrual character from the Revolutionary War to the present, Pamela Scott and Antoinette J. Lee survey major public and government buildings, monuments and memorials, residential buildings and neighborhoods, parks and recreational areas, and commercial and industrial centers. From the Vietnam Memorial, the Smithsonian Institution, and the United States Patent Office to Howard and Georgetown universities, nineteenth-century row houses, and elegant Beaux-Arts mansions, this volume captures the full array of Washington's architecural styles.    Containing over 360 magnificent photographs, drawings, and maps, Buildings of the District of Columbia is a compelling source of information for the general reader, and a splendid guidebook for the traveler.",
        "Category": " Architecture , History , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "The Best Plays of 1957-1958. The Burns Mantle Yearbook.",
        "Authors": "By Kronenberger, Louis, Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Dodd & Mead and Co.",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "Promise to Mary: A Story of Faith in Action",
        "Authors": "By Jellinek, Paul and Reese, Della (FRW)",
        "Description": "Here is the story of Faith in Action, the acclaimed nationwide grant program of the Robert Wood Johnson Foundation that brings together Americans of all faiths to provide volunteer care and support to those in their communities who are confined to their homes because of a chronic health condition or disability.But this book is far more than simply an account of the Faith in Action program. Through a series of revealing in-depth interviews conducted in three very different parts of the country, Promise to Mary provides a unique and often profoundly moving glimpse into the lives of some of our most isolated and forgotten neighbors—as well as the remarkable volunteers, from all faiths and from all walks of life, who have come to their aid.",
        "Category": " Religion , History",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "This War Really Matters: Inside the Fight for Defense Dollars",
        "Authors": "By Wilson, George C.",
        "Description": "Drawing on nearly 40 years of news writing focused on military issues, George C. Wilson takes the reader through a fascinating, but little understood, process: how the Pentagon and Congress spend $500,000 a minute on guns and soldiers. Interweaving personal stories and insights from the major players throughout a fast-paced narrative, Wilson provides an inside look at how the 105th Congress and the Pentagon battled for a 250 billion dollar defense budget.Wilson demystifies the \"realpolitik\" among the individual armed forces and highly partisan members of Congress, as well as civilian and military leaders, thus giving a sense of the trade-offs involved on all sides. Exclusive interviews with major players—including Secretary of Defense William S. Cohen, Rep. David R. Obey, and Chairman of the Joint Chiefs of Staff, General Hugh H. Shelton—relate their distinctive perspectives on how Congress allocates and the Pentagon spends defense dollars.Wilson takes a look ahead—with a critical eye—to the wars of the next century and asks tough questions: Are we ready for future wars or are we still preparing for the last war, the Cold War? Does the Pentagon need more money? Or can it really do its job with less?",
        "Category": " Political Science , Public Policy , Economic Policy",
        "Publisher": "CQ Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Statecraft: And How to Restore America's Standing in the World",
        "Authors": "By Ross, Dennis",
        "Description": "How did it come to pass that, not so long after 9/11 brought the free world to our side, U.S. foreign policy is in a shambles? In this thought-provoking book, the renowned peace negotiator Dennis Ross argues that the Bush administration’s problems stem from its inability to use the tools of statecraft—diplomatic, economic, and military—to advance our interests.Statecraft is as old as politics: Plato wrote about it, Machiavelli practiced it. After the demise of Communism, some predicted that statecraft would wither away. But Ross explains that in the globalized world—with its fluid borders, terrorist networks, and violent unrest—statecraft is necessary simply to keep the peace.In illuminating chapters, he outlines how statecraft helped shape a new world order after 1989. He shows how the failure of statecraft in Iraq and the Middle East has undercut the United States internationally, and makes clear that only statecraft can check the rise of China and the danger of a nuclear Iran. He draws on his expertise to reveal the art of successful negotiation. And he shows how the next president could resolve today’s problems and define a realistic, ambitious foreign policy.Statecraft is essential reading for anyone interested in foreign policy—or concerned about America’s place in the world.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Creating the Better Hour: Lessons from William Wilberforce",
        "Authors": "By Stetson, Chuck (EDT)",
        "Description": "",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Stroud & Hall Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "MLM Magic : How an Ordinary Person Can Build an Extraordinary Network ing Business from Scratch",
        "Authors": "By Andrecht, Venus C.",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Ransom Hill Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Spirit Catches You and You Fall down: A Hmong Child, Her American Doctors, and the Collision of Two Cultures",
        "Authors": "By Fadiman, Anne",
        "Description": "Winner of the National Book Critics Circle Award for NonfictionWhen three-month-old Lia Lee Arrived at the county  hospital emergency room in Merced, California, a chain of events was set in motion from which neither she nor her parents nor her doctors would ever recover. Lia's parents, Foua and Nao Kao, were part of a large Hmong community in Merced, refugees from the CIA-run \"Quiet War\" in Laos. The Hmong, traditionally a close-knit and fiercely people, have been less amenable to assimilation than most immigrants, adhering steadfastly to the rituals and beliefs of their ancestors. Lia's pediatricians, Neil Ernst and his wife, Peggy Philip, cleaved just as strongly to another tradition: that of Western medicine. When Lia Lee Entered the American medical system, diagnosed as an epileptic, her story became a tragic case history of cultural miscommunication.Parents and doctors both wanted the best for Lia, but their ideas about the causes of her illness and its treatment could hardly have been more different. The Hmong see illness aand healing as spiritual matters linked to virtually everything in the universe, while medical community marks a division between body and soul, and concerns itself almost exclusively with the former. Lia's doctors ascribed her seizures to the misfiring of her cerebral neurons; her parents called her illness, qaug dab peg--the spirit catches you and you fall down--and ascribed it to the wandering of her soul. The doctors prescribed anticonvulsants; her parents preferred animal sacrifices.",
        "Category": " Literary Criticism , Asian , General",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Listen Up, Teacher! You are Making a Difference!",
        "Authors": "By Garcia, Shirley, Cottrell, David",
        "Description": "",
        "Category": "",
        "Publisher": "Cornerstone Leadership",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Timelines: Day By Day And Trend By Trend From The Dawn Of The Atomic Age To The Gulf War",
        "Authors": "By Dickson, Paul",
        "Description": "Chronicles the major events in history and popular culture for the last fifty years",
        "Category": " History , General",
        "Publisher": "Addison-Wesley Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "The Oxford Book of London",
        "Authors": "By Bailey, Paul (EDT)",
        "Description": "All great cities inspire great literature, but no other city has so consistently stimulated the literary imagination as London. Over the centuries writers, poets, historians, artists, and simple observers have chronicled the life and growth of the capital from its humble beginnings to the teeming metropolis it is today. In his sparkling anthology Paul Bailey has captured the essence of London's allure for visitors and inhabitants--from the Middle Ages to the present day--with wit, humor, and pathos. Among the many contributors are those whose evocations of the city have forever fixed it in the popular mind: Charles Dickens's descriptions of fogbound London streets, the bustle and hustle of the Victorian city; Ben Jonson's satires on London low life from 1616; William Wordsworth rhapsodizing on the view from Westminster Bridge; George Bernard Shaw's archetypal Cockney, Eliza Doolittle. Less well known but equally vivid are descriptions of everyday life for the down and out and the aristocrat, of the museums, theaters, galleries and churches, the restaurants and pubs, the parks and institutions, the topography of London mapped out in unforgettable verse and prose. The great set pieces, Daniel Defoe's description of the Plague year, John Evelyn's and Samuel Pepys's daily records of the Great Fire, join eyewitness accounts of coronations and funerals, unequaled in their immediacy. The bemusement of foreign visitors, the joys and horrors of London buses and the London Underground, the sprawl of the suburbs and the excitement of the city, all add to the dazzling panorama. Beginning in 1180 or thereabouts, with a monk named William Fitzstephen enumerating the delights of the capital, and ending in the present day, The Oxford Book of London offers an unparalleled introduction and tribute to this fascinating city. Armchair travellers, anyone planning to visit London, and those interested in fine writing will gain a sense of the ways in which the city has grown and changed over eight centuries.",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Colorado Collage",
        "Authors": "By Junior League of Denver",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southwestern States",
        "Publisher": "Southwestern Publishing Group",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Language of Teaching: Thoughts on the Art of Teaching and the Meaning of Education (Language of Series)",
        "Authors": "By Blue Mountain Arts Collection (EDT)",
        "Description": "",
        "Category": " Literary Criticism , General",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "This Is About Incest",
        "Authors": "By Randall, Margaret",
        "Description": "",
        "Category": " Family & Relationships , Abuse , Child Abuse",
        "Publisher": "Firebrand Books",
        "Price Starting With ($)": "45.1",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Decision Support Systems: An Organizational Perspective (Addison-Wesley series on decision support)",
        "Authors": "By Keen, Peter G. W.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1978"
        }
    },
    {
        "Title": "A lady at bay",
        "Authors": "By Maass, Edgar",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "Multiple Intelligences in the Classroom, 2nd edition",
        "Authors": "By Armstrong, Thomas",
        "Description": "Discusses multiple intelligences theory and its proven applications to schools and classrooms.",
        "Category": " Education , Classroom Management",
        "Publisher": "Assn for Supervision & Curriculum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Reading and Learning to Read (5th Edition)",
        "Authors": "By Vacca, Jo Anne L., Vacca, Richard T., Gove, Mary K., McKeon, Christine A., Burkey, Linda C., and Lenhart, Lisa A.",
        "Description": "With its balanced approach to reading instruction, Reading and Learning to Read, 5/e, remains a comprehensive, active learning tool that encourages students to teach reading in ways that are both meaningful and reflective. Rather than emphasizing a traditional skills-based approach, this book focuses on teaching skills within a meaning-centered approach. This includes an emphasis on literature-based reading instruction, the integration of technology into the teaching of reading, and the integration of reading and writing instruction.    This book continues to promote a contemporary, balanced approach to teaching reading and writing with a renewed emphasis on integrating technology, accommodating the needs of diverse learners, and teaching the middle school young adolescent. Given the increasingly focused interest on literacy standards in the teaching of reading world-wide, this edition also highlights practical examples and references that exemplify the International Reading Associations Standards for Reading Professionals. User friendly marginal icons highlight each of these new features, making them easy to locate for classroom discussion. Additionally, this updated edition features a new section in each chapter that discusses pertinent issues regarding struggling with readers, a recurring concern of classroom teachers. Web sites are also included at the end of each chapter that direct the reader to online practical resources on a variety topics.     Designed for anyone interested in elementary reading methods, reading in the elementary school, and developmental reading.",
        "Category": " Education , Teaching Methods & Materials , Reading & Phonics",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Educational Psychology: Theory and Practice, Seventh Edition",
        "Authors": "By Slavin, Robert E.",
        "Description": "This popular book from renowned educational psychologist Robert Slavin translates theory into practices that teachers can use in their classrooms with a further inquiry into the concept of intentionality. An \"intentional teacher,\" according to Slavin, is one who constantly reflects on his or her practices and makes instructional decisions based on a clear conception of how these practices affect students. To help readers become \"intentional teachers,\" the author offers a set of questions to guide them and models best practices through classroom examples.     Educational Psychology prepares teachers as no other text does. It teaches them to think about how students develop and learn, to make decisions before and during instruction, and to consider what constitutes evidence that their students are learning and succeeding. This edition includes new sections on brain research, expanded coverage of Title I, programs for language minority students, and comprehensive school reform. It contains new critiques of assessment and accountability strategies, and a substantially updated treatment of programming for students with special needs. A new feature, \"Technology Cases,\" presents practical uses of technology related to the contents of the chapters. A self-check feature, appearing throughout the chapters, links chapter contents to INTASC standards, and self assessments at the end of each chapter are linked to the content and format of PRAXIS.   Designed for anyone interested in educational psychology or in the psychology of learning.",
        "Category": " Psychology , Movements , Humanistic",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "6.76",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Smart Couples Finish Rich: 9 Steps to Creating a Rich Future for You and Your Partner",
        "Authors": "By Bach, David",
        "Description": "From first-time newlyweds to people on their second or third marriage, couples face an overwhelming task when it comes to money management.  Nationally renowned financial advisor and bestselling author David Bach knows that it doesn’t have to be this way.  In Smart Couples Finish Rich, he provides couples with easy-to-use tools that cover everything from credit card management, to investment advice, to long-term care.  You and your partner will learn how to work together as a team to identify your core values and dreams, creating a financial plan that will allow you to achieve security, provide for your family’s future financial needs, and increase your income.  Together, you’ll learn why couples that plan their finances together, stay together!",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Crown Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "A Letter to Santa",
        "Authors": "By Gaby Goldstock",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Beyond Words: A Guide to Drawing Out Ideas",
        "Authors": "By Sonneman, Milly R.",
        "Description": "This colorful, offbeat business guide&#151;sort of THINKERTOYS meets SARK&#151;shows how to add zip, interaction, and excitement to just about any kind of meeting or presentation. The author has helped everyone from engineers to corporate planners create stunning visual presentations, showing them how to use visual symbols and color to map out ideas, plans, projections, and the like. Even if you can't draw a straight line, this book will have you doodling away like a pro in no time flat, and turning the most boring planning sessions into whiz-bang think tanks. Even the most pinstriped project teams have found these tools useful when mapping out strategic plans, capturing vision sessions, depicting project designs, or making training programs fun and memorable. Real-life success stories and step-by-step drawing hints make this the must-have book for managers, facilitators, trainers, and anyone who helps groups work together.",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "American Frugal Housewife: Dedicated to Those Who Are Not Ashamed of Economy (Cooking in America)",
        "Authors": "By Child, Lydia Maria Francis",
        "Description": "First published in 1828, Lydia Maria Child's The American Frugal Housewife was an extremely popular nineteenth-century manual for homemakers. Interesting recipes and remedies, advice on parenting and the myriad responsibilities of housekeeping are all put forth in straightforward, no-nonsense, Yankee prose. From 1832-1845, this popular book went through thirty-two editions.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Applewood Books",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Period Design and Furnishing",
        "Authors": "By Miller, Judith",
        "Description": "Excellent photos and commentary cover all aspects of creating a period style (Elizabethan, American Queen Anne, Shaker, Art Deco). Arrangement is chronological, with most space given to styles which have proved especially popular in recent times. For each style, detailed treatment is given to coverings for walls, floors, and windows; lighting, furniture and pictures; structural and architectural details. The last section treats Art Deco with a photo of a Geffre Museum display of cosmic ugliness. Includes a directory of suppliers. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Diana: The Portrait",
        "Authors": "By Coward, Rosalind, Mandela, Nelson (FRW), and McCorquodale, Sarah (INT)",
        "Description": "The tragic death of Diana, Princess of Wales, shook the world. No one who lived through those days in the late summer of 1997 will ever forget the unprecedented outpourings of grief, shock, and anger that followed. And in the days leading up to her funeral, it seemed as if the whole of humanity had spontaneously united to mourn her loss.But who was this young woman who had come to symbolize so much to so many? How was it that she could reach out to touch lives not only of whole communities but individuals, too? What lay behind her inspiration-and what will be the lasting impact of her legacy?No book yet written about Diana has come close to the person so many people speak of as having been a beacon of light in their lives. Here, for the first time, is the Diana that many of those closest to her knew.Written with the full cooperation of the late princess's estate, Diana: The Portrait tells Diana's story through her own words and the words of people, both famous, and, until now, unknown. Beautifully designed, it is a lavishly illustrated with nearly 500 images of Diana, including many pictures never previously published, taken from sources including the Spencer family archive, the Althorp Museum, the Diana, Princess of Wales Memorial Fund archive, and the private collections of the friends, charities, and individuals whose lives she touched.Drawing on over 200 original interviews, including those of family members and friends, many of whom have never spoken before, this remarkable book will stand as a unique and lasting testament to the life and work of one of the extraordinary and enduring icons of the 20th century.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "11.13",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Revival Slim and Beautiful Diet: How An Incredible Little Bean Can Help You:  Lose Weight, Increase Energy, Lower Cholesterol, and So Much More",
        "Authors": "By Tabor, Aaron and Tabor, Suzanne",
        "Description": "2",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Schwarzbein Principle, The Program: Losing Weight the Healthy Way",
        "Authors": "By Schwarzbein, Diana",
        "Description": "Lose Weight • Slow the Aging Process • Feel Great. . . and never count calories again!  If you are following a popular diet -- whether it is low-carb, low-fat, food combining or limited calories -- it is killing you. It is breaking down every component of your body, causing destruction of your healthy muscle tissue and aging everything from your brain cells to the skin on your face.  But there is an alternative. You can have the body you want without dangerous diets, unproven supplements and punishing workouts. Dr. Schwarzbein’s revolutionary program uses the body's metabolic system to help you postpone or reverse the degenerative effects of aging and lose weight for life by:      Balancing carbohydrates and fat - without eliminating food groups or counting calories     Managing stress and getting a great night's sleep             Tapering off and reversing cravings such as tobacco, alcohol, caffeine and sugar        Switching from strenuous cardio exercise to moderate resistance training and stretching    Balancing your hormones with the right kind of hormone replacement therapy             This is the book Dr. Schwarzbein's hundreds of thousands of fans have been waiting for -- a simple straightforward program that will finally break the cycle and give you longer life, permanent weight loss and increased energy . . . the healthy way.        \"In the sea of diet/lifestyle books, The Schwarzbein Principle is one of the most balanced, sensible and effective programs  . . . I applaud Dr. Schwarzbein's revolutionary yet realistic approach to food.\"- Christiane Northrup, M.D., author of The Wisdom of Menopause",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "HCI",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Catch the Fun, Catch the Laughter, Catch the Joy",
        "Authors": "By Laurette Connelly, Veda Boyd",
        "Description": "",
        "Category": "",
        "Publisher": "Masthof Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Transforming Children Into Spiritual Champions: Why Children Should Be Your Church's #1 Priority",
        "Authors": "By Barna, George",
        "Description": "No one can deny that our culture is opposed to Christian values, and the influences bombarding our children’s moral development can be deadly. But few parents and church leaders realize how critical it is to start developing a child’s biblical worldview from the very earliest years of life. The problem is complex: parents who themselves did not receive early spiritual training leave their children’s training to the church. Yet the church often focuses on older children—not realizing that a child’s moral development is set by the age of nine. The answer is for churches to recognize the need to come alongside parents to provide them biblical worldview training, parenting information, counseling, etc., that will equip them to help their children become the spiritually matuare Church of tomorrow. Profiles presented of churches who are effectively ministering to children and winning the war our enemy is waging against them\\. Research orientated books on childhood spiritual development.Raising Heaven Bound Kids in a Hell Bent World by Eastman Curtis / What Your Kids Need to Know About God and When byJohn Trent / Introducing the Spiritual Side of Parenting by Ron Clarkson /Bringing Up Boys by James Dobson.",
        "Category": " Religion , Christian Ministry , Pastoral Resources",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Non-Designer's Design Book: Design and Typographic Principles for the Visual Novice",
        "Authors": "By Williams, Robin",
        "Description": "Outlines the essentials of page layout, emphasizing the four concrete principles of design--proximity, alignment, repetition, and contrast--in an illustrated volume that features before and after examples of page design. Original. (All Users).",
        "Category": "",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Final Gifts: Understanding the Special Awareness, Needs, and Communications of the Dying",
        "Authors": "By Callanan, Maggie and Kelley, Patricia",
        "Description": "Five years after its first publication, with more than 150,000 copies in print, Final Gifts has become a classic. In this moving and compassionate book, hospice nurses Maggie Callanan and Patricia Kelley share their intimate experiences with patients at the end of life, drawn from more than twenty years experience tending the terminally ill. Through their stories we come to appreciate the near-miraculous ways in which the dying communicate their needs, reveal their feelings, and even choreograph their own final moments; we also discover the gifts—of wisdom, faith, and love—that the dying leave for the living to share.Filled with practical advice on responding to the requests of the dying and helping them prepare emotionally and spiritually for death, Final Gifts shows how we can help the dying person live fully to the very end.",
        "Category": " Social Science , Death & Dying",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Lonely Planet Hindi Urdu Phasebook (Language survival kit)",
        "Authors": "By Dewan, Parvez",
        "Description": "",
        "Category": " Travel , Reference",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "The cookbook of the United Nations",
        "Authors": "By Barbara Kraus",
        "Description": "",
        "Category": "",
        "Publisher": "Cookery Book Club",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Mountains Beyond Mountains",
        "Authors": "By Kidder, Tracy",
        "Description": "“[A] masterpiece . . . an astonishing book that will leave you questioning your own life and political views . . . Kidder opens a window into Farmer’s soul, letting the reader peek in and see what truly makes the good doctor tick.”—Nicholas Thomas, USA TodayIn medical school, Paul Farmer found his life’s calling: to cure infectious diseases and to bring the lifesaving tools of modern medicine to those who need them most. Tracy Kidder’s magnificent account shows how one person can make a difference in solving global health problems through a clear-eyed understanding of the interaction of politics, wealth, social systems, and disease. Profound and powerful, Mountains Beyond Mountains takes us from Harvard to Haiti, Peru, Cuba, and Russia as Farmer changes people’s minds through his dedication to the philosophy that “the only real nation is humanity.”Praise for Mountains Beyond Mountains“A true-to-life fairy tale, one that inspires you to believe in happy endings . . . Its stark sense of reality comes as much from the grit between the pages as from the pure gold those pages spin.”—Laura Claridge, Boston Sunday Globe“Stunning . . . Mountains Beyond Mountains will move you, restore your faith in the ability of one person to make a difference in these increasingly maddening, dispiriting times.”—John Wilkens, The San Diego Union-Tribune“Easily the most fascinating, most entertaining and, yes, most inspiring work of nonfiction I’ve read this year.”—Charles Matthews, San Jose Mercury News“It’ll fill you equally with wonder and hope.”—Cathy Burke, People“In this excellent work, Pulitzer Prize-winner Kidder immerses himself in and beautifully explores the rich drama that exists in the life of Dr. Paul Farmer. . . . Throughout, Kidder captures the almost saintly effect Farmer has on those whom he treats.”—Publisher’s Weekly (starred review)“[A] skilled and graceful exploration of the soul of an astonishing human being.”—Kirkus Reviews (starred review)",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "Random House Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "A Smurf in the air (Smurf mini storybooks)",
        "Authors": "By Peyo.",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Brandywine Heritage",
        "Authors": "By McClanathan, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Brandywine River Museum; distributed by New York Graphic Society, Greenwich Conn",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Fresh from the pantry: Recipes for every day",
        "Authors": "By Longaberger Company",
        "Description": "",
        "Category": "",
        "Publisher": "Longaberger Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Wide Sargasso Sea: A Novel",
        "Authors": "By Rhys, Jean",
        "Description": "Jean Rhys's reputation was made upon the publication of this passionate and heartbreaking novel, in which she brings into the light one of fiction's most mysterious characters: the madwoman in the attic from Charlotte Brontë's Jane Eyre. Set in the Caribbean, its heroine is Antoinette Cosway, a sensual and protected young woman who is sold into marriage to the prideful Rochester. In this best-selling novel, Rhys portrays a society so driven by hatred, so skewed in its sexual relations, that it can literally drive a woman out of her mind.",
        "Category": " Fiction , Classics",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "The Courage to Teach: Exploring the Inner Landscape of a Teacher's Life",
        "Authors": "By Palmer, Parker J.",
        "Description": "\"This book is for teachers who have good days and bad --and whose bad days bring the suffering that comes only fromsomething one loves. It is for teachers who refuse to hardentheir hearts, because they love learners, learning, and theteaching life.\"- Parker J. Palmer [from the Introduction]Teachers choose their vocation for reasons of the heart, because they care deeply about their students and abouttheir subject. But the demands of teaching cause too manyeducators to lose heart. Is it possible to take heart in teaching once more so that we can continue to do what good teachers always do -- give heart to our students?In The Courage to Teach, Parker Palmer takes teachers on an inner journey toward reconnecting with their vocation and their students -- and recovering their passion for one of the most difficult and important of human endeavors.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Virginia Fare",
        "Authors": "By Junior League of Richmond",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Junior League of Richmond",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Bananas, Beaches and Bases: Making Feminist Sense of International Politics [Updated Edition]",
        "Authors": "By Enloe, Cynthia",
        "Description": "\"I have no hesitation in describing Bananas, Beaches and Bases as the most significant book in contemporary feminist International Politics. Each time I re-visit it, I am taken aback by its profound implications for both feminism and International Politics. The deceptively provocative question at its core--'where are the women?'--irrevocably transforms our views about what the central and important landscape of global politics is. In my view, it is the essential text not only for feminist International Politics courses but for anyone interested in starting to understand just how International Politics really works.\"--Marysia Zalewski, author of Feminism After Postmodernism: Theorising Through Practice\"A new edition of Bananas, Beaches, and Bases is cause for cosmic good cheer. This trailblazing treatment of the gender politics of global market and military projects is a feminist classic. Always ahead of the curve, before globalization had achieved cache in academic circles Enloe was there, cajoling Western feminists out of our political parochialism. There is no more creative, insightful, engaging feminist guide to international politics. Cynthia Enloe is an international feminist treasure, and Bananas, Beaches, and Bases her signature work.\"--Judith Stacey, author of Brave New Families\"Bananas, Beaches, and Bases is both a 'Pandora's Box' and a roadmap: It unleashes questions and insights that many conventional students of International Politics are accustomed to ignoring or overlooking about the dynamic between gender and international political life, and it guides us to see how both are mutually constitutive. As the \"magna carta\" of Feminist International Relations, it has helped create a new generation of women and men in the world of international relations.\"--Katharine Moon, author of Sex Among Allies\"Cynthia Enloe writes with passion, conviction, intelligence and verve as she makes such good feminist sense of international politics that the world never looks quite the same again. Innovative and a great read, Bananas, Beaches and Bases continues to be an outstanding example of the difference gender makes in social analysis. This is a book which provokes discussion with students, colleagues, friends and family. It is a book which has set the standard form much that followed. A classic.\"--Diane Bell, author of Ngarrindjeri Wurrurwarrin: A World That Is, Was, and Will Be\"With this volume, Cynthia Enloe single-handedly carved out a major new field. Combining contemporary political insight and historical sensitivity, Bananas, Beaches and Bases revealed the gendered workings of high politics, without which the entire machinery of war, diplomacy and governance would have long since collapsed. A pioneering tour-de-force.\"--Philippa Levine, author of Victorian Feminism, 1850-1900",
        "Category": " Social Science , Gender Studies",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Natural Born Charmer",
        "Authors": "By Phillips, Susan Elizabeth",
        "Description": "Chicago Stars quarterback Dean Robillard is the luckiest man in the world: a bona-fide sports superstar and the pride of the NFL with a profitable side career as a buff billboard model for End Zone underwear. But life in the glory lane has started to pale, and Dean has set off on a cross-country trip to figure out what's gone wrong. When he hits a lonely stretch of Colorado highway, he spies something that will shake up his gilded life in ways he can't imagine. A young woman . . . dressed in a beaver suit. Blue Bailey is on a mission to murder her ex. Or at least inflict serious damage. As for the beaver suit she's wearing . . . Is it her fault that life keeps throwing her curveballs? Witness the expensive black sports car pulling up next to her on the highway and the Greek god stepping out of it.Blue's career as a portrait painter is the perfect job for someone who refuses to stay in one place for very long. She needs a ride, and America's most famous football player has an imposing set of wheels. Now, all she has to do is keep him entertained, off guard, and fully clothed before he figures out exactly how desperate she is. But Dean isn't the brainless jock she imagines, and Blue—despite her petite stature—is just about the toughest woman Dean has ever met. They're soon heading for his summer home where their already complicated lives and inconvenient attraction to each other will become entangled with a charismatic but aging rock star; a beautiful fifty-two-year-old woman trying to make peace with her rock and roll past; an eleven-year-old who desperately needs a family; and a bitter old woman who hates them all.As the summer progresses, the wandering portrait artist and the charming football star play a high-stakes game, fighting themselves and each other for a chance to have it all. Natural Born Charmer is for everyone who's ever thought about leaving their old life in the dust and never looking back. New York Times bestselling author Susan Elizabeth Phillips takes us home again . . . and shows us where love truly lives",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "The Pathfinder: How to Choose or Change Your Career for a Lifetime of Satisfaction and Success",
        "Authors": "By Lore, Nicholas",
        "Description": "DO YOU JUMP OUT OF BED EVERY MORNING AND RUSH TO A JOB YOU LOVE?  Or is the work you once enjoyed now just a way to pay the bills? Perhaps you're even doubting your career choice altogether. Let The Pathfinder guide you to a more engaging, fulfilling work life. Based on breakthrough techniques developed by Rockport Institute, an innovative and award-winning career-counseling network that has changed the lives of over 10,000 people, The Pathfinder offers invaluable advice and more than 100 self-tests and diagnostic tools that will help you choose an entirely new career -- or view a current job from a new, more positive perspective. You'll learn:  * How to design your new career direction step by step so that it fits your talents, personality, needs, goals, values, and is, at the same time, practical and attainable * How to deal successfully with the \"yeah but\" voices in your head that keep you going back to the same old ill-fitting job, day after day * How to land the perfect job in your new field, plus tips on writing a really exceptional résumé, personal marketing, and networking (even for those who hate to network)  Whether you're a seasoned professional in search of a career change or a beginner just entering the working world, you want to make the right choices from the beginning. No matter where you are in your journey, if you want work to be more of a dance than a drag, The Pathfinder will expertly coach you through the process of designing a career you will love.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Robbins Review of Pathology",
        "Authors": "By Klatt, Edward C.",
        "Description": "Introducing the new review book to ROBBINS PATHOLOGIC BASIS OF DISEASE, 6th Edition! Following the organization of its parent text, this superb resource features an abundance of questions based on chapter material. What's more, it provides an additional \"comprehensive\" exam of over 150 questions on random topics to mimic the coverage of the USMLE Step 1.",
        "Category": " Medical , Pathology",
        "Publisher": "Saunders",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "New 7 Day Program: Flatten Your Stomach for Women and Men",
        "Authors": "By Consumer Guide, Ann Dugan",
        "Description": "",
        "Category": "",
        "Publisher": "Publications Intl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The Merry Widow",
        "Authors": "By McKinney, Meagan",
        "Description": "The Merry Widow sweeps us back to the year 1855 - from the Arctic's shimmering frozen wasteland to the glittering ballrooms of New York's elite - and into the life of a daring woman who journeys through both to claim the elusive man she loves...When her father dies, Rachel Howland finds herself alone on Canada's remote Herschel Island, desperately longing for civilization. Running his ramshackle saloon in the frigid North is far from the life Rachel envisions for herself - especially when she loses her heart to explorer Noel Magnus. But Magnus's sweet kisses are accompanied by promises of marriage that Rachel fears he will never fulfill.A wealthy New York publisher, Magnus gave up an elegant bachelor's existence to lead an Arctic expedition in search of the doomed Franklin party - and the famed black opal Franklin reportedly found. Lovely Rachel is the reason he docks at Herschel Island whenever he can. But the tundra is a far more demanding mistress than any woman, and when he doesn't return home, New York society believes it has taken his life. Magnus is willing to let the world mourn his \"death\" if it means conquering the Arctic - and retrieving the opal.Only Rachel knows where the gem is hidden. Convinced that her dream of a life with Magnus can never be realized, Rachel decides to pursue what her errant lover has rejected - his New York home and her own happiness. But the modest cottage Rachel imagined is an opulent mansion, and the quiet existence she dreams of as his \"widow\" is immediately complicated by new demands. Rachel never dreams that Magnus - who is furious that he must choose between the lure of adventure and the \"wife\" who has stolen his heart - will one day follow her.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "On Becoming Baby Wise",
        "Authors": "By Ezzo, Gary",
        "Description": "Every parent who has welcomed a new child into the world understands the desire and struggle: to have a happy and contented baby who sleeps continually through the night, and a mother who is not in a perpetual state of exhaustion. The answer lies in an exciting infant management plan that successfully encourages the rythms of a child to synchronize with that child's needs, and those of the rest of the family. Now, from pediatrician Robert Bucknam and parent educator Gary Ezzo comes the positive prescription for sleepless nights and fussy babies: Babywise",
        "Category": " Religion , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Baby Sleep Book (Sears Parenting Library)",
        "Authors": "By Sears, Martha, Sears, William (EDT), Sears, Robert, Sears, James, and McKenna, James A., Ph.D. (FRW)",
        "Description": "Everything you need to know about getting your baby or toddler to sleep -- from America's foremost baby and childcare experts.Babies don't automatically know how to sleep through the night; they need to be taught. The Sears family has learned from decades of pediatric practice, bolstered by their own parenting experiences, that different babies have different nighttime temperaments -- and, of course, different families have different lifestyles. Instead of espousing the kind of \"one method fits all\" approach advocated in other baby sleep guides, the Sears family explains how you can create a sleep plan that suits the needs of your entire family.With a sharp focus on the practical tools and techniques, The Baby Sleep Book covers such topics as:the facts of infant sleep vs. adult sleepfiguring out where, when, and how your child sleeps bestfail-safe methods for soothing a crying infanthow to make night nursing easier, and how to stopnighttime fathering tipswhether co-sleeping makes sense for younap-time strategies that workmedical and physical causes of night wakingsleep habits in special situations such as traveling, teething, and illness",
        "Category": " Family & Relationships , Life Stages , Infants & Toddlers",
        "Publisher": "Little, Brown Spark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Helping Your Kids Cope with Divorce the Sandcastles Way",
        "Authors": "By Romanowski, Patricia and Neuman, M. Gary",
        "Description": "Divorce is painful and confusing. Perhaps now more than ever, you want to give your child all the love, support, and guidance he or she needs, but everything seems harder and more complicated. Helping Your Kids Cope with Divorce the Sandcastles Way can help. Based on Gary Neuman's phenomenally successful Sandcastles program, which has helped more than fifty thousand children cope with divorce, this warm, empathetic guide shows you:  How to build a co-parenting relationship--even when you think you can't   When you or your child should see a therapist    Age-appropriate scripts for addressing sensitive issues   What to do when a parent moves away   How to stop fighting with your ex-spouse   How to navigate the emotional turmoil of custody and visitation   How to help your child deal with change   How to cope with kids' common fears about separation   How to introduce significant others into the family and help your child cope with a new stepfamilyMore than a hundred pieces of artwork from children of divorce will help you appreciate how kids perceive the experience. Dozens of special activities and fun exercises will help you communicate and get closer to your child. This guide shows you that divorce need not be an inevitable blot on children's lives, but an opportunity for them to grow and strengthen the bonds with their parents.",
        "Category": " Family & Relationships , Divorce & Separation",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Safire's New Political Dictionary",
        "Authors": "By Safire, William",
        "Description": "Featuring more than one thousand new, rewritten, and updated entries, this timely reference on American politics explains current terms in politics, economics, and diplomacy and includes a new introduction and index. 25,000 first printing. $30,000 ad/promo.",
        "Category": "",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The last temptation",
        "Authors": "By Viertel, Joseph",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Hostage (Navy Justice, Book 2)",
        "Authors": "By Brown, Don",
        "Description": "Zack Brewer faces a choice. It can prevent the next war. But it will cost the life of the person he loves the most. JAG Officer Zack Brewer’s prosecution of three terrorists posing as Navy chaplains was called the “court martial of the century” by the press. Now, with the limelight behind him, all Zack wants to do is forget. But the radical Islamic organization behind the chaplains has a long memory—and a thirst for revenge. Now the Navy has a need for Zack that eclipses all else. When an unthinkable act of aggression brings Israel and its Arab neighbors to the brink of war, Zack and co-counsel Diane Colcernian are called to the case of a lifetime. As leading nations focus their gaze upon these two, other eyes are watching as well. Zack and Diane are in harm’s way. A kidnapping, an ultimatum…and suddenly, Zack faces an impossible choice. If he loses this case, the world could explode into war. If he wins, his partner—the woman he loves—will die. And Zack himself may not survive to make the decision.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Gentlemen and Players: A Novel (P.S.)",
        "Authors": "By Harris, Joanne",
        "Description": "For generations, privileged young men have attended St. Oswald's Grammar School for Boys, groomed for success by the likes of Roy Straitley, the eccentric Classics teacher who has been a fixture there for more than thirty years. This year, however, the wind of unwelcome change is blowing, and Straitley is finally, reluctantly, contemplating retirement. As the new term gets under way, a number of incidents befall students and faculty alike, beginning as small annoyances but soon escalating in both number and consequence. St. Oswald's is unraveling, and only Straitley stands in the way of its ruin. But he faces a formidable opponent with a bitter grudge and a master strategy that has been meticulously planned to the final, deadly move.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The City Destroyer (Spider Series, No. 3)",
        "Authors": "By Stockbridge, Grant",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1975"
        }
    },
    {
        "Title": "Theories of criticism: Essays in literature and art (Occasional papers of the Council of Scholars)",
        "Authors": "By M. H. Abrams, James Ackerman",
        "Description": "",
        "Category": "",
        "Publisher": "Library of Congress",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Time Trap: The Classic Book on Time Management",
        "Authors": "By MacKenzie, Alec and Mackenzie, R. Alec",
        "Description": "Focusing on twenty major obstacles to effective time management, a guide to using time well offers practical solutions to the problem",
        "Category": " Business & Economics , Management",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "National Geographic Guide to Wildlife Watching",
        "Authors": "By National Geographic Society (U. S.) and Martin, Glen",
        "Description": "Describes wildlife refuges across the country, lists the animals living in them, and includes visitor information",
        "Category": " Nature , Animals , Wildlife",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Faith of the Fallen (Sword of Truth, Book 6) (Sword of Truth, 6)",
        "Authors": "By Goodkind, Terry",
        "Description": "Terry Goodkind author of the enormously popular Sword of Truth novels, has forged perhaps his best novel yet in Faith of the Fallen, pitting Richard Rahl and Kahlan Amnell against threats to the freedom of the world that will take them to opposite ends of the world to defeat the forces of chaos and anarchy.Emperor Jagang is rising once again in the Old World and Richard must face him, on his own turf. Richard heads into the Old World with Cara, the Mord-Sith, while his beloved Kahlan remains behind. Unwilling to heed an ancient prophecy, Kahlan raises an army and goes into battle against forces threatening armed insurrection in the Midlands.Separated and fighting for their lives, Richard and Kahlan will be tested to the utmost.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Fine Points Of Furniture: Early American",
        "Authors": "By Sack, Albert",
        "Description": "",
        "Category": " Antiques & Collectibles , Furniture",
        "Publisher": "Crown Publishers Inc.",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "Corona (Star Trek # 15)",
        "Authors": "By Greg Bear",
        "Description": "A beautiful actress seeking a divorce is suddenly the star suspect when her husband is found brutally slain",
        "Category": "",
        "Publisher": "POCKET",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Other People's Skeletons",
        "Authors": "By Smith, Julie",
        "Description": "When her law partner and best friend, Chris Nicholson, refuses to reveal the alibi that would clear her of suspicion in a murder case, Rebecca Schwartz investigates and discovers that Chris has been hiding a secret life. Original.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Christmas Story with Ruth J. Morehead's Holly Babes (Pictureback(R))",
        "Authors": "By Morehead, Ruth J.",
        "Description": "A simple retelling of the Christmas story according to the Gospels of St. Matthew and St. Luke, set up as a Christmas pageant with Ruth J. Morehead's Holly Babes acting the parts",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "In One Act (Exxon Lecture Series)",
        "Authors": "By Kennedy, Adrienne",
        "Description": "Gathers five one-act plays about Black women in society and two adaptations of classical Greek dramas",
        "Category": " Drama , American , General",
        "Publisher": "Univ Of Minnesota Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Finer Points of Sausage Dogs",
        "Authors": "By McCall Smith, Alexander and McIntosh, Iain (ILT)",
        "Description": "Professor Dr. von Igelfeld Entertainment – Book 2The Professor Dr. von Igelfeld Entertainment series slyly skewers academia, chronicling the comic misadventures of the endearingly awkward Professor Dr. Moritz-Maria von Igelfeld, and his long-suffering colleagues at the Institute of Romantic Philology in Germany.Readers who fell in love with Precious Ramotswe, proprietor of The No. 1 Ladies’   Detective Agency, now have new cause for celebration in the protagonist of these   three light-footed comic novels by Alexander McCall Smith. Welcome to the insane   and rarified world of Professor Dr. Moritz-Maria von Igelfeld of the Institute of   Romance Philology.  Von Igelfeld is engaged in a never-ending quest to win the respect   he feels certain he is due–a  quest which has the tendency to go hilariously astray.     In The Finer Points of Sausage Dogs, Professor Dr. Von Igelfeld is mistaken for   a veterinarian and not wanting to call attention to the faux pas, begins practicing   veterinary medicine without a license.  He ends up operating on a friend’s dachshund   to dramatic and unfortunate effect.  He also transports relics for a schismatically   challenged Coptic prelate, and is pursued by marriage-minded widows on board a Mediterranean   cruise ship.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "The medical detectives",
        "Authors": "By Cooper, Paulette",
        "Description": "",
        "Category": "",
        "Publisher": "D. McKay Co",
        "Price Starting With ($)": "9.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Diabetic Meals in 30 Minutes--Or Less!",
        "Authors": "By Webb, Robyn",
        "Description": "Offers recipes for appetizers, soups, salads, entrees, and desserts that can be prepared quickly, and includes a nutritional analysis for each recipe",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "American Diabetes Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Cycling",
        "Authors": "By Armijo, Vic",
        "Description": "You're no idiot, of course.  You learned how to ride a bike when you were a kid, have watched the Tour de France, and even know to shift in to a lower gear when the terrain gets steep. But when it comes to enjoying all the advantages of real, grown-up cycling, you feel about as behind-the-times as your old Schwinn with the banana seat.  Don't let the air out of your tires just yet!  The complete Idiot's Guide to Cycling is the perfect companion to get you back in ths saddle again whether you want pointers on getting the most aerobic benefit from a spin around the neighborhood or are training for  something more ambitious, like a fund-raising bike-a-thon or all-out race.  In this Complete Idiot's Guide, you'll get:",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "Alpha",
        "Price Starting With ($)": "6.97",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Serious Cycling - 2nd Edition",
        "Authors": "By Burke, Ed",
        "Description": "\"Serious\" in this volume (first edition: 1995) means a cyclist seriously interested in racing, possibly even with Tour de France ambitions. 'Hard-core Training,\" \"The Nutritional Edge,\" \"Planning,\" and 'Racing\" the titles of the four sections, suggest the author's approach. However, non-racing bicycle enthusiasts will find much here that is interesting and useful in their own endeavors. Chapters on lactate threshold, avoiding injury, after ride recovery, overtraining, and the biomechanics of position and pedaling will help any rider who wants to prepare for the next riding season. The author (Phd) was a professor and director of the exercise science program at the University of Colorado at Colorado Springs. Annotation (c) Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Songs of the Gorilla Nation: My Journey Through Autism",
        "Authors": "By Prince-Hughes, Dawn",
        "Description": "Relates the author's experiences as a late-diagnosed autistic, describing her struggles with antisocial impulses and homelessness, her connection with the gorillas at Seattle's Woodland Park Zoo, her education in anthropology, and her eventual ability to develop human relationships. 75,000 first printing.",
        "Category": " Biography & Autobiography , Social Scientists & Psychologists",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Rudolph's Pediatrics",
        "Authors": "By Rudolph, Abraham M. (EDT)",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Appleton & Lange",
        "Price Starting With ($)": "14.1",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "There Is No Me Without You: One Woman's Odyssey to Rescue Africa's Children",
        "Authors": "By Greene, Melissa Faye",
        "Description": "There Is No Me Without You is the story of Haregewoin Tefarra, a middle-aged Ethiopian woman of modest means whose home has become a refuge for hundreds of children orphaned by AIDS. It is a story as much about the power of the bond between children and parents as about the epidemic that every year leaves millions of children, mostly healthy themselves, without family. Originally a middle-class woman with a happy family life, Haregewoin fell into a deep depression after the death of her recently married daughter. But then a priest brought her two children, AIDS orphans, with nowhere to go. Unexpectedly, the children thrived, and Haregewoin found herself drawn back into daily life. As word got out, an endless stream of children began to arrive at her door, delivered by dying parents and other relatives who begged for her help, and, pushing against the limits of her home and bank account, she took more and more in. Today, Haregewoin runs a school, a daycare system, and a shelter for sick mothers. Without medication for her charges—some HIV-positive, some uninfected, and some infants trying to fight off the virus, but almost all of whom come to her terrified and malnourished—she forges on, caring for as many as she can handle. Increasingly, she also places them for adoption with families like that of journalist Melissa Fay Greene, who has two children adopted from Ethiopia. In Haregewoin Tefarra’s story, Greene gives us an astonishing portrait of a woman fighting a continent-wide epidemic.",
        "Category": " Social Science , Children's Studies",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Photography",
        "Authors": "By Warren, Bruce",
        "Description": "An introductory photography text for majors or non-majors. This book covers topics common to photography books, with unique chapters on problem-solving and commercial photography. Gray card bound in book for student use.",
        "Category": " Photography , General",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "8.39",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "California Pizza Kitchen Cookbook",
        "Authors": "By Flax, Larry, Rosenfield, Rick, and Leatart, Brian (PHT)",
        "Description": "The California Pizza Kitchen Cookbook BBQ Chicken Pizza, Mixed Grill Vegetarian Pizza, Tandoori Chicken Pizza, Thai Chicken Pizza. These are just a few of the delicious pizzas, baked fresh in wood-burning ovens, that have helped to make California Pizza Kitchen into one of America's hottest and most successful restaurant chains. Founders Larry Flax and Rick Rosenfield \"put the world on a pizza\" and the results are fantastic. Now, for the first time, here are the recipes that have made CPK restaurants so popular, with step-by-step directions to make pizza cooking easy and fun, even for beginners. In addition to the pizzas and calzones, Rick and Larry include recipes for creative pastas, salads, soups and appetizers, not to mention the tempting dessert pizzas. Whether CPK is already your favorite place to dine with family and friends or you're a creative cook with a taste for bold, fun, international flavors, The California Pizza Kitchen Cookbook is the cookbook for you.",
        "Category": " Cooking , Regional & Ethnic , American , California Style",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "The Legend and the Apostle: The Battle for Paul in Story and Canon",
        "Authors": "By MacDonald, Dennis R.",
        "Description": "",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Westminster John Knox Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Understanding Girls with AD/HD",
        "Authors": "By Quinn, Patricia O., Nadeau, Kathleen G., and Littman, Ellen",
        "Description": "A ground-breaking book on the needs and issues of girls with attentional problems: why they are often undiagnosed, how they are different from boys, and what their special needs are in school, in their social world and at home. Age-related checklists from pre-school to high school help parents and professionals better identify and help girls with AD/HD.",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "Advantage Books",
        "Price Starting With ($)": "16.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "All About Attention Deficit Disorder: Symptoms, Diagnosis, and Treatment: Children and Adults",
        "Authors": "By Phelan, Thomas W.",
        "Description": "By the author of the bestselling parenting book 1-2-3 MagicFor the estimated 20 million Americans with Attention Deficit Hyperactivity Disorder comes the second edition of All About Attention Deficit Disorder by Dr. Thomas W. Phelan, an internationally renowned expert and lecturer on child discipline and ADD. All About Attention Deficit Disorder is a comprehensive guide to ADD's symptoms, diagnosis, and treatment in children and adults, including information such as:? The basic symptoms of ADD and their effects on school, work, home, and personal relationships? The differences ibetween ADD and ADHD? The differences in ADD between boys and girls? Counseling, school interventions, behavior management, and social skills trainingWritten in easy-to-understand language and with a positive, treatment-focused approach, All About Attention Deficit Disorder is a must-have resource for parents, teachers, physicians, and mental health professionals.",
        "Category": " Health & Fitness , Physical Impairments",
        "Publisher": "Sourcebooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Get the Sugar Out: 501 Simple Ways to Cut the Sugar Out of Any Diet",
        "Authors": "By Gittleman, Ann Louise",
        "Description": "This book makes it easy to get the sugar out, with 501 indispensable tips and 50 delicious recipes. Ann Louise Gittleman's low-sugar plan is easy to incorporate into your diet, yet filled with the flavor and variety you need to stick to it.Other features include truly irresistible desserts that will satisfy your sweet tooth, including chocolate cake, pineapple cheesecake, lemony almond macaroons, and more; an explanation of the glycemic index and a rating of 100 popular foods and staples; the pros and cons of artificial sweeteners; label-reading tips for exposing where it is hidden in ingredient lists; a week-long menu plan; and a resource section.Whether you're trying to lose weight, fight illness, improve your overall health, or simply look and feel better, Get the Sugar Out has all the tips, recipes, and menu plans you need to get started on - and stay on - a satisfying, high-energy, low-sugar regimen!",
        "Category": " Health & Fitness , Diets",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Body of Secrets: Anatomy of the Ultra-Secret National Security Agency",
        "Authors": "By Bamford, James",
        "Description": "The NSA is the largest, most secretive, and most powerful intelligence agency in the world. With a staff of thirty-eight thousand people, it dwarfs the CIA in budget, manpower, and influence. Recent headlines have linked it to economic espionage throughout Europe and to the ongoing hunt for the terrorist leader Osama bin Laden.James Bamford first penetrated the wall of silence surrounding the NSA in 1982, with the much-talked-about bestseller The Puzzle Palace. In Body of Secrets, he offers shocking new details about the inner workings of the agency, gathered through unique access to thousands of internal documents and interviews with current and former officials. Unveiling extremely sensitive information for the first time, Bamford exposes the role the NSA played in numerous Soviet bloc Cold War conflicts and discusses its undercover involvement in the Vietnam War. His investigation into the NSA's technological advances during the last fifteen years brings to light a network of global surveillance ranging from on-line listening posts to sophisticated intelligence-gathering satellites. In a hard-hitting conclusion, he warns that the NSA is a two-edged sword. While its worldwide eavesdropping activities offer the potential for tracking down terrorists and uncovering nuclear weapons deals, it also has the capability to listen in on global personal communications.",
        "Category": " Political Science , Intelligence & Espionage",
        "Publisher": "Anchor Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Quincunx",
        "Authors": "By Palliser, Charles",
        "Description": "An extraordinary modern novel in the Victorian tradition, Charles Palliser has created something extraordinary--a plot within a plot within a plot of family secrets, mysterious clues, low-born birth, high-reaching immorality, and, always, always the fog-enshrouded, enigmatic character of 19th century -- London itself.\"You read the first page and down you wonderfully fall, into a long, large, wide world of fiction.\"THE NEW YORK TIMES BOOK REVIEW",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Raise Your Child's Social IQ: Stepping Stones to People Skills for Kids",
        "Authors": "By Cohen, Cathi",
        "Description": "\"Parents, this book offers direct, sense-making, step-by-step exercises that parents can do with their children to increase their social skills and awareness. Based on the highly successful social skills training groups that have been directed by Cathi Cohen for many years, Raise Your Child's Social I.Q. provides parents with the structure to work on skills at home--how to join a group, how to choose friends, how to notice what people around you are feeling, how to handle angry feelings and much, much more.\"",
        "Category": " Social Science , Children's Studies",
        "Publisher": "Advantage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Owly",
        "Authors": "By Thaler, Mike and Wiesner, David (ILT)",
        "Description": "When Owly asks his mother question after question about the world, she finds just the right ways to help him find the answers.",
        "Category": "",
        "Publisher": "Harpercollins Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "Brighid's Quest (Partholon)",
        "Authors": "By Cast, P. C.",
        "Description": "When she discovers her true destiny at the hands of the Great Goddess Epona, centaur Brighid Dhianna, heeding the call of her Shaman blood, must make a choice that could not only impact her friendship with the humans of Clan MacCallan, but affect her own centaur herd--and the world. Original. 30,000 first printing.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Luna",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Romance at the Edge: In Other Worlds",
        "Authors": "By Davidson, MaryJanice, Knight, Angela, and Anthony, Camille",
        "Description": "",
        "Category": " Fiction , Romance , Erotica",
        "Publisher": "Loose Id, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Word Origins: An Exploration and History of Words and Language",
        "Authors": "By Funk, Wilfred John",
        "Description": "From a highly respected name in reference literature, an easy-to-access, dependable sourcebook on the origin and development of thousands of words, each word has been thoroughly checked by ranking linguists and the information is presented in a manner as entertaining as fiction,  An Outlet bestseller in previous editions.  432 pages.  6 X 9.",
        "Category": " Language Arts & Disciplines , Linguistics , Etymology",
        "Publisher": "Bell Publishing Company",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Panic Rules!: Everything You Need to Know about the Global Economy",
        "Authors": "By Hahnel, Robin",
        "Description": "ContentsForeword by Jeremy BrecherIntroductionChapter 1 The Bloom off the BoomChapter 2 Deconstructing the Neoliberal MythChapter 3 The Latest BustChapter 4 Understanding the CrisisChapter 5 How Asia Caught the FluChapter 6 The IMF to the RescueChapter 7 What Should We Want? What Should We Fear?Chapter 8 Mainstream Reform ProposalsChapter 9 Progressive Reform ProposalsConclusion Lilliputian Luddites Until Globalization Can Be Built from BelowAn Excerpt from Panic Rules! By Robin HahnelBoom and BustAmong economic systems, capitalism is the manic-depressive patient. Exuberance, unbridled optimism, and euphoria are followed by gloom, listlessness, and depression. But no matter how often the cycle is repeated the patient always believes the latest boom will last forever, only to feel foolish again when the bubble bursts. And no matter how often the patient reverts to manic behavior when taken off medication, the economic \"psychiatric\" establishment eventually succumbs to the patient's pleas to be taken off medication during the \"ups\"-freeing the exuberant economy from policy restraints-only to insist on placing the patient back on meds-re-application of necessary policy protections-when the unmedicated patient \"crashes.\"The Latest BoomThe truth is that neither part of capitalism's manic-depressive boom-and-bust cycle is \"healthy.\" Like most capitalist booms, the benefits of global liberalization during the 1980s and 1990s were not all they were made out to be. In fact, most people in the world were worse off economically at the end of the latest boom than they had been when it began-that is, even before the over-hyped boom metamorphosed into the global economic crisis of 1997-98. How is this possible, you ask? We were told \"the world economy grew at 3 percent a year in the 1980s and 2 percent in the first half of the 1990s,\" and that \"low- and middle-income economies grew more rapidly, averaging 3.4 percent growth in the 1980s and 5 percent in the 1990s.\" We were assured that \"growth in trade from increased trade liberalization that has gone hand-in-hand with increased private capital flows and financial integration,\"",
        "Category": " Business & Economics , International , General",
        "Publisher": "South End Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Leading Minds: An Anatomy Of Leadership",
        "Authors": "By Gardner, Howard and Laskin, Emma (COM)",
        "Description": "While much has been written on the subject, a crucial component of leadership has been largely ignored: the mind of the leader and the minds of his or her followers. Linking the study of creativity and leadership, Gardner demonstrates the strong tie between traditional creators (artists and scientists) and leaders in the realms of business, politics, and the military.Gardner claims that the key to leadership is the creation and embodiment of an effective story. He argues that unless they're working with specialists, leaders must deal with the \"unschooled mind.\" They must take into account the fundamental theories about the world that all of us acquire as children and that persist through life - even when those theories are later undermined by what we learn in school. In striking portraits of a wide range of leaders - from J. Robert Oppenheimer to Alfred P. Sloan, from Margaret Mead to Pope John XXIII to Mahatma GandhiGardner recreates the leaders' stories and depicts the struggles among rival stories that occur in the minds of an audience. He explains the overwhelming appeal of simplistic stories and enumerates the key moves needed to counter that appeal. He also describes the ways in which all leaders ultimately confront failure.In a powerful conclusion, Gardner identifies the six constant features of leadership, six trends that complexify leadership in our time, and the paradoxes that must be resolved for leadership to be effective.",
        "Category": " Psychology , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "The Nonrunner's Marathon Guide for Women: Get Off Your Butt and On with Your Training",
        "Authors": "By Dais, Dawn",
        "Description": "Anyone can run a marathon. Dawn Dais makes it a little more bearable--and a lot more fun Dawn Dais hated running. And it didn't like her much, either. Her fitness routine consisted of avoiding the stairs in her own house, because who really has the energy to climb stairs? It was with this exercise philosophy firmly in place that she set off to complete a marathon. The Nonrunner's Marathon Guide for Women is the ideal training manual for women who don't believe that running is their biological destiny but who dream of crossing the finish line nonetheless. Nonrunners offers a realistic training schedule and is chock-full of how-to's and funny observations, which she felt were lacking in the guides she had consulted. She also integrates entries from her journal, sharing everything would-be marathoners need to know about the gear, the blisters, the early morning workouts, the late-night carb binges, and most important of all, the amazing rewards. Running may not seem like a friendly endeavor, but with Dawn Dais, you can tame the beast and hit the marathon trail.",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "Seal Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "One Tuesday Morning/Beyond Tuesday Morning (September 11 Series 1-2)",
        "Authors": "By Karen Kingsbury",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan Publishing House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Behaving Badly",
        "Authors": "By Wolff, Isabel",
        "Description": "Saying all men are dogs is an insult to canines everywhere...For animal behaviorist Miranda Sweet, pets beat people — paws down — and she's convinced that animals are sweeter, softer and a lot more predictable than the men she's been dating lately. So when she opens up her own animal clinic, she decides to focus on the species she understands, and forget about trying to fathom the murky depths of the male psyche.While schizophrenic schnauzers and confused canaries are benefiting from her professional ministrations, her best friend Daisy is convinced that Miranda needs a little therapy, as well. Enter dishy photographer David. Even Miranda begins to think she may have been just a tad hasty in her analysis of men, and she finds herself reconsidering her position.But just as she lets her guard down, her own past reappears, and Miranda must come to terms with the fact that she hasn't always been as sweet as she'd like to believe.&#133;",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "A Field of Darkness (Madeline Dare, Book 1) (A Madeline Dare Novel, 1)",
        "Authors": "By Read, Cornelia",
        "Description": "Madeline Dare would be the first to tell you her money is so old there's none left. A former socialite from an aristocratic family in decline, Maddie is a tough-talking, would-be journalist exiled to the rust belt of upstate New York. Her prospects for changing her dreary lifestyle seem dim--until a set of dog tags found at a decades-old murder site is linked to her family. Shocked into action, Maddie embarks on a search that takes her from the derelict smokestacks of Syracuse to the posh mansions of Long Island's Gold Coast. But instead of the warm refuge of home, this prodigal daughter soon uncovers dark, sinister secrets that will violently challenge everything she believes in and holds dear.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Arena: A Novel of Spartacus and Crassus",
        "Authors": "By Maurice Ghnassia",
        "Description": "",
        "Category": "",
        "Publisher": "The Viking Press",
        "Price Starting With ($)": "36.61",
        "Publish Date": {
            "Month": "July",
            "Year": "1969"
        }
    },
    {
        "Title": "The Wonderful O (Fireside Books (Holiday House)",
        "Authors": "By James thurber",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "The Yellow Admiral",
        "Authors": "By O'Brian, Patrick",
        "Description": "Life ashore may once again be the undoing of Jack Aubrey in The Yellow Admiral, Patrick O'Brian's best-selling novel and eighteenth volume in the Aubrey/Maturin series. Aubrey, now a considerable though impoverished landowner, has dimmed his prospects at the Admiralty by his erratic voting as a Member of Parliament; he is feuding with his neighbor, a man with strong Navy connections who wants to enclose the common land between their estates; he is on even worse terms with his wife, Sophie, whose mother has ferreted out a most damaging trove of old personal letters. Even Jack's exploits at sea turn sour: in the storm waters off Brest he captures a French privateer laden with gold and ivory, but this at the expense of missing a signal and deserting his post. Worst of all, in the spring of 1814, peace breaks out, and this feeds into Jack's private fears for his career.Fortunately, Jack is not left to his own devices. Stephen Maturin returns from a mission in France with the news that the Chileans, to secure their independence, require a navy, and the service of English officers. Jack is savoring this apparent reprieve for his career, as well as Sophie's forgiveness, when he receives an urgent dispatch ordering him to Gibraltar: Napoleon has escaped from Elba.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Exploring Requirements: Quality Before Design",
        "Authors": "By Weinberg, Gerald M. and Gause, Donald C.",
        "Description": "",
        "Category": " Technology & Engineering , Industrial Design , Product",
        "Publisher": "Dorset House Publishing Company, Incorporated",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    }
]