[
    {
        "Title": "Developmental Exercises to Accompany A Writer's Reference",
        "Authors": "By Hacker, Diana",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Where Wonders Prevail",
        "Authors": "By Anderson, Joan Wester",
        "Description": "In Where Wonders Prevail, the author gathers dozens of true stories that tell of safe passage through the very heart of trouble and danger. The missionary priest in the Nicaraguan jungle whose life was saved by the prayer of friends in Michigan. The New York City cop who went about his dangerous work protected by heavenly bodyguards. Teenaged best friends Patty and Joni, whose closeness not even death could erase. Erin's last-second reprieve from disease. The lonely Seattle man whose life was transformed by a mysterious little messenger. Another young man who was literally wrapped in angel wings on a Georgia highway. And the author's own sign from heaven, growing on her front lawn.",
        "Category": " Religion , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Why Does the Cat Do That?",
        "Authors": "By Bonners, Susan",
        "Description": "Why do cats rub up against furniture? Why do they like to hide in bags? What makes them purr? These are just some of the questions answered in this fascinating and informative picture book on feline behavior. Through the inventive narrative, young readers examine the instincts of the common house cat. The text works on two levels: it describes a day in the life of a pet cat named Molly, and then explains the scientific basis for all of her actions. Some of the most ordinary cat antics, like pouncing on a toy or scratching against an object, are deeply rooted in the behavior of wild ancestors. Susan Bonners expertly explains why our beloved pets act the curious way they do.",
        "Category": " Juvenile Nonfiction , Animals , Cats",
        "Publisher": "Henry Holt and Co. (BYR)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Connecting Leadership to the Brain",
        "Authors": "By Dickmann, Michael H. and Stanford-Blair, Nancy",
        "Description": "This visionary guide advances a new leadership paradigm by translating breakthrough research about six dimensions of human intelligence into practical strategies that can be immediately applied to how leaders influence growth and achievement.",
        "Category": " Education , Leadership",
        "Publisher": "Corwin Press",
        "Price Starting With ($)": "6.13",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "The Story of San Michele",
        "Authors": "By Munthe, Axel",
        "Description": "Love, adventure, laughter and death are revealed in the lifetime travels and encounters of an international physician",
        "Category": "",
        "Publisher": "Carroll & Graf Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Soft Tissue Pain and Disability",
        "Authors": "By Rene Cailliet, M.D.",
        "Description": "",
        "Category": "",
        "Publisher": "F. A. Davis, Philadelphia, PA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Upon A Shore Level F (McGraw-Hill Reading)",
        "Authors": "By Elizabeth Sulzby",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Raising A Happy Child",
        "Authors": "By Magee, Trish",
        "Description": "Emphasizes the importance of listening to children, supporting them, staying involved in their lives, planning parenting techniques, and enjoying the parent-child relationship",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Living in a Foreign Language: A Memoir of Food, Wine, and Love in Italy",
        "Authors": "By Tucker, Michael",
        "Description": "The actor Michael Tucker and his wife, the actress Jill Eikenberry, having sent their last child off to college, were vacationing in Italy when they happened upon a small cottage nestled in the Umbrian countryside. The three-hundred-fifty-year-old rustico sat perched on a hill in the verdant Spoleto valley amid an olive grove and fruit trees of every kind. For the Tuckers, it was literally love at first sight, and the couple purchased the house without testing the water pressure or checking for signs of termites. Shedding the vestiges of their American life, Michael and Jill endeavored to learn the language, understand the nuances of Italian culture, and build a home in this new chapter of their lives. Both a celebration of a good marriage and a careful study of the nature of home,  Living in a Foreign Language  is a gorgeous, organic travelogue written with an epicurean’s delight in detail and a gourmand’s appreciation for all things fine.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Atlantic Monthly Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Been Thinking About: Coming Together Around the Ideas and Issues That Divide Us",
        "Authors": "By de Haan, Mart",
        "Description": "Each year millions read Been Thinking About, the monthly column written by Mart DeHaan, former president of Our Daily Bread Ministries and popular radio and television teacher. Now the best of these articles have been collected into one volume. Never hesitant to grapple with some of the toughest issues and topics of the day--even those that sometimes divide believers--Mart&#39;s honesty, vulnerability, transparency, and engaging style provide thought-provoking analysis and biblically grounded inspiration. For the many readers who know Mart&#39;s teaching, these will be a welcome resource. For those new readers, he will be a delightful discovery.",
        "Category": " Religion , Christian Life , Social Issues",
        "Publisher": "Discovery House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Van Gogh",
        "Authors": "By Gogh, Vincent Van",
        "Description": "",
        "Category": " Art , Individual Artists , General",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "A Letter to Peachtree and Nine Other Stories",
        "Authors": "By Kiely, Benedict",
        "Description": "Stories deal with school memories, horse handlers, an attacker of women, a dancing school, childhood friends, travelers, and a storyteller",
        "Category": " Fiction , General",
        "Publisher": "David R Godine Pub",
        "Price Starting With ($)": "6.64",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "The Mountain Beyond",
        "Authors": "By Miller, Terry",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Xulon Press",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Getting Your Romance Published",
        "Authors": "By Beard, Julie",
        "Description": "If you are an aspiring writer, The Complete Idiot's Guide To Getting Your Romance Published, written by a successful romance novelist, will teach you everything you need to know about this popular, highly successful genre. Including everything from plotting to characterization to approaching agents and editors, the book gives you a head start toward publishing your own novels.",
        "Category": " Language Arts & Disciplines , Publishing",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Ozma and the Wayward Wand",
        "Authors": "By Polly Berends",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The New Wellness Revolution: How to Make a Fortune in the Next Trillion Dollar Industry",
        "Authors": "By Pilzer, Paul Zane",
        "Description": "Read the Preface, Introduction, and Chapter 1 at thewellnessrevolution.paulzanepilzer.com.Five years ago, Paul Zane Pilzer outlined the future of an industry he called “wellness” and showed readers how they could get in on the profitable bottom floor. The New Wellness Revolution, Second Edition includes more guidance and business advice for entrepreneurs, product distributors, physicians, and other wellness professionals. It’s an industry that will only grow, so get in while you can.",
        "Category": " Business & Economics , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Kitchen Treasury Series: Salads",
        "Authors": "By Donald D. (Editorial Director) Wolf",
        "Description": "",
        "Category": "",
        "Publisher": "Lexicon Publications, Inc.",
        "Price Starting With ($)": "7.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Horticulture Gardeners Desk Reference",
        "Authors": "By Halpin, Anne",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Advertising Art in the Art Deco Style (Picture Archives)",
        "Authors": "By Menten, Theodore (EDT)",
        "Description": "Most comprehensive collection of its kind in paperback: 363 ads, posters, trademarks and other commercial graphics ? 22 in full color ? that pictorially chronicle the rise of Art Deco in Europe and America. Artists include Kinger, Teague, Carlu, Lepape, Darcy, Brill.",
        "Category": " Design , Graphic Arts , Commercial & Corporate",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "Mr. Food Grills It All in a Snap",
        "Authors": "By Ginsburg, Art",
        "Description": "Mr. Foods It All in a Snap Grilling is easy! Grilling is fun! And who doesn't go for those great cooked-outdoors tastes?! Did you know that you can cook an entire meal on your grill? Well, you can! From fun Munchies on the Grill, like Hot 'n' Spicy Nut Snacks and Cheesy Burger Bites, to main courses that go Beyond Basic Burgers and Charbroiled Chicken Champions, go From Garden to Grill. Also included are recipes for making Mouth-Watering Meats, Sizzling Seafood, and Hot Diggity Dogs and Sausage, Too. So, why not start your day with Striped Maple Sausage and end it with Chocolate-Stuffed Bananas, Waffle Sundaes, or other Sweet Endings, all made right on your grill?! And that's not all! There are tips on selecting grills, lighting a barbecue, and grilling safety. So, the next time you're looking for a fun, quick meal or a new idea for your picnic or tailgate party, let your grill come to the rescue. In a \"snap\" you'll be hearing cheers of \"OOH it's so GOOD!! \" Art Ginsburg has been appearing as Mr. Food for more than fifteen years, and his show is now the largest food news insert segment in the nation, seen in more than three hundred cities. A native of Troy, New York, he now resides in South Florida, where he produces his syndicated television",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "How to Draw and Sell Cartoons: All the Professional Techniques of Strip Cartoon, Caricature and Artwork Demonstrated",
        "Authors": "By Thompson, Ross and Hewison, Bill",
        "Description": "Discusses the basic materials and techniques of cartooning, offers advice on developing a cartooning style, and surveys the various types of cartoons",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "Hope in a Jar",
        "Authors": "By Harbison, Beth",
        "Description": "Twenty years ago, Allie Denty was the pretty one and her best friend Olivia Pelham was the smart one. Throughout high school, they were inseparable…until a vicious rumor about Olivia— a rumor too close to the truth—ended their friendship. Now, on the eve of their twentieth high school reunion, Allie, a temp worker, finds herself suddenly single, a little chubby, and feeling old. Olivia, a cool and successful magazine beauty editor in New York, realizes she’s lonely, and is finally ready to face her demons. Sometimes hope lives in the future; sometimes it comes from the past; and sometimes, when every stupid thing goes wrong, it comes from a prettily packaged jar filled with scented cream and promises. Beth Harbison has done it again. A hilarious and touching novel about friendship, Love’s Baby Soft perfume, Watermelon Lip Smackers, bad run-ins with Sun-In, and the healing power of “Gee Your Hair Smells Terrific.” Hope in a Jar: we all need it.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2012"
        }
    },
    {
        "Title": "Live Strong: Inspirational Stories from Cancer Survivors-from Diagnosis to Treatment and Beyond",
        "Authors": "By Lance Armstrong Foundation",
        "Description": "Since the now ubiquitous LIVESTRONG™ wristbands became available in May 2004, the Lance Armstrong Foundation has raised more than $50 million for cancer survivorship programs, and the signature phrase has become a battle cry for those who fight the disease every day.Now, the Lance Armstrong Foundation has compiled, from hours of videotaped interviews, poignant and dramatic personal accounts from cancer survivors. Covering a wide range of subjects, from grief to spousal relationships, employment discrimination to coping with medical bills, infertility to fear of recurrence, survivors share their experiences and speak candidly about how cancer has impacted their lives. For twenty-four-year-old Amy it’s how her illness changed her relationship with her parents. Mike, a male survivor of breast cancer, talks about gender stereotypes and genetic testing. And Eric, the father of a five-year-old survivor of a brain tumor, recalls how friends and strangers helped his family with financial issues and how the experience brought him and his wife closer together.While heartbreaking at times, these powerfully honest stories are ultimately uplifting and extremely reassuring to patients and their families. They offer the wisdom and hope that only survivors can give. LiveStrong is a remarkable testament to the resilience of the human spirit.From the introduction by Lance Armstrong:My work with the LAF shows me daily that sharing our stories and learning from one another’s experiences helps us cancer survivors continue to survive.  Some people think the cancer experience is only about the diagnosis and treatment of cancer, as if after the disease goes into remission, it no longer exists.  But survivorship goes beyond remission.  Survivorship is an evolution.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "A Doctor's Guide to the Best Medical Care: A Practical No-Nonsense Evaluation of Your Treatment Options for over 100 Conditions and Diseases",
        "Authors": "By Oppenheim, Michael",
        "Description": "You like your doctor, but are you sure you're getting the best possible treatment? Ever wonder what other doctors would think of your medical care? Do you know what your chances are for a real cure? This book serves as a reality check. It will help you determine what your personal physician should be doing to diagnose your problem and alleviate your symptoms. It will also help you save money on treatments and protect you from unnecessary medical procedures. Special features include how to find a good doctor, getting the most from your medical check-up, what your doctor probably won't tell you, how to prevent heart disease, and saying goodbye to children's ear infections.",
        "Category": " Health & Fitness , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Classroom Instruction That Works with English Language Learners",
        "Authors": "By Hill, Jane D. and Flynn, Kathleen M.",
        "Description": "Reviewing classroom recommendations from Marzano, Pickering, and Pollock's seminal Classroom Instruction That Works (2001) through an English language learning lens, Hill and Flynn, second-language education consultants, offer a guide to helping elementary students at all levels of English language acquisition. They outline strategies for homework and practice, summarization and note taking, and the use of nonlinguistic representations. For each strategy, they provide a summary of research, detailed examples of how to modify it for use with English language learners in mainstream classrooms, and real-life teacher accounts of its use. The authors also confront the cultural biases inherent in many classroom practices. Annotation ©2006 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "ASCD",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Myth of Soviet Military Supremacy",
        "Authors": "By Gervasi, Tom",
        "Description": "Questioning the necessity of the Reagan administration's program to rearm America, this study examines the balance of military power between the United States and the Soviet Union",
        "Category": " Political Science , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "West Meets East: Americans Adopt Chinese Children",
        "Authors": "By Tessler, Richard C., Gamache, Gail, and Liu, Liming",
        "Description": "Who are the new families that are appearing on city streets, in suburban malls, and at Fourth of July celebrations? The parents, in their 40s and 50s, are obviously Caucasian, and their very young daughters are obviously Chinese. This book is about these new \"American & Chinese\" families that are being formed through the mechanism of international adoption.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Praeger",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Road to Disunion, Volume II: Secessionists Triumphant 1854-1861",
        "Authors": "By Freehling, William W.",
        "Description": "Here is history in the grand manner, a powerful narrative peopled with dozens of memorable portraits, telling this important story with skill and relish. Freehling highlights all the key moments on the road to war, including the violence in Bleeding Kansas, Preston Brooks's beating of Charles Sumner in the Senate chambers, the Dred Scott Decision, John Brown's raid on Harper's Ferry, and much more. As Freehling shows, the election of Abraham Lincoln sparked a political crisis, but at first most Southerners took a cautious approach, willing to wait and see what Lincoln would do--especially, whether he would take any antagonistic measures against the South. But at this moment, the extreme fringe in the South took charge, first in South Carolina and Mississippi, but then throughout the lower South, sounding the drum roll for secession. Indeed, The Road to Disunion is the first book to fully document how this decided minority of Southern hotspurs took hold of the secessionist issue and, aided by a series of fortuitous events, drove the South out of the Union. Freehling provides compelling profiles of the leaders of this movement--many of them members of the South Carolina elite. Throughout the narrative, he evokes a world of fascinating characters and places as he captures the drama of one of America's most important--and least understood--stories. The long-awaited sequel to the award-winning Secessionists at Bay, which was hailed as \"the most important history of the Old South ever published,\" this volume concludes a major contribution to our understanding of the Civil War. A compelling, vivid portrait of the final years of the antebellum South, The Road to Disunion will stand as an important history of its subject. \"This sure-to-be-lasting work--studded with pen portraits and consistently astute in its appraisal of the subtle cultural and geographic variations in the region--adds crucial layers to scholarship on the origins of America's bloodiest conflict.\"--The Atlantic Monthly\"Splendid, painstaking account...and so a work of history reaches into the past to illuminate the present. It is light we need, and we owe Freehling a debt for shedding it.\"--Washington Post\"A masterful, dramatic, breathtakingly detailed narrative.\"--The Baltimore Sun",
        "Category": " History , United States , State & Local , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "How to Help Children Through a Parent's Serious Illness",
        "Authors": "By McCue, Kathleen and Bonn, Ron",
        "Description": "Offering supportive, practical advice from a leading child-life specialist, this book includes information such as what to tell a child about the illness, how to recognize early-warning signs in a child's drawings, sleep patterns, schoolwork and eating habits, and when and where to get professional help. Illustrations & Calvin & Hobbes cartoons.",
        "Category": " Psychology , Psychotherapy , Couples & Family",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Homonovus: The new man",
        "Authors": "By Fred Richards",
        "Description": "",
        "Category": "",
        "Publisher": "Shields Pub",
        "Price Starting With ($)": "24.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Chloe (The Women of Ivy Manor Series: Book I)",
        "Authors": "By Cote, Lyn",
        "Description": "\"The first book in the Women of Ivy Manor series, about four generations of women, begins with Chloe, the daughter of a politician who comes of age in 1920s Washington D.C.\"--Provided by the publisher.",
        "Category": " Fiction , Literary",
        "Publisher": "Warner Faith",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Horn of Africa: A Novel",
        "Authors": "By Caputo, Philip",
        "Description": "",
        "Category": " Fiction , Literary",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "American Cancer Society's Informed Decisions: The Complete Book of Cancer Diagnosis, Treatment, and Recovery",
        "Authors": "By American Cancer Society (COR), Murphy, Gerald P. (EDT), Morris, Lois B. (EDT), and Lange, Dianne (EDT)",
        "Description": "Covering everything from cancer causes and risks, screening and diagnostic tests, and treatment strategies to coping tips and quality of life issues, a comprehensive guide for anyone with cancer provides crucial resources to deal with their illness. 75,000 first printing. $100,000 ad/promo. Tour.",
        "Category": " Medical , Oncology",
        "Publisher": "Viking",
        "Price Starting With ($)": "6.71",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Beggars in Spain (Beggars Trilogy)",
        "Authors": "By Kress, Nancy",
        "Description": "Born in 2008, Leisha Camden is beautiful, extraordinarily intelligent . . . and one of an ever-growing number of human beings who have been genetically modified to never require sleep.Once she and \"her kind\" were considered interesting anomalies. Now they are outcasts -- victims of blind hatred, political repression and shocking mob violence meant to drive the \"Sleepless\" from human society . . . and, ultimately, from the Earth itself.But Leisha Camden has chosen to remain behind in a world that envies and fears her \"gift\" -- a world marked for destruction in a devastating conspiracy of freedom . . . and revenge.",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Pretty Little Dirty",
        "Authors": "By Boyden, Amanda",
        "Description": "Lisa sees the life of her gorgeous best friend Celeste as just about perfect: she has a gigantic house, two older sisters to coach her through the hazards of high school, and loving, lively parents. As Lisa's own home has long been a place devoid of joyful noise—her mother has shut herself off in her bedroom for years—Lisa joins the Diamond household, slipping into their routine of sit-down suppers and soaking in the delicious normalcy of Diamond family life. But what begins as the story of two young women living a charmed adolescence, one of mastering dance moves and the protocols of male-female interaction, soon swirls into an intoxicating novel of art, music, and self-destructive impulses as Lisa and Celeste dare each other ever onward.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Touched: A Novel",
        "Authors": "By Campbell, Scott",
        "Description": "Robbie Young is an ordinary twelve-year-old boy about to drop a bombshell that will devastate his small town family. One day he rides his bike home after school, finds his mother in the kitchen making dinner, and speaks aloud the secret he's been keeping for a year, \"Jerry Houseman's been touching me.\" Robbie has been molested and the Young family will never be the same. From that moment on, the novel unfolds with inexorable power. The story is narrated in four parts: first by Robbie's mother, then by Jerry Houseman himself, then by Houseman's wife Linda, and concluded by Robbie himself fifteen years later, when he has returned to town for a high school reunion. Each voice is remarkably persuasive and utterly convincing, and the result is a novel that is impossible to put down as it is impossible to forget.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Random House Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Visions and Prophecies (Mysteries of the Unknown)",
        "Authors": "By Time-Life Books",
        "Description": "Looks at some of the phophets who have surfaced throughout history, and examines some of their visions and predictions",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "The War to End Wars 1914-18 (The Eventful 20th Century)",
        "Authors": "By Digest, Readers",
        "Description": "",
        "Category": "",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Inventions That Changed the World (The Eventful 20th Century, 4)",
        "Authors": "By Editors of Reader's Digest",
        "Description": "Describes inventions in such categories as medicine, entertainment, and war, illustrating how they work and how they transform everday lives.",
        "Category": " Technology & Engineering , Nanotechnology & MEMS",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Forging the Modern Age, 1900-14 (The Eventful 20th Century)",
        "Authors": "By Reader's Digest",
        "Description": "",
        "Category": "",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Rules Of Survival",
        "Authors": "By Smith, Kristine",
        "Description": "",
        "Category": "",
        "Publisher": "Science Fiction Book Club",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Fire Time",
        "Authors": "By Poul Anderson",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "October",
            "Year": "1975"
        }
    },
    {
        "Title": "Sunset Trees & Shrubs (Gardening & Landscaping)",
        "Authors": "By Sunset Books (EDT)",
        "Description": "Profiles more than 500 trees and shrubs, guides the planting and cultivation, and aids in the selection of the right plant for landscape, beauty, and ease of care",
        "Category": " Gardening , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Speechless (Red Dress Ink)",
        "Authors": "By Collins, Yvonne and Rideout, Sandy",
        "Description": "A raucous ride through the world of politics, filled with fake alliances, secrets, sex, and deception, follows political speechwriter Libby McIssac as she finds her life thrown into chaos when scandal erupts at work after the arrival of a sexy British consultant. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Red Dress Ink",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "These Three Remain (Fitzwilliam Darcy, Gentleman, Book 3)",
        "Authors": "By Aidan, Pamela",
        "Description": "",
        "Category": " Literary Collections , General",
        "Publisher": "Wytherngate Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Meet Me in Venice",
        "Authors": "By Adler, Elizabeth",
        "Description": "FOUR WORDS WOULD CHANGE HER LIFE...Precious Rafferty is an American antiques dealer living in Paris.  Though Precious--known as Preshy--lives in the world's most romantic city, she keeps her feet firmly on the ground.  No man will ever sweep her off her feet.  Until she meets Bennett James.  He's perfect in every way.  Is he too good to be true?  Granted, she doesn't know much about his business or personal life in Shanghai, but isn't it time to stop being so jaded about romance? And then her long-lost cousin Lily Song sends her an urgent message about Preshy's new love.  \"Meet me in Venice\" are Lily's cryptic words.ONE MAN MIGHT POSSIBLY END IT...Lily lives in Shanghai and knows the antiques underworld there--and she has a secret important enough to draw her to Venice to meet Preshy for the first time, face-to-face. Ruggedly handsome, world-weary writer Sam Knight senses there's a story afoot. Precious senses he's getting closer and closer to her and enmeshed in this tangled web of danger and desire. But is Sam also not all he seems to be? Does he have a terrible secret he's keeping from Preshy? In Venice, Precious will have to weave through a maze of betrayers and seducers to discover who she can trust with her heart...and with her life.  Page-turning, lushly descriptive, and intelligent, Meet Me in Venice is a cat-and-mouse game with plenty of twists and wonderful characters you'll never forget.  It is Elizabeth Adler at her storytelling best.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "St Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Italy (Eyewitness Travel Guides)",
        "Authors": "By Streiffert, Anna",
        "Description": "",
        "Category": " Travel , Europe , Italy",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "6.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Everyday Food: Great Food Fast: 250 Recipes for Easy, Delicious Meals All Year Long: A Cookbook",
        "Authors": "By Martha Stewart Living (COR)",
        "Description": "No matter how busy you are, at the end of the day you want fresh, ﬂavorful meals that are easy to prepare. And you want lots of choices and variations—recipes that call for your favorite foods and take advantage of excellent (and readily available) ingredients. In the ﬁrst book from the award-winning magazine Everyday Food, you’ll ﬁnd all of that: 250 simple recipes for delicious meals that are quick enough to make any day of the week.  Because a change in weather affects how we cook as much as what we cook, the recipes in Everyday Food are arranged by season. For spring, you’ll ﬁnd speedy preparations for main-course salads, chicken, and poached salmon that minimize time spent at the stove; summer features quick techniques for grilling the very best burgers and kabobs as well as no-cook pasta sauces; for fall, there are braised meats and hearty main-course soups; and winter provides new takes on rich one-dish meals, roasts and stews, and hearty baked pastas. Finally, a chapter on basics explains how to make year-round staples such as foolproof roast chicken, risotto, couscous, and chocolate sauce.Designed in a contemporary and easy-to-read format, Everyday Food boasts lush, full-color photography and plenty of suggestions for substitutions and variations. With Everyday Food, even the busiest on-the-go cook can look forward to meals that bring freshness, nutrition, and a range of ﬂavors to dinner all week long.",
        "Category": " Cooking , Reference",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "A Dictionary of Euphemisms and Other Doubletalk",
        "Authors": "By Rawson, Hugh",
        "Description": "",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "The Rose Grower: A Novel",
        "Authors": "By De Kretser, Michelle",
        "Description": "Writing with poignancy and mesmerizing detail, Michelle de Kretser has penned a haunting tale set against the madness of the French Revolution -- a wistful, elegantly rendered novel of unrequited love and personal triumph in a world gone tragically awry.The 1789 storming of the Bastille has brought France to the brink of revolution. Yet in the serene heart of the French province of Gascony, little has changed in a hundred years -- and the events in Paris seem but a distant thunder. Indeed, the dramatic crash landing of American artist and amateur balloonist Stephen Fletcher sparks far more excitement. Stephen lands in the pastoral world of a magistrate and his three daughters -- ethereal Claire, pert and precocious Mathilde, and plain, sensible Sophie, who lovingly tends her rose garden as she simmers with unfulfilled longings.As the revolution brings murder, terror, and fear into the remote Gascon countryside, Stephen finds himself enchanted by the angelic Claire. Yet he is also strangely drawn to Sophie, whose courage and compassion sustain them all, from her family to the quixotic, tormented physician who silently adores her. And even as Sophie keeps a tender secret of her own, she works toward realizing yet another dream: the miracle of an original repeat-flowering crimson rose -- a hopeful symbol of an unblighted future.",
        "Category": " Fiction , War & Military",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Santa's Moose (An Early I Can Read Book)",
        "Authors": "By Hoff, Syd",
        "Description": "A big and clumsy moose named Milton helps Santa one Christmas when his load is too heavy for the reindeer to pull",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "Walking Across Egypt",
        "Authors": "By Edgerton, Clyde",
        "Description": "\"An unpretentious, finely-crafted novel that will linger with the readers like the last strains of a favorite hymn. It is more enjoyable than a pitcher full of sweet tea and one of Mattie's home-cooked dinners.\"--The Atlanta Journal & ConstitutionShe had as much business keeping a stray dog as she had walking across Egypt--which not so incidentally is the title of her favorite hymn. She's Mattie Rigsbee, an independent, strong-minded senior citizen, who at 78, might be slowing down just a bit. When young, delinquent Wesley Benfield drops in on her life, he is even less likely a companion than the stray dog. But, of course, the dog never tasted her mouth-watering pound cake....Wise witty, down-home and real, Walking Across Egypt is a book for everyone.",
        "Category": " Humor , General",
        "Publisher": "Algonquin Books of Chapel Hill",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Sports Illustrated Monday Morning Quarterback: A fully caffeinated guide to everything you need to know about the NFL",
        "Authors": "By King, Peter and Burke, Larry (EDT)",
        "Description": "More than two million people a week rush to SI.com to read Peter King's column, Monday Morning Quarterback. There they find a potent mix of analysis, opinion, humor and inside-the-NFL locker- room information delivered as no one else can. In this book, King, the award-winning Sports Illustrated pro football writer, brings the same blend of wit and wisdom, ranging from his famous \"10 Things I Think I Think\" to his Top 100 player rankings; from the football clichés he hates to the coaching hires he loves; from Brett Favre's golf game to Peyton Manning's comedic skills. And all freshly flavored with King's inimitable observations on the best hotels, the worst airports, the greatest traditions-and coffee, coffee, coffee. There is no journalist better connected to the NFL's players, coaches, general managers and owners, and no writer renders the inside information as entertainingly as Peter King.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Sports Illustrated",
        "Price Starting With ($)": "5.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Chinchilla Farm: A Novel",
        "Authors": "By Freeman, Judith",
        "Description": "Verna Flake is fleeing Utah, a failed marriage (her husband has left her for a former beauty queen named Pinky), and the constricted yet reliable Mormon way of life. Seemingly naive but also gifted with an almost second sight for the emotional heart of things, Verna relates her adventures on the road, in Los Angeles, and eventually in Mexico, as she confronts her future and muses over her past. Reading group guide included.",
        "Category": " Fiction , Literary",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The Reagan Diaries",
        "Authors": "By Reagan, Ronald and Brinkley, Douglas (EDT)",
        "Description": "Brought together in one volume and edited by historian Douglas Brinkley, The Reagan Diaries provides a striking insight into one of this nation's most important presidencies and sheds new light on the character of a true American leader. Whether he was in his White House residence study or aboard Air Force One, each night Reagan wrote about the events of his day, which often included his relationships with other world leaders Mikhail Gorbachev, Pope John Paul 11, Mohammar alQaddafi, and Margaret Thatcher, among others, and the unforgettable moments that defined the era-from his first inauguration to the end of the Cold War, the Iran hostage crisis to John Hinckley Jr.'s assassination attempt.The Reagan Diaries reveals more than just Reagan's political experiences: many entries are concerned with the president's private thoughts and feelings-his love and devotion for Nancy Reagan and their family, his belief in God and the power of prayer. Seldom before has the American public been given access to the unfiltered experiences ancl opinions of a president in his own words, from Reagan's description of near-drowning at the home of Hollywood friend Claudette Colbert to his determination to fight Fidel Castro at every turn and keep the Caribbean Sea from becoming a \"Red Lake.\"",
        "Category": " Political Science , American Government , Executive Branch",
        "Publisher": "Harper",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Boy Who Loved Anne Frank: A Novel",
        "Authors": "By Feldman, Ellen",
        "Description": "On February 16, 1944, Anne Frank recorded in her diary that Peter, whom she at first disliked but eventually came to love, had confided in her that if he got out alive, he would reinvent himself entirely. This is the story of what might have happened if the boy in hiding survived to become a man.Peter arrives in America, the land of self-creation; he flourishes in business, marries, and raises a family. He thrives in the present, plans for the future, and has no past. But when The Diary of a Young Girl is published to worldwide acclaim and gives rise to bitter infighting, he realizes the cost of forgetting.Based on extensive research of Peter van Pels and the strange and disturbing life Anne Frank's diary took on after her death, this is a novel about the memory of death, the death of memory, and the inescapability of the past. Reading group guide included.",
        "Category": " Fiction , Historical , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Kitchen Consultant: A Common-Sense Guide to Kitchen Remodeling",
        "Authors": "By Kimball, Herrick",
        "Description": "Readers will find an expert guide through the kitchen remodeling jungle in The Kitchen Consultant. This book contains the wisdom of seasoned kitchen remodeling contractor Herrick Kimball and the input of more than two dozen kitchen consultants from across the U.S. Readers will find advice on design, products, prices, suppliers, contractors and work specifications. Written in an engaging, conversational style with friendly, rendered drawings, this book makes the kitchen remodeling process flow smoothly. Helps readers:-- Decide how much remodeling they can do for themselves and what to leave to the professionals.-- Determine the cost vs. payback of a kitchen remodel in home resale value.-- Save money by avoiding common kitchen remodeling pitfalls.-- Choose the best appliances for a budget and compare common kitchen materials.-- An informative resource for the homeowner and a valuable reference for the professional.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Waiting for the End of the World",
        "Authors": "By Bell, Madison Smartt",
        "Description": "With no particular motive and a goal of total destruction, Larkin, an epileptic drunk, and four other derelicts plot an insane terrorist attack upon Manhattan",
        "Category": " Fiction , General",
        "Publisher": "Ticknor & Fields",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Retribution: The Battle for Japan, 1944-45",
        "Authors": "By Hastings, Max",
        "Description": "Hailed in Britain as “Spectacular . . . Searingly powerful” (Andrew Roberts, The Sunday Telegraph), a riveting, impeccably informed chronicle of the final year of the Pacific war. In his critically acclaimed Armageddon, Hastings detailed the last twelve months of the struggle for Germany. Here, in what can be considered a companion volume, he covers the horrific story of the war against Japan.By the summer of 1944 it was clear that Japan’s defeat was inevitable, but how the drive to victory would be achieved remained to be seen. The ensuing drama—that ended in Japan’s utter devastation—was acted out across the vast stage of Asia, with massive clashes of naval and air forces, fighting through jungles, and barbarities by an apparently incomprehensible foe. In recounting the saga of this time and place, Max Hastings gives us incisive portraits of the theater’s key figures—MacArthur, Nimitz, Mountbatten, Chiang Kai-shek, Mao, Roosevelt, Churchill, and Stalin. But he is equally adept in his portrayals of the ordinary soldiers and sailors—American, British, Russian, Chinese, and Japanese—caught in some of the war’s bloodiest campaigns.With unprecedented insight, Hastings discusses Japan’s war against China, now all but forgotten in the West, MacArthur’s follies in the Philippines, the Marines at Iwo Jima and Okinawa, and the Soviet blitzkrieg in Manchuria. He analyzes the decision-making process that led to the bombing of Hiroshima and Nagasaki—which, he convincingly argues, ultimately saved lives. Finally, he delves into the Japanese wartime mind-set, which caused an otherwise civilized society to carry out atrocities that haunt the nation to this day.Retribution is a brilliant telling of an epic conflict from a master military historian at the height of his powers.",
        "Category": " History , Military , World War II",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Outside Inside: Decorating in the Natural Style",
        "Authors": "By Aria, Barbara and Moore, Steve (PHT)",
        "Description": "A Manhattan townhouse in which barn walls were reassembled to satisfy the resident's rustic yearnings ... an impeccably appointed country house where moss - quite literally - grows between the floorboards ... a New England cottage in which the furniture sprouts twigs, bark, and even pine cones.... All are examples of homes designed with nature in mind. Gone is the cold steel of postmodernism, the overdone period interior, the inflexible decorating scheme. Here instead is a celebration of interiors suffused with life and growth, with the elements and the seasons.Outside Inside is the first compendium of decorating ideas to recognize nature's designs as valid models for domestic decor. Organized according to the five senses, it combines spectacular photography with detailed advice on how to integrate natural elements into preexisting interiors. Arrangements of winter branches delight the eye; tatami mats underfoot pamper the sense of touch; a fountain fills a city apartment with the sound of running water; imaginative table settings and recipes tantalize the taste buds.For anyone who pines for the simple, barefoot delights of a summer childhood, wishes that the spirit of a weekend retreat could carry over into every day of the week, or simply requires relief from the fast pace of contemporary living, Outside Inside is an inspired yet practical guide to making changes for the better.",
        "Category": "",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Victoria: At Home with White: Celebrating the Intimate Home",
        "Authors": "By Larmoth, Jeanine",
        "Description": "White is the color of angels and brides, moonlight and lily of the valley. It is capable of endless subtleties; fragile or strong, it can be transparent as ice, opaque as marble, in love with light as a diamond.Now the secrets of using this most challenging color is explored and shared by the editors of Victoria magazine in At Home with White. More than 150 beautiful photographs feature the many decorating styles created or enhanced by the color of white - richly traditional, clean-lined contemporary, rustic country, breezy tropical, lushly romantic. Victoria takes us on an informative tour of the exquisite fabrics that bring these styles to life, from hardworking cottons to sophisticated linens to precious laces. We are invited into the wonderful, magical world of summer, a season that seems as if it were created expressly for white, and into the private places in our homes made intimate and fresh with white - bedroom, bathroom, dressing room. The white gardens, porches, and terraces that serve as refuges in our lives are explored, as is the long-standing friendship between white and blue. Throughout the book are profiles of homeowners who have spun some magic of their own with this most intriguing color.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Hearst",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "The Lost Spy: An American in Stalin's Secret Service",
        "Authors": "By Meier, Andrew",
        "Description": "For half a century, the case of Isaiah Oggins, a 1920s New York intellectual brutally murdered in 1947 on Stalin's orders, remained hidden in the secret files of the KGB and the FBI—a footnote buried in the rubble of the Cold War. Then, in 1992, it surfaced briefly, when Boris Yeltsin handed over a deeply censored dossier to the White House. The Lost Spy at last reveals the truth: Oggins was one of the first Americans to spy for the Soviets.Based on six years of international sleuthing, The Lost Spy traces Oggins's rise in beguiling detail—a brilliant Columbia University graduate sent to run a safe house in Berlin and spy on the Romanovs in Paris and the Japanese in Manchuria—and his fall: death by poisoning in a KGB laboratory. As harrowing as Darkness at Noon and as tragic as Dr. Zhivago, The Lost Spy is one of the great nonfiction detective stories of our time.",
        "Category": " History , United States , 20th Century",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Holiday Sweets and Treats",
        "Authors": "By Brennan, Rebecca",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The War Within: A Secret White House History 2006-2008",
        "Authors": "By Woodward, Bob",
        "Description": "As violence in Iraq reaches unnerving levels in 2006, a second front in the war rages at the highest levels of the Bush administration. In his fourth book on President George W. Bush, Bob Woodward takes readers deep inside the tensions, secret debates, unofficial backchannels, distrust and determination within the White House, the Pentagon, the State Department, the intelligence agencies and the U.S. military headquarters in Iraq. With unparalleled intimacy and detail, this gripping account of a president at war describes a period of distress and uncertainty within the U.S. government from 2006 through mid-2008.   The White House launches a secret strategy review that excludes the military. General George Casey, the commander in Iraq, believes that President Bush does not understand the war and eventually concludes he has lost the president's confidence. The Joint Chiefs of Staff also conduct a secret strategy review that goes nowhere. On the verge of revolt, they worry that the military will be blamed for a failure in Iraq.Secretary of State Condoleezza Rice strongly opposes a surge of additional U.S. forces and confronts the president, who replies that her suggestions would lead to failure. The president keeps his decision to fire Secretary of Defense Donald Rumsfeld from Vice President Dick Cheney until two days before he announces it. A retired Army general uses his high-level contacts to shape decisions about the war, as Bush and Cheney use him to deliver sensitive messages outside the chain of command. For months, the administration's strategy reviews continue in secret, with no deadline and no hurry, in part because public disclosure would harm Republicans in the November 2006 elections. National Security Adviser Stephen J. Hadley tells Rice, \"We've got to do it under the radar screen because the electoral season is so hot.\"The War Within provides an exhaustive account of the struggles of General David Petraeus, who takes over in Iraq during one of the bleakest and most violent periods of the war. It reveals how breakthroughs in military operations and surveillance account for much of the progress as violence in Iraq plummets in the middle of 2007.Woodward interviewed key players, obtained dozens of never-before-published documents, and had nearly three hours of exclusive interviews with President Bush. The result is a stunning, firsthand history of the years from mid-2006, when the White House realizes the Iraq strategy is not working, through the decision to surge another 30,000 U.S. troops in 2007, and into mid-2008, when the war becomes a fault line in the presidential election.The War Within addresses head-on questions of leadership, not just in war but in how we are governed and the dangers of unwarranted secrecy.",
        "Category": " History , United States , 21st Century",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Ideals Thanksgiving, 1995",
        "Authors": "By Various",
        "Description": "Photographs, recipes, poems, stories, and essays capture the true essence of Thanksgiving celebrations",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Ideals Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "From Geography to Affinity: How Congregations Can Learn From One Another",
        "Authors": "By Schaller, Lyle E.",
        "Description": "Changes in denominational life in North America have left congregations with two difficult choices. On one hand, they can choose to act as though their ministries and programs can still best be established by national denominational offices. On the other hand, they can choose to act as though their denominational identity is completely irrelevant to their mission. Underlying these difficult choices, writes Lyle E. Schaller, is the tremendous flux in the relationship between national denominations and their member congregations over the last forty years. The fact that relatively few visitors choose to affiliate with a congregation on the basis of denominational identity leads some to conclude (incorrectly) that the interdependence and cooperation between congregations of similar heritage and background is unimportant. At the same time, others conclude (also incorrectly) that there is nothing wrong with current denominational structures and that congregations need simply to align themselves with their denomination's directions more thoroughly. To these bad choices, Schaller proposes an alternative. He observes that many congregations already seek to extend their mission and make their ministries more effective by participating in affinity networks--groups of congregations that share particular goals and visions. Schaller suggests the establishment of such networks within, rather than outside of, denominations. He argues that they should be established on the judicatory level. Rather than making state or regional boundaries the organizing principle by which congregations within a denomination align themselves, why not form judicatories around a particular sense of mission, or distinctive theological stands? Schaller concludes that allowing and encouraging the formation of such affinity networks will recognize the differences between congregations within a denominations as the strength it truly is, and will, foster a greater unity of purpose between the denomination's churches.",
        "Category": " Religion , Christian Church , Leadership",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Coal River",
        "Authors": "By Shnayerson, Michael",
        "Description": "One of America's most dramatic environmental battles is unfolding in southern West Virginia. Coal companies are blasting the mountains, decapitating them for coal. The forested ridge tops and valley streams of Appalachia - one of the country's natural treasures - are being destroyed, along with towns and communities. An entire culture is disappearing, and to this day, most Americans have no idea it's happening.Michael Shnayerson first traveled to the coalfields four years ago, on assignment for Vanity Fair. There he met an inspiring young lawyer named Joe Lovett who was fighting mountaintop removal in court with a series of brilliant and daring lawsuits. He also met a resolute, hard-as-shale coal miner's daughter named Judy Bonds, whose grassroots group, Coal River Mountain Watch, was speaking out in a region where talking truth to power was both brave and dangerous. The two had joined forces to take on Massey Energy, the largest and most aggressive of the coal companies, and its swaggering, notorious chairman, Don Blankenship. The stage was set for an epic American struggle between fearless individuals and a greedy corporate giant; between a cherished way of life and the industry that threatened to destroy it forever.Coal River is Shnayerson's account of this dramatic struggle. From country hollows to federal courtrooms, from rural West Virginia to the corridors of power in Washington D.C., Shnayerson gives us a novelistic and compelling portrait of the people who risked their reputations and livelihoods in the fight against King Coal.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Ideals Mother's Day, 1987",
        "Authors": "By Ideals Publications Inc",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Ideals Nostalgia Vol-44, No.5",
        "Authors": "By Ideals Publications Inc",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Publishing Corporation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Murder of King Tut: The Plot to Kill the Child King - A Nonfiction Thriller",
        "Authors": "By Patterson, James and Dugard, Martin",
        "Description": "A secret buried for centuriesThrust onto Egypt's most powerful throne at the age of nine, King Tut's reign was fiercely debated from the outset. Behind the palace's veil of prosperity, bitter rivalries and jealousy flourished among the Boy King's most trusted advisors, and after only nine years, King Tut suddenly perished, his name purged from Egyptian history. To this day, his death remains shrouded in controversy. The keys to an unsolved mysteryEnchanted by the ruler's tragic story and hoping to unlock the answers to the 3,000 year-old mystery, Howard Carter made it his life's mission to uncover the pharaoh's hidden tomb. He began his search in 1907, but encountered countless setbacks and dead-ends before he finally, uncovered the long-lost crypt. The clues point to murderNow, in The Murder of King Tut, James Patterson and Martin Dugard dig through stacks of evidence--X-rays, Carter's files, forensic clues, and stories told through the ages--to arrive at their own account of King Tut's life and death. The result is an exhilarating true crime tale of intrigue, passion, and betrayal that casts fresh light on the oldest mystery of all.",
        "Category": " History , Ancient , Egypt",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "A Mother's Journal: A Collection of Family Memories",
        "Authors": "By Engelbreit, Mary",
        "Description": "A beautifully illustrated hardbound journal designed to provide mothers with an opportunity to preserve family memories offers space to collect favorite stories and a personal history. 40,000 first printing.",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Man of Steel: The Career and Courage of Christopher Reeve",
        "Authors": "By Havill, Adrian",
        "Description": "Recounts the accident that left the popular actor paralyzed, and describes how he has attempted to continue leading a full life and work on behalf of spinal cord injury victims",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Toddlers & Parents: A Declaration of Independence",
        "Authors": "By Brazelton, T. Berry",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1976"
        }
    },
    {
        "Title": "Sara (SpringSong Books #17)",
        "Authors": "By Gibson, Eva",
        "Description": "After witnessing a hit-and-run accident, Sara befriends Matt, the victim, and together they look for clues to the driver's identity",
        "Category": "",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "David Brin's Out of Time: Yanked!",
        "Authors": "By Kress, Nancy",
        "Description": "In the first volume of a new science fiction series, a group of teenagers from the late twentieth century are brought from their own time into a future utopia of the twenty-sixth century, where they are assigned the task of battling the Panurish, grotesque humanoids possessing a third eye. Original.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Two Queens of Lochrin",
        "Authors": "By Creighton, Lee",
        "Description": "Rian, an East Village resident, leads a fascinating existence each night as she crawls into bed and dreams that she is the Warrior Queen, ruler of ancient Scotland, whose kingdom is under siege",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Star Prince Charlie",
        "Authors": "By Poul Anderson, Gordon R. Dickson",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1978"
        }
    },
    {
        "Title": "Inside the Soul of a New Generation",
        "Authors": "By Celek, Tim, Zander, Dieter, and Kampert, Patrick",
        "Description": "Generation X. Busters. The Lost Generation. The Fatherless Generation. These are the catchphrases used to describe that elusive and mysterious generation of 46 million Americans born between 1965 and 1980. More than that, these are our children, our neighbors, our friends, and fellow employees.  Tim Celek and Deiter Zander have learned through years of experience that to win this generation of young people, you have to fight harder for credibility, and you have to love harder to overcome their pasts. But they have also found that reaching them is well worth the effort. Inside the Soul of a New Generation offers a fascinating, inside look at the unique forces that shape this misunderstood generation and shows how pastors, parents, and Baby Boomers of every stripe can minister to their spiritual needs. From practical ways to reach out to Busters and build powerful, Buster-friendly churches, to creating a vital community and empowering Busters for leadership, Celek and Zander show that this generation is not only reachable, but has the potential to effect positive changes both in the church and in the world.",
        "Category": " Religion , Christian Ministry , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Empery: Book 3 of Trigon Disunity",
        "Authors": "By Kube-McDowell, Michael P.",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "The Promise: A Celebration of Christ's Birth",
        "Authors": "By Card, Michael",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Chordant Distribution",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Magic Goes Away",
        "Authors": "By Larry Niven",
        "Description": "",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "101 Essential Tips on Home Decorating",
        "Authors": "By Barnard, Nicholas",
        "Description": "Describes interior design techniques and offers ideas for walls, floors, furniture, lighting, ornamental finishes, window treatments, and decorative objects",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "An Adoptor's Advocate",
        "Authors": "By Johnston, Patricia Irwin",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Perspectives Pr",
        "Price Starting With ($)": "8.84",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "How to Write Short Stories 3E (ARCO's Concise Writing Guides)",
        "Authors": "By Sorenson, Sharon",
        "Description": "Offers advice on using characters, setting, plot, and dialogue to create an effective short story and includes sample short stories with analysis",
        "Category": " Language Arts & Disciplines , Writing , Fiction Writing",
        "Publisher": "ARCO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Asian Art",
        "Authors": "By Michael Kerrigan",
        "Description": "",
        "Category": "",
        "Publisher": "Star Fire Publ.",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Richelieu and the French Monarchy",
        "Authors": "By Wedgwood, C. V.",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1962"
        }
    },
    {
        "Title": "Women with Men : Three Stories",
        "Authors": "By Ford, Richard",
        "Description": "Richard Ford's Independence Day--his sequel to The Sportswriter, and an international bestseller--is the only novel ever to have received both the Pulitzer Prize and the PEN/Faulkner Award. Now, with Women With Men, he reaffirms his mastery of shorter fiction with his first collection since the widely acclaimed Rock Springs, published a decade ago.The landscape of Women with Men ranges from the northern plains of Montana to the streets of Paris and the suburbs of Chicago, where Mr. Ford's various characters experience the consolations and complications that prevail in matters of passion, romance and love. A seventeen-year-old boy starting adulthood in the shadow of his parents' estrangement, a survivor of three marriages now struggling with cancer, an ostensibly devoted salesman in early middle age, an aspiring writer, a woman scandalously betrayed by her husband--they each of them contend with the vast distances that exist between those who are closest together. Whether alone, long married or newly met, they confront the obscure difference between privacy and intimacy, the fine distinction of pleasing another as opposed to oneself, and a need for reliance that is tempered by fearful vulnerability.In three long stories, Richard Ford captures men and women at this complex and essential moment of truth--in the course of everyday life, or during a bleak Thanksgiving journey, seismic arguments, Christmas abroad, the sudden disappearance of a child, even a barroom shooting. And with peerless emotional nuance and authority he once again demonstrates, as Elizabeth Hardwick has written, \"a talent as strong and varied as American fiction has to offer.\"",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Wild, Sweet Promise",
        "Authors": "By Taylor, Janelle",
        "Description": "The love between Princess Alysa and King Gavin is threatened by Alysa's desperate plan to repel the invading Viking hordes",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "The Working Actor",
        "Authors": "By Matson, Katinka",
        "Description": "Practical information about the business of acting is presented with comments and advice from actors, agents, directors, and others in the theatre, motion-pictures, and television",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "Texas! Lucky: A Novel (Texas! Tyler Family Saga)",
        "Authors": "By Brown, Sandra",
        "Description": "The first book in #1 New York Times bestselling author Sandra Brown’s beloved Texas! trilogy introduces readers to a close-knit family struggling to go on without its patriarch—and to a man in pursuit of an elusive woman who may hold his future in her hands. Charismatic and easy on the eyes, Lucky Tyler is a born rebel. His romantic conquests have earned him his nickname, while his temper gives him his reputation as the family hothead. One night, he gets in a fight over a woman in distress, followed by a night of passion neither of them will soon forget. But the lady in question has a knack for disappearing. When news breaks of a suspicious fire at Tyler Drilling, Lucky is the prime suspect. Now the mystery woman is more than just the object of his obsession. She’s his alibi. Devon Haines has tried her best to escape Lucky. Yet his bold pursuit and self-assurance are irresistible. In order to clear him of criminal charges, she must reveal her darkest secret; withholding her help could cost him everything he holds dear. Either way, she risks losing him forever.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Twin of Fire",
        "Authors": "By Deveraux, Jude",
        "Description": "While dreaming of practicing medicine, Blair falls in love with her placid sister's fiancé, himself a passionate doctor. Blair's impetuous spirit has won her a medical degree in a man's world -- and captured Lee Westfi eld's heart. But even as the couple's ardor grows, there are nights when Lee disappears only to return exhausted, haunted. His silence imperils their love. But the truth would imperil her life.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Housewrights",
        "Authors": "By Corriveau, Art",
        "Description": "Set in a small Vermont town in the early decades of the twentieth century, Housewrights tells the story of Lily Willard, the town librarian, and her relationship with Oren and Ian Pritchard, housewrights who roam New England building houses for others though they themselves are homeless. Lily first meets the twins when they are children, and the boys arrive with their father to build Lily's family a new farmhouse. Ten years later, Oren returns for Lily. He asks her to marry him. She agrees, if he will settle down-for the first time in his life. Always lurking, though, is the question of Ian, off fighting the Great War. But when he returns, shell-shocked and wounded, Lily welcomes him into their home. Eyebrows are raised only silently at this unusual household, until one evening at the Grange Hall dance the three take a heady, impetuous waltz together-with practically the entire town watching.Rich in detail and emotion, this unforgettable novel marks the debut of a singular storyteller who writes with extraordinary beauty, depth, and clarity.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "In the Middle of the Night",
        "Authors": "By Cormier, Robert",
        "Description": "Eight years before Denny Colbert was born, his father was involved in a tragic accident that killed 22 children. Now Denny is 16, and all he wants is to be like other kids his age. But he isn't allowed to answer the telephone or have a driver's license, and his family is constantly moving from town to town--all because people can't forget what happened long ago.When Denny defies his parents one afternoon and answers the telephone, he finds himself drawn into a plot for revenge which may prove deadly.",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Prince of Ill Luck (Warhorse of Esdragon, Book 1)",
        "Authors": "By Dexter, Susan",
        "Description": "Shipwrecked on a wild and foreign coast, Leith, Prince of the Isles, finds Valadan, a fabulous black stallion, and together they enjoy a remarkable adventure. Original.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Trinity Fields",
        "Authors": "By Morrow, Bradford",
        "Description": "Capturing the anguish of a generation, the story of childhood friends who grew up in Los Alamos portrays anti-war protests, the conflicts of Laos, and a ghost soldier reappearing twenty-five years later",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Mismatch: A Novel",
        "Authors": "By Hoag, Tami",
        "Description": "#1 New York Times bestselling author Tami Hoag mixes passion, politics, heartbreak, and humor in this powerful classic novel ignited by a man and woman whose desire for each other could lead them both to ruin.They were totally wrong for each other. A romantic odd couple. It was clear at first sight. Bronwynn Prescott Pierson was a jet-setting socialite, a one-time fashion icon, and now a runaway bride. Wade Grayson was a straitlaced, ambitious congressman from the American heartland. They couldn’t have had less in common and more to lose by their accidental meeting in the Vermont woods, where they’d each gone in hopes of escaping the past.Both drawn to the ruins of the old Foxfire estate, the woman from Venus and the man from Washington were playing a dangerous game with the most volatile and unpredictable of human emotions. And when it all blew up, the press would be there to broadcast the disaster to the world. But what their enemies didn’t count on was that the power that drew them together would always be a little stronger than anything—or anyone—that would try to drive them apart.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Holy Smokes (Aisling Grey, Guardian, Book 4)",
        "Authors": "By MacAlister, Katie",
        "Description": "I’m Aisling Grey—but you can call me “frustrated.”The dragon of my dreams—uber-sexy Drake Vireo, wyvern of the green dragons—has finally decided to make an honest woman of me. That is, if we ever make it to the wedding at the same time! Being left at the altar may have cooled my jets, but not my passion...a good thing when Drake disappears and it's up to me to find him.  Most brides just have in-laws to worry about. Me? I have warring dragons, ticked-off demon lords, eternal damnation, and a mage who wants to challenge me for an otherworldly position I don’t even want. At least Jim, my doggie-demon, is always at my side. He’s never let me down—yet…",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Scotland For Dummies (Dummies Travel)",
        "Authors": "By Allan, David G.",
        "Description": "From ancient castles to the bright lights of Glasgow, the annual Edinburgh Festival to the fabled Loch Ness monster, a trip to Scotland promises a postcard-perfect, unforgettable vacation. Whether you’re a golf enthusiast or bagpipe aficionado, traveling solo or with family, this user-friendly guide takes you to islands, Highlands, Lowlands and everything in between. You’ll discover how to get the most out of your time and your budget with:What to do and see in cities and regions including Edinburgh, Glasgow, the Central and West Highlands, the Hebridean Islands, and moreUp-to-date advice on dining, shopping, and “doing the pub crawl” in Edinburgh and GlasgowTips on experiencing Scotland by car, train, bus…and by boat to the islands!Handy listings of the best golf courses, historic castles, distilleries, pubs, and natural attractionsLike every For Dummies travel guide, Scotland For Dummies, Second Edition includes:Down-to-earth trip-planning adviceWhat you shouldn’t miss — and what you can skipThe best restaurants and hotels for every budgetLots of detailed maps",
        "Category": " Travel , Europe , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Radigan/North to the Rails",
        "Authors": "By L'Amour, Louis",
        "Description": "RadiganTom Radigan spent four hard years building up his ranch. Now a beautiful and deadly opportunist presents him with “evidence” that the land belongs to her. Angelina Foley wants Radigan off Vache Creek immediately, and with an outfit of gunfighters to back her and winter coming on, she’s not taking no for an answer. Outmanned, outgunned, and legally outmaneuvered, Radigan isn’t going anywhere. Not without fighting for what he knows is rightfully his…even if he has to die for it.North to the RailsTom Chantry came west to buy cattle, not to find trouble. So when he leaves town rather than accept a challenge from a gunfighter named Dutch Akin, he’s labeled a coward. Now only one man will agree to help Chantry take his herd to the railroad: a shrewd and ruthless cattleman named French Williams. He makes Chantry an unusual deal. He will hire a crew but Chantry must remain with the drive from start to finish or forfeit the herd. Chantry accepts…and the first man French hires is Dutch Akin.",
        "Category": " Fiction , Westerns",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Mutagenesis",
        "Authors": "By Collins, Helen",
        "Description": "In the colony of Plain to recover strains of grasses long extinct on Earth, Dr. Mattie Manan has a falling out with its patriarchal leaders and must escape, along with some native women, into the plains of Anu. Reprint.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    }
]