[
    {
        "Title": "Seven Up (Stephanie Plum, No. 7) (Stephanie Plum Novels)",
        "Authors": "By Evanovich, Janet",
        "Description": "Semiretired mob guy Eddie DeCooch is caught trafficking contraband cigarettes through Trenton, New Jersey. When DeCooch fails to show for a court appearance, bond enforcement agent Stephanie Plum is assigned the task of finding him and dragging his decrepit ass back to jail. Not such an easy job, it turns out, since DeCooch has learned a lot of tricks over the years and isn't afraid to use his gun. He's already shot Loretta Ricci, an innocent old lady, and left her for worm food in his shed. He wouldn't mind shooting Stephanie next.Likeable losers (and Steph's former high school classmates) Walter \"MoonMan\" Dunphy and Dougie \"The Dealer\" Kruper have inadvertently become involved with DeCooch. They've gotten sucked into an operation that is much more than simple cigarette smuggling and holds risks far greater than anyone could have imagined.When Dougie disappears, Steph goes into search mode. When Mooner disappears, she calls in the heavy artillery and asks master bounty hunter Ranger for help. Ranger's price for the job? One night with Stephanie, dusk to dawn. Not information she's want to share with her sometime live-in roommate, vice cop Joe Morelli,A typical dilemma in the world of Plum.And on the homefront, Stephanie's \"perfect\" sister, Valerie, has decided to move back to Trenton, bringing her two kids from hell with her. Grandma Mazur is asking questions about being a lesbian, and Bob, the bulimic dog, is eating everything in sight--including the furniture.Mud wrestling, motorcycles, fast cars, fast food, and fast men. It's Seven Up. Absolutely Janet Evanovich at her very best.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "St. Martin's Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "No Shortcuts to the Top: Climbing the World's 14 Highest Peaks",
        "Authors": "By Roberts, David and Viesturs, Ed",
        "Description": "This gripping and triumphant memoir from the author of The Mountain follows a living legend of extreme mountaineering as he makes his assault on history, one 8,000-meter summit at a time.For eighteen years Ed Viesturs pursued climbing’s holy grail: to stand atop the world’s fourteen 8,000-meter peaks, without the aid of bottled oxygen. But No Shortcuts to the Top is as much about the man who would become the first American to achieve that goal as it is about his stunning quest. As Viesturs recounts the stories of his most harrowing climbs, he reveals a man torn between the flat, safe world he and his loved ones share and the majestic and deadly places where only he can go.A preternaturally cautious climber who once turned back 300 feet from the top of Everest but who would not shrink from a peak (Annapurna) known to claim the life of one climber for every two who reached its summit, Viesturs lives by an unyielding motto, “Reaching the summit is optional. Getting down is mandatory.” It is with this philosophy that he vividly describes fatal errors in judgment made by his fellow climbers as well as a few of his own close calls and gallant rescues. And, for the first time, he details his own pivotal and heroic role in the 1996 Everest disaster made famous in Jon Krakauer's Into Thin Air. In addition to the raw excitement of Viesturs’s odyssey, No Shortcuts to the Top is leavened with many funny moments revealing the camaraderie between climbers. It is more than the first full account of one of the staggering accomplishments of our time; it is a portrait of a brave and devoted family man and his beliefs that shaped this most perilous and magnificent pursuit.",
        "Category": " Sports & Recreation , Hiking",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "The Shih Tzu (Terra-Nova)",
        "Authors": "By Wood, Deborah",
        "Description": "The Shih Tzu is a noble member of the toy family. Discover special training methods geared specifically to this diminutive dog. Written by an expert, this book contains valuable information on a variety of topics that are essential for cultivating health and happiness in a canine companion—including feeding, grooming, and training. In addition to an extensive, veterinarian-approved health chapter, the book comes with a bonus DVD that features socialization, safety, and training advice from a professional dog trainer—plus detailed information from a veterinarian on what happens at the vet and how to perform regular health checks at home.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "T.F.H. Publications, Inc.",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Best of Country Cooking 1999",
        "Authors": "By Taste of Home",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Country Store Reiman Pubs",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Thai Cooking (Step-by-Step)",
        "Authors": "By",
        "Description": "This cookbook provides ideas for Thai cookery. Each of the over 100 recipes features colour photographs. Each recipe is rated for ease of preparation, for ease of use and understanding. There is also an indication of how long a dish will take to prepare.",
        "Category": " Cooking , Regional & Ethnic , General",
        "Publisher": "Murdoch Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "I Stay Near You: One Story in Three",
        "Authors": "By Kerr, M. E",
        "Description": "Passed from generation to generation, a gold ring inscribed with “I Stay Near You” mysteriously manipulates a complex chain of events. “Kerr is at her comic and poignant best.”--Booklist“Different eras, conflicting life styles, and contrasting social backgrounds are interwoven into a tale that should captivate readers.”--School Library Journal",
        "Category": " Young Adult Fiction , Romance , General",
        "Publisher": "Harcourt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "God's Wisdom for Fathers",
        "Authors": "By Countryman, Jack",
        "Description": "Equips fathers to know, learn, and practice God’s wisdom through focusing on His Word as theyencounter the many responsibilities that face fathers in today’s culture. Affordably priced andmakes a great Father’s Day gift, birthday gift, or presentation to new fathers on the birth of theirchild.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "An Invitation to Prayer for Mothers",
        "Authors": "By Countryman, Jack",
        "Description": "Beautifully illustrated book with scriptures and prayers arrangedtopically to inspire, equip, and help mothers grow in their walk withthe Lord and their calling of motherhood. Affordably priced and makesa great Mother’s Day gift, birthday or as a presentation to new motherson the birth of their child.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Geography: Realms, Regions, and Concepts",
        "Authors": "By De Blij, Harm J. and Muller, Peter O.",
        "Description": "A penetrating look at the geographical framework of the contemporary world using the geographic perspective and geography's spatial terminology to investigate the globe's great geographic regions. Features complete, balanced and in-depth coverage of human culture, historical, physical and economic geography along with the very latest developments and implications. As in previous editions, this one contains outstanding illustrative materials including over 200 detailed maps.",
        "Category": " Science , Earth Sciences , Geography",
        "Publisher": "Wiley",
        "Price Starting With ($)": "7.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Small Wonders: An Anthology (Silhouette Single Title)",
        "Authors": "By Major, Ann, Camp, Candace, Schulze, Dallas, and Morgan, Raye",
        "Description": "Four heartwarming novellas capture the joys, challenges, and special moments of motherhood, in a collection that includes Tabloid Baby by Candace Camp, Cullen's Child by Dallas Schulze, Ann Major's The Baby Machine, and Raye Morgan's The Baby Invasion. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Oxford History of Christianity",
        "Authors": "By McManners, John (EDT)",
        "Description": "Now available in a compact, more convenient format, this book offers the same acclaimed text which first appeared in The Oxford Illustrated History of Christianity.  Written by a team of expert scholars, this astonishingly comprehensive volume traces the history of Christianity from the Early Church to the present day exploring every aspect of the faith. The opening section takes events from the earliest Christian communities to 1800, and includes chapters on Eastern Christendom, Christianity and Islam, the Reformation, the Enlightenment, and the expansion of Christianity. The second section, covering the period from 1800 to the present day, is divided by geographical area and examines the impact of Christianity around the world from Britain and Europe, Africa, India, and the Far East. The final section, considering questions of theology, conscience, and belief, explores new images of the Christian community and provides a glimpse of the future of the faith.  Authoritative and readable, The Oxford History of Christianity is essential for anyone interested in the enduring history of one of the world's most vibrant religious traditions.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.71",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The Gemini Contenders: A Novel",
        "Authors": "By Ludlum, Robert",
        "Description": "Salonika, Greece: December 1939. In the dead of night, a clandestine order of monks embarks on a desperate mission: to transport a mysterious vault to a hiding place high in the Italian Alps. The sinister cache, concealed for centuries, could rip apart the Christian world. Now, as the Nazi threat marches inexorably closer, men both good and evil will be drawn into a violent and deadly hunt, sparking a relentless struggle that could forever change the world as we know it.   Praise for Robert Ludlum and The Gemini Contenders   “[Robert Ludlum’s] most ambitious novel . . . Its twist and turns carry the reader on a fast bobsled run. . . . A marvelously unflagging imagination.”—The New York Times   “A winner . . . one of those books you intend to put down after just one more chapter . . . suddenly it’s two in the morning and you’ve read the whole thing.”—United Press International   “A skyrocket of a book . . . The action never stops for a second.”—The Plain Dealer   “Packed full of excitement.”—The Denver Post",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "The Children's Zoo",
        "Authors": "By O'Donnell, Lillian",
        "Description": "",
        "Category": "",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Schaum's Outline of Biology",
        "Authors": "By Hademenos, George J. and Fried, George H., Ph.D.",
        "Description": "For top grades and an excellent understanding of biology, this powerful study tool is the best tutor you can have. It's been updated to include the latest advances in the field. Features detailed illustrations of complex biologic systems and processes, and takes students by the hand from the smallest elements of life to the primates. Hundreds of problems with fully-explained solutions cut down on study time and make important points easy to remember. Additional problems with answers let students gauge their progress every step of the way.",
        "Category": " Science , Life Sciences , Biology",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Songbirds: How to Attract Them and Identify Their Songs",
        "Authors": "By Proctor, Noble S.",
        "Description": "Discusses how, why, and when birds choose to sing, offers advice on recognizing the song of individual birds, and presents specific information on one hundred songbirds commonly found in the countryside",
        "Category": " Science , General",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Smart Women Take Risks: Six Steps for Conquering Your Fears and Making the Leap to Success",
        "Authors": "By Lerner, Helene",
        "Description": "Take the plunge. Come out ahead.There are certain risks you might feel uncomfortable making—but calculated risks are necessary to propel you to new heights in your professional and personal development. Every time you choose security over something new, you’re missing new opportunities—and the chance to live a happier, more fulfilled life.As CEO of Creative Expansions, Inc., Helene Lerner coaches women on how to actualize their potential, increase their self-esteem, and reach their goals. Now, in Smart Women Take Risks, she shares her powerful 6-step program, revealing how you too can take smart, strategic risks born from careful thought and intuition-and create positive change in your professional and personal life.Lerner helps you change your perception about risk-taking, and shows you how to determine whether a risk is a Best Bet, a Not Now, or a No Go. You won't risk blindly; you'll go in with your eyes wide open and commit to a doable goal that lets you move forward confidently without the overpowering fear of failure. Lerner gives you expert tools that will help you:Build and maintain a strong support team-a crucial step for successfully creating changeOvercome procrastination, perfectionism, and second-guessingVocalize your success (yes, it's ok to brag!)Keep your accomplishments “green” by continuing to build on themApply these risk-taking principles to other areas of your lifeLerner shares inspiring stories and tips from women who stepped out of their own comfort zones, took leaps, and moved ahead with faith and confidence. she shows you how to harness the opportunities in your own life--and take risks that will push you to greater heights of success.",
        "Category": " Psychology , Emotions",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Nana (Penguin Classics)",
        "Authors": "By Zola, Emile",
        "Description": "Prompted by his theories of heredity and environment, Zola set out to show Nana, \"the golden fly,\" rising out of the underworld to feed on society—a predetermined product of her origins. Nana's latent destructiveness is mirrored in the Empire's, and they reflect each others' disintegration and final collapse in 1890.Built around the book's scientific skeleton is a powerful, sensual atmosphere, and a rich use of words which elevate the novel beyond the realistic platform into a \"poem of male desires.\"",
        "Category": " Fiction , Classics",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1972"
        }
    },
    {
        "Title": "Do-It-Yourself Decorating (RD Home Handbooks)",
        "Authors": "By Dubern, Roger (EDT) and McGowan, John",
        "Description": "Filled with easy-to-follow techniques, creative suggestions, and tips on media and materials for individuals of all skill levels",
        "Category": "",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Rolling Thunder in a Gentle Land: The Vietnam War Revisited (Companion)",
        "Authors": "By Wiest, Andrew A. (EDT)",
        "Description": "From the Introduction In the end, then, the Vietnam War was a conflict of myriad complexities. It was a colonial war and a regional war. It was a total war and a limited war. It was a civil war, an insurgency and a conventional war - and indeed it varied from one form to another at different times and in different places. It was a war in mountains, jungles or open rice paddies depending on the location of the battlefield. It was a war of high technology and no technology. It was a war of airpower and a war of footpower. It was a helicopter war and a brown-water war. It was a war won on the battlefield and lost on the homefront. One thing that the Vietnam War was not was simply an American War. It was a war of varying and mutable contexts - a chameleon of constant change. The greatest American failure in the conflict was a failure to understand context. For far too many important American planners the Vietnam War had but one context - the black and white context of the Cold War; a context that begged an inexorable singular military logic and solution. A military solution that was so overly simple that it proved to be no solution at all. ____ The present study takes as its main goal to place the Vietnam War into its proper contexts. Though Rolling Thunder in a Gentle Land cannot pretend to answer all of the nagging questions that still surround the conflict, it can at least begin to pose new questions that have too often been left unasked or ignored. Through the work of a unique collection of historians, journalists, and war participants Rolling Thunder in a Gentle Land also seeks to spark historical debate and research by searching for new contextual answers to questions that many historians had thought long since answered - sometimes calling for a needed revision of the historical orthodoxy of the conflict. Thus the present study proposes to take fresh looks at several of the most important aspects of the Vietnam War and hopes to demonstrate that the field remains one of the most vibrant and important fields available to future historical inquiry of all types by scholars and laymen alike who seek an opportunity to help define a war of unending complexity.CHAPTER HEADS An American war? The French experience. The North Vietnamese experience. The Ho Chi Minh Trail. The war outside Vietnam: Cambodia and Laos. The South Vietnamese experience. The civilian experience. Vietnam ANZACs. US doctrinal critique. The US experience. The river war. The air war. Vietnam tactics. Vietnam in the media. The legacy of war.",
        "Category": " History , Military , Vietnam War",
        "Publisher": "Osprey Publishing",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "A Little Book of Manners for Boys: A Game Plan for Getting Along with Others",
        "Authors": "By Barnes, Emilie, Barnes, Bob, Sparks, Michal (ILT), and Walkup, Janna C.",
        "Description": "Following up the popular title for girls, A Little Book of Manners, Bob and Emilie Barnes show special little boys in your life how good sportsmanship, table manners, and appropriate language create happy times. Lively illustrations by artist Michal Sparks will captivate your favorite little gentleman in the making.",
        "Category": " Juvenile Nonfiction , Boys & Men",
        "Publisher": "Harvest Kids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Bakers Easy Cut-Up Party Cakes (Favorite All Time Recipes)",
        "Authors": "By Baker's",
        "Description": "",
        "Category": "",
        "Publisher": "Pubns Intl Ltd",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Quilts! Quilts!! Quilts!!! The Complete Guide to Quiltmaking: 34 Quilts to Make and Enjoy",
        "Authors": "By McClun, Diana",
        "Description": "",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "McGraw Hill - NTC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Afghans on the double (Crochet treasury)",
        "Authors": "By Anne Van Wagner Childs",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The World's Easiest Guide to Family Relationships (World's Easiest Guides)",
        "Authors": "By Chapman, Gary D. and Southern, Randy",
        "Description": "Family relationships are the most complicated most important relationships in a person's life. Gary Chapman, the best-selling author of The Five Love Languages, offers this handy, yet comprehensive guide to creating and maintaining healthy relationships with your spouse and children. After explaining the basics of communicating and receiving love via the five love languages, Chapman collects treasured insights from his other best-selling books -- Loving Solutions, Five Signs of a Loving Family, The Other Side of Love, Hope for the Separated, Parenting Your Adult Child, and Toward a Growing Marriage.",
        "Category": " Religion , Christian Life , Family",
        "Publisher": "Northfield Publishing",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Core Curriculum for Intravenous Nursing (Books)",
        "Authors": "By Alexander, Mary (EDT), Corrigan, Ann (EDT), and Pelletier, Gloria (EDT)",
        "Description": "",
        "Category": " Medical , Nursing , Medical & Surgical",
        "Publisher": "Lippincott Williams & Wilkins",
        "Price Starting With ($)": "5.45",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Ferret in the Bedroom, Lizards in the Fridge",
        "Authors": "By Wallace, Bill",
        "Description": "Liz, whose zoologist father houses many unusual homeless animals, is running for sixth-grade class president against popular Jo Donna, and after a series of setbacks involving the animals, Liz reconsiders the urgency of winning the election",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Anna and the King of Siam",
        "Authors": "By Landon, Margaret",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books Inc",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Ready for Anything: 52 Productivity Principles for Getting Things Done",
        "Authors": "By Allen, David",
        "Description": "In his bestselling first book, Getting Things Done, veteran coach and management consultant David Allen presented his breakthrough methods to increase efficiency. Now “the personal productivity guru” (Fast Company) shows readers how to increase their ability to work better, not harder—every day. Based on Allen’s highly popular e-newsletter, Ready for Anything offers readers 52 ways to immediately clear your head for creativity, focus your attention, create structures that work, and take action to get things moving.With wit, inspiration, and know-how, Allen shows readers how to make things happen—with less effort and stress, and lots more energy, creativity, and effectiveness. Ready for Anything is the perfect book for anyone wanting to work and live at his or her very best.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "World History, Comprehensive Edition (Non-InfoTrac Version)",
        "Authors": "By Spielvogel, Jackson J. and Duiker, William J.",
        "Description": "This comprehensive introduction to world civilizations covers individual civilizations such as China, India, and Europe, and provides points of comparison between and among these civilizations. It provides breadth and accessibility and contains a wealth of primary source documents, beautiful 4-color maps, and many useful supplements.",
        "Category": " History , General",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "9.98",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Faces of Fire (Star Trek, Book 58)",
        "Authors": "By Friedman, Michael Jan",
        "Description": "Faces Of Fire En route to Alpha Malurian Six to settle a dispute between two religions, the U.S.S. Enterprise? first stops to do a routine check on the progress of a terraforming colony on Beta Canzandia Three -- a colony whose inhabitants include Carol and David Marcus.  While Spock is left behind at the terraforming colony to continue his scientific studies, the rest of the crew heads to Alpha Malurian Six to find the dispute has turned to war.  As Kirk, McCoy, and Scotty search for a solution to end the conflict, a ship piloted by a Klingon faction arrives at the terraforming colony to take control of the facility. When colonists are imprisoned, Spock and David must defeat the Klingons or face certain death...",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Fire on High (Star Trek New Frontier, No 6)",
        "Authors": "By David, Peter",
        "Description": "Lieutenant Robin Lefler's mother died in a shuttle explosion ten years ago. Sois the woman being held prisoner in Thallonian space really her? If it is, what is her connection to the mysteriouswoman holding a weapon that could doomentire worlds? With the lives of billions at stake, Robin Lefler, Captain Calhoun and the crew of the U.S.S. Excalibur must find the answers before time runs out for them and for the struggling remnants of the once-great Thallonian Empire.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Book of English Essays",
        "Authors": "By Williams, W. E. (EDT)",
        "Description": "A survey of British prose presents notable essays by Bacon, Addison, Lamb, Stevenson, Priestley, Huxley, Pritchett, and others",
        "Category": " Fiction , Literary",
        "Publisher": "Viking Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "DK Eyewitness Books: Robot: Discover the Amazing World of Machines from Robots that Play Chess to Systems that Think",
        "Authors": "By Bridgman, Roger",
        "Description": "Take a detailed look at the fascinating world of robots - from the earliest single-task machines to the advanced intelligence of robots with feelings. Young readers will be amazed to learn all that robots can do: perform delicate surgical operations, clean city sewers, work as museum tour guides, or even battle each other in combat. Find out how humans have created these mechanical minds and bodies.",
        "Category": " Juvenile Nonfiction , Technology , Machinery & Tools",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Once Burned (Star Trek New Frontier: The Captain's Table, Book 5)",
        "Authors": "By David, Peter",
        "Description": "There's a bar called \"The Captain's Table,\" where those who have commanded mighty vessels of every shape and era can meet, relax, and share a friendly drink or two with others of their calling. Sometimes abrawl may break out but it's all in the family, more or less. Just remember, the first round of drinks is always paid for with a story...even in Thallonian space.  Six years ago, long before he took command of the Starship Excalibur, a young Starfleet officer named Mackenzie Calhoun served as first officer aboard the U.S.S. Grissom. Then disaster struck, and Calhoun took the blame. A court-martial led to his own angry resignation from Starfleet...or so it appeared. At long last Captain Calhoun reveals the true story behind the greatest tragedy of his life.",
        "Category": " Fiction , Science Fiction , Adventure",
        "Publisher": "Star Trek",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Ortho Start to Finish Decks",
        "Authors": "By Miller, Martin, Erickson, Larry (EDT), Meredith Books, and Ortho Books (EDT)",
        "Description": "A comprehensive guide, covering everything from deck-planning concepts through building skills and everyday maintenance solutions.Complete plans for a variety of deck projects to fit common needs.Packed with helpful tips and insights from professional deck builders who make the most difficult projects seem easy.",
        "Category": " House & Home , Do-It-Yourself , Carpentry",
        "Publisher": "Ortho",
        "Price Starting With ($)": "6.02",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Castle Kidnapped",
        "Authors": "By Dechancie, John",
        "Description": "The magical Castle Perilous malfunctions, sending its guests to wacky worlds such as a planet of golf-crazed dinosaurs and a world of Amazon women",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Romantic Patchwork and Quilting",
        "Authors": "By Vaughan, Ciba",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Castle War!",
        "Authors": "By Dechancie, John",
        "Description": "A year after Castle Perilous' battle with the Hosts of Hell, an evil mirror-version of the Castle materializes, complete with a hostile army of alter egos drawn from the computerized cosmos' 144,000 inverted worlds",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Currier & Ives America Simkin",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "9.02",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Frank Lloyd Wright: American Architect for the Twentieth Century (Gallery of Art Series)",
        "Authors": "By Sommer, Robin Langley",
        "Description": "An impressive, beautifully illustrated volume examines the creations of America's beloved architect, including interior furnishings, stunning private homes, and unique public buildings, with an introduction providing insight into his private life as well as his enduring work.",
        "Category": " Architecture , Individual Architects & Firms , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Nate the Great Stalks Stupidweed",
        "Authors": "By Sharmat, Marjorie Weinman and Simont, Marc (ILT)",
        "Description": "Join the world’s greatest detective, Nate the Great, as he solves the mystery of the missing plant! Perfect for beginning readers and the Common Core, this long-running chapter book series will encourage children to problem-solve with Nate, using logical thinking to solve mysteries!     WILL NATE WEED OUT THE ANSWER?   Nate the Great’s friend Oliver has lost the weed he bought at Rosamond’s ADOPT-A-WEED plant sale. But it’s not just a dandelion or a clover. It’s a Superweed! With his dog, Sludge, Nate must search for clues in the woods, the park, and even the library. But is the biggest clue right under his nose?   Visit Nate the Great and Sludge! NatetheGreatBooks.com   Praise for the Nate the Great Series   ★ “Kids will like Nate the Great.” —School Library Journal, Starred    “A consistently entertaining series.” —Booklist   “Loose, humorous chalk and watercolor spots help turn this beginning reader into a page-turner.” —Publishers Weekly   “Nate, Sludge, and all their friends have been delighting beginning readers for years.” —Kirkus Reviews   “They don’t come any cooler than Nate the Great.” —The Huffington Post",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Simply Elegant",
        "Authors": "By Ed, Food Wine",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Beloved Exile",
        "Authors": "By Godwin, Parke",
        "Description": "Guinevere, the widow of King Arthur, with the aid of Lancelot, Gareth, and Bedivere, attempts to unite her people in the wake of the chaos that followed Arthur's death only to be betrayed and sold into servitude",
        "Category": " Fiction , Historical",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "My Ántonia (Bantam Classic)",
        "Authors": "By Cather, Willa",
        "Description": "\"The best thing I've done is My  Antonia,\" recalled Willa Cather.  \"I feel I've made a contribution to American  letters with that book.\"Ántonia Shimerda returns to Black Hawk, Nebraska, to make a fresh start after eloping with a railway conductor following the tragic death of her father. Accustomed to living in a sod house and toiling alongside the men in the fields, she is unprepared for the lecherous reaction her lush sensuality provokes when she moves to the city. Despite betrayal and crushing opposition, Ántonia steadfastly pursues her quest for happiness—a moving struggle that mirrors the quiet drama of the American landscape.",
        "Category": " Fiction , Classics",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Ripley's Believe It Or Not! Remarkable Revealed",
        "Authors": "By Tibballs, Geoff",
        "Description": "An eye-popping holographic cover is an apt portal to more of the \"world's weirdest facts\" from Ripley's, from animal antics (e.g., a retired film chimp who plays the piano and paints) to anatomical oddities. Also included are championship eaters, a much-pierced fellow, and a man who recreates Old Masters art on dusty car windshields, as well as the classic bearded lady. The amply-illustrated volume also contains a sampling of letters to Robert Ripley from the public for inclusion in his 1929-31 comic strip, and a solicitation for submissions. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Reference , Trivia",
        "Publisher": "Ripley Publishing",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Thunderbirds: Meet the Thunderbirds (Festival Readers)",
        "Authors": "By Ruiz, Aristides (ILT), Giles, Mike (ILT), and Tripathi, Namrata",
        "Description": "The Thunderbirds use high-tech gear in their daring rescue missions. Each device has a unique function that makes it ideal for certain situations. Read and learn about the Thunderbirds' vehicles and gadgets!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Political Racket",
        "Authors": "By Gross, Martin L.",
        "Description": "We blame builders if a home is badly constructed. We blame automakers if a car has to be recalled. But when it comes to government, we put the blame everywhere except where it belongson the heads of American politicians of both parties who run the country.There's no doubt about the mess: high taxes, government waste in multibillions, a weakened middle class, loss of our manufacturing base, trade deficits, corrupt campaign financing, the failure of welfare, and tolerance for corporate high jinks.The political system that worked so well for America is now structurally broken. And the entrenched political class is the villain. Meanwhile the parties have become trade unions for self-serving professional politicians.In The Political Racket, Martin L. Gross, bestselling author of The Government Racket: Washington Waste From A to Z and A Call for Revolution, puts American politicians under a microscope for the first time and finds them finds them sadly lacking.In this hard-hitting investigation, renowned journalist and political analyst Martin L. Gross exposes the secret world of American politicians and outlines a plan to totally reform the system and replace the political class with dedicated citizens.",
        "Category": " Social Science , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Dora and the Rainbow Kite Festival (Ready-To-Read Dora the Explorer - Level 1) (Ready-to-Read, Level 1: Dora the Explorer)",
        "Authors": "By Roper, Robert (ILT) and Ricci, Christine",
        "Description": "A little kite is stuck in a tree. It's up to Dora to help her get free and make it to the rainbow kite festival. But how can they find their way to the festival? Ask Map! This Level 1 Ready-to-Read bookfeatures rebus icons, and the sweet story is perfect for spring, or any time",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Seasons of Your Heart: Prayers and Reflections, Revised and Expanded",
        "Authors": "By Wiederkehr, Macrina",
        "Description": "In this masterpiece of simplicity, Macrina Wiederkehr offers a series of meditations to bring us closer to a \"God for all seasons,\" revised and expanded into this new edition. Designed for daily use as well as for retreats, Seasons of Your Heart is an eloquent and lyrical invitation to journey through the spiritual seasons of wonder, hope, love, mystery, and faith. Macrina Weiderkehr shares her \"seasonal struggle with God\" and encourages us to reconize those same peaks and valleys in our own spiritual life. Using biblical passages, poetry, and excerpts from her journal, Wiederkehr provides meditative ideas and prayers as \"postures\" for realizing and approaching the holy in our daily lives. These reflections and prayers, then, have grown out of a daily listening to God in the changing seasons of  my spiritual life, \"writes the author. \"These reflections have grown out of my conviction that our God is not some Almighty Being beyond us, but a Mystery within.\"",
        "Category": " Religion , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Just Keep Swimming (Step-into-Reading, Step 1)",
        "Authors": "By Lagonegro, Melissa and Atelier Philippe Harchy (ILT)",
        "Description": "Nemo the clownfish is worried that he's not a strong enough swimmer to compete on his school's swim team. But when his friend Dory encourages him to just keep swimming, Nemo realizes that he can do anything he puts his mind to. Based on Disney/Pixar Finding Nemo, this Step 1 Step into Reading leveled reader is perfect for children ages 4 to 6 who are just learning to read on their own.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Curious George The Dog Show (cgtv Reader)",
        "Authors": "By Fallon, Joe and Perez, Monica (ADP)",
        "Description": "Curious George goes to a dog show and comes home with the winning contestants. When George becomes curious about how many dogs are in the apartment, he devises a clever way to find out. This early reader explores the concepts of counting and grouping.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Last Wife of Henry VIII: A Novel",
        "Authors": "By Erickson, Carolly",
        "Description": "From the bestselling and critically acclaimed author of The Hidden Diary of Marie Antoinette comes a powerful new novel about Catherine Parr, The Last Wife of Henry VIII. The least known of Henry VIII's six wives was the cleverest of them all. Alluring, witty, and resourceful, she attracted the king's lust and, though much in love with the handsome Thomas Seymour, was thrown into the intrigue-filled snakepit of the royal court. While victims of the king's wrath suffered torture and execution, Catherine withstood the onslaught, even when Henry sought to replace her with wife number seven. She survived her royal husband, and found happiness with Seymour---but it was shadowed by rivalry with the young Princess Elizabeth, whose affection Seymour coveted. Catherine won the contest, but at great cost.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Return of the Native (Modern Library Classics)",
        "Authors": "By Hardy, Thomas and Theroux, Alexander (INT)",
        "Description": "One of Thomas Hardy's most powerful works, The Return of the Native centers famously on Egdon Heath, the wild, haunted Wessex moor that D. H. Lawrence called \"the real stuff of tragedy.\" The heath's changing face mirrors the fortunes of the farmers, inn-keepers, sons, mothers, and lovers who populate the novel. The \"native\" is Clym Yeobright, who comes home from a cosmopolitan life in Paris. He; his cousin Thomasin; her fiancé, Damon Wildeve; and the willful Eustacia Vye are the protagonists in a tale of doomed love, passion, alienation, and melancholy as Hardy brilliantly explores that theme so familiar throughout his fiction: the diabolical role of chance in determining the course of a life. As Alexander Theroux asserts in his Introduction, Hardy was \"committed to the deep expression of [nature's] ironic chaos and strange apathy, even hostility, toward man.\"",
        "Category": " Fiction , Classics",
        "Publisher": "Modern Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Savage Hope",
        "Authors": "By Edwards, Cassie",
        "Description": "Beautiful and independent Kathia Parish falls in love with Bright Arrow, the Makah chief who rescues her when she falls through the ice of a frozen pond, but her dreams of dancing and her responsibility to her ailing father could threaten their growing love. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Dorchester Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Pooh's Honey Tree (Step-Into-Reading, Step 2)",
        "Authors": "By RH Disney (COR) and Gaines, Isabel",
        "Description": "Pooh is out of honey! So he develops a plan to float up to a beehive with a balloon. He pretends he’s just a little black rain cloud, but the bees aren’t so sure. Will Pooh get some honey in his tummy after all?",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Savage Courage",
        "Authors": "By Edwards, Cassie",
        "Description": "Torn as a child from the Apache to be raised as a white woman, Shoshana returns to the Arizona Territory as a young woman, haunted by a vision of a great golden eagle that had saved her mother from a massacre and is now calling her back to her heritage. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Forest (The Planet Earth Series)",
        "Authors": "By Page, Jake",
        "Description": "Looks at the structure and characteristics of trees, discusses forest fires, describes how trees have adapted to different environments, and identifies industrial uses for trees",
        "Category": " Science , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Oxford Lit Guide To Britain & Ireland",
        "Authors": "By Rh Value Publishing",
        "Description": "Describes and discusses the significance of more than 1200 houses, buildings, towns, institutions, villages, and geographical areas associated with 913 British and Irish authors or literary figures",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "The Turn of the Screw and Other Short Fiction (Bantam Classics)",
        "Authors": "By James, Henry",
        "Description": "To read a story by Henry James is to enter a fully realized world unlike any other—a rich, perfectly crafted domain of vivid language and splendid, complex characters. Devious children, sparring lovers, capricious American girls, obtuse bachelors, sibylline spinsters, and charming Europeans populate these five fascinating nouvelles, which represent the author in both his early and late phases. From the apparitions of evil that haunt the governess in “The Turn of the Screw” to the startling self-scrutiny of an egotistical man in “The Beast in the Jungle,” the mysterious turnings of human behavior are coolly and masterfully observed—proving Henry James to be a master of psychological insight as well as one of the finest prose stylists of modern English literature.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "Savage Moon (Savage (Leisure Paperback))",
        "Authors": "By Edwards, Cassie",
        "Description": "Misshi Bradley finds herself powerfully drawn to Soaring Hawk, a fierce Indian warrior who shows her a passion like she has never known, and as love blossoms between them, she soon discovers that his father is the one who had destroyed her family and must put her trust in Soaring Hawk to help her overcome the tragedies of the past. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Algebra the Easy Way (Easy Way Series)",
        "Authors": "By Downing, Douglas",
        "Description": "Describes and explains uses of equations, polynomials, the binomial formula, exponential functions, logarithms, and much more, with exercises and answers.Over the years, Barron’s popular and widely-used Easy Way books have proven themselves to be accessible self-teaching manuals. They have also found their way into many classrooms as valuable and easy-to-use textbook supplements. The titles cover a wide variety of both practical and academic topics, presenting fundamental subject matter so that it can be clearly understood and provide a foundation for more advanced study. Easy Way books fulfill many purposes. They help students improve their grades, serve as good test preparation review books, and provide readers working outside classroom settings with practical information on subjects that relate to their occupations and careers. All Easy Way books include review questions and mini-tests with answers. All new Easy Way editions feature type in two-colors, the second color used to highlight important study points and topic heads.",
        "Category": " Mathematics , Algebra , Intermediate",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Hollywood: A Celebration!",
        "Authors": "By Thomson, David",
        "Description": "From the birth of the film industry in the dusty village of Hollywood 1905, to the computer-generated special effects extravaganzas of today; from the days when the big studios reigned supreme to the rise of the independent film; from the innovative directors who shared their visions to the talented actors who captured out hearts -- Hollywood: A Celebration! chronicles the enduring fascination of movies and movie stars over the last 100 years. Featuring 640 pages and over 750 photographs -- many of them published here for the first time -- this comprehensive work is an exhilarating journey into the heart of the world's entertainment capital. Hollywood: A Celebration offers an unprecedented look at American film, the preeminent art form of modern times. The Hollywood phenomenon is documented through stunning photography -- including dramatic film stills from hundreds of movies; glamorous studio portraits of actors from the era of the star system; candid, behind-the-scenes shots from movie sets and sound stages; graphic movie posters; and images of the ever-stylish Hollywood society -- drawn largely from the renowned Kobal collection, one of the most important movie-still archives in the world. Noted film critic David Thomson provides insightful narrative commentary for each photograph, as well as an incisive introduction.",
        "Category": " Performing Arts , Film & Video , History & Criticism",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "9.38",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Arthurian Book of Days: The Greatest Legend in the World Retold Throughout the Year",
        "Authors": "By Matthews, John and Matthews, Caitlin",
        "Description": "Provides brief selections from the story of King Arthur for each day of the year, and includes a chronological listing of all of the events of the Arthurian cycle",
        "Category": " Fiction , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Let's Do Lunch: You'll Never Have to Diet Again",
        "Authors": "By Wilson, Roger Troy",
        "Description": "Roger Troy Wilson weighed 425 pounds and had a 5-foot waist. He had given up on losing weight and prayed that he would die and go to Heaven.After fifteen years of experimenting with different foods and eating patterns, he discovered how to actually have fun losing weight easily---almost the complete opposite of most diets. He lost 230 pounds and 24 inches from his waist.Today Wilson has maintained his weight loss for years. \"You do not need to exercise or count carbs. You can do it without portioning and shakes and chemicals,\" says Wilson. InLet's Do Lunch, he reveals: the dumbest thing we all do that keeps us from losing weightwhich \"non-fattening\" foods are actually fatteningspecial ways to eliminate cravingswhere to go and what to get when you want to eat something quickOnce you've read Let's Do Lunch, you'll never think of eating any other way.",
        "Category": " Health & Fitness , Diet & Nutrition , Weight Loss",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Gettysburg: The Story Behind the Scenery",
        "Authors": "By Davis, William C. and Muench, David",
        "Description": "",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Kc Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "The Serpent Prince",
        "Authors": "By Hoyt, Elizabeth",
        "Description": "WHEN THE DEVIL MEETS AN ANGELCountry bred Lucy Craddock-Hayes is content with her quiet life. Until the day she trips over an unconscious man - a naked unconscious man - and loses her innocence forever.HE CAN TAKE HER TO HEAVENViscount Simon Iddesleigh was nearly beaten to death by his enemies. Now he's hell-bent on vengeance. But as Lucy nurses him back to health, her honesty startles his jaded sensibilities - even as it ignites a desire that threatens to consume them both.OR TO HELLCharmed by Simon's sly wit, urbane manners, and even his red-heeled shoes, Lucy falls hard and fast for him. Yet as his honor keeps him from ravishing her, his revenge sends his attackers to her door. As Simon wages war on his foes, Lucy wages her own war for his soul using the only weapon she has - her love.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Reuben and the Fire",
        "Authors": "By Good, Merle and Moss, P. Buckley (ILT)",
        "Description": "Reuben, an Amish boy with five sisters, witnesses the burning of a neighbor's barn and experiences the excitement of the barnraising that follows.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Good Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Living Longer For Dummies",
        "Authors": "By Bortz, Walter M., II",
        "Description": "What’s the average human life span...72 years...78 years? Actually, science has determined that humans were designed to live 120 years, and that, until now, most people died too soon. It’s also now clear that most of the maladies we commonly associate with aging, such as frailty, senility, and arthritis aren’t part of nature’s plan, but the result of other factors such as bad nutrition, disease ,and disuse. Best of all is the news that, no matter how old you are or what shape you’re in, you can take steps to reverse the aging process that has already occurred in you and to slow your rate of aging in the future.You’re never too old–or too young–to begin living a longer, healthier life, and Living Longer For Dummies can show you how. Written by a leading national expert on aging, it’s packed with life-changing tips on nutrition, exercise, attitude and behavior, that can help enhance and sustain your physical and psychological well- being to age 100 and beyond. You’ll discover how to:Slow your rate of agingReverse many of the effects of agingAvoid maladies associated with ageKeep your mind and senses sharpMaintain limberness and muscle toneKeep your energy level highRebound from illnessStay sexually activeDr. Bortz shatters common myths about aging and explains, in plain English, what science now knows about the normal aging process in humans. And he explores a wide range of life-prolonging topics, including:Getting good health careExercising to stay healthy for lifeEating right for a long lifeGetting adequate rest and relaxationUsing alternative medicine and exercise techniquesMaintaining brain-powerHaving sex to prolong your life and coping with sexual difficultiesHandling health crisesThe number of people age 100 and older increases a whopping 8 percent every year in the United States? If you choose to, you can become one of them someday. Let Living Longer For Dummies show you how.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Complete Short Stories Volume 2",
        "Authors": "By Bierce, Ambrose",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Taming of the West: Age of the Gunfighter : Men and Weapons on the Frontier 1840-1900",
        "Authors": "By Rosa, Joseph G.",
        "Description": "The illustrated sequel to Native Americans and Native American Frontier describes the lives and exploits of such legendary gunfighters as Bat Masterson, Billy the Kid, Jesse James, and Wild Bill Hickok.",
        "Category": "",
        "Publisher": "Smithmark Publishers, Inc.",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Hoops",
        "Authors": "By Myers, Walter Dean",
        "Description": "All eyes are on seventeen-year-old Lonnie Jackson while he practices with his team for a city-wide basketball Tournament of Champions. His coach, Cal, knows Lonnie has what it takes to be a pro-basketball player, but warns him about giving in to the pressure. Cal knows because he, too, once had the chance--but sold out.As the Tournament nears, Lonnie learns that some heavy bettors want Cal to keep him on the bench so that the team will lose the championship. As the last seconds of the game tick away Lonnie and Cal must make a decision. Are they willing to blow the chance of a lifetime?",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "The Glass Harmonica",
        "Authors": "By Marley, Louise",
        "Description": "The life of Eilish Eam, an orphaned street musician surviving on pennies in eighteenth-century London, changes forever thanks to intercession of Benjamin Franklin and Erin Rushton, a classical musician from Seattle in the year 2018, who becomes haunted by visions of a young girl from the past who desperately needs her help. Reprint.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Self-Study Guide for Critical Care Nursing",
        "Authors": "By Carolyn M. Hudak",
        "Description": "",
        "Category": "",
        "Publisher": "Lippincott Williams & Wilkins",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Anne of the Island",
        "Authors": "By MONTGOMERY, L.M.",
        "Description": "",
        "Category": "",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Angel Kisses: Little Touches of Heaven",
        "Authors": "By Kuck, Sandra",
        "Description": "",
        "Category": " Religion , Christianity , Literature & the Arts",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "McClane's Secrets of Successful Fishing",
        "Authors": "By McClane, Albert Jules",
        "Description": "This illustrated, comprehensive guide details the five principal fishing techniques, with step-by-step lessons for each angling method, up-to-date descriptions of every type of tackle and gear, and invaluable tips.",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1980"
        }
    },
    {
        "Title": "Hoofbeats: Katie and the Mustang #1",
        "Authors": "By Duey, Kathleen",
        "Description": "Orphaned at age six and taken in by a heartless couple, nine-year-old Katie Rose spends her days doing chores and dreaming of going west to find her Uncle Jack. Then Mr. Stevens brings home an unbroken Mustang, and Katie's world changes. Katie is drawn to the horse's wildness, and he seems to sense her need for companionship. So when Katie learns that the Stevenses plan to join the expansion West&150without her or the Mustang&150she makes a desperate decision to go on her own. And she will not leave the Mustang behind.",
        "Category": " Juvenile Fiction , Historical , United States , 19th Century",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "National Museum of the American Indian: A Souvenir Book",
        "Authors": "By National Geographic",
        "Description": "",
        "Category": "",
        "Publisher": "National Geographic Soc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Digitizing Your Family History",
        "Authors": "By McClure, Rhonda R.",
        "Description": "Preserve Your Family's Precious Heirlooms!Your interest may be in the past, but permanently preserving your family's history relies on today's technology. If you have limited knowledge of computer equipment or feel uncomfortable using it, Digitizing Your Family History will teach you easy methods for choosing and using scanners, copiers, digital cameras, and software to keep and share your work with others.Use your computer for more than a filing system! With Digitizing Your Family History you'll learn to:Use your scanner to create duplicates of old photos, tintypes, fragile papers, slides, and negatives.Choose a digital camera that's right for genealogy projects and use each feature like a pro.Master the software fundamentals needed to manipulate the quality and composition of photos, preserve your audio- and videotapes through your computer, safely store your files, and share them electronically with others.Use your personal digital assistant (PDA) to take your lineage, photos, and even family movies with you wherever you go.Today's technology makes researching and preserving your genealogy easier and more fun than ever before. Using your computer and its peripherals may have been daunting - until now! Renowned genealogist and computer expert Rhonda R. McClure takes the mystery out of the many ways you can use your computer to record, preserve, and share your family's legacies with Digitizing Your Family History.",
        "Category": " Reference , Genealogy & Heraldry",
        "Publisher": "Family Tree Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Goat Bell, Still & Sweets",
        "Authors": "By Trevillian, Bill, Walls, Brittany F.",
        "Description": "",
        "Category": "",
        "Publisher": "Van Doren Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "The Simon and Schuster International Pocket Food Guide",
        "Authors": "By Crewe, Quentin",
        "Description": "Surveys a variety of world cuisines, describes the ingredients and preparation of characteristic dishes, and gives advice on dining in foreign lands",
        "Category": " Cooking , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "Covered Bridges Of The Middle Atlantic States",
        "Authors": "By ALLEN",
        "Description": "",
        "Category": "",
        "Publisher": "Bonanza Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Travel Guide USA",
        "Authors": "By Maynard, Jill (EDT)",
        "Description": "Features 198 detailed maps of the country, including descriptions of selected attractions.",
        "Category": " Travel , Reference",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Legal Aspects of Health Information Management (The Health Information Management Series)",
        "Authors": "By McWay, Dana C.",
        "Description": "This text provides a comprehensive understanding of the legal principles governing health information management today. Information is organized into three main areas: a study of the legal system and legal procedures; confidentiality issues related to the use of patient-specific health information; and specialty concerns in health information management, such as healthcare fraud and abuse. This second edition of Legal Aspects of Health Information Management features updated Health Insurance Portability and Accountability Act (HIPAA) content and a deeper examination of the impact e-mail, digital imaging, telemedicine and the Internet are having on the HIM field. Written by a lawyer who is also a health information management professional in a manner accessible by those without legal training.",
        "Category": " Medical , Administration",
        "Publisher": "Delmar Cengage Learning",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Inside Al Qaeda: Global Network of Terror",
        "Authors": "By Gunaratna, Rohan",
        "Description": "An incisive study of the notorious terrorist organization examines the leadership, ideology, tactics, and finances of Al Qaeda; discusses how the organization trains fighters; and outlines the international response that will be necessary to destroy the organization. Reprint.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Legends Lake",
        "Authors": "By Ross, JoAnn",
        "Description": "“JoAnn Ross triumphs again!” said Romantic Times Book Reviews of Fair Haven. Now the talented author returns to the bewitching Irish countryside in this irresistible tale of love's extraordinary possibilities.In the exclusive world of horse racing, Alec MacKenna is known as a hardheaded trainer who cares more for an animal's welfare than the financial bottom line. After a public altercation with a callous owner leaves his career on the brink of ruin, Alec's only chance for redemption is Legends Lake, a thoroughbred with Triple Crown potential and a dangerous problem that could end both of their careers. Alec escorts the colt from the bluegrass hills of Kentucky to the emerald pastures of Ireland to meet the woman who bred him, in hopes that she may have the answers that will save them. Kate O'Sullivan is happy to see her beloved horse come home, even under such disturbing circumstances. In spite of the irascible Yank who came with him, she has the feeling that something in her life is about to change forever. As Alec and Kate work to unravel the mystery of Legends Lake, they discover their shared concern for the troubled racehorse could turn into something extraordinary for each other.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Christmas Party: An Anthology (By Request)",
        "Authors": "By Denison, Janelle and Bond, Stephanie",
        "Description": "Features Stephanie Bond's Naughty or Nice?, in which a corporate hatchet man mixes business with pleasure when he investigates a sexy general manager, and Janelle Denison's Christmas Fantasy, in which a professional escort finds himself intrigued by his sassy new employer. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin By Request 2's",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "I just bought a Digital Camera, Now What?!: Great Digital Picrures/Transfer Photos to Your PC/ E-Mail Photos (Now What?! Series)",
        "Authors": "By Johnson, Dave",
        "Description": "Join the digital revolution and take better pictures than you've ever dreamed possible. Intimidating technical terms become easy to understand, and forbidding bells and whistles become easy to manipulate. With detailed illustrations, see how the camera works. Learn to use memory cards. Then master the art of editing pictures on your PC, including special editing effects to enhance a photo's mood, transform its background, or delete clutter. Quickly, you're ready to print pictures on your printer and e-mail them to your friends. Later sections show you how easy it is to add accessories such as close-up, telephoto, and wide-angle lenses, remote controls, and software for editing and storage. Along the way: first-person accounts of \"disasters and how I fully recovered.\"",
        "Category": " Photography , Techniques , Equipment",
        "Publisher": "Silver Lining",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Fun-To-Learn Bible Lessons: Preschool",
        "Authors": "By Paulson, Nancy",
        "Description": "",
        "Category": "",
        "Publisher": "Group Pub Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "The Joe Williams Baseball Reader: The Glorious Game, from Ty Cobb and Babe Ruth to the Amazing Mets : 50 Years of Baseball Writing",
        "Authors": "By Williams, Joe (EDT)",
        "Description": "Gathers essays about Honus Wagner, John McGraw, Ty Cobb, Connie Mack, Walter Johnson, Babe Ruth, Joe Jackson, and Casey Stengel",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Special Diet Solutions: Healthy Cooking Without Wheat, Gluten, Dairy, Eggs, Yeast, or Refined Sugar",
        "Authors": "By Fenster, Carol Lee",
        "Description": "",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Savory Palate, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The U.S. Army in World War II: The Stories Behind the Photos",
        "Authors": "By Crawford, Steve",
        "Description": "Troops of the 82nd Airborne Division look over the wreckage of one of their gliders during Operation Market Garden; two soldiers lie dead. A Marine Corps howitzer crew opens fire on a cave full of Japanese soldiers on Tinian. Three German soldiers, caught operating as spies during the Battle of the Bulge, face a U.S. Army firing squad. Weary Marines get a brief rest amid the utter devastation of Tarawa. All such World War II photographs demand further explanation.Each book in the series The Stories Behind the Photos” takes sixty stunning black-and-white photographs and tells their stories in two-page spreads. Accompanying each photo is a reduced version containing call-out numbers keyed to the caption’s text. This detailed 200-word caption tells the full story of what’s happening in the photograph, how it fits with the subject matter, and what happened next to the individuals shown. Simple but at the same time very effective, each book in the series combines the broad sweep of military events with unique human interest stories. The Stories Behind the Photos” series will appeal to military buffs and casual readers alike.",
        "Category": " History , Military , World War II",
        "Publisher": "POTOMAC BOOKS",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Own Your Life",
        "Authors": "By Failla, Don",
        "Description": "",
        "Category": "",
        "Publisher": "Sound Concepts, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2018"
        }
    },
    {
        "Title": "Justin Morgan Had a Horse",
        "Authors": "By Henry, Marguerite and Dennis, Wesley (ILT)",
        "Description": "Joel Goss knows that Little Bub is a special colt, even though he's a runt. And when schoolteacher Justin Morgan asks Joel to break the colt in, Joel is thrilled! Soon word about Little Bub has spread throughout the entire Northeast -- this spirited colt can pull heavier loads than a pair of oxen. And run faster than thoroughbreds!   This is the story of the little runt who became the father of the world-famous breed of American horses -- the Morgan.",
        "Category": " Juvenile Fiction , Animals , Horses",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Lion King: A Read-Aloud Storybook",
        "Authors": "By Baker, Lisa (EDT)",
        "Description": "The complete retelling of favorite Disney movies in a true read-aloud style.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "About Face",
        "Authors": "By Michaels, Fern",
        "Description": "",
        "Category": "",
        "Publisher": "Zebra Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "A Woman's Heart",
        "Authors": "By Ross, JoAnn",
        "Description": "Cynical, bitter, and disillusioned with life, Quinn Gallagher reluctantly journeys to Castlelough, Ireland, where he comes face to face with Nora Fitzgerald, a beautiful young widow whose generous heart transforms his life. Reissue.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Last Words: A Novel of Suspense",
        "Authors": "By Stewart, Mariah",
        "Description": "From New York Times bestselling author Mariah Stewart comes a novel of sexy romantic suspense for fans of Nora Roberts, Catherine Coulter, and Karen Robards.THIS KILLER TAKES THEIR BREATH AWAY.  A nine-year veteran of the FBI, special agent  Mia Shields thinks she’s seen it all. But nothing prepares her for the terror that  descends upon the idyllic bayside community of St. Dennis, on Maryland’s Eastern  Shore, where a depraved killer has left a grisly surprise for Chief of Police Gabriel  Beck: the body of an unidentified woman, naked and completely encased in plastic  wrap, stretched across the back-seat of Beck’s car. Hidden in the wrapping is a tape  recording of the victim’s last, gasping words, terrifying evidence of the horror  endured at the hands of a madman. Soon the body count begins to rise as more victims  are found, all gruesomely cocooned, their final pleas also captured on tape. Determined  to catch the sadistic killer, Beck and Mia team up and set a trap–with Mia as bait.  But their prey is closer than they ever could have imagined. Now Beck must race against  time to save Mia from becoming the next victim of a serial killer as elusive as he  is evil.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Realm of Shadows",
        "Authors": "By Drake, Shannon",
        "Description": "Visiting Paris during the opening of a recently discovered ancient tomb, American Tara Mason is plunged into a nightmarish world when an evil force, determined to claim her body and soul, begins stalking her, leading her into the arms of a mysterious man who vows to keep her safe. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Zebra Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "CAPTIVE HEART",
        "Authors": "By Conn, Phoebe",
        "Description": "Celiese, a beautiful slave girl, dreads her task when she is sent, in her mistress's place, to wed the fierce warrior, Mylan",
        "Category": "",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    }
]