[
    {
        "Title": "First Meetings in the Enderverse",
        "Authors": "By Card, Orson Scott",
        "Description": "02 Welcome to the Enderverse.When \"Ender's Game\" was first published as a novella twenty-five years ago few would have predicted that it would become one of the most successful ventures in publishing history. Expanded into a novel in 1985, Ender's Game won both the Hugo Award and the Nebula Award for Best Novel. Never out of print and translated into dozens of languages, it is the rare work of fiction that can truly be said to have transcended a genre. Ender's Game and its sequels have won dozens of prestigious awards and are as popular today among teens and young readers as adults.First Meetings is a collection of three novellas-plus the original \"Ender's Game\"-that journey into the origins and the destiny of one Ender Wiggin.\"The Polish Boy\" begins in the wake between the first two Bugger Wars when the Hegemony is desperate to recruit brilliant military commanders to repel the alien invasion. In John Paul Wiggin-the future father of Ender -they believe they may have found their man. Or boy. In \"Teacher's Pest\"-a novella written especially for this collection-a brilliant but insufferably arrogant John Paul Wiggin, now an American university student, matches wits with an equally brilliant graduate student named Theresa Brown. It is many years since the end of the Bugger Wars in \"The Investment Counselor.\" Ender's reputation as a hero and savior has suffered a horrible reversal. Banished from Earth and slandered as a mass murderer, twenty-year-old Andrew Wiggin wanders incognito from planet to planet as a fugitive. Until a blackmailing tax inspector compromises his identity and threatens to expose Ender the Xenocide.Also reprinted here is the original landmark novella, \"Ender's Game,\" which first appeared in 1977. Fully illustrated, First Meetings is Orson Scott Card writing at the height of his considerable power about his most compelling character. Welcome to the Enderverse.When \"Ender's Game\" was first published as a novella twenty-five years ago few would have predicted that it would become one of the most successful ventures in publishing history. Expanded into a novel in 1985, Ender's Game won both the Hugo Award and the Nebula Award for Best Novel. Never out of print and translated into dozens of languages, it is the rare work of fiction that can truly be said to have transcended a genre. Ender's Game and its sequels have won dozens of prestigious awards and are as popular today among teens and young readers as adults.First Meetings is a collection of three novellas-plus the original \"Ender's Game\"-that journey into the origins and the destiny of one Ender Wiggin.\"The Polish Boy\" begins in the wake between the first two Bugger Wars when the Hegemony is desperate to recruit brilliant military commanders to repel the alien invasion. In John Paul Wiggin-the future father of Ender -they believe they may have found their man. Or boy. In \"Teacher's Pest\"-a novella written especially for this collection-a brilliant but insufferably arrogant John Paul Wiggin, now an American university student, matches wits with an equally brilliant graduate student named Theresa Brown. It is many years since the end of the Bugger Wars in \"The Investment Counselor.\" Ender's reputation as a hero and savior has suffered a horrible reversal. Banished from Earth and slandered as a mass murderer, twenty-year-old Andrew Wiggin wanders incognito from planet to planet as a fugitive. Until a blackmailing tax inspector compromises his identity and threatens to expose Ender the Xenocide.Also reprinted here is the original landmark novella, \"Ender's Game,\" which first appeared in 1977. Fully illustrated, First Meetings is Orson Scott Card writing at the height of his considerable power about his most compelling character.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Total Recall (A V.I. Warshawski Novel)",
        "Authors": "By Paretsky, Sara",
        "Description": "The bestselling V.I. Warshawski novels have dazzled readers and earned the acclaim of critics everywhere. “V.I. Warshawski rules,” writes Newsweek, crowning her “the most engaging woman in detective fiction.” Of V.I.’s creator, the Chicago Tribune says “Sara Paretsky has no peer.” Now Paretsky brings her incomparable storytelling brilliance to her most powerful Warshawski novel yet. Total Recall follows the Chicago P.I. on a road that winds back more than fifty years — and into an intricate maze of wartime lies, heartbreaking secrets, and harrowing retribution. For V.I., the journey begins with a national conference in downtown Chicago, where angry protesters are calling for the recovery of Holocaust assets. Replayed on the evening news is the scene of a slight man who has stood up at the conference to tell an astonishing story of a childhood shattered by the Holocaust — a story that has devastating consequences for V.I.’s cherished friend and mentor, Lotty Herschel. Lotty was a girl of nine when she emigrated from Austria to England, one of a group of children wrenched from their parents and saved from the Nazi terror just before the war broke out. Now stunningly — impossibly — it appears that someone from that long-lost past may have returned. With the help of a recovered-memory therapist, Paul Radbuka has recently learned his true identity. But is he who he claims to be? Or is he a cunning impostor who has usurped someone else’s history ... a history Lotty has tried to forget for over fifty years?As a frightened V.I. watches her friend unravel, she sets out to help in the only way she can: by investigating Radbuka’s past. Already working on a difficult case for a poor family cheated of their life insurance, she tries to balance Lotty’s needs with her client’s, only to find that both are spiraling into a whirlpool of international crime that stretches from Switzerland and Germany to Chicago’s South Side. As the atrocities of the past reach out to engulf the living, V.I. struggles to decide whose memories of a terrible war she can trust, and moves closer to a chilling realization of the truth — a truth that almost destroys her oldest friend.With fierce emotional power, Sara Paretsky has woven a gripping and morally complex novel of crime and punishment, memory and illusion. Destined to become a suspense classic, Total Recall proves once again the daring and compelling genius of Sara Paretsky.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Off Season : Living the retirement dream",
        "Authors": "By White-Bowden, Susan",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Baltimore Sun",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Everything Happens for a Reason: Finding the True Meaning of the Events in Our Lives",
        "Authors": "By KIRSHENBAUM, Mira",
        "Description": "An inspirational guide to understanding the meaning of life's challenges features practical diagnostic tests geared to help readers find comfort and emotional healing in the face of painful losses, illness, and other difficulties. 20,000 first printing.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Something Borrowed: A Novel",
        "Authors": "By Giffin, Emily",
        "Description": "Something BorrowedEmily Giffin The smash-hit debut novel for every woman who has ever had a complicated love-hate friendship.Rachel White is the consummate good girl. A hard-working attorney at a large Manhattan law firm and a diligent maid of honor to her charmed best friend Darcy, Rachel has always played by all the rules. Since grade school, she has watched Darcy shine, quietly accepting the sidekick role in their lopsided friendship. But that suddenly changes the night of her thirtieth birthday when Rachel finally confesses her feelings to Darcy's fiance, and is both horrified and thrilled to discover that he feels the same way. As the wedding date draws near, events spiral out of control, and Rachel knows she must make a choice between her heart and conscience. In so doing, she discovers that the lines between right and wrong can be blurry, endings aren't always neat, and sometimes you have to risk everything to be true to yourself.",
        "Category": " Fiction , Women",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "500 3-Ingredient Recipes: Simple and Sensational Recipes for Everyday Cooking",
        "Authors": "By Hildebrand, Robert and Hildebrand, Carol",
        "Description": "From Gourmet?s ?Four Ingredients? monthly feature to Better Homes and Gardens? ?Five-Ingredient Recipes? to Rozane Gold?s best-selling ?1-2-3? series of books, the hook of a finite number of ingredients appeals to cooks of all skill levels.  From the upscale to the downmarket, cooks everywhere are looking for simple yet delicious recipes for everyday cooking and entertaining.  Bob Hildebrand, chef of a first-class inn in Vermont, and his sister Carol, a food writer, have teamed up to develop 500 recipes that use only three ingredients (plus the ?free? ingredients of water, oil or butter, salt, and pepper).  This book will feature delicious recipes like:  * Braised Chicken with Leeks * Sinful Chocolate Torte * Popovers * Strawberries Romanoff",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Fair Winds Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The Photographic History of the Civil War, Volume 2: Decisive Battles; The Calvary",
        "Authors": "By Oppel, Frank (EDT) and Rodenbough, Theophilus F. (EDT)",
        "Description": "Volume II.The Photographic History of the Civil War was first published in 1911 to commemorate the fiftieth anniversary of the great conflict. Extremely popular then, it has become a rare book. Here, in five double volumes, is the complete and unabridged original edition, text and photographs carefully reproduced in the original format and full size.The thousands of photographs contained within are remarkable in their immediacy, spontaneity, and authenticity. They demonstrate the power of the camera as well as the importance of the photographer.   They are a unique record of one of the greatest conflicts in the history of mankind. These pictures can be viewed as art, as history and as journalism. Covering every aspect of the war --from the front to weapons, from tactics to the wounded, from everyday life to grief, from victory to defeat—these volumes are a testament to a mighty conflict and to the great nation which emerged from it.This volume describes the decisive battles of the Civil War, and the Cavalry on both sites of the battle.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Blue & Grey Press",
        "Price Starting With ($)": "8.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Super Life Super Health",
        "Authors": "By Editor",
        "Description": "",
        "Category": "",
        "Publisher": "FC&A Medical Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Clementine Churchill: The Biography of a Marriage",
        "Authors": "By Soames, Mary",
        "Description": "The Churchills' youngest daughter recounts her mother's early life and her fifty-seven-year marriage to Winston Churchill, drawing on their letters to chronicle their private and public lives",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1982"
        }
    },
    {
        "Title": "Unstuck: A Tool for Yourself, Your Team, and Your World",
        "Authors": "By Yamashita, Keith and Spataro, Sandra, Ph.D.",
        "Description": "Getting unstuck is an integral part of business - and life, for that matter. Often people get stuck because the most ambitious and rewarding work brings with it the most challenges. The question is, how long can you afford to be stuck and what are you going to do about it?UNSTUCK is a practical guide to turn to for inspiration and immediate solutions. It's not just meant to be read; it's meant to be enacted. And it's based on the proven results and practices the authors have discovered working with IBM, Sony, Hewlett-Packard, Nike, Gap Inc., and a host of other companies and leaders.Whether you need to step back to move forward, motivate a struggling team, change your goals, or create a clearer vision, UNSTUCK helps you diagnose your situation, identify the most important challenges, and implement the right tools and techniques to get things moving again.",
        "Category": " Business & Economics , Management",
        "Publisher": "Portfolio Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Alcohol and social responsibility;: A new educational approach",
        "Authors": "By McCarthy, Raymond Gerald",
        "Description": "",
        "Category": "",
        "Publisher": "Crowell",
        "Price Starting With ($)": "12.93",
        "Publish Date": {
            "Month": "January",
            "Year": "1949"
        }
    },
    {
        "Title": "RAGNAROK #1",
        "Authors": "By Na, Lauren, Yi, Myong-jin, Lee, Myung-Jin, and Knaak, Richard A.",
        "Description": "In the time when Ragnarok, the fall of the gods, has been predicted to occur, Fenris Fenrir is on a desperate quest to locate the reincarnated Balder, to seek his help in changing the world, before the valkyries find him and civilization is doomed.",
        "Category": " Young Adult Fiction , Legends, Myths, Fables , General",
        "Publisher": "TokyoPop",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "It's Not How Good You Are, It's How Good You Want to Be: The world's best-selling book by Paul Arden",
        "Authors": "By Arden, Paul",
        "Description": "\"It’s Not How Good You Are, It’s How Good You Want to Be is a handbook of how to succeed in the world: a pocket bible for the talented and timid alike to help make the unthinkable thinkable and the impossible possible.The world’s top advertising guru, Paul Arden, offers up his wisdom on issues as diverse as problem solving, responding to a brief, communicating, playing your cards right, making mistakes, and creativity – all endeavors that can be applied to aspects of modern life.This uplifting and humorous little book provides a unique insight into the world of advertising and is a quirky compilation of quotes, facts, pictures, wit and wisdom – all packed into easy&hyphen;to&hyphen;digest, bite&hyphen;sized spreads. If you want to succeed in life or business, this book is a must.\"",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Phaidon Press",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "A Christmas to Remember (Bob the Builder)",
        "Authors": "By Silverhardt, Lauryn and Treahy, Iona",
        "Description": "CAN HE DO IT? YES, HE CAN!  Bob's twin brother, Tom, is visiting for Christmas, and Bob couldn't be happier! Lennie and the Lazers will be performing on Christmas Eve, and Bob has a lot to do around town before his brother arrives. But when Tom misses the last boat, will Bob be spending Christmas without his brother? Not if Lennie can help it! Join Bob and his friends for A Christmas to Remember!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Spirit Capture: Photographs from the National Museum of the American Indian",
        "Authors": "By Johnson, Tim (EDT) and National Museum of the American Indian (U. S.) (COR)",
        "Description": "Native Americans have been among the most popular subjects of photography since the invention of the medium more than 150 years ago. One of the most assiduous collectors of Native American objects and images was George Gustav Heye, whose vast collections now form the core of the holdings of the Smithsonian's National Museum of the American Indian (NMAI).Spirit Capture brings together more than two hundred of the most compelling images from the NMAI collection with essays from Native and non-Native historians, anthropologists, and curators. Whether depicting runaway Wyandot girls being returned to their boarding school, a Seminole woman sitting at a sewing machine, or a Yaqui man sporting a pair of bandoliers, the photographs in Spirit Capture attest to the adaptive strength of Native Americans in the face of more than a century of profound economic, political, social, and spiritual change.",
        "Category": " Photography , Collections, Catalogs, Exhibitions , General",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Here I Stand: My Struggle for a Christianity of Integrity, Love, and Equality",
        "Authors": "By Spong, John Shelby",
        "Description": "\"If someone had told me years ago that I would create these enormous levels of both appreciation and hostility in my ordained life, I would have been dumbfounded, shocked, and probably deeply hurt. How did it happen? What created the twin emotions of praise and anger, of gratitude and fear? What forces pushed me, compelled me, or led me to play my particular role in the struggle to make the Christian church respond to the issues of our century and indeed to open new dimensions of spirituality to the citizens of this century? That is the story I seek to tell.\"John Shelby Spong has spent a lifetime struggling to discover and create a more just, loving, and authentic Christian faith. Throughout his career as an Episcopal priest and bishop, he has inspired praise and gratitude among the marginalized Christians whose causes he has championed, as well as hostile resistance from traditional and conservative Christians whom he has so boldly challenged. Here I Stand reveals the private side of this very public figure, as Bishop Spong tells the story of the people and events that shaped his thoroughly contemporary yet deeply biblical theology and his commitment to liberal Christian values.Early in his life, Spong witnessed injustices that were instrumental in awakening his moral consciousness. Growing up in the American south of the 1930s, Spong spent his childhood in an environment of racism, fundamentalism, sexism, and homophobia. The church of his time was no exception; its exclusionary attitudes and practices struck the young Southerner as contradictory to the Christianity he encountered in the Bible and heard preached from the pulpit and taught in Sunday school.Rather than becoming disillusioned with the church and dropping out, Spong has devoted himself to reforming it, working to integrate women, blacks, gays, lesbians, and other marginalized Christians fully into the faith community better known for rejecting or marginalizing them. In the process, he has challenged the views of leaders such as Jerry Falwell, John Cardinal 0' Connor, and his own Episcopal hierarchy. He has been honored by many as a hero, while enduring harsh reactions from fundamentalists and those wedded to the status quo. Through it all, Bishop Spong has remained committed to his role as a shepherd to every member of the Christian flock. His courageous efforts have made him an inspirational symbol of a Christian church truly worthy of Jesus and the standard bearer for those who strive to be both contemporary, thinking persons and faithful, enlightened Christians.",
        "Category": " Religion , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Golem",
        "Authors": "By Hyman, Trina Schart (ILT) and Rogasky, Barbara",
        "Description": "In order to protect the Jews of Prague, Rabbi Loew creates Joseph, a golem that only exists to Rabbi Loew, but Rabbi Loew suddenly realizes that his creation has reached into an area reserved by God and will soon have to face the consequences.",
        "Category": " Young Adult Fiction , Fairy Tales & Folklore , Country & Ethnic",
        "Publisher": "Holiday House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Jennifer Murdley's Toad: A Magic Shop Book",
        "Authors": "By Coville, Bruce and Lippincott, Gary A. (ILT)",
        "Description": "Now available in a twentieth anniversary edition, this modern classic has been given a new afterword by the author and stunning new jacket art by Tony DiTerlizzi.Jennifer Murdley would give anything to be beautiful. But then she buys a particularly ugly toad--one who can talk and, in fact, won't shut up--who shows her a thing or two about the meaning of true beauty.• California Young Reader Medal• Children's Choice Award Nominee (in ten states)",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Harcourt Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "How to Pack: Experts Share Their Secrets (Fodor's)",
        "Authors": "By Cardone, Laurel",
        "Description": "How to PackTired of Schlepping?  Get Organized!Aiming to trade your jumbo suitcase for one that's merely medium-size?  Trying to fit everything into a carry-on?  Do you always pack too much, too little, or the wrong thing -- and obsess about it?  This volume is a must-have.Strategies that even an army general would envyFoolproof pretrip to-do listsThe packer's #1 time-saver -- travel kitsHow to arrive wrinkle-free -- it's easier than you think!Tips for packing tricky itemsHelp for moms and dadsCarry-on packing -- all the secretsHow to pack for the way backWhat to take no matter where you're goingHow to avoid the overpacking trapClothing checklists for men, women, and kidsPacking checklists for every kind of tripHow to buy luggageEssential advice on major decisionsQuality check -- how to tell the good from the bad and the merely ugly",
        "Category": " Travel , General",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Dreams of My Russian Summers",
        "Authors": "By Makine, Andrei and Strachan, Geoffrey (TRN)",
        "Description": "Dreams of My Russian Summers tells the poignant story of a boy growing up amid the harsh realities of Soviet life in the 1960s and '70s, and of his extraordinary love for an elegant Frenchwoman, Charlotte Lemonnier, who is his grandmother. Every summer he visits his grandmother in a dusty village overlooking the vast steppes. Here, during the warm evenings, they sit on Charlotte's narrow, flower-covered bacony and listen to tales from another time, another place: Paris at the turn of the century. She who used to see Proust playing tennis in Neuilly captivates the children with stories of Tsar Nicholas's visit to Paris in 1896, of the great Paris flood of 1910, of the death of French president Felix Faure in the arms of his mistress. But from Charlotte the boy also learns of a Russia he has never known, of famine and misery, of brutal injustice, of the hopeless chaos of war. He follows her as she travels by foot from Moscow half the way to Siberia; suffers with her as she tells of her husband - his grandfather - a victim of Stalin's purges; shudders as she describes her own capture by bandits, who brutalize her and left her for dead. Could all this pain and suffering really have happened to his gentle, beloved Charlotte? Mesmerized, the boy weaves Charlotte's stories into his own secret universe of memory and dream. Yet, despite all the deprivations and injustices of the Soviet world, he like many Russians still feels a strong affinity with and \"an indestructible love\" for his homeland.",
        "Category": " Fiction , Literary",
        "Publisher": "Arcade Publishing",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Edward & Sophie: A Royal Wedding",
        "Authors": "By Parkinson, Judy",
        "Description": "",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Dance with Me",
        "Authors": "By Rice, Luanne",
        "Description": "Acclaimed for her insightful depiction of the magic and mystery in everyday life and relationships, Luanne Rice is one of today’s most gifted novelists.  Now the author of eight consecutive New York Times bestsellers delivers her most powerful book yet—the story of a man and woman forced to choose between the past that haunts them and the love that won’t let them go.Jane Porter left the apple orchards of rural Twin Rivers, Rhode Island, years ago, fleeing memories that could tear two families apart.  Now she has been unexpectedly drawn home to her mother and only sister.  Dylan Chadwick has come back, too, shedding the steely exterior he wore as a federal agent in order to follow in the footsteps of his apple-farming father and forget the life he once lived.  Amid this landscape of loss and renewal, a haunting story of converging lives, small-town secrets—and the magical sway of unexpected miracles—unfolds.  Deeply moving and richly told, Dance with Me explores emotional connections at their very core, with keen insights into the lives of mothers and daughters, sisters and lovers that will resonate long after the final page is turned.",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Garden of Tea",
        "Authors": "By Pallan, Nancy Shumaker",
        "Description": "",
        "Category": " Gardening , Herbs",
        "Publisher": "Cedco Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Double Shot (Goldy, Book 12)",
        "Authors": "By Davidson, Diane Mott",
        "Description": "“Today’s foremost practitioner of the culinary whodunit.”—Entertainment Weekly“In the genre of culinary mystery writers, Davidson is a Julia Child among Betty Crockers, and there is no question that Double Shot is her best book.”—Denver PostNew York Times bestseller Diane Mott Davidson is the darling of cozy mystery readers and dedicated foodies the world over. Davidson is really cooking with Double Shot, another tantalizing puzzle featuring her beloved protagonist, accomplished caterer and sleuth Goldy Schulz. Whipping up a rich soufflé of murder and mischief, Davidson has Goldy in a stew once again, when the reemergence of her psychopathic ex-husband and a murder that follows soon after brings chaos into her world. And, as always, many delicious recipes from Goldy’s kitchen are featured as well.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The Kindness of Strangers: A Novel",
        "Authors": "By Kittle, Katrina",
        "Description": "On a quiet street in the suburban Midwest, a popular, seemingly stable family keeps a terrible, dark secret behind closed doors -- a secret that will have life-changing consequences for all who know themSarah Laden, a young widow and mother of two, struggles to keep her family together. Since the death of her husband, her high-school-age son, Nate, has developed a rebellious streak, constantly falling in and out of trouble. Her kindhearted younger son, Danny, though well behaved, struggles to pass his remedial classes. All the while, Sarah must make ends meet by running a catering business out of her home. But when a shocking and unbelievable revelation rips apart the family of her closest friend, Sarah finds herself welcoming yet another young boy into her already tumultuous life.Jordan, a quiet and reclusive elementary-school boy and classmate of Danny&#39;s, has survived a terrible tragedy, leaving him without a family. When Sarah becomes Jordan&#39;s foster mother, a relationship develops that will force her to question the things of which she thought she was so sure. Yet Sarah is not the only one changed by this young boy, and as the delicate balance that holds her family together begins to falter, the Ladens will all face truths about themselves and one another -- and discover the power of love to forgive and to heal.Powerful and poignant, The Kindness of Strangers is a shocking look at how the tragedy of a single family in a small suburban town can affect so many. Katrina Kittle has created a haunting vision of the secret lives of the people we think we know best. Through gripping and heartrending storytelling, The Kindness of Strangers shows that even after the most grave injuries, redemption is always possible.",
        "Category": " Fiction , Psychological",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Back in Control",
        "Authors": "By Bodenhamer, Gregory",
        "Description": "In just thirty days, you can get children to behave the way you want them to. Whether their misbehavior is as minor as letting the dishes pile up and the trash overflow or as traumatic as a drug habit and stealing, Back in Control will enable you to set and enforce rules that your kids will obey.  Back in Control is based on a highly successful program that has helped thousands of parents regain control over their children. Without compromising your values away or kicking the kids out of the house, it offers you the simplest, most effective method of childhood discipline to date. It presents a three-step formula that is perfect for virtually any adult wanting to control children's misbehavior.  Instead of getting caught up in children's arguments and manipulations, Back in Control shows parents how to reestablish their rightful place as bosses of the family. Teachers are able to devote more time to teaching than to disciplining students. Probation officers and social workers working with parents, in addition to managing their caseloads more effectively, are able to permanently stop children from abusing drugs or alcohol, stealing, running away from home, and being truant. Children themselves learn that there are some rules they must obey, whether they want to or not, and they will grow up believing that they can succeed in doing what is required of them.  Power belongs to those who use it. And if you don't, your children will. If your children's problem behavior is out of hand, it's time you got Back in Control.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "From Jesus to Christianity: How Four Generations of Visionaries & Storytellers Created the New Testament and Christian Faith",
        "Authors": "By White, L. Michael",
        "Description": "The path from Jesus to Christianity is not as straight as we might think -- as Dan Brown's sensational The Da Vinci Code hinted at. In herbest-selling books, scholar Elaine Pagels has explored some of the ancient Christian writings that were excluded from the New Testament. Now, for the first time, L. Michael White, one of the world's foremost scholars on the origins of Christianity, provides the complete, astonishing story of how Christianity grew from the personal vision of a humble Jewish peasant living in a remote province of the Roman Empire into the largest organized religion in the world.Many take for granted that the New Testament is a single book representing God's coherent, unwavering word on Jesus and his church. A closer reading reveals not one story, but many. The New Testament is a collection of books -- the result of a variety of influences on a number of faithful but very human visionaries, preachers, and storytellers. The texts contain a wealth of biographies, histories, novels, letters, sermons, hymns, church manuals, and apocalypses, providing a spectrum of views of Jesus, his message, and his movement.Given this diversity of people, stories, and drastically different points of view, how did Christianity ever become what we know it as today? White draws on the most current scholarship to bring alive these ancient people and their debates, showing in depth how their stories were formed into what the world has come to know as the New Testament.Rather than reading the New Testament straight through in its traditional order -- Matthew, Mark, Luke, John, and so on -- White takes a historical approach, looking at the individual books in the sequence in which they were actually written. He explores what these books divulge about the disagreements, shared values, and unifying mission of the earliest Christian communities. White digs through layers of archaeological excavations, sifts through buried fragments of largely unknown texts, and examines historical sources to discover what we can know of Jesus and his early followers.It is this early, hidden history that shaped Christianity as it grew from an errant, messianic movement to a state religion and then into a world religion that has lasted for over two thousand years. White shows how the early debates spurred the evolution of Christianity as we know it. He delves into the arguments over how to understand Jesus as both human and divine, the role of women in the church, the diversity of beliefs among Christian communities, the Gnostic influences, and the political disputes that raged over which books would ultimately be included in the New Testament. Complete with illustrations, photos, charts, and maps, From Jesus to Christianity presents the fullest picture yet of the beginnings of what became the most popular religion on earth.",
        "Category": " Religion , Biblical Criticism & Interpretation , New Testament",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Creating Wealth: Retire in Ten Years Using Allen's Seven Principles of Wealth!",
        "Authors": "By Allen, Robert G.",
        "Description": "With over two million copies of his books in print, Robert G. Allen has become a national phenomenon. His innovative investment strategies have helped thousands create their own wealth, and in this new and revised edition of Creating Wealth you'll discover the Allen way to financial success.  Programmed to think that saving is good, debt and risk-taking bad, we disqualify ourselves from ever having a chance at big money. The first step in creating wealth is to stop thinking poor. Then you're ready to create your own version of the Allen plan, keyed to integrating real estate with other wealth-generating investments.  These principles and others can start you on the path of financial self-reliance:  * The Automatic Pilot Principle * Enormous Profits in Discounted Mortgages * Numismatics: the Secret of the Midas Touch * Liquid Money and Where to Pour It * Insulating Your Assets from Liability and Lawyers",
        "Category": " Business & Economics , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "Black Bear: Seasons in the Wild",
        "Authors": "By Anderson, Tom",
        "Description": "Discusses the characteristics of the black bear as compared to other types of bears, and offers advice on reading signs of an animal's presence, what to do if confronted by a black bear, and how to ensure its survival",
        "Category": " Nature , Animals , Bears",
        "Publisher": "Voyageur Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Wildlife Australia",
        "Authors": "By Lik, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Peter Lik Publishing",
        "Price Starting With ($)": "8.56",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Of Paradise and Power: America and Europe in the New World Order",
        "Authors": "By Kagan, Robert",
        "Description": "From a leading scholar of our country’s foreign policy, the brilliant essay about America and the world that has caused a storm in international circles now expanded into book form.European leaders, increasingly disturbed by U.S. policy and actions abroad, feel they are headed for what the New York Times (July 21, 2002) describes as a “moment of truth.” After years of mutual resentment and tension, there is a sudden  recognition that the real interests of America and its allies are diverging sharply and that the trans-atlantic relationship itself has changed, possibly irreversibly. Europe sees the United States as high-handed, unilateralist, and unnecessarily belligerent; the United States sees Europe as spent, unserious, and weak. The anger and mistrust on both sides are hardening into incomprehension.This past summer, in Policy Review, Robert Kagan reached incisively into this impasse to  force both sides to see themselves through the eyes of the other. Tracing the widely differing histories of Europe and America since the end of World War II, he makes clear how for one the need to escape a bloody past has led to a new set of transnational beliefs about power and threat, while the other has perforce evolved into the guarantor of that “postmodern paradise” by dint of its might and global reach. This remarkable analysis is being discussed from Washington to Paris to Tokyo. It is esssential reading.",
        "Category": " Political Science , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Dancing in the Dark",
        "Authors": "By Clark, Mary Jane",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Double agent",
        "Authors": "By Huminik, John",
        "Description": "",
        "Category": "",
        "Publisher": "New American Library",
        "Price Starting With ($)": "19.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "White Hot",
        "Authors": "By Brown, Sandra",
        "Description": "When she hears that her younger brother Danny has committed suicide, Sayre Lynch relents from her vow never to return to Destiny, the small Louisiana town in which she grew up. She plans to leave immediately after the funeral, but instead soon finds herself drawn into the web cast by Huff Hoyle, her controlling and tyrannical father, the man who owns the town's sole industry, an iron foundry, and in effect runs the lives of everyone who lives there.  As she feared, Sayre learns that nothing has changed. Her father and older brother, Chris, are as devious as ever, and now they have a new partner-in-crime, a canny and disarming lawyer named Beck Merchant, who appears to be their equal in corruption.  Soon, Sayre is thrown in closer contact with Beck and becomes convinced that something more sinister is at play than her father's usual need to dominate people and events. As she sets out to learn just what did happen to Danny, she comes to realize that there are many secrets in Destiny -- secrets that hide decades of pain and anger, and that threaten at any moment to erupt and destroy not only her father and brother, but perhaps Sayre herself.  Underneath the rigid control that the Hoyles exert over the town, trouble is brewing. Old hatreds foster plans for revenge, past crimes resurface, and a maverick deputy sheriff determines that Danny Hoyle's death was not suicide, but murder.  As tensions mount, threatening to ignite a powder keg of long-held hostility, Sayre finds herself inextricably drawn into a struggle with striking laborers, her unscrupulous father, and her own emotions over the love/hate relationship that is growing with Beck, a man apparently with his own agenda, and mysteries of his own.  As she has shown in the dozens of bestselling novels in which she has combined hard-edged suspense with intense emotion, Sandra Brown is a master storyteller, and in her new novel she is at her very best.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Return",
        "Authors": "By Barnes, John and Aldrin, Buzz",
        "Description": "On July 20, 1969, Buzz Aldrin, along with crewmate Neil Armstrong, made history as they placed humankind's first steps on the moon.Now, in The Return, written by award winning novelist John Barnes, Aldrin offers a compelling novel about the opportunities and dangers that confront us today-and shows why we must, and will, seize the challenges before us.When a tragic Shuttle accident kills a world-famous basketball player on his trip into space, a trip that had been planned as a PR coup for the space program, former astronaut Scott Blackstone is out of a job.  Worse, he and his \"Citizen Observer\" program are vilified in the media, and he's being sued for a billion dollars. His older brother, Nick, research chief for a major aerospace firm, persuades Scott's estranged ex-wife, Thalia-a top-ranked attorney-to take on Scott's defense.  Gradually, it begins to appear that the \"accident\" might not have been an accident at all.Meanwhile, as long feared, India and Pakistan go to war-and, worse, Pakistan deploys a nuclear device high in the upper atmosphere, putting the crew of the orbiting International Space Station in iminent danger of destruction by radiation exposure.  While the world's space vehicles are grounded by the radiation storm set off by the detonation, only a few weeks remain to rescue the crew, and there's no known way to do it.  Save, perhaps, for a secret project of Nick's...The Return is a story of outsized characters, global crises, and big, daring ideas...and-as told by Buzz Aldrin-it carries a ring of truth.  He's been there.  He's done that.  And he's already helped change the world.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "9.82",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Marriage Bed",
        "Authors": "By Dain, Claudia",
        "Description": "When destiny brings them back together, a reluctant monk forced into marriage and a beautiful virgin, longing to fulfill the forbidden fantasies of girlhood, succumb to the mutual attraction between them during their wedding night. Reissue.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Real Stew: 300 Recipes for Authentic Home-Cooked Cassoulet, Gumbo, Chili, Curry, Minestrone, Bouillabaise, Stroganoff, Goulash, Chowder, and Much More",
        "Authors": "By Wright, Clifford A.",
        "Description": "In this book, the author takes cooks on a culinary voyage around the world to discover the favorite comfort foods of nearly 50 countries.",
        "Category": " Cooking , Courses & Dishes , Soups & Stews",
        "Publisher": "Harvard Common Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Five Little Ghosts",
        "Authors": "By Smath, Jerry (ILT) and Boniface, William",
        "Description": "Young readers may count down along with five ghosts who find a variety of suitable places to haunt.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Dial-a-Ghost",
        "Authors": "By Ibbotson, Eva and Hawkes, Kevin (ILT)",
        "Description": "The Dial-a-Ghost Agency finds good homes for ghosts. And Fulton and Frieda Snodde-Brittle are looking for a few frightening ghosts to \"accidentally\" scare their young cousin and heir, Oliver, to death. The ladies at the Dial-a-Ghost Agency have the perfect match: the Shriekers, two bloodstained and bickering horrors. But thanks to a mix-up at the agency, the Wilkinsons, a kind family of ghosts, arrive instead. Can they put a stop to the Snodde-Brittles' schemes before it's too late?Illustrated by Kevin Hawkes.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Landscaping With Ornamental Grasses Sunset book",
        "Authors": "By Gilsenan, Fiona",
        "Description": "",
        "Category": " Gardening , Landscape",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Mauritshuis, The Hague",
        "Authors": "By Toth-Ubbens, Magdi",
        "Description": "",
        "Category": "",
        "Publisher": "UNSPECIFIED VENDOR",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Mrs. Chiang's Szechwan Cookbook",
        "Authors": "By Schrecker, Ellen with John Schrecker",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "11.05",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Derailed",
        "Authors": "By Siegel, James",
        "Description": "Every day Charles Schine rides the 8:43 to do the job he has done for over a decade in a New York advertising agency. With a wife and an ill child who depend on him, Charles is not a man who likes changes or takes risks ... until he is late for his regular train - and sits down across from the woman of his dreams.Her name is Lucinda. Like Charles, she is married. Like Charles, she takes the train every day to work in New York City. Her train is the 9:05, and tomorrow she will be on it again - and so will Charles. For there is something about Lucinda, the flash of thigh beneath her short skirt, the way every man on the train is eyeing her, something about this time of the morning that will make Charles take a chance he shouldn't take, break a vow he shouldn't break, and enter a room he should never enter.In a matter of days, a flirtation turns to a passion, and Charles and Lucinda are drawn into the dark side of the American Dream. In a matter of weeks, Charles's life is in shambles. A man is dead. A small fortune is stolen. Charles's home is violated and everything violently spirals out of control.But Charles is about to discover that once you leave the straight and narrow, getting back on track is the most perilous journey of all. And for Charles, that journey - of lies, terror, and deception - has just begun.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Summer's Best: In the Kitchen With Bob",
        "Authors": "By Bowersox, Bob",
        "Description": "",
        "Category": " Cooking , Seasonal",
        "Publisher": "Qvc Pub",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Lucia, Lucia: A Novel",
        "Authors": "By Trigiani, Adriana",
        "Description": "Set in the glittering, vibrant New York City of 1950, Lucia, Lucia is the enthralling story of a passionate, determined young woman whose decision to follow her heart changes her life forever.Lucia Sartori is the beautiful twenty-five-year-old daughter of a prosperous Italian grocer in Greenwich Village. The postwar boom is ripe with opportunities for talented girls with ambition, and Lucia becomes an apprentice to an up-and-coming designer at chic B. Altman’s department store on Fifth Avenue. Engaged to her childhood sweetheart, the steadfast Dante DeMartino, Lucia is torn when she meets a handsome stranger who promises a life of uptown luxury that career girls like her only read about in the society pages. Forced to choose between duty to her family and her own dreams, Lucia finds herself in the midst of a sizzling scandal in which secrets are revealed, her beloved career is jeopardized, and the Sartoris’ honor is tested.Lucia is surrounded by richly drawn New York characters, including her best friend, the quick-witted fashion protégé Ruth Kaspian; their boss, Delmarr, B. Altman’s head designer and glamorous man-about-town; her devoted brothers, Roberto, Orlando, Angelo, and Exodus, self-appointed protectors of the jewel of the family; and her doting father, Antonio. Filled with the warmth and humor that have earned Adriana Trigiani hundreds of thousands of devoted readers with her Big Stone Gap trilogy, Lucia, Lucia also bursts with a New York sensibility that shows the depth and range of this beloved author. As richly detailed as the couture garments Lucia sews, as emotional as the bonds in her big Italian family, it is the story of one woman who believes that in a world brimming with so much promise, she can—and should be able to—have it all.",
        "Category": " Fiction , Historical",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Tour of Duty: John Kerry and the Vietnam War",
        "Authors": "By Brinkley, Douglas",
        "Description": "Covering more than four decades, Tour of Duty is the definitive account of John Kerry's journey from war to peace. Written by acclaimed historian Douglas Brinkley, this is the first full-scale, intimate account of Kerry's naval career. In writing this riveting narrative, Brinkley has drawn on extensive interviews with virtually everyone who knew Kerry well in Vietnam, including all the men still living who served under him. Kerry also entrusted to Brinkley his letters home from Vietnam and his voluminous \"War Notes\" -- journals, notebooks, and personal reminiscences written during and shortly after the war. This material was provided without restriction, to be used at Brinkley's discretion, and has never before been published.John Kerry enlisted in the Navy in February 1966, months before he graduated from Yale. In December 1967 Ensign Kerry was assigned to the frigate U.S.S. Gridley; after five months of service in the Pacific, with a brief stop in Vietnam, he returned to the United States and underwent training to command a Swift boat, a small craft deployed in Vietnam's rivers. In June 1968 Kerry was promoted to lieutenant (junior grade), and by the end of that year he was back in Vietnam, where he commanded, over time, two Swift boats. Throughout Tour of Duty Brinkley deftly deals with such explosive issues as U.S. atrocities in Vietnam and the bombing of Cambodia. In a series of unforgettable combat-action sequences, he recounts how Kerry won the Purple Heart three times for wounds suffered in action and was awarded the Bronze Star and the Navy’s Silver Star for gallantry in action.When Kerry returned from Southeast Asia, he joined the Vietnam Veterans Against the War (VVAW), becoming a prominent antiwar spokesperson. He challenged the Nixon administration on Capitol Hill with the antiwar movementcheering him on. As Kerry's public popularity soared in April-May 1971, the FBI considered him a subversive. Brinkley -- using new information acquired from the recently released Nixon tapes -- reveals how White House aides Charles Colson and H. R. Haldeman tried to discredit Kerry. Refusing to be intimidated, Kerry started running for public office, eventually becoming a U.S. senator from Massachusetts. But he never forgot his fallen comrades. Working with his friend Senator John McCain, he returned to Vietnam numerous times looking for MIAs and POWs. By the time Bill Clinton was elected president in 1992, Kerry was the leading proponent of \"normalization\" of relations with Vietnam. When President Clinton officially recognized Vietnam in 1995, Kerry's three-decade-long tour of duty had at long last ended.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Surrendering to Motherhood: Losing Your Mind, Finding Your Soul",
        "Authors": "By Krasnow, Iris",
        "Description": "Surrendering to Motherhood is the story of one woman's search for spiritual fulfillment and personal identity that takes us along on her climb higher and higher on the career ladder, which only leaves her feeling emptier and emptier. After coming of age with women's liberation and the sexual revolution, the author finds emancipation at last in the Zen of running a houseful of children.Surrendering to Motherhood is about letting go of the burning need to achieve, and finding your true self in the love and calamity of motherhood. It is not a condemnation of any woman's choice, but rather a book that inspires all women to choose. A powerful and intimate story, this book sends a message to the author's own baby-boom generation programmed to \"have it all.\" Iris Krasnow tells them - and all of us - to stop and savor the moment, rather than constantly trying to reach somewhere higher and better. In this personal sojourn, there is a bounty of universal wisdom.",
        "Category": " Religion , Spirituality",
        "Publisher": "Miramax",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Party fare: A healthy exchanges cookbook",
        "Authors": "By Lund, JoAnna M.",
        "Description": "",
        "Category": "",
        "Publisher": "Perigee Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Outdoor Plants for Indoor Rooms",
        "Authors": "By Sheldon, Kathy",
        "Description": "“The photos are inspirational....There’s ample information on caring for plants indoors as well as good advice on design and plant choices. This book gives a wider view of what you can take indoors for the winter.”—Chicago Tribune. “Bring the beauty of your garden indoors with the helpful advice proposed in this clever book. You don’t need a green thumb, just the right information and inspiration, which this book provides.”—Country Decorating Ideas.",
        "Category": " Gardening , House Plants & Indoor",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Surrendering to Marriage: Husbands, Wives, and Other Imperfections",
        "Authors": "By Krasnow, Iris",
        "Description": "The author of Surrendering to Motherhood offers a penetrating study of the complexities of modern marriage, examining the basic components of a successful marriage and the difficult work it requires to ensure a long-lasting relationship. 25,000 first printing.",
        "Category": " Family & Relationships , Marriage",
        "Publisher": "Miramax",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Letters of Mozart",
        "Authors": "By Mozart, Wolfgang Amadeus, Mersmann, Hans, and Bozman, M.",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Hippocrene Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "iWorship Daily Journal",
        "Authors": "By iWorship",
        "Description": "A brilliant companion to the iWorship Personal Worship Bible. Features thought-provoking questions that correspond to the devotions that help jumpstart the journaling process, Scripture prompts to help the reader reflect on the day's reading, and plenty of space for journaling.",
        "Category": " Religion , Devotional",
        "Publisher": "Integrity Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Eternity's End",
        "Authors": "By Carver, Jeffrey A",
        "Description": "After seven years of captivity at the hands of interstellar pirates, Star Rigger Renwald Legroeder escapes to the Centrist Worlds, thinking himself free to return to rigging.Instead, he finds himself a target of a conspiracy that stretches across light-years - from the Centrist Worlds to the pirate stars beyond - a conspiracy that has survived interstellar war and claimed the lives of millions, both human and alien.Legroeder's only hope of escaping the clutches of the conspiracy is to embark on a suicide mission that will plunge him back into the heart of the pirates' stronghold in search of a legend - the phantom rigger Impris, a long-lost ship known as the Flying Dutchman of space.Awaiting him at the stronghold is a universe of danger, a cybernetically advanced underground in the dark heart of the conspiracy, and a woman who could prove his downfall...or his salvation.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Momisms What She Says And What She Really Means",
        "Authors": "By Hamilton, Cathy",
        "Description": "These Parent-to-English guidebooks are hilarious primers on understanding the true meanings of parental communication.Those who suspect that their mothers and fathers took closely guarded secret courses instructing them on \"the significance of enigmatic utterances\" won't be surprised to learn there are indeed clandestine languages for parents. And here are the books that decipher them.Finally, Dad's ambiguous responses like \"Go ask your mother,\" cryptic commands such as \"Don't make me pull this car over,\" and the puzzling question, \"Do you think I'm made of money?\" are explained in comic detail in this handy reference. And Mom's warnings, \"Don't you ever let me catch you doing that again!\" (implying that you can do it, I just don't want to find out about it) and probes, \"Is that what you're going to wear?\" are made clear. (Translation of the last Momism: \"I wouldn't be caught DEAD in that outfit.\")",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Servsafe Coursebook #SSFCB",
        "Authors": "By National Restaurant Association)",
        "Description": "",
        "Category": " Technology & Engineering , Food Science",
        "Publisher": "Educational Foundation of the",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Beginner's Guide to the World Economy: 71 Basic Economic Concepts That Will Change the Way You See the World",
        "Authors": "By Epping, Randy Charles",
        "Description": "An explanation of how the economy works discusses how trade wars could be avoided, what a leveraged buyout is, how communist economies make the transition to capitalism, what puts and calls are, what the EC is, and more. Original.",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Guardian Angels and Spirit Guides: True Accounts of Benevolent Beings from the Other Side",
        "Authors": "By Steiger, Brad",
        "Description": "Offers eyewitness accounts of ordinary people who have had their lives changed through the intervention of angels and spirit guides",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "What Wives Wish Their Husbands Knew About Women",
        "Authors": "By Dobson, James",
        "Description": "Dr. Dobson's suggestions for marital happiness are interesting, practical, and humorous.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Tyndale Momentum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "Huxford's Old Book Value Guide: 25,000 Listings of Old Books With Current Values",
        "Authors": "By Huxford, Bob and Huxford, Sharon",
        "Description": "Primarily an aid for people with an attic full of old books trying to decide whether any would be worth trying to sell.  Places a retail price the dealer's selling price, not buying price on nearly 25,000 specific editions, and lists scores of buyers along with the type of material each in interested in purchasing. Also includes advice on shipping books. No index or bibliography. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Antiques & Collectibles , Books",
        "Publisher": "Paul Chapman Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Love Is Never Enough: How Couples Can Overcome Misunderstandings, Resolve Conflicts, and Solve Relationship Problems Through Cognitive Therapy",
        "Authors": "By Beck, Aaron T.",
        "Description": "With eloquence and accessibility, Dr. Aaron T. Beck analyzes the actual dialogue of troubled couples to illuminate the most common problems in marriage--the power of negative thinking, disillusionment, rigid rules and expectations, and miscommunication.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "The Odyssey of Homer (Bantam Classics)",
        "Authors": "By Homer and Mandelbaum, Allen (TRN)",
        "Description": "Homer's epic chronicle of the Greek hero Odysseus' journey home from the Trojan War has inspired  writers from Virgil to James Joyce. Odysseus  survives storm and shipwreck, the cave of the Cyclops  and the isle of Circe, the lure of the Sirens' song  and a trip to the Underworld, only to find his  most difficult challenge at home, where treacherous  suitors seek to steal his kingdom and his loyal  wife, Penelope. Favorite of the gods, Odysseus  embodies the energy, intellect, and resourcefulness  that were of highest value to the ancients and that  remain ideals in out time.In this  new verse translation, Allen  Mandelbaum--celebrated poet and translator of Virgil's  Aeneid and Dante's Divine Comedy  --realizes the power and beauty of the original  Greek verse and demonstrates why the epic tale of  The Odyssey has captured the human  imagination for nearly three thousand  years.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "It all Adds Up: From the Dim Past to the Uncertain Future (Penguin Great Books of the 20th Century)",
        "Authors": "By Bellow, Saul",
        "Description": "A collection of nonfiction pieces that is a journey through forty years in literary America features articles, essays, travel writing, and an \"Autobiography of Ideas.\" 35,000 first printing. $30,000 ad/promo.",
        "Category": " Literary Criticism , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Deathstar voyage;: A downtime mystery cruise",
        "Authors": "By Wallace, Ian",
        "Description": "",
        "Category": "",
        "Publisher": "Putnam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Zero-Sum Solution",
        "Authors": "By Thurow, Lester C.",
        "Description": "A combination of thorough political evaluations and sound economic advice becomes a blueprint for effecting severe productivity growth to bring the United States up to world class economic standards",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "The House at Pooh Corner (Winnie-the-Pooh)",
        "Authors": "By Milne, A. A. and Shepard, Ernest H. (ILT)",
        "Description": "Happy 90th birthday, to one of the world's most beloved icons of children's literature, Winnie-the-Pooh! Return to the Hundred Acre Wood in A.A. Milne’s second collection of Pooh stories, The House at Pooh Corner. Here you will rediscover all the characters you met in Winnie-the-Pooh: Christopher Robin, Eeyore, Owl, Piglet, Kanga, tiny Roo, and, of course, Pooh himself. Joining them is the thoroughly bouncy and lovable Tigger, who leads the rest into unforgettable adventures. Since 1926, Winnie-the-Pooh and his friends have endured as the unforgettable creations of A.A. Milne, who wrote these stories for his son, Christopher Robin, and Ernest H. Shepard, who lovingly gave Pooh and his companions shape. These characters and their stories are timeless treasures of childhood that continue to speak to all of us with the kind of freshness and heart that distinguishes true storytelling.  The adventures of Christopher Robin, Winnie-the-Pooh, and all their friends in the storied Forest around Pooh Corner. \"This is an example of a sequel in which there seems to be no letdown, and from all sides I catch echoes of most joyous reaction to it.\" --- New York Herald Tribune, 1928",
        "Category": " Juvenile Fiction , Toys, Dolls & Puppets",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Girls' Poker Night: A Novel of High Stakes",
        "Authors": "By Davis, Jill",
        "Description": "Dissatisfied both with writing a “Single Girl on the Edge/ Ledge/Verge” lifestyle column and with her boyfriend (who has a name for his car and compulsively collects plastic bread ties), Ruby Capote sends her best columns and a six-pack of beer to the editor of The New York News and lands herself a new job in a new city. In New York, Ruby undertakes the venerable tradition of Poker Night—a way (as men have always known) to eat, drink, smoke, analyze, interrupt one another, share stories, and, most of all, raise the stakes. There’s Skorka, model by profession, homewrecker by vocation; Jenn, willing to cross county lines for true love; Danielle, recently divorced, seducer of at least one father/son combo in her quest to make up for perceived “missed opportunities.”When Ruby falls for her boss, Michael, all bets are off. He’s a challenge. He’s her editor. And he wants her to stop being quippy and clever and become the writer—and the woman—he knows she can be. Adding to Ruby’s uncertainty is his amazing yet ambiguous kiss in the elevator, and the enjoyably torturous impasse of he-loves-me, he-loves-me-not.What happens when you realize that Mr. Right has his own unresolved past? Where does that leave the future you envisioned? Ruby knows that happy endings aren’t for cowards, and she hasn’t lost hope that there are risks worth taking. As smart as it is laugh-out-loud funny, Girls’ Poker Night is a twenty-first-century His Girl Friday and a re-freshingly upbeat look at friendship, work, and love.From the Hardcover edition.",
        "Category": " Fiction , Women",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "The Nautical Chart",
        "Authors": "By Perez-Reverte, Arturo and Peden, Margaret Sayers (TRN)",
        "Description": "Coy is a suspended sailor with time on his hands, a mariner without a ship. While attending a maritime auction in Barcelona, he meets a beautiful woman who immediately captures his imagination. Tánger Soto, who works for the Naval Museum in Madrid, is obsessed with the Dei Gloria, a Jesuit ship sunk by pirates in the seventeenth century, and now-she hopes-resting on the bottom of the sea off the southern coast of Spain. Tánger uses her considerable manipulative skills with men and her expertise with documents, atlases, and nautical maps to chart the search for lost treasure. Coy is quickly drawn into the search, and before long finds himself falling in love. Along with El Piloto, the world-wise old man of the sea whose sailboat will carry this adventurous crew, they seek their fortune together. Or do they?As these lively characters follow the course of past sailors, their own journey becomes perilous. Are there secrets dwelling in the depths of the sea? And what of the depths of the heart? This highly intelligent and meticulously plotted novel combines the richness of atmosphere we have come to expect from Pérez-Reverte with the romance and mystery of the sea found in the novels of Melville, Conrad, and O'Brian. An unforgettable adventure.\"The master of the intellectual thriller.\"--San Francisco Chronicle",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "16.21",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "A Room with a View (Dover Thrift Editions)",
        "Authors": "By Forster, E. M.",
        "Description": "In common with much of his other writing, this work by the eminent English novelist and essayist E. M. Forster (1879–1970) displays an unusually perceptive view of British society in the early 20th century. Written in 1908, A Room with a View is a social comedy set in Florence, Italy, and Surrey, England. Its heroine, Lucy Honeychurch, struggling against straitlaced Victorian attitudes of arrogance, narrow-mindedness and snobbery, falls in love-while on holiday in Italy-with the socially unsuitable George Emerson.  Caught up in a claustrophobic world of pretentiousness and rigidity, Lucy ultimately rejects her fiancé, Cecil Vyse, and chooses, instead, to wed her true love, the young man whose sense of freedom and lack of artificiality became apparent to her in the Italian pensione where they first met. This classic exploration of passion, human nature and social convention is reprinted here complete and unabridged.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "A Bigamist's Daughter",
        "Authors": "By McDermott, Alice",
        "Description": "Elizabeth Connelly sits in a New York office that looks like a real editor’s, but isn’t quite. Employed at a vanity press, Elizabeth watches the real world—of real struggles, passion, pain, and love—spin around her. Until one day, a young writer comes to her with a novel about a man who loves more than one woman at once. And suddenly Elizabeth will be awakened from her young urban professional slumber—by a man’s real touch, by a real story in search of an ending, by the unraveling of the greatest masquerade of all—in Alice McDermott’s luminous novel of memory, revelation, and desire.",
        "Category": " Fiction , Humorous",
        "Publisher": "Dial Press Trade Paperback",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Balance of Power (Kerry Kilcannon)",
        "Authors": "By Patterson, Richard North",
        "Description": "An epic story that moves with force, passion, and authority, Balance of Power begins when President Kerry Kilcannon and television journalist Lara Costello at last decide to marry. But the momentous occasion is followed by an unspeakable tragedy—a massacre of innocents by gunfire—that ignites a high-stakes game of politics and legal maneuvering in the Senate, the courtroom, and across the country, which the charismatic but untested young President is determined to win at any cost. But in the incendiary clash over gun violence and gun rights, the cost to both Kilcannons may be even higher than he imagined.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Star Quality: A Novel",
        "Authors": "By Collins, Joan",
        "Description": "Irish Millie McClancey escapes her humble origins to pursue a glamorous life on the stage, becoming the first of four generations of remarkable women to find success in the glittering world of show business, in a novel that moves from London's show halls during World War I to the heights of modern-day Broadway and Hollywood. 150,000 first printing.",
        "Category": " Fiction , Literary",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "WEST SYSTEM The Partner",
        "Authors": "By Grisham, John",
        "Description": "They hired him.  They trusted him.  Now they don't want justice--they want revenge....For four years, Patrick had often wondered how it would feel if they caught him.Now he was terror-stricken.  Practically naked and strapped down like an animal, he knew the next few hours would be insufferable....Once he was a well-liked, well-paid young partner in a thriving Mississippi law firm.  Then Patrick Lanigan stole ninety million dollars from his own firm--and ran for his life.  For four years, he evaded men who were rich, powerful, and would stop at nothing to find him.  Then, inevitably, on the edge of the Brazilian jungle, they finally tracked him down.Now Patrick is coming home.  And in the Mississippi city where it all began, an extraordinary trial is about to begin.  As prosecutors circle like sharks, as Patrick's lawyer prepares his defense, as Patrick's lover prays for his deliverance and his former partners wait for their revenge, another story is about to emerge.  Because Patrick Lanigan, the most reviled white-collar criminal of his time, knows something that no one else in the world knows.He knows the truth....",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "WEST SYSTEM",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Jonathan Strange and Mr Norrell",
        "Authors": "By Clarke, Susanna",
        "Description": "In the Hugo-award winning, epic New York Times Bestseller and basis for the BBC miniseries, two men change England's history when they bring magic back into the world. In the midst of the Napoleonic Wars in 1806, most people believe magic to have long since disappeared from England - until the reclusive Mr. Norrell reveals his powers and becomes an overnight celebrity. Yet the cautious, fussy Norrell is challenged by the emergence of another magician, the brilliant novice Jonathan Strange. Young, handsome, and daring, Strange is the very opposite of Norrell. He becomes Norrell's student, and they join forces in the war against France. But Strange is increasingly drawn to the wildest, most perilous forms of magic, straining his partnership with Norrell, and putting at risk everything else he holds dear.Susanna Clarke's brilliant first novel is an utterly compelling epic tale of nineteenth-century England and the two magicians who, first as teacher and pupil and then as rivals, emerge to change its history.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "New Beginnings: New Writing from Bestselling Authors to Aid Save the Children",
        "Authors": "By Atwood, Margaret Eleanor (EDT)",
        "Description": "In an unprecedented publishing move, the world's leading writers are coming together to publish the first chapters of their new, unpublished work in a single volume entitled NEW BEGINNINGS. All proceeds of this unique venture will be going to Save the Children Tsunami Relief Fund. Authors participating are: Alexander McCall Smith chapter from Sunday Philosophy Club #2: Friends, Lovers, Chocolates coming 9/05 from Pantheon Ian McEwan chapter from Saturday coming 3/05 from Doubleday Maeve Binchy short story Georgia Hall - as yet unscheduled Margaret Atwood excerpt from the Tree coming in 06 from Doubleday Marian Keyes chapter from If You Were Me Mark Haddon chapter from Blood and Scissors Nicholas Evans chapter from the Divide Nick Hornby chapter from A Long Way Down coming 6/05 from Riverhead Paulo Coelho chapter from the Zahir Scott Turow chapter from the Law of War coming 10/05 from FSG Stephen King short story: Lisey and the Madman from McSweeney's Enchanted Chamber of Astonishing Stories published 11/04 Tracy Chevalier untitled novel excerpt, as yet unscheduled for publication Vikram Seth poem, \"Earth and Sky\" as yet unscheduled Helen Fielding - introduction Harlan Coben chapter from the Innocent coming 4/05 from Dutton Joanna Trollope chapter from Second Honeymoon coming 2/06 from Bloomsbury JM Coetzee chapter from Slow Man coming 10/05 from Viking This is an extraordinary collection of superb pieces from the world's most celebrated writers. All of this is being made available to consumers in advance of publication and in aid of Tsunami victims. Your generous and enthusiastic support of this project will enable Save the Children to continue their important work in the wake of the Tsunami devastation.",
        "Category": " Fiction , Literary",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Nature in America (Reader's Digest)",
        "Authors": "By Editors of Reader's Digest",
        "Description": "Features 1,200 entries that explore the world of beavers, owls, bison, elk, wildflowers, bees, canyons, geysers, and other natural wonders",
        "Category": " Science , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The American Heritage History of Notable American Houses",
        "Authors": "By Davidson, Marshall B",
        "Description": "Discusses and photographs the diverse styles of housing popular in the United States over the centuries",
        "Category": " Architecture , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "June",
            "Year": "1971"
        }
    },
    {
        "Title": "Hostage: My Nightmare in Beirut",
        "Authors": "By Jacobsen, David and Astor, Gerald",
        "Description": "The author recounts his seventeen-month ordeal as a hostage in Lebanon and discusses his release in exchange for weapons and the failure of America's anti-terrorism and hostage-rescue policies",
        "Category": "",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Favorite Hymns for Children",
        "Authors": "By Karl (Arranger) (Illustrated by Miss Elliott) Schu",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1942"
        }
    },
    {
        "Title": "Greek Art",
        "Authors": "By John Boardman",
        "Description": "",
        "Category": "",
        "Publisher": "Praeger",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Building Expert Systems (Teknowledge series in knowledge engineering)",
        "Authors": "By Hayes-Roth, Frederick",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "July",
            "Year": "1983"
        }
    },
    {
        "Title": "Faking It",
        "Authors": "By Crusie, Jennifer",
        "Description": "Meet the Goodnights, a respectable family who have run a respectable art gallery for generations. There's Gwen, the matriarch who sedates herself with double-crostics and double vodkas, Eve the oldest daughter who has a slight identity problem (she has two), and Nadine, the granddaughter who's ready to follow in the family footsteps as soon as she can find a set that isn't leading off a cliff. Holding everyone together is Matilda, the youngest daughter, who's inherited the secret locked down in the basement of the Goodnight Gallery, the secret that she's willing to do almost anything to keep, including break into a house in the dead of night to steal back her past.Meet the Dempseys, or at least meet Davy, a reformed con man who's justbeen ripped off for a cool three million by his financial manager, who then gallantly turned it over to Clea Lewis, the most beautiful sociopath Davy ever slept with. Davy wants the money back, but more than that he'll do anything to keep Clea from winning, including break into her house in the dead of night to steal back his future.One collision in a closet later, Tilda and Davy reluctantly join forces to combat Clea, suspicious art collectors, a disgruntled heir, and an exasperated hitman, all the while coping with a mutant dachshund, a juke box stuck in the sixties, questionable sex, a painting of three evil fisherman closing in on a dyspeptic tuna, multiple personalities, miscellaneous Goodnights and Dempseys, and the growing realization that they can't turn their backs on the people they were meant to be...or the people they were born to love.Faking It: What has reality ever done for you?Meet the Goodnights, a respectable family who have run a respectable art gallery for generations. There's Gwen, the matriarch who sedates herself with double-crostics and double vodkas, Eve the oldest daughter who has a slight identity problem (she has two), and Nadine, the granddaughter who's ready to follow in the family footsteps as soon as she can find a set that isn't leading off a cliff. Holding everyone together is Matilda, the youngest daughter, who's inherited the secret locked down in the basement of the Goodnight Gallery, the secret that she's willing to do almost anything to keep, including break into a house in the dead of night to steal back her past.Meet the Dempseys, or at least meet Davy, a reformed con man who's justbeen ripped off for a cool three million by his financial manager, who then gallantly turned it over to Clea Lewis, the most beautiful sociopath Davy ever slept with. Davy wants the money back, but more than that he'll do anything to keep Clea from winning, including break into her house in the dead of night to steal back his future.One collision in a closet later, Tilda and Davy reluctantly join forces to combat Clea, suspicious art collectors, a disgruntled heir, and an exasperated hitman, all the while coping with a mutant dachshund, a juke box stuck in the sixties, questionable sex, a painting of three evil fisherman closing in on a dyspeptic tuna, multiple personalities, miscellaneous Goodnights and Dempseys, and the growing realization that they can't turn their backs on the people they were meant to be...or the people they were born to love.Faking It: What has reality ever done for you?",
        "Category": " Fiction , Romance , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Emergency Medicine: A Comprehensive Study Guide : American College of Emergency Physicians",
        "Authors": "By Tintinalli, Judith E. (EDT), Krome, Ronald L. (EDT), Ruiz, Ernest (EDT), and American College of Emergency Physicians (COR)",
        "Description": "The essential emergency medicine reference! Covers the gamut of emergency medicine practice in brief, clinically focused chapters. New to this edition are chapters on bioterroism and weapons of mass destruction, pharmacology of antimicrobials, antifungals, and antivirals, principles of drug interactions, endocarditis, and abdominal and pelvic pain in the non-pregnant patient. Pharmacologic considerations, tables of vital differential diagnoses, and observation criteria throughout are new features reflecting developments in this dynamic specialty.\"considered by most in the discipline to be a bible of emergency medicine\"--Journal of Family Medicine, review of fourth edition.ENDORSED BY THE AMERICAN COLLEGE OF EMERGENCY PHYSICIANS",
        "Category": " Medical , Emergency Medicine",
        "Publisher": "Mcgraw-Hill (Tx)",
        "Price Starting With ($)": "10.36",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "If Not Now, When: Reclaiming Ourselves at Midlife",
        "Authors": "By Marston, Stephanie",
        "Description": "An inspiring guidebook to the spiritual, emotional, and psychological dimensions of the challenging stage of midlife examines interviews with more than one hundred women to offer empowerment to women during this significant time in their lives. 30,000 first printing.",
        "Category": " Self-help , Aging",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Bombay Ice",
        "Authors": "By Forbes, Leslie",
        "Description": "A wonderful first novel which dramatically combines the suspense of a gripping literary thriller with a meditation on the nature of scientific chaos",
        "Category": " Fiction , General",
        "Publisher": "Phoenix Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Botanica's Annuals & Perennials: Over 1000 Pages & over 2000 Plants Listed",
        "Authors": "By Botanica",
        "Description": "",
        "Category": " Nature , Plants , General",
        "Publisher": "Laurel Glen",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The White Flag Principle: How to Lose a War and Why",
        "Authors": "By Tzabar, Shimon",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Imponderables: The Solution to the Mysteries of Everyday Life",
        "Authors": "By Feldman, David",
        "Description": "A compendium of true answers to more than one hundred perplexing mysteries, including why a mile is 5,280 feet, how the order of the alphabet was determined, and which fruits are in Juicy Fruit gum",
        "Category": "",
        "Publisher": "Morrow, William Company In",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Rehearsal for Reconstruction: The Port Royal Experiment (Galaxy Books)",
        "Authors": "By Rose, Willie Lee Nichols",
        "Description": "This award-winning study presents an engaging account of the attempt at reconstruction that occurred in the Sea Islands of South Carolina during the beginning of the Civil War. Serving as a kind of dress rehearsal for Reconstruction, the Port Royal Experiment not only helped to shape federal policy for Reconstruction, but it also influenced the nation by adding to the initial war aim of the Union, the eventual commitment to freedom, and the still-unfulfilled commitment to equality.",
        "Category": " Philosophy , Aesthetics",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1976"
        }
    },
    {
        "Title": "Little Boy Blue",
        "Authors": "By Waldman",
        "Description": "",
        "Category": "",
        "Publisher": "Playmore",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Silent Knight (Little Landoll's Storybook Ser.)",
        "Authors": "By Julie McNally, Timothy Cahill",
        "Description": "",
        "Category": "",
        "Publisher": "Landoll, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Bedtime Stories & Rhymes (Mini Padded Treasuries)",
        "Authors": "By Alistair Hedley",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Essential: John James Audubon (Essentials)",
        "Authors": "By Blaugrund, Annette",
        "Description": "",
        "Category": " Art , Individual Artists , General",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "THE ENCYCLOPEDIA OF MANAGEMENT, 2 VOLUMES IN SLIPCASE",
        "Authors": "By Carl, editor Heyel",
        "Description": "",
        "Category": "",
        "Publisher": "Reinhold Book Corp.",
        "Price Starting With ($)": "41.75",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Turbulent Souls: A Catholic Son's Return To His Jewish Family",
        "Authors": "By Dubner, Stephen J.",
        "Description": "Two years ago, Stephen J. Dubner wrote a cover story for the New York Times Magazine called \"Choosing My Religion.\" It became one of the most widely discussed articles in the magazine's history. Turbulent Souls, the book that grew out of that article, is an intimate memoir of a man in search of a Jewish heritage he never knew he had. It is also a loving portrait of his parents.Stephen Dubner's family was as Catholic as they come. His devout parents attended mass at every opportunity and named their eight children after saints. Stephen, the youngest child, became an altar boy, studied the catechism, and learned the traditional rituals of the Church -- never suspecting that the religion he embraced was not his by blood.Turbulent Souls is Dubner's personal account of his family; tumultuous journey from Judaism to Catholicism -- and in his own case, back to Judaism -- and the effects, some tragic, some comic, of those spiritual transformations. His parents were Jews, born in Brooklyn to immigrant parents, but -- independent of each other and, indeed, before they met -- each converted to Christianity, only to be shunned by their families. After their marriage, they closed the door on Judaism so firmly that their children had no inkling that their background was far different from what it seemed: They didn't know, for instance, that their mother had a first cousin named Ethel Rosenberg, who was executed for treason in one of the most controversial cases of the cold war era.Stephen Dubner's is a story about discovery: of relatives he never knew existed, of family history he'd never learned, and of a faith he'd never thought of as his own and, in fact, knew nothing about. It's a fascinating, thoughtful, and thought-provoking exploration of a subject of intense interest to spiritually minded men and women everywhere.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Global Paradox: The Bigger the World Economy, the More Powerful Its Smallest Players",
        "Authors": "By Naisbitt, John",
        "Description": "In two previous blockbuster international best-sellers, John Naisbitt comprehensively identified the major trends that have swept through every sector of our world in the last fifteen years: from the globalization of the economy to the surging impact of technological innovation to the renewed power of culture in our lives.Now we confront a new pulse of change, a Global Paradox that will surely transform our lives:The larger the system, the smaller and more powerful and important the parts.Countries and companies are deconstructing into vital, smaller and smaller units. Multinational corporations are dramatically changing the way they do business or falling by the wayside. Empires are crumbling while looser economic alliances are on the rise. Nationalist movements in Quebec, Scotland, and throughout the former Soviet Bloc suddenly have a new, unprecedented vitality.In Global Paradox, John Naisbitt builds a powerful instrument of comprehension from this one profound and vital insight about the seemingly chaotic changes that appear to grip our world.The Paradox, as he sees it, is powered by the explosive developments in telecommunications which are the driving forces simultaneously creating the huge global economy and multiplying and empowering its parts. The Global Paradox is funded by the largest and fastest-growing industry in the world - tourism. Tourism is the face-to-face corollary of the communications revolution. Tourism creates infrastructures and can lift Third World economies; tourism incites our interest in other cultures and tribes - gives them validity, makes us want to visit them.The force shaking the foundations of huge economic and political structures is this same tribalism: The more universal we become, the more tribal we act. This tribalism will bring hundreds, perhaps thousands, of new countries into existence and will empower thousands of diverse, tribally affiliated groups.For the Global Paradox, China is the test case. Central economic planning got China nowhere. Now the individual entrepreneurs of China are swiftly moving in the direction of becoming the world's largest economy.Founded on these fundamental principles, Global Paradox offers a glimpse of the near-term future: the likely winners and losers in the global marketplace, the sectors of growth and stagnation in the world economy, the new rules that will soon determine standards of political and business behavior from Tokyo to New York to Sydney, to Santiago and Shanghai, to Kuala Lumpur and all points in between.Global Paradox is a noteworthy direction for John Naisbitt: a single conceptual breakthrough that applies a strikingly sharp vision to seemingly disparate trends in many areas of our lives. In the years and months to come, no informed reader can afford to ignore its awesome vision of the opportunities and challenges presented to nations, businesses, and individuals at millennium's end.",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Evening News",
        "Authors": "By Swick, Marly A.",
        "Description": "Nine year-old Teddy is playing next door with his best friend when Eric pulls out his father's handgun and hands it to Teddy. The telephone rings; the gun goes off, shooting -- and killing -- Teddy's two-year-old half sister Trina, who was playing in a wading pool in the yard outside, with Giselle, their mother, by her side.Thus begins Marly Swick's second novel after the highly acclaimed \"Paper Wings.\" As with her previous work, Swick resolutely travels the domestic landscape, detailing delicately and truthfully the effect of Trina's death on the unstable triangle of the family left behind. Each member finds their bonds of love and loyalty tested, and each is resilient in the face of their loss, but for different -- perhaps too different -- reasons: Giselle must get Teddy through the crisis, but Dan, his stepfather, having just lost his daughter, has no such responsibility.Told alternately from the point of view of Giselle and Teddy himself, \"Evening News\" is a beautifully accomplished novel about resilience in the face of loss -- and about the irrevocable damage that both the loss and the resilience can inflict.\"A book that",
        "Category": " Fiction , General",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Suaine and the Crow God",
        "Authors": "By Gordon, Stuart",
        "Description": "",
        "Category": "",
        "Publisher": "New English Library",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Everything Pregnancy Book (Everything Series)",
        "Authors": "By Brinley, Maryann Bucknum and Berk, Howard, M.D.",
        "Description": "",
        "Category": " Medical , Gynecology & Obstetrics",
        "Publisher": "Everything",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Swan Prince",
        "Authors": "By Baryshnikov, Mikhail",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "One Hundred Activities for Gifted Children",
        "Authors": "By Meredith, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "Lake Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1957"
        }
    }
]