[
    {
        "Title": "The Bill James Handbook 2011",
        "Authors": "By Baseball Info Solutions",
        "Description": "",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "ACTA Publications",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "The Mystery in the Mall (72) (The Boxcar Children Mysteries)",
        "Authors": "By Warner, Gertrude Chandler and Tang, Charles (ILT)",
        "Description": "The Alden children help out a storeowner at the Hope Harbor Mall and discover that someone is tampering with the merchandise shipments",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Albert Whitman & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Big Fight: My Life In and Out of the Ring",
        "Authors": "By Leonard, Sugar Ray and Arkush, Michael (CON)",
        "Description": "In this unflinching and inspiring autobiography, the boxing legend faces his single greatest competitor: himself.  Sugar Ray Leonard's brutally honest and uplifting memoir reveals in intimate detail for the first time the complex man behind the boxer. The Olympic hero, multichampionship winner, and beloved athlete waged his own personal battle with depression, rage, addiction, and greed. Coming from a tumultuous, impoverished household and a dangerous neighborhood on the outskirts of Washington, D.C., in the 1970s, Sugar Ray Leonard rose swiftly and skillfully through the ranks of amateur boxing-and eventually went on to win a gold medal in the 1976 Olympics. With an extremely ill father and no endorsement deals, Leonard decided to go pro. The Big Fight takes readers behind the scenes of a notoriously corrupt sport and chronicles the evolution of a champion, as Leonard prepares for the greatest fights of his life-against Marvin Hagler, Roberto Duran, Tommy Hearns, and Wilfred Benitez. At the same time Leonard fearlessly reveals his own contradictions and compulsions, his infidelity, and alcohol and cocaine abuse. With honesty, humor, and hard-won perspective, Leonard comes to terms with both triumph and struggle-and presents a gripping portrait of remarkable strength, courage, and resilience, both in and out of the ring.",
        "Category": " Sports & Recreation , Boxing",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Satan's Chamber",
        "Authors": "By Molly Best Tinsley, Karetta Hubbard",
        "Description": "",
        "Category": "",
        "Publisher": "Fuze Publishing, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Life and Teaching of Jesus Christ",
        "Authors": "By Stewart, James",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "March",
            "Year": "1978"
        }
    },
    {
        "Title": "Creative Growth Games",
        "Authors": "By Raudsepp, Eugene",
        "Description": "Seventy-five stimulating numerical, verbal, and spatial games are designed to test and promote one's problem-solving abilities and creative imagination",
        "Category": " Psychology , General",
        "Publisher": "Putnam Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1977"
        }
    },
    {
        "Title": "Orphan's Alliance (Jason Wander, 4)",
        "Authors": "By Buettner, Robert",
        "Description": "Humans have been discovered on the Outworlds. And the Army decides to send emissaries.  Emissaries like Jason Wander. As intraplanetary conflicts rage around him, and the personal stakes get ever higher, Jason finds that playing planet-hopping politician can be harder than commanding armies. When united mankind squares off to battle the Slugs for a precious interstellar crossroad, Jason will discover that the most dangerous enemy may be the one he least expects.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Orbit",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Simplified Course of Raja Yoga",
        "Authors": "By Slater",
        "Description": "Hatha Yoga deals with the care, health, and well-being of the physical body through the conscious control of the vibrations of matter. The Hatha yogi proceeds in consciousness from the physical to the mental to the spiritual, leading to the development of the inner spiritual self manifesting through thoughts, feelings, and actions in the outer world. Hatha Yoga comprehensively reveals the ancient wisdom of yoga, or union of spirit and matter, including asanas, or yogic postures; pranayama and the life principle; and meditation, from concentration to contemplation.",
        "Category": "",
        "Publisher": "Quest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Survival Chinese: How to Communicate without Fuss or Fear - Instantly! (Survival Series)",
        "Authors": "By De Mente, Boye",
        "Description": "A handy Mandarin Chinese phrasebook and guide to the Chinese language, Survival Chinese contains basic vocabulary necessary for getting around.This book contains all the necessary words and phrases for speaking Mandarin Chinese in any kind of setting. Perfect for students, tourists, or business people learning Mandarin or traveling to China or Taiwan, it also contains a beginner guide to the Mandarin language, allowing for a deeper understanding of Chinese than a typical Mandarin phrasebook or Chinese dictionary. The book is broken into four basic sections: Common Chinese Expressions and Key Words, Essential Chinese Communication Tools, Chinese Travel Vocabulary, and making your own sentences. All Chinese words and phrases are written in Romanized form (pinyin) as well phonetically, making pronouncing Chinese a breeze. For example, the word for reservation, yuding is also written as yuu-deeng. Authentic Chinese characters (hanzi) are also included so that in the case of difficulties the book can be shown to the person the user is trying to communicate with.This phrasebook includes: Hundreds of useful Chinese words and expressions. An A-Z index which allows the book to function as a English to Chinese dictionary. Romanized forms, phonetic spellings, and Chinese Characters (Hanzi) for all words and phrases. A concise background and history of the Chinese language. A complete guide to Chinese pronunciations. A concise guide to using Chinese tones. A brief introduction to Chinese grammar.Not everyone has time to attend regular Mandarin Chinese classes. A busy schedule, however, does not mean you cannot learn Mandarin. With this fun and easy Chinese phrase book you will soon be speaking Chinese without fear or fuss! Titles in this bestselling phrase book series include: Survival Japanese, Survival Arabic, Survival Chinese, Survival Tagalog, Survival Hindi, and Survival Korean",
        "Category": " Foreign Language Study , Chinese",
        "Publisher": "Tuttle Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Stories of Magical Animals (Young Reading, Level 1)",
        "Authors": "By Watson, Carol, Harvey, Gill, and Price, Nick (ILT)",
        "Description": "Collects four stories of mythological animals with magic powers that cannot be approached safely or killed without cunning and some assistance.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "CCNA Cisco Certified Network Associate Study Guide, 4th Edition (640-801)",
        "Authors": "By Lammle, Todd",
        "Description": "Updated for the Latest CCNA ExamHere's the book you need to prepare for Cisco's revised CCNA exam, 640-801. This new edition of the best-selling CCNA Study Guide provides:In-depth coverage of every CCNA exam objectivePractical information on Cisco internetworking solutionsHundreds of challenging review questionsLeading-edge exam preparation software, including a test engine, sample simulation questions, and electronic flashcardsAuthoritative coverage of all exam objectives, including:Network planning & designingImplementation & operationLAN and WAN troubleshootingNote:CD-ROM/DVD and other supplementary materials are not included as part of eBook file.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Sybex",
        "Price Starting With ($)": "7.04",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Ccna Intro Exam Certification Guide Ccna Self-Study",
        "Authors": "By Odom, Wendell",
        "Description": "Covers the objectives of the CCNA INTRO exam and provides review questions, scenario-based exercises, and a testing engine found on the companion CD-ROM.",
        "Category": " Study Aids , Tests (Other)",
        "Publisher": "Cisco Systems",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Book of Awesome (The Book of Awesome Series)",
        "Authors": "By Pasricha, Neil",
        "Description": "Based on the award-winning 10-million-plus-hit blog 1000 Awesome Things, The Book of Awesome is an international bestselling high five for humanity and a big celebration of life’s little moments.Sometimes it’s easy to forget the things that make us smile. With a 24/7 news cycle reporting that the polar ice caps are melting, hurricanes are swirling in the seas, wars are heating up around the world, and the job market is in a deep freeze, it’s tempting to feel that the world is falling apart. But awesome things are all around us, like:• Popping Bubble Wrap • Wearing underwear just out of the dryer • Fixing electronics by smacking them • Getting called up to the dinner buffet first at a wedding • Watching The Price Is Right when you’re home sick • Hitting a bunch of green lights in a row • Waking up and realizing it’s SaturdayThe Book of Awesome reminds us that the best things in life are free (yes, your grandma was right). With laugh-out-loud observations from award-winning comedy writer Neil Pasricha, The Book of Awesome is filled with smile-inducing moments on every page that make you feel like a kid looking at the world for the first time. Read it and you’ll remember all the things there are to feel good about.A New York Times Bestseller • USA Today Bestseller • Globe and Mail Bestseller • Toronto Star Bestseller • Vancouver Sun Bestseller • Macleans Bestseller • Winner of the Forest of Reading Award",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Living with Confidence in a Chaotic World: What on Earth Should We Do Now?",
        "Authors": "By Jeremiah, David",
        "Description": "“Let not your heart be troubled . . .” Confidence can be hard to come by these days. People are losing their jobs, their houses, and their life savings at an unprecedented rate. Violence, natural disasters, and moral depravity seem to be skyrocketing. In the midst of all this chaos, we need to know . . . what on earth should we do now? In the follow-up to the New York Times bestsellerWhat in the World Is Going On? Dr. David Jeremiah brings a message of hope and confi dence from the priceless counsel of the Word of God. He answers our most urgent questions, including:How can we weather this storm with a calm heart?What does it truly mean to “wait on the Lord”?What is Jesus saying to our chaotic world today?How on earth did we get into this mess?Can we take a broken world and rebuild it into something fruitful?Living with Confidence in a Chaotic World  shows us all that with the power and love of Almighty God, we can live with confidence in this age of turmoil.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "The Bones Book and Skeleton",
        "Authors": "By Lafave, Kim (ILT)",
        "Description": "THE BONES BOOK AND SKELETON is the extraordinary bestseller with over 1.75 million copies in print and a portfolio of accolades from reviewers: “A terrific tool to help kids learn about their bodies.”—The Los Angeles Times •  “As science lessons go, this is probably the cleverest around.”—New York Magazine • “Will tickle the curiosity bone with skeletal facts and activities on the role bones play in the body.”—Better Homes and Gardens Guide to Children’s Products • “Make no bones about it—this item is a great way to show youngsters how the body works.”—The Atlanta Journal •  “A delightful package.”—The New York Daily News.  Now, this educational classic has been updated with additional content and repackaged to give it a fresh, bold, contemporary look and form that makes it much easier to shelve and display.  The 12-inch, 24-piece skeleton is realistically designed with moving joints, and can be displayed in its clear plastic bell jar. The book is packed with projects, experiments, and facts about all the systems of the human body. The focus, of course, is on the bones—what they are made of, how they grow, how they work. New is an expanded section on paleontology and fossil remains incorporating the latest news from the field, including the newly discovered hobbit-sized humans from the last Ice Age. This is a great gift for every kid, one that truly brings science to life.",
        "Category": " Juvenile Nonfiction , Science & Nature , Anatomy & Physiology",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "WP237 - 1st Parade of Solos - Bastien",
        "Authors": "By Jane Smisor Bastien",
        "Description": "",
        "Category": "",
        "Publisher": "Kjos Music Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The iPhone Book: How to Do the Most Important, Useful & Fun Stuff with Your iPhone, 2nd Edition",
        "Authors": "By Kelby, Scott and White, Terry",
        "Description": "The first edition of \"The iPhone Book\" was chosen by Amazon's editors as their Computer/Technology Book of the Year. This new version of the book, totally updated and expanded for the 3G iPhone, was chosen by Amazon as one of their \"Top 10 Must-Have Books\" in their annual list of the most \"gift-worthy\" books of the holiday season. Here's why this book has become such a hit with iPhone users around the world: it's not a “Tell-me-all-about-it” book, which has in-depth discussions on every­thing from wireless network protocols to advanced compression codes. Instead it's a “show-me-how-to-do-it” book, that skips all the confusing techno-jargon and just tells you, in plain simple English, exactly how to use the iPhone features you want to use most. The book’s layout is brilliant, with each page covering just one single topic, so finding the information you need is quick and easy, with a large full-color photo on each page so you can see exactly how it works. In this book, you'll learn:• How to set up and manage your email the right way from the start• How to take advantage of the iPhone's Web features (including important tips that help you avoid frustration, and get you where you want to go fast!)• How to download and install applications from Apple's online App Store• The key trouble-shooting tips you've got to know• How to get your favorite photos onto your iPhone, tips for using its built-in camera, and how to make the most of the iPhone's surprisingly powerful photo features• The tips you've got to know to use your iPhone's built-in iPod features, including watching videos, podcasts, TV shows and movies (you're going to amazed at some of the cool things you can do) • How to use the iPhone's built-in applications to organize your life (you'll learn things in this chapter you didn't know the iPhone could do!)• The top 20 tips for the iPhone's phone feature that will make you fall in love with it (you'll never want to use any other phone again)• Plus so much more, including a special bonus chapter called \"iPhone Killer Tips\" where you'll learn those hidden secrets that you'll be passing on to your iPhone friends (and they will be amazed!). The iPhone Book is from Scott Kelby, the award-winning author of the smash best­seller, The iPod Book, who teams up once again with gadget guru, and iPhone authority, Terry White to put together a book that is an awful lot like the iPhone itself—simple to use and fun to learn. In this major update to the book, Scott and Terry added even more tips, more tricks, and made it even easier by focusing on just  the most use­ful and most requested features (without all the techno-babble) so you can start really using your iPhone today! BONUS VIDEO: The authors put together a special in-depth video just for readers of the book where they not only share their favorite iPhone accessories, but they share even more of those hidden little time-saving tips that can make all the difference in the world. If you've been waiting for a book that focuses on just the most important, most useful, and most fun stuff about your iPhone—you’ve found it.",
        "Category": " Computers , Data Transmission Systems , General",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "The Eat-Clean Diet for Men: Your Ironclad Plan for a Lean Physique!",
        "Authors": "By Kennedy, Robert, Reno, Tosca, and Lalanne, Jack (FRW)",
        "Description": "With the huge popularity of the Eat-Clean Diet among North American women, the question kept arising: Is Eating Clean okay for men?  It may seem a silly question--after all, a healthy diet should be appropriate for anyone, right?  But the question is in no way silly.  Most diets don't work for men because men don't eat the way women do.  Men don't like to go hungry, they don't like to live on salads, they don't like excluding food groups and they don't like counting calories.The Eat-Clean Diet for Men    allows men to lose weight and get healthy while freeing them from all those dieting evils!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "God, I Need to Talk to You About Hurting Others (God I Need to Talk to You About...)",
        "Authors": "By Carr, Dan",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , General",
        "Publisher": "Concordia Publishing House",
        "Price Starting With ($)": "4.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Eight Hands Round: A Patchwork Alphabet",
        "Authors": "By Winter, Jeanette (ILT) and Paul, Ann Whitford",
        "Description": "\"Paul provides information about pioneer life through speculation about the origins of 26 quilt patterns, one for each letter of the alphabet. The variety of colors and designs makes the quilts themselves the real stars of the book [and] will [encourage] students to develop their own creations in cloth or on paper.\" —SLJ.   Outstanding Books of 1991 (NYT)Notable 1991 Childrens' Trade Books in Social Studies (NCSS/CBC)Books for Vacation Reading (NYT)",
        "Category": " Juvenile Nonfiction , History , United States , Colonial & Revolutionary Periods",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "RunLog: Diary and Guide for The Runner",
        "Authors": "By Houts, Tim",
        "Description": "Track your progress, maximize results, and create a healthier lifestyleThis popular runner’s diary has been completely updated with fresh training tips for all levels and a new layout that helps runners track their intervals and strength training and nutrition. RunLog provides a 24-week undated calendar for planning training and tracking progress, along with over 25 pages of training tips and workouts.",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Pointe Book: Shoes, Training & Technique",
        "Authors": "By Schlesinger, Sarah and Barringer, Janice",
        "Description": "A guide for instructors includes sample pointe classes, advice on preparing students for pointe work, sources for purchasing shoes, and an explanation of the proper fitting, preparation, and maintenance of pointe shoes",
        "Category": " Performing Arts , Dance , Classical & Ballet",
        "Publisher": "Princeton Book Co Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Villains Victorious",
        "Authors": "By Greenberg, Martin Harry (EDT) and Helfers, John (EDT)",
        "Description": "An anthology of all-original short stories celebrates the dastardly deeds of fantasy's greatest villains in tales by Tanya Huff, Rosemary Edghill, David Bischoff, Ed Gorman, Kristine Kathryn Rusch, Peter Crowther, Tim Waggoner, Josepha Sherman, and other notable authors. Original.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "DAW",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Night Cover: A Lt. Leroy Powder Novel",
        "Authors": "By Lewin, Michael Z.",
        "Description": "When he fails to put an end to a string of violent murders, Lieutenant Leroy Powder, a veteran of the Indianapolis Police department, loses his customary night shift and is forced to prove he has not lost his edge. Reprint. IP.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Foul Play Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Vietnam and Angkor Wat (Eyewitness Travel Guides)",
        "Authors": "By Sterling, Richard",
        "Description": "Eyewitness Travel Guide: Vietnam & Angkor Wat is your must-have companion to this beautiful part of the world. Vietnam opened its doors to tourists in the late 1980s and its appeal has grown ever since. Blessed with a long coast, the country now attracts sun-lovers and surfers, with resorts and spas sprouting all along the coast.This full-color, updated guide leads readers to it all, from the floating markets of the Mekong Delta in the south to the hill towns in the north, and all the best beaches to be found in between. A full chapter is dedicated to Angkor in neighboring Cambodia, with the astounding temples illustrated in detail.Whether zipping around old Hanoi in a pedal-powered cyclo or dining on the exquisite local cuisine, theDK Eyewitness Travel Guide: Vietnam & Angkor Wat is indispensable.Highlights of the guide include:Full-color photographs, illustrations, and maps. Cutaways and floor plans of all the major sights. 3-D aerial views of the city's most interesting districts. Comprehensive selection of hotels, restaurants, stores, and entertainment venues.Specially devised walking tours and so much more. DK Eyewitness Travel Guide: Vietnam & Angkor Wat — showing you what others only tell you.",
        "Category": " Travel , Asia , Southeast",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Great Britain (Eyewitness Travel Guides)",
        "Authors": "By Leapman, Michael",
        "Description": "Provides information on accommodations, restaurants, sights, shopping, events, and nightlife.",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "DK Travel",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Look and Find Chicken Little",
        "Authors": "By Michael P. Fertig",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications Intl.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Only in Alaska,",
        "Authors": "By Thomas, Tay",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Cookie Jar",
        "Authors": "By Culinary Arts Institute",
        "Description": "",
        "Category": "",
        "Publisher": "Consolidated Book Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Lanie (American Girl: Lanie)",
        "Authors": "By Papp, Robert (ILT), Kurtz, Jane, and DeKuiper, Rebecca (CON)",
        "Description": "Introducing the \"Girl of the Year 2010,\" Lanie loves science and nature, but she has a problem: she's an \"outside\" girl who longs to get out and go camping, but her \"inside\" family just wants to stay home; when her favorite aunt comes to visit, Lanie discovers that the wonders of nature are everywhere--even in her own backyard.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "American Girl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "A Very Marley Christmas",
        "Authors": "By Grogan, John and Cowdrey, Richard (ILT)",
        "Description": "With all the excitement of Christmas approaching, it's no surprise that Marley, the lovable pup with a nose for trouble, wants to get in on the action. Anticipating his very first snowfall and Santa's arrival, Marley jumps in to help his family every way he can. But Marley, being Marley, always ends up on the wrong side of right. It's not long before he tears down the twinkle lights, attacks a chain of paper snowflakes, and mistakes the Christmas tree for . . . well . . . his very own indoor bathroom. Will Marley's good intentions ruin everything before Christmas begins? Or will he manage to share some Christmas magic with his family after all?This follow-up to the #1 bestselling Bad Dog, Marley! delivers a heartfelt holiday story with many hilarious Marley mishaps along the way.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Booklover's Book List",
        "Authors": "By Brown, Kay",
        "Description": "",
        "Category": "",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Choosing to Cheat : Who Wins When Family and Work Collide?",
        "Authors": "By Stanley, Andy",
        "Description": "Citing the challenges faced by modern families to balance the demands of a busy schedule, a guide by the author of The Seven Checkpoints offers advice on where to compromise and urges readers to place their families first.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Money Market Funds",
        "Authors": "By Corrrigan & Kaufman",
        "Description": "",
        "Category": "",
        "Publisher": "Longmeadow Press",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Getting A Grip: Clarity, Creativity, and Courage in a World Gone Mad",
        "Authors": "By Lappe, Frances Moore",
        "Description": "Winner of  the  2008 JAMES BEARD HUMANITARIAN AWARD, 2008 NAUTILUS SMALL PRESS GOLD AWARD and 2008 NAUTILUS SILVER AWARD in the category of Social Change/ActivismGetting a Grip: Clarity, Creativity & Courage in a World Gone Mad is a little book with a big message.  Frances Moore Lappe--author of fifteen books, including three-million-copy bestseller Diet for a Small Planet--distills her world-spanning experience and wisdom in a conversational yet hard-hitting style to create a rare \"aha\" book. In nine short chapters, Lappe leaves readers feeling liberated and courageous.  She flouts conventional right-versus-left divisions and affirms readers' basic sanity--their intuitive knowledge that it is possible to stop grasping at straws and grasp the real roots of today's crises, from hunger and poverty to climate change and terrorism. Because we are creatures of the mind, says Lappe, it is the power of \"frame\"--our core assumptions about how the world works--that determines outcomes. She pinpoints the dominant failing frame now driving out planet toward disaster. By interweaving fresh insights, startling facts, and stirring vignettes of ordinary people pursuing creative solutions to our most pressing global problems, Lappe uncovers a new, empowering \"frame\" through which real solutions are emerging worldwide.She writes: \"My book's intent is to enable us to see what is happening all around us but is still invisible to most of us. It is about people in all walks of life who are penetrating the spiral of despair and reversing it with new ideas, ingenious innovation--and courage.\"",
        "Category": " Political Science , Political Ideologies , General",
        "Publisher": "Small Planet Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "She Walks in Beauty",
        "Authors": "By Mitchell, Siri",
        "Description": "For a young society woman seeking a favorable marriage in the late 1890s, so much depends on her social season debut. Clara Carter has been given one goal: secure the affections of the city's most eligible bachelor. Debuting means plenty of work--there are corsets to be fitted, dances to master, manners to perfect. Her training soon pays off, however, as celebrity's spotlight turns Clara into a society-page darling. Yet Clara wonders if this is the life she really wants, especially when she learns her best friend has also set her sights on Franklin De Vries. When a man appears who seems to love her simply for who she is, and gossip backlash turns ugly, Clara realizes it's not just her heart at stake--the future of her family depends on how she plays the game.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "10 Cats (Leveled Readers) 1.1.1",
        "Authors": "By christine oh",
        "Description": "",
        "Category": "",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Asbury Methodist Village Revisited",
        "Authors": "By Marshall Grotenhuis",
        "Description": "",
        "Category": "",
        "Publisher": "Marshall Grotenhuis",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Leviathan (The Fallen)",
        "Authors": "By Sniegoski, Thomas E.",
        "Description": "Eighteen-year-old Aaron is on the run from the Powers that killed his foster parents and took his younger brother, Steven. With his dog, Gabriel, and Camael, a former Power, he is drawn north to a small town in Maine. Here Aaron, who still hasn't accepted his newfound heritage, finds comfort in the isolated, tight-knit community.  But when Camael and Gabriel go missing, and their landlady suddenly attacks Aaron, he is forced to learn more about the War in Heaven and the many Powers that are fighting for dominance...of humankind.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Remember Me: Remember Me; The Return; The Last Story",
        "Authors": "By Pike, Christopher",
        "Description": "She won’t let them forget… Shari Cooper wakes up dead. The last thing she can remember is falling from a balcony during her friend’s party. Her death has been ruled a suicide, but Shari knows she was murdered. All of her closest friends are now suspects. As she tries to find her killer from the other side, she discovers her friends may not have been so loyal to her after all. Now, Shari is not just out for justice, she’s out for revenge….",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Sea Lord (Children of the Sea, Book 3)",
        "Authors": "By Kantra, Virginia",
        "Description": "He was born of the sea... Selkie prince Conn ap Llyr denies his deeply sensual nature to rule over the immortal Children of the Sea. But when the Children of Fire threaten the Selkies' Sanctuary, Conn must obey his haunting visions-and seek a woman thousands of miles away... She was born on land... Schoolteacher Lucy Hunter knows nothing about her Selkie heritage or the prophecy that drives Conn to find her. She is content with her life on the quiet Maine island of World's End.  That is, until a proud, compelling stranger appears to challenge her assumptions and awaken her desires...  Their love will tear them between two worlds... To combat Fire, Conn needs Lucy's magic-even if this means stealing her away to Sanctuary. As the demon threat grows, so does their passion, overcoming Lucy's fears and Conn's guarded heart.  But soon they face a devastating choice.  Will their love be enough to save them?  Or will their destinies tear them apart?",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "What You Don't Know About Turning 50...: A Funny Birthday Quiz",
        "Authors": "By Witte, P. D.",
        "Description": "Provides a humorous look at turing fifty with quizzes that can be used at a birthday party",
        "Category": " Humor , General",
        "Publisher": "RunningPressAdult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Sparknotes: Romeo and Juliet",
        "Authors": "By SparkNotes (EDT)",
        "Description": "Features explanations of themes, motifs, and symbols, analyses of characters and quotes, plot summaries and analysis, an exploration of historical context, and facts and potential essay topics.",
        "Category": " Drama , Shakespeare",
        "Publisher": "Spark Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Martin Luther (Men of Faith)",
        "Authors": "By Fearon, Mike",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Chopstix: Quick Cooking With Pacific Flavors",
        "Authors": "By Carpenter, Hugh, Sandison, Teri, and Chopstix Dim Sum Cafe (COR)",
        "Description": "Presents Asian-American recipes for soups, salads, main dishes, and desserts that require no special equipment of lengthy preparations",
        "Category": " Cooking , Regional & Ethnic , Chinese",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Classical Music: The Great Composers and Their Masterworks",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "7329910",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Breakfast in Bed: 90 Recipes for Creative Indulgences",
        "Authors": "By Cool, Jesse Ziff",
        "Description": "With ninety recipes to choose from, Jesse Ziff Cool, overseeing chef and owner of Flea St. Cafe in Menlo Park, California, reminds us just how important it is to treat ourselves right. Call it indulgence, but this simple attention to self is guaranteed to start any day off right. Nurture yourself and your loved one with comfort foods like Real Corned Beef Hash or Old-Fashioned Bread and Butter Pudding - every bit as good, maybe even better, savored in the morning than at night. Omelets and frittatas, pancakes and waffles, and marvelous side dishes like Scalloped Potatoes will tempt you. Let the singular aroma of homemade baked goods - Cinnamon-Brown Sugar Drop Biscuits or Bacon, Cheddar, and Parsley Soda Bread, to name only two - infiltrate and disarm your house, your loved one, and yourself. Or, serve up one of Jesse Ziff Cool's special breakfast menus. Twenty-six exquisite four-color photographs prove how appealing breakfast under the covers can be.",
        "Category": " Cooking , Courses & Dishes , Breakfast",
        "Publisher": "Morrow Cookbooks",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Revelations (Blue Blood, Book 3) (Blue Bloods (3))",
        "Authors": "By De La Cruz, Melissa",
        "Description": "Have you ever wondered what secrets lurk behind the closed doors of New York City's wealthiest families? They're powerful, they're famous... they're undead.Schuyler Van Alen's blood legacy has just been called into question-is the young vampire in fact a Blue Blood, or is it the sinister Silver Blood that runs through her veins? As controversy swirls, Schuyler is left stranded in the Force household, trapped under the same roof as her cunning nemesis, Mimi Force, and her forbidden crush, Jack Force.When one of the Gates of Hell is breached by Silver Bloods in Rio de Janeiro, however, the Blue Bloods will need Schuyler on their side. The stakes are high; the battle is bloody; and through it all, Carnavale rages on. And in the end, one vampire's secret identity will be exposed in a revelation that shocks everyone.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Hyperion Book CH",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Alligators All Around (The Nutshell Library)",
        "Authors": "By Sendak, Maurice",
        "Description": "‘An alligator jamboree, with all the letters ' A through Z.'",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Gifts From the Country Kitchen (Taste of Home/Reader's Digest)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Reiman Media Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Supreme Court: The Personalities and Rivalries That Defined America",
        "Authors": "By Rosen, Jeffrey",
        "Description": "\"Superbly well written . . . a wonderfully informative guide to the Supreme Court both past and present.\"—David J. Garrow, American HistoryJeffrey Rosen recounts the history of the Supreme Court through the personal and philosophical rivalries that have transformed the law—and by extension, our lives. With studies of four crucial conflicts—Chief Justice John Marshall and President Thomas Jefferson; post–Civil War justices John Marshall Harlan and Oliver Wendell Holmes; liberal icons Hugo Black and William O. Douglas; and conservative stalwarts William H. Rehnquist and Antonin Scalia—Rosen brings vividly to life the perennial rivalry between those justices guided by strong ideology and those who cared more about the court as an institution, forging coalitions and adjusting to new realities. He ends with a revealing conversation with Chief Justice John Roberts, who is attempting to change the court in unexpected ways. The stakes, he shows, are nothing less than the future of American jurisprudence.",
        "Category": " Political Science , American Government , Judicial Branch",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Be The Brand: How to Find a Powerful Identity and Use It to Drive Sales",
        "Authors": "By Martin, David N.",
        "Description": "",
        "Category": " Business & Economics , Advertising & Promotion",
        "Publisher": "Oaklea Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The Illustrated Encyclopedia of Perennials",
        "Authors": "By Professor Marshall Craigmyle",
        "Description": "",
        "Category": "",
        "Publisher": "Salamander Books Limited",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The World of Animals (Children's Reference)",
        "Authors": "By Johnson, Jinny and Walters, Martin",
        "Description": "Provides facts and images describing the anatomy, behavior, and habitats of over 1,000 animals from protists to primates.",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Measure of a Man",
        "Authors": "By Gene A. Getz",
        "Description": "",
        "Category": "",
        "Publisher": "Regal Books / Gospel Light",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Reveal Where Are You?",
        "Authors": "By greg-hawkins-cally-parkinson",
        "Description": "",
        "Category": "",
        "Publisher": "Willow Creek Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Guide to Owning Turtles (Guide to Owning A...)",
        "Authors": "By Coborn, John",
        "Description": "Offers advice on housing, feeding, breeding, and maintaining pet turtles",
        "Category": " Pets , Reptiles, Amphibians & Terrariums",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "LITTLE TONY OF ITALY. The Children of All Lands Stories",
        "Authors": "By Madeline Brandeis",
        "Description": "",
        "Category": "",
        "Publisher": "Grossett & Dunlap",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1934"
        }
    },
    {
        "Title": "Looking in the Mirror: Self-Appraisal in the Local Church",
        "Authors": "By Schaller, Lyle E.",
        "Description": "When you look at your church, what image do you see? A small, self-sufficient fellowship - reminiscent, perhaps, of a cat?  Or a responsive, affectionate congregation - more like, say, a collie?If your congregation numbers into the hundreds at worship time, could you think of it as a large and unified \"mansion\"?  Or a diversified \"ranch\"?Is your church legalistic, with a heavy emphasis on rules and regulations?  Is it ideological, stressing belief?  Or does it comprise a loving, nurturing behaviorism?\"Frequently,\" says Lyle Schaller, \"it is difficult or impossible for congregational leaders to agree on the role God is calling that church to fill unless they can agree on contemporary reality.\"Looking in the Mirror provides a conceptual framework for church self-appraisal that can be a key factor in determining that reality and overcoming the passivity that blights so many congregations today.",
        "Category": " Religion , General",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "All About Eva",
        "Authors": "By Berry, Deidre",
        "Description": "A wealthy boyfriend, designer clothes, exotic vacations, and a Central Park penthouse-- these are a few of Eva Cantrell's favorite things. But when her sugar daddy turns out to be an investor swindler and goes on the run, he leaves an unsuspecting Eva without a couture bag to her name. With the gravy train permanently derailed, suddenly nobody is who Eva thought they were. Her socialite best friend has become her worst enemy, and her new attorney is an all-out hunk who makes it difficult to keep their relationship strictly professional. And with her return to her old south side Chicago neighborhood, Eva has her hands full dealing with her always out-there family of dreamers, divas, and straight-up scammers--P. [4] of cover.",
        "Category": " Fiction , African American , Women",
        "Publisher": "Dafina",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Teaching Literary Elements: Easy Strategies and Activities to Help Kids Explore and Enrich Their Experiences with Literature (Grades 4-8)",
        "Authors": "By McCarthy, Tara",
        "Description": "Creative and exciting ways to help students understand literary elements and develop a vocabulary with which to discuss literature and its elements such as character, plot, setting, theme, motivation, point of view and more. Includes models from well-known works of literature, and reproducibles. For use with Grades 4-8.",
        "Category": " Education , General",
        "Publisher": "Scholastic Teaching Resources (Teaching",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Alien Blues",
        "Authors": "By Hightower, Lynn S.",
        "Description": "Homicide detective David Silver feels that his troubles are just beginning when he finds out that his new partner is an Elaki, one of the seven-foot stingray-like aliens that have arrived on Earth to offer humankind a helping hand",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Framework for Understanding Poverty: Modules 1-7 Workbook",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Ingram",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Creed's Honor (The Creed Cowboys, 2)",
        "Authors": "By Miller, Linda Lael",
        "Description": "Conner Creed knows exactly who he is: a hardworking rancher carrying on his uncle's legacy in Lonesome Bend, Colorado. Maybe a small-town cowboy's life isn't his dream, but he owes the man who took him in as a kid. Until the identical twin brother he's been estranged from for years reenters his life.Conner struggles with identity issues as he gets to know his wilder brother. And then he meets Tricia McCall, a beautiful woman who knows a thing or two about living someone else's dreams. Together, they just might find their own dreams right here in Lonesome Bend&#133;.",
        "Category": " Fiction , Romance , Western",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "BARRY DARE AND THE MYSTERIOUS BOX, boys' Adventure Series",
        "Authors": "By Gardner Hunting",
        "Description": "",
        "Category": "",
        "Publisher": "Saalfield Publ.",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1929"
        }
    },
    {
        "Title": "The Walk: A Novel (Pocket Readers Guide)",
        "Authors": "By Evans, Richard Paul",
        "Description": "\"My name is Alan Christoffersen. You don’t know me. ‘Just another book in the library,’ my father would say. ‘Unopened and unread.’ You have no idea how far I’ve come or what I’ve lost. More important, you have no idea what I’ve found.\" —Prologue What would you do if you lost everything—your job, your home, and the love of your life—all at the same time? When it happens to Seattle ad executive Alan Christoffersen, he’s tempted by his darkest thoughts. A bottle of pills in his hand and nothing left to live for, he plans to end his misery. Instead, he decides to take a walk. But not any ordinary walk. Taking with him only the barest of essentials, Al leaves behind all that he’s known and heads for the farthest point on his map: Key West, Florida. The people he encounters along the way, and the lessons they share with him, will save his life—and inspire yours. Richard Paul Evans’s extraordinary New York Times bestsellers have made him one of the world’s most beloved storytellers. A life-changing journey, both physical and spiritual, The Walk is the first of an unforgettable series of books about one man’s search for hope.",
        "Category": " Fiction , General",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Men's Health Better Body Blueprint: The Start-Right, Stick-to-It Strength Training Plan",
        "Authors": "By Mejia, Michael",
        "Description": "The ultimate training manual for beginning or returning exercisers Drawing on the foundation of Men's Health magazine, this superb guide explains everything that inexperienced or lapsed exercisers need to know to tailor a fitness program to their individual goals and abilities. The ability to personalize a workout plan allows readers to achieve quicker results and spend less time with ice packs and sore muscles.Unlike other books that lump beginning exercisers into one group, this program differentiates among beginners, such as:   • high-schoolers with newfound interest in lifting   • 30-year-olds who want to get back the bodies they had when they played college sports   • 50-year-olds who work out only for the first few weeks after New Year's resolutions every JanuaryMichael Mejia, contributing editor to Men's Health magazine and coauthor of Scrawny to Brawny, thoroughly explains the fundamentals of fitness, including strength training, cardiovascular activity, and nutrition. He provides self-assessment tests to help safeguard against injuries by identifying muscular imbalances, decreased flexibility, or other weaknesses—and then shows how to correct these problems. Whether readers are \"Newbies,\" \"Ex-jocks,\" or \"Seasonals\"; hope to build muscle or increase strength; are willing to work out every day or are able to spare only a couple of days a week, they will find the blueprint for their better body in this book.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Developmental Exercises to Accompany Rules for Writers",
        "Authors": "By Hacker, Diana and Van Goor, Wanda",
        "Description": "",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "A Pocket Guide to Hawai'i's Trees and Shrubs",
        "Authors": "By Pratt, H. Douglas",
        "Description": "",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Mutual Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Basic Rights: Subsistence, Affluence, and U.S. Foreign Policy",
        "Authors": "By Shue, Henry",
        "Description": "The Description for this book, Basic Rights: Subsistence, Affluence, and U.S. Foreign Policy, will be forthcoming.",
        "Category": " Philosophy , General",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "December",
            "Year": "1980"
        }
    },
    {
        "Title": "Cookbook Bible Cake Mix",
        "Authors": "By n/a",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Paper Decorator : Original Paperwork for Stylish Interiors",
        "Authors": "By Kerry Skinner",
        "Description": "",
        "Category": "",
        "Publisher": "David & Charles Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Devotions for Dieters: A Guide to a Lighter You",
        "Authors": "By Dick, Dan R.",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Life At Its Best",
        "Authors": "By Hostetter, B. Charles",
        "Description": "",
        "Category": "",
        "Publisher": "Moody Press",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Christ Our Hope: Pope Benedict XVI's Apostolic Visit to the United States",
        "Authors": "By Cameron, Lachlan T., Henning, Richard G., and Vaccari, Peter I.",
        "Description": "This is the Official Commemorative book on Pope Benedict's 2008 apostolic visit to the USA April 15 – 20. This lavishly illustrated, large-size edition, has dozens of fabulous photos of all the papal visit venues during his historic visit, with inspiring, informative commentary on the various papal events, and also includes the texts all the Pope's addresses, homilies, and his prayer at Ground Zero.This beautifully produced, high quality coffee-table book is a deluxe edition for all those who want to have a keepsake treasure of this powerful six day visit to the USA by Pope Benedict who won the hearts and minds of countless people with his inspiring words and gestures of love, truth, hope and compassion.From his first stepping off the Shepherd One plane in Washington, to his White House visit and warm exchange with President Bush, the moving, festive Masses in two baseball stadiums, his inspiring address to the United Nations, his talks to U S Bishops, Catholic educators and to youth, and deeply moving visit to Ground Zero, the many memorable moments of Pope Benedict's apostolic journey are captured in moving pictures and words in this collector's edition.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Ignatius Press",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Shop Smart, Save More: Learn The Grocery Game and Save Hundreds of Dollars a Month",
        "Authors": "By Berk, Sheryl and Gault, Teri",
        "Description": "These days the cost of food and other basic necessities is going through the roof. Teri Gault's groundbreaking website, www.TheGroceryGame.com, has already helped millions save serious money. And now she shares the secrets to sensible shopping in one essential volume, so you can feed your family and take care of their needs for thousands of dollars a year less! Shop Smart, Save More provides step-by-step instructions on how to:find and shop the right storesdecode \"Everyday Low Prices\" and other  grocery store lingomaster the science of couponsorganize your shopping liststockpile effectively recognize bogus \"bargains\" and anticipate real salesgo green for less green . . . and much, much more!",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Church History Revised",
        "Authors": "By Dwyer, John C.",
        "Description": "",
        "Category": " Religion , History",
        "Publisher": "Paulist Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Diana",
        "Authors": "By R. F. Delderfield",
        "Description": "",
        "Category": "",
        "Publisher": "POCKET",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1973"
        }
    },
    {
        "Title": "Live in a Better Way: Reflections on Truth, Love, and Happiness",
        "Authors": "By Dalai Lama XIV and Singh, Renuka",
        "Description": "Imbued with a friendly tone and pithy wisdom, this handsome handbook to approaching life \"in a better way\" includes six of His Holiness The Dalai Lama's most accessible and inspirational public lectures. Following each talk are the original question-and-answer sessions in which His Holiness opens himself up to his listeners and-now-to readers everywhere. His characteristically candid guidance on living fully and responsibly, especially at the start of a new millennium, focuses on specific themes that range from religious tolerance to compassion and nonviolence. The book also includes a practical and highly readable introduction to Buddhism and The Dalai Lama's own spiritual heritage, written by the renowned Lama Thubten Zopa Rinpoche.",
        "Category": " Religion , Buddhism , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Apples & Chalkdust",
        "Authors": "By Caruana, Vicki",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "David C Cook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Coping with Alzheimer's: A Caregiver's Emotional Survival Guide",
        "Authors": "By Oliver, Rose and Bock, Frances A.",
        "Description": "",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "Wilshire Book Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Pike Place Market Cookbook: Recipes, Anecdotes and Personalities from Seattle's Renowned Public Market",
        "Authors": "By Rex-Johnson, Braiden",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Sasquatch Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Great Railway Bazaar",
        "Authors": "By Theroux, Paul",
        "Description": "The American novelist's account of the landscapes, characters, mishaps, and adventures encountered on his grand railroad excursion from London to Tokyo and back again on such classics as the Orient, Mandalay, and Trans-Siberian Expresses",
        "Category": "",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "Basketball's Greatest Players (Step-Into-Reading, Step 5)",
        "Authors": "By Kramer, Sydelle",
        "Description": "Whose hands were so big he held the basketball like a grapefruit? Which center singlehandedly changed the way defense was played? From Wilt Chamberlain and Bill Russell to Kareem Abdul-Jabbar, Larry Bird and Michael Jordan, young hoops fans can read about eleven legendary players in this exciting look at basketball's greatest slam-dunking, hoop-hanging superstars.",
        "Category": " Juvenile Nonfiction , Sports & Recreation , Basketball",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "New Handy College Dictionary, The (3rd Edition)",
        "Authors": "By Penguin (EDT)",
        "Description": "",
        "Category": " Reference , Dictionaries",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Good Things Come in Small Groups: The Dynamics of Good Group Life",
        "Authors": "By Barker, Steve and Nicholas, Ron",
        "Description": "",
        "Category": " Religion , Philosophy",
        "Publisher": "Intervarsity Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Developing Your Secret Closet of Prayer: Principles for Intimacy With God",
        "Authors": "By Burr, Richard A. and Fleagle, Arnold R.",
        "Description": "",
        "Category": " Religion , Prayer",
        "Publisher": "Christian Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Northern Virginia Heritage a Pictorial Compilation of the Historic Sites and Homes in the Counties of Arlington, Fairfax, Loudon, Fauquier, Prince William and Stafford and the Cities of Alexandria and Fredericksburg",
        "Authors": "By Elanor Lee Templeman and Nan Netherton",
        "Description": "",
        "Category": "",
        "Publisher": "Privately published by E. L. Templeman",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Baby Cougar (Look Look)",
        "Authors": "By Spanjian, Beth and Beecham, Greg (ILT)",
        "Description": "Tells the story of a day in the life of a young cougar",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "7.98",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "The Navajos (Volume 43) (The Civilization of the American Indian Series)",
        "Authors": "By Underhill, Ruth Murray",
        "Description": "Newspaper accounts of the Navajos in recent years have prompted widespread interest in the tribe, its history, and its present condition. In this volume Ruth Underhill presents the absorbing and authoritative account of the Navajos, from the time of their myth-shrouded appearance in the Southwest to their present-day position as America's largest Indian tribe, with a population of 100,000 occupying a reservation of fifteen million acres.The Navajos, blood relations of the Apaches, once virtually ruled the area now known as Utah, Colorado, Arizona, and New Mexico, which they robbed with impunity. Unable to tolerate their depredations any longer, Anglo-Americans, Mexicans, and other Indians rose up in protest, demanding the subjugation of the Navajos, who were accused of every crime and held responsible for almost every Indian attack in the area. The job was given to Colonel Kit Carson, who defeated the Navajos in 1864 and moved them to a small reservation at Fort Sumner, where they remained for nearly four years before being returned to their original home.It was upon their agriculture, sheepherding, and artistry in blanket weaving and silversmithing that the Navajos, now unable to continue their profitable raiding, became dependent during the early, trying days of reservation life. Miss Underhill's careful examination of the complex mythical aura that surrounds the early Navajos offers an interesting insight into their colorful history and rich cultural background, but it is her sensitive portrayal of their adjustment to a new way of life that distinguishes her account of this great tribe. For this printing, the final chapter, \"Fourth Beginning,\" has been rewritten to bring the story of the Navajos up to 1967.",
        "Category": " History , World",
        "Publisher": "University of Oklahoma Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1956"
        }
    },
    {
        "Title": "The Ultimate Low Cholesterol Low Fat Cookbook (The Ultimate Series)",
        "Authors": "By France, Christine",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "7.04",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Nameless Day: Book One of 'The Crucible'",
        "Authors": "By Douglass, Sara",
        "Description": "The Black Plague.  The Pestilence.  Disease and death haunt every town and village across 14th century Europe and none are immune from its evil.  Some see the devastation of their world as a sign from God for Man's wickedness.But Brother Thomas Neville sees this swath of death as something much more.  Neville is a man beset by demons.  Or is it angels?  He has had a visitation from none other than the Archangel Michael, who commands Thomas to a mission.  This mission will take Neville across the length and breath of the continent in a desperate bid to find the means to stop the minions of Satan who have found a doorway out of Hell and are preparing to venture forth, to try and seize this world in preparation for an assault on Heaven itself.As Thomas Neville encounters angels and demons, saints and witches, he comes to realize that the armies of God and Satan are arraying themselves for the final battle...and that his soul is to be the battleground.The question is, has Neville picked the truly good side?",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Fantasy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Abraham Lincoln: Vampire Hunter",
        "Authors": "By Grahame-Smith, Seth",
        "Description": "Indiana, 1818. Moonlight falls through the dense woods that surround a one-room cabin, where a nine-year-old Abraham Lincoln kneels at his suffering mother's bedside. She's been stricken with something the old-timers call \"Milk Sickness.\"\"My baby boy...\" she whispers before dying.Only later will the grieving Abe learn that his mother's fatal affliction was actually the work of a vampire.When the truth becomes known to young Lincoln, he writes in his journal, \"henceforth my life shall be one of rigorous study and devotion. I shall become a master of mind and body. And this mastery shall have but one purpose...\" Gifted with his legendary height, strength, and skill with an ax, Abe sets out on a path of vengeance that will lead him all the way to the White House.While Abraham Lincoln is widely lauded for saving a Union and freeing millions of slaves, his valiant fight against the forces of the undead has remained in the shadows for hundreds of years. That is, until Seth Grahame-Smith stumbled upon The Secret Journal of Abraham Lincoln, and became the first living person to lay eyes on it in more than 140 years.Using the journal as his guide and writing in the grand biographical style of Doris Kearns Goodwin and David McCullough, Seth has reconstructed the true life story of our greatest president for the first time-all while revealing the hidden history behind the Civil War and uncovering the role vampires played in the birth, growth, and near-death of our nation.",
        "Category": " Fiction , Fantasy , Historical",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "The Turn of the Screw, the Aspern Papers and Two Stories (Barnes & Noble Classics)",
        "Authors": "By James, Henry and Sweet, David Lehardy (INT)",
        "Description": "&&LDIV&&R&&LDIV&&R&&LI&&RThe Turn of the Screw, The Aspern Papers and Two Stories&&L/I&&R, by &&LB&&RHenry James&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&RJoseph Conrad once said of his friend &&LB&&RHenry James&&L/B&&R, “As is meet for a man of his descent and tradition, Mr. James is the historian of fine consciences.” As it turns out, James was also incredibly gifted at writing exceptional ghost stories. This collection—including “&&LI&&RThe Beast in the Jungle&&L/I&&R” and “&&LI&&RThe Jolly Corner&&L/I&&R”—features James’s finest supernatural tales, along with criticism, a discussion of the legacies of James’s writing, and provocative study questions. &&L/DIV&&R&&LDIV&&R&&LP&&R&&LB&&RDavid L. Sweet&&L/B&&R is a professor of American and comparative literature at The American University in Cairo. He has also taught at Princeton, The City University of New York, The American University of Paris, and Columbia University, where he received his doctorate in Comparative Literature. His book &&LI&&RSavage Sight/Constructed Noise: Poetic Adaptations of Painterly Techniques in the French and American Avant-Gardes&&L/I&&R will be published next year by the University of North Carolina.&&L/P&&R&&L/DIV&&R",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Sterling Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "One Day (Movie Tie-in Edition) (Vintage Contemporaries)",
        "Authors": "By Nicholls, David",
        "Description": "NOW A MAJOR MOTION PICTURE starring ANNE HATHAWAY and JIM STURGESSIt’s 1988 and Dexter Mayhew and Emma Morley have only just met. But after only one day together, they cannot stop thinking about one another. Over twenty years, snapshots of that relationship are revealed on the same day—July 15th—of each year. Dex and Em face squabbles and fights, hopes and missed opportunities, laughter and tears. And as the true meaning of this one crucial day is revealed, they must come to grips with the nature of love and life itself.\"One of the most hilarious and emotionally riveting love stories you'll ever encounter.\" —People#1 INTERNATIONAL BESTSELLER",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Mangiamo (Let's Eat!)",
        "Authors": "By Sebastiani, Sylvia",
        "Description": "",
        "Category": "",
        "Publisher": "Sebastiani Vinyards",
        "Price Starting With ($)": "96.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Energizers: Light Devotions That Keep Your Faith Growing",
        "Authors": "By Adams, Nate",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Mesa Grill Guide to Tequila: The Quintessence of the Blue Agave and the Finest Brands of Tequila, with 70 Food and Drink Recipes",
        "Authors": "By Kretchmer, Laurence and Oelbaum, Zeva (PHT)",
        "Description": "A thorough guide to the grades, brands, varieties, source, production, and history of tequila, illustrated with a hundred color photographs, features seventy recipes for food and drinks, including extraordinary magaritas, and serving suggestions.",
        "Category": " Gardening , Regional , General",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Re Entry: Making The Transition From Missions To Life At Home",
        "Authors": "By Jordan, Peter",
        "Description": "",
        "Category": " Religion , Christian Ministry , Missions",
        "Publisher": "Y W A M Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2013"
        }
    },
    {
        "Title": "The Concubine's Children",
        "Authors": "By Chong, Denise",
        "Description": "Drawing on letters, photographs, and reminiscences, the granddaughter of a woman who came from China as the concubine of a traveler to the New World describes her discovery of the Chinese family left behind and her reunion with them.",
        "Category": " Social Science , Ethnic Studies , Asian American Studies",
        "Publisher": "Penguin Canada",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    }
]