[
    {
        "Title": "The America's Finest Companies Investment Plan 1995: Double Your Money Every Five Years",
        "Authors": "By Staton, Bill",
        "Description": "Showing beginning and veteran investors how to take control of their financial futures, the authority behind the Money Advisory newsletter offers a guide to investing in more than four hundred of America's finest companies. Original. Tour.",
        "Category": " Business & Economics , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Bedford Guide for College Writers with Reader, Research Manual, and Handbook",
        "Authors": "By Kennedy, X. J., Kennedy, Dorothy M., and Holladay, Sylvia A.",
        "Description": "",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Bedford/St Martins",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Frommer's Europe",
        "Authors": "By Porter, Darwin (EDT)",
        "Description": "A complete guide to European travel covers everything from grand hotels to charming guesthouses, five-star dining to small cafes, and includes practical information on exact prices, open hours, credit cards, metro stops, rail stations and more. Original.",
        "Category": " Travel , Europe , General",
        "Publisher": "Frommers",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Personal Finance: Turning Money into Wealth (Prentice Hall Finance Series)",
        "Authors": "By Keown, Arthur J.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Money Dynamics for the 1990s",
        "Authors": "By Vancaspel, Venita",
        "Description": "Takes into account revised tax laws, changes in real estate and other financial opportunities, and the impact of the Gramm-Rudmann bill to offer advice on investment strategy",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "The Spy Wore Red: My Adventures as as Undercover Agent in World War II",
        "Authors": "By Aline, Countess of Romanones",
        "Description": "Chronicles the true story of Aline Griffith, a beautiful young woman who was working as a model for Hattie Carnegie in New York when she was recruited for World War II espionage work in Spain",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "The 7 Best Things Smart Teens Do",
        "Authors": "By Friel, John C. and Linda, Friel D.",
        "Description": "In The Seven Worst Things Good Parents Do, therapists John and Linda Friel gave parents an easy-to-understand guide to overcome the seven worst mistakes even good parents make while raising children. Now they've written a book for teens based on the same formula: it includes the seven worst things even smart-and outwardly successful-teens do, and shows teens how they can change these behaviors and assure their success in life as they grow towards adulthood.This book was written expressly for teenagers as a unique roadmap into adulthood. It was designed to stimulate the brain as well as the heart because teenagers who listen to both can eventually negotiate adolescence successfully. It will appeal to teenagers who like to think, wonder, question and challenge, as well as to teenagers who feel that they haven't quite figured out this \"life\" thing.The Friels show teens the seven things they need to do in order to overcome common roadblocks they face or will face. These are:Become competent-don't expect to have self-esteem without becoming competentMaster your feelings-don't let your feelings run the showBreak the silence-don't silently scream instead of making yourself knownGet healthy power-don't avoid learning about powerFace the serious stuff-don't hide the really important things you're experiencingFind an identity-don't avoid the struggle to find yourselfLearn to stake out the extremes-don't live only in the extremes.Written in clear, straightforward language and including many interesting and colorful story interludes, this book is an easy-to-use, powerful tool for all teens.",
        "Category": " Young Adult Nonfiction , Social Topics , General",
        "Publisher": "HCI Teens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Your complete guide to IRAs and Keoghs: The simple, safe, tax-deferred way to future financial security",
        "Authors": "By Egan, Jack",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "8.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Foundations of financial management",
        "Authors": "By Block, Stanley B.",
        "Description": "",
        "Category": "",
        "Publisher": "R. D. Irwin",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Just a Range Ball in a Box of Titleists: On and Off the Tour with Gary McCord",
        "Authors": "By McCord, Gary",
        "Description": "Gary McCord has been playing the PGA tour for the last twenty-three years, and broadcasting for CBS for the last ten.  His tournament success has been, shall we say, mixed.  But during those years, he admits, \"a number of strange and interesting things have transpired.\"  Now, through his unique greens-eye view, McCord brings them to us:  the Tour, the personalities, the culture, the very sights and smells of professional golf.  Inside you'll find people named Norman, Nicklaus, Pavin, Watson, Mickelson, and Daly.  But you'll also find deeply funny tales of terror on everything from Qualifying School to the Masters.  In all, Just a Range Ball... is a work of pure delight from Gary McCord, television's number one golf commentator and iconoclast.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Consumer Reports Best Baby Products, 8th Edition",
        "Authors": "By Gordon, Sandra J.",
        "Description": "Few events are more exciting than having your first child, but hand-in-hand with that goes a whole multitude of new decisions.Consumer Reports Guide to Baby Products is your personal baby shopping consultant. Over the years, this invaluable guide has helped thousands of new parents navigate the sea of complex and sophisticated baby merchandise, pointing them to the best products, and steering them away from the less-than-the-best. Consumer Reports allows buyers to streamline the selection process, avoid shopping pitfalls, and help keep the baby budget in balance, including practical advice on:·\"Building\" the baby's nursery from crib to diaper bag·At-a-glance details on hundreds of items in the all-new Product Guide·Ratings of car seats, carriers, play yards, and travel systems·A comprehensive list of recent safety recalls·A guide to the most commonly prescribed medications for babies·Shopping guide to websites, catalogs, and stores ·Checklists and worksheets to help organize the shopping process.",
        "Category": " Reference , Consumer Guides",
        "Publisher": "Consumer Reports",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Helping the Battered Child and His Family.",
        "Authors": "By Kempe, C. Henry",
        "Description": "Sociologists, lawyers, and school personnel outline means of detecting and treating parents who physically abuse their children",
        "Category": " Social Science , General",
        "Publisher": "Lippincott Williams & Wilkins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1972"
        }
    },
    {
        "Title": "Sam's Teach Yourself C++ in 24 Hours (2nd Edition)",
        "Authors": "By Liberty, Jesse",
        "Description": "",
        "Category": " Computers , Programming Languages , C++",
        "Publisher": "Sams",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Be the Leader You Were Meant to Be (An Input book)",
        "Authors": "By Eims, Leroy",
        "Description": "",
        "Category": "",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "Managing the Hidden Organization: Strategies for Empowering Your Behind-the-Scenes Employee",
        "Authors": "By Deal, Terrence E. and Jenkins, William A.",
        "Description": "Using actual case histories that readers can apply directly to their businesses, two experts in organizational behavior, corporate culture, and customer service demonstrate how to dramatically improve a company's overall performance by motivating behind-the-scenes workers. Deal is the bestselling author of Corporate Cultures, which has sold 75,000 copies.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Adventuring in Alaska (The Sierra Club adventure travel guides)",
        "Authors": "By Wayburn, Peggy",
        "Description": "Advice on travel, sightseeing, and camping in Alaska includes a survey of the parks, wildlife preserves, native villages, special events, and other attractions across the state",
        "Category": "",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Murder at Five Finger Light: A Jessie Arnold Mystery",
        "Authors": "By Henry, Sue",
        "Description": "The Jessie Arnold mysteries offer “real thrills set against the wild beauty of Alaska” (Minneapolis Star-Tribune)—and this time, Jessie unscrambles a deadly puzzle along the Alaskan Inside Passage… Two of Jessie’s friends are throwing a party at their new digs—an old lighthouse on the Alaskan Inside Passage. Not a party in the typical sense, but one where guests earn their keep by scraping, painting, and generally restoring Five Finger Light, named after the long, low islands around it. So Jessie decides to leave her partner-in-crime, Alex, alone for a few days and lend a hand. With the company of old friends and a view to die for, Jessie won’t soon forget this weekend—especially when she stumbles across a dead body. Looks like an accident. But even as a frantic Alex learns that someone’s cut the phone lines and wrecked the radio, Jessie realizes there’s a killer loose on the island. Worse yet, the killing spree might not be over—even though the party certainly is....",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Dieting Causes Brain Damage: How to Lose Weight without Losing Your Mind",
        "Authors": "By Greive, Bradley Trevor",
        "Description": "The biggest name in gift books is getting smaller-and you can, too. Bradley Trevor Greive, the 280-pound publishing giant, has started slimming down while coming to grips with the bloated eating habits and health beliefs of our modern world.With his trademark wit and humorous animal photographs, BTG explains that the true motivation for losing excess weight and keeping it off is purely to enjoy a better quality of life, to get the most out of our brief time on this earth.Dieting Causes Brain Damage identifies the most common causes of weight gain as well as the perils of extreme dieting, suggesting that the number-one lesson is to \"Keep your mouth shut.\" This reduces the number of calories consumed and stops you from constantly whining and making excuses about your appearance.You don't need a PhD., millions of dollars, plastic surgery, a library of fad diet books, or a Day-Glo Lycra bodysuit to get into shape. Eating well, enjoying quality sleep, and getting a little exercise is the key to weight loss and personal health and fitness.This wonderful gift book is for anyone who would like to be in better shape and could use a few laughs along the way-a uniquely refreshing guide to looking, feeling, and living well that is free from false promises, tasteless recipes, and leg warmers. The biggest name in gift books is getting smaller-and you can, too. Bradley Trevor Greive, the 280-pound publishing giant, has started slimming down while coming to grips with the bloated eating habits and health beliefs of our modern world.With his trademark wit and humorous animal photographs, BTG explains that the true motivation for losing excess weight and keeping it off is purely to enjoy a better quality of life, to get the most out of our brief time on this earth.Dieting Causes Brain Damage identifies the most common causes of weight gain as well as the perils of extreme dieting, suggesting that the number-one lesson is to \"Keep your mouth shut.\" This reduces the number of calories consumed and stops you from constantly whining and making excuses about your appearance.You don't need a PhD., millions of dollars, plastic surgery, a library of fad diet books, or a Day-Glo Lycra bodysuit to get into shape. Eating well, enjoying quality sleep, and getting a little exercise is the key to weight loss and personal health and fitness.This wonderful gift book is for anyone who would like to be in better shape and could use a few laughs along the way-a uniquely refreshing guide to looking, feeling, and living well that is free from false promises, tasteless recipes, and leg warmers.",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Metropolitan Opera Book of Mozart Operas",
        "Authors": "By Metropolitan Opera, Mozart, Wolfgang Amadeus",
        "Description": "Seven librettos include \"Don Giovanni,\" \"Cosi Fan Tutte,\" and \"The Magic Flute\"",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Judah P. Benjamin - The Jewish Confederate",
        "Authors": "By Evans, Eli N.",
        "Description": "Traces the life of Benjamin, the first Jewish U.S. Senator, and the Confederate Secretary of State, and describes his exile in England",
        "Category": " Religion , Judaism , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "The Agricola and the Germania (Penguin Classics)",
        "Authors": "By Tacitus, Cornelius",
        "Description": "",
        "Category": " History , Europe , Italy",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1971"
        }
    },
    {
        "Title": "Charles Schwab's Guide to Financial Independence: Simple Solutions for Busy People",
        "Authors": "By Schwab, Charles R.",
        "Description": "The founder and CEO of a powerful brokerage firm shares his in-depth knowledge of the market, helping readers develop investment strategies and goals, and teaching them how to adjust their investment plans based on life changes. Reprint. 60,000 first printing.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "You and Your Dog",
        "Authors": "By Scott, Peter and Taylor, David",
        "Description": "A fully illustrated guide to dog care, packed with detailed practical information on every aspect of keeping your pet healthy, happy, and in good condition. Every popular breed shown in full-color photos.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Martin Luther King, Jr., on Leadership: Inspiration and Wisdom for Challenging Times",
        "Authors": "By Phillips, Donald T.",
        "Description": "The author of Lincoln on Leadership analyzes Dr. Martin Luther King, Jr.'s leadership of the Civil Rights movement, from his commitment to peaceful means to his powerful optimism, and applies them to the challenges of business management.",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Eight Habits of the Heart: Embracing the Values that Build Strong Families and Communities (African American History (Penguin))",
        "Authors": "By Taulbert, Clifton L.",
        "Description": "In his trilogy of memoirs that includes Once Upon A Time When We Were Colored, The Last Train North, and Watching Our Crops Come In, Clifton Taulbert introduced us to a host of relatives and friends--affectionately known as the porch people--who were an integral part of his upbringing in his native Glen Allan, Mississippi.  Although these people were limited in financial resources, they were rich in love and wisdom and taught him lessons that proved to be invaluable.  Using his own success as proof that by building strong communities, we build strong individuals, Taulbert revisits these elders and their lessons in Eight Habits of the Heart : Embracing the Values that Build Strong Families and Communities (Penguin Books; January 5, 1999; $9.95). Eight Habits of the Heart grew out of a commencement speech that Taulbert delivered in 1995 at the North Shore Country Day School in Winnetka, Illinois.  Wanting to leave a lasting impression on America's future leaders, but not knowing exactly what to say, Taulbert illustrated the community building practices that he learned from Poppa Joe, Ma Ponk, Preacher Hurn, and others in his beloved Mississippi Delta.  He realized that a lot of the good will that these people showed one another was habitual and was offered out of love and respect.  And that if we all practiced those same acts of kindness-- habits of the heart--in our day-to-day lives, not only would we build a strong community for ourselves and future generations, but we would have the potential to build a strong nation.With rich and poignant personal stories, Clifton Taulbert illustrates each habit and shows readers how to embrace these values:Nurturing Attitude:  \"Unselfish caring, supportiveness, and a willingness to share time\" despite hardships; the ability to give our children \"the best of what has been provided to us.\"Dependability: \"Being there for others through all the times of their lives, a steady influence that makes tomorrow a welcome event.\"Responsibility: \"Showing and encouraging a personal commitment to each task.\"Friendship: The ability to bind together and \"take pleasure in each other's company.\"  Listening, laughing, and sharing good times and bad.Brotherhood:  Reaching beyond comfortable relationships \"to extend a welcome to those who may be different from yourself.\"High Expectations:  \"Believing that others can be successful, telling them so, and praising their accomplishments.\"Courage:  \"Standing up and doing the right thing, speaking out on behalf of others, and making a commitment to excellence in the face of adversity or the absence of support.\"Hope:  \"Believing in tomorrow--because you have learned to see with your heart.\"Taulbert also includes a series of \"Exercises for Reflection\" that can be used by families, businesses, schools, worship groups, reading clubs, and others to help motivate the building of stronger relationships and communities.  His voice shines through as a refreshing guide to the spiritual core we as a society seem always to be seeking.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Right Dog For You",
        "Authors": "By Tortora, Daniel F.",
        "Description": "How to find the perfect match for you...Here is a systematic and enjoyable way to choose a dog. This highly informative and useful book will take the guesswork out of choosing a dog while leaving in the fun. It will tell you about more than 110 breeds and help you to select a dog compatible with your personality, family, and lifestyle. Choosing a dog can become easy and enjoyable as you learn everything there is to know about the breeds, including: -physical characteristics—height, weight, strength, coat color and texture, tendency to shed, and food requirements -temperamental characteristics—indoor/outdoor activity level, emotional stability, sociability, training potential, and watchdog/guard-dog ability -popularity, background, and unique qualities of each breed -This fully illustrated guide includes easy-to-read tables and pages of practical advice, plus a miniquestionnaire to help you narrow down your selection to the perfect match for you, your family, and your lifestyle.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Blueprint for Action: A Future Worth Creating",
        "Authors": "By Barnett, Thomas P. M.",
        "Description": "The author of the groundbreaking bestseller takes his cutting-edge analysis to the next level.  In civilian and military circles alike, The Pentagon's New Map became one of the most talked-about books of the year. The Pentagon's New Map combined security, economic, political, and cultural factors to provide a fundamental reexamination of war and peace in the post-9/11 world, and a compelling vision of the future. Now, senior adviser and military analyst Barnett tells us how we get to that future. In a book at once pragmatic, thought-provoking, and optimistic, he explores both the long- and short-term pathways for governments, institutions, and individuals alike. Paying particular attention to such nations and regions as Iran, Iraq, and the Middle East, China, North Korea, Latin America, and Africa, he outlines the strategies to pursue, the entities to create, the pitfalls to overcome.  If the first book was a compelling framework for confronting twenty-first-century problems, the new book is something more-a powerful road map through a chaotic and uncertain world to \"a future worth creating.\"",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Liver Cleansing Diet: Love Your Liver and Live Longer",
        "Authors": "By Cabot, Sandra",
        "Description": "Describes the function of the liver in health and illness, and includes a collection of recipes formulated to combat headaches, low metabolism, irritable bowel syndrome, allergies, and fatigue",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "SCB International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Portraits from the White House: Presidents: Washington to Bush",
        "Authors": "By Patrick, Sam J",
        "Description": "Full-color portraits depict every president to date; a biographical sketch outlining ancestry, place of birth, prior occupation, terms in office, and noteworthy events of his presidency accompanies each",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Chasing Rickshaws",
        "Authors": "By Wheeler, Tony and Janson, Richard",
        "Description": "Looks at rickshaws and the people who operate them in Agra, Calcutta, Hanoi, Macau, Penang, Singapore, Beijing, Dhaka, Hong Kong, Manila, Rangoon, and Yogyakarta",
        "Category": " Photography , General",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Setting Your Weight: A Complete Program (Fitness, Health and Nutrition)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "HTML & XHTML : The Definitive Guide",
        "Authors": "By Musciano, Chuck and Kennedy, Bill",
        "Description": "HTML is changing so fast it's almost impossible to keep up with  developments.  XHTML is HTML 4.0 rewritten in XML; it provides the precision of XML while retaining the flexibility of HTML. HTML & XHTML: The Definitive Guide, 4th Edition, brings it all together. It's the most comprehensive book available on HTML and XHTML today. It covers Netscape Navigator 6.0, Internet Explorer 5.0, HTML 4.01, XHTML 1.0, JavaScript, Style sheets, Layers, and all of the features supported by the popular web browsers.Learning HTML and XHTML is like learning any new language, computer or human. Most students first immerse themselves in examples. Studying others is a natural way to learn, making learning easy and fun.  Imitation can take learning only so far, though. It's as easy to learn bad habits through imitation as it is to acquire good ones. The better way to become HTML-fluent is through a comprehensive reference that covers the language syntax, semantics, and variations in detail and demonstrates the difference between good and bad usage.HTML & XHTML: The Definitive Guide, 4th Edition, helps in both ways: the authors cover every element of HTML/XHTML in detail, explaining how each element works and how it interacts with other elements. Many hints about HTML/XHTML style smooth the way for writing documents that range from simple online documentation to complex presentations. With hundreds of examples, the book gives web authors models for writing their own effective web pages and for mastering advanced features, like style sheets and frames.HTML & XHTML: The Definitive Guide, 4th Edition, shows how to:Implement the XHTML 1.0 standard and prepare web pages for the transition to XML browsersUse style sheets and layers to control a document's appearanceCreate tables, from simple to complexUse frames to coordinate sets of documentsDesign and build interactive forms and dynamic documentsInsert images, sound files, video, Java applets, and JavaScript programsCreate documents that look good on a variety of browsersThe book comes with a handy quick reference card listing HTML tags.",
        "Category": " Computers , Web , Design",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "For the Love of Dogs",
        "Authors": "By Thornton, Kim Campbell, Guidry, Virginia Parker, and Thorton, Kim Campbell",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Pubns Intl Ltd",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Coping with Difficult People: The Proven-Effective Battle Plan That Has Helped Millions Deal with the Troublemakers in Their Lives at Home and at Work",
        "Authors": "By Bramson, Robert M",
        "Description": "Bosses, friends, family members, they've made  your life hell -- until now! Based on fourteen years  of research and observation, Dr. Robert Bramson's  proven-effective techniques are guaranteed to help  you right the balance and take charge of your  life. Learn how to: Stand up to anyone --  without fighting. Blunt a sniper's  attack. Get a clam to talk. Cut off a  Sherman tank at the pass. Manage  bulldozers. Get stallers off the dime.  Move a complainer into a problem-solving  mode. Learn the six basic steps that allow you to  cope with just about anyone. Reclaim the power  the rightfully belongs to you in any relationship!",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Hornet's Nest (Andy Brazil)",
        "Authors": "By Cornwell, Patricia Daniels",
        "Description": "Patricia Cornwell turns from forensics to police procedures in her latest novel, Hornet's Nest. This book is less a thriller than a character study of the main characters: Judy Hammer, chief of police in Charlotte, North Carolina; Hammer's deputy, Virginia West; and Andy Brazil, a young reporter assigned to ride with the police as they go about their jobs.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "The Enemy Within",
        "Authors": "By Bond, Larry",
        "Description": "America's largest cities are in flames. Its majestic landmarks are in ruins. Oceans and boundaries offer no protection. It is the first sophisticated, intelligently planned, and utterly ruthless terrorist campaign waged on U.S. soil. As national leaders, armies, and artificial intelligence strive to win the unconventional war, two men--once friends, now adversaries to the death--race to a decisive confrontation.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Vision",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "ASPCA Complete Dog Care Manual",
        "Authors": "By Fogle, Bruce",
        "Description": "A comprehensive canine care reference contains sections on nutrition, health, essentials of care, feeding, grooming, first aid, caring for older dogs, obedience training, and other key topics. By the author of Know Your Dog.",
        "Category": " Pets , Dogs , General",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Psychiatric Care Planning (Springhouse Care Planning Series)",
        "Authors": "By Krupnick, Susan L. W. (EDT) and Wade, Andrew J. (EDT)",
        "Description": "Newly revised to include thoroughly updated plans of care, including the latest treatments for child and elder abuse; updated NANDA taxonomy, assessment tools, and interview guides; most recent DSM-IV criteria and psychiatric drugs; and sample clinical pathways.  Contents include overview of psychiatric nursing; anxiety disorders; mood disorders; psychotic disorders; personality disorders; adjustment disorders; age-specific disorders; addiction disorders; eating disorders; psychophysiologic disorders; sleep disorders; sex-related disorders; disorders associated with violence; assessment tools; and appendices, such as DSM-IV classification, NANDA diagnostic categories, commonly prescribed medications associated with sexual adverse effects and dysfunctions, managing adverse effects of psychotic medications, and resources for clients and families.",
        "Category": " Medical , Nursing , Psychiatric",
        "Publisher": "Springhouse Pub Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Training Your Dog: A Day-By-Day Program",
        "Authors": "By Berman, Kathleen and Landesman, Bill",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Low Cholesterol Oat Plan",
        "Authors": "By Schlesinger, Sarah and Earnest, Barbara R.",
        "Description": "Contains recent findings on the benefits of eating oats--including lowered cholesterol, reduced risk of disease, and weight maintenance",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "A Lasting Promise: A Christian Guide to Fighting for Your Marriage",
        "Authors": "By Stanley, Scott (EDT)",
        "Description": "Build a Marriage of Lasting Love   Finally a practical, easy-to-read book that deals with real marital issues from a Christian perspective! Soundly based on both biblical principles and marital research, A Lasting Promise is a must read for any couple who wants to upgrade their marriage and make it a promise for life!  --David and Claudia Arp, authors of The Second Half of Marriage   This essential resource offers Christian couples, a well-researched and proven method for dealing with conflicts and resolving problems in their marriage.   A Lasting Promise (Older Edition) offers solutions to common problems--facing conflicts, problem solving, improving communication, and dealing with core issues--within a religious framework. With the ultimate purpose of upholding the sanctity of marriage, the book is filled with stories that reflect the sacred teachings of the scripture. The strategies outlined can help Christian couples to improve communication, understand commitment, bring more fun into their relationship, and even enhance their sex life. This book will serve as an invaluable resource for all couples who want to honor and preserve the holy sacrament of their union.",
        "Category": " Religion , Spirituality",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "All the Weyrs of Pern: Dragonriders of Pern, Vol. 11",
        "Authors": "By McCaffrey, Anne",
        "Description": "The dragonriders of Pern have dedicated their lives to fighting Thread, spores that rained on and ravaged the land, and now they finally have the chance to eradicate it forever",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "America takes over (The Vietnam experience)",
        "Authors": "By Doyle, Edward, Lipsman, Samuel, the editors of Boston Publishing Company",
        "Description": "",
        "Category": "",
        "Publisher": "Time Life",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Everyday Writer/With 2001 Apa Update",
        "Authors": "By Lunsford, Andrea A.",
        "Description": "",
        "Category": " Reference , Writing Skills",
        "Publisher": "Bedford/St Martins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Chasing Silver",
        "Authors": "By Craig, Jamie",
        "Description": "Born in 2057, Remy Capra never expected a second chance at life in LosAngeles, or her only chance at love in 2007. On the run from a cop who caresmore about pain than justice, Remy inadvertently goes 75 years back in time andabruptly arrives at the feet of P.I. Nathan Pierce. Remy needs help, and Nathanfinds he wants to offer her even more. There are threats from all sides — are their street smarts and unexpected passion enough to keep them together...and alive?",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Juno Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Goliath",
        "Authors": "By Geddes, Paul",
        "Description": "Instructed to locate the step-daughter of a high ranking British government official, Mark Egerton finds himself framed and suspended from the case, and retired detective Ludovic Fender is enlisted to solve the puzzle",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "German for Travelers (Berlitz Phrase Books)",
        "Authors": "By Berlitz Guides",
        "Description": "",
        "Category": "",
        "Publisher": "Berlitz Guides",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Frommer's Florence & Tuscany Day by Day (Frommer's Day by Day - Pocket)",
        "Authors": "By Porter, Darwin and Prince, Danforth",
        "Description": "These attractively priced, four-color guides offer dozens of neighborhood and thematic tours, complete with hundreds of photos and bulleted maps that lead the way from sight to sight. Day by Days are the only guides that help travelers organize their time to get the most out of a trip. Full-color package at an affordable priceStar ratings for all hotels, restaurants, and attractionsFoldout front covers with maps and quick-reference informationTear-resistant map in a handy, reclosable plastic walletHandy pocket-sized trim28 Self-guided Tours. 33 Maps. One Great Trip.Features: Tuscany for Food & Wine lovers, Tuscany For Art & Architecture lovers, Tuscany For Families and moreAt last, a travel guide that tells you how to see the best of everything--in the smartest, most time-efficient way.The best of Florence & Tuscany in one, two, or three daysThematic tours for every interest, schedule, and tasteWalking tours of the city's best-loved neighborhoodsHundreds of evocative color photosBulleted maps that show you how to go from place to placeHotels, restaurants, shopping, and nightlife for all budgetsA tear-resistant foldout map--enclosed in a handy plastic wallet you can also use for tickets and souvenirsFrommer's. The best trips start here. Visit us online at Frommers.com",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Murder at the Opera: A Capital Crimes Novel",
        "Authors": "By Truman, Margaret",
        "Description": "Margaret Truman, who knows where all the bodies are buried inside the Beltway, has written her most thrilling novel of suspense yet. Murder at the Opera features the popular crime-fighting couple Mac Smith and his wife, Annabel Reed-Smith, as they navigate the glitz, glamour, and grime that is Washington, D.C.It ain’t over till the fat lady sings . . . but the show hasn’t even started yet when a diva is found dead. The soprano in question, a petite young Asian Canadian named Charise Lee, was scarcely a star at the Washington National Opera. But when the aspiring singer is stabbed in the heart backstage during rehearsals, she suddenly takes center stage.Georgetown law professor Mac Smith thought he’d just be carrying a rapier in Tosca as a favor for his beloved Annabel, but now they’re both being pressured by the panicked theater board to unmask a killer. Providing accompaniment will be former homicide detective, current P.I., and eternal opera fan Raymond Pawkins.Soon the Smiths find themselves dangerously improvising among an expanding cast of suspects with all sorts of scores to settle. What they uncover is an increasingly complex case reaching far beyond Washington to a dark world of informers and terror alerts in Iraq, and climaxing on a fateful night at the opera attended by none other than the President himself.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Mark: The Beast Rules the World (Left Behind No. 8)",
        "Authors": "By LaHaye, Tim F. and Jenkins, Jerry B.",
        "Description": "The exciting eighth book in the Left Behind series has sold over 2.5 million copies in hardcover and is now available in trade paperback. With over 40 million products sold, the Left Behind series is an international phenomenon.",
        "Category": " Fiction , Literary",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Four Roses for Sarah",
        "Authors": "By Edwards, Gerry",
        "Description": "",
        "Category": " Fiction , Romance , General",
        "Publisher": "PublishAmerica",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Introductory algebra",
        "Authors": "By Wright, D. Franklin",
        "Description": "",
        "Category": "",
        "Publisher": "Hawkes Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "What Einstein Didn't Know: Scientific Answers to Everyday Questions",
        "Authors": "By Wolke, Robert L.",
        "Description": "A science columnist for The Washington Post offers an entertaining, witty, and fascinating collection of explanations of the everyday phenomena of the natural world, along with amazing science \"bar bets\" and forty-eight ingenious experiments. Reprint.",
        "Category": " Science , Reference",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Guide to Managerial Communication",
        "Authors": "By Munter, Mary",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "DEL-Listen Up: Voices From the Next Feminist Generation",
        "Authors": "By Findlen, Barbara (EDT)",
        "Description": "Exploring and revealing the lives of today's young feminists--the \"Third Wave\"--a collection of essays by thirty diverse members of the \"twenty-something\" generation covers a wide range of topics including racism, sex, identity, AIDS, revolution, and abortion. Original. IP.",
        "Category": "",
        "Publisher": "Seal Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Yorkshire Terriers (Complete Pet Owner's Manuals)",
        "Authors": "By Jankovics, Gyorgy (ILT), Kriechbaumer, Armin, Vriends, Matthew M. (EDT), and Luft, Kathleen (TRN)",
        "Description": "Now in a new edition with updated information and fine full-color photos and line drawings, this manual tells owners and prospective owners everything they need to know about Yorkies. Here is advice on purchasing, health care, nutrition, training, exercise, grooming, and information on breeding and showing this handsome and popular little dog.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Ethical Issues in Modern Medicine",
        "Authors": "By Arras, John D. (EDT) and Steinbock, Bonnie (EDT)",
        "Description": "This comprehensive anthology represents the key issues and problems in the field of medical ethics through the most up-to-date readings and case studies available. Each of the book's five parts is prefaced with helpful introductions that raise important questions and skillfully contextualize the positions and main points of the articles that follow.",
        "Category": " Medical , Ethics",
        "Publisher": "Mayfield Pub Co",
        "Price Starting With ($)": "6.83",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Through the Brick Wall: How to Job-Hunt in a Tight Market",
        "Authors": "By Wendleton, Kate",
        "Description": "Here is a unique, business-oriented approach to job hunting which provides the reader with step-by-step instructions in finding a new and/or improved position. Wendleton explains why the \"tried and true\" techniques no longer work and includes up-to-the-minute job-hunting techniques and astute lessons on how to turn interviews into offers.",
        "Category": " Business & Economics , Personal Success",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "Broken Horse (The Saddle Club, Book 61)",
        "Authors": "By Bryant, Bonnie",
        "Description": "When a sick, abused horse is rescued and brought to Pine Hollow, every effort is made to save the horse's life, and Lisa, remembering the death of another abused horse, struggles to restore the horse's broken spirit. Original.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Skylark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "The Complete Book of Contemporary Business Letters",
        "Authors": "By Elliott, Stephen P. (EDT) and Strategic Communications (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Round Lake Pub Co",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Broken Hearts (Lizzie McGuire)",
        "Authors": "By Thorpe, Kiki",
        "Description": "\"Gordo's always been there for Lizzie--a true best friend. But when he starts secretly dating pretty Brooke Baker, everything changes ...\"",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Mysterious Britain",
        "Authors": "By Bord, Colin and Bord, Janet",
        "Description": "",
        "Category": "",
        "Publisher": "Paladin",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Symptoms",
        "Authors": "By Rosenfeld, Isadore",
        "Description": "Basic information for a general audience. No bibliography. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Health & Fitness , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "THINKING ABOUT MANAGEMENT",
        "Authors": "By Levitt, Theodore",
        "Description": "In twenty-seven innovative briefings, the author discusses management theory and practice and emphasizes the importance of such skills as listening and learning",
        "Category": " Education , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Outwitting Deer: 101 Truly Ingenious Methods and Proven Techniques to Prevent Deer from Devouring Your Garden and Destroying Your Yard",
        "Authors": "By Adler, Bill",
        "Description": "Discusses ways to keep gardens and shrubbery safe from deer and includes strategies to protect yourself from Lyme disease and avoid collisions with deer while driving",
        "Category": " Nature , Ecosystems & Habitats , Rivers",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Getting elected;: A guide to winning state and local office,",
        "Authors": "By Atkins, Chester G",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Guilt is the Teacher, Love is the Lesson",
        "Authors": "By Borysenko, Joan",
        "Description": "The author draws on her own clinical practice to explain how chronic guilt and pessimism can affect health and offers a recovery regimen based on affirmation, forgiveness, and love",
        "Category": " Body, Mind & Spirit , Healing , Prayer & Spiritual",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Gus and the Baby Ghost",
        "Authors": "By Thayer, Jane",
        "Description": "Gus, the ghost, and Mr. Frizzle, the museum keeper, have a difference of opinion about the baby ghost abandoned on the museum doorstep.",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1972"
        }
    },
    {
        "Title": "Time Eyewitness: 150 Years of Photojournalism",
        "Authors": "By Lacayo, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Time Home Entertainment Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Talking Money: Everything You Need to Know about Your Finances and Your Future",
        "Authors": "By Chatzky, Jean",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Business Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Chicken Soup for the Teenage Soul IV: More Stories of Life, Love and Learning (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Kirkberger, Kimberly (COM), and Claspy, Mitch (COM)",
        "Description": "We all have a story to tell. We often judge our own stories as being good or bad, right or wrong. The truth is, each and every one of them not only holds meaning for us but for those around us as well. Chicken Soup for The Teenage Soul IV is filled with such stories: what it really means to be a teenager in today's world. Are you having a tough time with your best friend? Trying to get your crush to notice you? Recovering from a heart-wrenching breakup? Are you dealing with something even more difficult, like coping with the death of someone you love? Chicken Soup for the Teenage Soul IV shows you that you're not alone. You'll see yourself in these stories filled with compassion, love and wisdom from teens who have made it through the hard times and triumphed.These are real stories about real life you won't want to put down 'til you've read the last page.",
        "Category": " Young Adult Nonfiction , Social Topics , Emotions & Feelings",
        "Publisher": "HCI Teens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Low Calorie Cookbook",
        "Authors": "By Ideals",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Publishing+corporation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "LIGHT COOKING/LOW FAT CALORIE CHOLESTEROL by Ltd Publications Intl ed (1994) Hardcover",
        "Authors": "By Various Authors",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "50 ways to lose ten pounds (Medical book of remedies)",
        "Authors": "By Horbiak, Joan",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Complete Book of Dog Health: The Animal Medical Center",
        "Authors": "By Kay, William J. (EDT), Makris, Nancy Lou (ILT), Randolph, Elizabeth (EDT), and Animal Medical Center (U. S.) (COR)",
        "Description": "The Complete Book of Dog Health--The Best Investment You Can Make for Your Dog! Whether you've spent a lifetime raising dogs or have just bought your first pup, The Complete Book of Dog Health offers everything you need to keep your dog healthy and happy. The Animal Medical Center, one of the nation's foremost pet health-care centers, details all your canine concerns in simple, straightforward language. Brimming with useful facts, charts, checklists, and the seventy-five years of expertise that only The Animal Medical Center can provide, The Complete Book of Dog Health gives you all the information you need to keep your favorite pet in howling good shape.A Howell Dog Book of Distinction",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "From Selling to Managing: Guidelines for the First-Time Sales Manager",
        "Authors": "By Brown, Ronald",
        "Description": "",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "God Calls a People: A Journey Through the Old Testament",
        "Authors": "By Twigg, Blanche",
        "Description": "",
        "Category": "",
        "Publisher": "St. Anthony Messenger Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "They Shoot Managers, Don't They?: Making Conflict Work in a Changing World",
        "Authors": "By Paulson, Terry L.",
        "Description": "Tells how to overcome bad days, confront difficult employees, generate enthusiasm, and become an effective leader.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Edith and Woodrow: A Presidential Romance",
        "Authors": "By Shachtman, Tom",
        "Description": "Drawing on recently released letters and diaries of Woodrow Wilson and Edith Galt, Shachtman presents an intimate account of their passionate romance and marriage against a backdrop of world events during Wilson's presidency",
        "Category": " History , General",
        "Publisher": "Putnam Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "Kennedy Assassinated! The World Mourns: A Reporter's Story",
        "Authors": "By Hampton, Wilborn",
        "Description": "The astonishing story of a cub reporter who was there on the day that the President died.On November 22, 1963, the phone rang in the Dallas U.P.I. office.  Wilborn Hampton, a cub reporter, answered and heard these words: \"Three shots fired!\"  It was the voice of the U.P.I. White House reporter.  The gunshots had been fired at President Kennedy—and young Hampton was the first to receive the news.  This is his story, a riveting account of a young man swept into the white-hot core of a tragedy that would shake the world.  It is also a minute-by-minute chronicle of how reporters collected the facts of the major news story of the twentieth century.  KENNEDY ASSASSINATED! will leave readers with an unforgettable sense of the shock, grief, and enduring loss that every American experienced that day.",
        "Category": " Young Adult Nonfiction , History , United States , 21st Century",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Fireside Chats",
        "Authors": "By Roosevelt, Franklin D.",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Mastering the Art of Communication: Your Keys to Developing a More Effective Personal Style",
        "Authors": "By Poley, Michelle F.",
        "Description": "",
        "Category": " Self-help , General",
        "Publisher": "Skillpath Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Winter Palace (Priceless Collection Series #3)",
        "Authors": "By Bunn, T. Davis",
        "Description": "Jeffrey Sinclair, an antiques trader, travels to Russia in an attempt to reclaim the winter palace for a Russian nobleman, whose family lost everything during the revolution",
        "Category": " Fiction , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Millennium: A History of the Last Thousand Years",
        "Authors": "By Fernandez-Armesto, Felipe",
        "Description": "Millennium is the most exciting sort of popular history. The narrative of Millennium begins in Japan in the year 1005 with a visit to the author of The Tale of Genji ... the same place it ends 990 years later. In between, it follows the civilizations of the world - from the eleventh-century Caliphate of Cordova to fourteenth-century Mesoamerica to fifteenth-century Russia to twentieth-century America - tracking the geographic drift westward of historical initiative from the eastern shores of the Pacific to the Atlantic and back again. In a single chapter, this book moves from the founding of the Ming Dynasty to sixteenth-century Amsterdam to the empires of the Inca and Aztec. Dazzlingly written, scrupulous in its scholarship, Millennium is a book on a grand scale, with more ambition, erudition, relevance, and enduring interest than any popular history ever written.",
        "Category": " History , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "A New Christianity for a New World: Why Traditional Faith is Dying & How a New Faith is Being Born",
        "Authors": "By Spong, John Shelby",
        "Description": "In his bestselling book Why Christianity Must Change or Die, Bishop John Shelby Spong described the toxins that are poisoning the Church. Now he offers the antidote, calling Christians everywhere into a new and radical reformation for a new age. Spong looks beyond traditional boundaries to open new avenues and a new vocabulary into the Holy, proposing a Christianity premised upon justice, love, and the rise of a new humanity -- a vision of the power that might be.",
        "Category": " Religion , Christianity , General",
        "Publisher": "SanFran",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Lyndon B. Johnson and the World",
        "Authors": "By Geyelin, Philip",
        "Description": "",
        "Category": "",
        "Publisher": "Praeger",
        "Price Starting With ($)": "5.85",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Lifetypes",
        "Authors": "By Hirsh, Sandra Krebs and Kummerow, Jean",
        "Description": "Presents a personality test designed to promote better understanding of one's strengths and weaknesses using the Myers-Briggs Type Indicator which is based on the Swiss psychiatrist Carl Jung's theory on personality types",
        "Category": " Self-help , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Veil of Roses",
        "Authors": "By Fitzgerald, Laura",
        "Description": "This compelling debut follows one spirited young woman from the confines of Iran to the intoxicating freedom of America—where she discovers not only an enticing new country but the roots of her own independence. . . .Tamila Soroush wanted it all. But in the Islamic Republic of Iran, dreams are a dangerous thing for a girl. Knowing they can never come true, Tami abandons them. . . . Until her twenty-fifth birthday, when her parents give her a one-way ticket to America, hoping she will “go and wake up her luck.” If they have their way, Tami will never return to Iran . . . which means she has three months to find a husband in America. Three months before she’s sent back for good.From her first Victoria’s Secret bra to her first ride on a motor scooter to her first country line-dance, Tami drinks in the freedom of an American girl. Inspired to pursue her passion for photography, she even captures her adventures on film. But looming over her is the fact that she must find an Iranian-born husband before her visa expires. To complicate matters, her friendship with Ike, a young American man, has grown stronger. And it is becoming harder for Tami to ignore the forbidden feelings she has for him.It’s in her English as a second language classes that Tami finds a support system. With the encouragement of headstrong Eva, loyal Nadia, and Agata and Josef, who are carving out a love story of their own, perhaps Tami can keep dreaming—and find a way to stay in America.",
        "Category": " Fiction , Sagas",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Carpenter a Psersonal Look At Jesus",
        "Authors": "By Kenneth J. Holland",
        "Description": "",
        "Category": "",
        "Publisher": "Brand:",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Bls for Healthcare Providers",
        "Authors": "By Louisiana Tech University (COR)",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Amer Heart Assn Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Truly, Madly Manhattan",
        "Authors": "By Roberts, Nora",
        "Description": "Single mother Hester Wallace reluctantly begins to care about comic book creator Mitch Dempsey; and cynical Booth DeWitt becomes unwillingly fascinated with actress Ariel Kirkwood, who is playing the role of his cruel ex-wife.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Intensity",
        "Authors": "By Koontz, Dean R.",
        "Description": "In the space of 24 hours, self-proclaimed \"homicidal adventurer\" Edgar Foreman Vess sets out to murder everyone in the home of Chyna Shepherd. But a drive even stronger than survival spurs Chyna to unexpected heights of courage and daring, thrusting her into a deadly confrontation with a remorseless, relentless killing machine. HC: Alfred A. Knopf.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Golding's Lord of the Flies (Cliffs Notes)",
        "Authors": "By Calandra, D. M. (EDT)",
        "Description": "",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1964"
        }
    },
    {
        "Title": "Is That Your Final Answer",
        "Authors": "By Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Modern Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Creative Writing",
        "Authors": "By Rozakis, Laurie",
        "Description": "The Complete Idiot's Guide to Creative Writing takes the fear out of writing intriguing plays, articles, scripts and more.  Feel confident about getting what you want to say down on paper and getting paid for it.  This guide includes valuable tips for finding the style of writing that's best for you, proven techniques for structuring plot and character and building dramatic tension, and expert advice on what an agent can do for your career.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Chrismukkah: Everything You Need to Know to Celebrate the Hybrid Holiday",
        "Authors": "By Gompertz, Ron",
        "Description": "Christmas meets Hanukkah for millions of mixed-faith families—who deck their trees with Stars of David and spin the dreidel under mistletoe. Here is a one-of-a-kind, amusingly illustrated and endlessly entertaining guide to the joys—and oys—of celebrating Chrismukkah, the hybrid holiday. A veritable cornucopia of seasonal delights, this handy (and often hilarious) lifestyle guide walks us through all the Chrismukkah events, history, and lore. You’ll learn about hybrid holiday traditions in decorating (ornaments, wreaths, menorahs, dreidels); innovative tchotchkes (Chrismukkah cards, stockings, lights); and a plethora of menorah options (Godzilla or snowman, anyone?). Plus, the book includes rollicking games to play and songs to sing, along with easy-to-follow recipes for Latkes with Sugar Plum Fairy Sauce, General Saul’s Chicken, Mama Mia Matzah Pizza!, Blitzen’s Blintzes, and other Noel Noshes. Your yuletide happy hours will never be the same once you start mixing a Yule Plotz, Meshugga Nog, or Manishewitz Mulled Wine. Rounding out the mix are chapters on snazzy holiday hats and caps, interfaith dog and cat gift suggestions, and office-party dos and don’ts. It’s beginning to look a lot like Chrismukkah, and now we’ll all be ready to celebrate with style! Christmas meets Hanukkah for millions of mixed-faith families—who deck their trees with Stars of David and spin the dreidel under mistletoe. Here is a one-of-a-kind, amusingly illustrated and endlessly entertaining guide to the joys—and oys—of celebrating Chrismukkah, the hybrid holiday. A veritable cornucopia of seasonal delights, this handy (and often hilarious) lifestyle guide walks us through all the Chrismukkah events, history, and lore. You’ll learn about hybrid holiday traditions in decorating (ornaments, wreaths, menorahs, dreidels); innovative tchotchkes (Chrismukkah cards, stockings, lights); and a plethora of menorah options (Godzilla or snowman, anyone?). Plus, the book includes rollicking games to play and songs to sing, along with easy-to-follow recipes for Latkes with Sugar Plum Fairy Sauce, General Saul’s Chicken, Mama Mia Matzah Pizza!, Blitzen’s Blintzes, and other Noel Noshes. Your yuletide happy hours will never be the same once you start mixing a Yule Plotz, Meshugga Nog, or Manishewitz Mulled Wine. Rounding out the mix are chapters on snazzy holiday hats and caps, interfaith dog and cat gift suggestions, and office-party dos and don’ts. It’s beginning to look a lot like Chrismukkah, and now we’ll all be ready to celebrate with style!",
        "Category": " Cooking , Holiday",
        "Publisher": "Stewart, Tabori and Chang",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Last Raider (A Pocket Cardinal Edition)",
        "Authors": "By REEMAN, Douglas",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Pretty Good Joke Book 4th edition",
        "Authors": "By Keillor, Garrison (INT)",
        "Description": "A treasury of hilarity from one of America’s favorite radio shows. A guy walks into a bar. Eight Canada Geese walk into a bar. A termite jumps up on the bar and asks, “Where is the bar tender?” Drum roll. The Fifth Edition of the perennially popular Pretty Good Joke Book is everything the first four were and more. More puns, one-liners, light bulb jokes, knock-knock jokes, and third-grader jokes (have you heard the one about Elvis Parsley?). More religion jokes, political jokes, lawyer jokes, blonde jokes, and jokes in questionable taste (Why did the urologist lose his license? He got in trouble with his peers). More jokes about chickens, relationships, and senior moments (The nice thing about Alzheimer’s is you can enjoy the same jokes again and again). It all started back in 1996, when A Prairie Home Companion fans laughed themselves silly during the first Joke Show. The broadcast was such a hit that it became an almost-annual gagfest. Then fans wanted to read the jokes, share them, and pass them around, and the first Pretty Good Joke Book was born. With 362 new jokes (more or less), the latest edition promises countless giggles, chortles, and guffaws anyone?fans of the radio show or not?will enjoy.",
        "Category": " Humor , Form , Jokes & Riddles",
        "Publisher": "HighBridge Audio",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Pregnancy For Dummies (For Dummies (Computer/Tech))",
        "Authors": "By Stone, Joanne, Eddleman, Keith, M.D., Murray, Mary, and Stone, M.D.",
        "Description": "Pregnancy is among life's greatest adventures, an experience that inspires prospective parents to seek out reliable resources to answer all their newfound questions. Preparing to host a baby for a full term begins with understanding the reproductive process and how the mother's body prepares for and then nurtures its guest. Getting from there through maternity involves looking forward to labor, delivery, and recovery – and taking care of baby as the newborn gets to know the world around him.Written by two practicing obstetricians who have cared for thousands of women and their families Pregnancy For Dummies organizes information so that you can enjoy the unfolding drama one trimester at a time. The informative and easy-to-read guide not only speaks to traditional husband-wife couples who are considering parenthood but alsoSingle parentsSame-sex couplesAdoptive parentsSurrogate parentsPregnancy For Dummies reassures readers with friendly – even fun – looks at fertility issues, signs and symptoms of pregnancy, and helpful advice onChoosing the right practitioner and birthing facilityPreparing for physical changes and mood swingsTaking a childbirth class that suits your delivery choiceHaving a baby from Dad's perspectiveRecognizing the differences between real and false laborUnderstanding the reasons for a cesarean deliveryDealing with complications before and after the birthDeciding between breast and bottleCoping with postpartum bluesDesigned as a companion to regular medical care, Pregnancy For Dummies delivers the kind of insight that can help you stay fit, active, and informed during your pregnancy – and excited about taking on the joyful job of bringing up baby!",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Yes, You Can Still Retire Comfortably!: The Baby-Boom Retirement Crisis and How to Beat It",
        "Authors": "By Stein, Benjamin and Demuth, Phil",
        "Description": "The specter of retirement is haunting the baby-boom generation. The generation that&#8217s used to having it all is suddenly finding that it doesn&#8217t have enough.     Ben Stein and Phil DeMuth show you how to get back on track. They outline the steps you can take today to assure your future tomorrow. Backed up with facts and figures, they lay out exactly how much you need to save in order to maintain your standard of living, and how to invest your dollars to get the maximum return from your savings. For those already retired, they explain how to tap your nest egg to get the most income while keeping your money safe. This is a survival manual for the difficult but exciting road to retirement security.     Don&#8217t leave middle age without it!",
        "Category": " Business & Economics , Personal Finance , Retirement Planning",
        "Publisher": "New Beginnings Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    }
]