[
    {
        "Title": "Complete Guide to Pilates Yoga Meditation Stress Relief",
        "Authors": "By Paragon",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Profitable Investing in the New Century",
        "Authors": "By Feinberg, Andrew",
        "Description": "",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Time Inc",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Middle Ground",
        "Authors": "By Drabble, Margaret.",
        "Description": "Kate Armstrong, a successful English journalist and mother of grown children, faces that moment when--the emotional life of her young womanhood at an end--she must enter her later years with intelligence, understanding, and strength",
        "Category": "",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1980"
        }
    },
    {
        "Title": "Home and Away: Memoir of a Fan",
        "Authors": "By Simon, Scott",
        "Description": "A devout sports fan and NPR commentator describes how the world of sports has shaped his life, discussing sports as a means of enhancing communication between fathers and sons, as well as the influence of sports and larger-than-life sports figures--from Ernie Banks to Michael Jordan--on his own life. 40,000 first printing.",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Fig Eater",
        "Authors": "By Shields, Jody",
        "Description": "Vienna, 1910 - Freud's Vienna, a city of horse-drawn carriages, masked balls, and gaslit cafes hovers on the threshold between darkness and light, superstition and science. The murder of Dora, the haunted daughter of a respectable bourgeois family, is being investigated by the Inspector, newly schooled in rationalist criminology. Almost every aspect of the case remains hidden, untouchable. He is trying to find the \"error in the situation\"- that small link that will lead him to the truth.His wife, Erszebet, a Hungarian steeped in intuition and the lore of Gypsy mysticism, becomes obsessed with the murder and lauches her own parallel, secret investigation. She is sure that the figs found in Dora's stomach are the clue to the identity of the murderer - for there are no fresh figs in Vienna at this time of the year. With the help of a young British governess, she unmasks an entirely other face of the crime, and of the society that would prefer it to be repressed forever.",
        "Category": " Fiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Dropping Your Guard: The Value of Open Relationships",
        "Authors": "By Swindoll, Charles R.",
        "Description": "Una alternativa refrescante a las heridas y temores en las relaciones personales.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Velvet Glove: A Life of Dolly Madison",
        "Authors": "By Gerson, Noel Bertram, Gerson, Noel",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1975"
        }
    },
    {
        "Title": "The Macmillan Visual Almanac",
        "Authors": "By Tesar, Jenny E. and Glassman, Bruce S. (EDT)",
        "Description": "More than two thousand images offer essential overviews of eighty-five general topics, highlighting the pertinent information, giving concise introductory data, and providing visual aids such as graphs, charts, and maps. Reprint.",
        "Category": " Reference , Almanacs",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Tennis and the Meaning of Life: A Literary Anthology of the Game",
        "Authors": "By Jennings, Jay (EDT)",
        "Description": "The only book of its kind, Tennis and the Meaning of Life is a resplendent collection of the best fiction (and poetry!) written about this sport/obsession. The stories are hilarious and sad, whimsical and philosophical - and thoroughly saturated with the art of the game.",
        "Category": " Literary Criticism , American , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Great Escape",
        "Authors": "By Van Impe, Jack",
        "Description": "With the decline of morality, a tumultuous political climate and occurrences of terrorism across the globe, Christians need to be reminded of the hope promised by God's Word. The Great Escape discusses specific details of the Great Tribulation and the Rapture.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Benjamin Franklin: His Life as He Wrote It",
        "Authors": "By Wright, Esmond (EDT)",
        "Description": "Tracing his footsteps centuries later, Franklin’s most celebrated biographer completes the last 25 years of his subject’s autobiography by drawing on Franklin’s most personal and insightful letters and writings—even making additions within the interrupted Autobiography to give us the expository memoir that Franklin intended. Indeed, as he wrote it.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Bunny Money (Max and Ruby)",
        "Authors": "By Wells, Rosemary",
        "Description": "",
        "Category": "",
        "Publisher": "Dial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Citizen You!: Helping Your Government Help Itself",
        "Authors": "By Garden, Joe, Loew, Mike (EDT), and Ostrow, Randy",
        "Description": "In this humorous handbook on proper patriotic behavior, illustrations, pie charts, and informational graphics are provided in chapters that include tips on how to monitor your neighbors, flag care for post-9/11 America, and a faith-based approach to fixing potholes. Original. 20,000 first printing.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "New Press, The",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Scrap Saver's Country Stitchery (Quick & Easy Scrap Crafts)",
        "Authors": "By Foose, Sandra Lounsbury",
        "Description": "Provides patterns and instructions for making toys, gifts, accessories, household items, and seasonal decorations, using scraps and ordinary things found around the home",
        "Category": " Art , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "The Distance from the Heart of Things",
        "Authors": "By Warlick, Ashley",
        "Description": "Meet Mavis Black, whose confidently intimate voice invites readers into the eccentric world of her large southern family. Coming home from college to her grandfather's prosperous Carolina vineyard, Mavis takes the measure of the emotional distance she has traveled from the people closest to her heart: her dreamy mother, her practical aunt, her bewildered boyfriend, her prodigal uncle - and most of all Punk, her grandfather, who plans to make Mavis his sole heir. Told with warmth, wit, and brio, Warlick's first novel rejoices in womanhood and the strength of loving ties. As New York Newsday said of Warlick, \"Her literary talents, not to mention her prospects, are immense.\"",
        "Category": " Fiction , Literary",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The New Nuclear Danger: George W. Bush's Military-Industrial Complex",
        "Authors": "By Caldicott, Helen",
        "Description": "This revised edition includes a new introduction that outlines the costs of operation Iraqi Freedom, details the companies profiting from the war and subsequent reconstruction, and chronicles the rampant conflicts of interest among members of the Bush administration who also have a financial stake in weapons manufacturing. After eight printings in the original edition, The New Nuclear Danger remains a singularly persuasive antidote to war and its horrific costs.",
        "Category": " Political Science , General",
        "Publisher": "The New Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Quotations for All Occasions",
        "Authors": "By Frank, Catherine",
        "Description": "",
        "Category": "",
        "Publisher": "Columbia University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "50 Powerful Ideas You Can Use to Keep Your Customers, Third Edition",
        "Authors": "By Timm, Paul R.",
        "Description": "50 Simple Yet Effective Ways to Keep Customers Happy and Coming Back for MoreUltimately, every successful enterprise must attract, serve, and win the loyalty of customers by providing worthwhile products and delivering excellent service. Getting and maintaining loyal customers affect an organization's bottom line more than any ad campaign, marketing program, or PR effort.This book is designed to get all managers and employees thinking about the little things that can make all the difference. It's a quick read--you can finish it in less time than it takes to deal with one customer complaint. And if you put the information within this book into action, you will be able to decrease customer complaints considerably. It's packed with practical, applicable suggestions that can be put to work immediately, such as how to:-- Turn angry customers into lifelong clients-- Use a simple gesture to immediately put customers at ease-- Listen with more than your ears-- Easily give customers more than they expect-- Use negative feedback for positive actionManagers and staff members alike can use this little manual to avoid the devastating ripple effects that turned-off customers can produce. It will easily show how everyone in a business, large or small, can creatively apply a constant flow of small, customer-centered innovations to create a consistent and persistent strengthening of your customer base.",
        "Category": " Business & Economics , Development , Business Development",
        "Publisher": "Weiser",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Private Life in the Fifteenth Century: Illustrated Letters of the Paston Family",
        "Authors": "By Virgoe, Roger (EDT)",
        "Description": "A collection of family letters and documents spanning three generations of a Norfolk family during the period when England was on the cusp of medieval and modern history (and divided by the Wars of the Roses). Both a picture of everyday life and a portrayal of a family on the fringes of great events. Edited into accessible English, and illustrated to relate the people to the places where they lived. An altogether beautiful job. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Weidenfeld & Nicholson",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "How to Be a Star at Work: 9 Breakthrough Strategies You Need to Succeed",
        "Authors": "By Kelley, Robert E.",
        "Description": "Tracing the habits of innovative employees at companies ranging from Bell Labs to Hewlett-Packard, the author offers readers a dynamic program to turn themselves into innovative professionals by renovating the skills they already possess. 25,000 first printing. Tour.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Crown Business",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The Bush-Haters Handbook: A Guide to the Most Appalling Presidency of the Past 100 Years",
        "Authors": "By Huberman, Jack",
        "Description": "The Bush-Haters Handbook is a godsend to those looking for a concise, mordantly entertaining overview of the Bush record from a liberal perspective, or those who want to arm themselves with talking points, facts, and figures for debates with conservatives, and at those seeking the perfect holiday gift book for that certain, special Bush-hater in their lives?or for a Bush-lover they hope to rescue from the outer darkness. Summarizing, detailing, and bewailing all of the more important Bush administration outrages, and some of the more trivial ones, this book is the brainchild of Jack Huberman, a former Canadian who took up U.S. citizenship just so he could vote against Dubya in 2000. Topics range from abortion, AIDS, Arctic National Wildlife Refuge, and Ashcroft, to women and workplace safety. Other major topics include budget and taxes, civil liberties, death penalty, defense spending, education, environment, gun control, health care, homeland security, Iraq, judicial nominations, ?nucular” weapons, patients’ rights, privacy, public land, September 11 and the war on terror, and social security. In between are a variety of smaller topics, such as Bush’s language abilities (featuring a selection of priceless Bushisms). The pages are also enlivened by sidebars, ?boxed” lists, and political cartoons.",
        "Category": " History , United States , 21st Century",
        "Publisher": "Nation Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Commonsense Book of Complete Cat Care",
        "Authors": "By Vine, Louis L.",
        "Description": "Information on selective breeding, whelping, and pre- and post-natal care is included in a treatment of every aspect of the cat's physical and mental health",
        "Category": " Technology & Engineering , General",
        "Publisher": "Quill",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Guide to Corals and Fishes of Florida, the Bahamas and the Caribbean",
        "Authors": "By Greenberg, Idaz",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Seahawk Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1977"
        }
    },
    {
        "Title": "Suzanne Somers' Fast and Easy: Lose Weight the Somersize Way with Quick, Delicious Meals for the Entire Family!",
        "Authors": "By Somers, Suzanne",
        "Description": "Somersize the fast and easy way and lose weight by eating delicious, home-cooked meals that are perfect for the entire family!For more than ten years, Suzanne Somers has been preaching, “Fat is your friend and sugar is the greatest enemy!” Her Somersize program lets you shed pounds by eating rich, flavorful foods like meat, cheese, cream, butter, and eggs. Medical professionals are now saying what Suzanne and millions of Somersizers already know—the best way to fight the growing obesity epidemic in this country is a diet higher in proteins and real fats, and lower in sugar and carbohydrates.More than 3 million readers have lost weight the Somersize way after reading Suzanne’s New York Times bestsellers Eat Great, Lose Weight; Get Skinny on Fabulous Food; and Eat, Cheat, and Melt the Fat Away. Now, in her new book, Fast and Easy, Suzanne makes Somersizing simple, affordable, and fun for the whole family. Whether you are too busy to cook or worried about feeding your family a healthy meal on a budget, Somersizing is the solution. In Fast and Easy Suzanne teaches you what foods your body converts to sugar and why you need to eliminate them. She outlines her weight-loss program for life, where you’ll forget how to count calories, fat grams, or carbohydrates and simply enjoy delicious foods with no weighing, no measuring, no portion control, and no deprivation. Here you’ll find more reasons to Somersize, including:* How Suzanne’s balanced weight-loss plan is just what the doctor ordered* How to heal your metabolism from years of yo-yo dieting* How to convert your body to a fat-burning machine* How obesity is a growing family problem and how Somersizing can stop it* How to make meals in minutes, and Somersize products that make it even faster and easier to stay on the program* How SomerSweet allows you to say good-bye to sugar without saying good-bye to sweets* Moving, motivating testimonials from enthusiastic Somersizers* Answers to more than 300 of the most frequently asked questions about this remarkably effective and sinfully delicious programAnd, of course, Suzanne treats you to more than 100 new fast and easy recipes that will delight everyone in the family, including Turkey Taco Wraps, Somersize Double Double Cheeseburgers with Fast and Easy Onion Rings, In a Hurry Beef Curry, Cherry Chocolate Trifle, and Boston Cream Pie Cake, plus hometown favorites like Somersize Shake It and Bake It Chicken, Somersize Macaroni and Cheese, Baby-Back Barbecue Ribs, and much, much more.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Crown Archetype",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Liz: An Intimate Biography of Elizabeth Taylor",
        "Authors": "By Heymann, C. David",
        "Description": "Based on more than a thousand interviews with stars, directors, producers, designers, friends, family, business associates, employees, and others and on extensive research among previously undisclosed court, business, medical, and studio documents, Liz portrays Taylor's entire life and career in fascinating, revealing detail. Heymann shows us her very public escapades and her most private moments - frequently through the words of those who have known her best.Here are the highs and lows of her movie career and the intimate circumstances of her marriages to Nicky Hilton, Michael Wilding, Mike Todd, Eddie Fisher, Richard Burton, Senator John Warner, and Larry Fortensky. Here, too, is the truth about Taylor's father and her friendships with leading men Montgomery Clift, James Dean, and Rock Hudson, as well as with the eccentric Malcolm Forbes and Michael Jackson. From her illnesses, injuries, weight swings, and battles against drug and alcohol dependencies to her sexual exploits, diamond-studded luxury, and tumultuous relationships with husbands and lovers, this is the enormously contradictory and glamorous life of Hollywood's last great star.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Citadel",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Dreaming War: Blood for Oil and the Cheney-Bush Junta (Nation Books)",
        "Authors": "By VIDAL, GORE",
        "Description": "When Gore Vidal's recent New York Times bestseller Perpetual War for Perpetual Peace was published, the Los Angeles Times described Vidal as the last defender of the American republic. In Dreaming War, Vidal continues this defense by confronting the Cheney-Bush junta head on in a series of devastating essays that demolish the lies American Empire lives by, unveiling a counter-history that traces the origins of America's current imperial ambitions to the experience of World War Two and the post-war Truman doctrine. And now, with the Cheney-Bush leading us into permanent war, Vidal asks whose interests are served by this doctrine of pre-emptive war? Was Afghanistan turned to rubble to avenge the 3,000 slaughtered on September 11? Or was \"the unlovely Osama chosen on aesthetic grounds to be the frightening logo for our long contemplated invasion and conquest of Afghanistan?\" After all he was abruptly replaced with Saddam Hussein once the Taliban were overthrown. And while \"evidence\" is now being invented to connect Saddam with 9/11, the current administration are not helped by \"stories in the U.S. press about the vast oil wealth of Iraq which must- for the sake of the free world- be reassigned to U.S. consortiums.\"",
        "Category": " Political Science , History & Theory",
        "Publisher": "Bold Type Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Chocolate for a Teen's Dreams: Heartwarming Stories About Making Your Wishes Come True (Chocolate Series)",
        "Authors": "By Allenbaugh, Kay (EDT)",
        "Description": "Chocolate for a Teen's Dreams takes a spirited look at the importance of following your heart. These true stories, by contemporary teens and women with insightful recollections, capture the hope and promise of adolescence and the plans every young woman treasures amid academic demands, social obligations, and family pressures. The Chocolate storytellers reveal how desire and determination can turn vision into reality -- and offer sage advice on what to do when things don't turn out exactly according to plan.  Chocolate for a Teen's Dreams presents a broad spectrum of wishes and frustrations -- from waiting for that special guy to invite you to the prom to figuring out how to get into your first-choice college. Readers will discover their own ambitions and expectations, as well as their fears. They'll meet teens who overcame the odds to achieve their goals and women who learned from disappointment, laughed at their failures, and forged lives that are as rich and sweet as chocolate.",
        "Category": " Young Adult Nonfiction , Social Topics , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Mysterious Bible Codes",
        "Authors": "By Jeffrey, Grant R.",
        "Description": "Best-selling author and noted prophetic scholar Grant R. Jeffrey explores the phenomenon of significant prophetic words found in codes throughout the New and Old Testaments, offering a Christian response to theNew York Times bestseller, The Bible Codes.",
        "Category": " Religion , Biblical Studies , Prophecy",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Sports Supplement Review 3rd Issue",
        "Authors": "By Phillips, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Mile High Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Wake-Up Calls: You Don't Have to Sleepwalk Through Your Life, Love, or Career!",
        "Authors": "By Allenbaugh, Eric, Ph.D.",
        "Description": "A guide to turning life's teachable moments into positive learnings shows how \"breakthrough\" moments--divorces, firings, deaths--offer choices and opportunities to discover new levels of awareness and growth.",
        "Category": " Psychology , Developmental , General",
        "Publisher": "Bard Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "The Flavors of Bon Appetit",
        "Authors": "By Bon Appetit Editors",
        "Description": "Divided into four sections--Starters, Main Courses, On the Side, and Desserts--more than two hundred recipes from Bon Appe+a7tit encompass such culinary treats as Tuscan Walnut Bread, Sesame Asparagus, and Flourless Chocolate Torte. 15,000 first printing.",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Eyewitness: A Personal Account of the Unraveling of the Soviet Union",
        "Authors": "By Pozner, Vladimir",
        "Description": "A Soviet commentator records each minute of the recent seventy-two hour coup that almost crushed the efforts of those who fought for change and freedom in the Soviet Union",
        "Category": " Social Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "A Man in Full: A Novel",
        "Authors": "By Wolfe, Tom",
        "Description": "Big men. Big money. Big games. Big libidos. Big trouble.A decade ago, The Bonfire of the Vanities defined an era--and established Tom Wolfe as our prime fictional chronicler of America at its most outrageous and alive. This time the setting is Atlanta, Georgia--a racially mixed late-century boomtown full of fresh wealth, avid speculators, and worldly-wise politicians. The protagonist is Charles Croker, once a college football star, now a late-middle-aged Atlanta real-estate entrepreneur turned conglomerate king, whose expansionist ambitions and outsize ego have at last hit up against reality. Charlie has a 28,000-acre quail-shooting plantation, a young and demanding second wife--and a half-empty office tower with a staggering load of debt. When star running back Fareek Fanon--the pride of one of Atlanta's grimmest slums--is accused of raping an Atlanta blueblood's daughter, the city's delicate racial balance is shattered overnight. Networks of illegal Asian immigrants crisscrossing the continent, daily life behind bars, shady real-estate syndicates, cast-off first wives of the corporate elite, the racially charged politics of college sports--Wolfe shows us the disparate worlds of contemporary America with all the verve, wit, and insight that have made him our most phenomenal, most admired contemporary novelist.A Man in Full is a 1998 National Book Award Finalist for Fiction.",
        "Category": " Fiction , Literary",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "A Dangerous Woman",
        "Authors": "By Morris, Mary McGarry",
        "Description": "Martha Horgan is not like other women. She stares. She has violent crushes on people. She can't stop telling the truth. Martha craves love, independence, and companionship, but her relentless honesty makes her painfully vulnerable to those around her: Frances, her wealthy aunt and begrudging guardian; Birdy, who befriends her, then cruelly rejects her; and Colin Mackey, the seductive man who preys on her desires. Confused and bitter, distyrusting even those with her best interests at heart, Martha is propelled into a desperate attempt to gain control over her own life.A novel of unnerving suspense and terrifying insight into the perversities of passion, A Dangerous Woman is as devastatingly honest as Martha herself.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "A Bed by the Window: A Novel Of Mystery And Redemption",
        "Authors": "By Peck, M. Scott",
        "Description": "NEW YORK TIMES BESTSELLER • “The memorable scenes are powerfully drawn. . . . A spiritual mystery . . . both moving and brave.”—The New York Times Book ReviewThe acclaimed author of the phenomenal bestseller The Road Less Traveled adds a natural gift for storytelling to his spiritual insight and profound awareness of human nature in this mesmerizing, deeply moving new work.Among those within the self-contained world of the Willow Glen nursing home are two extraordinary people. One is there to give care, the other to receive it. Yet together they form a bond of love and trust that transcends their expectations and changes their lives.Stephen Solaris—Imprisoned in a helpless body since birth, unable to even speak, he has an incredible ability to touch the hearts and minds of those around him with the power of his personality.Heather Barsten—a nurse whose devotion to her patients surpasses her ability to fulfill her own needs. From Stephen she learns the importance of being true to one’s heart—and she finds herself falling in love.Then violence shatters Willow Glen. Now a murderer roams the halls of the home, and the residents and staff must confront a truly terrifying evil and face their innermost fears, suspicions, and darkest secrets. . . . A Bed by the Window is an exceptional work, a gripping psychological thriller and a luminous synthesis of Peck’s thinking on good and evil, spiritual growth, and the miracles worked by love.“Scott Peck . . . [is] a born storyteller. . . . His unique insights and wisdom [come] through pin] pure story. This is . . . a page-turner, a book that you start and can’t put down.”—Madeleine L’Engle, author of A Wrinkle of Time",
        "Category": " Fiction , Literary",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Norma",
        "Authors": "By Zimmer, Norma",
        "Description": "",
        "Category": "",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Incredibly American: Releasing the Heart of Quality",
        "Authors": "By Zuckerman, Marilyn R. and Hatala, Lewis J.",
        "Description": "It's still true - in America anything is possible. Now you can discover the hidden secrets of American quality. Learn what motivates Americans to act the way they do. Learn what motivates them to do the impossible.In this new and exciting book, you will learn the results of the landmark AT&T quality archetype study that changes much of the conventional wisdom about the human side of quality.Incredibly American explores the cultural roots of quality, the key to understanding fully what people do and why. The case studies and dozens of ideas for action will help you integrate this fresh approach with your current efforts in ways that stimulate and encourage all to reach for their full potential.",
        "Category": " Business & Economics , Quality Control",
        "Publisher": "Asq Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Secret World of Teddy Bears",
        "Authors": "By Prince, and",
        "Description": "Poems and photographs show how teddy bears dance, prepare for dates, have their pictures taken, bake pies, read books, go on picnics and jog",
        "Category": "",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "The Broken Cord",
        "Authors": "By Dorris, Michael",
        "Description": "The controversial national bestseller that received unprecedented media attention, sparked the nation&#39;s interest in the plight of children with Fetal Alcohol Syndrome, and touched a nerve in all of us. Winner of the 1989 National Book Critics Circle Award.",
        "Category": " Family & Relationships , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "A Very Practical Guide to Discipline With Young Children",
        "Authors": "By Grace Mitchell",
        "Description": "",
        "Category": "",
        "Publisher": "Telshare Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Mortal Sins",
        "Authors": "By Porter, Anna",
        "Description": "Freelance reporter Judith Hayes is cheated out of an interview with businessman Paul Zimmerman by his untimely death, but the story that emerges from his demise provides more interesting--and dangerous--copy",
        "Category": " Fiction , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Family Cookbook",
        "Authors": "By American Diabetes Association and American Dietetic Association",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Academy of Nutrition & Dietetics",
        "Price Starting With ($)": "5.86",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Love, Ruby Lavender",
        "Authors": "By Wiles, Deborah",
        "Description": "Ruby Lavender and Miss Eula are a pretty good team, for a couple of chicken thieves. What other granddaughter-grandmother duo could successfully drive the getaway car for chickens rescued from a journey to the slaughterhouse, paint a whole house shocking pink, and operate their own personal secret-letter post office?So, when Miss Eula leaves for Hawaii to visit her new grandbaby, Ruby is sure that she will have a lonely, empty, horrible summer in boring old Halleluia, Mississippi. What happens instead? She makes a new friend, saves the school play, writes plenty of letters to her favorite (and only) grandmother . . . and finally learns to stop blaming herself for her grandfather's death. Not too bad, for a nine-year-old.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Robber Bridegroom",
        "Authors": "By Welty, Eudora",
        "Description": "Legendary figures of Mississippi’s past-flatboatman Mike Fink and the dreaded Harp brothers-mingle with characters from Eudora Welty’s own imagination in an exuberant fantasy set along the Natchez Trace. Berry-stained bandit of the woods Jamie Lockhart steals Rosamond, the beautiful daughter of pioneer planter Clement Musgrove, to set in motion this frontier fairy tale. “For all her wild, rich fancy, Welty writes prose that is as disciplined as it is beautiful” (New Yorker).",
        "Category": " Fiction , General",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1978"
        }
    },
    {
        "Title": "Navy Seals: A History of the Early Years",
        "Authors": "By Dockery, Kevin",
        "Description": "With the full cooperation of the UDT/SEAL Museum Association, author Kevin Dockery has compiled the most extensively illustrated, candid and revealing history available of the Navy SEALs. With archival photos throughout--and in-depth, exclusive interviews with veteran UDT divers and retired SEAL personnel, this book chronicles the formation of an elite fighting force unsurpassed in combat...and reveals the nature of those rare men who make up the finest fighting force in the world.",
        "Category": " History , Military , Naval",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Father of the Four Passages: A Novel",
        "Authors": "By Yamanaka, Lois-Ann",
        "Description": "Abold new novel about the redemptive power of loveHailed by Jamie James in The Atlantic Monthly as \"one of the most original voices on the literary scene,\" Lois-Ann Yamanaka is back with a novel about family and forgiveness. Set in Hawaii and Las Vegas, Father of the Four Passages tells the story of Sonia Kurisu, a street-wise young mother, who struggles to raise her child, Sonny Boy, as she seeks to come to terms with the three children she aborted.  In sequences alternating between the past and the present, we learn of Sonia's childhood-her abandonment by her father and her mother; her contentious relationship with her sister, Celeste; her string of bad lovers; her problems with drugs and alcohol-and of her wish to reconcile with her father and make something of her life by being a good parent to her son, who has begun to show signs of developmental problems.  A haunting novel about fathers, forgiveness, spirituality, and solace, Father of the Four Passages is Yamanaka's most ambitious work to date. Abold new novel about the redemptive power of loveHailed by Jamie James in The Atlantic Monthly as \"one of the most original voices on the literary scene,\" Lois-Ann Yamanaka is back with a novel about family and forgiveness. Set in Hawaii and Las Vegas, Father of the Four Passages tells the story of Sonia Kurisu, a street-wise young mother, who struggles to raise her child, Sonny Boy, as she seeks to come to terms with the three children she aborted.  In sequences alternating between the past and the present, we learn of Sonia's childhood-her abandonment by her father and her mother; her contentious relationship with her sister, Celeste; her string of bad lovers; her problems with drugs and alcohol-and of her wish to reconcile with her father and make something of her life by being a good parent to her son, who has begun to show signs of developmental problems.  A haunting novel about fathers, forgiveness, spirituality, and solace, Father of the Four Passages is Yamanaka's most ambitious work to date.",
        "Category": " Fiction , Literary",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Just Enough Russian",
        "Authors": "By Ellis, D. L. and Pilkington, Anna",
        "Description": "",
        "Category": " Foreign Language Study , Russian",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Business Leaders and Success: 55 Top Business Leaders and How They Achieved Greatness",
        "Authors": "By O'Neil, William J. (EDT) and O'Neil, William J. (INT)",
        "Description": "A detailed look inside the minds and methods of 55 legendary business leaders  Behind every tale of breakthrough success is the visionary man or woman who made it happen. Profiles in Business Success examines the lives of 55 giants of the business world and reveals how they overcame obstacles, forged their own management philosophies, and drove their companies to the top.  This inspirational book helps business professionals understand and implement proven methods for innovation, growth, and achievement. Readers of every age and interest will learn:  How Gap CEO Mickey Drexler built a $9 billion-a-year retail business by listening to 12-year-olds  How Charles Walgreen Sr. turned a corner drugstore into one of the first multibillion-dollar chains  How eBay founder Pierre Omidyar changed shopping forever--to help his wife find Pez dispensers",
        "Category": " Business & Economics , Leadership",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Going Going Gone: Vanishing Americana",
        "Authors": "By Jonas, Susan and Nissenson, Marilyn",
        "Description": "Whatever happened to vinyl records? For that matter, where did the milkman go? Has anyone sent a singing telegram recently, or made multiple copies with carbon paper, or ordered a malted at a soda fountain?In the last few decades, many familiar objects and ideas have vanished from our lives or are teetering on the brink of obsolescence. As the turn of the century approaches, Going, Going, Gone celebrates and eulogizes the quintessential aspects of mid-twentieth-century life - good and bad - that are disappearing forever: American elm trees, white gloves, enclosed phone booths, slide rules, dental cavities, and the smell of burning leaves, among many, many others. Accompanied by evocative photographs of each subject in its heyday, these lighthearted but informative essays conjure up dozens of items that Americans use, see, surround themselves with, and think about daily - or did until yesterday.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "The Sword and the Circle: King Arthur and the Knights of the Round Table",
        "Authors": "By Malory, Thomas, Sir and Sutcliff, Rosemary",
        "Description": "His kingdom was magical, his knights were loyal, and his life was filled with adventure. . . . Young Arthur Pendragon became High King of England the instant he pulled the mysterious sword from within the stone. He unlocked the magic within the sword Excalibur, and won the heart of the Lady Guenever. At his side through quests and adventures were the Knights of the Round Table—among Gawain, who faced certain death at the hands of the Green Knight; Percival, who learned that it took more than a victory on horseback to win a place at the Round Table; and Lancelot, who daily felt a passion he was forced to hide. And over them all ruled Arthur, true King. . . . \"Stands far beyond any Arthurian collection for young readers.\"—Times Literary Supplement\"Other than Malory, I can think of no better introduction to the whole sweep of Arthurian stories.\"—School Library Journal, starred review",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , Arthurian",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Vulcan's Forge (Star Trek: The Original Series)",
        "Authors": "By Sherman, Josepha and Shwartz, Susan",
        "Description": "Just over a year ago, Captain James T. Kirk was lost to the Nexus while saving the U.S.S. Enterprise 1701-B from destruction. Aboard the science ship Intrepid II, Captain Spock, commanding some of his old crewmates, must face the loss of his closest friend. But while still in mourning for one friend, he must come to the aid of another.Decades ago, Spock had teamed up with David Rabin, the young son of a Starfleet Captain, to fight an attempted coup on Vulcan that would have turned the planet's people away from the path of logic. Now a Starfleet officer, Captain David Rabin has been assigned to a harsh desert world much like Vulcan, where the Federation is determined to protect the lives of the inhabitants. But Rabin's efforts are being sabotaged and he has asked for Spock's help against the unknown forces that may well destroy the society he had come to save.While reflecting on his youthful adventure with David Rabin, Spock joins with Rabin to face and enemy out of their past and confront deadly Romulan treachery. In the process Spock will decide if the path of his life now leads back toward the family traditions he had once sought to escape.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Star Trek",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "White Wolf Woman and Other Native American Transformation Myths",
        "Authors": "By Pijoan, Teresa",
        "Description": "With the aid of more than 40 myths from the oral traditions of 30 native American tribes, ranging from the Eskimos to the Indians of Guiana, Pijoan invites readers to take a close look at the common spirit that binds together all forms of life.",
        "Category": " Social Science , Ethnic Studies , Native American Studies",
        "Publisher": "August House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "The Danger Tree: Memory, War and the Search for a Family's Past",
        "Authors": "By MacFarlane, David",
        "Description": "Emulating the circuitous tales told by his mother's relatives, the Goodyears of Newfoundland, David Macfarlane has crafted a masterpiece of history and memory that will remain indelibly in the minds of its readers. Macfarlane weaves the major events of Newfoundland's twentieth century-the ravages of tuberculosis; the great seal-hunt disaster; the bitter debate over whether to become part of Canada; and above all, the First World War-into a saga of the ill-starred yet heroic fortunes of his family, who were rarely in control of events but often at the center of them. With deep affection, he brings to life a multigenerational cast of characters who are as colorful as only Newfoundlanders can be-heroes and charlatans, pirates and dreamers, whose humanity manages to illuminate and enrich our own.",
        "Category": " Psychology , Cognitive Psychology & Cognition",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Small Town: A Novel (Block, Lawrence)",
        "Authors": "By Block, Lawrence",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "All in Good Time: A Memoir",
        "Authors": "By Schwartz, Jonathan",
        "Description": "\"Dancing in the Dark.\" \"That's Entertainment.\" \"By Myself.\" \"You and the Night and the Music.\" They are part of the American Songbook, and were all composed by Arthur Schwartz, the elusive father at the center of his son's beautifully written book.Imagine a childhood in which Judy Garland sings you lullabies, Jackie Robinson hits you fly balls, and yet you're lonely enough to sneak into the houses of Beverly Hills neighbors and hide behind curtains to watch real families at dinner.At the age of nine, Jonathan Schwartz began broadcasting his father's songs on a homemade radio station, and would eventually perform those songs, and others, as a pianist-singer in the saloons of London and Paris, meeting Frank Sinatra for the first time along the way. (His portrait of Sinatra is as affectionate and accurate as any written to date.)Schwartz's love for a married woman caught up in the fervor of the sexual revolution of the 1960s, and his other relationships with both lovers and wives, surround his eventually successful career on New York radio.The men and women who have roles to play include Richard Rodgers, Nelson Riddle, Carly Simon, Jimmy Van Heusen, Bennett Cerf, Elizabeth Taylor, and, of course, Sinatra himself.Schwartz writes of the start of FM radio, the inception of the LP, and the constantly changing flavors of popular music, while revealing the darker corners of his own history.Most of all, Jonathan Schwartz embraces the legacy his father left him: a passion for music, honored with both pride and sorrow.",
        "Category": " Biography & Autobiography , Composers & Musicians",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Kennedy Curse: Why Tragedy Has Haunted America's First Family for 150 Years",
        "Authors": "By Klein, Edward",
        "Description": "Death was merciful to Jacqueline Kennedy Onassis, for it spared her a parent's worst nightmare: the loss of a child. But if Jackie had lived to see her son, JFK Jr., perish in a plane crash on his way to his cousin's wedding, she would have been doubly horrified by the familiar pattern in the tragedy. Once again, on a day that should have been full of joy and celebration, America's first family was struck by the Kennedy Curse.In this probing expose, renowned Kennedy biographer Edward Klein-a bestselling author and journalist personally acquainted with many members of the Kennedy family-unravels one of the great mysteries of our time and explains why the Kennedys have been subjected to such a mind-boggling chain of calamities.Drawing upon scores of interviews with people who have never spoken out before, troves of private documents, archives in Ireland and America, and private conversations with Jackie, Klein explores the underlying pattern that governs the Kennedy Curse. The reader is treated to penetrating portraits of the Irish immigrant Patrick Kennedy; Rose Kennedy's father, \"Honey Fitz\"; the dynasty's founding father Joe Kennedy and his ill-fated daughter Kathleen, President Kennedy, accused rapist William Kennedy Smith, and the star-crossed lovers, JFK Jr. and Carolyn Bessette. Each of the seven profiles demonstrates the basic premise of this book: The Kennedy Curse is the result of the destructive collision between the Kennedy's fantasy of omnipotence-an unremitting desire to get away with things that others cannot-and the cold, hard realities of life.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Ties That Bind (Amanda Jaffe)",
        "Authors": "By Margolin, Phillip",
        "Description": "Success is fleeting; nobody knows this better than lawyer Amanda Jaffe, She had been the undisputed rising star of Portland's legal community, but in a cruel twist of irony, the same case that put her on the map -- the Cardoni trial, which pitted Amanda against a brilliant sociopath (in the New York Times bestseller Wild Justice) -- had left her traumatized, doubting her instincts, and shunning the limelight.This reticence ends when Amanda agrees to handle the case no one else will touch. Jon Dupre, who runs an upscale call-girl service, is accused of murdering a U.S. senator. Dupre claims to possess proof of the existence of a secret society of powerful men who have banded together for a commonly held political agenda. The rite of passage that binds them together -- the initiation into this powerful brotherhood -- is murder.To Amanda these seem the desperate claims of a man who will lie to save his own skin -- until she is pressured to walk away from the case. Determined to put a knife in the heart of the fear and psychological trauma that has plagued her ever since Cardoni, she refuses to abandon her investigation. It's a decision that will place her and those she loves directly in the path of a deadly juggernaut with ambitions that extend all the way to the presidency of the United States.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Harper",
        "Price Starting With ($)": "11.49",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Holiday Touches for the Country Home",
        "Authors": "By Leisure Arts",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Damaged But Not Broken; A Personal Testimony of How to Deal with the Impact of Cancer",
        "Authors": "By Burkett, Larry and Taylor, Michael E.",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Moody Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Anything Goes",
        "Authors": "By Bell, Madison Smartt",
        "Description": "The only taste of life Jesse has known in his twenty years is bitter: his mother disappeared before he could talk, his father never got over being left, and Jesse’s presence seems only to kindle his father’s anger. Jesse’s talent is for music, which has given him a livelihood and a home as a bass player in a bar band called Anything Goes. Band life offers the opportunity for the dregs of experience (hangovers, mildewed hotel rooms), and the antics of his band mates (all of them older than he is; some of them wiser, some not) offer more schooling in hard knocks.Anything Goes tells Jesse’s story over the course of a year, during which he finds his life slowly being tempered by the unexpected: by a dad who wants to make up and be part of Jesse’s life; by a female lead singer who suddenly makes the band sound a lot better than they have any right to be; and by the confidence Jesse begins to feel in his own musical talent.A complete departure from the sweeping historical vision of Madison Smartt Bell’s Haitian novels and the gritty cynicism of his intense urban dramas,Anything Goes confirms Bell as one of the most versatile, most gifted, most surprising novelists of his generation.",
        "Category": " Fiction , Literary",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Kennedys: America's Emerald Kings A Five-Generation History of the Ultimate Irish-Catholic Family",
        "Authors": "By Maier, Thomas",
        "Description": "Meticulously researched both here and abroad, THE KENNEDYS examines the Kennedy's as exemplars of the Irish Catholic experience. Beginning with Patrick Kennedy's arrival in the Brahmin world of Boston in 1848, Maier delves into the deeper currents of the often spectacular Kennedy story, and the ways in which their immigrant background shaped their values-and in turn twentieth-century America-for over five generations. As the first and only Roman Catholic ever elected to high national office in this country, JFK's pioneering campaign for president rested on a tradition of navigating a cultural divide that began when Joseph Kennedy shed the brogues of the old country in order to get ahead on Wall Street. Whether studied exercise in cultural self-denial or sheer pragmatism, their movements mirror that of countless of other, albeit less storied, American families. But as much as the Kennedys distanced themselves from their religion and ethnic heritage on the public stage, Maier shows how Irish Catholicism informed many of their most well-known political decisions and stances. From their support of civil rights, to Joe Kennedy's tight relationship with Pope Pius XII and FDR, the impact of their personal family history on the national scene is without question-and makes for an immensely compelling narrative. Bringing together extensive new research in both Ireland and the United States, several exclusive interviews, as well as his own perspective as an Irish-American, Maier's original approach to the Kennedy era brilliantly illustrates the defining role of the immigrant experience for the country's foremost political dynasty.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "A Fine Young Man: What Parents, Mentors, and Educators Can Do to Shape Adolescent Boys into Exceptional Men",
        "Authors": "By Gurian, Michael",
        "Description": "From depression to dropping grades, from incidents of violence to teen suicide, today's adolescent boys are one of the largest at-risk groups in America today. In this bracing and insightful book, the bestselling author of The Wonder of Boys directs our attention to the unknown problems and marvels of this age group, helping parents and mentors shepherd boys through the challenging ages of ten to twenty.Puberty encourages guilty alienation and fear. The result is that other boys often have a good deal of influence in the lives of younger adolescent friends, for better or for worse. A number of medical conditions have become almost common among adolescent boys, at least in part because of a lack of support. These range from simple depression, to trauma, to the elaborately named attention deficit hyperactive disorder (ADHD). Experimentation with drugs and alcohol has become almost common, and these contribute to delinquency and sometimes even to suicide.In A FINE YOUNG MAN Gurian establishes three major stages in a boy’s progress to manhood: transformation (the metabolic changes from ages nine to thirteen), determination (characterized by alternate aggression and withdrawal), and consolidation (indicated by determining and testing definitions of adult male behavior). He concludes by offering what he considers indications that the process of individuation has begun. He returns often to the worthwhile observation that what boys need at every stage of the process of maturing is consistent support from a variety of sources both within and outside of the family. It is this support that is too often lacking.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Queen of the South",
        "Authors": "By Perez-Reverte, Arturo and Hurley, Andrew (TRN)",
        "Description": "The international bestseller that inspired the must-watch drama on USA Network starring Alice Braga as Teresa Mendoza.From “master of the intellectual thriller” Arturo Pérez-Reverte, a remarkable tale, spanning decades and continents—from the dusty streets of Mexico to the sparkling waters off the coast of Morocco, to the Strait of Gibraltar and Spain—in a story encompassing sensuality and cruelty, love and betrayal, and life and death.Teresa Mendoza's boyfriend is a drug smuggler who the narcos of Sinaloa, Mexico, call \"the king of the short runway,\" because he can get a plane full of coke off the ground in three hundred yards. But in a ruthless business, life can be short, and Teresa even has a special cell phone that Guero gave her along with a dark warning. If that phone rings, it means he's dead, and she'd better run, because they're coming for her next. Then the call comes.In order to survive, she will have to say goodbye to the old Teresa, an innocent girl who once entrusted her life to a pinche narco smuggler. She will have to find inside herself a woman who is tough enough to inhabit a world as ugly and dangerous as that of the narcos-a woman she never before knew existed. Indeed, the woman who emerges will surprise even those who know her legend, that of the Queen of the South.",
        "Category": " Fiction , Literary",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Faerie Wars (Faerie Wars Chronicles)",
        "Authors": "By Brennan, Herbie",
        "Description": "When Henry Atherton helps Mr. Fogarty clean up around his house, he expects to find a mess and a cranky old man; what he doesn't expect to find is Pyrgus Malvae, crown prince of the Faerie realm, who has escaped the treacherous Faeries of the Night by traveling to the human world through a portal powered by trapped lightning. An egomaniacal demon prince, greedy glue factory owners Brimstone and Chalkhill, and the nefarious Lord Hairstreak, leader of the Faeries of the Night, all dream of ruling the Faerie realm and are out to kill Pyrgus. Enlisting the help of his sister, Holly Blue, and his new friend, Henry, Pyrgus must get back to the Faerie world alive before one of his many enemies gets to him instead. But how many portals are open, and can Pyrgus find the right one before it falls into the wrong hands? Conjuring scenes filled with vivid color, unforgettable detail, and fearless characters, author Herbie Brennan brings readers to the Faerie world, where nothing is ever what it seems and no one can be trusted. www.faeriewars.com \"I meant to read this book at my leisure; I ended up missing two meals and an important phone call.\" -Eoin Colfer, author of Artemis Fowl",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "Bloomsbury USA Childrens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Cinnamon",
        "Authors": "By Pappas, Lou Siebert and Flesher, Vivienne (ILT)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Someone I Loved (Je l'aimais) (English and French Edition)",
        "Authors": "By Gavalda, Anna and Evans, Catherine",
        "Description": "A woman is abandoned by her husband. Shaken by the betrayal, she and her two children are taken to the most unexpected of places to heal: the country farm of her remote and diffident father-in-law. What unfolds between them is a relationship that changes both their lives - one that transforms their notion of family and encourages a better understanding of each other and the choices of the heart.With this deceptively simple novel Anna Gavalda delivers a romance about the unpredictability of love, the toll it takes on its victims - both innocent and guilty - and the unanticipated resilience of its survivors.",
        "Category": " Fiction , Literary",
        "Publisher": "Riverhead Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Others",
        "Authors": "By Herbert, James",
        "Description": "A chilling tale of a gruesome secret from the world-renowned author of Portent \"My redemption began in Hell...\" So begins James Herbert's controversial and stunning new chiller. Nicholas Dismas is a private investigator, but like no other that has gone before him. He carries a secret about himself to which not even he has the answer. He is hired to find a missing baby, one that was taken away at birth. His investigation takes him to a mysteriously located place called Perfect Rest. It is supposed to be a nursing home for the elderly, but there is a lot more to this place than meets the eye. Here Dismas will discover the dark secret of the Others. And in an astonishing and spectacular finale he will resolve the enigma of his own existence. As chilling, as memorable, and as timely as only James Herbert can be, Others will join the classics for which he is remembered with fear.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Whistler's Hollow",
        "Authors": "By Dadey, Debbie",
        "Description": "Lillie Mae's mama has just died, and with her father not back from the Great War that ended over a year before, Lillie is shipped by her mean Aunt Helen off to relatives she has never met. Although she misses her parents terribly, Lillie Mae feels welcomed and loved by Uncle Dallas and Aunt Esther. However, there is something strange happening at Whistler's Hollow. As Lillie Mae resolves the mysteries of her young life, she confronts heartbreak and loneliness with courage, grace and ultimately, hope.",
        "Category": " Juvenile Fiction , Social Themes , Death & Dying",
        "Publisher": "Bloomsbury USA Childrens",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Ninth Life of Louis Drax: A Novel",
        "Authors": "By Jensen, Liz",
        "Description": "Coming soon as a major motion picture by Anthony Minghella, Oscar-winning director of The English PatientMeet Louis Drax, the Amazing Accident-Prone Boy.Louis Drax is a boy like no other. He is brilliant and strange, and every year something violent seems to happen to him. His psychologist is baffled, and his mother lives in a constant state of panic. He has always managed to survive-to land on his feet, like a cat. But cats have only nine lives, and Louis has used up eight, one for every year. On his ninth birthday, Louis goes on a picnic with his parents and falls off a cliff. The details are shrouded in mystery. Louis's mother is shell-shocked; his father has vanished. And after some confusion Louis himself, miraculously alive but deep in a coma, arrives at Dr. Pascal Dannachet's celebrated coma clinic.Was the fall really an accident? If anyone knows, they're not telling. Until one day, still deep within his coma, Louis meets the bandaged figure who calls himself Gustave, and begins to tell his tale...The Ninth Life of Louis Drax is the story of a family falling apart, told in the vivid voices of its comatose son and Dr. Dannachet as he is drawn into the Draxes' circle. Full of astonishing twists and turns, this is a masterful tale of the secrets the human mind can hide.",
        "Category": " Fiction , General",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Politics: A Novel (P.S.)",
        "Authors": "By Thirlwell, Adam",
        "Description": "Politics is about: a) a threesome; b) politicsMoshe loves Nana. But love can be difficult -- especially if you want to be kind. And Moshe and Nana want to be kind to someone else.They want to be kind to their best friend, Anjali. Politics explores crucial problems of sexual etiquette. What should the sleeping arrangements be in a ménage-à-trois? Is it polite to read while two people have sex beside you? Is it permissible to be jealous?",
        "Category": " Fiction , Literary",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Basil",
        "Authors": "By Hazen, Janet and Beach, Pearl (ILT)",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Conqueror's Moon (Boreal Moon Tale)",
        "Authors": "By May, Julian",
        "Description": "On a remote island, far off in the Boreal Sea, four kingdoms have struggled against one another since time out of mind. Most mysterious of them is the marshland kingdom of Moss - feared by the others and ruled by the Sorcerers. Soon, all will be put in peril's way.In recent years, three of the kingdoms have suffered various misfortunes - fearsome volcanic eruptions that choke crops, hideous famine among the people, an ailing leader on his deathbed. Only Moss, poverty-stricken and desolate at the best of times, seems untroubled.But Prince Conrig of Cathra - who waits patiently as his father, the king, wastes slowly away - has hatched a plan in league with his lover, the seductive sorceress Princess Ullanoth of Moss. And if their secret alliance succeeds in its goal, the warring kingdoms of High Blenholm will be united once and for all - under the iron hand of one supreme rule.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace Hardcover",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Human Pool",
        "Authors": "By Petit, Chris",
        "Description": "An epic and hauntingly topical geopolitical thriller spanning six decades and three continents, The Human Pool confirms the journalist and award-winning filmmaker Chris Petit as the heir to John le Carré and Robert Harris.  THE HUMAN POOL  Rumors about Willi Schmidt's actions during the Second World War were enigmatic, to say the least. He worked for U.S. Intelligence out of Switzerland; he cut black-market deals on the side; he rescued scores of Jews from the Nazis. Saint or sinner? Either way, Schmidt was strictly murky waters -- and reports of his death in 1945 surprised no one. Sixty years later, Joe Hoover is convinced Schmidt is still alive, armed with a false name and a fortune in pharmaceuticals. For years, Hoover, former Intelligence courier for the American spymaster Allen Dulles, has been haunted by misgivings about his own wartime role in his boss's top-secret financial partnership with the Third Reich. Now, someone wants Hoover dead. Back in Europe, Hoover discovers that operations he thought had ended long ago are still being played out. Forming an uneasy alliance with Vaughan, an undercover journalist investigating neo-Nazi traffic of Kurdish refugees, he begins to unravel a conspiracy that leads deep into his past, to his days mixing with Nazi officers in the supposedly neutral cities of Zurich, Istanbul, and Budapest, where enemies did deals over cocktails. At each step, Hoover finds the shadow of Willi Schmidt and the specter of World War II's most grotesque and enduring legacy -- a trade in people: the human pool.  Set against a vivid historical backdrop, The Human Pool mixes fiction and fact to explosive effect. Chris Petit has crafted his finest novel yet -- a cosmopolitan, thinking-person's thriller that turns the world inside out and traces its veins: It spells nothing less than the rebirth of the great espionage novel.",
        "Category": " Fiction , Literary",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "In Our Humble Opinion: Car Talk's Click and Clack Rant and Rave",
        "Authors": "By Magliozzi, Tom and Magliozzi, Ray",
        "Description": "\"If you are a fan of the program, you'll love every page of this.\" (Baltimore Sun)  \"Self-deprecating wit.\" (Publishers Weekly)  \"Hitting on all cylinders, the brothers cover topics from Starbucks' ridiculous nomenclature...to UFOs to theories of education.\" (New Orleans Times-Picayune)  This madcap collection of original rants, raves, musings, and declarations from the hosts of \"National Public Radio's most popular non-news show\" (New York Times), addresses a variety of topics from politics and computer addiction to Hollywood and coffee culture in short, pithy, sometimes caustic-but always amusing-essays.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Hemingway Book Club of Kosovo",
        "Authors": "By Huntley, Paula",
        "Description": "A moving testimony to the power of literature to bring people together in even the most difficult of circumstances.In the spring of 1999, the world watched as more than 800,000 Kosovo Albanians poured over Kosovo's borders, bringing with them stories of torture, rape, and massacre. One year later, Paula Huntley's husband signed on with the American Bar Association to help build a modern legal system in this broken country, and she reluctantly agreed to accompany him. Deeply uncertain as to how she might be of any service in a country that had seen such violence and hatred, Huntley found a position teaching English as a Second Language to a group of Kosovo Albanians in Prishtina.A war story, a teacher's story, but most of all a story of hope, The Hemingway Book Club of Kosovo is the journal Hunt-ley kept in scattered notebooks or on her laptop over the eight months that she lived and worked in Kosovo. When Huntley asked her students if they would like to form an American-style \"book club,\" they jumped at the idea. After stumbling upon a stray English-language copy of Ernest Hemingway's The Old Man and the Sea, Huntley proposed it as the club's first selection. The simple fable touched all the students deeply, and the club rapidly became a forum in which they could discuss both the terrors of their past and their dreams for the future.The Hemingway Book Club of Kosovo is a compelling tribute to the resilience of the human spirit.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Seabiscuit: An American Legend",
        "Authors": "By Hillenbrand, Laura",
        "Description": "Laura Hillenbrand, author of the runaway phenomenon Unbroken, brilliantly re-creates a universal underdog story in this #1 New York Times bestseller.Seabiscuit was one of the most electrifying and popular attractions in sports history  and the single biggest newsmaker in the world in 1938, receiving more coverage than  FDR, Hitler, or Mussolini.  But his success was a surprise to the racing establishment,  which had written off the crooked-legged racehorse with the sad tail.  Three men  changed Seabiscuit’s fortunes: Charles Howard was a onetime bicycle repairman who  introduced the automobile to the western United States and became an overnight millionaire.   When he needed a trainer for his new racehorses, he hired Tom Smith, a mysterious  mustang breaker from the Colorado plains.  Smith urged Howard to buy Seabiscuit for  a bargain-basement price, then hired as his jockey Red Pollard, a failed boxer who  was blind in one eye, half-crippled, and prone to quoting passages from Ralph Waldo  Emerson.  Over four years, these unlikely partners survived a phenomenal run of bad  fortune, conspiracy, and severe injury to transform Seabiscuit from a neurotic, pathologically  indolent also-ran into an American sports icon.From the Hardcover edition.",
        "Category": " Sports & Recreation , History",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Behind Every Great Woman is a Fabulous Gay Man: Advice from a Guy Who Gives it to You Straight",
        "Authors": "By Singleton, Dave",
        "Description": "Every girl needs a gay boyfriend.  Long before queer eyes tried to improve the straight guys, gay men had a girl's best interests at heart. After all, who else is going to stop a girl from dating a loser, spending her money on tragic home décor, or turning into her mother? Dave Singleton has dissected more \"smart women, foolish choices\" than Ann Landers, Dr. Phil, and Carrie Bradshaw combined. Now, based on stories from real women and decades of experience counseling and consoling female friends, Dave dishes out his 25 most unfailing, uncompromising pieces of advice, including:  Follow your bliss, but remember this: You're not going to meet an eligible, straight man at cooking class  Being spontaneous does not apply to your hair! Why you must stop getting drastic, funky hairstyles after a bad day or before an awards show  Are you wasting your time and perfume? How to tell if a hot prospect plays for your team  Don't ask, don't tell your date: The 10 things that only your gay best friend needs to know",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Strong Bones Healthy Exchanges Cookbook: 170 Calcium-Rich Recipes for a Lifetime of Healthy Eating (Healthy Exchanges Cookbooks)",
        "Authors": "By Lund, JoAnna M.",
        "Description": "A must-have for anyone who wants to enjoy mouthwatering meals while building strong, healthy bones that will last a lifetime.  Everyone knows that bones need a lot of calcium to stay strong. But sometimes it’s hard to plan flavorful, satisfying meals that are rich in the calcium you need. JoAnna Lund has solved the dilemma with The Strong Bones Healthy Exchanges Cookbook, a hearty collection of recipes that are low in fat, calories, and sugar, but pack a flavorful punch and a healthy dose of calcium in every bite. The best part is, these recipes are easy enough for everyday cooking—so you don’t have to spend hours in the kitchen to make sure your family eats right. Choose from JoAnna’s savory array of calcium-rich dishes, like Homestyle Potato Soup, Creamy Italian Baked Chicken Breasts, and Layered Taco Salad. Top off your meal with one of her delicious desserts, like Chocolate-Strawberry Shortcake, Lemon Crunch Bars, and Magical Pumpkin Pie. With 170 calcium-rich recipes and a handy calcium-gram counter.“An excellent way to incorporate more calcium in your diet while maintaining a low-fat approach to eating.”—Kerry Humes, MD, Women’s Health Center, Moline, IL",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "DSL For Dummies 2e",
        "Authors": "By Angell, David",
        "Description": "Want to quit playing the Internet waiting game? Use this friendly guide to tap into the power of always-on DSL, the Digital Subscriber line and bring the Internet to life at 10 to 100 times the speed of a dial-up modem.The only book on the market that guides you, in plain English through the DSL service maze, DSL For Dummies, 2nd edition includes an all-new part showcasing DSL-enabled applications for consumers, IT professionals, tele-commuters, and businesses.Discover how to:* Set up DSL* Connect a LAN to DSL* Configure Windows or Mac OS for DSL* Secure your PC or LAN to make it safe from hackers* Share a DSL Connection",
        "Category": " Technology & Engineering , Telecommunications",
        "Publisher": "John Wiley & Sons",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Access California Wine Country 6e (Access Guides)",
        "Authors": "By Wurman, Richard Saul and Peck, Donna",
        "Description": "With Access California Wine Country, your visit will be an easy, enjoyable experience -- the vineyard excursions and tours, restaurants, inns, spas, and much more are at your fingertips.California wine country has been divided and organized into wine districts, so you know where you are and where you're headed.Unique color-coded and numbered entries allow you to discover the best:hotels • restaurants • Attractions • Shopping sights • Parks and Outdoor SpacesLarge, easy-to-read maps with entry numbers keyed to text ensure that you will instantly find what you must not miss.",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "CollinsRef",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Lew Hunter's Screenwriting 434",
        "Authors": "By Hunter, Lew",
        "Description": "",
        "Category": " Performing Arts , Film & Video , Screenwriting",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Great Investment: Faith, Family, and Finance",
        "Authors": "By Jakes, T. D.",
        "Description": "The author and preacher shares his three-tiered Bible-based formula for personal success, stressing the foundational value of each \"pillar\" in a person's life. 200,000 first printing.",
        "Category": " Religion , Faith",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Metro Girl (Alex Barnaby Series #1)",
        "Authors": "By Evanovich, Janet",
        "Description": "Buckle your seat belts. Number one New York Times bestselling author, Janet Evanovich,  is moving into the fast lane with Metro Girl, a thrilling, high-octane misadventure with high stakes, hot nights, cold-blooded murder, sunken treasure, a woman with a chassis built for speed, and one very good, very sexy NASCAR driver who’s along for the ride.\"Wild\" Bill Barnaby's dropped off the face of the earth and big sister Alex heads for Miami, Bill's last known sighting, on a harrowing hunt to save her brother ... and maybe the world.  Truth is, Alex has been bailing her brother out of trouble since they were kids.  Not that Bill's a bad sort.  More that he acts first and thinks later.  Unfortunately, this time around, Wild Bill will be Dead Bill if Alex doesn't find him in time.  Alex blasts through the bars of South Beach and points her search to Key West and Cuba, laying waste to Miami hit men, dodging Palmetto bugs big enough to eat her alive, and putting the pedal to the metal with NASCAR driver Sam Hooker.Engaged in a deadly race, Wild Bill's \"borrowed\" Hooker's sixty-five foot Hatteras and sailed off into the sunset ... just when Hooker has plans for the boat.  Hooker figures he'll attach himself to Alex and maybe run into Bill.  Maybe Hooker can salvage what's left of his vacation.  And maybe Hooker'll get lucky in love with Bill's sweetie pie sister.  After all, Hooker is NASCAR Guy.  And NASCAR Guy is good at revving a woman’s engine. The race to the finish is hot and hard, taking Alex and Hooker into international waters, exposing a plot to grab Cuban gold and a sinister relic of the Cuban missile crises.Creative cussing and sexual innuendo included.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Wild Pitch",
        "Authors": "By Lupica, Mike",
        "Description": "This is what happens when a washed-up one-time pitching phenom and all-around jerk gets a second chance-and discovers that none of it is exactly what he expected it to be.  Showtime Charlie Stoddard now occupies himself at card shows, one-night stands, and nearby watering holes. His ex-wife still talks to him, but keeps her distance (about 3,000 miles); his son won't even do that-all in all, a life filled with peaches and cream. And then a decidedly unorthodox therapist starts working on his arm, and Charlie begins to dream again . . . especially now that the Boston Red Sox have lost two starting pitchers and seen their lead over the Yankees sliced in half. Can Charlie make it back to the bigs? Will he ever convince his ex-wife to take him seriously again? Will his son (the . . . well, never mind who he is-we've got to save something) even acknowledge his existence? Can the Red Sox-dare we say it?-shake off the collective curses of the Bambino, the Buckner, and Bucky-expletive-Dent?  Stay, as they say, tuned, as Lupica unfolds his smartest, most outrageous, most surprising novel yet, a story filled with the glories and absurdities of the national pastime, and further proof that \"Lupica's fiction is the funniest thing going\" (Orlando Sentinel).",
        "Category": " Fiction , Sports",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Us Against Them: An Oral History of the Ryder Cup",
        "Authors": "By McMillan, Robin",
        "Description": "The Only Oral History of the Ryder CupSince Its Genesis in 1927Us Against Them recounts how the Ryder Cup grew from the brink of extinction to become the most compelling and controversial tournament in golf. The popularity of the Ryder Cup, played every other year in the fall (alternately in the United States and in Europe), has soared in the last ten years. Its worldwide television audience is now the largest of any in golf, and the last tournament, in 2002, was viewed by an estimated 100 million fans.The story of this meteoric rise -- and all the rich history that predated it -- is told in the actual voices of more than forty players and other participants, including Ryder Cup players and captains Curtis Strange, Dave Stockton, Sam Torrance, and Tony Jacklin; American legends Hale Irwin and Billy Casper; U.S. network television commentators Peter Alliss, David Feherty, Peter Oosterhuis, and Jimmy Roberts; Tour players Peter Jacobsen, Tom Lehman, and Brad Faxon; and such names from the past as Dow Finsterwald, Johnny Pott, and Tommy Bolt.More than recalling simply the play-by-play, Us Against Them also goes behind the scenes -- to the Ryder Cup tournament director whose participation almost ended in his own bloody death, to the matches in Britain that nearly ended in blows, to the car crash that some say decided the outcome of one of the matches, to a small plane carrying players that almost fell from the sky, and to the prominent American network golf commentator who introduced himself to a U.S. president while dressed in a large plastic garbage bag!",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Harper",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Fire Your Boss",
        "Authors": "By Pollan, Stephen M. and Levine, Mark",
        "Description": "Fire Your BossAnd Hire Yourself.Impossible? Not according to nationally bestselling author Stephen M. Pollan.  As he says in this new and empowering book, \"You don't have to accept your current work situation. You can be in control of your job and your stream of income, so you're never again subject to the whims, prejudices, moods, or circumstances of your so-called boss.\"In today's difficult work environment, gone are the days of finding satisfaction through your job, gone is the time when your job was secure, and gone are the days when your employer cared about you. This new environment requires new rules, and Pollan has provided surprisingly fresh and intriguing methods for finding \"success\" on the job.Pollan's bold and unique message begins with the idea that you must \"fire your boss.\" By this he means you can no longer rely on your manager or your company for economic security. Instead, you must put yourself in charge of your working life. In this thought-provoking and counterintuitive career guide, Pollan presents a seven-step program and a series of exercises that give you the confidence, power, and will to achieve the life of your dreams.Once you have changed your mind-set and learned the new rules of the game, you can start the process of moving to a richer, more enriching, and more enjoyable life. And the best part about it? Your boss will love you for it.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Red, White & Liberal: How Left Is Right & Right Is Wrong",
        "Authors": "By Colmes, Alan",
        "Description": "As one of the foremost liberal voices in television and talk radio today, Alan Colmes has long been braving the wilds of controversial issues and conservative slander. Already a talk radio star and the only liberal to be heard nationally, Colmes has also taken the television world by storm on Fox News Channel's Hannity & Colmes, and he is famous for his hard-hitting stance on the challenges that Americans face today.In Red, White & Liberal, Alan Colmes addresses a fundamental question: In this time of uncertainty, how can we protect our freedom without diminishing our liberties, while burnishing our rightful place as the world's beacon of democracy? Colmes urges Americans to see past the tactics of the vocal right and to combat the problems that threaten our liberties, including the government's manipulation of the War on Terror to silence critics and expand its powers to frightening proportions; the lies we've been force-fed about the war in Iraq and the unsettled situation in Afghanistan; the misguided use of religion by the right to justify hatred and prejudice; and the successful conservative smear campaign against the left that has turned liberal into a four-letter word.In order to preserve our freedoms, Colmes calls America back to its liberal roots. He reminds us that our forefathers spoke out against the status quo and fought for the individual's right to opportunity, privacy, and personal choice; that they prized progress and open-mindedness over divisive party politics; and that they believed the ability to express dissent was crucial to keeping a democracy healthy. Colmes suggests that it is our patriotic duty to voice our concern when we feel that wrongs are being done. From debunking the myth of the liberal media to exposing conservative hypocrisy to showing how Jesus was a liberal and the War on Terror is a failure, Colmes presents the issues with thoughtful, provocative arguments, hard facts and logic, and searing humor. He urges us to extend our hands across party lines to find real solutions, protect our shores, and preserve our freedoms.Certain to spark debate and cause readers to both reevaluate and reaffirm their beliefs, Red, White & Liberal is a witty, passionate testament to the liberal ideals that have made America great, and that will continue to ensure liberty and justice for all.",
        "Category": " Political Science , History & Theory",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "All Through The Night : A Suspense Story",
        "Authors": "By Clark, Mary Higgins",
        "Description": "A desperate mother. Her missing child. A stolen chalice.  With Silent Night, Mary Higgins Clark, America's own Queen of Suspense, gave her readers their best Christmas present ever.  Now, with All Through the Night, she once again celebrates the Christmas season with a tale of suspense that will keep readers turning the pages -- all through the night.  At the center of the novel are two of Mary Higgins Clark's most beloved characters, Alvirah, the lottery winner turned amateur sleuth, and her husband, Willy, both of them caught up in a Christmas mystery that calls on all of Alvirah's deductive powers, as well as Willy's world-class common sense.  The story begins when a young unmarried woman leaves her newborn child on the rectory doorstep at a church on the Upper West Side of Manhattan. At the same moment, inside the church, a young man is stealing a treasured artifact, a chalice adorned with a single star-shaped diamond. Both the infant and the chalice disappear.  Seven years later, a few weeks before Christmas, Alvirah and Willy are busy helping Willy's sister Cordelia, a nun who runs a thrift shop that doubles as an after-school shelter for neighborhood kids, prepare for the upcoming Christmas pageant. The future of the shelter is threatened, however, when the city condemns the building for that use, and it is further jeopardized when a nearby brownstone to which the shelter was to be moved turns out to have been willed to a young couple who were tenants in the building. Alvirah refuses to believe that the will is genuine and sets out to prove that the couple are con artists. Soon she is involved in the mystery of the chalice and the child.  In All Through the Night, Mary Higgins Clark has fashioned a Christmas gift for all her readers.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "A Night Without Armor: Poems",
        "Authors": "By Jewel and Kilcher, Jewel",
        "Description": "I&#39;ve learned that not allpoetry lends itself to music -- some thoughts needto be sung only against the silence.  There are softer and less tangible part[s] of our selves that are so essential to  peace, to openheartedness,  to unfolding the vision and   the spiritual realm of our lives, to exposing our souls.- Jewel, From the Preface Writing poems and keeping journals since childhood, Jewel has been searching for truth and meaning, turning to her words to record, to discover, and to reflect.  In A Night Without Armor, her first collection of poetry, Jewel explores the fire of first love, the fading of passion, the giving of trust, the lessons of betrayal, and the healing of intimacy.She delves into matters of the home, the comfort of family, the beauty of Alaska, and the dislocation of divorce. And then there are the images of the road, the people, the bars, the planes, places exotic and mundane, loneliness and friendship.Frank and honest, serious and suddenly playful, A Night Without Armor is a talented artist&#39;s intimate portrait of what makes us uniquely human.",
        "Category": " Poetry , American , General",
        "Publisher": "It Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "A Crossworder's Gift",
        "Authors": "By Blanc, Nero",
        "Description": "From the bestselling author of A Crossworder's Holiday and A Crossword to Die For-five Yuletide short mysteries to add to the hit series...  \"At last,\" raves puzzle editor Charles Preston of USA Today, \"puzzle fans have their revenge...super sleuthing and solving for puzzle lovers.\" Now, the irrepressible crossword editor Belle Graham and her P.I. partner, Rosco Polycrates, are back-in more short stories from the bestselling author.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Emma Brown: A Novel From the Unfinished Manuscript by Charlotte Bronte",
        "Authors": "By Bronte, Charlotte and Boylan, Clare",
        "Description": "Charlotte Bronte's death in 1855 deprived the world of what might have been her masterpiece. The twenty unfinished manuscript pages about a lost young girl - which signaled her most compelling work since Jane Eyre - sat in waiting for almost 150 years until Irish novelist Clare Boylan decided to finish it. This tale allows Bronte's tantalizing fragment of a novel, at last, to blossom.Emma Brown is the story of a young girl, Matilda, brought by her father to a small girls' school in provincial England. The school, Fuchsia Lodge, is foundering, so its new headmistress is delighted to welcome a new pupil - especially one so elaborately dressed with an apparently rich father who is \"quite the gentleman.\" But when the school term ends and it comes time to make arrangements for the Christmas holidays, Matilda's tuition goes unpaid, and the headmistress is shocked to find that the identity of the father, Conway Fitzgibbon - like the address he left behind - is a fiction. Before long, it becomes clear that the little heiress herself is not who she seemed.So who is the mysterious Matilda? When the girl refuses to reveal her true identity and then disappears, it falls to a local gentleman, Mr. Ellin, and Isabel Chalfont, a childless widow who briefly takes the girl in, to unravel the truth. In a journey that takes them from the drawing rooms of English country society to the grimy streets and back alleys of London's seamiest reached, Emma Brown follows the search - first for Matilda's real identity and then for the girl herself.",
        "Category": " Fiction , Historical",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Once Upon a Summer (Seasons of the Heart #1)",
        "Authors": "By Oke, Janette",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "Breaking News (Harvest Book)",
        "Authors": "By MacNeil, Robert",
        "Description": "Anchorman Grant Munro is at the pinnacle of a brilliant career. Covering every story from the Kennedy assassination to the Clinton sex scandals, Munro has won the admiration and trust of millions of television viewers. About to turn sixty, Munro suddenly feels threatened when a handsome and much younger colleague with little experience vies for his anchor post. Dragged into a media circus where tabloid values are fast becoming staples of the nightly news, Munro must negotiate a minefield of scheming, betrayal, and greed to hold on to the job and values he prizes.  Bestselling author Robert MacNeil, whose two previous novels have been published to great acclaim, here turns his wit and acuity onto his home turf in an up-to-the-minute take on an industry that affects the lives of all Americans.",
        "Category": " Fiction , General",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "5.33",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Midnight Voices",
        "Authors": "By Saul, John",
        "Description": "The widowed mother of two, Caroline Evans is delighted when she meets and marries the charismatic man of her dreams, until she and her children move into her new spouse's apartment in the legendary Rockwell on Central Park West, and her son's instinctive misgivings become a horrifying reality when when a young girl vanishes and her own daughter begins to waste away. 125,000 first printing.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Pregnancy and Childbirth: The Complete Guide for a New Life",
        "Authors": "By Hotchner, Tracie",
        "Description": "Covers prenatal tests, selection of hospital, obstetrician, and pediatrician, cesarean delivery, complications, postpartum adjustments, breastfeeding, circumcision, and child care",
        "Category": "",
        "Publisher": "Avon Books (P)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "My Losing Season",
        "Authors": "By Conroy, Pat",
        "Description": "NEW YORK TIMES BESTSELLER • A deeply affecting coming-of-age memoir about family, love, loss, basketball—and life itself—by the beloved author of The Prince of Tides and The Great Santini   During one unforgettable season as a Citadel cadet, Pat Conroy becomes part of a basketball team that is ultimately destined to fail. And yet for a military kid who grew up on the move, the Bulldogs provide a sanctuary from the cold, abrasive father who dominates his life—and a crucible for becoming his own man.   With all the drama and incandescence of his bestselling fiction, Conroy re-creates his pivotal senior year as captain of the Citadel Bulldogs. He chronicles the highs and lows of that fateful 1966–67 season, his tough disciplinarian coach, the joys of winning, and the hard-won lessons of losing. Most of all, he recounts how a group of boys came together as a team, playing a sport that would become a metaphor for a man whose spirit could never be defeated.   Praise for My Losing Season   “A superb accomplishment, maybe the finest book Pat Conroy has written.”—The Washington Post Book World   “A wonderfully rich memoir that you don’t have to be a sports fan to love.”—Houston Chronicle   “A memoir with all the Conroy trademarks . . . Here’s ample proof that losers always tell the best stories.”—Newsweek   “In My Losing Season, Conroy opens his arms wide to embrace his difficult past and almost everyone in it.”—New York Daily News   “Haunting, bittersweet and as compelling as his bestselling fiction.”—Boston Herald",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "25.0",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Roosevelt and Churchill, 1939-1941: The Partnership That Saved the West",
        "Authors": "By Lash, Joseph P.",
        "Description": "An account of the personalities and official practices of the two wartime leaders, of the relationship between them, and of the early events of World War II with which they contended and which shaped their partnership",
        "Category": " Biography & Autobiography , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "A Life With Purpose: The Story of the Man Behind The Purpose-Driven Life",
        "Authors": "By Mair, George",
        "Description": "Now, acclaimed biographer George Mair provides a rare, personal look at the private man behind the powerful teachings. This inspiring biography reveals what prompted Warren to start preaching, the motivation behind The Purpose-Driven Life, and how he overcame serious obstacles to achieve success in every aspect of his life-from his work, to his marriage, to his visionary mission. For the first time, A Life with Purpose tells the story of the unassuming man who has dedicated himself to changing the world, one soul at a time.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Created By",
        "Authors": "By Matheson, Richard Christian",
        "Description": "Alan White is a hot young writer-producer looking for the one hit every Hollywood writer dreams of - and so few get. He thinks he's found it with his idea for a new pilot. He calls it The Mercenary and the networks have never seen anything like it.The show pours state-of-the-art death and dazzle all over the competing networks. Full frontal nudity. Geysers of blood. Shocking sexuality. The violence is beyond unsettling. It's traumatizing.Soon the ratings are through the roof - the show burns a fifty share on its first airing. America is riveted. The ratings are ready to pop the ozone. Sixty share. Eighty share. It's the biggest Nielsen juggernaut that ever opened its mouth and swallowed America's prime-time attention span. Alan's made it, enjoying success beyond his wildest dreams. But something is going wrong - life is beginning to mimic art with horrifying result.The morning headlines start to read like a grisly rerun of last night's episode of The Mercenary. Then it gets worse. Plots that Alan hasn't yet written or spoken of have begun to blood-blossom into reality.Suddenly the truth becomes chillingly clear. Alan is scripting a nightmare - and it's real. Now he must cancel The Mercenary before it cancels him.Created By explores the darkest recesses of human nature, where the meridian between reality and make-believe is as deceptive as a television screen, and the single difference between the two is that on the other side terror doesn't break for commercials.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Tribe of Tiger: Cats and Their Culture",
        "Authors": "By Thomas, Elizabeth Marshall and Williams, Jared Taylor (ILT)",
        "Description": "Elizabeth Marshall Thomas has an instinct for animals and for what makes them behave the way they do. This time her subject is felines - housecats and their wild siblings. \"As the cherub is to the angel, so the cat is to the tiger,\" she writes, \"and although today we tend to put the relationship the other way around, saying that tigers are a kind of cat rather than that cats are a kind of tiger, the fact is that cats and tigers do represent the two extremes of one family, the alpha and omega of their kind.\"The story of this graceful, resourceful tribe begins with what cats are: meat-eaters, first and foremost. But as Thomas shows, within that stark equation abides an astonishing range of experience and expression. Contrary to popular belief, cats - even tigers - are not solitary beings, but are homebodies who \"own\" property much as we do and favor extended clans when food supplies permit. They communicate eloquently with one another and with us - although they interpret our idioms better than we do theirs. Like dogs, they include us in their family structures, but while dogs treat us as friends and equals, cats relate to us hierarchically, as parents or children, and we tend to reciprocate. Most crucially, cats are, like us, individuals who - instinct notwithstanding - pass on, adapt, and invent codes of deportment as circumstances require.Cats, in other words, have culture. Whether they live among us or in the wild, as solo hunters or in circus troupes, they sustain an intricate, elegant, ever-changing web of community with us, among themselves, and with the other creatures, great and small, who dwell in the world.",
        "Category": " Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    }
]