[
    {
        "Title": "The Horse Notebook: An Illustrated Journal with Quotes",
        "Authors": "By Wray, Chris",
        "Description": "",
        "Category": "",
        "Publisher": "Running Pr Book Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "King of the Pygmies",
        "Authors": "By Fuqua, Jonathon Scott",
        "Description": "\"This treatment of mental illness from the viewpoint of someone experiencing it is also a compellingly, fluidly written study of an individual.\" — BULLETIN OF THE CENTER FOR CHILDREN'S BOOKSWhen fifteen-year-old Penn starts to hear voices, he is terrified. He can hear his parents’ unspoken gripes, his retarded brother’s anxieties, and his neighbor’s desperation. His mother wants him to get treated for schizophrenia, but his similarly gifted uncle tells him that hearing others’ thoughts doesn’t make him sick; it makes him special. This compelling novel of a young man’s struggle to come to terms with his disability is a tale of courage, determination, and hope.",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Bogus to Bubbly: An Insider's Guide to the World of Uglies",
        "Authors": "By Westerfeld, Scott",
        "Description": "THE WORLD OF UGLIES, SET IN OUR NOT-SO-DISTANT FUTURE,is a complex place filled with bubbly technology and lingo, yet bogus rules about status and appearance. That's why a guide to the world of uglies has been requisitioned from the hole in the wall. Inside you'll find:   A rundown on all the cliques, from Crims and Cutters to tech-heads and surge-monkeys   The complete history, starting with the destruction of the oil bug to the launch of Extras in space   How all those awesome gadgets came to be: hoverboards, eyescreens, skintennas, sneak suits...   PLUS an exclusive look at Scott Westerfeld's first draft of Extras -- starring Hiro, not Aya.   And so much more, it's mind-wrecking.",
        "Category": " Young Adult Nonfiction , Literary Criticism & Collections",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Birds For Dummies",
        "Authors": "By Spadafori, Gina and Speer, Brian L.",
        "Description": "\"Filled with the information every bird-owner...needs.\" Joel Murphy, DVM, ABVP, author of How to Care For Your Pet Bird Praise for Birds for Dummies(r) \"Squawk about this! A lighthearted...informative book about the care and maintenance of our fine-feathered friends.\" - Gary A. Gallerstein, DVM, author of The Complete Bird Owner's Handbook \"At last - a book that contains more than just pretty bird pictures. This was fun to read. It is clear, concise, factual, useful, and understandable.\" -Linda Biggi, owner, Bird Gardens  Full-color guide to pet birds inside!  \"You will not be disappointed.\" Walter Rosskopf, Jr., DVM, Dipl. ABVP Certified in Avian Practice Get the word on birds! From finches and canaries to conures and macaws, this friendly guide describes the species that make the best pets, explains how to select the bird who's best for you, offers tips on bonding with your feathered friend, and provides expert advice on feeding and grooming.  Discover how to: Choose the right bird for your budget and lifestyle Create a bird-friendly environment Minimize noise and mess Keep your bird groomed, fit, and healthy Bond with your bird  Get smart! www.dummies.com Register to win cool prizes Browse exclusive articles and excerpts Get a free Dummies Daily(TM) e-mail newsletter Chat with authors and preview other books Talk to us, ask questions, get answers",
        "Category": " Pets , Birds",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Storey's Guide to Raising Horses: Breeding/Care/Facilities",
        "Authors": "By Thomas, Heather Smith",
        "Description": "Raising horses successfully requires good preparation, hard work, and a sincere interest in your animals’ well-being. With in-depth information on all aspects of horsekeeping, including grooming, foaling, housing, diet, exercise, and medical care, this comprehensive guide covers everything you need to know to raise healthy and happy horses. Whether you have one horse or are managing a full stable, Storey’s Guide to Raising Horses shows you how to provide the care your animals need while reducing veterinary costs and improving your operation’s self-sufficiency.",
        "Category": " Pets , Horses",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Prevention's the Sugar Solution Cookbook: More Than 200 Delicious Recipes to Balance Your Blood Sugar Naturally",
        "Authors": "By Fittante, Ann and Vantine-reichardt, Julia",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Scholastic Reader Level 3: Poppleton In Winter",
        "Authors": "By Rylant, Cynthia and Teague, Mark (ILT)",
        "Description": "In this easy-to-read chapter book, Poppleton the pig charms young readers with his quirky adventures and whimsical ideas!  Poppleton grows an icicle garden and ends up with an icicle fence instead.  He sculpts a bust of Cherry Sue without explaining his constant visits just to look at her face.  And he wonders why he can't find a friend to go on a sleigh ride with.  No one can go, because they're all preparing Poppleton's birthday party! These hilarious stories feature simple language, everyday experiences, and beautiful illustrations--perfect for beginning readers! Praise for the POPPLETON series: \"A wonderful, easy-to-read chapter book that will leave children laughing out loud.\" --School Library Journal \"Roundly appealing.\" --Publishers Weekly, starred review \"A perfect choice for beginning readers.\" --Booklist",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Never Mind!: A Twin Novel",
        "Authors": "By Vail, Rachel and Avi",
        "Description": "Edward and Meg are like night and day. How could such different people be twins? Well, they are, but they don't have to like it -- or each other.For seventh grade, brainy Meg is attending ultra-competitive Fischer, while freewheeling Edward goes to an alternative school downtown. But it's just when they're finally out of each other's shadows that the trouble begins. Meg's aspirations for popularity and a boyfriend combine with Edward's devious planning and lack of singing ability to set off a showdown the likes of which twindom has never before seen. Why is this final showdown so much fun? Could it be that Meg and Edward are more alike than they thought?",
        "Category": " Juvenile Fiction , Social Themes , Adolescence & Coming of Age",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Eyeballs for Breakfast: Eyeballs for Breakfast",
        "Authors": "By Ragz, M. M.",
        "Description": "Murphy Darinzo's life becomes complicated when a new girl, Ashley Douglas, provides stiff competition for him in his \"gifted\" class and his father puts him on a seemingly wacky health regimen",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Stranger Than Fiction: True Stories",
        "Authors": "By PALAHNIUK, Chuck",
        "Description": "Chuck Palahniuk’s world has always been, well, different from yours and mine. In his first collection of nonfiction, Chuck Palahniuk brings us into this world, and gives us a glimpse of what inspires his fiction.At the Rock Creek Lodge Testicle Festival in Missoula, Montana, average people perform public sex acts on an outdoor stage. In a mansion once occupied by The Rolling Stones, Marilyn Manson reads his own Tarot cards and talks sweetly to his beautiful actress girlfriend. Across the country, men build their own full-size castles and rocketships that will send them into space. Palahniuk himself experiments with steroids, works on an assembly line by day and as a hospice volunteer by night, and experiences the brutal murder of his father by a white supremacist. With this new direction, Chuck Palahniuk has proven he can do anything.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Ideals Country Treasury",
        "Authors": "By Hogan, Julie (EDT) and Ideals (EDT)",
        "Description": "",
        "Category": " Literary Criticism , General",
        "Publisher": "Ideals Childrens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Four-Course, 400-Calorie Meal Cookbook",
        "Authors": "By Hughes, Nancy S.",
        "Description": "A collection of low-calorie, low-fat recipes includes such treats as marinated mushrooms with bleu cheese, orange-kiwi ginger salad, and beef casserole with scallions",
        "Category": " Cooking , Reference",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Teaching Reading in Middle School (Grades 5 & Up)",
        "Authors": "By Robb, Laura",
        "Description": "In this resource, you'll get the \"big picture\" of teaching reading in the middle school, including research, as well as the practical details you need to help every student become a better reader. Veteran teacher Laura Robb shares how to: teach reading strategies across the curriculum; present mini-lessons that deepen students' knowledge of how specific reading strategies work; help kids apply the strategies through guided practice; support struggling readers with a plan of action that improves their reading motivation; helps kids choose books that are at their instructional level; organize a reading-writing workshop, and much more. For use with Grades 5 and Up.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Saint of the Day : Lives and Lessons for Saints and Feasts of the New Missal",
        "Authors": "By Foley, Leonard",
        "Description": "",
        "Category": "",
        "Publisher": "St. Anthony Messenger Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "A Bad Man Is Easy to Find",
        "Authors": "By Verlaine, M. J.",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Intensive care: Helping teenagers in crisis",
        "Authors": "By Van Pelt, Rich",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan Pub. House",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "First Cast: Teaching Kids to Fly-Fish",
        "Authors": "By Genova, Phil",
        "Description": "Discusses the rewards and value of fly fishing; covers fly tying, tackle, and equipment; and shows how to introduce children to fly fishing techniques",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Warriors: Cats of the Clans (Warriors Field Guide)",
        "Authors": "By Hunter, Erin and McLoughlin, Wayne (ILT)",
        "Description": "Hear the stories of the great warriors as they've never been told before! Cats of the Clans is chock-full of visual treats and captivating details, including full-color illustrations and in-depth biographies of important cats—from fierce Clan leaders to wise medicine cats to the most mischievous kits, as well as loners, rogues, and kittypets. This collectible guide is a great introduction to the Warriors series for new fans and is indispensable for those already hooked!",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Becoming a People of Grace : An Exposition of Ephesians",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": "",
        "Publisher": "Insight for Living",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Before the Dawn: An Autobiography",
        "Authors": "By Adams, Gerry",
        "Description": "Born in West Belfast in 1948 into a family with close ties to both the trade union and republican movements, Gerry Adams is the eldest of ten children. He writes with affection of his mother, \"an articulate and gentle woman,\" of his father, a republican activist who had been jailed at the age of sixteen, and of his grandmother, who nurtured in him a love of reading.He describes his childhood, despite its material poverty, in glowing and humorous terms, recollecting golden hours spent playing on the slopes of the mountain behind his home and celebrating the intimate sense of community in the tightly packed streets of working-class West Belfast.But even before leaving school to work as a barman, he had become aware of the inequities and inequalities of life in the north of Ireland. Soon he was engaged in direct action on the issues of housing, unemployment, and civil rights.Gerry Adams brings a unique perspective to the years of conflict, insurrection, and bitter struggle that ensued when, in his view, peaceful political agitation was met with hysterical reaction, and the sectarian tinder-box of Britain's last colony erupted. From the pogroms of 1969 to the hunger strikes of 1981, from the streets of West Belfast to the cages of Long Kesh, this powerful memoir is essential reading for anyone wishing to understand modern Ireland.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "British Pewter and Britannia Metal for Pleasure and Investment",
        "Authors": "By Christopher A. Peal",
        "Description": "",
        "Category": "",
        "Publisher": "New York: Peebles, 1973",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Eat This Not That! Supermarket Survival Guide: The No-Diet Weight Loss Solution",
        "Authors": "By Goulding, Matt and Zinczenko, Dave",
        "Description": "You can burn fat and sculpt the body you've always wanted-and even save money in the process-without dieting. All you need is the insider's guide to smart, healthy, low-cost food choices. And now, the right choices are simple! From the produce section to the frozen-food aisle, the modern supermarket is loaded with 50,000 food choices, all vying for your hard-earned money. N wonder it's hard to know what to buy. But with Eat This, Not That! Supermarket Survival Guide, the smart answers are right in your hands. No more fake \"healthy\" foods. No more rip-off supermarket \"bargains.\" No more disappointing meals. And most important of all, no more extra pounds! Did you know: - A cup of Quaker 100% Natural Granola Oats, Honey, and Raisins contains more calories than 8 chicken wings? (Save 280 calories a day by switching to our preferred choice) - Choosing Rice Krispies Treats over Nutri-Grain Cereal Bars will cut your sugar and calorie intake nearly in half? (With this switch, you could lose a pound every 7 weeks!) - Regular bacon is actually better for you than turkey bacon? (Find other deceptive \"healthy\" foods and the delicious ones you should be eating instead. With this simple illustrated guide to thousands of foods-along with the nutrition secrets that lead to fast and permanent weight loss-you'll make the smartest choice for you and your family, every time! Additional features in Eat This, Not That! Supermarket Survival Guide include: - 6 Supermarket Shopping Strategies- 11 Secrets the Food Industry Doesn't Want You to Know - The 20 Worst Packaged Foods in America - Master the Produce Aisle: Your Guide to Greens (and other colors) - Your Organic Primer - The Pantry Label Decoder - And more!",
        "Category": " Reference , Consumer Guides",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "One Year Book of Family Devotions, Vol. 3",
        "Authors": "By",
        "Description": "The One Year Book of Family Devotions Volume 3 takes families with children ages 6-10 through the year on a discovery of God's Word. Daily reading, Scripture memory, and a relevant “How About You” section will get the conversation started. A great tool to draw families closer to God.",
        "Category": " Religion , Devotional",
        "Publisher": "Tyndale Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Calm Answers for a Confused Church: A Study of 1 Corinthians 12-16",
        "Authors": "By Charles R. Swindoll",
        "Description": "",
        "Category": "",
        "Publisher": "W Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "The Lamentations of Jeremiah",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": "",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "A Time for Commitment",
        "Authors": "By Larson, Robert C and Engstrom, Ted",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Introduction to Genetic Analysis",
        "Authors": "By Griffiths, John F. and Griffiths, Anthony J. F. (EDT)",
        "Description": "Griffiths (botany, University of British Columbia, Canada) has streamlined this eighth edition of a text for undergraduates from 26 chapters to 21. Chapter-opening questions and overview sections are also new. The molecular core of the book (eight chapters) has been extensively reworked to bring modern genetic thinking to the forefront. There is a new chapter on the latest experimental techniques, and a rewritten genomics chapter. Enhanced coverage of model organisms includes a brief guide to model organisms at the back of the book, and an index to model organisms. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Science , Life Sciences , Genetics & Genomics",
        "Publisher": "W. H. Freeman",
        "Price Starting With ($)": "7.38",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Peter's kingdom: Inside the papal city",
        "Authors": "By Packard, Jerrold",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Warm Springs: Traces of a Childhood at FDR's Polio Haven",
        "Authors": "By Shreve, Susan Richards",
        "Description": "A rich and moving memoir of childhood illness and its aftermath by a member of the last generation of Americans to have experienced childhood polioJust after her eleventh birthday, at the height of the frightening childhood polio epidemic, Susan Richards Shreve was sent as a patient to the sanitarium at Warm Springs, Georgia. It was a place famously founded by FDR, \"a perfect setting in time and place and strangeness for a hospital of crippled children.\"There the young Shreve met Joey Buckley, a thirteen-year-old in a wheelchair who desperately wants to play football for Alabama. The shock of first love and of separation from her fiercely protective mother propels Shreve on a careening course from Warm Springs bad girl to overachieving saint and back again. This indelible portrait of the psychic fallout of childhood illness ends -- like Tobias Wolff's Old School -- with a shocking collision between adolescent drive and genteel institution.During Shreve's stay at Warm Springs, the Salk vaccine was developed, an event that put an end to a harrowing time for American families. Shreve's memoir is both a fascinating historical record of that time and an intensely felt story of childhood.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Houghton Mifflin Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Amish Cooking",
        "Authors": "By Miller, Mark Eric",
        "Description": "Demonstrates the simplicity of preparation that is characteristic of traditional Amish cooking, including recipes and cooking and preserving tips for sauerkraut, oyster soup, chicken and dumplings, German chocolate cake, shoo-fly pie and more",
        "Category": " Cooking , Regional & Ethnic , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Spiritual Gifts (Bible Study Guide)",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": "",
        "Publisher": "Insight for Living",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Growing Wise in Family Life: Bible Study Guide",
        "Authors": "By Swindoll, Charles R.",
        "Description": "Offers advice, based on Biblical teachings, on how to strengthen and enrich one's family life, and includes exercises in self-examination of values",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Revenge of the Kudzu Debutantes: A Novel",
        "Authors": "By Holton, Cathy",
        "Description": "kud • zu \\kud-zü\\ n: a ubiquitous vine/weed found in Southern climes that, left uncontrolled, will grow over any fixed object in its path, including trees, power lines, and the entire state of Georgia. deb•u•tante \\de-byu-tänt\\ n: a young woman making a debut into society, easily spotted in white dress and pearl necklace. Common names include Muffy, Bootsy, and Bunny.Eadie Boone is no shrinking violet. An artist and former beauty queen who married into one of the first families of Ithaca, Georgia, she tackles everything with gusto and flair. But tailing her wayward husband proves to be, well, an exasperating chore. If only Trevor would just see the light, dump his twenty-two-year-old hussy, and return home, Eadie’s creative energy could be put to better use. Now all she has to do is convince him.Nita Broadwell, a good Southern girl from a good Southern family, is jolted out of complacency when she discovers condoms in her husband’s shirt pocket (“Maybe he’d found them on the ground and picked them up”). Between clinging to denial and dodging her overbearing mother-in-law, Nita is also trying to break her addiction to steamy bodice-ripper novels. Only now it appears she’s authoring her own real-life romance tale with a hunky handyman thirteen years her junior. Lavonne Zibolsky–a transplanted Yankee, bless her heart–is saddled with planning the annual Broadwell & Boone law firm party. That and her lackluster marriage have her seeking solace in the contents of her refrigerator. If she could just put down the Rocky Road ice cream and peach pie, she might get around to finding a caterer, dropping sixty pounds, and figuring out how to fall in love with her husband again. Not necessarily in that order. Bonded by years of friendship, these three women discover what else they have in common: lying, cheating spouses. So they heed their collective betrayals as a wake-up call and band together to exact sweet revenge. The take-charge trio will see to it that the punishment is just, exquisitely humiliating, and downright hilarious.Cathy Holton’s debut novel is a delicious yarn of friendship and marriage, secrets and retribution, and how nothing stays hidden for long. Against a Southern backdrop of gentility and decorum, Revenge of the Kudzu Debutantes dares to abandon Junior League social graces in ways that would make even Scarlett O’Hara blush.",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Street Skateboarding: Endless Grinds and Slides: An Instructional Look at Curb Tricks",
        "Authors": "By Werner, Doug, Goodfellow, Evan, and Yamaodo, Tadashi (PHT)",
        "Description": "Taking place at real street locations, this photographic collection provides readers with the information necessary to take skateboarding abilities to a higher level of performance. Progression of style and technique in skateboarding has led to the cutting-edge use of real-world terrain such as curbs, stairs, and handrails. Beginning with instruction on how to properly negotiate curbs and escalating to the endless ways a skateboarder can maneuver up, over, and down the cement and asphalt that make up the urban and suburban landscapes, these step-by-step photographs will help skateboarders master the streets of the world.",
        "Category": " Sports & Recreation , Skateboarding",
        "Publisher": "Tracks Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Smoke & Spice - Revised Edition: Cooking With Smoke, the Real Way to Barbecue (Non)",
        "Authors": "By Jamison, Cheryl Alters and Jamison, Bill",
        "Description": "Cheryl and Bill Jamison's path-breaking Smoke and Spice was the first, and remains by far the best-selling, book on real barbecue - slow-cooking over smoke - for home cooks. This new and expanded edition appears on the twentieth anniversary of the classic book's first edition. It has two key features. First, there are 50 new recipes, including meat dishes, such as Molasses-Brined Pork Butt, Lemon-Coriander Chicken, and Brisket Frito Pie, as well as sauces, sides, and desserts, like Peppery Sweet Onion Sauce, Cornbread Fritters, and Chipotle Cherry Cobbler. Second, it now contains cover- to-cover color photography and page design. The photographs show details of backyard-smoking techniques, delectable views of finished foods from the smoker, and atmospheric shots of barbecue joints and of the legendary pitmasters who cook in them.With 450 recipes from each of the U.S.'s best barbecue regions, each recipe expertly perfected and fine-tuned by the Jamisons, amusing anecdotes and tall tales from the colorful world of 'Q, and take-it-to-the-bank advice on how to use any kind of smoker (as well as how to smoke-cook on a conventional grill), this expanded and richly photographed new edition is certain to usher in a new generation of backyard cooks devoted to real barbecue.",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Harvard Common Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Great Shipwrecks and Castaways: Authentic Accounts of Disasters at Sea",
        "Authors": "By Neider, Charles (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Marboro Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Practical Helps for a Hurting Church: A Study of 1 Corinthians 6:12 - 11:34",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": "",
        "Publisher": "W Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Exalting Christ ... The Son of God (A Study of John 1-5)",
        "Authors": "By Charles R. Swindoll, Ken Gire",
        "Description": "",
        "Category": "",
        "Publisher": "Insight for Living",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Defying the Market: Profiting in the Turbulent Post-Technology Market Boom",
        "Authors": "By Leeb, Stephen and Leeb, Donna",
        "Description": "Explores technological progress as it intersects with key worldwide trends; describes four sectors likely to out perform the market; and recommends specific stocks to purchase",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Love Frustration: A Novel",
        "Authors": "By Johnson, R. M.",
        "Description": "Jayson Abrahms is tired of dating, tired of the games involved, and wants nothing more than to settle down. Thankfully, in less than a week he will marry Faith Sheppard, the love of his life. But there is one minor issue -- Jayson's longtime best friend, Asha Mills. Not only is she gorgeous, but Asha and Jayson also used to be lovers. Concerned about Asha's intentions, Faith delivers an ultimatum to Jayson, forcing him to face the toughest decision of his life: Either Asha goes, or there will be no wedding.  Jayson reluctantly sets out to end the friendship but cannot bring himself to do it. When he lies to Faith and tells her Asha is out of the picture, he never expects Faith to learn his secret, but Faith bumps into Asha and, discovering the truth, decides to get even with Jayson for his betrayal. Meanwhile, Jayson still believes that things are as they should be and, a few days before the wedding, sets out to meet Faith at a hotel room where a surprise party is promised for her. Hoping to surprise his fiancée with a gift of roses when he walks into the room, Jayson instead receives a horrible shock. When a videotape of that night's painful events surfaces, Jayson finally starts to unravel the web of lies that has been cast around him. Because it is not just Faith who has been harboring secrets from him; Asha is also turning out to be a very different woman from the one he fell in love with years ago.  Never turning away from the harshness of reality, Love Frustration candidly confronts what happens when people have what they don't want and love what they can't have.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Your Government Failed You: Breaking the Cycle of National Security Disasters",
        "Authors": "By Clarke, Richard A.",
        "Description": "Richard Clarke's dramatic statement to the grieving families during the 9/11 Commission hearings touched a raw nerve across America. Not only had our government failed to prevent the 2001 terrorist attacks, but it has proven itself, time and again, incapable of handling the majority of our most crucial national security issues, from Iraq to Katrina and beyond. This is not just a temporary failure of our current leadership—it is a systemic problem, the result of a pattern of incompetence that must be understood, confronted, and prevented.Clarke's first book, the number one bestseller Against All Enemies: Inside America's War on Terror, explained how the United States had stumbled into a struggle with violent Islamist extremists. Now, in Your Government Failed You, Clarke looks at why these unconscionable failures have continued and how America and the world can succeed against the terrorists. Yet Clarke also goes far beyond terrorism, to examine the inexcusable chain of recurring U.S. government disasters. Despite the lessons of Vietnam, there is Iraq. A trail of intelligence failures litters the Washington landscape. From Katrina to color codes and duct tape, \"homeland security\" has been an oxymoron. Why does the superpower continue to bobble national security?Clarke minces no words in his examination of the breadth and depth of the mediocrity, entropy, and collapse endemic in America's national security programs. In order for the United States to stop its string of strategic mistakes, we first need to understand why they happen. Drawing on his thirty years in the White House, Pentagon, State Department, and intelligence community, Clarke gives us a privileged, if horrifying, look into the debacle of government policies, discovering patterns in the failures and offering ways to stop the cycle once and for all.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Ecco",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Voyage",
        "Authors": "By MacNeil, Robert",
        "Description": "\"Adventure dies in domesticity.\" So muses David Lyon, one of the stars of Canada's foreign service, as he prepares to accept the crowning moment of his career: his elevation to foreign minister. But half a world away, in Finland, the famous model Francesca D'Anielli is missing and presumed dead. What links these two so different individuals is a passionate love affair that reaches back into their youth, when, as a young diplomat, David first met the beautiful Francesca. Unbeknownst to his wife and children, and to the rest of the diplomatic corps, David had led a double life that now threatens to explode. Once Francesca's personal effects are discovered, David knows, their secret love will come out - endangering both his marriage and his career.Told with relentless drive from both David's and Francesca's fascinating points of view, THE VOYAGE is a beautifully told story of love and its unforeseen consequences.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Coffeehouse Gospel: Sharing Your Faith In Everyday Conversation",
        "Authors": "By Turner, Matthew Paul",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Relevant Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Step-by-Step Vegetarian",
        "Authors": "By Wadey, Rosemary and Handslip, Carole and Westland, Pamela and Ashworth, Sue and Bowen, Carol",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Greatest Ever Wok & Stir-Fry",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Bouquets of Hope: A Daily Devotional for Women by Women",
        "Authors": "By Stenbakken, Ardis Dick",
        "Description": "",
        "Category": "",
        "Publisher": "Review & Herald Publishing",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Paula Wolfert's world of food: A collection of recipes from her kitchen, travels, and friends",
        "Authors": "By Wolfert, Paula",
        "Description": "Two hundred recipes noted for their earthy flavor, richness without heaviness, and new cooking techniques includes such delicacies as chestnut salad with walnuts and pancetta",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Spirit of Sweetgrass",
        "Authors": "By Seitz, Nicole",
        "Description": "Essie Mae Laveau Jenkins is a 78-year-old sweetgrass basket weaver who sits on the side of Hwy. 17 in the company of her dead husband, Daddy Jim. Inspired by her Auntie Leona, Essie Mae finally discovers her calling in life and weaves powerful \"love baskets,\" praying fervently over them to affect the lives of those who visit her roadside stand. When she's faced with losing her home and her stand and being put in a nursing home, Daddy Jim talks her into coming on up to Heaven to meet sweet Jesus-something she's always wanted to do. Once there, she reunites with Gullahs and African ancestors; but soon, her heavenly peace is disrupted, for she still has work to do. Now Essie Mae, who once felt powerless and invisible, must find the strength within her to keep her South Carolina family from falling apart.",
        "Category": " Fiction , Religious",
        "Publisher": "Integrity/Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Bufflehead Sisters",
        "Authors": "By DeLois, Patricia J.",
        "Description": "As an only child, Janet longs for a sister her parents are unable to give her. In kindergarten she meets Sophie, a strange and imaginative girl with a troubled family life. As friendship grows between the two girls, Janet believes her prayers have been answered, especially when members of her family embrace Sophie as one of their own. Sophie's troubles continue to follow her through high school, and Janet stands by her \"sister\" until, in adulthood, she learns of a devastating secret Sophie has kept from her. Janet's world is turned upside down-and she discovers there may be a limit to what sisters should share.",
        "Category": " Fiction , Women",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Unfinished Business: What the Dead Can Teach Us About Life",
        "Authors": "By Van Praagh, James",
        "Description": "“He helps a lot of people. He really is a healer. I think he’s basically on this earth right now at this time and place to heal. He is the real thing. I can’t tell you how many times he’s been right with me.” — Shirley MacLaine “It has such a hopeful message. Even though he’s telling stories of the dead, it’s really about living your life better and inspiring people to not have unfinished business.” — Jennifer Love Hewitt James Van Praagh, world-famous medium, co-executive producer of the primetime series Ghost Whisperer, and author of the New York Times bestseller Ghosts Among Us, is back with Unfinished Business. Fans of Sylvia Browne and John Edward will find this a useful and reassuring guide for the living… from those who have passed on.",
        "Category": " Body, Mind & Spirit , Supernatural (incl. Ghosts)",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Dogs Don't Wear Sneakers",
        "Authors": "By Numeroff, Laura Joffe and Mathieu, Joe (ILT)",
        "Description": "Dogs don’t wear sneakers, pigs don’t wear hats, and dresses look silly on Siamese cats.Animals would look pretty silly doing a lot of the things that people do all the time. The unlikely combinations in Laura Numeroff’s cheerful rhymes and Joe Mathieu’s bright, zany pictures will make you laugh out loud. What sort of crazy creatures can you dream up?",
        "Category": " Juvenile Fiction , Imagination & Play",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Caillou Play With Me (NORTH STAR (CAILLOU))",
        "Authors": "By L'Heureux, Christine and Lapierre, Claude (ILT)",
        "Description": "Caillou wants to play with his father, but Daddy has to go to work, so he must wait until the weekend to be able to play with him.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Editions Chouette Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Diary of an Anorexic Girl",
        "Authors": "By Menzie, Morgan",
        "Description": "Morgan Menzie takes readers through a harrowing but ultimately hopeful and inspiring account of her eating disorder. Her amazing story is told through the journals she kept during her daily struggle with this addiction and disease. Her triumphs and tragedies all unfold together in this beautiful story of God's grace. Features include: daily eating schedule, journal entries, prayers to God, poems, and what she wished she knew at the time. It's the true story of victory over a disease that is killing America's youth.",
        "Category": " Self-help , Eating Disorders & Body Image",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Menopause and Midlife",
        "Authors": "By Wells, Robert G and Wells, Mary C.",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "The Source of My Strength",
        "Authors": "By charles-f-stanley",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "A Taste of Florida: The Best of \"Thought You'd Never Ask",
        "Authors": "By Chapman, Dorothy and McPherson, Heather J.",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Tribune Pub",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "NIV Women's Devotional Bible",
        "Authors": "By Zondervan",
        "Description": "Encouragement, Insight, and Inspiration for Today's Christian WomenIf you want to understand what the Scriptures have to say about your needs, your questions, your challenges, and your interests, the Women's Devotional Bible offers an inspiring alternative to other types of Bibles. A full year's worth of devotional readings written by Christian women for Christian women help you grow in your spiritual life and encourage you as you live out your faith on a day-by-day basis. FeaturesA full year of weekday and weekend devotions placed near the designated Scripture readings Devotions are written for women by over 100 well-known Christian women, including Debby Boone, Jill Briscoe, Gloria Gaither, Ruth Bell Graham, Joni Eareckson Tada, Shirley Dobson, Luci Swindoll, Corrie ten BoomSubject index offers easy access to topics addressed in the devotionsAuthor index includes biographical information about each contributorBook introductions provide background and perspective on the Biblical narrativeDouble-column formatPresentation pageHandy compact size makes it easy to carry along wherever your schedule takes youReadable 9-point typeThe Women's Devotional Bible is the #1 selling devotional Bible. Millions of women have found hope, help, and inspiration in its pages. Whether you are a young mother, a grandmother, single or married, this devotional Bible was created for you by women like you. The Women's Devotional Bible contains an entire year of meditations that will encourage you in your walk with God.Each day of the week, Monday through Friday, you'll read a short Scripture passage; then, near that passage, you'll find a devotional message to help you grow as a Christian. On the weekend, you'll come to a special treat, 'Weekending,' which includes a short reflective meditation, plus a Scripture reading for Saturday and Sunday. Concentrating on the special needs and interests of women, devotionals cover such topics as love, marriage, work, children, church, friends, home, and much, much more.The Women's Devotional Bible is about all that you are as a Christian woman---and all that God plans for you to become. Discover what the Scriptures have to say to a woman's heart and grow in your understanding of what it means to be a Christian woman in today's world. From facing challenging circumstances to being real before God, the devotional material helps you learn what it means to walk with faith in the real world and honor Christ with your life. The Women's Devotional Bible---a Bible for, by, and about today's woman. A Bible for you.",
        "Category": " Bibles , New International Version , Devotional",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Still Proclaiming Your Wonders: Homilies for the 80's",
        "Authors": "By Burghardt, Walter J.",
        "Description": "",
        "Category": " Religion , Sermons , General",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Diana: An Intimate Portrait 1961-1997",
        "Authors": "By Seward, Ingrid",
        "Description": "",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Amish-Country Cookbook, Vol. 2",
        "Authors": "By Miller, Sue, Miller, Bob, Miller, Sue (EDT), Miller, Bob (EDT), and Dutchman Essenhaus (Middlebury, Ind.) (COR)",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Bethel Pub Co",
        "Price Starting With ($)": "6.1",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "Mostly in clover",
        "Authors": "By Boyle, Harry J",
        "Description": "",
        "Category": "",
        "Publisher": "E. P. Dutton & Co., Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Kitchen Comforts",
        "Authors": "By Boassy, Gay T.",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Simple Dream - APG Sales & Distribution",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "500 Five-Ingredient Recipes (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books (EDT)",
        "Description": "VALUE! More than 500 tested recipes—250+ main dishes—all from a trusted brand and guaranteed to satisfy.Popular, quick-to-fix recipes use up to five common, readily available ingredients.Recipes for appetizers, beverages, salads, main dishes, sauces, sides, and desserts.Special chapter features fun favorites just for kids.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Great Escape Mazes",
        "Authors": "By Moreau, Roger",
        "Description": "part in some of the most daring, courageous escapes of the twentieth century. You will need to muster your determination, keep your wits about you, and focus on small details in order to complete more than 20 challenging mazes. Forget the boring labyrinths of puzzle books and cereal boxes, these intricate adventures are drawn with striking detail and are all based on historic events. Put yourself in these death-defying situations: * Find your way off the sinking Titanic onto the iceberg. * Descend ropes to escape the burning Hindenburg. * Find a clear tunnel passage to help Allied soldiers break out of the German prisoner-of-war camp Stalag Luft III. * Help the Dalai Lama avoid capture by Chinese communist troops. * Guide the crew of the Apollo 13 moon mission back to earth. * Determine whether it was possible to escape from the prison on Alcatraz Island in San Francisco Bay. As you wend your way from disaster and doom to safety and freedom, you will learn what the real people faced with these situations had to overcome, from rocky terrain, strong ocean currents, and the forces of nature to invading armies, impenetrable fences, and exploding torpedoes. Of course, unlike the historic adventurers, you will have the solutions to the mazes at your fingertips at the back of the book.  64 pages, 58 b/w illus., 8 1/4 x 11.",
        "Category": " Juvenile Nonfiction , Games & Activities , Puzzles",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Imagine",
        "Authors": "By Vivian, Bart",
        "Description": "Parenting expert, popular speaker, and bestselling author of The Blessing of a Skinned Knee returns with a revelatory new book for parents of teenagers. In The Blessing of a Skinned Knee, author Wendy Mogel introduced a new approach to parenting, one that drew its fundamental principles from Jewish wisdom and emphasized resisting overprotection of our children. With its combination of insight and practicality, the book became a word-of-mouth success and made Mogel a much sought after speaker.  Now, in the long-awaited follow-up to her perennial seller, Mogel addresses the question she is asked most frequently: how to be a parent in a culture that breeds anxiety and fragility in older children and teens by placing too high a value on perfection and success. Applying concepts from mussar (a Jewish system of character refinement that focuses on ethical behavior) and other teachings, Mogel shows parents how to stop overindulging or pressuring their children and instead focus on developing sound judgment. By practicing composure, detachment, acceptance, moderation, integrity, authority, and delight—the traits covered in the seven chapters—parents will not only uncover an appreciative and reflective relationship with their children, but will also set an example of the adults they want them to become.   An important and inspiring book, The Blessing of a B Minus  encourages parents to see beyond the drama of teenage crises and the competitiveness of college applications to the goal of raising resilient, optimistic adults.",
        "Category": " Juvenile Fiction , Social Themes , New Experience",
        "Publisher": "Aladdin/Beyond Words",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Simon & Schuster's Children's Guide To Dinosaurs And Other Prehistoric Animals",
        "Authors": "By Whitfield, Philip",
        "Description": "An authoritative reference guide to the animals of the prehistoric world offers a chronological study of five different geological periods, with profiles of the dinosaurs and other animals who lived during each. BOMC.",
        "Category": " Juvenile Fiction , Animals , Dinosaurs & Prehistoric Creatures",
        "Publisher": "Simon & Schuster Children's Publishing",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Joseph and the Dreams (POP-UP BOOK)",
        "Authors": "By Editors of creative Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Creative Publishing",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Daniel in the Lions' Den (Timeless Bible Stories)",
        "Authors": "By John Patience",
        "Description": "",
        "Category": "",
        "Publisher": "Playmore Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Great Cooks Guide to Soups (Great cooks' library)",
        "Authors": "By Random House",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Soups & Stews",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1978"
        }
    },
    {
        "Title": "Let's Ride Bikes",
        "Authors": "By Zobel-Nolan, Allia and Terry, Michael (ILT)",
        "Description": "The next best thing to riding your own first bike is experiencing what it's like through the eyes of two young friends in this adorable board book.  Little ones can turn a wheel and see the bike's tire move, run their hands through the fun handlebar tassels, look in the mylar mirror, and thrill to the joy of witnessing our new bikers first ride in a fun finale \"moving\" pop-up.",
        "Category": " Juvenile Fiction , Sports & Recreation , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Story of Moses (Pop-Up Book)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Creative Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Thomas Alva Edison : Young Inventor (Easy Biographies)",
        "Authors": "By Sabin, Louis",
        "Description": "A biography, focusing on the early years, of the man whose many inventions have changed the lives of millions of people",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Start-to-Finish Landscape Construction",
        "Authors": "By Erickson, Larry (EDT) and Ortho Books (EDT)",
        "Description": "Illustrated, step-by-step instructions teach skills and techniques that guarantee homeowners’ success.Plans for decks, patios, fences, play equipment, and other backyard structures respond to consumers’ needs and inspire other ideas.Helpful tips from pros and other homeowners make projects go smoothly.",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "Ortho",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Gruber's Complete Preparation for the New SAT 8E (GRUBER'S COMPLETE PREPARATION FOR THE SAT)",
        "Authors": "By Gruber, Gary R.",
        "Description": "An author offers his 50 Gruber Critical Thinking Skills as well as five complete practice tests, an extensive vocabulary builder, tips for the new SAT II writing test, and a home study program all designed to help students raise their score on this important exam. Original.",
        "Category": " Study Aids , SAT",
        "Publisher": "Collins Reference",
        "Price Starting With ($)": "6.76",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Erwin Bauer's Wild Alaska",
        "Authors": "By Bauer, Erwin A, Bauer, Peggy, and Bauer, Peggy (PHT)",
        "Description": "",
        "Category": " Photography , General",
        "Publisher": "Outdoor Life",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Reel List: A Categorical Companion to Over 2,000 Memorable Films",
        "Authors": "By Arany, Lynne, Dyja, Tom, and Goldsmith, Gary",
        "Description": "A whimsical movie guide provides reviews and trivia on more than two thousand films and is presented in a thematic format with such section names as \"Killing Your Spouse,\" \"The Afterlife,\" and \"Shakespeare Ripoffs.\" Original.",
        "Category": " Fiction , General",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Macroeconomics: Theories and Policies (6th Edition)",
        "Authors": "By Froyen, Richard T.",
        "Description": "New edition of a macroeconomics textbook that presents the material in the order in which the economic thought evolved. Coverage includes a summary of the Keynesian position, an analysis of the post-1970 slowdown in US output growth, the neo- classical growth model and recent models of endogenous growth, and an examination of monetary and fiscal policy effects in the open economy. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Business & Economics , Economics , Macroeconomics",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Whirlpool (Julesburg Mystery Series #1)",
        "Authors": "By McCourtney, Lorena",
        "Description": "In the wake of a painful divorce, Stefanie is accused of setting the fire that destroyed her workplace, but she finds support from arson investigator Ryan, with whom she struggles to solve a frightening murder mystery. Original.",
        "Category": " Fiction , Religious",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Through The Great Canadian Wilderness : Reader's Digest Travels & Adventure",
        "Authors": "By Payne, Donald (Editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest Association, Incorporated",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Allergies: The Complete Guide to Diagnosis, Treatment, and Daily Management",
        "Authors": "By Young, Stuart H., Dobozin, Bruce S., and Miner, Margaret",
        "Description": "Authoritative, comprehensive, practical, and up-to-date, this clearly written guide will help allergy sufferers find effective relief.Fifty million Americans suffer from allergies, an immune system reaction triggered by exposure to certain foods, chemicals, pollen, dander, and even common household dust. Although the common symptoms--red eyes, runny nose, hives--are not life-threatening for most people, they can make life miserable--so miserable that sufferers spend nearly $500 million per year on over-the-counter drugs that promise relief.Still other Americans suffer from asthma, which can be both uncomfortable and seriously debilitating, or from such severe allergic reactions that the sting of a bee or a shot of penicillin can cause anaphylactic shock, a potentially fatal condition.Written by two specialists in allergy medicine, Allergies will help both the seasonal sneezer and the chronic sufferer find the safest, most comfortable way to live with their allergy.The authors explain types of diagnostic tests and treatments, discuss the use of shots, prescription drugs, nasal antihistamines and corticosteroid sprays, and other treatments, and debunk the many myths that abound in a field fraught with quackery. What is more, they evaluate the most common over-the-counter drugs for safety and effectiveness. Useful, practical information is provided on how to minimize allergens like dust, mites, mold, and pollen in the home environment; how to exercise safely; and how to guard against \"trigger\" foods. Chapters cover occupational allergies (including the \"sick building syndrome\"), allergies and pregnancy, allergies and surgery, and the psychological aspects of allergies. A special section deals with allergies in children. Throughout, important preventive and cautionary advice is given for those at risk for serious asthma attacks and anaphylactic shock.Many allergy sufferers undergo and pay for extensive, expensive diagnostic and treatment methods that have little or no value. Allergies provides the information necessary to find effective self-treatment or proper medical help.",
        "Category": " Health & Fitness , General",
        "Publisher": "Consumer Reports Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The Deep End",
        "Authors": "By Fielding, Joy",
        "Description": "Joanne Hunter's secure suburban world is falling apart. Her husband's desertion after twenty years of marriage leaves her stunned. Eve, her best friend, is strangely distant. Her grandfather, who has been a pillar of strength and support, lies ill and helpless in a nursing home. Lana and Robin, her teenage daughters, claim every ounce of her energy and devotion and all the love she feels she has lost.Only one person seems to care -- a stranger with a rasping voice, a tormentor with a vicious mind. Danger and despair close in with each ring of the telephone. Each deadly message lures her inexorably towards the deep end…From the Paperback edition.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Working From Home: Everything You Need to Know About Living and Working Under the Same Roof",
        "Authors": "By Paul Edwards, Sarah Edwards",
        "Description": "Offers advice on office layout, furniture, equipment, tax considerations, insurance, computers, time management, and isolation",
        "Category": "",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "A Voice in the Wind (Mark of the Lion #1)",
        "Authors": "By Rivers, Francine",
        "Description": "This classic series has inspired nearly 2 million readers. Both loyal fans and new readers will want the latest edition of this beloved series. This edition includes a foreword from the publisher, a preface from Francine Rivers and discussion questions suitable for personal and group use. #1 A Voice in the Wind: This first book in the classic best-selling Mark of the Lion series brings readers back to the first century and introduces them to a character they will never forget—Hadassah. Torn by her love for a handsome aristocrat, a young slave girl clings to her faith in the living God for deliverance from the forces of decadent Rome.",
        "Category": " Fiction , Religious",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Photography Book",
        "Authors": "By Editors of Phaidon Press",
        "Description": "This is an unsurpassed collection of 500 superb images that represent the world's best photographers from the mid-19th century to today, arranged alphabetically by photographer, from pioneers such as Gustave Le Gray and Daguerre to icons such as Robert Capa, to innovative and emerging photographers around the world. Original.",
        "Category": " Photography , Collections, Catalogs, Exhibitions , General",
        "Publisher": "PHAIDON PRESS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Western Intellectual Tradition: From Leonardo to Hegel",
        "Authors": "By Bronowski, Jacob",
        "Description": "Traces the development of thought through historical movements and periods from 1500 to 1830 and stresses the contributions of both the sciences and the humanities.",
        "Category": " Philosophy , History & Surveys , Modern",
        "Publisher": "Harper-perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1962"
        }
    },
    {
        "Title": "The Garden Book: Designing, Creating, and Maintaining Your Garden",
        "Authors": "By Brookes, John",
        "Description": "Describes different types of gardens, shows how to incorporate walls, paths, water, pergolas, and outdoor furniture into a garden design, and offers advice on plant care",
        "Category": " Gardening , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Suez.",
        "Authors": "By Hugh Thomas",
        "Description": "",
        "Category": "",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "New Vegetarian: Bold and Beautiful Recipes for Every Occasion",
        "Authors": "By Webb, Philip (PHT) and Brown, Celia Brooks",
        "Description": "",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Ryland Peters & Small",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Princesses Collection: Stories from the Films",
        "Authors": "By Braybrooks, Ann, Thompkins, Kenny, and Gallego, James",
        "Description": "An anthology of stories captures some favorite moments from popular Disney films, recounting the adventures of such heroines as Snow White, Cinderella, Ariel, Belle, and Jasmine.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "Writings of Aaron Goldman",
        "Authors": "By Goldman, Aaron",
        "Description": "",
        "Category": "",
        "Publisher": "Goldman",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "More writings of Aaron Goldman",
        "Authors": "By Goldman, Aaron",
        "Description": "",
        "Category": "",
        "Publisher": "A. Goldman",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "365 Easy Italian Recipes. a John Boswell Associates Book (365 Ways Series)",
        "Authors": "By O'Connell, Rick Marzullo",
        "Description": "Provides recipes for antipasto, soups, pasta, poultry, seafood, meat, vegetables, breads, salads, and desserts",
        "Category": "",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "The Blind Side (Movie Tie-in Edition)",
        "Authors": "By Lewis, Michael",
        "Description": "When we first meet him, Michael Oher is one of thirteen children by a mother addicted to crack; he does not know his real name, his father, his birthday, or how to read and write. He takes up football, and school, after a rich, white, Evangelical family plucks him from the streets. Then two great forces alter Oher: the family's love and the evolution of professional football into a game where the quarterback must be protected at any cost. Our protagonist becomes the priceless package of size, speed, and agility necessary to guard the quarterback's greatest vulnerability, his blind side.",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Complete Book of Cookies",
        "Authors": "By VALERIE BARRETT CATHERINE ATKINSON JOANN",
        "Description": "",
        "Category": "",
        "Publisher": "HERMES HOUSE",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "He Touched Them",
        "Authors": "By Ideals Publications Inc",
        "Description": "",
        "Category": " Religion , Christianity , General",
        "Publisher": "Ideals Pubns",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Meals That Can Wait",
        "Authors": "By Brooks, Patricia",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "365 Love Poems",
        "Authors": "By Hunt, John Gabriel (COM)",
        "Description": "This beautiful collection of classic love poems from masters such as Yeats, Shakespeare, Browning, Blake, Dickinson, Donne, and others makes the perfect gift for any romantic and can turn any day into Valentine's Day.",
        "Category": " Poetry , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "Celebrate the Seasons (Gooseberry Patch)",
        "Authors": "By Leisure Arts, Inc.",
        "Description": "From Valentine's Day and Easter to the Fourth of July and Christmas, this entertaining and inspirational handbook presents a host of innovative decorating ideas, craft projects, and recipes, all keyd to the major holidays of the year.",
        "Category": " Cooking , Seasonal",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Positive Plus",
        "Authors": "By Brothers, Joyce",
        "Description": "Dr. Joyce Brothers is to psychology what Dr. Benjamin Spock is to pediatrics. For decades she has been a sage, down-to-earth voice of reason to the millions who read her books and newspaper and magazine columns, and heed her advice on television and radio.Now, in her tenth book, Positive Plus: The Practical Plan for Liking Yourself Better, Dr. Brothers takes everything she has learned over the years and shapes this tried and true advice into a guide for the nineties, the decade of moderation. The subject here is change, subtle change. Are there traits about yourself that you hate, that you would like to alter? Are you too shy, too bossy, too jealous? Do you nag too much? Do you seek perfection where mere excellence would suffice? Do you overspend to compensate for feeling underloved?Dr. Brothers demonstrates how these and other negative personality traits can be shaped into positives. She helps readers evaluate whether change is really necessary and, if so, presents a pathway to achieving reasonable improvement.The basis of her plan lies in making small but effective behavioral shifts in the way we respond to others and ourselves. Addressing a wide range of self-destructive tendencies, Dr. Brothers explains what is normal and what is extreme, and outlines a step-by-step method for improvement.The key to change lies in a \"Psychological Tool Kit,\" a collection of behavior modification techniques Dr. Brothers has found simple and effective. She encourages readers to set realistic goals, map out strategies for improvement, and reinforce positive acts. She also suggests ways to handle excessive stress and life's accidents, those events in which even the most solid improvements go astray.Positive Plus is a commonsense, rational, relatively painless way to feel good about yourself. Quickly.",
        "Category": " Psychology , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The Unreasoning Mask",
        "Authors": "By Farmer, Philip Jose",
        "Description": "Ramstan, captain of the al-Buraq, a rare model spaceship capable of instantaneous travel between two points, attempts to stop an unidentified \"creature\" that is annihilating intelligent life on planets throughout the universe",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "13.17",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    }
]