[
    {
        "Title": "The Blood Artists: A Novel",
        "Authors": "By Hogan, Chuck",
        "Description": "Chuck Hogan's new thriller opens as Drs. Stephen Pearse and Peter Maryk are summoned deep into the rain forests of the Congo, where a deadly virus -- set free from a centuries-old uranium cave -- has decimated a mining camp. Desperate, they bomb the area, resealing the cave containing the incurable disease. But two years later, it reappears, devastating the small New England town of Plainville. In the next few years, other isolated incidents are also ruthlessly silenced by Maryk, now head of the Bureau for Disease Control's (BDC) Special Pathogens Section. He and Pearse, now director of the BDC, have become bitter enemies, divided by opposing scientific philosophies. Still, as the virus continues to elude any vaccine with a disturbingly human cunning the men seek not only to stop it but to figure out how it came from Africa. Their battle with \"Plainville\" intensifies as it becomes clear that the virus has acquired a face, having taken over a human host. And in particular, this toxic creature pursues one brave young woman whose blood, immune to the virus, is the serum of life in the face of a viral death. Pearse and Maryk keep her close and protected, while formulating a plan to get to the killer first.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Ever Since Darwin: Reflections in Natural History",
        "Authors": "By Gould, Stephen Jay",
        "Description": "",
        "Category": "",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "Cherry Ames, Senior Nurse",
        "Authors": "By Helen Wells",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "11.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1944"
        }
    },
    {
        "Title": "Heartwood",
        "Authors": "By Burke, James Lee",
        "Description": "Heartwood is a kind of tree that grows in layers. And as Billy Bob's grandfather once told him, you do well in life by keeping the roots in a clear stream and not letting anyone taint the water for you. But in Holland's dusty little hometown of Deaf Smith, in the hill country north of Austin, local kingpin Earl Deitrich has made a fortune running roughshod and tainting anyone who stands in his way. Billy Bob has problems with Deitrich and his shamelessly callous demeanor, but can't shake the legacy of his passion for Deitrich's \"heartbreak-beautiful\" wife, Peggy Jean.When Holland takes on the defense of Wilbur Pickett - a man accused of stealing an heirloom and three hundred thousand dollars in bonds from Deitrich's office - he finds himself up against not only Earl's power and influence, but also a past Billy Bob can't will away.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Last Parallel: A Marine's War Journal",
        "Authors": "By Russ, Martin",
        "Description": "This account of Russ' experiences as a Marine in Korea offers a realistic look at combat",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Fromm Intl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Friendly fire",
        "Authors": "By Bryan, C. D. B.",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Four Mothers",
        "Authors": "By Bilu, Dalya (TRN) and Horn, Shifra",
        "Description": "Shifra Horn's beautifully imagined novel tells the story of four generations of women in one family against the background of one hundred years in Jerusalem.The story begins with Amal, of the fifth generation, who is despondent over her husband's desertion after the birth of her son. Her mother, grandmother and great-grandmother are overjoyed, because the birth of a healthy boy means that their family's long curse has been broken - there is no daughter to inherit it. Come, listen, they say to Amal, listen to the story of the curse that foreshadowed every father's disappearance. Be comforted by your \"four mothers\": Mazal, the orphan, whose ill-fated marriage initiates the curse; her daughter Sara, whose beautiful golden hair becomes a symbol for her power to heal; Sara's daughter Pnina-Mazal, the unwanted child whose talent for knowing others' thoughts brings her both joy and sorrow; and her daughter Geula, Amal's mother, whose sharp intellect and idealism are her gift and her burden.",
        "Category": " Fiction , Literary",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "A Moment with God for Graduates",
        "Authors": "By Walker, Maribeth",
        "Description": "Provides 58 prayers appropriate for graduates. Most importantly for today’s busy lifestyles, each prayer is short enough to be read in only a couple of minutes. The inclusion of a Scripture passage for every prayer makes it suitable for use in both personal and group devotion. Convenient pocket-size.",
        "Category": " Religion , Christian Education , General",
        "Publisher": "DIMENSIONS FOR LIVING",
        "Price Starting With ($)": "6.09",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Politically Correct Guide to American History",
        "Authors": "By Moser, Edward P.",
        "Description": "The Founding Fathers were cross-dressers. Paula Bunyan was a lumberjane. To Benedict Arnold, treason was just another lifestyle choice. This is not the American past you may remember from social studies class, because The Politically Correct Guide to American History rewrites U.S. history according to the core curriculum of political correctness: frivolous lawsuits, animal rights activism, racial quotas, and in-your-face feminism. This wide-ranging tour de farce is a satirical stew of such varying topical material as tabloid journalism, gun control, the Royal Family, and of course the O. J. Simpson trial.In this cracked herstorical text, George Washington doesn't chop down a cherry tree - he murders a noble representative of a voiceless, beleaguered species. In a retold \"The Devil and Daniel Webster,\" Satan is an innocent victim of fire-and-brimstone syndrome. The Louisiana Purchase almost never happens because President Thomas Jefferson faces a sexual harassment suit from Sally Hemings. The gang of outlaws at the O. K. Corral is recast as a freedom-loving private militia.",
        "Category": " Humor , Topic , Political",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Charlie Rangers",
        "Authors": "By Rotundo, John L. and Ericson, Don",
        "Description": "They were the biggest Ranger company in Vietnam, and the best. For eighteen months, John L. Rotundo and Don Ericson braved the test of war at its most bloody and most raw, specializing in ambushing the enemy and fighting jungle guerillas using their own tactics. From the undiluted high of a \"contact\" with the enemy to the anguished mourning of a fallen comrade, they experienced nearly every emotion known to man--most of all, the power and the pride of being the finest on America's front lines.",
        "Category": "",
        "Publisher": "Presidio Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "The Connecticut Wits",
        "Authors": "By Vernon Louis Parrington",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Crowell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Discourse on Method and Meditations",
        "Authors": "By Rene Descartes",
        "Description": "",
        "Category": "",
        "Publisher": "Bobbs-Merrill Educational Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1960"
        }
    },
    {
        "Title": "The Bobbsey Twins at London Tower [Bobbsey Twins, 52]",
        "Authors": "By Hope, Laura Lee",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Tribeca Blues",
        "Authors": "By Fusilli, Jim",
        "Description": "Taking on some pro-bono work to help his recovery from the deaths of his wife and son, private investigator Terry Orr searches for the elusive wife of a recently deceased friend and abruptly confronts the man he believes is responsible for his family's demise. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Undue Influence (A Paul Madriani Novel)",
        "Authors": "By Steiger, Brad",
        "Description": "Discover the secrets of animal totems and their sacred, transformative powers.Among traditional Native Americans and other tribal peoples, totems are the enduring animal symbols that allow these peoples to explore the mysteries of life and the spirit world. from the graceful Antelope to the aggressive Cougarto the wise and peaceful Turtle, each animal embodies certain strengths and attributes that the spiritual seeker can embrace and follow on the path of self -exploration. Now, Totems offers each of us the tools we need to tap into thepower of sacred animal totems by finding our own personal symbol and experiencing its energy firsthand.Drawing upon his long association with native teachers, as well as guidance from his own spirit helper, author Brad Steiger has created a fascinating, informative, and thorough guide to this ancient Spiritual practice. Filled with the wisdom of many different tribes and cultures, Totems provides exercises and techniques for:choosing your own animal totem from the American Indian Zodiacreceiving dream and vision teachings using animal totemsembarking on a spirit journeylearning the healing powers of totemscalling on your spiritual helpers in times of need",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Jove",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "By the Rivers of Babylon",
        "Authors": "By DeMille, Nelson",
        "Description": "Lod Airport, Israel: Two Concorde jets take off for a U.N. conference that will finally bring peace to the Middle East. Covered by F-14 fighters, accompanied by security men, the planes carry warriors, pacifists, lovers, enemies, dignitaries -- and a bomb planted by a terrorist mastermind.Suddenly they're forced to crash-land at an ancient desert site. Here, with only a handful of weapons, the men and women of the peace mission must make a desperate stand against an army of crack Palestinian commandos -- while the Israeli authorities desperately attempt a rescue mission. In a land of blood and tears, in a windswept place called Babylon, it will be a battle of bullets and courage, and a war to the last death.",
        "Category": " Fiction , Thrillers",
        "Publisher": "WARNER BOOKS INC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Whose Woods These Are",
        "Authors": "By Michael Fromme",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "6.03",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Déjà Dead",
        "Authors": "By Reichs, Kathy",
        "Description": "The raves are in -- from Edgar-winning authors and internationally acclaimed forensic experts: Kathy Reichs and D&#233j&#224 Dead are something special. Rarely has a debut crime novel inspired such widespread excitement. A born storyteller, Dr. Kathy Reichs walks in the steps of her heroine, Dr. Temperance Brennan. She spends her days in the autopsy suite, the courtroom, the crime lab, with cops, and at exhumation sites. Often her long days turn into harrowing nights. It's June in Montreal, and Tempe, who has left a shaky marriage back home in North Carolina to take on the challenging assignment of director of forensic anthropology for the province of Quebec, looks forward to a relaxing weekend. First, though, she must stop at a newly uncovered burial site in the heart of the city. One look at the decomposed and decapitated corpse, stored neatly in plastic bags, tells her she'll spend the weekend in the crime lab. This is homicide of the worst kind. To begin to find some answers, Tempe must first identify the victim. Who is this person with the reddish hair and a small bone structure?",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Scribner",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Truth Machine: A Speculative Novel",
        "Authors": "By Halperin, James L.",
        "Description": "The pivotal election year of 2004 will determine more than the next president of the United States. Violent crime continues to be the number one political issue in America. For many citizens, a vote for Senator Travis Hall is also a vote for his controversial Swift and Sure Anti-Crime Bill, a measure that guarantees a previously convicted violent criminal one fair trial, one quick appeal, then immediate execution. Voters overwhelmingly support the idea, surrendering their individual rights and due process of law with a resounding \"yes\" for capital punishment.One of the most influential businessmen in the world, Harvard graduate and software prodigy Randall Armstrong, has one goal: to build a machine that can detect lies with 100 percent accuracy. But aside from assuring the guilt in death-row cases, the device has broad implications for a planet on a collision course with self-destruction.Once perfected, the Truth Machine changes the face of the world. Most lawyers find themselves looking for new, productive jobs as crime, violent behavior, and court cases are eliminated, virtually overnight. Individuals are truth-tested for civil litigation and mediation. Political candidates must be perfectly frank, no longer relying on popular opinion polls or harboring hidden agendas. Refusal to submit to the Truth Machine brands a politician un-electable. Through a series of simple questions, the Truth Machine can diagnose mental illness with astonishing success.As its use spreads from courtroom to politics, to diplomacy, business, science, education, and finally into every home throughout the world, the Truth Machine reshapes the very nature of humanity. But ultimately, the fate of the earth rests with humankind. Are we up to the challenge?",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Del Rey",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Penguin Encyclopedia of American History",
        "Authors": "By Brinkley, Douglas and ROSENBAUM, ROBERT A",
        "Description": "Its 350,000 words and 1,500 entries include articles on every presidential election through 2000, on every presidential administration to George W. Bush's, on the U.S. Supreme Court under 11 justices, and on landmark Court cases from Marbury v. Madison (1803) to Zelman v. Simmons-Harris (2002). There are articles on two dozen perennial public issues, including Affirmative Action, Campaign Financing, Church-State Relations, Consumer Protection, Environmentalism, Poverty, Welfare, and Women in the Labor Force. Seminal books from The Federalist to The Feminine Mystique are described.Foreign events that have impacted American history - the French, Russian, and Mexican revolutions, the Spanish Civil War, and the Holocaust - are treated. There are articles on U.S. relations with Mexico, the Caribbean and Central America, South America, and the Middle East. Other articles cover U.S. recognition of the Latin American republics, the Soviet Union, and Israel, and describe the postwar U.S. occupations of Germany and Japan.Some recent subjects make their encyclopedia debuts - Anthrax Attack, Bush Doctrine, Bush v. Gore, Corporate Responsibility Act, Enron Bankruptcy, Globalization, New Economy, School Vouchers, Terrorism War, U.S.A. Patriot Act, World Trade Center Attacks, Y2K (Year 2000) Anxiety.Although biographies as a class are omitted, the volume contains twelve articles on famous pairs, including Hamilton and Jefferson, Jackson and Clay, Jefferson and Madison, Johnson and McNamara, Lincoln and Douglas, Stanton and Anthony, Truman and Acheson, and Wilson and Lodge. In addition, there are half a dozen articles on the careers of men who somehow epitomized their ages, including John Brown, Charles Lindbergh, J. P. Morgan, and George C. Wallace.",
        "Category": " History , Reference",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Essential Guide to Hiking in the United States",
        "Authors": "By Cook, Charles",
        "Description": "Provides a wealth of information on the sport of hiking, lists 387 hiking areas state-by-state, and rates the major trails according to terrain, visual beauty, and degree of difficulty",
        "Category": " Nature , General",
        "Publisher": "Michael Kesend Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Needle craft (Rd Home Handbook Series)",
        "Authors": "By Brittain, Judy",
        "Description": "Introduces embroidery, needlepoint, quilting, applique, knitting, crocheting, dressmaking, and household sewing, and demonstrates basic stitches",
        "Category": " Crafts & Hobbies , Needlework , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Connected Corporation: How Leading Companies Manage Customer-Supplier Alliances",
        "Authors": "By Lewis, Jordan D.",
        "Description": "Until now, the relationship between a company and its customers or suppliers has consisted of arms-length haggling over the price of a part or a service. Today, reveals alliance expert Jordan D. Lewis, customers and suppliers are actually embracing each other?sharing data, design work, and even research and development. The result, Lewis finds, has been a dramatic improvement in each firm's costs, quality, cycle times, and customer satisfaction?without added expense. Building on his groundbreaking work, Partnerships for Profit, Lewis shows managers how to maximize the potential of these new customer-supplier alliances?described by the Wall Street Journal as a \"revolution\"?by drawing upon his hands-on experience and research with best-practicefirmsworldwidesuchas Motorola, Chrysler, and Marks & Spencer.  Although more and more firms now recognize the importance of customer-supplier alliances, few actually know how to make them work. Using interviews with employees ranging from top executives to purchasing and sales people, Lewis takes the reader inside these leading-edge companies and their top suppliers to show precisely how the \"connected\" corporation can double its competitive resources by forging customer-supplier relationships for greater financial strength, higher market share, more value, and increased operating flexibility.  Lewis provides the tools managers need to structure and manage effective and successful alliances. He discusses all of the initial questions on how to get started?when to use alliances, how to choose the best partners, and how to set clear objectives targeted on high performance. Specific techniques are presented to foster joint creativity?from building interfirm teams to systems-based thinking?as well as methods for monitoring alliance performance and progress. Lewis also shows ways to develop the foundation of cooperation, negotiation, and trust between partners which is so crucial in achieving optimum competitive advantage.  By capitalizing on the new customer-supplier alliances, any firm can increase its competitiveness regardless of industry, company size, or whether its focus is on goods or services. Lewis provides managers of all types with the framework they need to avoid the pitfalls and enjoy the full benefits of the connected corporation.",
        "Category": " Business & Economics , Forecasting",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Fighting Back: The War on Terrorism - From Inside the Bush White House",
        "Authors": "By Sammon, Bill",
        "Description": "A behind-the-scenes examination of the War on Terrorism shares up-to-the-minute details about the decision-making process of George W. Bush and his team from within the White House Situation Room, on board Air Force One, and elsewhere.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "By the Light of My Fathers Smile",
        "Authors": "By Walker, Alice",
        "Description": "",
        "Category": "",
        "Publisher": "Random House~trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "S",
        "Authors": "By Updike, John",
        "Description": "S. is the story of Sarah P. Worth, a thoroughly modern spiritual seeker who has become enamored of a Hindu mystic called the Arhat. A native New Englander, she goes west to join his ashram in Arizona, and there struggles alongside fellowsannyasins (pilgrims) in the difficult attempt to subdue ego and achieve moksha (salvation, release from illusion). “S.” details her adventures in letters and tapes dispatched to her husband, her daughter, her brother, her dentist, her hairdresser, and her psychiatrist—messages cleverly designed to keep her old world in order while she is creating for herself a new one. This is Hester Prynne’s side of the triangle described by Hawthorne’sScarlet Letter; it is also a burlesque of the quest for enlightenment, and an affectionate meditation on American womanhood.From the Trade Paperback edition.",
        "Category": " Fiction , Religious",
        "Publisher": "Alfred A Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Flattened Fauna: A Field Guide to Common Animals of Roads, Streets and Highways",
        "Authors": "By Knutson, Roger M.",
        "Description": "A guide to wild animals that are most often seen as flattened specimens along the road also provides information on the eating, mating, and locomotion habits of common roadside animals in North America",
        "Category": " Nature , Animals , General",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "The Prophet of Yonwood (Ember, Book 3)",
        "Authors": "By Duprau, Jeanne",
        "Description": "It’s 50 years before the settlement of the city of Ember, and the world is in crisis. War looms on the horizon as 11-year-old Nickie and her aunt travel to the small town of Yonwood, North Carolina. There, one of the town’s respected citizens has had a terrible vision of fire and destruction. Her garbled words are taken as prophetic instruction on how to avoid the coming disaster. If only they can be interpreted correctly. . . .As the people of Yonwood scramble to make sense of the woman’s mysterious utterances, Nickie explores the oddities she finds around town—her great-grandfather’s peculiar journals and papers, a reclusive neighbor who studies the heavens, a strange boy who is fascinated with snakes—all while keeping an eye out for ways to help the world. Is this vision her chance? Or is it already too late to avoid a devastating war?In this prequel to the acclaimed The City of Ember and The People of Sparks, Jeanne DuPrau investigates how, in a world that seems out of control, hope and comfort can be found in the strangest of places.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Afterlife and Other Stories",
        "Authors": "By Updike, John",
        "Description": "To Carter Billings, the hero of John Updike’s title story, all of England has the glow of an afterlife: “A miraculous lacquer lay upon everything, beading each roadside twig, each reed of thatch in the cottage roofs, each tiny daisy trembling in the grass.” All twenty-two of the stories in this collection—John Updike’s eleventh, and his first in seven years—in various ways partake of this glow, as life beyond middle age is explored and found to have its own particular wonders, from omniscient golf caddies to precinct sexual rumors, from the deaths of mothers and brothers-in-law to the births of grandchildren. As death approaches, life takes on, for some of these aging heroes, a translucence, a magical fragility; vivid memory and casual misconception lend the mundane an antic texture, and the backward view, lengthening, acquires a certain grandeur. Travel, whether to England or Ireland, Italy or the isles of Greece, heightens perceptions and tensions. As is usual in Mr. Updike’s fiction, spouses quarrel, lovers part, children are brave, and houses with their décor have the presence of personalities. His is a world where innocence stubbornly persists, and fresh beginnings almost outnumber losses.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Rhett Butler's People",
        "Authors": "By McCaig, Donald",
        "Description": "Fully authorized by the Margaret Mitchell estate, Rhett Butler’s People is the astonishing and long-awaited novel that parallels the Great American Novel, Gone With The Wind. Twelve years in the making, the publication of Rhett Butler’s People marks a major and historic cultural event. Through the storytelling mastery of award-winning writer Donald McCaig, the life and times of the dashing Rhett Butler unfolds.  Through Rhett’s eyes we meet the people who shaped his larger than life personality as it sprang from Margaret Mitchell’s unforgettable pages: Langston Butler, Rhett’s unyielding father; Rosemary his steadfast sister; Tunis Bonneau, Rhett’s best friend and a onetime slave; Belle Watling, the woman for whom Rhett cared long before he met Scarlett O’Hara at Twelve Oaks Plantation, on the fateful eve of the Civil War.  Of course there is Scarlett.  Katie Scarlett O’Hara, the headstrong, passionate woman whose life is inextricably entwined with Rhett’s: more like him than she cares to admit; more in love with him than she’ll ever know… Brought to vivid and authentic life by the hand of a master, Rhett Butler’s People fulfills the dreams of those whose imaginations have been indelibly marked by Gone With The Wind.",
        "Category": " Fiction , Historical",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Zen Buddhism: Selected Writings Of D. T. Suzuki",
        "Authors": "By Daisetz Teitaro Suzuki",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Company, Inc./Anchor",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "Against the Night: Living in the New Dark Ages",
        "Authors": "By Colson, Charles and Vaughn, Ellen Santilli",
        "Description": "Argues that the U.S. is on the eve of a new dark age and explains how the Christian community can turn the situation around",
        "Category": " Religion , General",
        "Publisher": "Vine Books (Servant Publications)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "A Perfect Evil",
        "Authors": "By Kava, Alex",
        "Description": "As a deranged killer stalks the terrified community of Platte City, Nebraska, all evidence points to the recently executed Ronald Jeffreys as the culprit, but FBI Maggie O'Dell soon uncovers evidence that Jeffreys had been convicted and executed for crimes he did not commit and that the real maniacal murderer is still on the loose.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Mira",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The American Dream: The 50s (Our American Century)",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Examines the politics, suburbia, automobiles, art and entertainment, cold war, television, and sports of the 1950s.",
        "Category": " History , United States , 20th Century",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Eleventh Plague: A Novel of Medical Terror",
        "Authors": "By Marr, John S. and Baldwin, John",
        "Description": "What if the ten plagues from the Book of Exodus were coming true in America today? What if they were not acts of God but the brilliantly fiendish creations of an evil genius? In this galvanizing novel of medical terror, death stalks the land, and the only hope of preventing a cataclysm beyond biblical proportions lies with one maverick virologist who is himself in danger of becoming either a suspect or a victim.  In present-day Southern California, two children die of a disease thought to be nonexistent in the United States. Within hours, Thoroughbreds at the legendary Churchill Downs are dying of a virus that cannot be identified, even by the most expert veterinarians. Called in to help shed light on  these gruesome enigmas, noted virologist Jack  Bryne discovers that the two events are not only connected, they are deliberate acts of bioterrorism.  When it occurs to him that the deaths bear uncanny similarities to the Fifth and Sixth Plagues described in Exodus, Bryne is convinced he&#39;s uncovered a growing progression of horrors. He&#39;s right, and every month another monstrosity claims its victims. Every month sees the reenactment of another even more catastrophic plague.  Soon Bryne&#39;s worldwide medical computer network, ProMED, is invaded by the power behind the horrors, teasing him, challenging him--a morbidly brilliant serial killer with a dangerously sophisticated knowledge of toxins and an obsession with biblical  retribution. Bryne, himself now considered a suspect by the FBI, must convince the Bureau of his innocence and joins forces with his brilliant lab assistant, a TV newswoman, and a young Orthodox Jewish religious scholar--to track down the maniac and stop him in time.  But even Bryne cannot predict how close the killer is until he meets this modern medical Moriarty in a midnight confrontation that will determine the future of New York City.  Written by one of this country&#39;s most respected public health figures, and a novelist with a genius for the macabre, The Eleventh Plague is scientifically prescient and utterly compelling. It&#39;s a premier thriller for the millennium--bound to leave you with the disturbing realization that the real terror begins once the last page has been turned.  The biblical plagues were acts of God, this time they are man-made  Waters of Blood Frogs Lice Swarms  Death of the Animals  Boils  Hailstorms  Locusts  Darkness  Destruction of the Firstborns  And the worst is yet to come...The Eleventh Plague--you will never feel safe again.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "From Tiny Beginnings",
        "Authors": "By Overholt, James",
        "Description": "",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Brethren Pr",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Team Building, Revised Edition: An Exercise in Leadership (Crisp Fifty-Minute Books)",
        "Authors": "By Maddux, Robert B.",
        "Description": "",
        "Category": "",
        "Publisher": "Crisp Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Who Moved My Cheese? for Teens",
        "Authors": "By Johnson, Spencer",
        "Description": "Help a teen you know deal with the changes in his or her life with the book that has helped so many others. ?Cheese? is a metaphor for what you want in life and the book gives teens a fun vocabulary and way to understand change and move forward in their lives.",
        "Category": " Young Adult Nonfiction , Reference",
        "Publisher": "G.P. Putnam's Sons Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Citizen McCain",
        "Authors": "By Drew, Elizabeth",
        "Description": "The most original, the most sought-after politician in America today, Senator John McCain is at the front of a large movement -- people who are dissatisfied with the way politics is conducted in this country. They are eager for change, and McCain's independence and his vigorous leadership have inspired them.  Granted unique access to the Senator and his closest aides, prizewinning journalist Elizabeth Drew offers a close-up, fascinating account of Senator McCain as he goes about the legislative business of achieving campaign finance reform, his signature issue, building coalitions, and working across party lines. As she shows him in action, McCain is revealed as a shrewd and long-sighted strategist, someone who works with his colleagues far more successfully than his image might suggest. We see this original mind at work and get new insights into his complex personality.  Drew also shows how McCain has broadened his agenda, putting him at a pivotal place in American political life.  In this riveting narrative, replete with McCain's unusual candor, and his unorthodox ways, we see how this war hero turned political leader is showing the public -- and cynical Washington insiders -- that there are other ways to go about working for the public",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Room at the Inn: Mustangs and Mistletoe/Orange Blossom Christmas (Heartsong Christmas 2-in-1)",
        "Authors": "By Griffin, Pamela and Dykes, Kristy",
        "Description": "",
        "Category": " Fiction , Romance , General",
        "Publisher": "Barbour Publishing Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Best of the Wine Country: A Witty, Opinionated and Remarkably Useful Guide to California's Vinelands",
        "Authors": "By Martin, Don W. and Martin, Betty Woo",
        "Description": "",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Pine Cone Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Cooking with Grease: Stirring the Pots in American Politics",
        "Authors": "By Brazile, Donna",
        "Description": "Cooking with Grease is a powerful, behind-the-scenes memoir of the life and times of a tenacious political organizer and the first African-American woman to head a major presidential campaign.  Donna Brazile fought her first political fight at age nine -- campaigning (successfully) for a city council candidate who promised a playground in her neighborhood. The day after Martin Luther King Jr. was assassinated, she committed her heart and her future to political and social activism. By the 2000 presidential election, Brazile had become a major player in American political history -- and she remains one of the most outspoken and forceful political activists of our day.  Donna grew up one of nine children in a working-poor family in New Orleans, a place where talking politics comes as naturally as stirring a pot of seafood gumbo -- and where the two often go hand in hand. Growing up, Donna learned how to cook from watching her mother, Jean, stir the pots in their family kitchen. She inherited her love of reading and politics from her grandmother Frances. Her brothers Teddy Man and Chet worked as foot soldiers in her early business schemes and voter registration efforts.  Cooking with Grease follows Donna's rise to greater and greater political and personal accomplishments: lobbying for student financial aide, organizing demonstrations to make Martin Luther King Jr.'s birthday a national holiday and working on the Jesse Jackson, Dick Gephardt, Michael Dukakis and Bill Clinton presidential campaigns. But each new career success came with its own kind of heartache, especially in her greatest challenge: leading Al Gore's 2000 campaign, making her the first African American to lead a major presidential campaign.  Cooking with Grease is an intimate account of Donna's thirty years in politics. Her stories of the leaders and activists who have helped shape America's future are both inspiring and memorable. Donna's witty style and innovative political strategies have garnered her the respect and admiration of colleagues and adversaries alike -- she is as comfortable trading quips with J. C. Watts as she is with her Democratic colleagues. Her story is as warm and nourishing as a bowl of Brazile family gumbo.",
        "Category": " Political Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The church we love",
        "Authors": "By La Roe, Wilbur",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon-Cokesbury Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "Sierra Club Guide to the Natural Areas of Colorado and Utah (Sierra Club Totebook)",
        "Authors": "By Perry, Jane Greverus",
        "Description": "",
        "Category": "",
        "Publisher": "Sierra Club Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Down the Great Unknown: John Wesley Powell's 1869 Journey of Discovery and Tragedy Through the Grand Canyon",
        "Authors": "By Dolnick, Edward",
        "Description": "Drawing on rarely examined diaries and journals, Down the Great Unknown is the first book to tell the full, dramatic story of the Powell expedition. On May 24, 1869 a one-armed Civil War veteran, John Wesley Powell and a ragtag band of nine mountain men embarked on the last great quest in the American West. The Grand Canyon, not explored before, was as mysterious as Atlantis—and as perilous. The ten men set out from Green River Station, Wyoming Territory down the Colorado in four wooden rowboats. Ninety-nine days later, six half-starved wretches came ashore near Callville, Arizona.Lewis and Clark opened the West in 1803, six decades later Powell and his scruffy band aimed to resolve the West’s last mystery. A brilliant narrative, a thrilling journey, a cast of memorable heroes—all these mark Down the Great Unknown, the true story of the last epic adventure on American soil.",
        "Category": " Travel , United States , General",
        "Publisher": "HarperCollins Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "When Am I Going to Be Happy?: How to Break the Emotional Bad Habits That Make You Miserable",
        "Authors": "By Russianoff, Penelope",
        "Description": "Learn to change the emotional bad habits that make you unhappy.- Recognize Your Emotional Bad Habits (and start to break them)- Throw Off Your Security Blanket (and accept that you can have happiness)- Talk Tenderly To Yourself (and increase self-esteem)- Use The \"To You-Ness To Me-Ness\" Technique (and respond to negative comments with firm conviction, not rage)- Get Rid Of The Imposter Phenomenon (and stop devaluing yourself)- Accept Praise (and cease being your own worst critic)- Stop Measuring Your Self",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Listening for God: Contemporary Literature and the Life of Faith, Volume 2",
        "Authors": "By Carlson, Paula J. (EDT) and Hawkins, Peter S. (EDT)",
        "Description": "",
        "Category": " Religion , Christianity , Lutheran",
        "Publisher": "Augsburg Fortress Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Better Body Management: Practical Tips for a Lifetime of Health and Fitness",
        "Authors": "By Omartian, Stormie",
        "Description": "",
        "Category": " Health & Fitness , General",
        "Publisher": "Chordant Distribution",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Perception: Facts and Theories (Opus Books)",
        "Authors": "By Mundle, C.",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Henry and Mudge and the Funny Lunch Level 2 Reader (Henry and Mudge Ready-to-Read)",
        "Authors": "By Rylant, Cynthia and Bracken, Carolyn (ILT)",
        "Description": "When Henry decides to create a special Mother's Day lunch for his mother, he asks his Dad for help in picking out just the right treats for the event, but Mudge doesn't seem to want to wait for the unveiling of the surprise and so Henry has to make sure to keep hungry Mudge far away before he gobbles it all up! Reprint.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Playing with Art: Florence",
        "Authors": "By Maria S. De Salvia Baldini",
        "Description": "",
        "Category": "",
        "Publisher": "Mandragora",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Pirates of the Caribbean: Dead Man's Chest - The Chase Is on (Pirates of the Carribean:Dead Man's Chest)",
        "Authors": "By Redbank, Tennant (ADP)",
        "Description": "Readers would rather walk the plank than miss out on these two amazing 8x8 retellings of Pirates of the Caribbean: Dead Man's Chest. Each book will retell a different portion of the story and will provide kids with action-packed scenes from the film. No young swashbuckler will want to be without his copy!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Grand Teton: Citadels of Stones (Genesis Series (San Francisco, Calif.).)",
        "Authors": "By Schmidt, Jeremy, Schmidt, Thomas, Clay, Willard, Clay, Kathy, Clay, Willard (PHT), and Clay, Kathy (PHT)",
        "Description": "Shares impressions of the Grand Teton Mountains, and describes the region's geology and wildlife",
        "Category": " History , United States , General",
        "Publisher": "Collins Pub San Francisco",
        "Price Starting With ($)": "6.11",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "If You're Trying to Teach Kids How to Write, You've Gotta Have This Book! (Kids' Stuff Book)",
        "Authors": "By Frank, Marjorie",
        "Description": "",
        "Category": "",
        "Publisher": "Incentive Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Healing Through the Power of Prayer: What the Bible Says About Healing",
        "Authors": "By Dailey, Timothy",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Putting On a Gentle & Quiet Spirit: 1 Peter (A Woman After God's Own Heart®)",
        "Authors": "By George, Elizabeth",
        "Description": "Elizabeth George takes readers through a thought-provoking study of Peter's teachings on handling trials and persecutions, including: suffering for doing good; understanding the mysteries of God; and fanning the flame of faith. The special \"heart response\" sections offer readers suggestions to help them apply biblical truths to their lives and focus on the amazing glory God promises.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Writing Down the Days",
        "Authors": "By Dahlstrom, Lorraine M.",
        "Description": "Presents journal-writing assignments for each day of the year.",
        "Category": " Young Adult Nonfiction , Language Arts , Composition & Creative Writing",
        "Publisher": "Free Spirit Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Tudors (British Monarchy)",
        "Authors": "By Morris, Christopher",
        "Description": "",
        "Category": "",
        "Publisher": "Fontana",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1972"
        }
    },
    {
        "Title": "Arthur Goes to Camp -(Arthur Adventure Series)",
        "Authors": "By Brown, Marc Tolon",
        "Description": "With a cabin full of frogs, Arthur can't wait to leave summer camp. He runs away during the big scavenger hunt. But his friend's need Arthur's help to win against a rival camp. Where did Arthur go?",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "The Berenstain Bears and Baby Makes Five",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "This classic Berenstain Bears story is a perfect way to teach children about what it’s like to have a new baby in the house! Come for a visit in Bear Country with this classic First Time Book® from Stan and Jan Berenstain. The Bear family has a new addition . . . a baby girl named Honey! However, Sister isn’t sure she likes having the new baby in the tree house. Honey cries, is always hungry, and gets all the attention. Will things ever get better for Sister? Includes over 50 bonus stickers!",
        "Category": " Juvenile Fiction , Family , New Baby",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Berenstain Bears and Too Much Teasing",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "This classic Berenstain Bears story is a perfect way to teach children about kindness and consideration!Come for a visit in Bear Country with this classic First Time Book® from Stan and Jan Berenstain. Brother has begun to tease Sister because he thinks it’s funny, but when the tables are turned and Too-Tall-Grizzly starts teasing Brother, a very valuable lesson is learned. Includes over 50 bonus stickers!",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Arthur's First Sleepover: An Arthur Adventure",
        "Authors": "By Brown, Marc Tolon",
        "Description": "Arthur invites Buster and the Brain to a backyard sleepover. The boys have heard rumors about alien sightings, and they run for their lives when they see strange flashing lights in the distance. Things return to normal, however, when they discover that the \"alien\" is from the planet D.W. Text copyright 2004 Lectorum Publications, Inc.",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Child of Fortune",
        "Authors": "By Spinrad, Norman",
        "Description": "Chronicles the odyssey of Wendi Shasta Leonardo and her encounter in the majestic land of Edoku with Pater Pan and his followers, the Gypsy Jokers",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "29.21",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "A Reason to Live! A Reason to Die!: A New Look at Faith in God",
        "Authors": "By Powell, John",
        "Description": "",
        "Category": "",
        "Publisher": "Tabor Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1972"
        }
    },
    {
        "Title": "The Anxiety Disease: New Hope for the Millions Who Suffer from Anxiety",
        "Authors": "By Sheehan, David V., M.D.",
        "Description": "Anxiety is not always psychological but rather a disease that can now be controlled. The symptoms are devastating: sudden unprovoked attacks of anxiety-accompanied by skipping and racing of the heart, shortness of breath, lightheadedness, dizzy spells. Even worse is the fear that you are losing your mind. But here's the good news. The more unexpected and unprovoked the attacks or the symptoms, the more likely that the victim is suffering from a biologically beset disease. What's more, medical science can now overcome this disease in virtually all cases through a combination of drugs and behavior therapy. Dr. David V. Sheenan, formerly of the Havard Medical School, is now the Director of Research of the College of Medicine at the University of South Florida in Tampa. He draws upon recent research and his own pioneering breakthroughs in the treatment of anxiety to present in this book: -Quizzes that will help you determine whether your anxiety is caused by normal stress or is the result of a genetically influenced physical disorder. Seven progressive stages of the disease-and the four steps necessary for recovery. Detailed case histories of former anxiety victims who are now leading full and productive lives. Reassurance and guidance to family members and friends who want to help, but don't know how. This book offers new hope to millions of men and women across the country.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Better Homes and Gardens Great Cookouts",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Living the Psalms: A Confidence for All Seasons",
        "Authors": "By Dunnam, Maxie",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Upper Room",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Becoming a Woman of Prayer: A Bible Study",
        "Authors": "By Heald, Cynthia",
        "Description": "For Ingest Only - Data needs to be cleaned up for all products being loaded",
        "Category": " Self-help , General",
        "Publisher": "NavPress Publishing Group",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "The Big Lie (McGee & Me! (Paperback))",
        "Authors": "By Focus on the Family",
        "Description": "",
        "Category": "",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Dark Day in the Deep Sea (Magic Tree House, No. 39)",
        "Authors": "By Murdocca, Sal (ILT) and Osborne, Mary Pope",
        "Description": "When eight-year-old Jack and his seven-year-old sister, Annie, join a group of nineteenth-century explorers aboard the H.M.S. Challenger, they learn about the ocean, solve the mystery of its fabled sea monster, and gain compassion for their fellow creatures.When eight-year-old Jack and his seven-year-old sister, Annie, join a group of nineteenth-century explorers aboard the H.M.S. Challenger, they learn about the ocean, solve the mystery of its fabled sea monster, and gain compassion for their fellow creatures.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Money: Handling the Bucks (Lifestyle Small Group)",
        "Authors": "By Menconi, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "NavPress Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Letting Go",
        "Authors": "By Glazer, Robin Kriegsman",
        "Description": "Suggests techniques for parents for aiding in the development of the personality, self-image, and independence of children from the ages of 2 to 5 years",
        "Category": " Nature , General",
        "Publisher": "Citadel Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "Nehemiah (Life Changes)",
        "Authors": "By Editors",
        "Description": "",
        "Category": "",
        "Publisher": "Nav Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "I Love Sunday School",
        "Authors": "By Bayly, Joseph",
        "Description": "",
        "Category": "",
        "Publisher": "David C. Cook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "The silence is broken (Margo mysteries)",
        "Authors": "By Jenkins, Jerry B.",
        "Description": "",
        "Category": "",
        "Publisher": "T. Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Five Needs Your Child Must Have Met at Home",
        "Authors": "By Hutchcraft, Ronald",
        "Description": "Children don’t come with instructions! It has never been more challenging to be a parent -- or more hazardous to be a child. In Five Needs Your Child Must Have Met at Home, Ron Hutchcraft presents a practical roadmap for how to raise stable children in an unstable world. No matter how far you are on the parenting road, Hutchcraft can show you how to make the most of the days you have left with your children. Five Needs Your Child Must Have Met at Home details the five critical needs of every child: the need for a secure self, honest sexual answers, satisfying love, stable authority, and spiritual reality. You'll learn: how to identify and affirm your children's strengths, how to look beyond you children's deeds to meet their needs, and how to raise children of integrity.",
        "Category": " Religion , Christian Living , Family & Relationships",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Dinner at the Authentic Cafe",
        "Authors": "By Hayot, Roger and Linderman, Sheila",
        "Description": "Roger Hayot's Authentic Cafe in Los Angeles is a restaurant with a rep. There's a line out the door to get at Hayot's chile-fueled, far-flung cooking. (He dips into the cuisines of the American Southwest, Latin America, Asia, and the Mediterranean for inspiration.) Hayot has forged a style out of blending wildly different ingredients and influences. But the exotic appeal of his cooking is balanced by its hominess. At the Authentic Cafe, there are no difficult techniques. Whatever its origins, Hayot's food is always comforting. In fact, some of his dishes are family recipes, from his Moroccan grandmother's kitchen.Dinner at the Authentic Cafe brings home more than 130 of the recipes that have made the little restaurant a whopping success. In recipe introductions, special features, and a glossary, Hayot explains the uses and availability of his ethnic ingredients, dishes, and utensils, and he includes a source list for special ingredients, too. The book is illustrated throughout with the author's own photographs taken in his wide-ranging travels, in L.A.'s ethnic neighborhoods, and at his restaurant. Dinner at the Authentic Cafe takes you to the sources of a chef's fusion style.",
        "Category": " Cooking , General",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "A Piece of My Heart",
        "Authors": "By Ford, Richard",
        "Description": "Ford's mesmerizing first novel is the story of two godless pilgrims. Robard Hewes has driven across the country in the service of a destructive passion. Sam Newell is seeking the missing piece of himself. When these men converge, on an uncharted island in the Mississippi, each discovers the thing he's looking for--amid a conflagration of violence that's as shocking as it is inevitable.\"This is one of those books that hit you hard...a story filled with breathing characters and genius-crafted dialogue between moments of consummate description.... I can't be unbiased. I'm mad for this book.\"--Elizabeth Ashton, Houston Chronicle",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "God of My Father: A Son's Reflections on His Father's Walk of Faith",
        "Authors": "By Crabb, Lawrence J.",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Gardens of Plenty (Little Bed & Breakfast Cookbook Series)",
        "Authors": "By Greco, Gail and Bagley, Tom",
        "Description": "This culinary celebration of herbs and vegetables contains fresh delightslike Windowsill Corn Muffins made in flowerpots and savory Tomato Cobbler. The recipes come from special inns where gardens of plenty abound and mealsinspired by the good, giving earth are placed before guests.",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "If the World Fit'S, You're the Wrong Size (SonPower youth publication)",
        "Authors": "By Sterns, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Scripture Pr Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "Girls from Da Hood",
        "Authors": "By Chunichi, Glenn, Roy, and Turner, Nikki",
        "Description": "Nikki Turner, the Princess of Hip Hop Fiction, took readers by story with her #1 best-selling debut novel, A Hustler’s Wife, then took them to new heights with her sophomore novel, A Project Chick. Now, with the help of her home girl Chunichi, and right hand man Roy Glenn, she’s about to take street fiction to a place it’s never been before, as they introduce Unique, Nina, and Anyeh, three of the baddest girls from the hood you ever want to meet.  For Unique, life is good until her dope-dealing boyfriend, Took, is arrested and winds up in jail. Now she’s broke as a joke; trying to put every petty hustle into play to chase hard times away from the door. With an empty refrigerator, a stack of bills pilling up, a tenth grade education, a big butt and a smile, it doesn’t take long for her to learn to pull the wool over the eyes of any fool who’s blinded by her good looks. She’s sure that one day some guy’s slip-up will be her ultimate come-up, and her days of nickel and dime swindles will be a thing of the past. Unique knows that every scandalous chick has her day, but doesn’t realize that her day will come too! If luck were money, Nina Thomas would be one broke sister. After taking a stab at stripping, she finds herself once again on the wrong end of a bad choice. Now she’s on trial for murder, and the consequences of spending too much time with the wrong folks might just end up costing her life. Anyeh is out for revenge, and with the help of a secret friend on the other end of her cell phone, known only as “my baby,” she just might get what she wants. She’s after Diablo, the most well-known hustler in Virginia. He’s one careful brother; but in the end, his feelings for Anyeh might just be his undoing.",
        "Category": " Fiction , African American , Urban",
        "Publisher": "Urban Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Route 66",
        "Authors": "By Michael Karl Witzel",
        "Description": "",
        "Category": "",
        "Publisher": "Lowe & B. Hould",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The New Kitchen Garden",
        "Authors": "By Pavord, Anna",
        "Description": "Through a series of specially created planting designs, discover exciting possibilities for incorporating vegetables, fruits, and herbs into every conceivable space. There are designs for traditional kitchen gardens, ideas for informal fruit gardens, and innovative plans for small yards and balconies. Each design is fully illustrated with inspiring color photographs, and the stylish plans can be used as a template or adapted to suit your needs.Learn how to assess site and soil, decide what to grow, draw up a layout, and construct paths and beds. Step-by-step photographs demystify all aspects of routine care and cultivation, while troubleshooting advice on pests and diseases helps protect the fruits of your labor. The at-a-glance guide to growing more than 100 vegetables, fruits, and herbs includes easy-reference charts indicating sowing and harvesting times. A selection of the author's favorite recipes will help you make the most of your harvest.",
        "Category": " Reference , General",
        "Publisher": "DK Publishing, Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Madhur Jaffrey's Far Eastern Cookery",
        "Authors": "By Jaffrey, Madhur",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Parts",
        "Authors": "By Arnold, Tedd",
        "Description": "I just don't know what's going onOr why it has to beBut every day it's something worseWhat's happening to me?So begins this uproarious new story from the best-selling creator of No Jumping on the Bed!,Green Wilma, and other popular books. The young narrator has discovered a disturbing trend: There's fuzz in his belly button his toes are peeling and something just fell out of his nose. The last straw is a loose tooth, which convinces him of the awful truth his parts are coming unglued!Parts deals with a subject of deepest interest to every young child: the stuff our bodies shed. Parents will appreciate the reassuring message that it's all quite normal, while Tedd Arnold's comical illustrations and rhyming text are guaranteed to make young readers laugh their heads off.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Dial Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Human Body Thematic Unit (Thematic Units)",
        "Authors": "By Jeffries, David",
        "Description": "",
        "Category": " Juvenile Nonfiction , Science & Nature , Anatomy & Physiology",
        "Publisher": "Teacher Created Resources",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Absolutely Amazing Ways to Save Money on Everything",
        "Authors": "By Paris, James L.",
        "Description": "",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Namesake: A Novel",
        "Authors": "By Lahiri, Jhumpa",
        "Description": "Jhumpa Lahiri's debut story collection, Interpreter of Maladies, took the literary world by storm when it won the Pulitzer Prize in 2000. Fans who flocked to her stories will be captivated by her best-selling first novel, now in paperback for the first time. The Namesake is a finely wrought, deeply moving family drama that illuminates this acclaimed author's signature themes: the immigrant experience, the clash of cultures, the tangled ties between generations.The Namesake takes the Ganguli family from their tradition-bound life in Calcutta through their fraught transformation into Americans. On the heels of an arranged wedding, Ashoke and Ashima Ganguli settle in Cambridge, Massachusetts, where Ashoke does his best to adapt while his wife pines for home. When their son, Gogol, is born, the task of naming him betrays their hope of respecting old ways in a new world. And we watch as Gogol stumbles along the first-generation path, strewn with conflicting loyalties, comic detours, and wrenching love affairs.With empathy and penetrating insight, Lahiri explores the expectations bestowed on us by our parents and the means by which we come to define who we are.",
        "Category": " Fiction , Literary",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Love Comes Softly",
        "Authors": "By Oke, Janette",
        "Description": "Love Comes Softly introduced the characters of Marty and Clark Davis, whose tragic circumstances brought them to a \"marriage of convenience\" on the frontier prairies during the mid 1800s. The story of how Clark's patient, caring love mirrored that of the heavenly Father, drawing Marty to faith and to love, has captured the hearts and imaginations of over one million readers on Book One alone!",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Imperial Grunts: The American Military on the Ground",
        "Authors": "By Kaplan, Robert D.",
        "Description": "In this landmark book, Robert D. Kaplan, veteran correspondent for The Atlantic Monthly and author of Balkan Ghosts, shows how American imperialism and the Global War on Terrorism are implemented on the ground, mission by mission, in the most exotic landscapes around the world. Given unprecedented access, Kaplan takes us from the jungles of the southern Philippines to the glacial dust bowls of Mongolia, from the forts of Afghanistan to the forests of South America–not to mention Iraq–to show us Army Special Forces, Marines, and other uniformed Americans carrying out the many facets of U.S. foreign policy: negotiating with tribal factions, storming terrorist redoubts, performing humanitarian missions and training foreign soldiers. In Imperial Grunts, Kaplan provides an unforgettable insider’s account not only of our current involvement in world affairs, but also of where America, including the culture of its officers and enlisted men, is headed. This is the rare book that has the potential to change the way readers view the men and women of the military, war, and the global reach of American imperialism today.As Kaplan writes, the only way to understand America’s military is “on foot, or in a Humvee, with the troops themselves, for even as elites in New York and Washington debated imperialism in grand, historical terms, individual marines, soldiers, airmen, and sailors–all the cultural repositories of America’s unique experience with freedom–were interpreting policy on their own, on the ground, in dozens upon dozens of countries every week, oblivious to such faraway discussions. . . . It was their stories I wanted to tell: from the ground up, at the point of contact.”Never before has America’s overarching military strategy been parsed so incisively and evocatively. Kaplan introduces us to lone American servicemen whose presence in obscure countries is largely unknown, and concludes with a heart-stopping portrait of marines in the first battle in Fallujah. Extraordinary in its scope, beautifully written, Imperial Grunts, the first of two volumes, combines first-rate reporting with the sensitivity and insights of an acclaimed writer steeped in history, literature, and philosophy, to deliver a masterly account of America’s global role in the twenty-first century. • Imperial Grunts paints a vivid picture of how defense policy is implemented at the grassroots level.• Kaplan travels throughout the world where U.S. forces are located. This is not just a book about Iraq or Afghanistan. • Rather than debate imperialism, Kaplan relies on a keen understanding of history, philosophy, and in-the-field reporting to show how it actually works on the ground.• Imperial Grunts escapes Washington and shows us what it’s like to live with the grunts day to day.Praise for Imperial Grunts“One of the most important books of the last several years. Robert Kaplan uses his prodigious energy and matchless reporting skills to takes us on to the front lines with the new warrior-diplomats who use weapons, imagination, and personal passion to protect and advance the interests of the United States. This is a generation every American should come to know.”–Tom Brokaw“Robert Kaplan has brilliantly captured the story of today’s U.S. military operating in far-flung places on strange missions. Imperial Grunts is the most insightful and superbly written account of soldiering in the New World Disorder to date. It is a must read for all Americans.”–General Anthony C. Zinni, United States Marine Corps (Ret.)“Kaplan infuses us with a sense of hope about the future. Through astonishing observations, truths, and stories, Imperial Grunts introduces a brand-new way of thinking about the enduring virtue of the American spirit.”–George Crile, author of Charlie Wilson’s War“No recent book so well or so vividly portrays the challenges of the modern United States military. With an impressive grasp of the complexities of military missions worldwide, Robert Kaplan exposes the reader to the world of the modern soldier, sailor, airman, and Marine. A must read for both civilian and military leaders.”–General Barry R. McCaffrey, United States Army (Ret.), Bradley Distinguished Professor of International Security Studies, United States Military Academy“Imperial Grunts is vintage Robert Kaplan, combining a deep appreciation of history and wonderfully vivid writing with an infectious wanderlust.”–Max Boot, Senior Fellow, National Security Studies, the Council on Foreign Relations, author of The Savage Wars of Peace“Splendid! This is the finest work in print about today’s American fighting men and the challenges they face around the globe. Kaplan’s courage in researching this book under combat conditions is complemented by his integrity and great literary skill. Imperial Grunts simply could not be better.”–Ralph Peters, author of Beyond Baghdad",
        "Category": " History , Military , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Power, Faith, and Fantasy: America in the Middle East, 1776 to the Present",
        "Authors": "By Oren, Michael B.",
        "Description": "Beset by privateers and bereft of protection by the British navy, the newly founded USA had a pressing interest in diplomacy with Algeria and other havens for pirates. Slightly later the new nation, its self-confidence greatly grown, provided a steady stream of Orientalists and missionaries seeking documents, relics, and souls to save. Oren (history, Shalem Center) points out that American involvement in the Middle East started at the moment there was an America. He details the various people who sought to explore the Middle East, exploit it, explain it to the folks back home, make it into America's image, and save it from itself. He explains the rampant fantasies about the Holy Land, the piety mixed freely with imperialism, the movements founded in America that helped to shape the destiny of Israel, and the fact that oil is a relatively new element. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Norton, 2007",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Fires of Jubilee (Aladdin Historical Fiction)",
        "Authors": "By Hart, Alison",
        "Description": "ABBY IS FREE FROM SLAVERY BUT NOT FROM THE SECRETS OF HER PAST...  It's 1865 in the conquered South and things are not as they were before the war. Thirteen-year-old Abby Joyner still lives on the plantation where she was raised but she and her grandparents are free now and continue on for a small salary.  One thing is the same as it has always been, though -- Abby does not know what became of her mother. Why won't anyone tell her? Abby is determined to find the truth behind her disappearance. But answers are few and she is about to discover that, like freedom, the truth is harder to come by than she could have imagined.",
        "Category": " Juvenile Fiction , Historical , United States , 19th Century",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Tell-a-Tale Book-Daffy Duck Space Creature",
        "Authors": "By Ingoglia, Gina",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Hope for Each Day: Words of Wisdom and Faith",
        "Authors": "By Graham, Billy",
        "Description": "In keeping with the spirit of Max Lucado's Grace for the Moment, Charles Swindoll's Wisdom for the Way, and John MacArthur's Truth for Today comes the latest edition into the Daily Inspirations series. In Hope for Each Day, Billy Graham offers spiritual comfort to guide us through our daily lives. Rev. Graham is a national treasure and has counseled numerous political leaders and provided comfort in times of public crisis.",
        "Category": " Religion , Devotional",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Life Lessons with Max Lucado: Book Of Acts",
        "Authors": "By Lucado, Max",
        "Description": "Twelve lessons explore how the same men who doubted in Galilee, argued in Capernaum, and ran for their lives in Gethsemane are transformed by the resurrected King in the book of Acts. With scripture reading, inspirational readings, questions to answer, space for journaling, and a prayer, it's like studying the Bible with Max Lucado.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Nelson Reference & Electronic Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Slip & Fall",
        "Authors": "By Santora, Nick",
        "Description": "",
        "Category": "",
        "Publisher": "State Street Press",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Greatest Story Ever Sold: The Decline and Fall of Truth from 9/11 to Katrina",
        "Authors": "By Rich, Frank",
        "Description": "When America was attacked on 9/11, its citizens almost unanimously rallied behind its new, untested president as he went to war. What they didn't know at the time was that the Bush administration's highest priority was not to vanquish Al Qaeda but to consolidate its own power at any cost. It was a mission that could be accomplished only by a propaganda presidency in which reality was steadily replaced by a scenario of the White House's own invention—and such was that scenario's devious brilliance that it fashioned a second war against an enemy that did not attack America on 9/11, intimidated the Democrats into incoherence and impotence, and turned a presidential election into an irrelevant referendum on macho imagery and same-sex marriage.   As only he can, acclaimed New York Times columnist Frank Rich delivers a step-by-step chronicle of how skillfully the White House built its house of cards and how the institutions that should have exposed these fictions, the mainstream news media, were too often left powerless by the administration's relentless attack machine, their own post-9/11 timidity, and an unending parade of self-inflicted scandals (typified by those at The New York Times). Demonstrating the candor and conviction that have made him one of our most trusted and incisive public voices, Rich brilliantly and meticulously illuminates the White House's disturbing love affair with \"truthiness,\" and the ways in which a bungled war, a seemingly obscure Washington leak, and a devastating hurricane at long last revealed the man-behind-the-curtain and the story that had so effectively been sold to the nation, as god-given patriotic fact.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Penguin Press HC, The",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "When Night Falls",
        "Authors": "By London, Cait",
        "Description": "If you're seeking sensuous, compelling and emotional romance and suspense then you won't want to miss this latest romance from one of Avon's most popular contemporary storytellers. Mitchell Warren has retrned to Madrid, Oklahoma––a town he'd once left, vowing never to return to. But, never say never. In his youth, he was known as wild and sexy...now, he's still very sexy. Uma Thornton has never left Madrid, though her syndicated newspaper column, \"The Smooth Moves List\" has been turned into a popular self–help book. She never expected to see Mitchell again, so when he returns all the old feelings she'd once held for him come flooding back. But not all is quiet in Madrid. For one thing, a series of mysterious events seem to occur around Mitchell––is he to blame for the trouble that seems to have come to town with him? And when Uma and Mitchell's childhood friend is mysteriously killed, they both realize that the circle of danger that seems to surround them is becoming tighter.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Carriers",
        "Authors": "By Lynch, Patrick",
        "Description": "A team of American biological warfare experts in Indonesia faces an airborne virus one hundred times more virulent than the Ebola, in a thriller soon to be a CBS television movie. By the author of Omega. Reissue.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    }
]