[
    {
        "Title": "Friendship Cake: A Novel",
        "Authors": "By Hinton, Lynne",
        "Description": "“I would welcome a friendship with Lynne Hinton. I would welcome an invitation to sit down at her table, but mostly I would welcome her next book.”—Maya Angelou Lynne Hinton’s beloved bestselling classic, Friendship Cake, is a beautiful, poignant, and funny novel of five small-town women friends that offers inspiring life lessons in faith, love, strength, survival, and community—as well as a host of delicious Southern recipes! A heartwarming delight reminiscent of Jan Karon’s New York Times bestselling Mitford books, Friendship Cake, in the words of Rita Mae Brown (Rubyfruit Jungle), “will give you plenty to chew over. Delicious!”",
        "Category": " Fiction , Christian , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Do-Gooders: How Liberals Hurt Those They Claim to Help (and the Rest of Us)",
        "Authors": "By Charen, Mona",
        "Description": "A leading conservative writer and the author of Useful Idiots focuses on some of today's most hotly debated domestic issues, arguing against liberal party practices in such areas as education, affirmative action, and welfare. 125,000 first printing.",
        "Category": " Political Science , Public Policy , Social Policy",
        "Publisher": "Sentinel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Who Killed Jesus?: Exposing the Roots of Anti-Semitism in the Gospel Story of the Death of Jesus",
        "Authors": "By Crossan, John Dominic",
        "Description": "The death of Jesus is one of the most hotly debated questions in Christianity today. In his massive and highly publicized The Death of the Messiah, Raymond Brown -- while clearly rejecting anti-Semitism -- never questions the essential historicity of the passion stories. Yet it is these stories, in which the Jews decide Jesus&#39; execution, that have fueled centuries of Christian anti-Semitism.  Now, in his most controversial book, John Dominic Crossan shows that this traditional understanding of the Gospels as historical fact is not only wrong but dangerous. Drawing on the best of biblical, anthropological, sociological and historical research, he demonstrates definitively that it was the Roman government that tried and executed Jesus as a social agitator. Crossan also candidly addresses such key theological questions as \"Did Jesus die for our sins?\" and \"Is our faith in vain if there was no bodily resurrection?\"  Ultimately, however, Crossan&#39;s radical reexamination shows that the belief that the Jews killed Jesus is an early Christian myth (directed against rival Jewish groups) that must be eradicated from authentic Christian faith.",
        "Category": " Religion , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Losing America: Confronting a Reckless and Arrogant Presidency",
        "Authors": "By Byrd, Robert C.",
        "Description": "In the months and years following September 11, Senator Robert C. Byrd viewed with dismay what he considers a \"slow unraveling of the people's liberties,\" a time when dissenting voices were stilled and awesome power swung suddenly to the president to fight a \"war on terror.\"The way down this path violates historic American principles. It provides no regard for the balance of powers or the role of the Congress; it invades our privacy; it makes no attempt to educate the public and build consensus. It displays little regard for the environment. It grapples little with the realities of people who have to work for a living, rear children or care for aging parents, and cope with physical ailments - problems that plague our country and cry out for attention. Swept along, we have entered a war under a new and dangerous doctrine without proper consideration, and we have rushed dangerous legislation through Congress willy-nilly. We have a White House that favors the rich and the well-connected, lavishes tax cuts on big businesses, and pushes through unfair tax legislation.Most serious, this administration has, in greater measure than ever before, operated under a cloak of secrecy, which is deeply antithetical to the principles of our nation.For far too long, argues Senator Byrd, too many of us have passively gone along, aiding and abetting a dangerous process. Now is the time, he urges, to regain the Constitution that our forefathers so wisely left us, a time to return to the values and processes that made America great.",
        "Category": " Political Science , American Government , National",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Cutting Loose: Why Women Who End Their Marriages Do So Well",
        "Authors": "By Applewhite, Ashton",
        "Description": "One out of every two modern marriages ends in divorce, and 75 percent of those divorces are initiated by wives. Author Ashton Applewhite is one of these women, having sued for divorce after enduring an unfulfilling ten-year marriage.Cutting Loose is a wonderfully appealing book for women who want to leave their marriage but fear the consequences.Shattering the media-generated image of the lonely, deprived and financially strapped divorcee, Applewhite provides a much needed reality check.Cutting Loose introduces 50 women, varying in age, race, class and predicament, who have thrived after initiating their own divorces. Their fears of financial, emotional and romantic ruin were never realized; on the contrary, their lives improved immeasurably, and their self-esteem soared.Cutting Loose also answers the crucial questions: How do you finally decide to make the big break? What is getting divorced really like? What are the shortcomings of the legal process? What about custody and child support? financial and emotional survival? and how does a woman's self-image change during and after divorce?",
        "Category": " Family & Relationships , Divorce & Separation",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "GREAT TIME COMING: The Life Of Jackie Robinson From Baseball to Birmingham",
        "Authors": "By Falkner, David",
        "Description": "David Falkner brings to life Jack Roosevelt Robinson the man, a flesh-and-blood crusader whose humanity, passion, doubts, and fears are too often overlooked in the history-book treatment of his accomplishments. Falkner shows the roots of Robinson's commitment to the cause of his race, the depth of his involvement in that cause, and the occasional missteps along the way that have clouded our understanding of who Robinson was.Falkner recounts the important stories of Robinson's career: the meeting with Branch Rickey where Rickey demands that Robinson hold his temper for his first three years in the Dodgers organization; the near-boycott by the St. Louis Cardinals and other clubs, and the teammates who refused to shake his hand; the important friendship of Pee Wee Reese; the bold fury with which he played the game. But Falkner also gives new and groundbreaking attention to Robinson's post-baseball life, his role - actual, not symbolic - in the civil rights movement, and his often-misunderstood efforts to build for his community a lasting piece of the action.",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Rough Magic: Bill Walsh's Return to Stanford Football",
        "Authors": "By Cohn, Lowell",
        "Description": "Here is an exhilarating chronicle of the Stanford University football team's spectacular 1992 seasons and an incisive portrait of Bill Walsh, their idiosyncratic, ingenious coach, whom George Schulz has called \"a great intellect.\" Not since A Season on The Brink has there been such a revealing study of a great team and a great coach in action.When Walsh returned to Stanford in 1992 to coach its team, the Cardinal, he surprised many, including himself, by turning his back on a realm - professional sports - that he had conquered. During the fourteen years since he had last coached at Stanford, he had amassed a record and a reputation few men of his era could equal, having led the San Francisco 49ers to three Super Bowl wins and six divisional titles. The nickname \"Genius\" had been bestowed on him, and most in the sports community and beyond would use it without reservation. Even those few who added a dash of sarcasm when they used the moniker could not deny Walsh's brilliance.What drew Walsh back to Stanford (in what Time magazine called his \"Second Coming\") was its embodiment of the scholar-athlete ideal so rarely glimpsed today in the high-stakes world of college sports. What that idea meant for Walsh in real terms was a decent team, hampered by its school's high admission standards, surrounded by the toughest teams in the sport. What Walsh and his scholar-athletes did in his first year back astonished many. They achieved their first ten-win season since 1940, earned their first top ten ranking in over twenty years, and won their first bowl game since the Carter administration.Throughout that remarkable season, Lowell Cohn had unlimited access to Walsh, his coaches, and his players during every game, practice, scrimmage, and team meeting. The result of his immersion in the Cardinal's triumphant 1992 season is an account of singular intensity, depth, and eloquence. Certainly there is victory's thrill and defeat's agony here, but there is more besides: a trenchant depiction of a man driven by relentless intellectual energy and chased by perpetual self-doubt; a galvanizing story of how a disparate, squabbling collection of young men became united by success and by near tragedy; and indisputable proof that, at its best, football is as much an intellectual challenge as it is a physical one.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Country Cooking (Pillsbury Home Cooking Library)",
        "Authors": "By Elaine Christiansen",
        "Description": "",
        "Category": "",
        "Publisher": "Ottenheimer Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Washington: City of Scandals : Investigating Congress and Other Big Spenders",
        "Authors": "By Lambro, Donald",
        "Description": "Evaluates the Reagan Administrations efforts to reduce government waste, looks at what happens to government whistle-blowers, and describes wasteful government programs",
        "Category": "",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Wait Till Next Year: A Memoir",
        "Authors": "By Goodwin, Doris Kearns",
        "Description": "Wait Till Next Yearis the story of a young girl growing up in the suburbs of New York in the 1950s, when owning a single-family home on a tree-lined street meant the realization of dreams, when everyone knew everyone else on the block, and the children gathered in the streets to play from sunup to sundown. The neighborhood was equally divided among Dodger, Giant, and Yankee fans, and the corner stores were the scenes of fierce and affectionate rivalries.  We meet the people who influenced Goodwin's early life: her father, who emerged from a traumatic childhood without a trace of self-pity or rancor and who taught his daughter early on that she should say whatever she thought and should bring her voice into any conversation at any time; her mother, whose heart problems left her with the arteries of a seventy-year-old when she was only in her thirties and whose love of books allowed her to break the boundaries of the narrow world to which she was confined by her chronic illness; her two older sisters; her friends on the block; the local storekeepers; her school friends and teachers. This is also the story of a girlhood in which the great religious festivals of the Catholic church and the seasonal imperatives of baseball combined to produce a passionate love of history, ceremony, and ritual. It is the story of growing up in what seemed on the surface a more innocent era until one recalls the terror of polio, the paranoia of McCarthyism reflected even in the children's games, the obsession with A-bomb drills in school, and the ugly face of racial prejudice. It was a time whose relative tranquillity contained the seeds of the turbulent decade of the sixties.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Spectacles (Goblin Tales)",
        "Authors": "By Beattie, Ann and Pels, Winslow (ILT)",
        "Description": "When Alison puts on Great Grandmother's glasses, they become magical and enable her to understand some of her great grandmother's frustrations and unfulfilled aspirations.",
        "Category": " Juvenile Fiction , Family , Multigenerational",
        "Publisher": "Workman Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Dinner in Minutes (Pillsbury Home Cooking Library, Dinner in Minutes)",
        "Authors": "By Elaine Christiansen, Jackie Sheehan",
        "Description": "",
        "Category": "",
        "Publisher": "Ottenheimer Publishers Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Out of Darkness into the Light: A Journey of Inner Healing",
        "Authors": "By Jampolsky, Gerald G.",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Leap of Faith (Blaine Stewart Mystery)",
        "Authors": "By Zukowski, Sharon",
        "Description": "Being a private eye in New York City means you never know what kind of case is going to walk in the door. For Blaine Stewart, that's half the fun. But how is she supposed to find a baby that hasn't been born yet, especially when it's the mother who's asking her to look?It's like this, explains socialite Judith Marsden. She has paid Hannah Wyrick, a surrogate mother, a handsome sum to carry her test-tube baby. But now, two months before the delivery date, Hannah has disappeared and Marsden wants her son - the heir to 29 million bucks - back. The name Wyrick makes Blaine stand up and take note. After all, Nikki Wyrick is her housekeeper.That bizarre coincidence leads Blaine straight to the Wyrick family home in New Jersey, where she is stunned to learn that both the Wyrick girls died eight years before. So who is Hannah Wyrick? Who's that woman dusting Blaine's apartment? And who has just decided that Judith Marsden is best dead?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Thunder",
        "Authors": "By Grady, James",
        "Description": "Yesterday John Lang was a young CIA street dog fighting his country's invisible wars in the bloody back alleys around the world. Today he strolls the marble corridors of Washington as the agency's liaison to the U.S. Senate. Violence was supposed to be in his past. Then a bomb guts a New York skyscraper and an \"officially\" stray bullet kills Lang's partner. Lang must spy once more. This time his target will be the post-Cold War, \"new\" CIA, poised on the razor-edged realities of the 1990s' New World Order.Was his partner murdered and if so why? What secrets link the Senate Intelligence Committee and his late partner? Which loyalties must Lang betray? And how can he discover the truth - let alone avenge his partner's death - without destroying himself? The answers lie under the monuments, the slums, and the freeways in the other Washington, the city of cover-ups and twisted loyalties and cynical power.Here death can come silently, unobtrusively, anywhere, any time. Here Lang is branded as a rebel, hunted by a trail of sanctioned agents, and trapped between two women he can't trust who both claim a piece of his heart. Here he must race toward survival and redemption...and a revelation as shocking as any in suspense fiction.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Normandie Triangle",
        "Authors": "By Scott, Justin",
        "Description": "When a Nazi saboteur engineers the sinking of the superliner \"Normandie\" just before World War II, naval architect Steven Gates investigates the ruins and penetrates the agent's insidious plans for even greater destruction",
        "Category": " Fiction , General",
        "Publisher": "Arbor House Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "Dr. Burns' Prescription for Happiness",
        "Authors": "By Burns, George",
        "Description": "The renowned actor-comedian offers personal observations, stories, anecdotes, and advice about dealing with life's ups and downs and increasing one's happiness and well-being through good will and laughter",
        "Category": " Humor , General",
        "Publisher": "Putnam Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Precision bridge for everyone",
        "Authors": "By Goren, Charles Henry",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Salt: The Brand Name Guide to Sodium Content",
        "Authors": "By Jacobson, Michael",
        "Description": "Offers advice on reducing the intake of salt and lists the amounts of sodium in a wide range of prepared foods",
        "Category": "",
        "Publisher": "Workman Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Cutting Gardens (Burpee American Gardening Series)",
        "Authors": "By Davis, Chet",
        "Description": "Details how to create a formal cutting garden, as well as how to integrate flowers suitable for cutting into existing garden plans, describes more than ninety species ideal for cutting, and provides suggestions for designing stunning arrangements. Original.",
        "Category": " Gardening , General",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Plains Song (The Penguin contemporary fiction series)",
        "Authors": "By Morris, Wright",
        "Description": "Cora, a resolute Midwesterner, stands at the heart of this saga of three generations of the Atkins family and, more particularly, of its women, from the early years of the twentieth century to the 1970s",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "Photographic printing (A Spectrum book)",
        "Authors": "By Hattersley, Ralph",
        "Description": "Explains and illustrates professional darkroom techniques for dodging and burning-in, print bleaching, flashing, double-focus printing, tone-line conversion, masking, and other procedures",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Outdoor Recreation Areas (Home Repair and Improvement)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": "",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Such Bright Hopes",
        "Authors": "By Scragg, Walter R. L.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Review & Herald Pub Assn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "Dave Barry's Gift Guide To End All Gift Guides",
        "Authors": "By Barry, Dave",
        "Description": "Looking for that perfect gift for that special someone? Well, good luck - you won't find it here. But if your gift giving runs toward a can of pork brains, hideous Republican pants, a high-tech loudspeaker hat, or a nose spreader, then Dave Barry's Gift Guide to End All Gift Guides is just the book for you.For four years, Dave Barry and his crack gift-finding team at the Miami Herald have scoured the planet looking for gifts it is better to give than to receive. The best of those items are now available in this catalogue to end all catalogues. Every item must meet Dave's rigid standards: First, each gift had to be something you can actually buy, and second, each one \"had to achieve a level of tastefulness such that the average person could not look at it and eat at the same time.\"Just imagine the oohs and ahs and other sentiments you'll hear expressed when friends and loved ones unwrap such thoughtful gifts as a medically accurate model of one pound of human fat, an IRS Christmas tree ornament, a rubber slug, hideous Republican pants, a head lice coloring book, or a genuine bull scrotum.\"You shouldn't have,\" your friends will say, and how satisfying to know that they really mean it!As always, renowned humor columnist and champion gift-giver Dave Barry is not making this stuff up. You really CAN order these one-of-a kind objects by mail (except for the local elected official, which you can buy in nearly any neighborhood). Vendor names and prices are provided for some fifty gifts, each perfectly wrong for any occasion, any time of year.They say it's the thought that counts, and people sure will wonder what you're thinking when you shower them with gifts from Dave Barry's Gift Guide to End All Gift Guides.",
        "Category": " Humor , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "101 Ways to Bug Your Parents",
        "Authors": "By Wardlaw, Lee",
        "Description": "When Sneeze is pulled out of the Invention Convention by his parents and placed in a summer writing class, he decides to take revenge and so creates a list of schemes and plans to make any parent go mad. Reprint.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "How To Make Big Money In Real Estate, Revised",
        "Authors": "By Hicks, Tyler G.",
        "Description": "An expert in building wealth focuses on the current real estate market as a place to amass a personal fortune, showing how to start with no money and build towards greater equity with each new transaction. Original.",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "As Seen on TV",
        "Authors": "By Mlynowski, Sarah",
        "Description": "Leaving her charmed life in Florida behind to move to Manhattan with her boyfriend and to star in a reality TV show called Party Girls, Sunny Langstein, posing as a single woman of the world, finds herself transformed into a media sensation, forcing her to choose between fame and true love. Original. 75,000 first printing.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Red Dress Ink",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Rosamund",
        "Authors": "By Small, Bertrice",
        "Description": "From Bertrice Small, the beloved \"queen of romance,\" (Publishers Weekly) comes a sweeping new novel of a young girl's unexpected journey into womanhood, into mystery and passion, and into history...  Her name is Rosamund Bolton. She is heiress to the Friarsgate fortune. More than a splendid inheritance, it will chart the fate of the orphaned beauty, widowed at a precious young age. It will take her from the treacherous custody of her devious uncle to the magnificent court of Elizabeth of York, into the confidence of Katherine of Aragon, and past the intimate chamber doors of Henry VIII. It's an adventure that will test the limits of passion and betrayal; it will change the meaning of the word enemy, and turn even the most daring fantasy into true love.  With this first novel in an original and exciting new series, the adventures of Rosamund are just beginning...",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "NAL Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Darwin Awards: Evolution in Action",
        "Authors": "By Northcutt, Wendy and Nothcutt, Wendy",
        "Description": "The hilarious New York Times bestselling phenomenon and the perfect funny gift! The Darwin Awards shares the stories of those human beings who improve the gene pool by removing themselves from it in a sublimely idiotic fashion.Marvel at the thief who tries to steal live electrical wires. Gape at the lawnchair jockey who floats to a height of 16,000 feet suspended by helium balloons. And learn from the man who peers into a gasoline can using a cigarette lighter. All contend for Darwin Awards when their choices culminate in magnificent misadventures.These tales of trial and awe-inspiring error-verified by the author and endorsed by website readers-illustrate the ongoing saga of survival of the fittest in all its selective glory. The Darwin Awards vividly portrays the finest examples of evolution in action, and shows us just how uncommon common sense can be.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Photograph",
        "Authors": "By Lively, Penelope",
        "Description": "Look out for Penelope Lively’s new book, The Purple Swamp Hen and Other Stories.Man Booker Prize–winning novelist Penelope Lively’s latest masterpiece opens with a snapshot: Kath, before her death, at an unknown gathering, holding hands with a man who is not her husband. The photograph is in an envelope marked “DON’T OPEN—DESTROY.” But Kath’s husband does not heed the warning, embarking on a journey of discovery that reveals a tight web of secrets—within marriages, between sisters, and at the heart of an affair. Kath, with her mesmerizing looks and casual ways, moves like a ghost through the memories of everyone who knew her—and a portrait emerges of a woman whose life cannot be understood without plumbing the emotional depths of the people she touched.  Propelled by the author’s signature mastery of narrative and psychology, The Photograph is Lively at her very best, the dazzling climax to all she has written before.",
        "Category": " Fiction , Psychological",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Lake Wobegon Days",
        "Authors": "By Keillor, Garrison",
        "Description": "“Lake Wobegon Days is about the way our beliefs, desires and fears tail off into abstractions--and get renewed from time to time. . . this book, unfolding Mr. Keillor's full design, is a genuine work of American history.”  &#151;The New York Times“A comic anatomy of what is small and ordinary and therefore potentially profound and universal in American life…Keillor’s strength as a writer is to make the ordinary extraordinary.” &#151;Chicago Tribune“Keillor’s laughs come dear, not cheap, emerging from shared virtue and good character, from reassuring us of our neighborliness and strength….His true subject is how daily life is shot with grace. Keillor writes a prose that can be turned to laughter, to tears…to compassion or satire, to a hundred effects. He is a brilliant parodist.” &#151;San Francisco Chronicle",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Exploring the Sea",
        "Authors": "By n/a",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Famous Athletes (Eyes on America)",
        "Authors": "By Goodman, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Famous presidents (Eyes on America)",
        "Authors": "By Koslow, Philip",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Amazing Aircraft: See More Readers Level 2",
        "Authors": "By Simon, Seymour",
        "Description": "Provides an easy-to-read overview of the history of aircraft.",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Surrogate: A Novel",
        "Authors": "By Mackel, Kathryn",
        "Description": "The perfect candidate to carry their child...with the perfect opportunity to destroy their lives.When Kyle Dolan convinces his wife, Bethany, to hire a surrogate for their last surviving embryo, they allow themselves to hope once again. A med school student, Laurel Bergin seems perfect in every way. Problem is--Laurel Bergin is really Sable Lynde.As the pregnancy progresses, Sable's dark secrets surface, and her inner demons spill out into the Dolans' lives. In a terrifying encounter, Sable is injured and lapses into a coma. Now the Dolans face psychological and supernatural forces they never knew existed.Fearing for their sanity, their own lives, and the life of their baby, they confront the surrogate--and the darkness surrounding her--in a heart-stopping climax that will keep you reading late into the night.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Pet Stories: You Don't Have to Walk",
        "Authors": "By Brown, Marc Tolon, Rylant, Cynthia, and Hoff, Syd",
        "Description": "Meet a multiplying family of fish, and a cat whose every good intention goes wrong! Includes five stories and two poems, featuring Marc Brown, Cynthia Rylant, Syd Hoff, Jack Prelutsky, Lee Bennett Hopkins, Henry Cole, Sucie Stevenson, and more.",
        "Category": " Juvenile Fiction , Animals , Pets",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Friends Everywhere (1) (Angelwings)",
        "Authors": "By Napoli, Donna Jo and Klementz-Harte, Lauren (ILT)",
        "Description": "Every time a bell rings, an angel gets his wings.  The Little Angel of Friendship is the most popular angel around. He's pretty sure it won't take much for him to earn a few more feathers and get his flying wings. But there's a tough task ahead of him. He has to help a girl named Patricia make new friends.  There's nothing wrong with Patricia. It's just that she has a different way of talking than most children. Plus, she's just moved to a new town. The girl down the hall wants nothing to do with her -- she thinks Patricia is a baby. If Patricia doesn't speak up soon, there'll be one unhappy Little Angel of Friendship -- he needs those wings to fly!  Have you made a friend today?",
        "Category": " Juvenile Fiction , Love & Romance",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Big Five-Oh!: Facing, Fearing, And Fighting Fifty",
        "Authors": "By Geist, Bill",
        "Description": "Bill Geist's hilarious book describes his personal struggle with the awful aging process and with the monumental milestone called the Big Five-Oh. From the trauma of receiving an application to join the AARP to the realization that he can't really see the menu, hear the waiter, or remember the specials, Geist catalogs the discontents, large and small, of those approaching and passing fifty. He lies about his age, shops for a Harley, buys an Ab-Roller, receives liposuction counseling, finds himself the oldest guy at a rock concert, catches himself paying attention to a Depends commercial, buys \"relaxed fit\" jeans, falls asleep at a party, wakes up from a nightmare about college tuition, and damn near buys a Cadillac!",
        "Category": " Humor , General",
        "Publisher": "Quill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Hazards of Sleeping Alone",
        "Authors": "By Juska, Elise",
        "Description": "With her free-spirited daughter away at college and her \"hip\" ex-husband living across the country, Charlotte has grown used to being alone. For the most part, she prefers it. She relies on familiar routines: manicures, grocery shopping, game shows. But at night, no matter how hard she tries (and in spite of the Dream Machine her daughter Emily sent her) she can't stop her logical mind from running wild -- imagining burglars, strange noises, and all manner of trouble that might befall her fearless daughter.  Having just graduated from Wesleyan with a pierced tongue and an arsenal of opinions, Emily has always been passionate about her beliefs -- from mindfulness to vegetarianism to her new live-in boyfriend. Though Charlotte rarely understands her, she's learned to keep her doubts to herself. But when Emily and the new boyfriend arrive for a weekend visit, secrets are revealed that compel Charlotte to take a stand. Forced to examine her own life choices, she's about to learn she can't control everything. What she can do is open her heart to new possibilities, and to the fact that headstrong Emily might have a thing or two to teach them all.",
        "Category": " Fiction , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "What is Mathematical Logic? (Dover Books on Mathematics)",
        "Authors": "By Crossley, John N, Ash, C. J., Brickhill, C. J., Stillwell, John C. H., and Williams, N. H.",
        "Description": "Although mathematical logic can be a formidably abstruse topic, even for mathematicians, this concise book presents the subject in a lively and approachable fashion. It deals with the very important ideas in modern mathematical logic without the detailed mathematical work required of those with a professional interest in logic.The book begins with a historical survey of the development of mathematical logic from two parallel streams: formal deduction, which originated with Aristotle, Euclid, and others; and mathematical analysis, which dates back to Archimedes in the same era. The streams began to converge in the seventeenth century with the invention of the calculus, which ultimately brought mathematics and logic together. The authors then briefly indicate how such relatively modern concepts as set theory, Gödel's incompleteness theorems, the continuum hypothesis, the Löwenheim-Skolem theorem, and other ideas influenced mathematical logic. The ideas are set forth simply and clearly in a pleasant style, and despite the book's relative brevity, there is much covered on these pages. Nonmathematicians can read the book as a general survey; students of the subject will find it a stimulating introduction. Readers will also find suggestions for further reading in this lively and exciting area of modern mathematics.",
        "Category": " Mathematics , Logic",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Silas Marner: The Weaver of Raveloe (Modern Library Classics)",
        "Authors": "By Eliot, George",
        "Description": "Eliot's penetrating portrayal of a miser who learns to love an orphaned and abandoned child, this novel is a cherished masterwork and a moving story of redemption by the one of the Victorian era's most accomplished novelists.",
        "Category": " Fiction , Classics",
        "Publisher": "Modern Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Modern Chinese: A Second Course",
        "Authors": "By Peking University Faculty",
        "Description": "Second volume (Lessons 31–72) of widely respected course in modern (Mandarin) Chinese. Basic sentence patterns, word order, complementary particles, etc. Pin Yin transcription. Includes review of basic grammar, complete glossary, other aids.",
        "Category": " Foreign Language Study , Chinese",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "The Boy Who Saved Baseball",
        "Authors": "By Ritter, John H.",
        "Description": "Tom Gallagher finds himself in a tight spot. The fate of Dillontown rests on the outcome of one baseball game, winner take all. And it's all because Tom had to open his big mouth. If only he could get Dante Del Gato-the greatest hitter to ever play the game-to coach the team. But crazy ol' Del Gato hasn't spoken to folks in years, not after walking away from the game in disgrace just before his team played in its first World Series. Maybe Tom has one more hope: Cruz de la Cruz, the mysterious boy who just rode into town on horseback claiming to know the secret of hitting. Not to mention the secrets of Del Gato . . .",
        "Category": " Juvenile Fiction , Sports & Recreation , Baseball & Softball",
        "Publisher": "Philomel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Double Helix",
        "Authors": "By Werlin, Nancy",
        "Description": "Aware that his father is unhappy with him taking the job with Dr. Wyatt at Wyatt Transgenics, Eli takes on his new work with enthusiasm until he begins to uncover the connection between his employer, his family, and his mother's Huntington's disease.",
        "Category": " Young Adult Fiction , Mysteries & Detective Stories",
        "Publisher": "Dial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Utilitarianism",
        "Authors": "By Mill, John Stuart",
        "Description": "",
        "Category": " Philosophy , History & Surveys , General",
        "Publisher": "Hackett Pub Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "Out of My Mind: The Discovery of Saunders-Vixen",
        "Authors": "By Bach, Richard",
        "Description": "One of our best-loved writers, author of the phenomenal bestsellers The Bridge Across Forever, One, Running from Safety, and Jonathan Livingston Seagull, returns with a brilliantly conceived narrative about the nature of creativity.Bach's journey begins as he puzzles over design modifications for his airplane, a Piper Cub. Perfect designs--simple and practical--seem to come to him out of the blue. But one day when a design appears, along with a fleeting glimpse of an intriguing woman, Bach sets out to discover the source of the visions. The journey leads to a startling destination: a parallel universe where a British airplane manufacturer--Saunders-Vixen Aircraft Company Ltd.--makes superb biplanes and solves problems for perplexed aviators. There Bach meets Derek Hawthorne, his guide through Saunders-Vixen and the new world whose possibilities are just unfolding. There Bach also meets his muse, an unforgettable young aircraft designer named Laura Bristol, who teaches Bach the beauty of simplicity and practicality.",
        "Category": " Fiction , Visionary & Metaphysical",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Cottage",
        "Authors": "By Steel, Danielle",
        "Description": "In her fifty-fourth bestselling novel, Danielle Steel weaves a compelling story of fame and friendship, charmed lives and private struggles...and of three very different men whose lives converge and collide at The Cottage.On a sunny day in Hollywood, a gleaming Rolls-Royce convertible pulls through the gates of the magnificent estate known as The Cottage. Modeled after the “cottages” of Newport, Rhode Island, the spacious, elegant property, sitting on fourteen acres of lush Bel Air, fits its owner to a T. For the man behind the wheel of the Rolls is Hollywood’s ageless wonder, Cooper Winslow. A star of the silver screen for decades, a man whose allure to women is the stuff of legend, Coop exudes grace, charm, and old-fashioned style. But today Coop Winslow is in for a major surprise. He’s broke. And with no major roles coming his way, Coop is faced with the heartbreaking prospect of selling his beloved home of forty years, or at least renting out the gatehouse and part of the main house. A huge blow to Coop, whose debonair attitude allows him to escape reality much of the time.  His new tenants, Mark Friedman and Jimmy O’Connor, are busy coping with problems of their own. Mark’s wife of sixteen years just walked out, and Jimmy recently lost his own wife to a devastating illness. But everything changes when Mark’s teenage son and daughter move in. Suddenly, The Cottage is transformed, with music blasting from every corner, teenagers on skateboards crashing into vintage cars, and a never-ending parade of young starlets streaming in and out to visit Coop. But amid all the noise and the chaos, something unexpected is happening.  Three men who never would have met are becoming friends...and each man finds himself changing in surprising ways, Coop most of all. Because beneath the dazzle and flash, the impeccably tailored suits and the sheer bravado, is a man trying to keep control of his carefully ordered world–a world that is becoming more and more unpredictable with each passing day. First, a tabloid scandal erupts, threatening Coop’s budding romance with a wealthy debutante. . .A stranger approaches Coop with stunning news....A devastating accident almost claims the life of one of the housemates....And in the midst of it all, The Cottage welcomes a new houseguest with a secret of her own, who will change Coop’s life in unexpected ways.  Because among the people who share his cottage and his life, Coop Winslow–loner, bachelor, movie star–may find the rarest of all opportunities: a chance to build a happiness he could never have dreamed of on his own, and to become the kind of human being he has never been. Against a glittering backdrop of celebrity and glamour, Danielle Steel digs deeper to tell a story of friendship and love, tragedy and second chances...of the choices and unexpected turns of fate that can shape characters and lives.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Whispers and Lies: A Novel",
        "Authors": "By Fielding, Joy",
        "Description": "\"She said her name was Alison Simms.\"  Terry Painter lives a quiet life in picturesque Delray, Florida. Forty, single, and a nurse at a home for the elderly and disabled, she enjoys a solitary existence in the cozy house she inherited from her mother five years ago.  Terry's tranquil life takes a turn, however, when young, vibrant Alison Simms rents the cottage behind her home. Upon their First meeting, Alison blows into Terry's life like a tropical storm, bringing with her friendship and excitement. Together they dine out, shop in the village square, and indulge in luxurious at-home makeovers. Alison even helps Terry charm the handsome son of one of her dear, ailing patients. For Terry, life couldn't be more perfect.  But after the initial euphoric wave has settled, Terry slowly begins to learn more about her wondrous companion. She becomes acquainted with the small but peculiar circle of friends Alison has accumulated since her arrival in Delray and meets her brother, who unwittingly reveals bits and pieces of Alison's closely guarded past. Terry soon finds that the friendship that once brightened her life has now crashed down upon her, leaving her trapped in Alison's mysterious world and the whispers and lies that fuel it.  Diving deeply into the psyches of her most captivating characters to date, Joy Fielding has emerged with a riveting tale that challenges our most basic assumptions regarding love, friendship, and obsession. Filled with the suspense and intimacy readers have grown to love in her previous bestselling novels, Whispers and Lies is an unforgettable drama of one woman's fight to reclaim her life.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Safe Harbour",
        "Authors": "By Steel, Danielle",
        "Description": "In her fifty-ninth bestselling novel, Danielle Steel tells an unforgettable story  of survival...of how two people who lost everything find hope...and of the extraordinary  acts of faith and courage that bring —and keep— families together...  On a windswept  summer day, as the fog rolls across the San Francisco coastline, a solitary figure  walks down the beach, a dog at her side.  At eleven, Pip Mackenzie's young life has  already been touched by tragedy; nine months before, a terrible accident plunged  her mother into inconsolable grief.  But on this chilly July afternoon, Pip meets  someone who fills her sad gray world with color and light.  And in her innocence  and in his kindness, a spark will be kindled, lives will be changed, and a journey  of hope will begin.  From the moment the curly-haired girl walks up to his easel  on the sand, Matt Bowles senses something magical about her.  Pip reminds him of  his own daughter at that age, before a bitter divorce tore his family apart and swept  his children halfway across the world.  With her own mother, Ophélie, retreating  deeper into her grief, Pip spends her summer at the shore the way lonely children  do: watching the glittering waters and rushing clouds, daydreaming and remembering  how things used to be.  That is, until she meets artist Matt Bowles, who offers to  teach the girl to draw—and can't help but notice her beautiful, lonely mother.  At  first, Ophélie is thrown off balance by her daughter's new companion—until she realizes  how much joy he is bringing into their lives, despite the sadness she sees in his  eyes.  As their newfound friend works his subtle magic, mother and daughter slowly  begin to heal, to laugh again, to rediscover what they have lost.  When summer ends,  and Ophélie and Pip must leave the beach for the city, the season of healing continues.   Gathering her newfound strength, Ophélie begins a volunteer job at a city outreach  program, where she works with the homeless, and can no longer ignore the blessings  in her own life.  But as soul-sharing phone calls and autumn beach getaways deepen  Ophélie and Matt's friendship, fate strikes another blow.  Out of the blue, Matt  must confront unfinished business from his past.  Days later, Ophélie is struck by  a stunning betrayal by someone she trusts.  And as these events reverberate in two  already wounded hearts, something extraordinary happens.  Out of the darkness that  has shadowed them both comes an unexpected gift of hope.  With grace and compassion,  Danielle Steel explores the fragile bonds between mothers and daughters, husbands  and wives, family members and lifelong friends.  Her haunting, impassioned novel  takes us across the complex landscape of loss—to the blessings that arise from even  the darkest tragedies.  At once a story of triumph and a moving elegy to those who  suffer and survive, Safe Harbour is perhaps her most powerful and life-affirming  novel to date.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Funny Cide",
        "Authors": "By Jenkins, Sally (EDT)",
        "Description": "In 2003, he became \"the people's horse,\" the unheralded New York-bred gelding who-in a time of war and economic jitters-inspired a nation by knocking off the champions and their multimillionaire owners and sweeping to the brink of the Triple Crown. Trained by a journeyman who had been knocking around racing for more than thirty years, ridden by a hard-luck jockey, and owned by a tiny stable founded by a band of high school buddies from Sackets Harbor, NY (pop: 1,386), who tossed in a few thousand dollars each and decided to follow their dream, Funny Cide became a blue-collar hero with a bit, his story crammed with colorful characters-only one of which happened to be a horse.  Written with Sally Jenkins, coauthor of Lance Armstrong's number-one bestseller It's Not About the Bike, Funny Cide tells the whole story-the parts we know and the parts we never suspected-as it follows the group's emotional ups and downs against overwhelming odds, illness, and even scandal, to capture the imagination of millions. It is a book for the underdog in all of us-a new American classic.",
        "Category": " Sports & Recreation , Horse Racing",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Singing My Him Song",
        "Authors": "By McCourt, Malachy",
        "Description": "\"All of us are scarred, but some go to extremes in the quest for the happy childhood they never had.\"Malachy McCourt -- actor, gadfly, raconteur, and author of the internationally bestselling memoir A Monk Swimming -- grew up amid death, squalor, poverty, and abuse in the lanes of Limerick, Irland. When he came to America as a young man, he brought a gargantuan appetite for what life had to offer -- and an equal drive to forget what it had delivered to him thus far.Alternately amused and aghast, but always fascinated, millions of readers followed McCourt through his twenties as he caroused his way all over the world, becoming a familiar face in movies and television, in New York and Hollywood, and in bars from Paris to Calcutta.In Singing My Him Song, McCourt tells us how he went from living the headlong and heedless life of a world-class drunk to becoming a sober, loving father and grandfather, still happily married after thirty-five years. We meet the woman who stood by his side all those years, watch as they build a family together, and listen as McCourt pursues a career of surprising successes and comic missteps.But while becoming the host of television and radio talk shows, appearing in dozens of movies and plays, and establishing himself as a well-loved regular on Ryan's Hope and One Life to Live, McCourt must also face the wreckage of his past. McCourt fights for the rights of his handicapped stepdaughter, exposing a scandal that still reverberates; helps steer his children away from the path he took; and finally comes to terms with the people and places that sent him careering along his misguided course. Then, just when it's time for the happy ending, he must gather all that he's learned, and the support of everyone he loves, to face and overcome the threat of cancer.Bawdy and funny, naked and moving, told in the same inimitable voice that left readers all over the world wondering what happened next, Malachy McCourt's Singing My Him Song tells as honest and entertaining a story as anyone could hope for.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Storm Shelter: Protecting Your Personal Finances",
        "Authors": "By Blue, Ron",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Art of Breaking Glass: A Thriller",
        "Authors": "By Hall, Matthew",
        "Description": "Meet Bill Kaiser. He's a whiz with computers and electronics. A demolitions expert. A man who'll stop at nothing in his quest for social justice - and private revenge. Is he crazy?Psychiatric nurse Sharon Blautner needs to know. Bill has been picked up by the police and dropped off for evaluation at New York's Bellevue Hospital. They found him in the incinerator room of a luxury apartment building. Naked. With a razor that he'd used to slash himself.Bill displays all the classic symptoms of schizophrenia. Yet he's an extremely sympathetic patient. Intelligent. Cooperative. Caring. So much so that Sharon lets slip a secret from her own troubled past. And inadvertently helps Bill torch his way out of the hospital's high-security lockdown.After that, nothing in Sharon's life will ever be the same. Bill, she realizes, was not really crazy at all. Or at least not in the way she thought. He's a dangerous man. A killer. Yet still, somehow, she can't help liking him. And as Bill begins to carry out a mind-boggling revenge scheme - his grand plan for social justice - Sharon suddenly finds that she's the only one who can stop him.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Living to Tell the Tale",
        "Authors": "By Garcia Marquez, Gabriel and Grossman, Edith (TRN)",
        "Description": "In this long-awaited first volume of a planned trilogy, the most acclaimed and revered living Nobel laureate begins to tell us the story of his life. Like all his work, Living to Tell the Tale is a magnificent piece of writing. It spans Gabriel García Márquez’s life from his birth in 1927 through the start of his career as a writer to the moment in the 1950s when he proposed to the woman who would become his wife. It has the shape, the quality, and the vividness of a conversation with the reader—a tale of people, places, and events as they occur to him: the colorful stories of his eccentric family members; the great influence of his mother and maternal grandfather; his consuming career in journalism, and the friends and mentors who encouraged him; the myths and mysteries of his beloved Colombia; personal details, undisclosed until now, that would appear later, transmuted and transposed, in his fiction; and, above all, his fervent desire to become a writer. And, as in his fiction, the narrator here is an inspired observer of the physical world, able to make clear the emotions and passions that lie at the heart of a life—in this instance, his own.Living to Tell the Tale is a radiant, powerful, and beguiling memoir that gives us the formation of Gabriel García Márquez as a writer and as a man.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Privilege of Youth: A Teenager's Story of Longing for Acceptance and Friendship",
        "Authors": "By Pelzer, David J.",
        "Description": "The #1 New York Times and #1 internationally bestselling author who is a shining example of what overcoming adversity really means now shares the final stage of his uplifting journey that has touched the lives of millions.  From A Child Called \"It\" to The Lost Boy, from A Man Named Dave to Help Yourself, Dave Pelzer's inspirational books have helped countless others triumph over hardship and misfortune. In The Privilege of Youth, he supplies the missing chapter of his life: as a boy on the threshold of adulthood. With his usual sensitivity and insight, he recounts the relentless taunting he endured from bullies; but he also describes the joys of learning and the thrill of making his first real friends-some of whom he still shares close relationships with today. He writes about the simple pleasures of exploring a neighborhood he was just beginning to get to know while trying to forget the hell waiting for him at home.  From high school to a world beyond the four walls that were his prison for so many years, The Privilege of Youth charts this crucial turning point in Dave Pelzer's life. This brave and compassionate memoir from the man who has journeyed far will inspire a whole new generation of readers. * A Child Called \"It\" has sold more than three million copies. * The Lost Boy has sold more than two million copies. * A Man Named Dave has sold more than 1.5 million copies. * The three books have spent more than ten years combined on The New York Times bestseller list.",
        "Category": " Social Science , Children's Studies",
        "Publisher": "Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Eating Pavlova",
        "Authors": "By Thomas, D. M.",
        "Description": "A grieving Anna Freud, who has devoted her life to fit the needs of her famous father, reads his shocking diaries where his secrets are exposed, is unsure of his motives for writing them, and explores his conscious and unconscious world",
        "Category": " Fiction , General",
        "Publisher": "Carroll & Graf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Joy School",
        "Authors": "By Berg, Elizabeth",
        "Description": "In this exquisite new novel by best-selling writer Elizabeth Berg, a young woman falls in love - and learns how sorrow can lead to an understanding of joy.Katie, the narrator, has relocated to Missouri with her distant, occasionally abusive father, and she feels very much alone: her much-loved mother is dead; her new school is unaccepting of her; and her only friends fall far short of ideal companions. When she accidently falls through the ice while skating, she meets Jimmy. He is handsome, far older than she, and married, but she is entranced. As their relationship unfolds, so too does Katie's awareness of the pain and intensity first love can bring.Beautifully written in Berg's irresistible voice, Joy School portrays the soaring happiness one can feel at real love, the deep despair when it goes unrequited, and the stubbornness of hope that will not let us go. Here also is recognition that love can come in many forms and offer many different things. Joy School illuminates, too, how deep the things that hurt the most can sometimes teach us the lessons that really matter.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "16.43",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Shadow Play: A Novel",
        "Authors": "By Baxter, Charles",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Violence",
        "Authors": "By Bausch, Richard",
        "Description": "Dramatizes how a single act of violence affects a young married couple and shows how they depend on the redeeming force of love to recover from their shock and begin their lives anew",
        "Category": " Fiction , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Anything for Billy",
        "Authors": "By McMurtry, Larry",
        "Description": "Recreates the colorful life of the legendary outlaw Billy the Kid, a gunslinger neither as ferocious nor as purposeful as legend has him to be.",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Time Expired",
        "Authors": "By Dunlap, Susan",
        "Description": "In Berkeley, California - the nation's tenth-most-congested city and home to homicide detective Jill Smith - someone has received one parking ticket too many. An anonymous campaign of pranks has been launched in an effort to humiliate Elgin Tiress, the city's pitiless and widely disliked Parking Enforcement Director. Meter maids throughout the city are furious; citizens, naturally, are delighted. Only the police see the danger inherent in these escalating attacks.Jill sets out to track down the perpetrator, knowing all too well the sometimes deadly consequences of practical jokes. She learns of a possible witness to one of the pranks - Madeleine Riordan, a much-feared local attorney now dying of cancer at the Canyonview nursing home. Madeleine may have seen something - or someone - that will lead to an arrest. She agrees to one brief interview and promises a second. But when Jill returns for her statement, she finds Madeleine dead. Was she set up to find the corpse? Was it a pain-ending suicide or did Madeleine suspect that someone was trying to kill her? Perhaps the utterly principled, seemingly passionless lawyer was planning on having Jill find something else - something that ended Madeleine's plans for good.In her eighth Jill Smith mystery, Susan Dunlap once again displays her characteristic blend of wit, intelligence. and authenticity, and combines it with a sober, disturbing crime that puts her among the top ranks of mystery authors today.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "A Man Named John: The Life of Pope John XXIII",
        "Authors": "By Alden Hatch",
        "Description": "",
        "Category": "",
        "Publisher": "Hawthorn Books",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Duplicate Keys",
        "Authors": "By Smiley, Jane",
        "Description": "A circle of college friends, centered on a suddenly successful rock group recently based in New York, is shocked and haunted when two of them are found dead--murdered in the band's New York apartment",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Hunting Down Saddam: The Inside Story of the Search and Capture",
        "Authors": "By Moore, Robin",
        "Description": "This authoritative and gripping narrative plunges the American public into the real and personal story of the United States forces in Iraq, and their successful maneuvers in capturing one of the most vicious dictators of our time.Hunting Down Saddam contains up-to-the-minute material and provides never-before-heard accounts of the triumphs and frustrations, strategies and attacks, of those who put their lives at risk to track down Saddam Hussein.* The first book to tell the whole story of the pursuit of Saddam, from pre-war to his capture.* Candid accounts straight from the soldiers on the frontline, which have not been sanitized or filtered through the media, the military, or the Pentagon.* Exclusive interviews with key military leaders, including Colonel \"Smokin' Joe\" Anderson, Commanding Officer of the 2nd Brigade, 101st Airborne (Screaming Eagles), who led the attack on Saddam's sons.The capture of Saddam Hussein is the defining event for this generation's military. Action-packed and controversial,Hunting Down Saddam teems with inside information. Robin Moore gets the real story from these fighting men as only he can.Doris Kearns Goodwin calls Hunting Down Saddam, \"A fast and furious read . . . when the historians try to put together the real facts of the two wars the U. S. has fought since September 11, 2001 this book will be a valuable contribution to their research.\"This authoritative and gripping narrative plunges the American public into the real and personal story of the United States forces in Iraq, and their successful maneuvers in capturing one of the most vicious dictators of our time.Hunting Down Saddam contains up-to-the-minute material and provides never-before-heard accounts of the triumphs and frustrations, strategies and attacks, of those who put their lives at risk to track down Saddam Hussein.* The first book to tell the whole story of the pursuit of Saddam, from pre-war to his capture.* Candid accounts straight from the soldiers on the frontline, which have not been sanitized or filtered through the media, the military, or the Pentagon.* Exclusive interviews with key military leaders, including Colonel \"Smokin' Joe\" Anderson, Commanding Officer of the 2nd Brigade, 101st Airborne (Screaming Eagles), who led the attack on Saddam's sons.The capture of Saddam Hussein is the defining event for this generation's military. Action-packed and controversial,Hunting Down Saddam teems with inside information. Robin Moore gets the real story from these fighting men as only he can.Doris Kearns Goodwin calls Hunting Down Saddam, \"A fast and furious read . . . when the historians try to put together the real facts of the two wars the U. S. has fought since September 11, 2001 this book will be a valuable contribution to their research.\"",
        "Category": " History , Military , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Power Principle: INFLUENCE WITH HONOR",
        "Authors": "By Lee, Blaine",
        "Description": "The Power Principle is a life-shifting book for all people - one that goes beyond traditional ideas of force, fear, clever negotiating and dealmaking as primary sources of power with others. Lee explores how we can truly influence people with honor instead of giving up, giving in, or taking over.Lee teaches that principle-centered power is the ability to influence others' behavior - not to control, change, or manipulate it. Power is something other people feel in your presence because of who you are, what you stand for, and where you are going. Honor is power, the kind of power that is genuine and lasting.Your influence can be significant when you elicit the highest and best from others. They value what you are about not because they obtained something in exchange and not because they are afraid of you, but because they believe in your integrity. Power gained because of what you can do to someone leads to temporary, reactive control. Power that relies on what you can do for someone yields only a conditional, unsustainable influence. However, as you exercise the power principle with others, they become empowered, trust and loyalty increase, and extraordinary results are possible.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Blue Heaven",
        "Authors": "By Kagan, Elaine",
        "Description": "Three women - Mollie; her daughter, Gilliana; and Gilliana's daughter, Clare - take us into their lives. In the past, Mollie's story: her passionate early marriage, surviving separation in World War II only to be destroyed by her husband's uncontrollable gambling; the unexpected sweetness and soundness of the years of her marriage with the beloved Lew. And Gilliana's story: a perfect - and doomed - romance with a famous entertainer who is both charming and giving; a glamorous career; a failing marriage.And in the present: teenage Clare, observing the crash of her parents' marriage and, even worse, her grandmother Mollie's descent into senility, while she herself, on the brink of first love, tries to understand and avoid the mistakes and tragedies of her family's past.These are loving women: the generous, sweet-tempered, domestic Mollie; the ardent, wisecracking Gilliana; the cool, straightforward, \"modern\" Clare. Their lives, their feelings, their richly articulated voices are the heart of this moving, embracing novel that catches the essence of family love, sexual love, and the sheer love of life.",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Five Quarters of the Orange",
        "Authors": "By Harris, Joanne",
        "Description": "In her bestselling and critically acclaimed novel Chocolat, Joanne Harris told a lush story of the conflicts between pleasure and repression. Now she delivers her most complex and sophisticated work yet, an unforgettable tale of mothers and daughters, of the past and the present, of resisting and succumbing -- an extraordinary work of fiction lined with darkness and fierce joy.When Framboise Simon returns to a small village on the banks of the Loire, the locals do not recognize her as the daughter of the infamous woman they hold responsible for a tragedy during the German occupation years ago. But the past and present are inextricably entwined, particularly in a scrapbook of recipes and memories that Framboise has inherited from her mother. And soon Framboise will realize that the journal also contains the key to the tragedy that indelibly marked that summer of her ninth year....",
        "Category": " Fiction , Psychological",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "A Leap in the Dark: The Struggle to Create the American Republic",
        "Authors": "By Ferling, John E.",
        "Description": "It was an age of fascinating leaders and difficult choices, of grand ideas eloquently expressed and of epic conflicts bitterly fought. Now comes a brilliant portrait of the American Revolution, one that is compelling in its prose, fascinating in its details, and provocative in its fresh interpretations.In A Leap in the Dark, John Ferling offers a magisterial new history that surges from the first rumblings of colonial protest to the volcanic election of 1800. Ferling's swift-moving narrative teems with fascinating details. We see Benjamin Franklin trying to decide if his loyalty was to Great Britain or to America, and we meet George Washington when he was a shrewd planter-businessman who discovered personal economic advantages to American independence. We encounter those who supported the war against Great Britain in 1776, but opposed independence because it was a \"leap in the dark.\" Following the war, we hear talk in the North of secession from the United States. The author offers a gripping account of the most dramatic events of our history, showing just how closely fought were the struggle for independence, the adoption of the Constitution, and the later battle between Federalists and Democratic-Republicans. Yet, without slowing the flow of events, he has also produced a landmark study of leadership and ideas. Here is all the erratic brilliance of Hamilton and Jefferson battling to shape the new nation, and here too is the passion and political shrewdness of revolutionaries, such as Samuel Adams and Patrick Henry, and their Loyalist counterparts, Joseph Galloway and Thomas Hutchinson. Here as well are activists who are not so well known today, men like Abraham Yates, who battled for democratic change, and Theodore Sedgwick, who fought to preserve the political and social system of the colonial past. Ferling shows that throughout this period the epic political battles often resembled today's politics and the politicians--the founders--played a political hardball attendant with enmities, selfish motivations, and bitterness. The political stakes, this book demonstrates, were extraordinary: first to secure independence, then to determine the meaning of the American Revolution. John Ferling has shown himself to be an insightful historian of our Revolution, and an unusually skillful writer. A Leap in the Dark is his masterpiece, work that provokes, enlightens, and entertains in full measure.",
        "Category": " History , United States , Revolutionary Period (1775-1800)",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Quiet Places",
        "Authors": "By Rubietta, Jane",
        "Description": "A women's guide for Christian retreat offers meditations and encouragement for enriching spiritual life during a busy day or in an organized group setting",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Diets That Work: For Weight Control or Medical Needs",
        "Authors": "By Strauss, Larry and Scanlon, Deralee",
        "Description": "Describes the basic principles of dieting for weight control, recommends specific programs and plans, and discusses a variety of health-related diets",
        "Category": " Medical , General",
        "Publisher": "Lowell House",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Road to Camlann: The Death of King Arthur",
        "Authors": "By Sutcliff, Rosemary and Felts, Shirley (ILT)",
        "Description": "Can the Fellowship of the Round Table survive Mordred's treachery?After years of Arthur's fair rule, evil has come to Camelot. Mordred, Arthur's illegitimate son, is determined to destroy the Round Table and gain the throne for himself. He will use whatever tools he can—mutiny, force, even the rumors of a love between Lancelot and Queen Guenevere. In the end, there is only one place for the battle to be lost or won: the bleak plain of Camlann, where Arthur and his knights of the Round Table fight for their lives.\"Sutcliff is superb in the fluency with which she re-creates a period; her characters come alive . . . and her style is intense and flowing in this grave and poignant conclusion.\"—Bulletin of the Center for Children's Books, starred review \"Other than Malory, I can think of no better introduction to the whole sweep of Arthurian stories.\"—School Library Journal, starred review",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , Arthurian",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Window Seat: Reading the Landscape from the Air (Window Seat, WIND)",
        "Authors": "By Dicum, Gregory",
        "Description": "Talk about a fresh perspective! Perched 35,000 feet in the air, Window Seat decodes the sights to be seen on any flight across North America. Broken down by region, this unusual guide features 70 aerial photographs; a fold-out map of North America showing major flight paths; profiles of each region covering its landforms, waterways, and cities; tips on spotting major sights, such as the Northern Lights, the Grand Canyon, and Disney World; tips on spotting not-so-major sights such as prisons, mines, and Interstates; and straightforward, friendly text on cloud shapes, weather patterns, the continent's history, and more. A terrific book for kids, frequent flyers, and armchair travelers alike,Window Seat is packed with curious facts and colorful illustration, proving that flying doesn't have to be a snooze. When it's possible to \"read\" the landscape from above, a whole world unfolds at your feet.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Greenspan: The Man Behind Money",
        "Authors": "By Martin, Justin McCory",
        "Description": "Greenspan: The Man Behind Money presents the famous Fed Chairman as few know him. It spans his hardscrabble childhood in Depression-era New York City, his fascinating decades-long friendship with controversial author Ayn Rand, his Juilliard education and days spent touring with Henry Jerome's jazz band, as well as two marriages, a dynamic D.C. social life, and service to six U.S. presidents. Based on unprecedented access to Greenspan's family members and peers, including Henry Kissinger, Gerald Ford, and Milton Friedman, Greenspan: The Man Behind Money is the only book to shed real light on one of the most private public figures of our time.",
        "Category": " Biography & Autobiography , Business",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Men at Mid-Life: Steering Through the Detours",
        "Authors": "By Harnish, James A.",
        "Description": "With sensitivity, insight,and refreshing humor, the author deals honestly with the concerns men face at mid-life. Drawing upon personal experience, stories of others, and biblical examples, he provides inspiration and practical suggestions for handling important issues such as: self-worth, personal identity, fear, past relationships and experiences, healing and forgiveness, sex and sensuality, spiritual maturity, and friendship.  This book will also help women better understand and relate to the men in their lives, as well as cope with the effects of the mid-life crisis on their own lives.  Includes action plans for him and her, 13 chapters.",
        "Category": " Social Science , Men's Studies",
        "Publisher": "DIMENSIONS FOR LIVING",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Eliminating Clutter from Your Life",
        "Authors": "By Wright, Susan (EDT)",
        "Description": "Tells how to handle household, office, and financial clutter, organize paper and computer files, books, clothing, medicine cabinets, and closets, and prepare for a move",
        "Category": "",
        "Publisher": "Lyle Stuart",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "A Big Storm Knocked It Over",
        "Authors": "By Colwin, Laurie",
        "Description": "In a Big Storm Knocked It Over, acclaimed author Laurie Colwin explores marriage, friendship, motherhood, and careers as experienced by a cast of endearing idiosyncratic Manhattanites.  At once a hilarious social commentary and an insightful, sophisticated modern romance, A Big Storm Knocked It Over will stand as a living tribute to one of contemporary fiction's most original voice.",
        "Category": " Fiction , General",
        "Publisher": "HarpPeren",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Francis Ford Coppola's Zoetrope: All-Story 2",
        "Authors": "By Brodeur, Adrienne (EDT), Coppola, Francis Ford (INT), Schnee, Samantha (EDT), and Coppola, Francis Ford (EDT)",
        "Description": "The literary journal Zoetrope, founded in 1997 by film director Francis Ford Coppola, proved an instant and spectacular success with readers and critics nationwide. Its stories have garnered awards from such publications as Best American Short Stories, The O. Henry Award Prize Stories, and many more. And it won a National Magazine Award for fiction in 2001--the youngest magazine ever to do so.  A sequel to the successful first volume, this collection presents some of the best writing to have appeared in the magazine in the last two years, including stories and essays by Jennifer Egan, Pinckney Benedict, Peter Greenaway, Rick Moody, Francine Prose, and Toure, among others. In addition, two never-before-published stories commissioned exclusively for this volume appear here: one by Rick Bass and the other by Alicia Erian. The result is an exciting and vital collection, a must-have for readers of today's best writing.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "From a Buick 8",
        "Authors": "By King, Stephen",
        "Description": "The state police of Troop D in rural Pennsylvania have kept a secret in Shed B out back of the barracks ever since 1979, when Troopers Ennis Rafferty and Curtis Wilcox answered a call from a gas station just down the road and came back with an abandoned Buick Roadmaster. Curt Wilcox knew old cars, and he knew immediately that this one was...wrong, just wrong. A few hours later, when Rafferty vanished, Wilcox and his fellow troopers knew the car was worse than dangerous -- and that it would be better if John Q. Public never found out about it.  Curt's avid curiosity taking the lead, they investigated as best they could, as much as they dared. Over the years the troop absorbed the mystery as part of the background to their work, the Buick 8 sitting out there like a still life painting that breathes -- inhaling a little bit of this world, exhaling a little bit of whatever world it came from.  In the fall of 2001, a few months after Curt Wilcox is killed in a gruesome auto accident, his 18-year-old boy Ned starts coming by the barracks, mowing the lawn, washing windows, shoveling snow. Sandy Dearborn, Sergeant Commanding, knows it's the boy's way of holding onto his father, and Ned is allowed to become part of the Troop D family. One day he looks in the window of Shed B and discovers the family secret. Like his father, Ned wants answers, and the secret begins to stir, not only in the minds and hearts of the veteran troopers who surround him, but in Shed B as well....  From a Buick 8 is a novel about our fascination with deadly things, about our insistence on answers when there are none, about terror and courage in the face of the unknowable.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Iguana: An Owner's Guide to a Happy Healthy Pet (Your Happy Healthy Pet, 121)",
        "Authors": "By Rosenthal, Karen",
        "Description": "At last, a book about this special lizard that emphasizes total care and companionship! You'll not only learn about specific traits of your iguana, like its needs for light and heat, you'll learn what the world's like from your pet's perspective. Best of all, the book is filled with color photos, info-packed sidebars and fun facts to make caring for your pet easy and enjoyable.",
        "Category": " Pets , Reptiles, Amphibians & Terrariums",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Who Do You Think Your Are?: Explore Your Many-Sided Self With the Berkeley Personality Profile",
        "Authors": "By Harary, Keith and Donahue, Eileen, Ph.D.",
        "Description": "An entertaining personality profiler gathers evaluations from the individual, partners, family, friends, and co-workers, and includes color-coded tests and self-scoring devices. Original. 50,000 first printing. $40,000 ad/promo. Tour.",
        "Category": " Psychology , General",
        "Publisher": "Harper San Francisco",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Isabel's Bed",
        "Authors": "By Lipman, Elinor",
        "Description": "When Harriet Mahoney first sees it, Isabel Krug's bed is covered with sheared sheep and littered with celebrity biographies. Unpublished, fortyish, and recently jilted, Harriet has fled Manhattan for Isabel's loudly elegant Cape Cod retreat, where she will ghostwrite The Isabel Krug Story, based on the sexy blond's scandalous tabloid past. Unusually \"talented\" in the man department (\"I give lessons\"), Isabel revamps and inspires Harriet as they gear up to tell all, including the tangled history Isabel shares with her odd lodger, Costas. Life according to Isabel is a nonstop soap opera extravaganza, an experience to be swallowed whole -- and the attitude is catching....",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "HTML Goodies",
        "Authors": "By Burns, Joe",
        "Description": "Burns, professor of communications at Susquehana University and creator of the award-winning HTML Goodies Web site, offers a series of self-contained, reader-friendly tutorials for learning HTML and building Web sites. Everything needed is contained in each lesson, so there is no need to check previous chapters for information. HTML is covered from the ground up, followed by material on building Web site features such as visitor counters, scrolling marquees, RealAudio sound, and searchable databases. Each \"goody\" in the book has a working example on the Web site. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Computers , Programming Languages , HTML",
        "Publisher": "Que Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Exploits & Adventures of Miss Alethea Darcy: A Novel",
        "Authors": "By Aston, Elizabeth",
        "Description": "The Exploits & Adventures of Miss Alethea Darcy takes readers back into the imagined family of Elizabeth Bennet and Mr. Darcy. Their musical daughter Alethea makes a disastrous marriage to a man whose charming manners conceal an unpleasant nature. Flinging caution to the winds, she flees her marital home, masquerading as a gentleman, and accompanied only by her redoubtable maid, Figgins, she sets off for Venice to take refuge with her sister Camilla. But events -- always dramatic and sometimes dangerous -- conspire to thwart her plans. Before she can meet up with Camilla, chance and her love of music lead her into the world of Italian opera, while her encounter with the aloof and difficult Titus Manningtree, in Italy to pursue a lost Titian painting, is to change her life -- although fate has several more tricks to play before she can find happiness.  With wit, aplomb, and delectable style, Elizabeth Aston once again re-creates the world of Jane Austen, populating her novel with captivating characters firmly rooted in Austen's traditions but distinctly her own, resulting in another delightful comedy of manners, morals, and marriage.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Your Pregnancy: Every Woman's Guide (Your Pregnancy Series)",
        "Authors": "By Curtis, Glade B. and Schuler, Judith",
        "Description": "A warm and reassuring resource, Your Pregnancy: Every Woman's Guide offers short, clear explanations of what a woman needs to know about her pregnancy. From nutritional tips, such as the most important pregnancy vitamins, to explanations of pre-natal tests, such as ultrasound and amniocentesis, Your Pregnancy covers the most essential pregnancy questions. With helpful illustrations and a detailed glossary of terms, this is the perfect guide for any woman preparing for the birth of a new baby.",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Da Capo Lifelong",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "That Book...of Perfectly Useless Information",
        "Authors": "By Symons, Mitchell",
        "Description": "You hold in your hands the ultimate trivia guide. Organized in thematic sections, That Book covers a world of learning by an author whos developed game shows (he was the creator of the first \"fastest-finger\" game-show quiz) and was one of the original contributors to the international editions of Trivial Pursuit. Want to know which U.S. president is a descendant of King Edward III? Or which famous people lived to read their own obituaries? That Book covers these inessential facts and more ... Not since Schotts Original Miscellany has there been such a delectable feast of useless information. That Book is an encyclopedia of honest-to-god facts from the bizarre to the mundane that will have you alternately shaking your head in wonder and holding your sides in laughter. Bathroom -- or bedside -- reading just doesnt get any better than this -- or That.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Britain yesterday and today: 1830 to the present (A History of England)",
        "Authors": "By Arnstein, Walter L.",
        "Description": "",
        "Category": "",
        "Publisher": "D.C. Health",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Stampcraft: Dozens of Creative Ideas for Stamping on Cards, Clothing, Furniture and More",
        "Authors": "By Haysom, Cari",
        "Description": "Instructions for a variety of projects are presented together with a guide to stamps, inks and paints, finishes, equipment, and techniques",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Chilton Book Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The Media Lab: Inventing the Future at M.I.T.",
        "Authors": "By Brand, Stewart",
        "Description": "Provides a look at the future as it is envisioned by the Media Lab at MIT, where scientists are retooling mass media to the desires and whims of the individual.",
        "Category": " Social Science , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Dragon Wing (The Death Gate Cycle, Book 1)",
        "Authors": "By Weis, Margaret",
        "Description": "Ages ago, sorcerers of unmatched power sundered a world into four realms—sky, stone, fire, and water—then vanished. Over time, magicians learned to work spells only in their own realms and forgot the others. Now only the few who have survived the Labyrinth and crossed the Death Gate know of the presence of all four realms—and even they have yet to unravel the mysteries of their severed world. . . . In Arianus, Realm of Sky, humans, elves, and dwarves battle for control of precious water—traversing a world of airborne islands on currents of elven magic and the backs of mammoth dragons. But soon great magical forces will begin to rend the fabric of this delicate land. An assassin will be hired to kill a royal prince—by the king himself. A dwarf will challenge the beliefs of his people—and lead them in rebellion. And a sinister wizard will enact his plan to rule Arianus—a plan that may be felt far beyond the Realm of Sky and into the Death Gate itself.",
        "Category": "",
        "Publisher": "Spectra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "The Good Calorie Diet: The Revolutionary New Diet Program Based on Inhibiting Fat Formation",
        "Authors": "By Lipetz, Philip, Ph.D.",
        "Description": "Through guidelines and original recipes, the author shows how to lose weight painlessly and permanently while eating normally, through distinguishing good calories from bad and avoiding foods with a high potential for fat formation. 125,000 first printing. $150,000 ad/promo. Tour.",
        "Category": " Medical , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Cherry Orchard",
        "Authors": "By Chekhov, Anton Pavlovich",
        "Description": "Pulitzer Prize-winning playwright David Mamet, in this unique adaptation of one of the great masterpieces of the theater, allows us to see Anton Chekhov's \"The Cherry Orchard\" in totally new and surprising ways. As Mamet explains in his introduction, he views the play \"as a series of scenes about sexuality and, particularly, frustrated sexuality\" rather than about a dying Russia. The result, said 'The Sentinel,' \"blows a gust of fresh air into the old play\" while the Chicago Sun-Times called it \"audacious [and] consistently arresting.\" \"Mamet the adaptor has turned Chekhov's Cherry Orchard into a Mamet play. Mamet's ear is famously impeccable, the dialogue is always authentic and convincing . . . . This is a tribute to its strong point of view and clear point of departure. If nothing else, it will help to undermine our silly critical notions of 'definitive' Chekhov. Mamet has made me rethink the play.\" - Robert Brustein, 'The New Republic'",
        "Category": " Drama , European , General",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Handy Politics Answer Book (The Handy Answer Book Series)",
        "Authors": "By Misiroglu, Gina",
        "Description": "In these politically charged times, interest in the political process is peaking. Enormous decisions must be made at a time when the world seems to be teetering on the edge of chaos.The Handy Politics Answer Book dares to ask the tough questions (not like the ones reporters lob at incumbents) and answers every one thoroughly and clearly (without the usual political side-stepping and spin tactics). Fifteen chapters explore politics from our founding fathers to current trends, from our branches of government to how they work together (or don't), from noteworthy people and officials to major events. This is just the book wannabe politicians (and everyone else) can consult to obtain a solid understanding on such things as \"Why were Medicare and Medicaid created?\" \"What are civil liberties?\" \"What is due process of law?\" \"What is the United Nations?\" Then there are the questions you always wanted to know, like, \"What is considered the dirtiest presidential campaign on record?\" And, \"If the president has a job description, what is it?\" Great questions for parties, but everyone knows you're not supposed to talk politics at social gatherings. That's why this book exists.",
        "Category": " Reference , Questions & Answers",
        "Publisher": "Visible Ink Press",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "At Home in Mitford",
        "Authors": "By Karon, Jan",
        "Description": "The first novel in #1 New York Times bestselling author Jan Karon’s beloved series set in America’s favorite small town: Mitford. It's easy to feel at home in Mitford. In these high, green hills, the air is pure, the village is charming, and the people are generally lovable. Yet, Father Tim, the bachelor rector, wants something more. Enter a dog the size of a sofa who moves in and won't go away. Add an attractive neighbor who begins wearing a path through the hedge. Now, stir in a lovable but unloved boy, a mystifying jewel theft, and a secret that's sixty years old. Suddenly, Father Tim gets more than he bargained for. And readers get a rich comedy about ordinary people and their ordinary lives.",
        "Category": " Fiction , Religious",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Putting the One Minute Manager to Work",
        "Authors": "By Blanchard, Kenneth, Johnson, Spencer",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "A Year in Provence",
        "Authors": "By Mayle, Peter and Clancy, Judith (ILT)",
        "Description": "National Bestseller In this witty and warm-hearted account, Peter Mayle tells what it is like to realize  a long-cherished dream and actually move into a 200-year-old stone farmhouse in the  remote country of the Lubéron with his wife and two large dogs. He endures January's  frosty mistral as it comes howling down the Rhône Valley, discovers the secrets of  goat racing through the middle of town, and delights in the glorious regional cuisine.  A Year in Provence transports us into all the earthy pleasures of Provençal life  and lets us live vicariously at a tempo governed by seasons, not by days.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Twiddlebugs at Work: Featuring Jim Henson's Sesame Street Muppets",
        "Authors": "By Linda Hayward",
        "Description": "Labelled panoramas introduce the busy Twiddlebugs who work hard to make Ernie's window box a nice place to live.",
        "Category": "",
        "Publisher": "Western Publishing Company, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Night of the Crash-Test Dummies (Volume 11)",
        "Authors": "By Larson, Gary",
        "Description": "1986, 1988 FarWorks, Inc. All Rights Reserved. The Far Side and the Larson signature are registered trademarks of FarWorks, Inc.",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Time Out Stockholm 1 (Time Out Guides)",
        "Authors": "By Time Out (EDT)",
        "Description": "",
        "Category": " Travel , Europe , Germany",
        "Publisher": "Penguin Group USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    }
]