[
    {
        "Title": "In the Company of the Courtesan: A Novel",
        "Authors": "By Dunant, Sarah",
        "Description": "My lady, Fiammetta Bianchini, was plucking her eyebrows and biting color into her lips when the unthinkable happened and the Holy Roman Emperor’s army blew a hole in the wall of God’s eternal city, letting in a flood of half-starved, half-crazed troops bent on pillage and punishment.Thus begins In the Company of the Courtesan, Sarah Dunant’s epic novel of life in Renaissance Italy. Escaping the sack of Rome in 1527, with their stomachs churning on the jewels they have swallowed, the courtesan Fiammetta and her dwarf companion, Bucino, head for Venice, the shimmering city born out of water to become a miracle of east-west trade: rich and rancid, pious and profitable, beautiful and squalid. With a mix of courage and cunning they infiltrate Venetian society. Together they make the perfect partnership: the sharp-tongued, sharp-witted dwarf, and his vibrant mistress, trained from birth to charm, entertain, and satisfy men who have the money to support her. Yet as their fortunes rise, this perfect partnership comes under threat, from the searing passion of a lover who wants more than his allotted nights to the attentions of an admiring Turk in search of human novelties for his sultan’s court. But Fiammetta and Bucino’s greatest challenge comes from a young crippled woman, a blind healer who insinuates herself into their lives and hearts with devastating consequences for them all.A story of desire and deception, sin and religion, loyalty and friendship, In the Company of the Courtesan paints a portrait of one of the world’s greatest cities at its most potent moment in history: It is a picture that remains vivid long after the final page.",
        "Category": " Fiction , Literary",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Suzanne Somers' Slim and Sexy Forever: The Hormone Solution for Permanent Weight Loss and Optimal Living",
        "Authors": "By Somers, Suzanne, Hamel, Leslie (ILT), and Allen, David R., M.D. (FRW)",
        "Description": "Who says you can’t sizzle in the second half of life?At last, a solution! In Slim and Sexy Forever, Suzanne Somers outlines a program speci?cally designed to address the needs of women and men who want to lose weight and replace the lust for life that naturally wanes with age. In this “baby boomer’s recipe for the fountain of youth,” Suzanne shows you how to:• melt away the unwanted pounds• reinvigorate your sex drive• capture youthful vitality• develop a more positive outlook on life• sharpen memory• eliminate hot flashes• achieve optimum health from the inside outIn her runaway New York Times bestseller The Sexy Years, Suzanne changed the way we look at our health and hormones, showing how replacing hormones lost in the aging process with natural bioidentical hormones can eliminate symptoms associated with aging.Now, in Slim and Sexy Forever, Suzanne combines her cutting-edge information on natural hormone replacement with her successful weight loss program, Somersize, for a one-two punch that is the only proven solution to the problems associated with aging. Working with innovative doctors, Suzanne has created a program that alleviates symptoms such as mood swings, sleepless nights, hot flashes, and diminished sex drive that are so common as we get older. Simultaneously, her phenomenally successful Somersize program shows you how to beat a stalling metabolism and stay lean and trim while eating remarkably delicious food. With millions of people losing weight on the program, it is a proven formula for success.Suzanne makes clear in this fascinating new book that if your hormones are out of balance, you will not be able to lose weight. Weight loss must be approached with a twofold strategy as you get older: balance your hormones the bioidentical way and eat correctly. One doesn’t work without the other.  In Slim and Sexy Forever you’ll also learn:• The truth about carbs: Depriving yourself of too many carbs will lead to hormonal imbalance and weight gain. Eat the right carbs to lose weight!• Plateau-busting tips: Suzanne explains why you hit plateaus and exactly how to push past them to achieve your goal weight.• The connection between adrenals and weight gain: If you blow out your adrenals trying to be Superwoman, you are going to gain weight and feel fatigued. Find out how to prevent that from happening.And, as always, Suzanne makes losing weight easy with more than 100 delicious new recipes, including Crab Bisque with Sweet Corn and Crab Relish, Somersize Tex-Mex Chicken Drumettes and Meatballs, Peppered Pork Chops with Fried Sage Leaves, Warm Chocolate Soufflé Cakes, and Wild Berry Crostada. These are Suzanne’s best recipes yet!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Crown Archetype",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "No End Save Victory: Perspectives on World War II",
        "Authors": "By Cowley, Robert (EDT) and Ambrose, Stephen E. (EDT)",
        "Description": "This volume presents 45 essays on World War II which were previously published (most of them in  MHQ: The Quarterly Journal of Military History ) by writers such as Stephen E. Ambrose, Caleb Carr, John Keegan, and William Manchester. The contributions are organized around the themes of the German \"breakout\" (1939-41), the great East Asia war, the world at war (1942-43), the secret war, the end in Europe (1944-45), and Armageddon in the Pacific (1944-45). The volume does not include an index or bibliographical references. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " History , Military , World War II",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Four Mothers: A Novel",
        "Authors": "By Bilu, Dalya (TRN) and Horn, Shifra",
        "Description": "Shifra Horn's beautifully imagined novel tells the story of five generations of women in one family against the backdrop of one hundred years in Jerusalem.The story begins with the birth of the family's first boy to Amal, the last generation. Her mother, grandmother and great-grandmother are overjoyed, because the birth of a healthy boy means that the curse against the women of the family has been broken. They tell Amal the story of those \"foremothers\":  Mazal, the orphan, whose ill-fated marriage initiates the curse; her daughter Sara, whose golden hair is a symbol for her power to heal; Sara's daughter Pnina-Mazal, the unwanted child whose talent for knowing others' thoughts brings both joy and sorrow; and her daughter Geula, Amal's mother, whose sharp intellect is her gift and her burden.",
        "Category": " Fiction , Literary",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Seventh Sacrament",
        "Authors": "By Bradberry, James",
        "Description": "Jamie Ramsgill Professor of architecture, has been invited to oversee an exclusive competition: six of the world's top architects have been assembled by Renzo Piruzzi, one of Italy's wealthiest men, and given one weekend to design a masterpiece, an chapel that will serve as his tomb.For the winner will come great rewards: an enormous commission, prestige, a priceless artifact thought to be long lost, plus the satisfaction of having bettered his (or her) rivals. Jamie can't decide whether Piruzzi is a genius, whose plan will ensure a brilliant design, or merely calculating and cruel.Soon after arriving at Piruzzi's secluded villa, things begin to go awry. Two of the competitors die, one by choking to death in a drunken stupor, the other by suicide. Jamie begins to suspect foul play, but the police, Piruzzi, and the other competitors are willing to believe that the deaths are nothing more than an unfortunate coincidence. Jamie is forced to undertake his own investigation in order to prove he isn't crazy.As things progress, he finds he can trust no one, save Elena, Piruzzi's strong-willed daughter. Soon matters become desperate, and the two must scramble to uncover the killer, before they themselves become victims.",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Monsieur Pamplemousse Aloft",
        "Authors": "By Bond, Michael",
        "Description": "French food critic and amateur sleuth Monsieur Pamplemousse finds himself entangled with criminals and circus stars when he is asked to design a menu for an international dirigible service",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "What happens when women pray (An input book)",
        "Authors": "By Evelyn Christenson, Viola Blake",
        "Description": "",
        "Category": "",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "A Visual History of the Twentieth Century",
        "Authors": "By Burrows, Terry (EDT)",
        "Description": "The last hundred years have been captured not just in words, as in previous centuries, but also in visual detail with photographs, film and video. The greatest images of this era are combined here with authoritative text to document our times with immediacy and clarity.Every major event that has had a place in molding the century is chronicled - the death of a great queen, Victoria, at the beginning of the century and the tragic demise of a beloved princess, Diana, at its end; the civil unrest in the Balkans that led to the Great War and had grave, far-reaching consequences for Yugoslavia in the 1990's; the destruction of the old Imperial order that gave bloody birth to revolutions and civil wars and spawned the reigns of brutal dictators in Germany, Spain, Italy and Russia; the technological, scientific and medical advances that transformed every aspect of our lives; the people - politicians, scientists, movie stars, icons, writers - who shaped the way we think, feel and live. The Visual History of the Twentieth Century is an overview of this age: a century of war, peace, prosperity and progress.",
        "Category": " History , United States , General",
        "Publisher": "Carlton Publishing Group",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Mummies.",
        "Authors": "By McHargue, Georgess",
        "Description": "",
        "Category": "",
        "Publisher": "Lippincott",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Double Eagle: Ben Abruzzo, Maxie Anderson, Larry Newman",
        "Authors": "By McCarry, Charles",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Gramercy Park",
        "Authors": "By Cohen, Paula",
        "Description": "New York City, 1894.  To Gramercy Park, bordered by elegant town houses, cloistered behind its high iron fence, comes Mario Alfieri, the world's greatest tenor.  Poised for his premier at the Metropolitan Opera, the summit of society, the handsome Alfieri needs a refuge from the clamor of New York's elite . . . and from the eager women who rule it.  He finds it, he thinks, at Gramercy Park, in the elegant mansion of the recently deceased Henry Ogden Slade.  The house is available . . . but not quite empty.  Clara Adler, Slade's former ward, lives there still, friendless and alone.  Who is this bewitching orphan?  Why did Slade take her into his home, only to leave her penniless at his death?  And what tragedies and terrors have left Clara little more than a pale and frightened ghost, haunting the deserted mansion?  Mystified, then enchanted, Alfieri is soon involved in an intrigue that spans two decades and pits him against a vicious enemy who swears to destroy both him and the woman he loves . . . and whose weapon is a scandal that has already come close to killing Clara Adler.",
        "Category": " Fiction , Historical",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Oh, Bother! Someone Won't Share! (Golden Look-look Book)",
        "Authors": "By Birney, Betty and Stevenson, Nancy W.",
        "Description": "",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The Wildlife Observer's Guidebook",
        "Authors": "By Roth, Charles Edmund",
        "Description": "Practical instructions for watching wild creatures in their natural setting: the arts of seeing, clueing in, stalking and hiding; making blinds, lures, and live traps; taking field notes",
        "Category": " Science , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "The Mirror",
        "Authors": "By Freed, Lynn",
        "Description": "In 1920, Agnes La Grange leaves a poor life in England for Durban, South Africa, to make her future.  In the house of the Jewish family where she first works as a maid, the wife is dying--which doesn't keep the husband from sneaking to Agnes's room to make love while watching in a mirror he's given her.  His unrestrained passion for her (old and a head shorter he may be) leads her to say, \"I have never felt so strongly the power of being alive.\"  And that's in truth the only power Agnes ever wants or values.  During her pregnancy, the \"old Jew,\" as she calls him bluntly but without judgment, puts her up in the Railway Hotel--an establishment of which, after the birth of her daughter Leah, she becomes owner and new proprietress by finessing the old man into putting up the money.  From then on, Agnes is on her way.  \"The newspaperman\" will be a weak and soon-divorced husband, followed by such lovers as Agnes finds attractive--\"the banker,\" \"the hunter,\" and \"the trader.\"  Agnes doesn't even read the papers, but her beauty, life, and business sense draw others to her, seeing her through the Depression and WWII as she's cheated but recovers, buys more property, sees Leah become a famous singer--although not before Leah does just what Agnes did in seducing a husband (readers will find out whose), leaving Agnes a gorgeous child to raise as a second daughter.  Forget improprieties: As Agnes says, \"this wasn't a story . . . this was a life.\"",
        "Category": " Fiction , Literary",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "A Life in the 20th Century: Innocent Beginnings, 1917-1950",
        "Authors": "By Schlesinger, Arthur Meier",
        "Description": "As a preeminent historian of our time, Arthur M. Schlesinger, Jr., continues in his many books and articles to show Americans who we are as a nation, to explain our past, and to illuminate possibilities for the future. But here, in the first volume of his long-awaited memoirs, he turns his acute historian's eye on his own past. In the elegant and witty language of one of our most readable writers, Schlesinger artfully reconstructs a twentieth-century life.Schlesinger's personal story is ultimately the captivating history of America coming into its own as a world power. It includes a fondly remembered childhood in the Midwest; life in America of the twenties; student days at Harvard, lived in the shadow of a distinguished father; Cambridge University in England in the twilight year between the Munich Pact and the start of World War II; the bitter debate in the United States in the months before Pearl Harbor; a stint overseas with the Office of Strategic Services; the fate of postwar liberalism, under attack from right and left; the origins of The Vital Center. Here is a dramatic evocation of the struggles, the questions, the paradoxes, and the triumphs that shaped our era.Interweaving personal and national stories, Schlesinger conjures up the colorful details of everyday life, offering readers a rare and revealing window on both the private world of a notable American writer and the innocent beginnings of the American century. A LIFE IN THE TWENTIETH CENTURY: INNOCENT BEGINNINGS, 1917 -- 1950 is destined to become a classic.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Baltimore and the nineteenth of April, 1861: A study of the war",
        "Authors": "By Brown, George William",
        "Description": "",
        "Category": "",
        "Publisher": "Maclay",
        "Price Starting With ($)": "50.1",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Restless Souls: The Making of American Spirituality",
        "Authors": "By Schmidt, Leigh Eric",
        "Description": "Yoga classes and Zen meditation, New Age seminars and holistic workshops, the Oprah Winfrey Show, and books by Deepak Chopra -- all are part of the religious experimentation that has surprisingly deep roots in American history. In fact, they represent only the most recent flowerings of a unique form of spirituality. By tracing our spiritual heritage along its many colorful highways and eccentric byways, Restless Souls profiles a rich spirituality that is distinctively American. Since the 1960s, our expanded and enhanced spiritual explorations have changed us from a nation of church goers into a culture of seekers. But the American fascination with mystical experience and churchless spirituality goes back much further than the psychedelic era. In Restless Souls, historian Leigh Schmidt deftly traces this American romance with the interior life from the likes of transcendentalist Ralph Waldo Emerson to television host Oprah Winfrey, from poet Walt Whitman to Senator Barak Obama, from questing psychologist William James to Zen basketball coach Phil Jackson. We're taken from pioneer Johnny Appleseed to translator of Sufi poetry Coleman Barks, from theosophist Madame Blavatsky to meditation guru Ram Dass, and then to many more. This book places the most recent spiritual upsurge in the context of a broader cultural and intellectual history. In contrast to prevailing fears about the conservative influence of religion in America, Restless Souls depicts a vibrantly open American spirituality and serves as a timely reminder of the ample religious resources of the liberal tradition.",
        "Category": " Religion , History",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Perspectives on a Grafted Tree: Thoughts for Those Touched by Adoption",
        "Authors": "By Johnston, Patricia Irwin (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Perspectives Press/Koryo Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Weight Watchers Quick, Light & Healthy Cookbook",
        "Authors": "By Kate Matuszak Wheeler",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Snow Goose",
        "Authors": "By Gallico, Paul",
        "Description": "The moving wartime story of friendship and heroism, set against the dramatic backdrop of the World War II Battle of Dunkirk In the marshes of Essex, one of the last wild places left in England, a disfigured artist lives alone in an abandoned lighthouse. Shunned by society, he spends his days painting scenes of the coast and the birds that migrate to the meadowlands every winter.  His days are solitary until one November afternoon, a young girl from a nearby village comes to his door carrying a wounded snow goose in her arms. The unlikely pair develop a friendship that deepens over the ensuing years, waiting together for the arrival of the birds every autumn.  In 1940, with England at war, the birds depart early from the shores. The man, too, is called away by his duty as an Englishman to help evacuate the soldiers stranded on the beaches of Dunkirk. A moving tale of love, war, bravery, and sacrifice.",
        "Category": " Fiction , Literary",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1941"
        }
    },
    {
        "Title": "John James Audubon: The Watercolors for the Birds of America",
        "Authors": "By New-York Historical Society (COR), Audubon, John James, Stebbins, Theodore E., Jr., Blaugrund, Annette, Slatkin, Carole Anne, and Hotchner, Holly",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Villard Books",
        "Price Starting With ($)": "7.38",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Precalculus: Enhanced with Graphing Utilities (2nd Edition)",
        "Authors": "By Sullivan, Michael",
        "Description": "Emphasizing graphing technology and business applications, this user-friendly book is the perfect reference for everyday and business mathematics.  Solves problems using both algebra and a graphing utility, with the benefits of each illustrated. Uses real data to help readers make connections between the mathematics learned and familiar situations. Uses up-to-date technology including the more powerful features of ZERO(ROOT) and INTERSECT, with minimal use of TRACE. Helps readers quickly identify key points in the book with a vivid new full-color design.  For anyone who needs to brush up on everyday or business-related mathematics.",
        "Category": " Mathematics , General",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "9.14",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Ministry With Young Adults: The Search for Intimacy.",
        "Authors": "By Garber, Julie (EDT)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Brethren Pr",
        "Price Starting With ($)": "9.53",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "Enchanted Pilgrimage",
        "Authors": "By Clifford D Simak",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley Publishing Corporation",
        "Price Starting With ($)": "18.15",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Feng Shui Revealed: An Aesthetic, Practical Approach to the Ancient Art of Space Alignment",
        "Authors": "By Warfield, Gerald and Chin, R. D.",
        "Description": "Complemented by full-color photography, an introduction to the Chinese art of spacial alignment discusses the principles of feng shui, explaining the concepts of ch'i  and Ba Gua in terms of architectural decisions and furniture arrangements.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Anne Tyler: Four Complete Novels",
        "Authors": "By Tyler, Anne",
        "Description": "Four novels center on loving relationships complicated by family tension, struggles, and misunderstandings",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "A Short Guide to Writing About Art (Short Guide Series)",
        "Authors": "By Barnet, Sylvan",
        "Description": "",
        "Category": " Art , Criticism & Theory",
        "Publisher": "Longman Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Hobbes: Leviathan 1 and 2 (Pt. 1 & 2)",
        "Authors": "By Hobbes, Thomas",
        "Description": "Presents the seventeenth century treatise on power and politics",
        "Category": " Philosophy , General",
        "Publisher": "Pearson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "You Must Be Dreaming",
        "Authors": "By Noel, Barbara",
        "Description": "When Barbara Noel first went to Dr. Jules Masserman, he predicted she'd be cured of her performance anxiety within two years. But after six months, he injected her with a barbiturate to help her \"overcome her resistance to the truth\" of what was bothering her. He gave her that drug for the next eighteen years - until the harrowing day she awakened from a drugged sleep to find herself being raped by the man she trusted most.This spellbinding, chilling story tells how a bright, articulate woman spent years under the sway of the cunning psychiatrist who used her for his sexual purposes. Step by riveting step, in a series of revelations about the secret lives of both doctor and patient, Barbara Noel relives her battle to understand herself and to bring Dr. Jules Masserman to justice for his sexual and ethical betrayals.It wasn't an easy battle. Jules Masserman was considered \"Psychiatry's Ambassador to the World.\" As past president of the American Psychiatric Association and the American Academy of Psychoanalysis, as well as chairman of psychiatry at Northwestern University Medical School, he seemed invincible.But Barbara Noel wasn't alone. Jules Masserman had other accusers. Many of them. Nevertheless, Dr. Masserman still categorically denies any wrongdoing and has never been charged with a criminal offense or lost a civil suit, although his insurance company has settled out of court with several of his accusers. An exclusive interview with him is included in the Afterword of this book.From its shocking beginning to its haunting conclusion, You Must Be Dreaming is a suspenseful journey into the psyche of a young woman who fell victim to the hidden, twisted heart of a brilliant and charming man. It is also an important and critical expose of one of medicine's darkest secrets - the rogue doctor who holds raw power over patients he considers little more than human guinea pigs.",
        "Category": " Social Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Why Gay Guys Are a Girl's Best Friend",
        "Authors": "By Carter, Karen Rauch, Fessler, Jeff, and Rauch, Karen",
        "Description": "A collection of illustrations and witty words reveals the sterling qualities that endear gay men to women through a series of humorous contrasts of a gay guy's perspective with that of a straight guy. Original. 35,000 first printing.",
        "Category": " Humor , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Organic Plant Protection",
        "Authors": "By Yepsen, Roger B. (EDT)",
        "Description": "Information and advice on all means of preventing, controlling, and eliminating plant pests and diseases are augmented by alphabetically arranged entries on specific pests and diseases",
        "Category": " Technology & Engineering , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1976"
        }
    },
    {
        "Title": "Business and Legal Forms for Graphic Designers (Business & Legal Forms)",
        "Authors": "By Crawford, Tad and Bruck, Eva Doman",
        "Description": "",
        "Category": " Design , Graphic Arts , General",
        "Publisher": "Allworth Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Amazing Gracie: A Dog's Tale",
        "Authors": "By Dye, Dan, Beckloff, Mark, and Cundiff, Meg (ILT)",
        "Description": "It was love at first sight. Amid the frenzied barking and prancing of a house full of Great Danes, one pup was shivering in the corner. Gracie. But when Dan Dye reached her, she struggled to her feet like a clumsy foal, raised her forehead to his, and announced, as clearly as if she had actually spoken the words, You know I'm the one. Now get me outta here! By turns funny, moving, tender, and inspiring, Gracie's tale is a treat for every dog lover. There is Gracie's first morning, racing around Dan in the snowy yard. Gracie's first determination to prove to her step-sisters, Dottie the Dalmation and Sarah the Black Lab, that she's one of the girls. Gracie's defiant romance with a pint-size charmer named Byron, a Boston Terrier from the wrong side of the fence. Then born of necessity, the eureka moment: When Gracie's delicate constitution starts turning into anorexia, Dan teaches himself how to cook, and in three days is baking her the cookies that will spur her appetite, launch Three Dog Bakery, and transform their lives forever. Courage. Compassion. Kindness. Soul. Tenacity. And joy, above all, joy. These qualities Gracie possessed in abundance, and shared with everyone, human or canine, who had the good fortune to cross her path.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Seasoned Chef",
        "Authors": "By Vergnes, Jean",
        "Description": "The author, a successful chef, describes his career and training, and shares recipes for appetizers, soups, salads, pasta, meat, poultry, fish, sauces, and desserts",
        "Category": " Cooking , Reference",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "The Three Roosevelts: Patrician Leaders Who Transformed America",
        "Authors": "By Burns, James MacGregor and Dunn, Susan",
        "Description": "The first biography to combine the lives of Theodore, Franklin, and Eleanor Roosevelt furnishes a fascinating portrait of the controversial lives of three courageous American leaders who changed the course of twentieth-century history.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Atlantic Monthly Pr",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Word Games",
        "Authors": "By Brandreth, Gyles Daubeney",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Time and the Art of Living",
        "Authors": "By Grudin, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Ticknor & Fields,1988, c1982.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "You Must Be Joking",
        "Authors": "By Michael Green",
        "Description": "",
        "Category": "",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Dear God, If There's a Meaning for Every Word...Is There a Reason for Everything?",
        "Authors": "By Annie Fitzgerald",
        "Description": "",
        "Category": "",
        "Publisher": "Flying Frog Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Max und Moritz (Diogenes-Taschenbuch ; 60/2) (German Edition)",
        "Authors": "By Busch, Willhelm",
        "Description": "",
        "Category": "",
        "Publisher": "Diogenes Verlag",
        "Price Starting With ($)": "6.23",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "A Time to Run: A Novel",
        "Authors": "By Boxer, Barbara and Hayes, Mary-Rose",
        "Description": "A tale of friendship and betrayal, pragmatism and idealism, infighting and spin, the novel opens on the eve of a crucial vote on an ultra-conservative Supreme Court nominee. Senator Ellen Fischer is handed explosive documents that will surely derail the nomination she opposes - if she takes them to the floor of the Senate the next day. Her key staff members are divided: one urges her to go public, since no nomination could withstand such revelations. Another is more cautious - there are other battles to be fought, and this information cannot be verified before the vote takes place. Making matters more complex, the source of the information is Greg Hunter, a journalist with right-wing credentials. Greg is also Ellen's former lover - and the best friend of her beloved husband, Josh, whose own political career was fatally, and suspiciously, cut short.Ellen faces an ethical and practical dilemma: Say nothing, and a dangerous judge will take a seat on the highest court in the land. Speak up, and Senator Fischer's own career may be irreparably jeopardized. In coming to her decision, Ellen is forced to confront truths not just about her present and her future, but also about the mysteries of her past.From student activism on the streets of Berkeley to intrigue deep in the hideaways under the Capitol, A Time to Run is the story of one woman's unexpected rise to political prominence and the difficult choices that come with it. Barbara Boxer, writing with Mary-Rose Hayes, reveals the inner workings of the corridors of power and creates a memorable portrait of what makes people - and our government - tick.",
        "Category": " Fiction , Political",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Best of the Best Vol. 9: The Best Recipes from the 25 Best Cookbooks of the Year",
        "Authors": "By Food & Wine Magazine",
        "Description": "Almost one million subscribers heartily agree: Food & Wine is the unrivaled leader in the field, and every year their editors search tirelessly for the most delectable dishes from the crème de la crème of cookbooks. Here are their selections, along with an extra treat: some special and previously unpublished recipes. It comes to more than 100 fully kitchen-tested, temptingly photographed dishes in all. And the food doesn’t come better than this: FromGrilling for Life, Bobby Flay presents Smoky and Fiery Skirt Steak with Avocado-Oregano Relish. Paula Deen serves up some of her Southern-style Shrimp and Grits (Paula Deen & Friends), while Marc Meyer preparesBrunch (Baked Eggs Rancheros).",
        "Category": " Cooking , General",
        "Publisher": "American Express Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Harper Book of Quotations 3rd Edition",
        "Authors": "By Fitzhenry, Robert I. (EDT)",
        "Description": "More than 6,500 quotations that are sure to suit all occasions--spicing up letters, speeches, and everyday conversations--are included in this easy-to-use reference.",
        "Category": " Reference , General",
        "Publisher": "Collins Reference",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The Fall of the House of Habsburg",
        "Authors": "By Crankshaw, Edward",
        "Description": "The downfall of the Habsburg monarchy was more than just the end of a great and powerful dynasty. It meant the destruction of the old European order and marked a turning point in world history.   Edward Crankshaw’s distinguished study offers a compelling account of the final decades of the Austro-Hungarian Empire, leading up to WWI. At the center of the dramatic events stands the majestic figure of the Emperor Franz Josef, facing the tragedies of his disastrous marriage and the suicide of his only son, and doggedly resisting the ruin of his inheritance. In a sweeping panorama of Vienna, Imperial Russia, Napoleon’s France, Bismarck’s Prussia, and Cavour’s Italy, Crankshaw examines the ambitions and disillusionment that broke the Empire and forged the destiny of the twentieth century.   \"A good book...a superb narrative...trenchant and witty.\" -- The New York Times   \"Sympathetic...scholarly...humane.\" -- Sunday Times",
        "Category": " History , Military , World War I",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Walking through the Wardrobe: A Devotional Quest into The Lion, The Witch, and The Wardrobe",
        "Authors": "By Arthur, Sarah",
        "Description": "Do you hunger for other worlds? Always looking for what's just around the corner? Do you long to go beyond this ordinary life, to find adventure in magical lands like Narnia? The quest is not to be taken lightly. You just may discover there is another Kingdom out there: closer than you realize, as near as your heartbeat, just through that door. Are you ready to take the first step?Join best-selling author Sarah Arthur (Walking with Frodo) as she ventures through the wardrobe with the cast ofThe Chronicles of Narnia: The Lion, The Witch and The Wardrobe in the quest for the true Kingdom.Other notes: Short-cut cover opens to full-color, full-page piece of art.",
        "Category": " Young Adult Nonfiction , Religious , Christian , Devotional & Prayer",
        "Publisher": "Thirsty",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "My Forbidden Face: Growing Up Under the Taliban: A Young Woman's Story",
        "Authors": "By Latifa and Hachemi, Shekeba",
        "Description": "A young Afghanistan woman describes the stark contrast in her life before and after Taliban rule, her witness to its oppressive and terrifying regime,  and her eventual escape with her parents to freedom. First serial, Talk. 75,000 first printing.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Miramax",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Indian Scout Craft and Lore (Native American)",
        "Authors": "By Eastman, Charles A.",
        "Description": "The life of the Indian boy — living close to nature, learning the ways of the wild animals, playing games and learning stories that developed the strength of body and spirit — has long been noted for its ability to develop character. In this book Charles Eastman (\"Ohiyesa\"), a full-blooded Sioux Indian raised as a young warrior in the 1870's and 80's, describes that life — the lessons he learned, games he played, and feelings about life that he developed as he worked to become a young Indian scout.Among the many areas of craft and lore described are the physical training of young boys, making friends with the wild animals, learning the language of footprints, hunting with slingshot and bow and arrow, trapping and fishing, making canoes, setting up camp, building wigwams and other shelters, making fire without matches and cooking without pots, blazing a trail, using Indian signals, gesture language and picture-writing, reading the signs of nature and storytelling, as well as information on winter and summer sports of the Indian boys, names and ceremonies of Indian boys and Indian girls, and the etiquette of the wigwam. Throughout, not only the practices but the reasons and feelings behind them are described. Twenty seven illustrations show many of the crafts and signs described.Scouts and others who enjoy camping and learning the lessons of outdoor life will find in this book not only new ideas but a feeling of life as it was lived by young Indian boys and girls nearly a century ago. In learning the lessons described in this book you will make new discoveries — about nature, about outdoor life, and about yourself.",
        "Category": " Juvenile Nonfiction , Sports & Recreation , Camping & Outdoor Activities",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Ortho's All About Orchids (Ortho's All About Gardening)",
        "Authors": "By Rogers, Marilyn (EDT) and McDonald, Elvin",
        "Description": "Helps beginning orchid growers develop the skills necessary to progress to more difficult ones.Plenty of information to inspire more advanced orchid growers.Provides a basic understanding of optimum environment for growing orchids.Helpful hints for creating that ideal environment.Explains potting, staking, and dividing orchids.Teaches about orchid growth patterns, and shows how to handle plants based on those patterns.",
        "Category": " Gardening , Flowers , Orchids",
        "Publisher": "Ortho",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "A Child's World Infancy Through Adolesence",
        "Authors": "By Papalia, Diane E., Olds, Sally Wendkos, and Feldman, Ruth Duskin",
        "Description": "",
        "Category": " Psychology , Developmental , Adolescent",
        "Publisher": "McGraw-Hill Companies",
        "Price Starting With ($)": "8.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Pathway to Purpose for Women: Connecting Your To-Do List, Your Passions, and God's Purposes for Your Life",
        "Authors": "By Brazelton, Katherine",
        "Description": "For many women, knowing God's five purposes for their lives---worship, fellowship, discipleship, ministry, and evangelism---leads to the natural questions, 'What am I doing in the midst of deadlines, diapers, to-do lists, laundry, and daily schedules? What is the connection between my life purposes and the daily existence I am living now?' In these three companion volumes, Katie Brazelton helps women connect the dots between living amidst the details of their lives and living out God's purposes for their lives. She provides road-tested tools that have become the stepping stones for women along the pathway to living in purpose. Pathway to Purpose for Women: Connecting Your To-Do List, Your Passions, and God's Purposes for Your Life How does a woman live through---see through---the ordinary when she yearns for the significant? This how-to guide, filled with true personal stories, provides stepping stones through the challenges of not only discovering your universal purposes, but also discerning your unique purposes in this life. Praying for Purpose for Women: A Prayer Experience That Will Change Your Life Forever Do you want God to tell you more about his specific plan for your life? This 60-day prayer experience will guide you to ask God to mentor you in your life's purposes. Included are insights from modern-day role models, examples of biblical characters, specific questions to ask yourself and to seek God's answers, and an eye-opening analysis of your life patterns and purposes. Conversations on Purpose for Women: Ten Appointments That Will Change Your Life Forever Designed to be used with a Purpose Partner, this workbook is filled with conversation starters, Scripture verses, questions, and specific self-assessment exercises to help you uncover God's Dream for your life, moving you from an initial sneak preview to the most challenging steps you will want to take on your journey toward purpose-filled living. Consumers may purchase Pathway to Purpose or Praying for Purpose independently of the other. Conversations on Purpose should be sold as a companion book to Pathway to Purpose.",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Permanent Peace: How to Stop Terrorism and War - Now and Forever",
        "Authors": "By Robert M. Oates",
        "Description": "",
        "Category": "",
        "Publisher": "Institute of Science, Technology & Public Policy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Shadows Of A Princess: An Intimate Account by Her Private Secretary",
        "Authors": "By Jephson, P. D.",
        "Description": "The former personal secretary to Princess Diana chronicles his eight years of service to her in an insider's account that examines Diana's life during her years of greatest fame and deepest personal crisis.",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Live Your Dream: Discover and Achieve Your Life Purpose : A Step-By-Step Program",
        "Authors": "By Chapman, Joyce",
        "Description": "Shows how to use recently added general utilities, and to structure programs in the multifinder environment",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Newcastle Pub Co Inc",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Justice Overruled: Unmasking the Criminal Justice System",
        "Authors": "By Katz, Burton S.",
        "Description": "A criminal court judge reveals recent abuse and misuse of justice in the American criminal justice system--such as why winning has become more important that truth--and presents suggestions for reform. Tour.",
        "Category": " Law , Criminal Law , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Paradoxes of Fame: The Francis Scott Key Story",
        "Authors": "By Meyer, Sam",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "Eastwind Pub",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Twice Dead",
        "Authors": "By Sullivan, Eleanor",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Hilliard & Harris",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Irresistible Impulse",
        "Authors": "By Tanenbaum, Robert K.",
        "Description": "As the head of the New York District Attorney's homicide bureau, Butch Karp is an intimate of cops and criminals, of judges, politicians, and the meanest streets of America. He is also a loving family man. Juggling these two lives, Karp sometimes dares to think he's gotten everything he's ever wanted in life. It all comes undone when his loved ones are touched by the incendiary power of human obsession.It's the obsession of a man stalking a world-famous musician. It's the obsession of Karp's own office, where ambitious lawyers vie for the most high-profile cases, and where Karp goes up against one of the most brilliant defense attorneys in America in a murder trial laced with racial overtones. It's the obsession of Butch's wife, Marlene, whose detective agency specializes in domestic violence and who carries a Colt .380 to protect herself and her clients. But neither Butch nor Marlene realize that they are about to become flash points in two of the hottest controversies to rock the city in years.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Women: A Feminist Perspective",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Mayfield Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Progressive Years; the Spirit and Achievement of American Reform",
        "Authors": "By pease, otis",
        "Description": "",
        "Category": "",
        "Publisher": "G. Braziller",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "A Valley in Italy",
        "Authors": "By De Teran, Lisa st Aubin",
        "Description": "Of all the romantic obsessions in novelist Lisa St Aubin de Teran's life, the search for a castle occupied her the longest--until she saw the magnificent Villa Orsola deep in the Umbrian hills. Only after eagerly signing the ownership papers did she and her husband, painter Robbie Duff-Scott, discover they were the owners of a vast ruin lacking windowpanes, parts of the roof, and other essentials. A Valley in Italy recounts its restoration in the grand style of impossible house and the charms of bohemian family life. It also offers a rare portrait of the life of a. Italian village, where \"all things are made to be as enjoyable as possible.\" \" Lisa St Aubin de Teran's intuitive sense of place, her affection for the people around her, and her appreciation for native Italian grace make this a memorable book that can stand beside the best accounts of Italian life.",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Best Maine Stories: A Century of Short Fiction, by Sarah Orne Jewett, Ben Ames Williams, Carolyn Chute, and Others",
        "Authors": "By Greenberg, Martin, Waugh, Charles G., and Phippen, Sanford",
        "Description": "",
        "Category": " Fiction , Historical , General",
        "Publisher": "Down East Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Cold Mountain: A Novel",
        "Authors": "By Frazier, Charles",
        "Description": "NOW A MAJOR MOTION PICTUREOne of the most acclaimed novels in recent memory, Charles Frazier's Cold Mountain is a masterpiece that is at once an enthralling adventure, a stirring love story, and a luminous evocation of a vanished American in all its savagery, solitude, and splendor.  Sorely wounded and fatally disillusioned in the fighting at Petersburg, Inman, a Confederate soldier, decides to walk back to his home in the Blue Ridge Mountains and to Ada, the woman he loved there years before.  His trek across the disintegrating South brings him into intimate and sometimes lethal converse with slaves and marauders, bounty hunters and witches, both helpful and malign.  At the same time, Ada is trying to revive her father's derelict farm and learn to survive in a world where the old certainties have been swept away.  As it interweaves their stories, Cold Mountain asserts itself as an authentic American Odyssey--hugely powerful, majestically lovely, and keenly moving.",
        "Category": " Fiction , Historical",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Tootle and Kathy Caboose: A special treasure (Little Golden Book land)",
        "Authors": "By Ingoglia, Gina",
        "Description": "",
        "Category": "",
        "Publisher": "Western Pub. Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Light Bearer",
        "Authors": "By Gillespie, Donna and Gissespie, Donna",
        "Description": "On the day of her birth, Auriane received a mysterious amulet from a priestess-and a doubleedged prophecy of doom and glory. The daughter of a Germanic tribal chieftain, Auriane witnessed unspeakable horrors committed against her people by ruthless invaders. And when tragedy tore her family apart, she took the oath of a warrior, and vowed revenge. Tales of her brilliant swath of conquest carried as far as Rome, to the renowned statesman Marcus Julianus-who felt his destiny intertwined with Auriane's, and wore about his neck an identical amulet",
        "Category": " Fiction , Historical",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "John Grimes: Survey Captain",
        "Authors": "By Chandler, A. Bertram",
        "Description": "",
        "Category": "",
        "Publisher": "The Science Fiction Book Club",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Pre-Calculus Super Review",
        "Authors": "By Research and Education Association (COR) and Fogiel, M. (EDT)",
        "Description": "Get all you need to know with Super Reviews! Each Super Review is packed with in-depth, student-friendly topic reviews that fully explain everything about the subject. The Pre-Calculus Super Review includes sets, numbers, operations and properties, coordinate geometry, fundamental algebraic topics, solving equations and inequalities, functions, trigonometry, exponents and logarithms, conic sections, matrices, and determinants. Take the Super Review quizzes to see how much you've learned - and where you need more study. Makes an excellent study aid and textbook companion. Great for self-study!DETAILS- From cover to cover, each in-depth topic review is easy-to-follow and easy-to-grasp - Perfect when preparing for homework, quizzes, and exams!- Review questions after each topic that highlight and reinforce key areas and concepts- Student-friendly language for easy reading and comprehension- Includes quizzes that test your understanding of the subject",
        "Category": " Mathematics , Calculus",
        "Publisher": "Research & Education Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The Journey to Inner Peace",
        "Authors": "By Feider, Paul A",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Ave Maria Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "The Washington Post Garden Book: The Ultimate Guide to Gardening in Greater Washington and the Mid-Atlantic Region",
        "Authors": "By Davis, Susan, Garden, The Year-Round",
        "Description": "",
        "Category": "",
        "Publisher": "Washington Post Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The Dragon on the Border",
        "Authors": "By Dickson, Gordon R.",
        "Description": "Chronicles the adventures of Sir James, the Dragon Knight, as he battles the Hollow Men, vengeful spirits of the dead that appear as hollow suits of armor and that can regenerate themselves",
        "Category": " Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "D-Day (Turning Points in History)",
        "Authors": "By Gilbert, Martin",
        "Description": "\"The Allied landings in 1944 had all the prospects for disaster. Churchill thought he would be woken up to be told of massive casualties. Eisenhower prepared a somber broadcast announcing that the enterprise had failed.    The specter of failure was always present. After a failed landing the Nazi regime would have regained the ascendant. New, terrifying bombs and rockets were ready to be launched. Long-distance submarines were in the final stage of development. The last million Jews of Europe were listed for deportation and death.    Failure at Normandy could have given Hitler the chance of continuing to rule western Europe, particularly if the United States, bloodied and defeated in Normandy, had decided-after two and a half years of focusing on Europe-to turn all its energies to the ever-growing demands of the Pacific, leaving Europe to its own devices. Had that happened, I doubt if I would have been alive to write this book, or free to express my opinions without fear of arrest.\"  --Martin Gilbert",
        "Category": " History , Military , World War II",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Making Money on Wall Street",
        "Authors": "By Heady, Christy",
        "Description": "",
        "Category": "",
        "Publisher": "Alpha Books",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Consultation-Liaison Psychiatry and Behavioral Medicine (Psychiatry Series, Vol 3)",
        "Authors": "By Houpt, Jeffrey L. (CON)",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Lippincott Williams & Wilkins",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Lawnscaping: Shape the Perfect Landscape Around Your Lawn",
        "Authors": "By Scotts Books (EDT) and Schrock, Denny (EDT)",
        "Description": "Inspirational, lawn-centered landscape images.Practical how-to for shaping landscapes that emphasize the lawn as a backdrop.Step-by-step makeovers to create innovative lawnscapes. Instructions to plan, develop, and maintain a healthy lawn.Ideas to organize yard spaces to support activities desired.",
        "Category": " Gardening , Lawns",
        "Publisher": "Scotts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Jan Cremer Write Again",
        "Authors": "By Cremer, Jan",
        "Description": "",
        "Category": "",
        "Publisher": "Grove",
        "Price Starting With ($)": "14.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Book of Miniatures: Furniture and Accessories (The Chilton Miniature Series)",
        "Authors": "By Ruthberg, Helen",
        "Description": "Exact-size patterns, photographs, and line drawings supplement directions for creating miniature wall accessories, lighting fixtures, plants, fireplaces, floor and wall coverings, sofas, chairs, beds, dressers, and tables for dollhouses",
        "Category": " Art , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1977"
        }
    },
    {
        "Title": "Flavors",
        "Authors": "By McLaughlin, Michael and Morgan, Pamela",
        "Description": "The owner of a popular gourmet catering shop in New York City and the co-author of The Silver Palate Cookbook present seasonal recipes for simple, hearty cuisine from Texas to Tuscany, with shopping tips and more. 30,000 first printing.",
        "Category": " Cooking , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Grace at the Table: Ending Hunger in God's World",
        "Authors": "By Beckmann, David and Simon, Arthur",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Paulist Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "The Essential America: Our Founders and the Liberal Tradition",
        "Authors": "By McGovern, George",
        "Description": "Liberalism is the oldest and most enduring American tradition, a philosophy and way of life we inherited from the Founding Fathers. This is the central idea of The Essential America by George McGovern, America's best-known (and most consistent) liberal.Referring us to our moral and spiritual foundations, McGovern not only presents a resounding defense of liberalism as \"the most practical and hopeful compass to guide the American ship of state\" but offers specific proposals for keeping the tradition vibrant. The Essential America proposes programs for feeding the world's malnourished children. Rather than sending our armies abroad, McGovern spells out policies that confront the causes of terrorism. He proposes cutting our military budget (echoing Dwight D. Eisenhower's powerful warning about the military-industrial complex). He condemns preemptive war, criticizes tax cuts for the rich, and warns against government for the powerful minority. Americans have traditionally stood for progress, generosity, tolerance, and protection of the needy, McGovern states -- as well as for multi- lateralism in foreign policy and \"a decent respect for the opinions of mankind.\" He reminds us that while creative tension between liberalism and conservatism is the genius of American politics, it is the liberals who have been responsible for every forward step in our national history. They built \"the Essential America.\"",
        "Category": " History , United States , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Whistle While You Work: Heeding Your Life's Calling",
        "Authors": "By Leider, Richard J. and Shapiro, David A.",
        "Description": "Everyone has a calling with a unique purpose to fulfill in the world. Heeding it is about deliberately choosing a way of life and work consistent with individual gifts, passions, and values. Through powerful stories and a guided exploration of 52 possible callings, Whistle While You Work helps readers discover how to make a living doing what they were born to do. The authors provide a framework for embracing a very abstract subject in a systematic, practical, and fun way. And their Calling Cards \"\"TM\"\" help readers develop answers to profound life questions as they learn to \"\"listen with the third ear\"\" to cultivate a mode of searching that isn't limited to the merely tangible.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Until I Find You: A Novel",
        "Authors": "By Irving, John",
        "Description": "Until I Find You is the story of the actor Jack Burns – his life, loves, celebrity and astonishing search for the truth about his parents. When he is four years old, Jack travels with his mother Alice, a tattoo artist, to several North Sea ports in search of his father, William Burns. From Copenhagen to Amsterdam, William, a brilliant church organist and profligate womanizer, is always a step ahead – has always just departed in a wave of scandal, with a new tattoo somewhere on his body from a local master or “scratcher.”Alice and Jack abandon their quest, and Jack is educated at schools in Canada and New England – including, tellingly, a girls’ school in Toronto. His real education consists of his relationships with older women – from Emma Oastler, who initiates him into erotic life, to the girls of St. Hilda’s, with whom he first appears on stage, to the abusive Mrs. Machado, whom he first meets when sent to learn wrestling at a local gym. Too much happens in this expansive, eventful novel to possibly summarize it all. Emma and Jack move to Los Angeles, where Emma becomes a successful novelist and Jack a promising actor. A host of eccentric minor characters memorably come and go, including Jack’s hilariously confused teacher the Wurtz; Michelle Maher, the girlfriend he will never forget; and a precocious child Jack finds in the back of an Audi in a restaurant parking lot. We learn about tattoo addiction and movie cross-dressing, “sleeping in the needles” and the cure for cauliflower ears. And John Irving renders his protagonist’s unusual rise through Hollywood with the same vivid detail and range of emotions he gives to the organ music Jack hears as a child in European churches. This is an absorbing and moving book about obsession and loss, truth and storytelling, the signs we carry on us and inside us, the traces we can’t get rid of. Jack has always lived in the shadow of his absent father. But as he grows older – and when his mother dies – he starts to doubt the portrait of his father’s character she painted for him when he was a child. This is the cue for a second journey around Europe in search of his father, from Edinburgh to Switzerland, towards a conclusion of great emotional force.A melancholy tale of deception, Until I Find You is also a swaggering comic novel, a giant tapestry of life’s hopes. It is a masterpiece to compare with John Irving’s great novels, and restates the author’s claim to be considered the most glorious, comic, moving novelist at work today.",
        "Category": " Fiction , Literary",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Pearl Diver: A Novel",
        "Authors": "By Talarigo, Jeff",
        "Description": "In 1948, a nineteen-year-old Japanese pearl diver is in her fourth season of perfecting the techniques of her age-old occupation. But her dreams of spending her life diving in the waters of the Inland Sea are shattered when she discovers that she has leprosy. She knows that the shame attached to the disease is inescapable: rejection by her family is imminent, exile unavoidable. No more than two months elapse before authorities send her off to a leprosarium on the island of Nagashima, and although it is only seven miles from her home, it is a world away from all that is familiar to her. At once, she is instructed to forget her past, to strike her name from the koseki, the family register, and ordered to choose a new name.As \"Miss Fuji\" looks around her, she sees her own future in the debilitated bodies and the lives of more than two thousand other patients. But her \"future\" never comes; her own case of leprosy remains a mild one owing to the discovery of a medicine that impedes the disease's progression in its victims. Yet she is not permitted to leave Nagashima, and over time, she wonders whether she could even survive back on the mainland. In the end, it is her constant connection to the sea and her moving encounters with those around her - a writer, a Korean storyteller, a gardener, a tanka poet, an urn painter - that give her insight into her own true nature and the deep wellspring of courage she needs to reclaim her freedom.",
        "Category": " Fiction , General",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Casino Gambling: The Ultimate Play-To-Win Guide",
        "Authors": "By Gros, Roger",
        "Description": "Discusses casino psychology, odds and odds making, and the rules and strategies for playing baccarat, blackjack, craps, poker, roulette, slots, and video poker",
        "Category": " Games , General",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "First Zen Reader",
        "Authors": "By Leggett, Trevor P.",
        "Description": "",
        "Category": "",
        "Publisher": "Charles E. Tuttle Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "Earthly Powers",
        "Authors": "By Burgess, Anthony",
        "Description": "An exploration of the very essence of power centers on two men who represent different types of earthly power--one an eminent novelist and well-known homosexual, the other a man of God who rises through the Vatican hierarchy",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1980"
        }
    },
    {
        "Title": "One Year Book of Josh McDowell's Youth Devotions 2 (Beyond Belief Campaign)",
        "Authors": "By McDowell, Josh",
        "Description": "Josh McDowell’s Beyond Belief message is the foundation to launch a spiritual revolution among youth. This is a revolution to equip churches and families to raise up a generation of the cross—young people who have been transformed by Christ and the cross, who are empowered to live crossgrain to the culture and are committed to share Christ across all cultures. Sixteen stand-alone products make up an entire family of resources that churches need to launch a church-wide revolution. These products are directed to every age group from 5 to 105, and help equip church groups and families with the tools to lead their children and youth to become transformed, passionate followers of Christ. In this second installment of Josh’s best-selling youth devotions, Josh provides 365 daily encounters with the one true God who is beyond our belief in love and grace.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Tyndale Kids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Leo Buscaglia's Love Cookbook",
        "Authors": "By Buscaglia, Leo F. and Caggiano, Biba",
        "Description": "Offers 115 simple, easy, and quick recipes along with suggestions for romantic meals for two, or loving meals for the whole family",
        "Category": " Cooking , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Irish Girls About Town",
        "Authors": "By Keyes, Marian, Kelly, Cathy, and Binchy, Maeve (EDT)",
        "Description": "Ah go on...tell us.  New York Times bestselling authors Maeve Binchy and Marian Keyes top an impressive roster of the Emerald Isle's most popular women writers and prove that when it comes to spinning a good yarn, the Irish are the best in the business. Showcasing dazzling wit and remarkable insight in short stories that run the gamut from provocative to poignant, these Irish women will tug at your heartstrings and have you crying with laughter in no time.  She did what?!  In Maeve Binchy's \"Carissima,\" a longtime ex-pat and free spirit returns to Ireland from Sicily and shakes things up for her family, who finds her life utterly scandalous. In \"Soulmates,\" by Marian Keyes, one woman's relationship is so bleedin' perfect in every way that it's driving her friends up the wall. In Cathy Kelly's \"Thelma, Louise and the Lurve Gods,\" two women on a madcap, Stateside road trip have completely opposite reactions to a pair of insanely good-looking men. In these stories, and throughout this fabulous collection, Ireland's finest women authors celebrate the joys and perils of love, the adventure and constancy of female friendships, and their own irresistible brand of Irish charm.",
        "Category": " Fiction , Literary",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "The Living Trust: The Failproof Way to Pass Along Your Estate to Your Heirs Without Lawyers, Courts, or the Probate System",
        "Authors": "By Abts, Henry W., III",
        "Description": "The complete guide to the living trust covers beneficiaries, the Catastrophic Illness Trust, unmarried partners, handicapped protection, the disinherited child, and much more. Original.",
        "Category": "",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Marriage Most Scandalous",
        "Authors": "By Lindsey, Johanna",
        "Description": "With the dazzling blend of romance, humor, and poignant storytelling that has made her one of the world's best-loved authors, Johanna Lindsey presents the passionate Regency-era tale of an earl's daughter who dares to pose as the wife of a deadly mercenary in order to save her former guardian.Lady Margaret Landor first met Sebastian Townshend as a child, when he caught her peeking into her older sister's engagement ball. Tall, dashing, and charming, Sebastian was one of the most sought-after bachelors in Kent and cut a romantic figure she would not soon forget. Never did she dream that one day she would be living at his family's magnificent estate with Sebastian's father, the eighth Earl of Edgewood, as her guardian--while Sebastian is banished from his family due to the tragic results of a duel.When life at Edgewood takes a sinister turn with the earl suffering a suspicious number of life-threatening accidents, Margaret wonders if Sebastian's younger brother and his wife have grown impatient to inherit the earldom. Setting out to find the one man she believes can set the situation to rights, she discovers that Sebastian Townshend has forged a new identity for himself on the continent.Now known as The Raven, a deadly mercenary, notorious for accomplishing any mission no matter how seemingly impossible, he has vowed never to return to England. Not until Margaret meets his outrageous monetary demands does Sebastian agree to return home, reluctantly posing as her husband in order to facilitate his return to society. When he learns she cannot afford to pay his fee, he suggests a scandalous trade. As Margaret and Sebastian work to uncover the intrigue at his father's estate, a fierce passion blooms that neither of them anticipated and neither can resist. But can Margaret persuade Sebastian to abandon the dark path he believes is his fate and claim the life--and love--he deserves? Breathtaking in scope and wondrously passionate, Marriage Most Scandalous is Johanna Lindsey at her finest.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Disappearances",
        "Authors": "By Wiser, William",
        "Description": "",
        "Category": "",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "WP23 - Bastien Piano Library Piano Solos Level 1",
        "Authors": "By Jane Bastien",
        "Description": "",
        "Category": "",
        "Publisher": "Kjos Music Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "My Name Escapes Me: The Diary of a Retiring Actor",
        "Authors": "By Guinness, Alec",
        "Description": "Best known for his roles in films as varied as Lawrence of Arabia and Star Wars, Guinness is one of the most distinguishedand beloved - movie actors of his generation. His charmingly sincere diary entries offer a glimpse of the private side of his often very public life.What makes Guinness a fine and versatile actor is precisely what also makes him a good diarist: an ironically observant eye. In his diary, which covers the eighteen months from January 1995 to June 1996, he reveals the inner life of a hugely successful actor while remaining completely accessible. This work is, at the same time, a poignant account of a man coming to terms with being eighty-two and its accompanying infirmities and a delightfully humorous record of his extemporaneous opinions and careful reflections. Certain interests and preoccupations recur: theater and films, of course, but also books and paintings; the church, sometimes held up for amused observation, more often the focus of a personal faith; food and drink, whether fish 'n' chips with a group of fellow actors or a solitary entrecote at the Connaught; and the delights of being at home with his wife in the Hampshire countryside.Though Guinness shows a keen interest in contemporary events and culture (such as taking a perhaps surprising pleasure in the Wallace and Gromit cartoons), he also brings to the diary some fascinating anecdotes from his long and distinguished acting career and new tales of his current friendships.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Color of Water: A Black Man's Tribute to His White Mother",
        "Authors": "By McBride, James",
        "Description": "A young African-American man describes growing up in an all-black Brooklyn housing project, one of twelve children of a white mother and black father, and discusses his mother's contributions to his life and coming to terms with his confusion over his own identity. Reissue.",
        "Category": " Social Science , Discrimination & Race Relations",
        "Publisher": "Riverhead Trade",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "The Real Mother Goose",
        "Authors": "By Checkerboard Press",
        "Description": "",
        "Category": "",
        "Publisher": "Checkerboard Press",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Voyage of the Narwhal: A Novel",
        "Authors": "By Barrett, Andrea",
        "Description": "Capturing a crucial moment in the history of exploration—the mid-nineteenth century romance with the Arctic—Andrea Barrett's compelling novel tells the story of a fateful expedition. Through the eyes of the ship's scholar-naturalist, Erasmus Darwin Wells, we encounter the Narwhal's crew, its commander, and the far-north culture of the Esquimaux. In counterpoint, we meet the women left behind in Philadelphia, explorers only in imagination. Together, those who travel and those who stay weave a web of myth and mystery, finally discovering what they had not sought, the secrets of their own hearts.",
        "Category": " Fiction , Historical , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Bedford Square",
        "Authors": "By Perry, Anne",
        "Description": "For most Londoners, great houses were inscrutable bastions of privilege and power. All the more shocking then was the freshly dead body sprawled on the Bedford Square doorstep of General Brandon Balantyne - an affront to every respectable sensibility.The general denies all knowledge of the bloody-knuckled, shabbily dressed victim who has so rudely come to death outside his home. But Superintendent Thomas Pitt of Bow Street Police Station cannot believe him. For in the dead man's pocket he finds a rare snuffbox that recently graced the general's study. He must tread lightly, however, lest his investigation trigger a tragedy of immense proportions, ensnaring honorable men like flies in a web of terror. Pitt's clever wife, Charlotte, becomes his full partner in probing this masterpiece of evil, spawned by an amorality greater than they can imagine.",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Winterthur's Culinary Collection: A Sampler of Fine American Cooking",
        "Authors": "By Coleman, Anne Beckley (COM)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Univ of Virginia Pr",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "The Hungry Self: Women, Eating, Identity",
        "Authors": "By Chernin, Kim",
        "Description": "Argues that the incidence of eating disorders among women today is a symptom of an identity crisis that is intergenerational and the result of the increased opportunities of and demands on women",
        "Category": "",
        "Publisher": "Perennial Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Misanthrope and Other Plays: A New Selection (Penguin Classics)",
        "Authors": "By Moliere, Wood, John (TRN), and Coward, David (TRN)",
        "Description": "Molière (1622-73) combined all the traditional elements of comedy—wit, slapstick, spectacle and satire—with a deep understanding of character to create richly sophisticated dramas which have always delighted audiences. Most are built around dangerously deluded and obsessive heroes such as The Would-Be Gentleman and The Misanthrope who threaten to blight the lives of those around them. Such Foolish Affected Ladies and Those Learned Ladies (both newly translated for this edition) expose the extravagant, fashionable fads and snobbery of the Parisian smart set, while the story of the falsely devout Tartuffe and his devoted disciple Orgon attracted huge controversy for its attack on religious hypocrisy. Finally, The Doctor Despite Himself forms a hilarious chapter in Molière's long-standing vendetta against the medical profession. Like Shakespeare, Molière was a true man of the theatre whose comedies blend sharp insight into human nature with an unerring sense of what would work on stage and make people laugh. All his greatest achievements are included here and in the accompanying Penguin Classics volume, The Miser and Other Plays.For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " Drama , European , General",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Fundamentals of Database Systems",
        "Authors": "By Elmasri, Ramez and Navathe, Shamkant B.",
        "Description": "",
        "Category": " Computers , Computer Science",
        "Publisher": "Addison-Wesley Pub (Sd)",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    }
]