[
    {
        "Title": "Happy Birthday, Kit! (American Girl Collection)",
        "Authors": "By Tripp, Valerie, McAliley, Susan (ILT), and Rane, Walter (ILT)",
        "Description": "As her tenth birthday approaches, Kit knows that there won't be a party since her father doesn't have a job and money is tight, but when her Aunt Millie comes to visit, her thriftiness and good ideas make for an excellent birthday celebration! Simultaneous.",
        "Category": " Juvenile Fiction , Historical , United States , 20th Century",
        "Publisher": "American Girl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Good Dog",
        "Authors": "By Avi",
        "Description": "When the Wild Calls  McKinley, a malamute, is a good dog -- he's reliable and trustworthy. Whether it's watching over the other dogs of Steamboat Springs, Colorado, or taking care of his human pup, Jack, McKinley never even thinks of letting anyone down -- until he meets Lupin. Lupin is a she-wolf and she's urging the dogs of Steamboat Springs to leave their domesticated lives and join her wild pack. And though she scares McKinley, he also finds himself drawn to her and the life of freedom that she offers.  For the first time, McKinley's loyalties are torn. Should he stay with his humans and continue to lead the dogs of Steamboat Springs? Or should he join the wolf and live freely, like his ancestors did? When the wild calls, what will McKinley's answer be?",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Changes For Kit (American Girl Collection)",
        "Authors": "By Tripp, Valerie, McAliley, Susan (ILT), and Rane, Walter (ILT)",
        "Description": "In 1934, during the Depression, Kit's cantankerous uncle comes to live in the Cincinnati boardinghouse run by her parents, enlisting her aid in transcribing his complaining letters to the editor of the local newspaper and inspiring her to write a different kind of letter of her own.In 1934, during the Depression, Kit's cantankerous uncle enlists her aid in transcribing his complaining letters to the editor of the local newspaper, inspiring her to write a different kind of letter of her own.",
        "Category": " Juvenile Fiction , Historical , United States , 20th Century",
        "Publisher": "American Girl",
        "Price Starting With ($)": "11.55",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Legend of the Donkey's Cross: An Easter Story",
        "Authors": "By Buck-Glenn, Judy",
        "Description": "According to legend, before Jesus died all donkeys were just plain gray. Ever since the donkey brought Jesus to Jerusalem, donkeys have a cross on their backs. This story reminds us of Jesus’ courage and his love for us all. In this gentle story, Rachel learns about Jesus’ courage and by following his example learns to conquer her fears.",
        "Category": "",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "This Little Baby's Morning",
        "Authors": "By Morris, Ann, Breeze, Lynn, Breeze, Lynn (ILT), and Morris, Ann (ILT)",
        "Description": "A toddler begins her morning with a wash and breakfast",
        "Category": "",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Saddam's Secrets: How an Iraqi General Defied & Survived Saddam Hussein",
        "Authors": "By Black, Jim Nelson and Sada, Georges",
        "Description": "Georges Sada was one of Saddam's top generals and foremost military advisors. A truth-teller in a government that made the truth dangerous. A devout Christian in a Muslim country. And a man who would stand up for what was right?even at the risk of his own life.In this eye-opening exposé, General Sada shares his bizarre yet amazing journey as an insider to one of history's most sinister regimes. He also, for the first time, reveals the disturbing truth about Saddam's plots to destroy Israel, hide weapons of mass destruction and overtake the Arab world. As an eye witness to history, Sada paints a painfully truthful picture of Hussein and his country that is at once personal and alarming, truthful and compelling, candid and sobering. It is a story guaranteed to send shock waves around the world.",
        "Category": " Religion , Inspirational",
        "Publisher": "Integrity Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "It's So Much Work to Be Your Friend: Helping the Child with Learning Disabilities Find Social Success",
        "Authors": "By Lavoie, Richard",
        "Description": "As any parent, teacher, coach, or caregiver of a learning disabled child knows, every learning disability has a social component. The ADD child constantly interrupts conversations and doesn't follow directions. The child with visual-spatial issues loses his belongings and causes his siblings to be late to school. The child with paralinguistic difficulties appears stiff and wooden because she fails to gesture when she talks. These children are socially out of step with their classmates and peers, and often they are ridiculed or ostracized for their differences.  A successful social life is immeasurably important to a child's happiness, health, and development, but until now, no book has provided practical, expert advice on helping learning disabled children achieve social success.For more than thirty years, Richard Lavoie has lived with and taught learning disabled children. His bestselling PBS videos, including How Difficult Can This Be?: The F.A.T. City Workshop, and his sellout lectures and workshops have made him one of the most popular and respected experts in the field. At last, Rick's pioneering techniques for helping children achieve a happy and successful social life are available in book form.It's So Much Work to Be Your Friend offers practical strategies to help learning disabled children ages six through seventeen navigate the treacherous social waters of their school, home, and community. Rick examines the special social issues surrounding a wide variety of learning disabilities, including ADD and other attentional disorders, anxiety, paralinguistics, visual-spatial disorders, and executive functioning. Then he provides proven methods and step-by-step instructions for helping the learning disabled child through almost any social situation, including choosing a friend, going on a playdate, conducting a conversation, reading body language, overcoming shyness and low self-esteem, keeping track of belongings, living with siblings, and adjusting to new settings and situations.  Perhaps the most important component of this book is the author's compassion.  It comes through on every page that Rick feels the intensity with which children long for friends and acceptance, the exasperation they can cause in others, and the joy they feel in social connection. It's So Much Work to Be Your Friend answers the most intense yet, until now, silent need of the parents, teachers, and caregivers of learning disabled children -- or anyone who is associated with a child who needs a friend.",
        "Category": " Education , Special Education , Learning Disabilities",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Better Homes and Gardens Bird Buddies (Fun-to-do Project Books)",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Shares recipes, games and ideas for things to make, including rainbow paper birds, bird hats and whirling paper birds",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Phonics Practice Reader: Welcome Home, Level 1 (Collections)",
        "Authors": "By Various",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "We Are Their Heaven: Why the Dead Never Leave Us",
        "Authors": "By DuBois, Allison",
        "Description": "What happens to our loved ones when they die? Is there a heaven? Is there a true connection and communication between the living and the dead?With the success of the television series Medium and her first book, Don't Kiss Them Good-bye, millions of people have embraced Allison, her story, and her remarkable gift. The idea for We Are Their Heaven was born out of the pieces of communication that Allison received from the spirits who touched her over her years as a medium. In this book, she helps people to understand that we are so special to those who have died that they choose to remain with us, not because they're bound but because we are their happiness, we are their heaven.Now Allison brings readers into her psychic experiences. As we walk the continuum of life and death with her and meet the people whose lives she has touched, we feel the pain of loss and are at once saddened and then renewed by her experiences and the stories of loss and connection. Each chapter focuses on a different type of loss -- parents, children, friends, and spouses who have lost loved ones through accidents, murder, suicide, and illness.Throughout the book, people who have had readings with Allison share their experiences and the significance of their readings. They take us into their confidence and share the unique details, identifying the calling cards of the dead, the initial private piece of information that convinced them that they were communicating directly with their loved ones. Allison, in turn, takes us through the same readings and describes exactly what was delivered and how it was conveyed. She convinces us that an essential part of communicating with the deceased is learning how to read both their signs (the message) and their signature (the unique information). Through Allison's eyes, we see that the dead are trying to reach their living loved ones all the time. She explores timing, coincidence, auditory and sensory communications, dreams, visions, incident manipulation, and streaming events to affirm their attempts. Allison presents the riveting details of her communications -- what she hears, sees, and feels. Allison's desire to help these two worlds connect makes us want to reach out to her and at the same time fear for her. She shares her daily struggle of living with layers of information that few of us have about others and the world around us. Much like her character on the show, she often struggles with knowing when to intervene and when to keep her knowledge to herself.If you miss someone you love, take comfort in the fact that through the thousands of readings that Allison has done, no one has come through to say \"good-bye\" but rather to say \"hello again.\"",
        "Category": " Body, Mind & Spirit , Parapsychology , ESP (Clairvoyance, Precognition, Telepathy)",
        "Publisher": "Fireside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The People's Business: Controlling Corporations and Restoring Democracy",
        "Authors": "By Drutman, Lee, Cray, Charlie, and Nader, Ralph (FRW)",
        "Description": "Giant corporations wield excessive influence over our lives, often with frightening consequences: environmental destruction, political corruption, increased polarization of wealth, and stagnating wages and benefits. The rampant epidemic of accounting fraud, tax avoidance, outsourcing and war  profiteering in recent  years  has reconfirmed the widespread conviction that corporations are getting increasingly out of control, with potentially dangerous consequences for the communities where they operate, their own employees and even for their owners, the shareholders.  The People’s Business tells us what we can do to fight back. Drutman and Cray show how corporations achieved their current privileged position and offer a comprehensive approach for reforming them so that they serve as engines of public prosperity, rather than as the tools of private plunder. They present recommendations from the prestigious members of the Citizen Works Commission on Corporate Reform—which includes such notable members as Ralph Nader, David Korten, Herman Daly, Medea Benjamin, and many others—to outline a clear-headed plan of action to: Get corporations out of politics Establish truly public-minded regulation of corporate behavior Combat unfair market domination by a handful of large corporations Crack down on corporate crime Challenge the corporate claim to constitutional rights Bolstered with relevant history and recent examples, The People’s Business details immediate measures for effectively reforming the corporation.",
        "Category": " Political Science , Political Ideologies , Democracy",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "A Time for Freedom",
        "Authors": "By Cheney, Lynne V.",
        "Description": "\"No one can fully appreciate the great fortune we have to be Americans without knowing the events that brought us to where we are today.\"  -- Lynne Cheney  Did you know that John Adams thought we would celebrate America's birthday on the second of July? That ten generals went on to become president? That our country has had nine different capitals, including Trenton, New Jersey, and Annapolis, Maryland?  Bestselling author and historian Lynne Cheney takes readers through America's story of freedom in this timeline of key moments in our history along with historic quotatons by great Americans and little-known facts about our country. Starting with our nation's beginnings, A Time for Freedom places the great events and figures of our history into context and shows the expansion of freedom in America. Filled with fascinating information that creates a textured journey through our nation's story, A Time for Freedom is a book that every family will want to share.",
        "Category": " Juvenile Nonfiction , History , United States , General",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "No Place Like Home: A Novel",
        "Authors": "By Clark, Mary Higgins",
        "Description": "In a riveting new thriller from America's Queen of Suspense, a young woman is ensnared into returning to a place she had wanted to leave behind forever -- her childhood home. There, at the age of ten, Liza Barton had shot her mother, trying desperately to protect her from her estranged step-father, Ted Cartwright. Despite his claim that the shooting was a deliberate act, the Juvenile Court ruled the death an accident. Many people, however, agreed with Cartwright, and the tabloids compared her to the infamous murderess Lizzie Borden, pointing even to the similarity of their names.  To erase Liza's past, her adoptive parents change her name to Celia. At age twenty-eight, a successful interior designer in Manhattan, she marries a childless sixty-year-old widower, Laurence Foster, and they have a son. Before their marriage, she reveals to him her true identity. Two years later, on his deathbed, he makes her swear never to tell anyone so that their son, Jack, will not carry the stigma of her past.  Two years later, Celia is happily remarried. Her peace of mind is shattered when her new husband, Alex Nolan, surprises her with a gift -- the house in Mendham, New Jersey, where she killed her mother. On the day they move in, they find the words little lizzie's place -- beware painted on the lawn, splotches of red paint all over the house, and a skull and crossbones carved into the door.  More and more, there are signs that someone in the community knows Celia's true identity. When Georgette Grove, the real estate agent who sold the house to Alex, is brutally murdered and Celia is the first on the crime scene, she becomes a suspect.  As Celia fights to prove her innocence, she is not aware that she and her son, Jack, are now the targets of a killer.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Ivy Briefs: True Tales of a Neurotic Law Student",
        "Authors": "By Kimes, Martha",
        "Description": "From first-day nerves to first-year grades, from bizarre job interviews to bar exam insanity, Ivy Briefs pulls back the curtain on the marbled halls of law school, revealing the absurdity often bubbling beneath the surface.Meet Martha Kimes: a naïve small-town girl with strong neurotic tendencies who has (due to an inexplicable stroke of luck) been admitted to Columbia Law School. She's a Midwesterner in the middle of Manhattan, a student on the verge of a nervous breakdown. In her candid memoir -- the best of its kind since One L and the only one written by a woman -- Kimes makes her way through law school, doing battle with a memorable cast of characters: The Sadistic Professor: Every law student's nemesis, the Sadistic Professor takes pity on no one. The Socratic Method is his favorite torture device, and he's got staying power that rivals that of the Energizer Bunny.The Gunner: So enamored with the sound of his own voice, he finds it physically impossible to keep his hand from gunning up into the air every time a professor asks a question. Ten minutes into the start of the school year, everyone is already sick of the Gunner.The Do-gooder: Lurking behind a kind exterior is a pit bull ready to pounce on those who don't plan to devote their legal careers to public service. But would she be so quick to categorize all those who dare go into corporate law as loathsome, soulless warriors for the devil if she, too, had student loans to repay? The Boarding School Bastard: He wears a firmly pressed pin-striped oxford shirt and has a condescending attitude bigger than most European countries. By definition he is better than you because he went to Exeter. And he'll never let you forget it.With sharp wit, dead-on aim, and a healthy dose of self-deprecation, Kimes proves that it is possible to survive law school with both your sense of humor and your sanity intact.",
        "Category": " Education , Student Life & Student Affairs",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Next Great Bubble Boom: How to Profit from the Greatest Boom in History: 2005-2009",
        "Authors": "By Dent, Harry S.",
        "Description": "For over fifteen years, New York Times bestselling author Harry S. Dent, Jr., has been uncannily accurate in predicting the financial future. In his three previous works, Dent predicted the financial recession of the early nineties, the economic expansion of the mid-nineties, and the financial free-for-all of 1998-2000.The Next Great Bubble Boom -- part crystal ball, part financial planner -- offers a comprehensive forecast for the next two decades, showing new models for predicting the future behavior of the economy, inflation, large- and small-cap stocks, bonds, key sectors, and so on. In taking a look at past booms and busts, Dent compares our current state to that of the crash of 1920-21, and the years ahead of us to the Roaring Twenties. Dent gives advice on everything from investment strategies to real estate cycles, and shows not only how bright our future will be but how best to profit from it.Dent gives us all something to look forward to, including:The Dow hitting 40,000 by the end of the decade The Nasdaq advancing at least ten times from its October 2001 lows to around 13,500, and potentially as high as 20,000 by 2009 Another strong advance in stocks in 2005, with a significant correction into around September/October 2006 The Great Boom resurging into its final and strongest stage in 2007, and even more fully in 2008, lasting until late 2009 to early 2010Dent's amazing ability to track and forecast our financial future is renowned, and here he takes that ability to the next level, showing not only what our economy will look like but also how it will affect us as individuals, as organizations, and as a culture. From the upcoming wealth revolution to the essential principles of entrepreneurial success, the book describes a new society where economic and philanthropic development go hand in hand. In The Next Great Bubble Boom, Dent shows not only how the economic growth of the late 1990s was a prelude to the true great boom right around the corner but how all of us can reap its benefits.",
        "Category": " Business & Economics , Forecasting",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Zone Collection",
        "Authors": "By Sears,Barry",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Cupcake",
        "Authors": "By Cohn, Rachel",
        "Description": "When Cyd Charisse moves from San Francisco to start a new life in New York City, she leaves behind her family -- and her true love, Shrimp.She wants to find a cool job, the city's best caffeination and most perfect cupcake, and a hot new love. But the reality of CC's new life hits some unexpected obstacles, including a broken leg that renders her immobile; the joy and aggravation of sharing an apartment with a roommate who's also an older brother; and a tasty selection of guys -- none of whom measure up to Shrimp. Then, just when CC starts to get her new life on track, her old love returns. Shrimp has given up on his plans to live and surf in New Zealand and arrives in NYC with nothing to do other than to be with CC. And this time CC is determined that she and Shrimp will not repeat their old mistakes.This third book about reformed hellion Cyd Charisse is just as unforgettable as Gingerbread and Shrimp.",
        "Category": " Young Adult Fiction , Lifestyles , City & Town Life",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Eat to Live: The Revolutionary Formula for Fast and Sustained Weight Loss",
        "Authors": "By Fuhrman, Joel and Oz, Mehmet, M.D. (FRW)",
        "Description": "Dr. Joel Fuhrman's revolutionary diet is not about willpower, it is about knowledge. Eat to Live offers a healthy, effective, and scientifically proven Six-Week Plan for shedding a radical amount of weight quickly. The key to the program's success is simple: health = nutrients: calories When the ratio of nutrients to calories in the food you eat is high, fat melts away. The more nutrient-dense food you consume, the more you will be satisfied with fewer calories and the less you will crave fat and high-calorie foods. Eat to Live will help you live longer, reduce your need for medications, and improve your overall health dramatically. It is a book that will change the way you want to eat. Most of all, though, Eat to Live will enable you to lose more weight than you ever thought possible.",
        "Category": " Health & Fitness , Nutrition",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Ring: A biography of Ring Lardner",
        "Authors": "By Yardley, Jonathan",
        "Description": "Sportswriter, storyteller, humorist - Ring Lardner was an American original. In this affectionate, entertaining, and authoritative biography, critic Jonathan Yardley gives us a new look at Lardner's all too short life and career.",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Henry James: A Life",
        "Authors": "By Edel, Leon",
        "Description": "Traces the life of the prominent nineteenth century American novelist, examines his major works, and tries to capture his complex personality",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "George Muller: Man of Faith and Miracles (Men of Faith)",
        "Authors": "By Miller, Basil",
        "Description": "The almost unbelievable story of how God used one man who really trusted Him.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1972"
        }
    },
    {
        "Title": "In Between Dragons",
        "Authors": "By Kandel, Michael",
        "Description": "The volumes in Mr. McGulvey's library lead Sherman Potts through gateways into one weird and fantastical world after another, but an addition to the library threatens to destroy the entire network of worlds",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "The Report Card",
        "Authors": "By Clements, Andrew",
        "Description": "A fifth-grade genius turns the spotlight on grades—good and bad—in this novel from Andrew Clements, the author of Frindle.Nora Rose Rowley is a genius, but don't tell anyone. She's managed to make it to the fifth grade without anyone figuring out that she's not just an ordinary kid, and she wants to keep it that way.  But then Nora gets fed up with the importance everyone attaches to test scores and grades, and she purposely brings home a terrible report card just to prove a point. Suddenly the attention she's successfully avoided all her life is focused on her, and her secret is out. And that's when things start to get really complicated....",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Change Your Brain, Change Your Life: The Breakthrough Program for Conquering Anxiety, Depression, Obsessiveness, Anger, and Impulsiveness",
        "Authors": "By Amen, Daniel G.",
        "Description": "BRAIN PRESCRIPTIONS THAT REALLY WORKIn this breakthrough bestseller, you'll see scientific evidence that your anxiety, depression, anger, obsessiveness, or impulsiveness could be related to how specific structures in your brain work. You're not stuck with the brain you're born with. Here are just a few of neuropsychiatrist Dr. Daniel Amen's surprising--and effective--\"brain prescriptions\" that can help heal your brain and change your life:To Quell Anxiety and Panic:¸ Use simple breathing techniques to immediately calm inner turmoilTo Fight Depression:¸ Learn how to kill ANTs (automatic negative thoughts)To Curb Anger:¸ Follow the Amen anti-anger diet and learn the nutrients that calm rageTo Conquer Impulsiveness and Learn to Focus:¸ Develop total focus with the \"One-Page Miracle\"To Stop Obsessive Worrying:¸ Follow the \"get unstuck\" writing exercise and learn other problem-solving exercises",
        "Category": " Psychology , Psychopathology , General",
        "Publisher": "Three River Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Mandie and the Forbidden Attic (Mandie, Book 4)",
        "Authors": "By Leppard, Lois Gladys",
        "Description": "Mandie and her new friend investigate mysterious noises in the school attic which lead to a surprising discovery and a deepening of Mandie's Christian faith",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Phineas L. MacGuire . . . Erupts!: The First Experiment (From the Highly Scientific Notebooks of Phineas L. MacGuire)",
        "Authors": "By McDaniels, Preston (ILT) and Dowell, Frances O'Roark",
        "Description": "Here's what you need to know about Phineas L. MacGuire, boy-scientist extraordinaire, aka Mac:   1. He's allergic to purple, telephone calls, and girls, and can prove it.   2. He's probably the world's expert on mold, including which has the highest stink potential.   3. He does not have a best friend. He does, however, have an un-best friend, who he does not -- repeat, not -- want to upgrade to best friend status.   But disaster strikes when his teacher pairs Mac and his un-best friend together for the upcoming science fair. Worse, this un-best friend wants the project to be on dinosaurs, which is so third grade. Worse still, it seems as though everyone else in his class finds the un-best friend as unlikeable as Mac does. But, being a boy-scientist, once Mac notices this, he just might have to do some investigating....",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Sharks (Discovery Program)",
        "Authors": "By Miller, Jonathan",
        "Description": "Describes and illustrates different types of sharks, their senses, breathing, eating, and environment, and includes Web site addresses to enhance the reader's shark research.",
        "Category": " Juvenile Nonfiction , Animals , Farm Animals",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Growing Up: Strange Beginnings",
        "Authors": "By Stonehouse, Bernard and Francis, John (ILT)",
        "Description": "Looks at different types of animals babies and how they change as they grow.",
        "Category": " Juvenile Nonfiction , Science & Nature , Biology",
        "Publisher": "Tangerine Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "New Rules - Polite Musings From A Timid Observer",
        "Authors": "By Maher, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Stark Truth: The Most Overrated and Underrated Players in Baseball History",
        "Authors": "By Stark, Jayson",
        "Description": "Jayson Stark discusses what he considers to be the most overrated and underrated players of all time at each position.",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "Triumph Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Infidels: A History of the Conflict Between Christendom and Islam",
        "Authors": "By Wheatcroft, Andrew",
        "Description": "Here is the first panoptic history of the long struggle between the Christian West and Islam.In this dazzlingly written, acutely nuanced account, Andrew Wheatcroft tracks a deep fault line of animosity between civilizations. He begins with a stunning account of the Battle of Lepanto in 1571, then turns to the main zones of conflict: Spain, from which the descendants of the Moors were eventually expelled; the Middle East, where Crusaders and Muslims clashed for years; and the Balkans, where distant memories spurred atrocities even into the twentieth century. Throughout, Wheatcroft delves beneath stereotypes, looking incisively at how images, ideas, language, and technology (from the printing press to the Internet), as well as politics, religion, and conquest, have allowed each side to demonize the other, revive old grievances, and fuel across centuries a seemingly unquenchable enmity. Finally, Wheatcroft tells how this fraught history led to our present maelstrom. We cannot, he argues, come to terms with today’s perplexing animosities without confronting this dark past.",
        "Category": " History , Middle East , General",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Dilbert Gives You The Business (Volume 14)",
        "Authors": "By Adams, Scott",
        "Description": "Everyone who reads DILBERT and works in an office will appreciate this collection, Dilbert Gives You the Business.Creator Scott Adams tells it like it is through the insane business world inhabited by Dilbert. If frustration and lunacy are an inevitable part of your workday, appropriate measures must be taken immediately. Andrews McMeel has the perfect antidote to your workplace stress. Dilbert is universally recognized as the definitive source of office humor. What makes this 14th Dilbert book so unique is that it is a collection of the most popular strips requested by fans for reprints and downloads from Dilbert.com gathered together. Arranged by topics for quick reference, this hilarious book is the comprehensive Dilbert source book, sure to alleviate work burnout. Packed within these colorful pages, fans will find all their favorite characters, including Dilbert, as he encounters daily issues from delegating to decision-making, trade shows to telecommuting, and downsizing to annoying coworkers. It's business as usual for the Dilbert clan. . . . Dilbert is continually updating his resume, Dogbert continues his pursuit of world domination, Wally strives to do the least amount of work possible, and Alice is eternally frustrated by the Boss. Welcome to the all-too-familiar world of Dilbert-the lowly engineer who has become an icon for oppressed and burntout workers everywhere!The most popular business-oriented cartoon in the world, Dilbert speaks to millions of fans who toil in the corporate trenches. No matter how outrageous a tale he spins, Dilbert creator Scott Adams inserts sufficient nuggets of truth in every strip to keep his believers laughing. In part, that's because Dilbert is based on his own former corporate experiences-and is kept current by culling inspiration from the 350-plus E-mails he receives each day. Keep Dilbert Gives You the Business close at hand-as you would your phone book, Internet diversion tool, browser, and any other work.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Sacred Hoop",
        "Authors": "By Broder, Bill",
        "Description": "In this allegorical treatment of man's changing relationship with the earth through the centuries, stories illustrated with contemporary art or artifacts capture those historical moments in which man's relationship with the natural world underwent radical change",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Way It Wasn't: Great Science Fiction Stories of Alternate History",
        "Authors": "By Greenberg, Martin Harry (EDT) and Silverberg, Robert (INT)",
        "Description": "The Way It Wasn't takes an amusing, intellectually stimulating excursion into speculative history. Here are thirteen memorable stories by renowned science fiction writers, telling what things might be like if... Elvis Presley weren't the \"King\" but the President of the United States (\"Ike at the Mike\" by Howard Waldrop)... The Black Death had killed the entire population of Europe in the fourteenth century (\"Lion Time in Timbuctoo\" by Robert Silverberg)... John F. Kennedy had survived the 1963 shooting in Dallas (\"The Winterberry\" by Nicholas A. DiChario).Included, too, is fascinating short fiction by Mike Resnick, Susan Shwartz, Larry Niven, Pamela Sargent, Fritz Leiber, Greg Bear, Barry N. Malzberg, Harry Turtledove, Gregory Benford and Kim Stanley Robinson.After reading these stories - some of the most compelling examples of alternate history anywhere - your mind will keep spinning the question \"What If...?\"",
        "Category": " Fiction , Fantasy , Historical",
        "Publisher": "Kensington Publishing Corp",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Reporting from Washington: The History of the Washington Press Corps",
        "Authors": "By Ritchie, Donald A.,",
        "Description": "Donald Ritchie offers a vibrant chronicle of news coverage in our nation's capital, from the early days of radio and print reporting and the heyday of the wire services to the brave new world of the Internet.         Beginning with 1932, when a newly elected FDR energized the sleepy capital, Ritchie highlights the dramatic changes in journalism that have occurred in the last seven decades. We meet legendary columnists--including Walter Lippmann, Joseph Alsop, and Drew Pearson --as well as the great investigative reporters, from Paul Y. Anderson to the two green Washington Post reporters who launched the political story of the decade--Woodward and Bernstein. We read of the rise of radio news--fought tooth and nail by the print barons--and of such pioneers as Edward R. Murrow, H. V. Kaltenborn, and Elmer Davis. Ritchie also offers a vivid history of TV news, from the early days of Meet the Press, to Huntley and Brinkley and Walter Cronkite, to the cable revolution led by C-SPAN and CNN. In addition, he compares political news on the Internet to the alternative press of the '60s and '70s; describes how black reporters slowly broke into the white press corps (helped mightily by FDR's White House); discusses path-breaking woman reporters such as Sarah McClendon and Helen Thomas, and much more.       From Walter Winchell to Matt Drudge, the people who cover Washington politics are among the most colorful and influential in American news. Reporting from Washington offers an unforgettable portrait of these figures as well as of the dramatic changes in American journalism in the twentieth century.",
        "Category": " Language Arts & Disciplines , Journalism",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Last Good Time",
        "Authors": "By Bausch, Richard",
        "Description": "The lives of two elderly men who survive on their memories of the \"good old days\" are irrevocably altered by the arrival of a pregnant young lady who seeks shelter with them",
        "Category": " Fiction , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Highly Confident: The Crime and Punishment of Michael Milken",
        "Authors": "By Kornbluth, Jesse",
        "Description": "Shocking disclosures by Michael Milken, his defense team, the men who prosecuted him, and his former associates and clients narrate one of the most profound events in American finance. 100,000 first printing. $100,000 ad/promo. Tour. First serial, Vanity Fair.",
        "Category": " Political Science , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Dating Game",
        "Authors": "By Danielle Steel",
        "Description": "",
        "Category": "",
        "Publisher": "Delacorte",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Mondo Canine",
        "Authors": "By Winokur, Jon (EDT)",
        "Description": "A collection of quotations, anecdotes, folklore, and essays from the likes of Mark Twain and Emily Dickinson offers a comical and poignant view of man's best friend",
        "Category": " Technology & Engineering , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Savoir Rire: The Humorists' Guide to France (Humorists' Guides)",
        "Authors": "By Rire, Savoir and Wechsler, Robert (EDT)",
        "Description": "Providing a myriad of viewpoints that look at the world through a filter of irony, incongruity, satire, parody, nonsense, and truth, this guide focuses on people—the tourist, the maitre d', the throngs that pass by your cafe. Full, but not stuffed, with stories, memoirs, character sketches, descriptions, light verse,drawings, and cartoons. Preparations and arrival, the sights and the haute cuisine, gambling, mountain climbing, and speaking French, even coming home and telling the neighbors, it's all here.",
        "Category": " Travel , Europe , France",
        "Publisher": "Catbird Press",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Life After School Explained",
        "Authors": "By Vickey, Jesse, Ferguson, Andy, and Vickey, Nicole",
        "Description": "Credit cards, HMOs, leases, business dinners... this witty book explains all of the life skills that no one bothers to teach in the classroom. The book was written by a team of young professionals, and is full of funny first-hand experiences from their first few years in the real world. This book is the definitive reference guide for life after school. It is full of helpful and humorous hints for anyone who eats, spends money, works, or pays taxes. The book draws on tips from the popular Cap & Compass campus seminars, and includes a lot of feedback from graduating seniors and recent grads. It's the perfect gift for recent graduates (college or high school). A few of the topics covered include: mutual funds, 401k's, work dinner etiquette, buying vs. leasing a car, engagement rings, student loans, auto insurance, dressing for the job, taxes, ...",
        "Category": " Self-help , General",
        "Publisher": "Cap & Compass Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2017"
        }
    },
    {
        "Title": "Capturing Paris: A Novel",
        "Authors": "By Davis, Katharine",
        "Description": "After twenty five years of marriage, Annie and Wesley are living the type of elegant, sophisticated life in Paris that many Americans dream about. Their apartment in the Marais district is filled with wonderful food, accomplished friends, and good wine. All of this changes when Wesley loses his job and an attractive, magnetic woman enters their lives. Suddenly, in Katharine Davis' atmospheric first novel Capturing Paris, the sights, smells and sounds of Paris are cast in a different light, and may never be the same. \"... [R]eaders with a soft spot for the city of lights will want to give this a look.\" - Publishers Weekly",
        "Category": " Fiction , Literary",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Bracelet",
        "Authors": "By Uchida, Yoshiko and Yardley, Joanna (ILT)",
        "Description": "Emi, a Japanese American in the second grade, is sent with her family to an internment camp during World War II, but the loss of the bracelet her best friend has given her proves that she does not need a physical reminder of that friendship.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Philomel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Baseball and Philosophy: Thinking Outside the Batter's Box",
        "Authors": "By Bronson, Eric (EDT)",
        "Description": "Baseball and Philosophy brings together two high-powered pastimes: the sport of baseball and the academic discipline of philosophy. Eric Bronson asked eighteen young professors to provide their profound analysis of some aspect of baseball. The result offers surprisingly deep insights into this most American of games.The contributors include many of the leading voices in the burgeoning new field of philosophy of sport, plus a few other talented philosophers with a personal interest in baseball. A few of the contributors are also drawn from academic areas outside philosophy: statistics, law, and history.This volume gives the thoughtful baseball fan substancial material to think more deeply about. What moral issues are raised by the Intentional Walk? Do teams sometimes benefit from the self-interested behavior of their individual members? How can Zen be applied to hitting? Is it ethical to employ deception in sports? Can a game be defined by its written rules or are there also other constraints? What can the U.S. Supreme Court learn from umpiring? Why should baseball be the only industry exempt from antitrust laws? What part does luck play in any game of skill?",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Open Court",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Witch of Cologne",
        "Authors": "By Learner, Tobsha",
        "Description": "A Time of Peril The Inquisitor, Carlos Vicente Solitario, charges a young Jewish midwife,  Ruth bas Elazar Saul, with heresy.  Ruth may be the daughter of the city's chief rabbi, but this is no protection against the Inquisition's accusations.  A Quest for JusticeDetlef von Tennen, nobleman and canon, cousin to the Archbishop, suspects that something other than religion drives Solitario to persecute Ruth.  Determined to ensure that justice is done, Detlef joins the investigation-and finds his passions fully aroused by Ruth's impressive intelligence and darkly exotic beauty.  Two Hearts' DesiresAll her life, Ruth bas Elazar Saul has thirsted for knowledge, despite the price she paid by concealing her gender and being cast out of her father's house.  Her faith sustained her through all, even the attentions of the Inquisition.  Then, in the very heart of danger, God blessed her with the greatest love she had ever known.",
        "Category": " Fiction , Historical",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "6.05",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "10-Minute Card Games",
        "Authors": "By Moss, William A. and Miller, Myron (ILT)",
        "Description": "Only have a few minutes? Here are more than 100 great games you can play, and every one is guaranteed to be fast and fun. All the rules, strategies, and winning tricks are here for a number of basic games like Rummy, Whist, Poker, Euchre, and Hearts, and their many variations. There are more than 20 solitaire games, and a variety of games for children and the young at heart. All rules are fully explained with plenty of illustrations to make them very easy to follow. Those players looking for longer games will find scoring procedures to extend the play of certain games.",
        "Category": " Games , Card Games , General",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "The Gift for All People",
        "Authors": "By Lucado, Max",
        "Description": "The Gift for All People is a celebration of God's gift of salvation wrapped in a collection of inspirational stories. These stories will help Christians comprehend and treasure the assurance of their salvation and will help non-Christians realize and embrace the gift of abundant, eternal life in Jesus Christ. The concluding story, written especially for this book, urges readers to give their lives to Jesus Christ and shows them how to do so. This book will provide Christians with a unique, warm, and attractive presentation of the gospel to give to non-Christian family or friends.More than anything, God wants you to be with Him. The God who designed your world, the God who placed you on the planet, simply wants you home with Him. And to bring you home, He offers you a gift...the gift of eternal salvation. My prayer is that through the pages of this book you'll see his gift like you've never seen it. If you've already accepted it, you'll thank Him again. And if you've never accepted it, I pray that you will. For it's the gift of a lifetime. A gift for all people.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Hangover Handbook",
        "Authors": "By Outeridge, D. M.",
        "Description": "Provides semi-serious discussion of affects of alcohol and the causes and cures of hangovers, including many quotes and anecdotes",
        "Category": " Reference , General",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Whistling in the Dark: True Stories and Other Fables",
        "Authors": "By Garrett, George",
        "Description": "When George Garrett winds up to pitch a story, it's a little hard to tell what is fact and what George is making up. What is certain is that the reader is in for a hell of a tale.Ranging widely over his own life and the lives of his nearest and dearest--the quick and not-so-quick--Garrett rewrites personal experience and history pretty much as he will. There is, for example, \"My Two One-Eyed Coaches,\" in which the author looks back with sharp nostalgia on his salad days at military school and at Princeton. He'll reexamine a career in the Army which, in retrospect, is darker than it once seemed. There are wise and irreverent observations on his forebears who fought in the War Between the States. Mix in Garrett's fresh commentaries on the state of politics and the literary swim, and you have a rich stew, fit for a fine palate but with a stick-to-the-ribsness about it.George Garrett's musings should be read in a state of lively comfort. So sit up and settle back: you're in for the best bellyful you've had in a long time.",
        "Category": " Fiction , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Desires",
        "Authors": "By L'Heureux, John",
        "Description": "",
        "Category": "",
        "Publisher": "Holt Rinehart & Winston",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "LL Traveltalk: Italian (Fodor's Living Language)",
        "Authors": "By Ciolli, Marco",
        "Description": "",
        "Category": "",
        "Publisher": "Living Language",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "The Fourteenth Chronicle: Letters and Diaries of John Dos Passos",
        "Authors": "By Ludington, Toensend (EDT)",
        "Description": "In the 1960's John Dos Passos began calling his novel contemporary chronicles, and to his latest  piece of fiction he gave the working title The Thirteenth Chronicle. These letters abd duarues naje a chronicle too.",
        "Category": " History , General",
        "Publisher": "Gambit Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1973"
        }
    },
    {
        "Title": "Battle Cry for a Generation: The Fight To Save America's Youth",
        "Authors": "By Luce, Ron",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Nexgen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Leadership Promises for Every Day",
        "Authors": "By Maxwell, John C.",
        "Description": "Applauded as one of the world's most popular leadership experts, John C. Maxwell distills many of his winning concepts and scriptural meditations into a daily devotional, following the phenomenally popular format of Grace for the Moment and Hope for Each Day. Delivered with his trademark style of confidence and clarity, Maxwell addresses a host of relevant topics including success, stewardship, teamwork, and mentoring. This book will have a 4-color background and dynamic images from nature, sure to inspire leaders as they read. With over 5.2 million books sold, he is nationally recognized as the authority on bringing together biblical principles and personal objectives that unlock an individual's potential and result in life-changing decisions. In addition to his success as an author, Maxwell reaches a quarter-million people each year through highly anticipated appearances at conferences and other events. As the founder of INJOY Group, Maxwell is considered America's expert on leadership and maximizing potential",
        "Category": " Religion , Devotional",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "An Eskimo Birthday (Weekly Reader Children's Book Club)",
        "Authors": "By Robinson, Tom D.",
        "Description": "A fierce storm and her father's empty traps threaten to obliterate the excitement and happiness of Eeka's birthday",
        "Category": "",
        "Publisher": "Dodd, Mead",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1975"
        }
    },
    {
        "Title": "Horatio's boys;: The life and works of Horatio Alger, Jr",
        "Authors": "By Edwin Palmer Hoyt",
        "Description": "",
        "Category": "",
        "Publisher": "Chilton Book Co",
        "Price Starting With ($)": "19.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Your Money Map: A Proven 7-Step Guide to True Financial Freedom",
        "Authors": "By Dayton, Howard",
        "Description": "Finding your way to a travel destination requires a map and  the same is going to be true for reaching your financial destination.  Based on the phenomenally popular Money Map concept  created by Crown Ministries, this is a simple roadmap for organizing  one’s finances through life. Howard Dayton’s expertise and  financial experience come to light as he guides readers on a journey  toward Biblically based, true financial freedom?",
        "Category": " Business & Economics , Personal Finance , Money Management",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Usborne First Book of Knowledge: v. 1",
        "Authors": "By Kate Little",
        "Description": "",
        "Category": "",
        "Publisher": "Usborne Publishing Ltd",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Storm's Fury: And Other Horse Stories (Highlights for Children)",
        "Authors": "By Highlights for Children, Inc. and Hunt, Judith (ILT)",
        "Description": "A collection of stories about riding and caring for horses, including \"Conquistador,\" \"Danny and the Palomino,\" \"Jacket for a Newcomer,\" \"Sarah's Summer,\" and \"Horse and Pony Workshop\"",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Boyds Mills Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Snack Attack! (Teachable Moments Cookbooks for Kids)",
        "Authors": "By Ward, Brenda and Jarrell, Jane Cabaniss",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Exploring the Titanic: How the Greatest Ship Ever Lost was Found",
        "Authors": "By Marschall, Ken (ILT) and Ballard, Robert D.",
        "Description": "A noted marine biologist and the scientist responsible for the discovery of the Titanic describes the sinking of the great ocean liner and the search for, and discovery of the wreck of the ship",
        "Category": "",
        "Publisher": "Madison Press Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2014"
        }
    },
    {
        "Title": "Cheerios Counting Book",
        "Authors": "By McGrath, Barbara Barbieri, Bolster, Rob (ILT), and Mazzola, Frank, Jr. (ILT)",
        "Description": "Text and illustrations of the familiar O-shaped cereal help the reader count to ten and add groups of ten",
        "Category": " Juvenile Nonfiction , Mathematics , Fractions",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Kittens (Animal Babies (Barron))",
        "Authors": "By Capucilli, Alyssa Satin",
        "Description": "Provides information about kittens and includes instructions on creating five art projects.",
        "Category": " Juvenile Nonfiction , Animals , Cats",
        "Publisher": "Barrons Juveniles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Point to Point Navigation: A Memoir",
        "Authors": "By VIDAL, GORE",
        "Description": "The brilliant sequel to Gore Vidal’s acclaimed, bestselling memoir, Palimpsest.In Point to Point Navigation, the celebrated novelist, essayist, critic, and controversialist Gore Vidal ranges freely over his remarkable life with the signature wit and literary elegance that is uniquely his. The title refers to a form of navigation he resorted to as a first mate in the Navy during World War II. As he says, “As I was writing this account of my life and times since Palimpsest, I felt as if I were again dealing with those capes and rocks in the Bering Sea that we had to navigate so often with a compass made inoperable by weather.” It is a beautifully apt analogy for the hazards (mostly) eluded during his eventful life and for the way this memoir proceeds—far from linear but always on course.From his desks in Ravello and the Hollywood Hills, Gore Vidal travels in memory through the arenas of literature, television, film, theater, politics and international society where he has cut a broad swath, recounting achievements and defeats, friends and enemies made (and on a number of occasions lost). Among the gathering of notables to be found in these pages, sketched with a draftsman’s ease and evoked with the panache of one of our great raconteurs, are Jack and Jacqueline Kennedy, Tennessee Williams (the “Glorious Bird”), Eleanor Roosevelt, Orson Welles, Johnny Carson, Greta Garbo, Federico Fellini, Rudolph Nureyev, Elia Kazan, and Francis Ford Coppola. Some of the book’s most moving pages are devoted to the illness and death of his partner of five decades, Howard Austen, and indeed the book is, among other things, a meditation on mortality written in the spirit of Montaigne.Elegiac yet vital and even ornery, Point to Point Navigation is a summing-up of Gore Vidal’s time on the planet that manages to be at once supremely entertaining, endlessly provocative, and thoroughly moving.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "First Grade Friends: Recess Mess (Hello Reader, Level 1)",
        "Authors": "By MacCarone, Grace and Lewin, Betsy (ILT)",
        "Description": "First graders can relate to this story of poor Sam, who needs to go to the boys' room, but since he cannot read or spell, he worries that he will not know which door to enter. Original.",
        "Category": " Juvenile Fiction , Imagination & Play",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Surviving Fights With Your Brothers and Sisters (A Children's Book About Sibling Rivalry)",
        "Authors": "By Wilt, Joyce",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1978"
        }
    },
    {
        "Title": "The Penwyth Curse",
        "Authors": "By Catherine Coulter",
        "Description": "",
        "Category": "",
        "Publisher": "Jove 2003/03",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Old Fashioned Christmas Designs, Crafts & Festive Foods",
        "Authors": "By Staff, Time-Life Books Editorial (Editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Time-life Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Doctor's Complete Guide to Vitamin and Minerals",
        "Authors": "By Eades, Mary",
        "Description": "",
        "Category": "",
        "Publisher": "DELL PUBL CO",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Sarge: The Life and Times of Sargent Shriver",
        "Authors": "By Moyers, Bill D. (FRW) and Stossel, Scott",
        "Description": "Working for four presidents over six decades, R. Sargent “Sarge” Shriver founded the Peace Corps, launched the War on Poverty, created Head Start and Legal Services for the Poor, started the Special Olympics, and served as ambassador to France. Yet from the moment he married Joseph P. Kennedy’s daughter Eunice in 1953, Shriver had to navigate a difficult course between independence and family loyalty that tended to obscure his incredible achievements.Scott Stossel, through complete access to Shriver and his family, renders the story of his life in cinematic detail. Shriver’s myriad historical legacies are testaments to the power of his vision and his ability to inspire others. But it is the colorful personality and indomitable spirit of the man himself—traits that allowed him to survive the Depression, WWII, and the Kennedy family—that will inspire readers today to expand the “horizons of the possible.”",
        "Category": " Biography & Autobiography , Artists, Architects, Photographers",
        "Publisher": "Smithsonian Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Stuck on the Presidents: Revised and Updated (Books and Stuff)",
        "Authors": "By Bergen, Lara, Hopp, Lisa, Milne, Jonathan (ILT), and Tung, Angela",
        "Description": "",
        "Category": " Juvenile Nonfiction , History , United States , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Joyful Journey (Walker Large Print Books)",
        "Authors": "By Johnson, Barbara, Clairmont, Patsy (EDT), Swindoll, Luci, and Meberg, Marilyn",
        "Description": "Provides women with inspiration and encouragement to face obstacles on the journey of life and discusses how friendships, laughter, and love can steer people closer to God",
        "Category": " Religion , Spirituality",
        "Publisher": "Christian Large Print",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Homeology: How to Be Sure that the House You Buy is the Home You Really Want",
        "Authors": "By Janik, Carolyn",
        "Description": "Offers advice on purchasing a home, covering such topics as types of housing available and the benefits of each, home financing, evaluating a location, negotiating for the best price, effective house-hunting strategies, and understanding a \"standard\" contract",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Ministry of Greed: The Inside Story of the Televangelists and Their Holy Wars (Newsweek Book)",
        "Authors": "By Martz, Larry and Caroll, Ginny",
        "Description": "Details the PTL scandal and the infighting that followed Jerry Falwell's takeover",
        "Category": " Religion , Christian Ministry , Evangelism",
        "Publisher": "Grove Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Spacebusters: The Race to the Moon (Eyewitness Readers, Level 3: Reading Alone)",
        "Authors": "By Wilkinson, Philip",
        "Description": "The US pledged to send a man to the Moon before the end of the 1960s. Here is the story of that race against time. This big book version of the DK Reader is ideal for shared reading during class. DK Big Readers provide excellent opportunities for students to understand what is involved in the reading process, such as cueing the text, location information, understanding print conventions, and -- most importantly -- learning to enjoy books! Normal-sized DK Readers can be used by individuals and pairs of students to rehearse and consolidate what they have learned in group sessions. Stunning DK photographs combine with lively illustrations and engaging g, age-appropriate stories in DK Readers, a multilevel reading program guaranteed to capture children's interest while developing their reading skills and general knowledge.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Plan Your Estate, 9th Edition",
        "Authors": "By Clifford, Denis",
        "Description": "Plan Your Estate untangles the complexities and jargon of estate planning and covers everything from the basics of wills and living trusts to sophisticated tax-saving strategies. The authors give you straightforward, plain-English explanations of every significant estate-planning option available, so you can make the best decisions for you and those you love.The book covers: • wills • probate and how to avoid it • living trusts • property-control trusts • naming guardians for children • leaving property to children • estate taxes and how to reduce them • living wills (health care directives) • financial powers of attorney • final arrangements • strategies for business owners • and much more.The 9th edition is completely updated with the latest federal and state laws.",
        "Category": " Law , Estates & Trusts",
        "Publisher": "Nolo",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Exploring the Solar System (Dover Nature Coloring Book)",
        "Authors": "By Lafontaine, Bruce",
        "Description": "Combining the history of astronomy with the latest advances in space age technologies, this exciting coloring book also joins fun with facts about space exploration and our solar system.Forty-four stunning illustrations, carefully researched and meticulously rendered, depict the geocentric and heliocentric solar system models; Galileo's drawings of the moon; the NEAR (Near Earth Asteroid Rendezvous) spacecraft orbiting the asteroid Eros; an astronaut on the lunar surface with an \"earthrise\" overhead; the Magellan spacecraft penetrating the clouds of Venus to radar-map the continents; the enigmatic \"face\" on Mars; a U. S. space shuttle and its sleek successor, the Venture Star; plus representations of all the planets and much more.Each illustration is accompanied by a fact-filled caption in this celestial guide, which is sure to fascinate students, teachers, and colorists of all ages.",
        "Category": " Juvenile Nonfiction , Science & Nature , Astronomy",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Exploring earth's treasures (Eyes on adventure)",
        "Authors": "By Olson, Donald",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "It's Perfectly Normal: Changing Bodies, Growing Up, Sex, and Sexual Health (The Family Library)",
        "Authors": "By Emberley, Michael (ILT) and Harris, Robie H.",
        "Description": "When children wonder about sex, where will they go for the answers?  Providing accurate, lucid, unbiased answers to nearly every conceivable question children may have about sexuality, IT'S PERFECTLY NORMAL is here to help.  From conception and puberty to birth control and AIDS, it is a refreshingly open and thorough presentation of the facts of sex—both biological and psychological—which children need now more than ever.  Throughout, two cartoon characters, a curious bird, and a squeamish bee reflect the diverse feelings children often have about sex.  Packed with warm, age-appropriate illustrations, often humorous but always scientifically correct, IT'S PERFECTLY NORMAL offers children the reassurance that the changes and emotions they experience while growing up are perfectly normal.",
        "Category": " Young Adult Nonfiction , Family , Parents",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Focus on Drugs and the Brain (A Drug-Alert Book)",
        "Authors": "By Neuhaus, David (ILT) and Friedman, David P.",
        "Description": "Describes the use and misuse of drugs and their effects on the brain",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "A kid's guide to managing time: A children's book about using time efficiently and effectively (Ready-set-grow)",
        "Authors": "By Berry, Joy Wilt",
        "Description": "",
        "Category": "",
        "Publisher": "Educational Products Division, Word",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "U.S. History as Women's History: New Feminist Essays",
        "Authors": "By Kerber, Linda K. (EDT), Sklar, Kathryn Kish, Kessler-Harris, Alice (EDT), and Sklar, Kathryn Kish (EDT)",
        "Description": "This outstanding collection of fifteen original essays represents innovative work by some of the most influential scholars in the field of women's history. Covering a broad sweep of history from colonial to contemporary times and ranging over the fields of legal, social, political, and cultural history, this book, according to its editors, 'intrudes into regions of the American historical narrative from which women have been excluded or in which gender relations were not thought to play a part.'      State formation, power, and knowledge have not traditionally been understood as the subjects of women's history, but they are the themes that permeate this book. Individually and together, the essays explore how gender serves to legitimize particular constructions of power and knowledge and to meld these into accepted practice and state policy. They show how the field of women's history has moved from the discovery of women to an evaluation of social processes and institutions.      The book is dedicated to pioneering women's historian Gerda Lerner, whose work inspired so many of the contributors, and it includes a bibliography of her works.    from the book  The contributors to this volume grew up into a world in which history was rigidly limited. It paid little attention to social relationships, to issues of race, to the concerns of the poor, and virtually none to women. Women figured in it for their ritual status, as wives of presidents like Abigail Adams or Dolly Madison; for their role as spoilers, from the witches of Salem to Mary Todd Lincoln, or for their sacrificial caregiving, like Clara Barton or Dorothea Dix. Even when women like Sojourner Truth, Jane Addams, and Eleanor Roosevelt were named by historians, the radical substance of their work and their lives was routinely ignored. A very few historians of women--Eleanor Flexner, Julia Cherry Spruill, Caroline Ware--worked on the margins of the profession, their contributions unappreciated, and their writing vulnerable to the charge of irrelevance.    Contents    Part 1.  State Formation    Linda K. Kerber on women and the obligations of citizenship  Kathryn Kish Sklar on two political cultures in the Progressive Era  Linda Gordon on women, maternalism, and welfare in the twentieth century  Alice Kessler-Harris on the Social Security Amendments of 1939  Nancy F. Cott on marriage and the public order in the late nineteenth century    Part 2.  Power    Nell Irvin Painter on 'soul murder' as a legacy of slavery  Judith Walzer Leavitt on Typhoid Mary and early twentieth-century public health  Estelle B. Freedman on women's institutions and the career of Miriam Van Waters  William H. Chafe on how the personal translates into the political in the careers of Eleanor Roosevelt and Allard Lowenstein  Jane Sherron De Hart on women, politics, and power in the contemporary United States    Part 3.  Knowledge    Barbara Sicherman on reading Little Women  Joyce Antler on the Emma Lazarus Federation's efforts to promulgate women's history  Amy Swerdlow on Left-feminist peace politics in the cold war  Ruth Rosen on the origins of contemporary American feminism among daughters of the fifties  Darlene Clark Hine on the making of Black Women in America: An Historical Encyclopedia",
        "Category": " Social Science , Women's Studies",
        "Publisher": "The University of North Carolina Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Mighty Adventurer of the Planet (Beryl E. Bean, Book 1)",
        "Authors": "By Stern, Ricki, Worcester, Heidi Pesky, and Bates, Amy June (ILT)",
        "Description": "Two weeks ago she was a soccer queen; now she's been sidelined by a broken arm. Beryl's sooooooooooooo bored, until her stepfather suggests she become a Mighty Adventurer of the Planet -- dedicated to solving mysteries and finding adventures. Now Beryl and her new best friend, Mary P., are going behind the scenes at the natural history museum, where their help is desperately needed by a team of scientists hunting for a missing dinosaur bone.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Harpercollins Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Chicken Soup for the Soul Presents Teens Talkin' Faith",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), and Trujillo, Michelle L. (COM)",
        "Description": "Chicken Soup for the Soul cocreators Jack Canfield and Mark Victor Hansen have teamed up with Michelle L. Trujillo, best known to teens as Mrs. T, to offer you a collection of passages from teenagers across the nation that will lead you on a spiritual journey. From trial and tragedy to triumph and joy, teen contributors share personal, heartfelt testimonies about how God has given them strength and courage to deal with the tough times and love and comfort when they have felt alone. Teens also share with you what it means to accept God's grace and rely on His guidance. At the end of each chapter, Mrs. T shares stories and encouragement, while inviting you to continue or establish a promising relationship with God. Regardless of your religion, this book will be a light upon your path. Teens Talkin' Faith is a gift from Chicken Soup for the Soul, Mrs. T, and teens just like you. It is a gift of faith, love, and hope that can make a difference in your life.",
        "Category": " Young Adult Nonfiction , Religion , General",
        "Publisher": "HCI",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Excuse Me, Your God Is Waiting: Love Your God * Create Your Life * Find Your True Self",
        "Authors": "By Prosser, Michelle Epiphany",
        "Description": "For many of us, the search for the true self begins and ends with God. Certainly this is true for author Michelle Prosser. In this remarkable book, Prosser opens up her life experiences to light the way for each of us as we undertake our own journey of self-discovery.There are many books available now that teach us how to use the Law of Attraction to bring into reality the life we really want. Excuse Me, Your God Is Waiting puts God front and center in the process and in our lives. We not only benefit from Prosser's many experiences but also from the numerous exercises she includes--exercises that allow us to get to know God, perhaps in a different way than we've ever experienced before. She shows us how to make God a part of each day, each experience, each trial, and each celebration.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Hampton Roads Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Do-It-Yourself Project Book",
        "Authors": "By Burgess, Anna and Green, Darren (ILT)",
        "Description": "Provides ideas and instructions for making ingenious and eye-catching presentations of research projects, including posters, handmade books, and models",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Arts and Entertainment (Eyes on America)",
        "Authors": "By Bland, Celia",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Daily Life in a Wagon Train (Daily Life)",
        "Authors": "By Erickson, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "Heinemann Educational Books - Library Division",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Helping the Wright Brothers: A Tale of First Flight Helpers (No. 2 in Suzanne Tate's History Series) (Suzanne Tate's History Series, Volume 2)",
        "Authors": "By Tate, Suzanne and Melvin, James (ILT)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "Nags Head Art, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Extreme Sports: Ski!",
        "Authors": "By Pollack, Pamela and Dickason, Jack (ILT)",
        "Description": "Just in time for the Winter Olympics in Salt Lake City, National Geographic introduces a brash, bold new series on extreme sports, a subject of high appeal and growing interest to today?s kids. Starting with Ski! and Snowboard!, the series gives young adventurers an informative, up-close look at sports that push human limits. Action-packed visuals and cool, fact-filled text let kids experience vicariously all the thrills and spine-tingling risks of participating in X-sports. From piping and speed boarding to skiing the steepest couloirs, readers will explore different varieties of each sport, learn its special moves, and see what the life of a competitor is like in a fast, fun introduction that will whet their appetites for more! Each volume is packed with fun facts and details. Spectacular photographs capture all the action and allure Fun-to-read text filled with hip terms and insider lingo Simple drawings teach special moves and techniques How-to tips from the pros and champs Profiles of legendary competitors Safety information and advice",
        "Category": " Young Adult Nonfiction , Sports & Recreation , Winter Sports",
        "Publisher": "National Geographic Children's Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Hattie and the Fox",
        "Authors": "By Fox, Mem and Mullins, Patricia (ILT)",
        "Description": "I can see a nose and two eyes in the bushes!\" cries Hattie. But nobody is listening. \"I can see a nose, two eyes, two ears, two legs, and a body in the bushes!\" cries Hattie. But no one is paying a bit of attention. Not goose. Not pig. Not horse. Not cow. She tries again and again to warn her friends of danger, but nobody listens to Hattie. That is, until they all realize that what Hattie is saying is true!",
        "Category": " Juvenile Fiction , Animals , Farm Animals",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Froggy Plays Soccer",
        "Authors": "By Remkiewicz, Frank (ILT) and London, Jonathan",
        "Description": "It's the day of the big game, and Froggy is ready. His soccer team is playing the Wild Things for the City Cup. All Froggy has to do is remember the rule: \"Head it! Boot it! Knee it! Shoot it! BUT DON'T USE YOUR HANDS!\" But Froggy's busy doing cartwheels and picking daisies.  Uh oh, Froggy! Here comes the ball! Budding soccer players and Froggy's many fans will welcome Froggy's latest hilarious adventure.",
        "Category": " Juvenile Fiction , Animals , Frogs & Toads",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Little Rabbit's Loose Tooth",
        "Authors": "By Bate, Lucy",
        "Description": "Children are sure to relate to this story of losing one's first tooth! What should Little Rabbit do with her loose tooth when it comes out in a dish of chocolate ice cream? Throw it away? Wear it on a necklace? Draw stars around it and hang it on the wall? Or leave it under her pillow for the tooth fairy?Little Rabbit solves her dilemma in this gentle classic that captures all the excitement of losing a first tooth. \"Delightfully familiar family dialogue surrounds the momentous loss of a first tooth by a rabbit girl. Large-scale three-color drawings depict the same warm, homey details lodged in the text and clinch the book's sure appeal.\" —Booklist, Starred",
        "Category": " Juvenile Fiction , Animals , Rabbits",
        "Publisher": "Dragonfly Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "All Aboard Cars (Reading Railroad)",
        "Authors": "By Courtney (ILT) and Weir, Catherine Daly",
        "Description": "Text and illustrations introduce various types of automobiles including race cars, emergency vehicles, and cars of the future",
        "Category": " Juvenile Fiction , Transportation , Cars & Trucks",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "What's Happening to Me? A Guide to Puberty",
        "Authors": "By Mayle, Peter",
        "Description": "THE HONEST YET HUMOROUS GUIDE TO PUBERTY THAT GENERATIONS OF PARENTS AND KIDS HAVE ENJOYED   For more than twenty years, the bestselling team behind Where Did I Come From? has helped millions of parents, children and young adults talk about the facts of life in a straightforward yet lighthearted way. What’s Happening to Me? offers an honest, humorous and sympathetic explanation of the physical and emotional changes occurring during adolescence, answering the questions that kids ask most often.   Why is my chest getting bumpy? What's a wet dream?  What's a period?  Why is my voice acting so funny?  Why do I get pimples? What's an erection?  Why am I getting hairy? Why is mine not like his?    Enough strange and wonderful things happen to all of us during puberty to fill a book. So here it is - the book that answers some of the big questions, and explains some of the big changes. One look at the illustrations will tell you that this is not a dull medical textbook. But it does present the facts of life during puberty, and it presents them with honesty, sympathy and a sense of humor.",
        "Category": " Juvenile Nonfiction , Health & Daily Living , Maturing",
        "Publisher": "Lyle Stuart",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The First Golden Book of Geography: A Beginners Introduction to Our World",
        "Authors": "By Watson, Jane Werner",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "8.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Leading The Artful Life Mary Engelbreit",
        "Authors": "By Poplar, Vitta",
        "Description": "For decades, Mary Engelbreit has been living an artful life in her home, opting for inventive decor and design choices that reflect her unique sense of aesthetics, whimsy, and taste. Throughout the years, though, she also has searched for other homes in which imaginative owners proudly showcase creative and innovative decorating techniques and themes. Leading the Artful Life is an extraordinary book that presents a lavish parade of the high-style abodes. These are Mary's all-time favorites from her continuing quest to discover fresh and different design methods and schemes. Home decorators everywhere will love getting a sneak peek into the beautiful homes that caught Mary's eagle eye, and which feature everything from revolutionary New Traditionalist styles and eclectic Bohemian looks to Minimalist motifs and outrageously clever color patterns. Leading the Artful Life will ultimately inspire fascinated readers to establish an artful life at their very own address",
        "Category": " Humor , Form , Essays",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Creating the Peaceful Home",
        "Authors": "By Heuer, Ann Rooney",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Friedman/Fairfax Pub",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Nate the Great Saves the King of Sweden",
        "Authors": "By Sharmat, Marjorie Weinman and Simont, Marc (ILT)",
        "Description": "Rosamond is visiting Scandinavia when she loses something. She wants Nate the Great to find it, even though he doesn’t know what she lost, what country she lost it in, or when she lost it. And he’s thousands of miles away. But if Nate doesn’t take the case, Rosamond plans to hire the King of Sweden. Nate doesn’t want Rosamond to bother the poor king. And he does want the chance to solve his first-ever international case. Can Nate find whatever Rosamond lost without leaving his neighborhood?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Graffiti: Devotions for Girls",
        "Authors": "By O'Connor, Joey and Schmidt, J. David",
        "Description": "Presents fifty-six readings with Bible verses and discussion questions on such topics as dating, parents, popularity, rejection, faith, temptation, and other aspects of daily life",
        "Category": " Young Adult Nonfiction , Religion , Christianity",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    }
]