[
    {
        "Title": "Favorite Desserts Made Lighter (Better Homes and Gardens)",
        "Authors": "By Williams, Mary Major (EDT) and Ward, Patricia A. (EDT)",
        "Description": "Gathers low fat and low calorie recipes for cakes, cookies, pies, tarts, pastries, frozen desserts, and fruit desserts",
        "Category": " Cooking , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "A Lifetime of Secrets: A PostSecret Book",
        "Authors": "By Warren, Frank",
        "Description": "New York Times BestsellerThe award-winning PostSecret project&#39;s most profound and stunning postcards to dateFor the past three years Frank Warren has invited people of all backgrounds and nationalities to send him creatively decorated postcards bearing secrets they have never before revealed. He has shared these PostSecrets on his award-winning blog, www.PostSecret.com, in an internationally traveling art exhibit, and in three electrifying books: the bestselling PostSecret, My Secret, and The Secret Lives of Men and Women.Now, in his most extraordinary book yet, Warren again delves into our collective confessions, presenting a never-before-seen selection of provocative and moving PostSecrets. A Lifetime of Secrets lays bare our private fears, hopes, regrets, and desires, from people as young as eight and as old as eighty. From painful admissions of infidelity to breathtaking revelations and endearing sentiments, Warren’s latest collection will shock and move readers of every age, revealing secrets that have haunted their creators for a lifetime.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "You've Got to Read This: Contemporary American Writers Introduce Stories that Held Them in Awe",
        "Authors": "By Hansen, Ron and Shepard, Jim (EDT)",
        "Description": "Gathers stories by James Baldwin, Jorge Luis Borges, Paul Bowles, Angela Carter, John Cheever, Franz Kafka, Alice Munro, Grace Paley, Leo Tolstoy, Eudora Welty, and Vladimir Nabokov",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Our Dumb World: The Onion's Atlas of the Planet Earth, 73rd Edition",
        "Authors": "By Onion (COR)",
        "Description": "Our Dumb World: The Onion's Atlas of The Planet Earth, 73rd Edition features incorrect statistics on all of the Earth's 168, 182, or 196 independent nations. It also features maps, including a fold-out world map at actual size. Readers will learn about every country from Afghanistan, \"Allah's Cat Box,\" to the Ukraine, \"The Bridebasket of Europe.\"Today's news-parody consumer cannot possibly understand made-up current events without the context of fake world history and geography. That is why The Onion is publishing a world atlas: to help us.Our Dumb World is an invaluable tool for any reader interested in overthrowing a weakened government in East Asia, exploiting a developing nation in Africa, or for directions to tonight's party at Erica's. It is a reference guide to 250,000 of the world's most important places, such as North Korea's Trench of Victory, the Great Human Pyramid of Egypt, and Saudi Arabia's superhighway, the Mohammedobahn.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Anatomy of a Business Plan",
        "Authors": "By Pinson, Linda",
        "Description": "",
        "Category": " Business & Economics , Development , Business Development",
        "Publisher": "Kaplan Business",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Top Ten",
        "Authors": "By Pearson, Ryne Douglas and Pearson, Douglas Ryne",
        "Description": "Michaelangelo is an unusual killer, a man tortured by a painful past, mesmerized by a bizarre artistic vision, who believes he is an artist of transcendent and consummate talent. The FBI, frantic to discover something about his motives after he strikes at a small-town post office in upstate New York, assigns Ariel Grace to its task force. When Ariel sees the security video taken at the crime scene, she is convinced she's found the twisted logic behind his rage: his all-consuming shame at appearing at number ten on the FBI's Ten Most Wanted List.Unknown to either Michaelangelo or Grace, a deep-undercover FBI agent is posing as criminal number five, and he appears next in Michaelangelo's sights. Once the chase ensues and Grace learns she is the only one who can save her fellow agent, all three become desperate to catch their quarry before they are caught themselves.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Alfred Hitchcock's Down by the Old Bloodstream",
        "Authors": "By Alfred Hitchcock, editor",
        "Description": "",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Alfred Hitchcock Presents: This One Will Kill You",
        "Authors": "By Alfred Hitchcock, editor",
        "Description": "",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "How to Prepare for the AP European History (BARRON'S HOW TO PREPARE FOR THE AP EUROPEAN HISTORY ADVANCED PLACEMENT EXAMINATION)",
        "Authors": "By Eder, James M.",
        "Description": "Students diagnose strengths and weaknesses with two full-length model tests, which come with answers and explanations. An extensive subject review covers the development of medieval Europe, the Protestant Reformation, the Renaissance and Enlightenment, and the evolution of modern European nation states to the present day.",
        "Category": " Study Aids , Advanced Placement",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Alfred Hitchcock Presents 12 Stories for Late at Night",
        "Authors": "By Alfred Hitchcock",
        "Description": "",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Tropic of Night",
        "Authors": "By Gruber, Michael",
        "Description": "Not since The Secret History has a novel so flawlessly married the ferocious intensity of an unforgettable thriller with the depth, daring, and nuance of our most celebrated literary fiction. Tropic of Night is a virtuoso performance -- an unforgettably accomplished novel, a masterpiece of electricity and ambition.Jane Doe was a promising anthropologist, an expert on shamanism. Now she's nothing, a shadow: after faking her own suicide, she's living under an assumed identity in Miami with a little girl to protect. Everyone thinks she's dead. Or so she hopes.Then the killings start, a series of ritualistic murders that terrifies all of Miami. The investigator is Jimmy Paz, a Cuban-American police detective. There are witnesses, but they can recall almost nothing of the events, as though their memories have been erased -- as if a spell has been cast on each of them. Equally bizarre is the string of clues Paz uncovers: a divination charm, exotic drugs found in the bodies of the victims, a century-old report telling of a secret place in the heart of Africa.These clues point Paz inexorably toward the fugitive, Jane Doe, and force Jane to realize that the darkness she has fled is seeking her out, hunting her down. By the time her path intersects with Jimmy Paz's, the two will be thrust into a cataclysmic battle between good and an evil unimaginable to the Western mind.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Waiting for the Barbarians: A Novel",
        "Authors": "By Coetzee, J M",
        "Description": "A modern classic by Nobel Laureate J.M. Coetzee. His latest novel, The Schooldays of Jesus, is now available from Viking. Late Essays: 2006-2016 will be available January 2018. For decades the Magistrate has been a loyal servant of the Empire, running the affairs of a tiny frontier settlement and ignoring the impending war with the barbarians. When interrogation experts arrive, however, he witnesses the Empire's cruel and unjust treatment of prisoners of war. Jolted into sympathy for their victims, he commits a quixotic act of rebellion that brands him an enemy of the state.J. M. Coetzee's prize-winning novel is a startling allegory of the war between opressor and opressed. The Magistrate is not simply a man living through a crisis of conscience in an obscure place in remote times; his situation is that of all men living in unbearable complicity with regimes that ignore justice and decency.Mark Rylance (Wolf Hall, Bridge of Spies), Ciro Guerra and producer Michael Fitzgerald are teaming up to to bring J.M. Coetzee's Waiting for the Barbarians to the big screen.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "Civil Procedure: Examples and Explanations",
        "Authors": "By Glannon, Joseph W.",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Walking the Blue Ridge: A Guide to the Trails of the Blue Ridge Parkway",
        "Authors": "By Adkins, Leonard M.",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Univ of North Carolina Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "A book about God;",
        "Authors": "By Florence Mary Fitch",
        "Description": "",
        "Category": "",
        "Publisher": "Lothrop, Lee and Shepard Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "A Flash of Red",
        "Authors": "By Harvey, Clay",
        "Description": "A Flash of Red introduces a major new thriller writer and a major new thriller hero - Tyler Vance, special operative turned family man, who just can't seem to avoid the trouble that turns up at his door.Vance thought he'd left the violence behind when he quit the military twenty years ago and moved to North Carolina. Now a freelance gun writer and the father of four-year-old Cullen, he wants nothing more than to forget those days, but that was before the bank robber pointed a gun at him, before Vance's instincts took over and he dropped the gunman first, before he found out just whom he'd killed and what it meant. For the gunman had family too, and they definitely believe in an eye for an eye...or maybe two.Strong, smart-tongued, surrounded by a memorable cast of friends and family, each of whom contributes as the battle escalates, Vance is a wholly likable hero, lively, inventive, and tough.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "The Thirteenth Tale",
        "Authors": "By Setterfield, Diane",
        "Description": "When Margaret Lea opened the door to the past, what she confronted was her destiny.All children mythologize their birth...So begins the prologue of reclusive author Vida Winter's collection of stories, which are as famous for the mystery of the missing thirteenth tale as they are for the delight and enchantment of the twelve that do exist.The enigmatic Winter has spent six decades creating various outlandish life histories for herself -- all of them inventions that have brought her fame and fortune but have kept her violent and tragic past a secret. Now old and ailing, she at last wants to tell the truth about her extraordinary life. She summons biographer Margaret Lea, a young woman for whom the secret of her own birth, hidden by those who loved her most, remains an ever-present pain. Struck by a curious parallel between Miss Winter's story and her own, Margaret takes on the commission.As Vida disinters the life she meant to bury for good, Margaret is mesmerized. It is a tale of gothic strangeness featuring the Angelfield family, including the beautiful and willful Isabelle, the feral twins Adeline and Emmeline, a ghost, a governess, a topiary garden and a devastating fire. Margaret succumbs to the power of Vida's storytelling but remains suspicious of the author's sincerity. She demands the truth from Vida, and together they confront the ghosts that have haunted them while becoming, finally, transformed by the truth themselves. The Thirteenth Tale is a love letter to reading, a book for the feral reader in all of us, a return to that rich vein of storytelling that our parents loved and that we loved as children. Diane Setterfield will keep you guessing, make you wonder, move you to tears and laughter and, in the end, deposit you breathless yet satisfied back upon the shore of your everyday life.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "When Madeline Was Young: A Novel",
        "Authors": "By Hamilton, Jane",
        "Description": "Jane Hamilton, award-winning author of The Book of Ruth and A Map of the World, is back in top form with a richly textured novel about a tragic accident and its effects on two generations of a family.When Aaron Maciver’s beautiful young wife, Madeline, suffers brain damage in a bike accident, she is left with the intellectual powers of a six-year-old. In the years that follow, Aaron and his second wife care for Madeline with deep tenderness and devotion as they raise two children of their own.Narrated by Aaron's son, Mac, When Madeline Was Young chronicles the Maciver family through the decades, from Mac’s childhood growing up with Madeline and his cousin Buddy in Wisconsin through the Vietnam War, through Mac’s years as a husband with children of his own, and through Buddy’s involvement with the subsequent Gulf Wars. Jane Hamilton, with her usual humor and keen observations of human relationships, deftly explores the Maciver's unusual situation and examines notions of childhood (through Mac and Buddy’s actual youth as well as Madeline’s infantilization) and a rivalry between Buddy’s and Mac’s families that spans decades and various wars. She captures the pleasures and frustrations of marriage and family, and she exposes the role that past relationships, rivalries, and regrets inevitably play in the lives of adults. Inspired in part by Elizabeth Spencer’s Light in the Piazza, Hamilton offers an honest and exquisite portrait of how a family tragedy forever shapes and alters the boundaries of love.",
        "Category": " Fiction , Literary",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Good Guy",
        "Authors": "By Koontz, Dean R.",
        "Description": "\"Are you him?\" \"Who else would I be?\" \"You look so ... ordinary.\" \"I work at it.\"Timothy Carrier, having a beer after work at his friend's tavern, enjoys drawing eccentric customers into amusing conversations. But the jittery man who sits next to him tonight has mistaken Tim for someone very different - and passes to him a manila envelope full of cash.\"Ten thousand now. You get the rest when she's gone.\"The stranger walks out, leaving a photo of the pretty woman marked for death, and her address. But things are about to get worse. In minutes another stranger sits next to Tim. This one is a cold-blooded killer who believes Tim is the man who has hired him. Thinking fast, Tim says, \"I've had a change a heart. You get ten thousand - for doing nothing. Call it a no-kill fee.\" He keeps the photo and gives the money to the hired killer. And when Tim secretly follows the man out of the tavern, he gets a further shock: the hired killer is a cop.Suddenly, Tim Carrier, an ordinary guy, is at the center of a mystery of extraordinary proportions, the one man who can save an innocent life and stop a killer far more powerful than any cop ... and as relentless as evil incarnate. But first Tim must discover within himself the capacity for selflessness, endurance, and courage that can turn even an ordinary man into a hero, inner resources that will transform his idea of who he is and what it takes to be The Good Guy.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "3:16: A Study for Individuals or Small Groups",
        "Authors": "By Lucado, Max",
        "Description": "If 9/11 are the numbers of terror and despair, then 3:16 are the numbers of hope. Best-selling author Max Lucado leads readers through a word-by-word study of John 3:16, the passage that he calls the \"Hope Diamond\" of scripture. The study includes 12 lessons that are designed to work with both the trade book and the Indelible DVD for a multi-media experience.",
        "Category": " Religion , Biblical Studies , Bible Study Guides",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Advances in Clinical Psychoanalysis",
        "Authors": "By Gedo, John E.",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Intl Universities Pr Inc",
        "Price Starting With ($)": "10.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Tribute",
        "Authors": "By Roberts, Nora",
        "Description": "Virginia's Shenandoah Valley, in the shadow of the Blue Ridge Mountains, is a long way from Hollywood. And that's exactly how Cilla McGowan likes it.Cilla, a former child star, has found a more satisfying life working with her hands to restore homes from floor to ceiling - and has come here to her grandmother's farm-house, tools at her side, to rescue it from ruin. Sadly, no one had been able to save her grandmother, the legendary Janet Hardy. An actress with a golden voice and a tumultuous life, Janet entertained glamorous guests and engaged in decadent affairs - but died of an overdose in this very house more than thirty years ago. To this day, Janet haunts Cilla's dreams. And during her waking hours, Cilla is haunted by her melodramatic, five-times-married mother, who carried on in the public spotlight and never gave her a chance at a normal childhood. By coming to the East Coast, rolling up her sleeves, and rehabbing this wreck of a house, Cilla intends to take a shot at finding some kind of normalcy for herself.Cilla has her work cut out for her - the house, once a place of comfort and simple rural beauty, is long neglected, crumbling, the grounds choked by weeds. Plunging into the project with gusto, she's almost too busy and exhausted to notice her neighbor, graphic novelist Ford Sawyer - but his lanky form, green eyes, and easy, unflappable humor (not to mention his delightfully ugly dog, Spock) are hard to ignore. Determined not to carry on the family tradition of ill-fated romances, Cilla steels herself against Ford's quirky charm, but she can't help indulging in a little fantasy.But love and a peaceful life may not be in the cards for Cilla. In the house's cluttered attic, she has found a cache of unsigned letters, tied with a faded red ribbon, suggesting that Janet Hardy was pregnant when she died - and that the father of her child was a local married man. Cilla can't help but wonder what really happened all those years ago. The mystery only deepens with a series of cruel and intimidating acts and a frightening, violent assault. And if Cilla and Ford are unable to sort out who is targeting her and why, she may, like her world-famous grandmother, be cut down in the prime of her life.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Hope in Times of Trouble (Seeking Answers in Life's Struggles)",
        "Authors": "By rbc-ministries",
        "Description": "",
        "Category": "",
        "Publisher": "Discovery House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Interactions: A Thematic Reader",
        "Authors": "By Moseley, Ann and Harris, Jeanette",
        "Description": "Interactions: A Thematic Reader is designed to help students discover meaning in what they read and to convey meaning in what they write. The text's readings and accompanying apparatus--which have been class tested and proven effective through six previous editions--guide students from a consideration of self to an awareness of how the self interacts with other people and phenomena. The book explains to students the process and interdependence of reading and writing, stressing the connections students can make between their own experiences and what they read. It also introduces them to prewriting techniques such as freewriting, brainstorming, mapping, clustering, and journals. The Seventh Edition includes approximately ninety reading selections, about one-third of which are new. Selections are organized into thematic units that guide students from a consideration of self to an examination of close human relationships and finally to more abstract topics such as work and society. The selections represent a wide range of voices, topics, and sources, including a balance of male and female authors and significant contributions by culturally diverse writers. This diversity allows students both to encounter new voices and to identify with familiar ones. The readings also provide students with effective models and styles of writing.",
        "Category": " Language Arts & Disciplines , Reading Skills",
        "Publisher": "Houghton Mifflin College Div",
        "Price Starting With ($)": "5.92",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Lee Bailey's Tomatoes",
        "Authors": "By Eckerle, Tom (PHT) and Bailey, Lee",
        "Description": "A tribute to the tomato offers a collection of tomato recipes, including tomato vinaigrette, ratatouille, tomato bread pudding, tomato aspic, sun-dried tomato delights, tomato salsa, and more. 50,000 first printing.",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Eating for Life: Recipes to help heal and prevent diseases (Better Homes & Gardens)",
        "Authors": "By Fuller, Kristi (EDT), Better Homes and Gardens Books (EDT), and Better Homes and Gardens Books (COR)",
        "Description": "An innovative cookbook that features foods that contain naturally occurring health benefits.Taste-tempting recipes that help improve mood, boost immunity, and promote well-being and good health.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Untouchable (Private, Book 3)",
        "Authors": "By Brian, Kate and Peploe, Julian (CON)",
        "Description": "Cheating, partying, blackmail, and now...murder? Can the Billings Girls remain untouchable?   Reed's boyfriend, Thomas Pearson -- the popular, easygoing, irresistibly handsome and charismatic boy she fell in love with -- is dead. No one knows how it happened, and everyone is after the truth. Or are they?   Life at Easton Academy begins to feel very different. Taylor is acting like the poster child for Prozac, Kiran is spiking her cornflakes, Noelle is being kind of...nice, and Arianna keeps floating along as if nothing has happened.   Thanksgiving break arrives and Reed and Josh find themselves alone on campus. They are forced to confront the feelings they've been hiding. Those feelings combined with an empty campus result in the hottest hookup Reed could possibly imagine. But when Reed breaks the news about Josh to the Billings Girls, there's no fun game of tell-all. Instead, Josh begins to look like suspect No. 1 in the murder of Thomas Pearson.   The perfect life Reed has constructed as a Billings Girl begins to crumble. And as everyone becomes more convinced of Josh's guilt, Reed's private suspicions lead her somewhere she doesn't want to go.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Private (Private, Book 1)",
        "Authors": "By Brian, Kate",
        "Description": "Tradition, Honor, Excellence...and secrets so dark they're almost invisible   Fifteen-year-old Reed Brennan wins a scholarship to Easton Academy -- the golden ticket away from her pill-popping mother and run-of-the-mill suburban life. But when she arrives on the beautiful, tradition-steeped campus of Easton, everyone is just a bit more sophisticated, a bit more gorgeous, and a lot wealthier than she ever thought possible. Reed realizes that even though she has been accepted to Easton, Easton has not accepted her. She feels like she's on the outside, looking in.   Until she meets the Billings Girls.   They are the most beautiful, intelligent, and intensely confident girls on campus. And they know it. They hold all the power in a world where power is fleeting but means everything. Reed vows to do whatever it takes to be accepted into their inner circle.   Reed uses every part of herself -- the good, the bad, the beautiful -- to get closer to the Billings Girls. She quickly discovers that inside their secret parties and mountains of attitude, hanging in their designer clothing-packed closets the Billings Girls have skeletons. And they'll do anything to keep their secrets private.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Mediterranean Light",
        "Authors": "By Shulman, Martha Rose",
        "Description": "Provides Mediterranean-style recipes for breads, salads, soups, pasta, pizza, vegetables, fish, chicken, rabbit, and desserts",
        "Category": " Cooking , Regional & Ethnic , Mediterranean",
        "Publisher": "Bantam",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Invitation Only (Private, Book 2)",
        "Authors": "By Brian, Kate",
        "Description": "Reed Brennan's future is looking as bright as the two-karat diamonds in her new housemates' ears. Being accepted to the most prestigious private boarding school in the country wasn't enough for Reed. She had to break every rule to do it, but she has accomplished the impossible:   Reed is a Billings Girl now.   And with her new status come respect, envy, and, most important, opportunity. Not to mention the parties. Unfortunately, at the next illicit party in the Easton campus woods, her roommate snaps some pictures of Reed in more than one compromising position. She uses the photos to blackmail Reed: Dig up dirt on the most powerful and popular Billings Girls or she will have Reed expelled.   And speaking of parties, the Legacy is coming up. It's the invitation-only Halloween party in NYC and it's rumored that Thomas -- Reed's MIA boyfriend -- will be making an appearance there. Too bad Reed isn't even close to invited.   Life as a Billings Girl is every bit as glamorous as Reed imagined. What she didn't bargain for is the tangled web of private lies these girls weave.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Your Successful Real Estate Career",
        "Authors": "By Edwards, Kenneth W.",
        "Description": "",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "How to Think Like a CEO",
        "Authors": "By Benton, D. A.",
        "Description": "Drawn on in-depth interviews with hundreds of the nation's chief executive officers, an inside view of the traits that every executive must have to make it to the top includes knowledge of how to make contributions, learn boundaries, hire people smarter than you, and much more. Reprint.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Earth Rise",
        "Authors": "By Dietz, William C.",
        "Description": "It took three days for the Saurons to destroy the great cities of the world, wrapping the earth in a blanket of fire and ash. More than three billion people perished under the alien assault. But the invaders stopped short of complete annihilation. They needed survivors. They needed slaves.Jack Manning was one of them. Forced into an uneasy alliance with the enemy, he rose from Sauron slave to Chief of Security in a government instated to ensure human cooperation. But Manning's heart has always been with the rebels. He knows the purpose behind the construction of the oppressive alien temples - incubators for a new generation of Saurons that will one day make the takeover of Earth complete. Unless someone fights back.Spearheading the movement with Manning is President Alex Franklin - a seeming puppet of the Saurons who's decided to start pulling his own strings. A revolution cloaked in deepest secrecy has begun as two secret agents recruit for an underground war. And the ultimate battle for supremacy is about to be waged.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Ace",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Eat Up Slim Down (Prevention Healthy Cooking) by Jane Kirby, David Joachim (2001) Hardcover",
        "Authors": "By Jane Kirby, David Joachim",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Staying Healthy with Nutrition: The Complete Guide to Diet and Nutritional Medicine",
        "Authors": "By Haas, Elson M.",
        "Description": "",
        "Category": " Medical , Nutrition",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "8.04",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "The Whole Foods Market Cookbook: A Guide to Natural Foods with 350 Recipes",
        "Authors": "By Petusevsky, Steve and Watts, David (ILT)",
        "Description": "Who else but Whole Foods Market could create a cookbook so fresh, so appealing, so full of valuable information, and so perfect for the way we are all cooking and eating today? Bursting with winning recipes, healthful cooking advice, cheerful guidance through the new language of natural foods, wine and cheese information, and a comprehensive glossary, this is a “thank goodness it’s here” kind of cookbook.The world’s largest natural and organic supermarket has created 350 contemporary recipes that are destined to become new classics. Whole Foods Market presents the most popular dishes from their prepared foods section, combined with brand-new recipes that showcase the wide variety of delicious ingredients available today. Far from “crunchy granola” fare, sophisticated recipes include Shrimp and Scallop Chalupas, Hazelnut Crusted Pork Loin, Thai-Style Green Curry Chicken, Griddled Sesame and Garlic Tofu with Wilted Bok Choy, Honey Jalapeño Barbecue Sauce, and Maple Butterscotch Macadamia Blondies. From meat and fish to tofu and vegetables, kid-friendly dishes to one-pot meals, the choices are dazzling, and with more than 200 of the recipes either vegetarian or vegan, the options are diverse.But the recipes are just the beginning. Steve Petusevsky and Whole Foods Market Team Members shed light on the confusing world of natural foods, presenting interesting, accessible information and all kinds of helpful cooking advice. The Whole Foods Market Cookbook is as welcoming and fun as a trip to one of their stores. Find out the answers to questions such as:How do I cook quinoa?What are the different kinds of tofu, and how do I know which to buy?How should I stock a great natural foods pantry?What are good alternatives to wheat pasta?What does “organic” mean?A glossary with more than 150 definitions provides a great reference for all of the terms and ingredients that have been edging their way into our vocabularies and kitchens. With recipe bonuses, tips from the team, variations, sidebars, and 30 menu suggestions, this is the natural foods guide that so many of us have been waiting for.",
        "Category": " Cooking , Specific Ingredients , Natural Foods",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "The Best of Gourmet: A Year of Celebrations (20th Anniversary Edition)",
        "Authors": "By Gourmet (EDT)",
        "Description": "Nowadays, everyone who entertains is looking for outstanding casual fare that will allow them to spend more time with their guests. Dishes must be quick and easy to prepare (or able to be made ahead) and filled with the purest ingredients for optimum flavor. The Best of Gourmet, Featuring the Flavors of Thailand is filled with twenty-eight such menus-most are very relaxed, all are absolutely delicious.For example, after a chilly day on the slopes, you may want to treat your houseguests to A Ski House Dinner. Begin the evening around the fire with champagne and a large platter of ever-so-tender smoked salmon with cilantro cream. Later, roasted veal chops with shallots, tomatoes, and olive jus nestled on pillows of soft polenta make a rich, indulgent entrée. And before everyone retires, a heavenly warm chocolate raspberry pudding cake, made the day before and reheated, is served with a glass of cognac. When the summer heats up, why not spend A Weekend at the Shore with friends? You'll have three clever menus in hand that take advantage of the season's abundant fresh produce, include plenty of make-ahead dishes, and satisfy hearty seaside appetites. On Saturday morning you can serve Breakfast on the Beach with buttery-rich baked blueberry-pecan French toast. Lunch Indoors includes a serve-yourself composed salad of classic favorites and a lovely rhubarb rice pudding. Then, after a long day in the sun, Dinner on the Deck promises a seafood meal to remember with curry-marinated mussels, followed by grilled lobster with Southeast Asian dipping sauce. Or perhaps a last-minute Beyond Backyard Basics dinner is closer to what you had in mind? This little gem of a menu features ratatouille with penne-a heavenly jumble of roasted eggplants, onions, yellow squash, and red bell peppers, with plum tomatoes, garlic, thyme, parsley, and basil. For dessert, multicolored grapes perched atop pastry cream in puff pastry shells make a scrumptious and ever-so-pretty choice.So which menu will you try first? You'll find more than eighty pages of exquisite full-color photographs to help you decide. Altogether, this volume holds more than 350 recipes-including the very best recipes that appeared in Gourmet's food columns during 1999. There are hundreds of dishes that can be made in forty-five minutes or less (look for the clock symbol ð); plenty of leaner and lighter selections (look for the feather symbol F); seasonal ideas for everything from apples to zucchini; and an impressive array of tempting sweets and snacks.This year's Cuisines of the World section turns to the intriguing flavors of Thailand with a traditional dinner for eight and a collection of Thai snacks. Dishes such as steamed red snapper with ginger, grilled beef salad, fish cakes, and coconut ice cream demonstrate the sweet, sour, hot, and salty tastes of this fascinating country. Informative primers and exquisite full-color photos add further insight.Twenty-four more brand-new recipes appear in a special section featuring Unusual Pastas and Grains. From fresh rice noodles to Israeli couscous to wheat berries, and much more, these unique pantry items will undoubtedly expand your palette of flavors.Just when you thought you had tasted it all, along comes a cookbook that opens up a world of new possibilities-The Best of Gourmet",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Lifelaunch: A Passionate Guide to the Rest of Your Life",
        "Authors": "By Hudson, Frederic M. and McLean, Pamela D.",
        "Description": "",
        "Category": "",
        "Publisher": "Hudson Institute",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Snow White's Feast",
        "Authors": "By Walt Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Twin Boooks",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Edward in Deep Water (Edward the Unready)",
        "Authors": "By Wells, Rosemary",
        "Description": "Lively watercolors mark the tale of little Edward, a bear who sometimes does not feel quite ready for what he has to do, as he goes to Georgina's pool party and is ridiculed for using his water wings.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Dial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Losing Nelson",
        "Authors": "By Unsworth, Barry",
        "Description": "Every day, Charles Cleasby relives the events of Lord Horatio Nelson's life. He holds no regard for year-by-year chronology, so his life is a bustle of anniversaries: a political confrontation in 1797, for instance, might be followed immediately by a climactic sea battle in 1805. He reenacts the battles in his basement on a huge blue-glass table, moving the perfectly rendered ships that represent Nelson's Royal Navy and its enemies, thus reliving Nelson's triumphs.Losing Nelson is a novel of obsession, the story of a man unable to see himself separately from the hero he mistakenly idolizes. Cleasby is, in fact, a Nelson biographer run amok. He is convinced that Nelson - Britain's greatest admiral, who finally defeated Napoleon, and lost his own life, in the Battle of Trafalgar - is the perfect hero, but in his research he has come upon an incident of horrifying brutality in Nelson's military career that simply stumps all attempts at glorification.Further, Cleasby's new assistant, Miss Lily of Avon Secretarial Services, insists on maintaining a running criticism of Nelson as she takes dictation, not to mention the objections she voices to the isolated, sheltered way Cleasby lives his life. Something has to give, and give it does - in the most astonishing and entertaining of ways.",
        "Category": " Fiction , Literary",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "American Jewish Album",
        "Authors": "By Schoener, Allon",
        "Description": "Over 500 illustrations document the Jewish contribution to American politics, commerce, industry, finance, labor, and the arts and highlight this survey of daily life and great Jewish personalities",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Rizzoli",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1983"
        }
    },
    {
        "Title": "Annual Report of the State Geologist for the Year 1899. Report on Forests",
        "Authors": "By Geological Survey of New Jersey",
        "Description": "",
        "Category": "",
        "Publisher": "Trenton",
        "Price Starting With ($)": "32.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "Easy Roses for North American Gardens",
        "Authors": "By Christopher, Thomas",
        "Description": "Presents advice for growing roses in every part of the United States and Canada, and provides information on shopping for roses, soil preparation, planting, maintenance, and thwarting pests and diseases",
        "Category": " Gardening , Flowers , Roses",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Taylor's Guide to Growing North America's Favorite Plants: Proven Perennials, Annuals, Flowering Trees, Shrubs, & Vines for Every Garden",
        "Authors": "By Ellis, Barbara W.",
        "Description": "With this major, oversized new book in the Taylor's series, gardeners need look no further for complete, sensible, and specific explanations of everything they need to know about growing a host of the most beloved plants. \"Where can I get it?\" \"Which is the best cultivar for my garden?\" \"Should I fertilize it when I plant it?\" \"Do I cut it back after it flowers?\" \"Can I divide it?\" To these and hundreds of other questions, readers will find practical answers and helpful, encouraging advice. Includes: directions for growing new plants from seeds, cuttings, division, and more, with specific instructions for the best method of propagating each species; ideas for how to use plants in the landscape and suggestions for suitable companion species; and a techniques glossary that gives step-by-step instructions for essential tasks such as planting, dividing, and propagating. The author takes the mystery out of selecting such plants as irises and daylilies, which come in a mind-boggling number of varieties, by describing the best choices for the reader's own garden.",
        "Category": " Gardening , House Plants & Indoor",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "New Kitchen Garden (DK Living)",
        "Authors": "By Pavord, Anna",
        "Description": "English gardening expert Anna Pavord guides the reader in creating a productive and beautiful kitchen garden, covering topics from design and structure to cultivar selection. As with most British fruit and vegetable guides, many suggested plants are not available in the US, but the sage advice and inspiring photographs more than compensate. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Gardening , Vegetables",
        "Publisher": "Dk Pub",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "After Life: Answers From the Other Side",
        "Authors": "By Edward, John",
        "Description": "Internationally acclaimed psychic medium John Edward takes his talents to new levels and new countries in his fourth book, AFTER LIFE: Answers from the Other Side.            Join John and a documentary crew “Down Under” in Australia and across the United States, where he demonstrates once again that grief, healing, and hope are eternally intertwined and universal. John answers your most often-asked questions about how the mediumship process works on the “other side,” while taking you on the inside of his own personal life as a husband and new father. He shares what he’s learned through his own recent, personal losses and demonstrates that you’re never too late to forgive—and never too far away to love.                In After Life, as he does on his highly rated hit show, Crossing Over with John Edward, John will also connect you with celebrities both here and on the other side—because, as John happily notes, there are no red-velvet ropes or VIP sections over there!",
        "Category": " Body, Mind & Spirit , Parapsychology , ESP (Clairvoyance, Precognition, Telepathy)",
        "Publisher": "Princess Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Strange Battles of the Civil War",
        "Authors": "By Garrison, Webb B.",
        "Description": "Experience the Civil War like never before....Strange Battles of the Civil War is a captivating look at 23 battles from the War Between the States that did not unfold as anticipated. From unexpected victories to devastating tactical blunders, from mistaken marching orders to unlikely participants (including animals!), this collection of surprising but true stories offers an unusual perspective on one of the bloodiest conflicts in United States history.Discover extraordinary Civil War battle stories like the following:December 20, 1861: In Dranesville Virginia, hungry horses trigger a skirmish when their Union and Confederate handlers fight over hard-to-find fodder for their animals, resulting in 250 casualties.May 15, 1862: At Drewry's Bluff, Virginia, the Confederate capital of Richmond is saved when Union navy guns cannot be elevated high enough to fire upon the city on the bluffSeptember 8, 1863: At Sabine Pass, vastly outnumbered Confederate soldiers manage to thwart the advance on Texas and deliver an astounding defeat to Union forcesDecember 23-27, 1864: At Fort Fisher, a gun powder plot fizzles and the career of a Union general is ended after a two-day bombardmentFeaturing fascinating Civil War facts, anecdotes, photos, and illustrations, this is a must-have addition to any Civil War collection, and makes the perfect gift for students, scholars, and history enthusiasts everywhere.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Cumberland House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Team Bush : Leadership Lessons from the Bush White House",
        "Authors": "By Kettl, Donald F.",
        "Description": "LEADERSHIP STRATEGIES BEHIND ONE OF THE MOST POPULAR PRESIDENTS IN HISTORY How the Commander-in-Chief commands George W. Bush has surprised even his harshest critics with his leadership talents and discipline. As this country's first MBA president, Bush formed his unique leadership style managing businesses, not government offices. Team Bush is the first book to explore these unique methods and tactics he has employed to become one of the nation's most popular commanders in chief in recent history. From \"hiring\" the most diverse and effective cabinets in history, to dealing with the crisis and war sparked by the events of September 11th, this compelling leadership book takes readers into the mind and methods of America's 43rd president, and shows managers how these methods can be used to boost productivity in their own organizations. This fast-paced book pulls no punches as it showcases President Bush's successes and strengths while detailing his mistakes and weaknesses. Focusing on the actual events and outcomes of Bush's first two years in office, it discusses:  The strategy behind Bush's coup in the mid-term election  Lessons learned from his managing of the September 11th crisis  How Bush recognizes and learns from his very public mistakes",
        "Category": " Political Science , History & Theory",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Designing Successful Grant Proposals",
        "Authors": "By Orlich, Donald C.",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "Assn for Supervision & Curriculum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Surviving Debt: A Guide for Consumers in Financial Stress",
        "Authors": "By Loonin, Deanne, Klein, Gary, Sheldon, Jonathan A., and National Consumer Law Center (COR)",
        "Description": "",
        "Category": "",
        "Publisher": "Natl Consumer Law Center",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Prudent Investor's Guide to Beating the Market",
        "Authors": "By Bowen, John J., Reinhardt, Carl H., and Werba, Alan B.",
        "Description": "The Prudent Investor's Guide to Beating the Market is the first book to offer individual investors true insights into how to beat the best-of-the-best mutual funds in both good and bad markets. Using the techniques the authors call \"Asset Class Investing,\" you can secure a solid financial future for you and your family.",
        "Category": "",
        "Publisher": "Irwin Professional Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Creating Your Future: Personal Strategic Planning for Professionals",
        "Authors": "By Morrisey, George L.",
        "Description": "A practical guide to help professional (within organization and/or independent contractors) use strategic planning for their own professional success and satisfying personal life. Worksheets, checklists, and charts help clarify personal values, financial concerns, career growth objectives, and business interests.",
        "Category": " Business & Economics , General",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Winning the Salary Game: Salary Negotiation for Women",
        "Authors": "By Chastain, Sherry",
        "Description": "Examples and case studies are interspersed with descriptions of the art, fundamentals, and strategies of negotiating a salary increase designed to help women increase self-esteem and earn wages on par with those of men and which reflect fairly job abilities and performance",
        "Category": "",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "9.97",
        "Publish Date": {
            "Month": "November",
            "Year": "1980"
        }
    },
    {
        "Title": "The Book of Words: Talking Spiritual Life, Living Spiritual Talk (Sefer Shel Devarim)",
        "Authors": "By Kushner, Lawrence",
        "Description": "\"According to the Hebrew Bible, God made the world with words. God just spoke and the world became reality. (The Aramaic for 'I create as I speak' is avara k'davara, or in magician’s language, abracadabra.) ... This does not protect words from the numbing effects of overuse in any religious tradition.... We need to dust off the words, shake away the accretions, wonder again about what they originally might have meant and enable ourselves to live in the word.\"—from the IntroductionWith creativity and poetry (and occasional heresy) Kushner dusts off thirty classical Hebrew words, shakes them free of the effects of generations of overuse, \"re-translates\" them and liberates their ancient holy power. The result is a contemporary spiritual guide for your personal religious life.According to the Hebrew Bible, God made the world with words. God just spoke and the world came into being. Words therefore are not merely sounds signifying something else; they are instruments of creation, primary reality itself. They need only to be read, spoken and interpreted. And to know them is to know reality itself.Kushner has designed the book himself, seamlessly blending graphics and content. In doing so he evokes the aesthetics of an ancient manuscript and a vision of our power to shape the future.Each finely crafted chapter begins with a Hebrew word and Kushner’s provocative English translation. At the bottom of the page is a transliteration of the Hebrew along with its more customary English rendering. In addition to his own intriguing definition, he includes a biblical citation anchoring the word, along with a more recent text showing the word’s evolution. Finally, we are offered a personal, meditative exercise designed to enable you to “live in the word.”",
        "Category": " Religion , Spirituality",
        "Publisher": "Jewish Lights",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Low-Fat & Luscious Italian (Better Homes and Gardens)",
        "Authors": "By Fuller, Kristi (EDT) and Thomas, Kristi M. (EDT)",
        "Description": "A variety of Italian-style main dishes, appetizers, soups, breads, side dishes, and desserts is presented with low-fat and low-cholesterol cooking instructions, accompanied by menu plans and nutritional information.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Silent No More: Confronting America's False Images of Islam",
        "Authors": "By Findley, Paul",
        "Description": "",
        "Category": " Religion , Islam , Theology",
        "Publisher": "Amana Pubns",
        "Price Starting With ($)": "8.64",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The Queen of Clean's Complete Cleaning Guide: Banish Dirt from Your Castle Forever with 2,047 Queen-Tested Tips",
        "Authors": "By Cobb, Linda",
        "Description": "",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Living Gluten-Free For Dummies",
        "Authors": "By Korn, Danna and Fasano, Alessio, M.D. (FRW)",
        "Description": "Includes 65 delicious gluten-free recipes plus tips on eating outFind out how easy and tasty it can be to go gluten free!If you have a wheat allergy, gluten intolerance, celiac disease, or you just want to enjoy the benefits of a diet free of wheat, barley, and rye, then this guide is for you. Author Danna Korn explains the medical problems associated with gluten and shows you step by step how to make the transition to a gluten-free lifestyle - and love it!Discover how toUnderstand what you can and can't eatShop and decipher food labelsCook crowd-pleasing gluten-free mealsEat gluten-free at restaurants and partiesRaise happy gluten-free kids",
        "Category": " Cooking , Specific Ingredients , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Don't Cry, Big Bird (A Sesame Street Start-to-Read Book)",
        "Authors": "By Leigh, Tom (ILT), Children's Television Workshop (COR), and Roberts, Sarah",
        "Description": "Big Bird feels left out because he is too big to take part in his friends' child-sized games, but Bert comes up with a way to make Big Bird feel better",
        "Category": "",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1981"
        }
    },
    {
        "Title": "Southern Living 1995 Annual Recipes (Southern Living Annual Recipes)",
        "Authors": "By Leisure Arts, Southern Living",
        "Description": "Drawing on recipes and food stories from an entire year of \"Southern Living,\" this reference to outstanding cuisine offers hundreds of recipes, entertaining ideas, and garnishing tips",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Days Of '41: Pearl Harbor Remembered",
        "Authors": "By Sheehan, Ed",
        "Description": "",
        "Category": "",
        "Publisher": "Honolulu, HI, U.S.A.: Arizona Memorial Museum Association, 1987",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Velveteen Rabbit, or, How Toys Become Real",
        "Authors": "By Bianco, Margery Williams and Chandler, Jean (ILT)",
        "Description": "By the time the Velveteen Rabbit is dirty, worn out, and about to be burned, he has almost given up hope of ever finding the magic called Real.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Derrydale",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "John J. Pershing: General of the Armies. A Biography",
        "Authors": "By Palmer, Frederick",
        "Description": "",
        "Category": "",
        "Publisher": "Military Service Publishing Company",
        "Price Starting With ($)": "40.6",
        "Publish Date": {
            "Month": "January",
            "Year": "1948"
        }
    },
    {
        "Title": "Quivers: A Life",
        "Authors": "By Quivers, Robin",
        "Description": "In one of the most no-holds-barred memoirs you're likely to read, Robin Quivers, mystery woman of \"The Howard Stern Show,\" strips off her mask along with her gloves.From Robin's embattled childhood in black Baltimore, through depression and despair to the height of broadcast fame as cohost of America's top-rated radio show, Quivers reveals the full, intimate story of a passionate and often misunderstood personality. Robin's thirteen-year partnership with Howard Stern, \"The King of All Media\" (including their recent successful attempt to talk a listener out of killing himself), is revealed in hilarious and profoundly personal detail.Much more than a show-biz autobiography, Quivers is a vivid personal chronicle of the black experience and the universal struggle for female self-worth, as well as a rags-to-riches story in the grand tradition. Holding absolutely nothing back, Robin writes with the same warmth, strength, and candor that endear her to millions of fans. Whether she's describing a boxing match, a career crisis, or a love affair gone bad, she strikes a universal chord.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Goodbye Forever?: A Mother's Search for Hope",
        "Authors": "By Swift, Joy",
        "Description": "",
        "Category": "",
        "Publisher": "Review and Herald Pub. Associa",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Getting Ready to Meet Jesus",
        "Authors": "By Gerald and Cleveland, Bill Wheeler",
        "Description": "",
        "Category": "",
        "Publisher": "Review and Herald Publishing Association 1998",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Best of Food Digest (Reader's Digest)",
        "Authors": "By Reader's Digest Association (EDT)",
        "Description": "Offers more than five hundred recipes for appetizers, soups, salads, meat, poultry, fish and shellfish, pasta, breads, and desserts, all featuring brand name products",
        "Category": " Cooking , Regional & Ethnic , Asian",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "George Washington's Mother (Penguin Young Readers, Level 3)",
        "Authors": "By Fritz, Jean and Disalvo-Ryan, Dyanne (ILT)",
        "Description": "Everyone has a mother. Even George Washington. But Mary Washington is nothing like you'd think! She hates to dress up. And she always thinks she knows what's best for George. After all, she's his mother! You can read more about her in this true story by Jean Fritz.",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Year Round Wreaths: Creative Ideas for Every Season",
        "Authors": "By Kollath, Richard and Mccandless, bruce (PHT)",
        "Description": "Here Richard Kollath offers both classic and unusual designs.  Included are variations on evergreen wreaths, enchanting designs for weddings, holiday decorations and gifts, wreaths for children, and much, much more.  A fully illustratred chapter shows how to find, buy, prepare, and work with wreath materials.",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Handling Your Disagreements",
        "Authors": "By Berry, Joy Wilt",
        "Description": "Explains why people have disagreements and how to handle them before disagreements turn into arguments, fights, or scapegoating.",
        "Category": " Psychology , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "You're One of a Kind: A Children's Book About Human Uniqueness (Ready-Set-Grow)",
        "Authors": "By Wilt, Joyce",
        "Description": "",
        "Category": "",
        "Publisher": "Educational Products Division Word Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "How to Talk to Bears (And Other Tips for Success)",
        "Authors": "By Illustrator-David McPhail",
        "Description": "",
        "Category": "",
        "Publisher": "Scott, Foresman",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Autobiography of Henry VIII",
        "Authors": "By George, Margaret",
        "Description": "Develops the story of Henry VIII through the use of fictitious autobiographical memoirs interspersed with irreverent comments from his jester and confidant, Will Somers",
        "Category": " Fiction , Historical , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "The Fabulous Fairy Tale Follies",
        "Authors": "By Philpot, Graham",
        "Description": "As various fairy tale characters audition for parts in eleven productions of the world's favorite fairy tales, young readers follow clues and find the stars of each presentation in richly detailed, full-color, double-page spreads.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Brandenburg Gate",
        "Authors": "By Porter, Henry",
        "Description": "In this brilliant, multilayered, espionage thriller, the 2005 Ian Fleming Steel Dagger Award winner Henry Porter captures the tense final moments before the fall of the Berlin Wall. September 1989. The Communist government in East Germany is on the brink of collapse. Even the Stasi, one of the most formidable intelligence agencies of all time, can’t stop the rebellion that ends in the fall of the Berlin Wall. Dr. Rudi Rosenharte, formerly a Stasi foreign agent, is sent to Trieste to rendezvous with his old lover and agent, Annalise Schering, who the Stasi believe Annalise has vital intelligence. The problem: Rudi knows she’s dead. He saw her lying in her own bloodied bathwater, and then kept her suicide a secret. As collateral for this mission, the Stasi have imprisoned Rosenharte's family. But the Stasi is not the only intelligence agency using Rosenharte. Soon the British and Americans encircle him, forcing him to choose between abandoning his beloved brother to a torturous death and returning to East Germany as a double agent. As the political pressures against the East German government rise, Rudi must face his own crises. Brandenburg Gate shows Henry Porter at the top of his game.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "American Shaolin: Flying Kicks, Buddhist Monks, and the Legend of Iron Crotch: An Odyssey in the New China",
        "Authors": "By Polly, Matthew",
        "Description": "The raucously funny story of one young American?s quest to become the baddest dude on the planet (and possibly find inner peace along the way)  Growing up a ninety-eight-pound weakling tormented by bullies in the schoolyards of Kansas, Matthew Polly dreamed of one day journeying to the Shaolin Temple in China to become the toughest fighter in the world, like Caine in his favorite 1970s TV series Kung Fu.  American Shaolin is the story of the two years Matthew spent in China living, studying, and performing with the Shaolin monks. The Chinese term for tough training is chi ku (?eating bitter?), and Matthew quickly learned to appreciate the phrase.  This is both the gripping story of Matthew?s journey and an intimate portrait of the real lives of the Shaolin monks, who struggle to overcome rampant corruption and the restrictions of an authoritarian government. Laced with humor and illuminated by cultural insight, American Shaolin is an unforgettable coming-of- age story of one man?s journey into the ancient art of kungfu?and a poignant portrait of a rapidly changing China.",
        "Category": " Sports & Recreation , Martial Arts & Self-Defense",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Stupid History: Tales of Stupidity, Strangeness, and Mythconceptions Throughout the Ages (Volume 2)",
        "Authors": "By Gregory, Leland",
        "Description": "Why exactly is Paul Revere revered? Was the lightbulb really Thomas Edison's bright idea?* Best-selling author Leland Gregory employs his masterful wit to expose historical myths, faux \"facts,\" strange events, and tales of human stupidity throughout history.If it would shock you to learn that Benjamin Franklin didn't discover electricity, you'll appreciate this take on hundreds of historical legends and debacles. Historians and humorists alike may be surprised to learn that:* Samuel Prescott made the famous horseback ride into Concord, not Paul Revere.* As a member of Parliament, Isaac Newton spoke only once. He asked for an open window.* On April 24, 1898, Spain declared war on the U.S., thus starting the Spanish-American War. The U.S. declared war the very next day, but not wanting to be outdone, had the date on the declaration changed from April 25 to April 21.With these and many other stories, leading humorist Leland Gregory once again highlights both the strange and the funny side of humankind.",
        "Category": " History , Reference",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Glorious Gardens: Designing, Creating, Nurturing",
        "Authors": "By Heriteau, Jacqueline",
        "Description": "Here is one of the most complete and spectacular compendiums of garden design, technique and information ever assembled. From abundant kitchen gardens to blooming desert xeriscapes to breezy beach-front seascapes overflowing with ornamental grasses and hardy flowers, Heriteau covers thousands of possibilities for creating, improving and nurturing a garden.Heriteau's text is illustrated with more than 250 full-color, inspiring photographs by dozens of photographers including Andrew Lawson, Curtice Taylor, Hugh Palmer, Mick Hales and Clive Nichols, some of the most renowned garden photographers in the world. Detailed sidebars list flowers, plants and vegetables native to a particular habitat, as well as practical maintenance tips and strategies. And a Gardening Basics Appendix provides techniques and information that make this book as valuable to the beginner as it is to the seasoned creative gardener.",
        "Category": " Gardening , General",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "8.51",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Fabric Artistry (Singer Design Series)",
        "Authors": "By The Editors of Creative Publishing international, Singer",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Meet Danitra Brown",
        "Authors": "By Grimes, Nikki",
        "Description": "",
        "Category": "",
        "Publisher": "Trumpet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "New Lawn Expert (Expert Series)",
        "Authors": "By Hessayon, D. G.",
        "Description": "",
        "Category": " Gardening , Lawns",
        "Publisher": "Sterling*+ Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Nathaniel Hawthorne: Captain of the Imagination",
        "Authors": "By Manley, Seon",
        "Description": "",
        "Category": "",
        "Publisher": "Random House (Merchandising)",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1968"
        }
    },
    {
        "Title": "Affinities and Extremes: Crisscrossing the Bittersweet Ethnology of East Indies History, Hindu-Balinese Culture, and Indo-European Allure",
        "Authors": "By Boon, James A.",
        "Description": "Examining representations of Balinese culture in complex contexts of Indonesia's colonial history, Hindu ritual practice as opposed to Islam, and comparative Indo-European hierarchies, Boon offers a powerful critique of doctrinal approaches to culture, religion, literature, politics, and the history of ideas and disciplines.",
        "Category": " History , Asia , Southeast Asia",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "The Business Writers Companion",
        "Authors": "By Oliu, Walter E., Brusaw, Charles T., and Alred, Gerald J.",
        "Description": "",
        "Category": " Business & Economics , Reference",
        "Publisher": "Bedford/St Martins",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "America: A Jake Grafton Novel",
        "Authors": "By Coonts, Stephen",
        "Description": "Hundreds of people have gathered to watch the launching of the U.S.S. America - the United States' newest and most sophisticated nuclear submarine. Then, the unthinkable happens: armed men emerge from the tugboat that is leading her to sea, board the submarine, and man her controls. Before the destroyers nearby can react, the sub disappears. Admiral Jake Grafton is resting at his Delaware beach house when he is asked to find out who has stolen the submarine and why. He learns that a rogue CIA group, originally trained to steal a Russian submarine, may be behind the operation. And soon it becomes clear that, whatever their purpose, they mean business: within hours a missile launched from the submarine destroys the top floor of the White House and a second missile knocks out the electrical power in the heart of Washington and fells an airliner. The race is on to find the submarine, determine who is behind the nightmare scenario and - most critically - how to stop it.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "HTML for the World Wide Web, Second Edition (Visual QuickStart Guide)",
        "Authors": "By Castro, Elizabeth",
        "Description": "Introduces the HyperText Markup Language, and discusses text formatting, images, links, anchors, lists, tables, forms, and multimedia",
        "Category": " Computers , Internet , General",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "A Dangerous Love (Mercy and Eagleflight Series #2)",
        "Authors": "By Phillips, Michael R.",
        "Description": "",
        "Category": " Religion , Education",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "To My Daughter With Love on the Important Things in Life (More Family Titles)",
        "Authors": "By Schutz, Susan Polis",
        "Description": "",
        "Category": " Poetry , American , General",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Lady of Stonewycke (Stonewycke Trilogy, Book 3)",
        "Authors": "By Phillips, Michael R. and Pella, Judith",
        "Description": "After her grandmother's death, Joanna Matheson travels to Scotland to rediscover her family's heritage",
        "Category": " Fiction , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Letters to scattered pilgrims",
        "Authors": "By O'Connor, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Sisters in Arms: Catholic Nuns through Two Millennia",
        "Authors": "By McNamara, Jo Ann Kay",
        "Description": "Spanning two thousand years of Christian religious women's quest for spiritual and vocational fulfillment, Sisters in Arms is the first definitive history of Catholic nuns in the Western world. Unfolding century by century, this epic drama encompasses every period from the dawn of Christianity to the present.History has until recently minimized the role of nuns over the centuries. In this volume, their rich lives, their work, and their importance to the Church are finally acknowledged. Jo Ann Kay McNamara introduces us to women scholars, mystics, artists, political activists, healers, and teachers--individuals whose religious vocation enabled them to pursue goals beyond traditional gender roles. They range from Thecla, the legendary companion of Paul, who baptized herself in preparation for facing the lions in the Roman arena, to Hildegard of Bingen, whose visions unlocked her extraordinary talents for music, medicine, and moral teaching in the twelfth century. They also include Sister Mary Theresa Kane, who stood before the pope--and an American television audience-in 1979 and urged him to consider the ordination of women.By entering the convent, McNamara shows, nuns gained a community that allowed them to evolve spiritually, intellectually, and emotionally; but the convent was never a perfect refuge. Women's struggles continued against the male church hierarchy, the broader lay community, and the larger cultural and historical forces of change.The history of nuns is an important part of the larger story of western women whose gender provoked resistance to their claims to autonomy and power. As we enter the third millennium, this groundbreaking work pays fitting tribute to the sisters who have labored with prayer and service for two thousand years, who have struggled to achieve greater recognition and authority, and who have forged opportunities for all women while holding true to the teachings of the Gospel.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Sir Gawain and the Green Knight (Penguin Classics)",
        "Authors": "By Burrow, J. A. (EDT)",
        "Description": "A classic of early English literature, by an anonymous poet from the time of Chaucer Although the date of Sir Gawain and the Green Knight is uncertain, and we know nothing about the author, its composition is roughly contemporary with Chaucer's The Canterbury Tales in the latter part of the fourteenth century. It is a remarkably subtle and accomplished poem, in which the hero's knightly virtues of courage, courtesy and fidelity are put to the test in a strange adventure involving a huge green knight on a green horse, a winter journey, a lady in a mysterious castle and a challenge answered. It ranks as one of the greatest works of the English Middle Ages and perhaps the greatest triumph of the English alliterative tradition.Unlike The Canterbury Tales, however, Sir Gawain is written in a dialect belonging to Cheshire, Lancashire or Staffordshire, and this seems more remote to the modern reader than Chaucer's London language. The aim of this edition has been to remove unnecessary impediments while retaining the integrity of the original. Notes and a glossary have been provided to assist an informed, critical reading of the text.For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " Poetry , European , English, Irish, Scottish, Welsh",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Science and Health with Key to the Scriptures (Authorized Edition)",
        "Authors": "By Mary Baker Eddy",
        "Description": "",
        "Category": "",
        "Publisher": "CHRISTIAN SCIENCE PUBLISHING SOCIETY",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1934"
        }
    },
    {
        "Title": "Hidden Heroes...Evidence That God is at Work",
        "Authors": "By Don Moore, Lorna Dueck",
        "Description": "",
        "Category": "",
        "Publisher": "Billy Graham Evangelistic Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Dangerous Water: A Biography Of The Boy Who Became Mark Twain",
        "Authors": "By Powers, Ron",
        "Description": "While Mark Twain remains one of our most quintessentially American writers, the actual boyhood experiences that fueled his most enduring literature remained largely unexplored?until now. Twain's early years were a decidedly un-innocent time, marked by deaths of friends and family and his father's bankruptcy. Twain dealt with those personal tragedies through humor and the tall tale. From the time that a ten-year-old Samuel Clemens lit out on his own and boarded his first Mississippi steamer to his first encounter with a traveling \"mesmerizer\" (which ignited his lifelong penchant for acting and spectacle), from the brooding sense of guilt and fear of eternal damnation inculcated into him at church to the superstitions and stories of witchcraft he learned from the blacks on his farm, Powers unforgettably shows how Mark Twain was shaped by the distinctly American landscape, culture, and people of Hannibal, Missouri. Jay Parini, the celebrated biographer of Robert Frost, called Dangerous Water \"a long-needed evocation of the boyhood of the man who invented boyhood for all time. . . . An immensely shrewd and deeply engaging book, a great gift to all of us who love Twain.\"",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Quick Gifts of Good Taste (Memories in the Making Series)",
        "Authors": "By Childs, Anne Van Wagner",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Annabelle (Celebrating the American Woman, Bk 2)",
        "Authors": "By McMath, Meredith Bean",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Vine Books",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Abundant Gifts: A Daybook of Grace-Filled Devotions",
        "Authors": "By Eble, Diane",
        "Description": "God's gifts surround us daily. Through nature, other people, the Bible, circumstances, and even trials, grace is at work. This attractive five-day-a-week gift devotional offers daily readings focusing on God's goodness and grace. Using Scripture, quotes, and real-life stories, Abundant Gifts will inspire readers to be more aware of God's presence in their day-to-day lives and to tune in to the many gifts of grace he lavishes on his world each day.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Seasons of the Lord: Bible-Centered Devotions for the Entire Year",
        "Authors": "By Lockyer, Herbert",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    }
]