[
    {
        "Title": "Falwell: An Autobiography",
        "Authors": "By Falwell, Jerry",
        "Description": "",
        "Category": "",
        "Publisher": "Tab Books",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Tea Chings: The Tea and Herb Companion :Appreciating the Varietals and Virtues of Fine Tea and Herbs",
        "Authors": "By Rubin, Ron and Gold, Stuart Avery",
        "Description": "A beautifully designed, informative illustrated book about the flavors, benefits, and cultural lore surrounding this 5,000-year-old tea experiencefrom the Ministry of Information of The Republic of Tea, leading purveyor of only the finest teas and herbs in the world. Novice sippers and tea aficionados alike can journey from the tea gardens of Asia to the tea rooms of Europe and North America, sampling the finest teas in this accessible handbook about the history, culture, and customs of the long-honored brew. Included are guides to the leaves, plants, and manufacture of teas and other botanicals used in making tea, information on the medicinal benefits of teas and herbs, plus maps, diagrams, and recipes. Find the answers to such questions as: What makes green tea different from black tea...and herbal \"teas\" different from all others? What do Orange Pekoe, English Breakfast, tannic acid, and \"naturally flavored\" really mean? How did tea bags, iced tea, \"high tea,\" and the spiritual art of the Japanese tea ceremony come to be? What are the ingredients and health benefits of yerba mate, rooibos, chai and Pu-erh? Plus much more TeaMinded knowledge. Two-color drawings throughout.",
        "Category": " Cooking , Beverages , Coffee & Tea",
        "Publisher": "Newmarket Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Mulligan's Laws",
        "Authors": "By Mulligan, Thomas and Beard, Henry (EDT)",
        "Description": "A collection of golfing wisdom features hundreds of tongue in cheek insights, including the fact that a golf bag always contains more than six hundred or fewer than three tees",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "When You Look Like Your Passport Photo, It's Time to Go Home",
        "Authors": "By Bombeck, Erma",
        "Description": "America's favorite housewife takes a witty look at family vacations, describing her escapades in Istanbul, the Galapagos Islands, and other locales",
        "Category": " Humor , Form , Parodies",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "The Midwife's Apprentice",
        "Authors": "By Cushman, Karen",
        "Description": "'Like Cushman's 1995 Newbery Honor Book, Catherine, Called Birdy, this novel is about a strong young woman in medieval England who finds her own way home. This is a world, like Chaucer's, that's . . . dangerous, primitive and raucous. From the first page you're caught by the spirit of the homeless, nameless waif, somewhere around 12 years old. She gets the village midwife to take her in, befriends a cat, names herself Alyce, and learns something about delivering babies. When she fails, she runs away, but she picks herself up again and returns to work and independence.' --ALA Booklist (starred review). '. . .A fascinating view of a far distant time.' -- The Horn Book (starred review)",
        "Category": " Young Adult Fiction , Historical , Medieval",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Betty and Rita Go To Paris",
        "Authors": "By Hughes, Judith E. and Malyszko, Michael (PHT)",
        "Description": "They were free dogs in Paris, unfettered and alive....Two traveling Labradors tour the City of Light in this charming portrait of Paris and irresistible celebration of canine joie de vivre. Lingering in front of the Louvre, pondering Jim Morrisons grave, befriending a poodle at Les Halles, or enjoying a baguette at the Eiffel Tower, Betty and Rita take in all the sights of Paris in this enchanting picture book. Big dogs on the trail of big fun, they visit Notre Dame, the Bastille, L'Arc de Triomphe, and the Centre Pompidou, as well as the parks, fountains, bistros, and other sights that Paris is famous for. Forty duotone photographs accompanied by brief captions capture the Parisian holiday experience with whimsical wit. As sure as the dog is mans best friend, Betty and Rita Go to Paris will charm les pantalons off Francophiles, photographers, and dog lovers the world over. Betty, age 11, is the consummate big sister and enjoys the perks of such a position, especially the lions share of all food treats. Rita, seven, defers readily, preferring attention to food anytime. This is their first book.",
        "Category": " Photography , Subjects & Themes , Portraits & Selfies",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "6.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Memories of World War II: Photographs from the Archives of the Associated Press",
        "Authors": "By Tunney, Kelly Smith (EDT), Zoeller, Chuck (EDT), Dole, Bob (FRW), Cronkite, Walter (INT), Bertini, Ann G. (EDT), and Himmel, Eric (EDT)",
        "Description": "Memories of World War II is a presentation of the most significant and influential photographs relating to World War II from the archives of The Associated Press. To create the book, 167 images were culled from tens of thousands of pictures in the AP Archives, including material from AP photo files in Europe and Asia that had not been seen since the war. These are actual images that informed American newspaper readers at home about the progress of the war.Taken together, these photographs form a portrait of war in both the European and Pacific theaters - a panorama of events from the rise of Hitler and the invasion of Poland to the dropping of the atomic bombs and the surrender of Japan. Arranged chronologically, with detailed captions and prefaced with essays by Bob Dole and Walter Cronkite, they give form to the dark passions and high ideals that shaped the course of the war.",
        "Category": " Photography , History",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Vogue & Butterick's: Home Decorating Projects",
        "Authors": "By Fleming, Nancy",
        "Description": "Instructions for the craft-oriented sewer for dozens of ingenious home-decorating projects featured on \"Sewing Today\" includes tips on creating pillows, customized window treatments, slipcovers and seat cushions, tablecloths, and more. Original.",
        "Category": " Art , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Titanic: Lost and Found (Step-Into-Reading, Step 4)",
        "Authors": "By Donnelly, Judy and Kohler, Keith (ILT)",
        "Description": "Titanic. Just the name evokes tales of the doomed ship that have captivated people of all ages for more than 100 years. Early readers will enjoy this exciting account of the world's most famous disaster-at-sea and the discovery of it's remains many years later. Step 4 books are perfect for independent readers who are confident with simple sentences and are just starting to tackle paragraphs.",
        "Category": " Juvenile Nonfiction , History , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "RAMONA AND HER MOTHER (Ramona Quimby (Paperback))",
        "Authors": "By Cleary, Beverly",
        "Description": "Ramona at 7 1/2 sometimes feels discriminated against by being the youngest in the family.Ramona has serious doubts that her sometimes preoccupied working mother doesn't love her as much as she used to and is relieved to discover that her mother loves her very much indeed",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1980"
        }
    },
    {
        "Title": "From the Mixed-Up Files of Mrs. Basil E. Frankweiler (Yearling Newbery)",
        "Authors": "By Konigsburg, E. L.",
        "Description": "Two runaway children make their home in the Metropolitan Museum of Art",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1977"
        }
    },
    {
        "Title": "Orwell's Luck",
        "Authors": "By Jennings, Richard W.",
        "Description": "When a wounded wild rabbit is found in the front yard, he is given a good home and a memorable name by a twelve-year-old with a liking for basketball, the trombone, and the newspaper’s daily horoscope. But Orwell is no ordinary rabbit. It soon seems that he is attempting to reward his young caretaker by mysteriously sending coded messages in the form of predictions: the final score of the Super Bowl, advance notice of a pop quiz at school, tomorrow’s winning lottery number! Can this little rabbit foretell the future? Can Orwell actually make luck happen? Here is a magical and heartwarming story about kindness, friendship, and hope in the shadow of fortune’s ever-turning wheel.",
        "Category": " Juvenile Fiction , Visionary & Metaphysical",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Family Math (Equals Series)",
        "Authors": "By Stanmark, Jean Kerr, Thompson, Virginia, and Cossey, Ruth",
        "Description": "",
        "Category": " Mathematics , General",
        "Publisher": "Lawrence Hall of Science",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Quilting: Quotations Celebrating An American Legacy (Classic Miniatures)",
        "Authors": "By Steward, Joyce S.",
        "Description": "\"A joyous tribute to American quilts and quiltmakers, with literary quotations and brilliant, full-color photographs of more than 20 antique American quilts.\"",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Running Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Religion in Greece and Rome, (Harper torchbooks, TB55)",
        "Authors": "By Rose, H. J.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Point Blank (FBI Thriller)",
        "Authors": "By Coulter, Catherine",
        "Description": "FBI agents Lacey Sherlock and Dillon Savich face the most dangerous case of their careers in Catherine Coulter's explosive new thriller.  Point Blank's propulsive story takes off when FBI agents Dillon Savich and Dane Carver are nearly killed while trying to rescue popular entertainer Pinky Womack from kidnappers. Lured to a motel in Pumis City, Virginia, by a known snitch, the only thing the agents discover is a glowing red timer. The place is demolished in a catastrophic explosion, but everyone survives.  The same snitch leads them to Arlington National Cemetery, promising the agents Pinky's safe return. The search is interrupted when Savich takes a fateful call on his cell. The mysterious caller taunts Savich with other threats-against him, and against his wife, fellow agent Lacey Sherlock. Up against an untraceable foe-not even MAX can locate him-Savich and Sherlock find themselves fighting an unstable villain with a very long memory.  At the same time, Agent Ruth Warnecki's passion for treasure hunting leads her to Winkel's Cave and a cave chamber that really shouldn't exist-as well as a dead student from Stanislaus Music School, left there for eternity. Some students have wandered quite far from the beaten path, with terrible consequences.  An edge-of-your-seat thriller as exhilarating and frightening as anything she's ever written, Point Blank is Catherine Coulter's finest achievement.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "What is Lean Six Sigma",
        "Authors": "By Rowlands, David, George, Mike, and Kastle, Bill",
        "Description": "A quick introduction on how to use Lean Six Sigma toimprove your workplace, meet your goals, andbetter serve your customers.Lean Six Sigma combines the two most important improvement trends of our time: making work better (using Six Sigma) and making work faster (using Lean principles).  In this plain-English guide, you’ll discover how this remarkable quality improvement method can give you the tools to identify and eliminate waste and quality problems in your own work area.Packed with diagrams, cartoons, and real-life examples, What is Lean Six Sigma? reveals the “four keys” of Lean Six Sigma and how they apply to your own job:Delight your customers with speed and quality Improve your processes Work together for maximum gainBase decisions on data and facts You’ll see the big picture of what your company hopes to gain with Lean Six Sigma, how it may affect your work area, and what it can mean to you personally.",
        "Category": " Technology & Engineering , Manufacturing",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Trainspotting",
        "Authors": "By Welsh, Irvine",
        "Description": "It accomplished for its own time and place what Hubert Selby, Jr.'s Last Exit to Brooklyn did for his. Rents, Sick Boy, Mother Superior, Swanney, Spuds, and Seeker are as unforgettable a clutch of junkies, rude boys, and psychos as readers will ever encounter. Trainspotting was made into the 1996 cult film starring Ewan MacGregor and directed by Danny Boyle (Shallow Grave).",
        "Category": " Fiction , Urban",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Love, Dad: Positive Answers for Young Teens on Handling Sexual Pressure (Why Wait)",
        "Authors": "By McDowell, Josh",
        "Description": "Explains the physical and emotional aspects of teenage sexuality and discusses the moral issues involved in having sex or waiting.",
        "Category": " Social Science , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Long Arm Quarterback: A New Football Team Sparks an Old Rivalry (New Matt Christopher Sports Library)",
        "Authors": "By Christopher, Matt",
        "Description": "Cap Wadell loves football, but it seems unlikely that he'll ever get to play on a real team-his hometown is so small that there aren't enough boys in his school to fill a regulation squad. Then his grandfather tells him how he solved that same problem years before: He and his schoolmates started a six-man football league. If Cap wants to do the same thing, Grandpa will be happy to help. He'll even coach the team if the league gets off the ground. It does, and soon Cap and his friends are learning the rules of six-man football. Cap is in competition for the starting quarterback spot with Jimmy Cash, but that's not a problem. What is a problem is that Grandpa and Jimmy's grandfather have reignited an old football feud. When their rivalry starts to affect the team, Cap wonders if the team will survive. For a complete list of all of Matt Christopher's titles, please turn to the last pages of this book.",
        "Category": " Juvenile Fiction , Sports & Recreation , Football",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Women in His Life",
        "Authors": "By Bradford, Barbara Taylor",
        "Description": "The life of billionaire Maximilliam West unfolds through the eyes of the women who surround him--his wives, mother, mistress, and nanny--as he struggles to resolve old secrets with the help of the woman who holds the key to his past and future",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Skadden: Power, Money, and the Rise of a Legal Empire",
        "Authors": "By Caplan, Lincoln",
        "Description": "Skadden, Arps, Slate, Meagher and Flom rode the tidal wave of takeovers in the 1970s and '80s to become the most profitable law firm in the world. At its peak, partners there earned an average of over $1 million a year. Unabashedly competitive and zealously private, Skadden, as the firm is known, was different from leading firms of previous eras: they had reflected the might and luster of their clients, but Skadden became a big business in its own right, with global reach and power. At its center was corporate America's most sought-after legal adviser, the firm's street-smart, media-wise senior partner and presiding genius, Joe Flom, rainmaker par excellence.In this unprecedented look at the culture and history of American lawyering, Lincoln Caplan describes Skadden's origins in the still-white-shoe New York legal universe of the early post-war period and its rise, with the growing sophistication of battles for corporate control, to dazzling preeminence in the era of Michael Milken and Drexel Burnham Lambert - the firm's largest client in the eighties. Skadden takes readers inside a tribe with its own vocabulary and rites of passage, showing us Skadden's view of itself as an aggressive meritocracy - which prizes opportunists and does not consider it a compliment to be called a gentleman and at the same time created a unique $10 million program to support young public-interest lawyers. And, in a penetrating look at the process of making partners, Caplan describes the shifts Skadden has made in response to the changed business climate of the 1990s - as well as the increasingly global practice of law, in which the firm has once again been a groundbreaker. In many ways a history of the development of the legal profession in the post-war period, the story of Joe Flom's firm is about power, money, and a profound shift in values that illuminates an era in American business and society.",
        "Category": " Biography & Autobiography , Lawyers & Judges",
        "Publisher": "Farrar Straus & Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Freckle Juice",
        "Authors": "By Blume, Judy",
        "Description": "Nicky has freckles—they cover his face, his ears, and the whole back of his neck. Sitting behind him in class, Andrew once counted eighty-six of them, and that was just a start! If Andrew had freckles like Nicky, his mother would never know if his neck was dirty.One day after school, Andrew works up enough courage to ask Nicky where he got his freckles. When know-it-all Sharon overhears, she offers Andrew her secret freckle juice recipe—if he pays. Andrew is desperate and feels it's worth it. At home he carefully mixes the strange combination of ingredients. Then the unexpected happens...",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1978"
        }
    },
    {
        "Title": "Confessions of a Bigamist: A Novel",
        "Authors": "By Lehrer, Kate",
        "Description": "What happens when love strikes twice--and the second time it does you are already satisfactorily, even happily, married? Michelle Banyon has a successful career as a lifestyle guru and \"efficiency consultant.\" She lives in Manhattan with her kind but thoroughly overworked husband, an international lawyer who spends far more time in Hong Kong, Singapore, and Bombay than he does in their Fifth Avenue apartment. They are the perfect twenty-first-century couple: successful, attractive, self-sufficient, and understanding of the all-too-frequent absences that can sometimes make theirs a virtual marriage.While lecturing in Texas, Michelle literally runs into Wilson Collins as she's backing out of a parking space. The handsome Texan is badly banged up and Michelle feels just awful. She performs one kindness after another as she tries to get him medical help and then get him home. A friendship blooms and, almost as quickly, love does, too. Unlike everyone else in Michelle's life, Wilson has simple needs and desires and, to her immense surprise, she finds that she is someone very different when she’s with him. It’s not that she doesn't love her husband--she does. She just happens to love two men, and the second one wants to marry her, too.Have you ever wondered how many different lives a person could live or how very different one's life might be if fate were to intervene at exactly the right moment? Could you be happy living two entirely different lives? Sit back and enjoy Kate Lehrer's romantic, thought-provoking novel that is simultaneously smart and playful, poignant and compulsively readable.",
        "Category": " Fiction , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Longer the Thread",
        "Authors": "By Emma Lathen",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1973"
        }
    },
    {
        "Title": "Wound Healing: Alternatives in Management",
        "Authors": "By McCulloch, Joseph M. (EDT), Kloth, Luther, Feedar, Jeffrey A., McCulloch, Joseph M., Kloth, Luther (EDT), and Feedar, Jeffrey A. (EDT)",
        "Description": "This updated, expanded second edition includes information on technological advances in wound evaluation, topical agents, pressure relieving devices, and other adjunctive treatments, and provides in-depth information on the inflammatory response to wounding and the normal and abnormal responses to healing. Discusses factors that complicate tissues repair, the role of nutrition in healing, and identification of wound pathogens. Assists the student and clinician in integrating the basic and clinical concepts presented with alternative techniques for wound care. Includes numerous b&w diagrams and photos. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Medical , Allied Health Services , Physical Therapy",
        "Publisher": "Philadelphia, Pennsylvania, U.S.A.: F A Davis Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Rising Tides (The Chesapeake Bay Saga, Book 2)",
        "Authors": "By Roberts, Nora",
        "Description": "The second novel in #1 New York Times bestselling author Nora Roberts' stunning Chesapeake Bay Saga, where the Quinn brothers must return to their family home on the Maryland shore, to honor their father's last request...Ethan Quinn is a waterman. He wasn’t born to the tradition but has embraced it. He’s a quiet man whose heart runs as deep as the waters he loves. And now, with his father gone, Ethan is determined to make the family boatbuilding business a success. But amidst his achievements lie the most important challenges of his life…    There’s a young boy who needs him, and a woman and child he loves but never believed he could have. To shape his life around them, Ethan must face his own dark past—and accept not only who he is but what he hopes to become.Don't miss the other books in the Chesapeake Bay SagaSea SweptInner HarborChesapeake Blue",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Wine, Food & Friends: Karen's Wine and Food Pairing Guide, Plus Over 100 Cooking Light Recipes",
        "Authors": "By MacNeil, Karen",
        "Description": "The author of The Wine Bible combines thirty sumptuous menus and more than 150 kitchen-tested recipes with wine recommendations for every season of the year and handy tips on buying, ordering, and serving wine. 25,000 first printing.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "H.R.H.",
        "Authors": "By Steel, Danielle",
        "Description": "In a novel where ancient traditions conflict with reality and the pressures of modern  life, a young European princess proves that simplicity, courage, and dignity win  the day and forever alter her world. In blue jeans and a pullover, Princess Christianna  is a young woman of her times: born in Europe, educated in America, worried about  the future of the world she lives in, responsible beyond her years.  Christianna  is the only daughter of the Reigning Prince of a European nation that takes its royalty  seriously–and her father has ironclad plans for Christianna’s life, a burden that  is almost unbearable. Now, after four years at Berkeley, life in her father’s palace  cannot distract Christianna from what she sees outside the kingdom–the suffering  of children, the ravages of terrorism and disease.  Determined to make a difference  in the world, she persuades His Royal Highness, her father, to let her volunteer  for the Red Cross in East Africa.  And for Christianna, a journey of discovery, change,  and awakening begins. Under a searing East African sun, Christianna plunges into  the dusty, bustling life of an international relief camp, finding a passion and a  calling among the brave doctors and volunteers.  Finally free from the scrutiny of  her royal life, Christianna struggles to keep her identity a secret from her new  friends and coworkers–even from Parker Williams, the young doctor from Doctors Without  Borders who works alongside Christianna and shares her dedication to healing.  But  as violence approaches and invades the camp, and the pressures of her royal life  beckon her home, Christianna’s struggle for freedom takes an extraordinary turn.   By a simple twist of fate, in one shocking moment, Christianna’s life is changed  forever–in ways she never could have foreseen. From the splendor of a prince’s palace  to the chaos of war-torn nations, Danielle Steel takes us into fascinating new worlds.   Filled with unforgettable images and a remarkable cast of characters, H.R.H. is  a novel of the conflict between old and new worlds, responsibility versus freedom,  and duty versus love.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "A Manual for Writers of Term Papers, Theses, and Dissertations",
        "Authors": "By Turabian, Kate",
        "Description": "",
        "Category": "",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1973"
        }
    },
    {
        "Title": "The Tale of Genji (Dover Thrift Editions)",
        "Authors": "By Waley, Arthur (TRN) and Murasaki, Lady",
        "Description": "Completed in the early 11th century, The Tale of Genji is considered the supreme masterpiece of Japanese prose literature, and one of the world's earliest novels. A work of great length, it comprises six parts, the first part of which (also called The Tale of Genji) is reprinted here. The exact origins of this remarkable saga of the nobility of Heian Japan remain somewhat obscured by time, although its author, Lady Shikibu Murasaki, presumably derived many of her insights into court life from her years of service with the royal family.The novel centers on the life and loves of the prince known as \"the shining Genji.\" Far more than an exotic romance, however, the tale presents finely drawn characters in realistic situations, set against a richly embroidered tapestry of court life. Moreover, a wistful sense of nostalgia pervades the accounts of courtly intrigues and rivalries, resulting in an exquisitely detailed portrayal of a decaying aristocracy.Vibrant in its poetry and wordplay, subtle in its social and psychological observations, this work ranks in stature and significance with such Western classics as Cervantes' Don Quixote and Proust's Remembrance of Things Past. This inexpensive edition, featuring Arthur Waley's splendid translation of the first of the six-part series, offers readers a memorable taste of one of the world's first and greatest novels.",
        "Category": " Fiction , Literary",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Learning to Look",
        "Authors": "By Taylor, Joshua C.",
        "Description": "",
        "Category": "",
        "Publisher": "University of Chicago Press (Trd)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Junior Cookbook",
        "Authors": "By Bellefontaine, Jacqueline",
        "Description": "",
        "Category": "",
        "Publisher": "JG Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Disney's Beauty and the Beast",
        "Authors": "By Singer, A. L.",
        "Description": "Through her great capacity to love, a kind and beautiful maid releases a handsome prince from the spell which has made him an ugly beast.",
        "Category": " Juvenile Nonfiction , Social Science , General",
        "Publisher": "Disney Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Man Who Listens to Horses",
        "Authors": "By Roberts, Monty",
        "Description": "\"It all dates from those summers alone in the high desert, me lying on my belly and watching wild horses with my binoculars for hours at a time. Straining to see in the moonlight, striving to fathom mustang ways, I knew instinctively I had chanced upon something important but could not know that it would shape my life. In 1948 I was a boy of thirteen learning the language of horses. . . .\"",
        "Category": " Nature , Reference",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Sorceress of Darshiva (The Malloreon, Book 4)",
        "Authors": "By Eddings, David",
        "Description": "The fourth book in the series pits Garion and his fellow wizards against the evil sorceress Zandramas, who has kidnapped Garion's infant son for use in a bizarre ritual",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Speaking Your Mind in 101 Difficult Situations",
        "Authors": "By Gabor, Don",
        "Description": "Offers strategies for tactful conversations and discusses specific situations, such as asking for a raise, stopping sexual harassment,  breaking off a relationship, criticizing a spouse, or revealing a secret",
        "Category": " Psychology , Applied Psychology",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The Heartland: Missouri, Kansas, Nebraska, Iowa, South Dakota, and North Dakota (National Geographic's Driving Guides to America)",
        "Authors": "By National Geographic Society (U. S.) (COR), Lewis, Michael, Whipple, Dan, and Forsberg, Michael",
        "Description": "",
        "Category": " Travel , United States , Midwest , West North Central (IA, KS, MN, MO, ND, NE, SD)",
        "Publisher": "Natl Geographic Society",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Western Garden Book, 2001 Edition",
        "Authors": "By Brenzel, Norris (EDT)",
        "Description": "Describes several thousand plants that can be grown in twenty-four specific climates, from Idaho, Utah, and Arizona to the Pacific beaches, and tells how to care for them.",
        "Category": " Gardening , Landscape",
        "Publisher": "Sunset Books (Lane)",
        "Price Starting With ($)": "7.33",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "High Velocity Culture Change: A Handbook for Managers",
        "Authors": "By Pritchett, Price and Pound, Ron",
        "Description": "",
        "Category": "",
        "Publisher": "Pritchett Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "National Geographic Guide to America's Hidden Corners",
        "Authors": "By National Geographic Society",
        "Description": "Discover 75 of America's best out-of-the-way escapes -- from historic small towns and quaint villages to unspoiled coastal regions and remote deserts and mountain ranges.  * Take the back roads to places nationwide that are well off the tourist routes. You'll uncover hidden corners you didn't know existed. * Includes scenic itineraries, descriptive essays by seasoned travel writers, and easy-to-use, full-color maps that key you to the must-see sights. * Detailed practical information highlights unique inns and B&Bs, annual festivals, hiking trails, antiquing -- everything you need to plan your perfect getaway. * Vivid, color photos capture the beauty and special quality of each hidden corner.",
        "Category": " Travel , United States , General",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Disney's FamilyFun Crafts: 500 Creative Activities for You and Your Kids",
        "Authors": "By Walt Disney Company (COR), Cook, Deanna F. (EDT), and Family Fun (EDT)",
        "Description": "From the editors of FamilyFun magazine and the author of Disney's Family Cookbook comes a collection of summertime projects, weekend crafts, and holiday decorations for the whole family--including games, nature crafts, painting, homemade toys, and more. Tour.",
        "Category": " Crafts & Hobbies , Crafts for Children",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Your Home Curtains and Shades",
        "Authors": "By Time-Life Books",
        "Description": "Surveys the various types of window treatments and offers advice on the selection and installation of curtains and shades",
        "Category": "",
        "Publisher": "Silver Burdett Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Working With Wood (Home Repair and Improvement Volume 18)",
        "Authors": "By Time-Life Books",
        "Description": "Clear, step-by-step illustrations reviewing the finer points of carpentry demonstrate professional techniques for obtaining fast, accurate results with table saws, radial saws, drill presses, planers, jointers, shapers, and sanders",
        "Category": " House & Home , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "The Final Solution: A Story of Detection",
        "Authors": "By Chabon, Michael",
        "Description": "In The Amazing Adventures of Kavalier and Clay, prose magician Michael Chabon conjured the golden age of comic books, interwining history, legend and story-telling verve. In The Final Solution, he has condensed his boundless vision to create a short, suspenseful tale of compassion and wit that re-imagines the classic 19th-century detective story.In deep retirement in the English countryside, an 89-year old man, vaguely recollected by the locals as a once-famous detective, is more concerned with his bookkeeping than his fellow man. Into his life wanders Linus Steinman, nine years old and mute, who has escaped from Nazi Germany with his sole companion: an African grey parrot. What is the meaning of the mysterious strings of German numbers the bird spews out-a top-secret SS code? The keys to a series of Swiss bank accounts? Or do they hold a significance at once more prosaic and far more sinister?Though the solution to this last case may be beyond even the reach of the once famed sleuth, the true story of the boy and his parrot is subtly revealed to the reader in a wrenching resolution to this brilliant homage. The Final Solution is a work from a master story-teller at the height of his powers.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Big Squeeze: Tough Times for the American Worker",
        "Authors": "By Greenhouse, Steven",
        "Description": "The Big Squeeze takes a fresh, probing, and often shocking look at the stresses and strains faced by tens of millions of American workers as wages have stagnated, health and pension benefits have grown stingier, and job security has shriveled.Going behind the scenes, Steven Greenhouse tells the stories of software engineers in Seattle, hotel housekeepers in Chicago, call center workers in New York, and janitors in Houston, as he explores why, in the world’s most affluent nation, so many corporations are intent on squeezing their workers dry. We meet all kinds of workers: white collar and blue collar, high tech and low tech, middle income and low income; employees who stock shelves during a hurricane while locked inside their store, get fired after suffering debilitating injuries on the job, face egregious sexual harassment, and get laid off when their companies move high-tech operations abroad. We also meet young workers having a hard time starting out and seventy-year-old workers with too little money saved up to retire.The book explains how economic, business, political, and social trends—among them globalization, the influx of immigrants, and the Wal-Mart effect—have fueled the squeeze. We see how the social contract between employers and employees, guaranteeing steady work and good pensions, has eroded over the last three decades, damaged by massive layoffs of factory and office workers and Wall Street’s demands for ever-higher profits. In short, the post–World War II social contract that helped build the world’s largest and most prosperous middle class has been replaced by a startling contradiction: corporate profits, economic growth, and worker productivity have grown strongly while worker pay has languished and Americans face ever-greater pressures to work harder and longer.Greenhouse also examines companies that are generous to their workers and can serve as models for all of corporate America: Costco, Patagonia, and the casino-hotels of Las Vegas among them.  Finally, he presents a series of pragmatic, ready-to-be-implemented suggestions on what government, business, and labor should do to alleviate the squeeze.A balanced, consistently revealing exploration of a major American crisis.",
        "Category": " Political Science , Public Policy , Economic Policy",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Justice Denied: A J. P. Beaumont Novel",
        "Authors": "By Jance, Judith A.",
        "Description": "The investigation of LaShawn Tompkins's murder seems straightforward enough. Upon his release from death row, the ex-drug dealer returned to his old neighborhood, where he was gunned down on his mother's doorstep. Just another case of turf warfare.At least that's what it looks like on the surface to Seattle investigator J. P. Beaumont, who's been handed the assignment under the strictest confidence. But as Beau starts digging, the situation becomes more complicated than he'd thought. It appears that LaShawn really had turned over a new leaf at the King Street Mission and his murder was premeditated. Someone had targeted the man for death.Meanwhile, Beau's lover and fellow cop, Mel Soames, is given her own hush-hush investigation. A routine check on registered sex offenders has revealed a disturbing pattern: they're dying off at an alarming rate, and not all due to natural causes. Details of the latest death suggest an inside job, and Mel isn't letting this go. Suddenly, Mel's investigation becomes entangled with Beau's, and the two begin to uncover a nightmarish conspiracy that could involve people in high places—including their own top brass.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Lemony Snicket: The Unauthorized Autobiography (A Series of Unfortunate Events)",
        "Authors": "By Snicket, Lemony and Helquist, Brett (ILT)",
        "Description": "NOW A NETFLIX ORIGINAL SERIESA Warning from the Publisher: Many readers have questions about Lemony Snicket, author of the distressing serial concerning the trials of the charming but unlucky Baudelaire orphans, published under the collective title A Series of Unfortunate Events. Before purchasing, borrowing, or stealing this book, you should be aware that it contains the answers to some of those questions, such as the following: 1. Who is Lemony? 2. Is there a secret organization I should know about? 3. Why does Lemony Snicket spend his time researching and writing distressing books concerning the Baudelaire orphans? 4. Why do all of Lemony Snicket's books contain a sad dedication to a woman named Beatrice? 5. If there's nothing out there, what was that noise? Our advice to you is that you find a book that answers less upsetting questions than this one. Perhaps your librarian, bookseller, or parole officer can recommend a book that answers the question, \"Aren't ponies adorable?\"",
        "Category": " Juvenile Fiction , Biographical , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The Miserable Mill (A Series of Unfortunate Events, Book 4) (A Series of Unfortunate Events, 4)",
        "Authors": "By Snicket, Lemony and Helquist, Brett (ILT)",
        "Description": "NOW A NETFLIX ORIGINAL SERIESI hope, for your sake, that you have not chosen to read this book because you are in the mood for a pleasant experience. If this is the case, I advise you to put this book down instantaneously, because of all the books describing the unhappy lives of the Baudelaire orphans, The Miserable Mill might be the unhappiest yet. Violet, Klaus, and Sunny Baudelaire are sent to Paltryville to work in a lumber mill, and they find disaster and misfortune lurking behind every log. The pages of this book, I'm sorry to inform you, contain such unpleasantries as a giant pincher machine, a bad casserole, a man with a cloud of smoke where his head should be, a hypnotist, a terrible accident resulting in injury, and coupons. I have promised to write down the entire history of these three poor children, but you haven't, so if you prefer stories that are more heartwarming, please feel free to make another selection.With all due respect, Lemony Snicket",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Friends for Life: A Collection of Writings on the Importance of Lasting Friendship",
        "Authors": "By Morris, Gary (EDT)",
        "Description": "",
        "Category": " Poetry , American , General",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Finding the Titanic (Hello Reader! Level 4)",
        "Authors": "By Marschall, Ken (ILT), Ballard, Robert D., and Froman, Nan",
        "Description": "The story of the Titanic right up to its rediscovery is told for more advanced, independent young readers by the man who discovered the great sunken ship. Original.",
        "Category": "",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "The Pigman",
        "Authors": "By Zindel, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "DELL",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "June",
            "Year": "1970"
        }
    },
    {
        "Title": "The Pill Book New And Revised 8th Edition",
        "Authors": "By Silverman, Harold M. (EDT)",
        "Description": "Based on information from the Food and Drug Administration, a consumer's guide offers up-to-date profiles of the 1,500 most commonly prescribed drugs, including generic and brand names, usual dosages, and side effects, as well as color photographs. Original.",
        "Category": " Health & Fitness , Reference",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Merck Manual of Medical Information: Home Edition",
        "Authors": "By Beers, Mark H. (EDT), Fletcher, Andrew J. (EDT), Berkow, Robert (EDT), and Merck & Co. (COR)",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Merck & Co.",
        "Price Starting With ($)": "7.6",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Widow and the Wastrel (Janet Dailey Americana - Ohio, Book 35)",
        "Authors": "By Dailey, Janet",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Bubble Gum and Chalk Dust: Prayers and Poems for Teachers",
        "Authors": "By Carney, Mary Lou",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "New Testament: New King James Version",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "American Bible Society",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Siddhartha: A Novel",
        "Authors": "By Hesse, Hermann",
        "Description": "The classic novel of a quest for knowledge that has delighted, inspired, and influenced generations of readers, writers, and thinkers—a perennial favorite for graduation gifts.Nominated as one of America’s best-loved novels by PBS’s The Great American ReadThough set in a place and time far  removed from the Germany of 1922, the year of the book’s debut, the novel is infused  with the sensibilities of Hermann Hesse’s time, synthesizing disparate philosophies–Eastern  religions, Jungian archetypes, Western individualism–into a unique vision of life  as expressed through one man’s search for meaning. It is the story of the quest  of Siddhartha, a wealthy Indian Brahmin who casts off a life of privilege and comfort  to seek spiritual fulfillment and wisdom. On his journey, Siddhartha encounters wandering  ascetics, Buddhist monks, and successful merchants, as well as a courtesan named  Kamala and a simple ferryman who has attained enlightenment. Traveling among these  people and experiencing life’s vital passages–love, work, friendship, and fatherhood–Siddhartha  discovers that true knowledge is guided from within.",
        "Category": " Fiction , Classics",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Death of Ivan Ilyich (Bantam Classics)",
        "Authors": "By Tolstoy, Leo",
        "Description": "Hailed as one of the world's supreme masterpieces on the subject of death and dying, The Death of Ivan Ilyich is the story of a worldly careerist, a high court judge who has never given the inevitability of his death so much as a passing thought. But one day death announces itself to him, and to his shocked surprise he is brought face to face with his own mortality. How, Tolstoy asks, does an unreflective man confront his one and only moment of truth?This short novel was the artistic culmination of a profound spiritual crisis in Tolstoy's life, a nine-year period following the publication of Anna Karenina during which he wrote not a word of fiction. A thoroughly absorbing and, at times, terrifying glimpse into the abyss of death, it is also a strong testament to the possibility of finding spiritual salvation.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "Acts 1-12: God Moves in the Early Church (Fisherman Bible Studyguide Series)",
        "Authors": "By Christensen, Chuck",
        "Description": "Discover the Power of CommunityWhat is the biblical pattern for local church life? The book of Acts shows a community of joyful believers, empowered by the Holy Spirit, serving the Lord and one another. They actively enlarged their community, tasted both persecution and God’s miraculous protection, and daily participated in God’s supernatural work. As you study the successes and failures of the New Testament church, you’ll be encouraged to ask God to move with the same kind of vital power in your own church community.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Shaw Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Breast Cancer For Dummies",
        "Authors": "By Elk, Ronit and Morrow, Monica",
        "Description": "If you or someone you love has been diagnosed with breast cancer, you're probably confused, afraid, shocked, or even angry. Or you may be all of the above. Let this book become your trusted manual. Discover more about the cancer, explore treatment options, find ways to make this part of your life easier. Let shared experiences serve as your knowledgeable guide and anchor to help you make wise and confident choices.Think of breast cancer as a journey and this book as your roadmap. Have you already been diagnosed? In that case, this book can help you explore these important truths:Breast cancer is not a death sentence. Most women diagnosed with early stage breast cancer can look forward to enjoying a healthy, full life.Not only are you unique as a person, but so, too, is your particular form of cancer, your treatment options, and your prognosis.Every day more is discovered about how to prevent, detect earlier, and more effectively treat breast cancer.You are not alone. More than two million women in the United States today are breast cancer survivors. Thousands of groups and programs across the country offer support, and chances are, one is close to your neighborhood.All the information in this book is based on the most recent research findings, the clinical expertise of oncologists, and the invaluable experiences of the women who have walked this road before. Breast Cancer For Dummies covers all of the following topics and more in simple, easy-to-understand terms:Coming to grips with breast cancerDecoding your pathology reportFinding the right treatment for youRekindling intimacy after treatmentHealth Insurance and money woesTalking to children about breast cancerThis book can help you feel like you have a sister who's a doctor, a sister who tells you what to expect every step of the way, who gives you the best advice she can, and guides you along the way. (Of course, there is absolutely no replacement for advice about you from your own doctor.) You'll feel empowered to know and understand what's going on in your body, so that you can become a part of your own treatment team and make decisions along with your doctors and your family.",
        "Category": " Medical , Oncology",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Your God Is Too Small",
        "Authors": "By J B Phillips",
        "Description": "",
        "Category": "",
        "Publisher": "MacMillan Paperbacks",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "September",
            "Year": "1964"
        }
    },
    {
        "Title": "IF THIS HOUSE COULD TALK...: Historic Homes, Extraordinary Americans",
        "Authors": "By Brownstein, Elizabeth Smith",
        "Description": "Abraham Lincoln once remarked that \"the strength of a nation lies in the homes of its people.\" Author Elizabeth Smith Brownstein, former Director of Research for the Emmy Award-winning series Smithsonian World, proves him right and gives new meaning to the old saying \"If these walls could talk...\" In this book they do, and the stories they tell are fascinating.  The result of an intensive nationwide search that took the author across deserts and plains, into ghost towns, legendary mansions, and secret compartments, If This House Could Talk...opens the doors to some of America's most significant, surprising houses and to the lives of the extraordinary men and women whose stories they tell: from the only house in America with a throne room, where a doomed monarch ruled for just two years, to a beloved poet's simple New Hampshire farm; from a rare and remote plantation complex built by America's greatest architect to the multicolored mansion of an Indian chief; from the house of an innocent victim, of the Salem witch trials in 1692 to the only house our greatest president ever owned.  What stories lie hidden behind the gleaming facade of a quintessential antebellum plantation house? What was it about a small green house that infuriated its neighbors and helped change the face of modern architecture? What do a 250-room chateau built for a bachelor and an overcrowded Lower East Side tenement both say about the persistence of the American Dream? In thought-provoking, anecdotal essays, the author considers these questions and more as she explores such themes as the struggle for equality, the role of women in culture and politics, public skepticism toward government, and the place of art in everyday life. Over 200 specially commissioned and archival photographs combine with her essays to bring to life major episodes in American history and people who have shaped American culture and institutions.  Based on privileged access to private and public homes, rare documents, unpublished diaries, oral histories, and interviews of noted scholars and curators, If This House Could Talk...surprises and moves as it examines the myths and realities and conveys the richness and drama of the American experience.",
        "Category": " Architecture , History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Mummies (Very Peculiar History)",
        "Authors": "By Harris, Nathaniel",
        "Description": "An overview of mummification and embalming includes ancient beliefs regarding life after death, rites, rituals, and ceremonies, and the latest in the science of cryogenics",
        "Category": "",
        "Publisher": "Franklin Watts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The D-Day Companion",
        "Authors": "By Penrose, Jane (EDT)",
        "Description": "Published to commemorate the 60th anniversary of the Normandy Landings, 'The D-Day Companion' book brings together the perspectives and opinions of leading military historians from both sides of the Atlantic. Operation Overlord saw the Allied Generals Eisenhower and Montgomery pit their wits against Hitler in a bold bid to liberate continental Europe. Featuring a foreword by Major Richard Winters, real-life commander of Easy Company as featured in Stephen E Ambrose's 'Band of Brothers', this is a unique and incisive examination of the momentous events that surrounded June 6, 1944. Each chapter of this new book focuses on a different aspect of the D-Day landings, from the build-up to the attack to the experiences of the troops on the ground.",
        "Category": " History , Military , World War II",
        "Publisher": "Osprey Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Dark of the Moon (A Virgil Flowers Novel)",
        "Authors": "By Sandford, John",
        "Description": "Virgil Flowers-tall, lean, late thirties, three times divorced, hair way too long for a cop's-had kicked around for a while before joining the Minnesota Bureau of Criminal Apprehension. First, it was the army and the military police, then the police in St. Paul, and finally Lucas Davenport had brought him into the BCA, promising him, \"We'll only give you the hard stuff.\"  He'd been doing the hard stuff for three years now-but never anything like this. In the small town of Bluestem, where everybody knows everybody, a house way up on a ridge explodes into flames, its owner, a man named Judd, trapped inside. There is a lot of reason to hate him, Flowers discovers. Years ago, Judd had perpetrated a scam that'd driven a lot of local farmers out of business, even to suicide. There are also rumors swirling around: of some very dicey activities with other men's wives; of involvement with some nutcase religious guy; of an out-of-wedlock daughter. In fact, Flowers concludes, you'd probably have to dig around to find a person who didn't despise him.  And that wasn't even the reason Flowers had come to Bluestem. Three weeks before, there'd been another murder-two, in fact-a doctor and his wife, the doctor found propped up in his backyard, both eyes shot out. There hadn't been a murder in Bluestem in years-and now, suddenly, three? Flowers knows two things: This wasn't a coincidence, and this had to be personal.  But just how personal is something even he doesn't realize, and may not find out until too late. Because the next victim . . .may be himself.  Filled with the audacious plotting, rich characters, and brilliant suspense that have always made his books \"compulsively readable\" (Los Angeles Times), Dark of the Moon is vintage Sandford, further proof that he \"is in a class of his own\" (The Orlando Sentinel).",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Memory of Running: A Novel",
        "Authors": "By McLarty, Ron",
        "Description": "Meet Smithson \"Smithy\" Ide, an overweight, friendless, chain-smoking, forty-three-year-old drunk who works as a quality control inspector at a toy-action-figure factory in Rhode Island. By all accounts, especially Smithy's own, he's a loser. Then, within the span of one week, his beloved parents are killed in a car crash, and Smithy learns that his emotionally troubled, long-lost sister, Bethany, has turned up in a morgue in Los Angeles. Unmoored by the loss of his entire family - Smithy had always hoped Bethany might return - he rolls down the driveway of his parents' house on his old Raleigh bicycle into an epic journey that will take him clear across the country.As Smithy pedals across America - through New York City, St. Louis, Denver, and Phoenix, to name a few - he encounters humanity at its best and worst and begins to remember an early life that too many beers have blotted out. The baseball games, the home-cooked meals, the soothing presence of his salt-of-the-earth parents; none of it could transform the dark truth of his sister's madness.",
        "Category": " Fiction , Psychological",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Art and History of Pompeii",
        "Authors": "By Giuntoli, Stefano and Pauli, Erika (TRN)",
        "Description": "A beautifully illustrated guided tour to the buildings,  monuments, the remains of victims, mosaics and wall-paintings of  Pompeii. Designed with the visitor in mind, the photographs are  accompanied by short descriptions and thematic background  discussions, plans and reconstruction drawings of buildings and  streets which recreate the city, its life and its destruction.  Includes a large olded map of the ruins.",
        "Category": " Art , History , General",
        "Publisher": "Book Representation & Dist Ltd",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Kaplan and Sadock's Synopsis of Psychiatry: Behavioral Sciences Clinical Psychiatry",
        "Authors": "By Sadock, Benjamin J., M.D., Kaplan, Harold I, and Grebb, Jack A., M.D.",
        "Description": "The 6th edition (1991) of this classic psychiatric textbook, titled  Synopsis of Psychiatry , is cited in  Brandon-Hill . This revised, updated, and expanded (by 344 pages) edition relies entirely on the new terminology of DSM-IV, including the current DSM-IV diagnostic criteria for all mental disorders. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Medical , Psychiatry , General",
        "Publisher": "Williams & Wilkins",
        "Price Starting With ($)": "7.93",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "ADHD: A Complete and Authoritative Guide",
        "Authors": "By Tippins, Sherill (EDT), American Academy of Pediatrics, Reiff, Michael I., M.D. (EDT), and Letourneau, Anthony Alex (ILT)",
        "Description": "This comprehensive guide to attention deficit/hyperactivity disorder (ADHD) offers parents balanced, reassuring, and authoritative information to help them understand and manage this challenging and often misunderstood condition. Based on the American Academy of Pediatrics' own clinical practice guidelines for ADHD and written in clear, accessible language, this book answers the common questions: How is ADHD diagnosed? What are today's best treatment options? and Will my child outgrow ADHD? Accurate, up-to-date findings on evaluation and diagnosis, coexisting conditions, and unproven treatments are provided. Also addressed are behaviors associated with the teenage years and what schools can do to support children with the condition. ADHD management strategies that balance the roles of behavior therapy, medications, and parenting techniques are suggested.",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "American Academy of Pediatrics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Best of LIFE",
        "Authors": "By David, E",
        "Description": "",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Memory Makers' Great Scrapbooks",
        "Authors": "By Gerbrandt, Michele and Durant, Judith",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Universe",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Chicago Manual of Style: The Essential Guide for Writers, Editors, and Publishers (14th Edition)",
        "Authors": "By Chicago Editorial Staff",
        "Description": "Here is the thoroughly revised and updated edition of the one essential reference for all who work with words - writers, editors, proof-readers, indexers, copywriters, designers, and publishers.Almost 200 pages longer than its predecessor, this edition reflects nearly every significant change in style, usage, procedure, and technology. It is easier to use, richer in illustrative examples, and informed everywhere by the presence of computers in publishing, from manuscript preparation to editing, typesetting, indexing, design, and printing.The result of more than a decade's worth of continuous editing and revision, the changes to this edition fall into two broad categories.First are the changes designed to make the Manual's editorial guidelines more systematic, more inclusive, more reflective of contemporary usage, and more accessible. There are major revisions in the chapter on quotations, which features a fuller discussion of speech and alternative punctuation; in the chapter on names and terms, expanded treatment of nationalities, tribes, and races; a reorganized chapter on foreign languages, with a new section on Hebrew; and a revised and enlarged tabular spelling guide for compound words and words with prefixes and suffixes.The most thoroughly revised portion of the Manual is the section on documentation. What was scattered across three chapters is now more logically and concisely presented in two. Chapter 15 now covers the humanities style of documentation, and chapter 16, the author-date style preferred in the natural and social sciences. Notes and bibliographic entries, text citations and reference-list entries are discussed separately, and there are many examples of ways to cite a range of material - from medieval documents to computer programs, with guidelines for citing data bases, network billboards, and other electronic documents.The other set of changes emphasizes new developments in publishing, from new technologies for composition, design, printing, and binding, to the shifting responsibilities of author and editor in an age of personal computers. For first-time and self-publishing authors, there is also new information about the outside of the book: jackets, covers, and how to obtain and display ISBN numbers and bar codes.The chapter on copyrights and permissions has been rewritten by attorney William Strong to cover current laws, practices, and procedures, with a more substantial section on interpreting the concept of fair use.The bibliography and glossary have also been extensively revised.This revision process has been guided by a set of basic principles: consistency, clarity, literacy, good sense, and good usage, all of them tempered by a respect for the author's individuality of expression. These principles have worked successfully at the Press for a century; constantly renewed, they are what makes the Manual the authoritative voice of publishing. There is no other reference so valued or so necessary.",
        "Category": " Language Arts & Disciplines , Reference",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Farmer Boy (Little House, 2)",
        "Authors": "By Wilder, Laura Ingalls and Williams, Garth (ILT)",
        "Description": "The second book in the treasured Little House series, Farmer Boy is Laura Ingalls Wilder’s beloved story of how her husband, Almanzo, grew up as a farmer boy far from the little house where Laura lived. This edition features the classic black-and-white artwork from Garth Williams.The nine Little House books have been cherished by generations of readers as both a unique glimpse into America’s frontier history and as heartwarming, unforgettable stories. The Little House series has captivated millions of readers with its depiction of life on the American frontier.While Laura Ingalls grows up on the prairie, Almanzo Wilder is living on a big farm in New York State. Here Almanzo and his brother and sisters help with the summer planting and fall harvest. In winter there is wood to be chopped and great slabs of ice to be cut from the river and stored. Time for fun comes when the jolly tin peddler visits, or best of all, when the fair comes to town.Almanzo wishes for just one thing—his very own horse—and he must prove that he is ready for such a big responsibility.",
        "Category": " Juvenile Fiction , Lifestyles , Country Life",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Geography Encyclopedia",
        "Authors": "By Rand McNally and Company",
        "Description": "This comprehensive reference provides a physical survey of the planet Earth and detailed information about the nations and people of every continent, in a thoroughly illustrated volume featuring forty maps",
        "Category": " Juvenile Nonfiction , Social Science , General",
        "Publisher": "Checkerboard Pr",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Haunted Campers: True Ghost Stories",
        "Authors": "By Zullo, Allan",
        "Description": "Eight stories about ghosts and phantoms found haunting campers.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Where the Red Fern Grows",
        "Authors": "By Rawls, Wilson",
        "Description": "Where the Red Fern Grows is a beloved classic that captures the powerful bond between man and  man’s best friend. This edition also includes a special note to readers  from Newbery Medal winner and Printz Honor winner Clare Vanderpool.    Billy has long dreamt of owning not one, but two, dogs. So when he’s finally able to save up enough money for two pups to call his own—Old Dan and Little Ann—he’s ecstatic. It doesn’t matter that times are tough; together they’ll roam the hills of the Ozarks.   Soon Billy and his hounds become the finest hunting team in the valley. Stories of their great achievements spread throughout the region, and the combination of Old Dan’s brawn, Little Ann’s brains, and Billy’s sheer will seems unbeatable. But tragedy awaits these determined hunters—now friends—and Billy learns that hope can grow out of despair, and that the seeds of the future can come from the scars of the past. Praise for Where the Red Fern Grows A Top 100 Children’s Novel, School Library JournalA Must-Read for Kids 9 to 14, NPRA Great American Read's Selection (PBS)Winner of Multiple State AwardsOver 14 million copies in print!“A rewarding book . . . [with] careful, precise observation, all of it rightly phrased....Very touching.” —The New York Times Book Review “One of the great classics of children’s literature . . . Any child who doesn’t get to read this beloved and powerfully emotional book has missed out on an important piece of childhood for the last 40-plus years.” —Common Sense Media“An exciting tale of love and adventure you’ll never forget.” —School Library Journal “A book of unadorned naturalness.” —Kirkus Reviews “Written with so much feeling and sentiment that adults as well as children are drawn [in] with a passion.” —Arizona Daily Star “It’s a story about a young boy and his two hunting dogs and . . . I can’t even go on without getting a little misty.” —The Huffington Post “We tear up just thinking about it.” —Time on the film adaptation",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "129.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Baseball's Best: Five True Stories (Step into Reading)",
        "Authors": "By Gutelle, Andrew, Spohn, Cliff (ILT), and Spohn, Cliff",
        "Description": "Babe Ruth, Joe DiMaggio, Jackie Robinson, Roberto Clemente, and Hank Aaron—five amazing baseball legends. From the first black man to play major-league ball to the longest hitting streak ever, these are some of the game’s most inspiring stories. Find out what unforgettable feats won each player a place in the Baseball Hall of Fame.",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Saturday Night Live: The First Twenty Years",
        "Authors": "By Cader, Michael (EDT), Baskin, Edie (PHT), and Baskin, Edie (EDT)",
        "Description": "Saturday Night Live creator Lorne Michaels once characterized SNL as \"a show for the generation that grew up on television.\" Over the course of twenty successful years, SNL has become the television phenomenon of our time. Here is the book that captures it all.Saturday Night Live: The First Twenty Years, the official book commemorating the show's twentieth anniversary, is a lively, jampacked look at the first twenty years of the show through the voices and memories of those who made it happen - both in front of and behind the camera. Filled with more than five hundred photographs taken by the show's own photographers, it gathers favorite characters, unforgettable sketches, and unexpected moments in rich detail.Since it debuted on October 11, 1975, and through more than 350 subsequent shows, SNL has been the breeding ground and showcase for a wide variety of extraordinary talent, including Dan Aykroyd, Chevy Chase, Gilda Radner, Eddie Murphy, Billy Crystal, Phil Hartman, Jan Hooks, and Dana Carvey, to name a few.",
        "Category": " Humor , General",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "PBS: Destination America",
        "Authors": "By Wills, Charles M.",
        "Description": "This volume accompanies the PBS television series by David Grubin also called Destination America, which focuses on the theme of freedom as a way to trace the story of immigration to the US. Wills combines color photos and illustrations with a description of immigration from early Spanish settlements to colonization, and chapters on immigration for reasons of religion, oppression, desire for land or better work, political asylum, or in the search for the freedom to create art, music, writing and such--he includes discussions of well known immigrants in these areas. Wills is a writer, editor, and consultant specializing in American history. The book measures 10.25x12.25\". Annotation ©2006 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Social Science , Emigration & Immigration",
        "Publisher": "DK",
        "Price Starting With ($)": "7.42",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Mary Engelbreit's Christmas Companion: The Mary Engelbreit Look and How to Get It",
        "Authors": "By Engelbreit, Mary and Lyons, Charlotte",
        "Description": "The beloved children's illustrator offers a lavish, detailed compendium of home-decorating tips and ideas for the Christmas holiday, the second volume in her popular series of home design books, featuring sparkling full-color photographs.",
        "Category": " House & Home , Decorating & Furnishings",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "About the B'Nai Bagels",
        "Authors": "By Konigsburg, E. L.",
        "Description": "Mark feels ill at ease in right field because his mother and brother are manager and coach of his Little League team",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Anne of Ingleside (Anne of Green Gables, No. 6)",
        "Authors": "By Montgomery, L. M.",
        "Description": "Anne is the mother of five, with never a dull  moment in her lively home. And now with a new baby on  the way and insufferable Aunt Mary Maria visiting  -- and wearing out her welcome -- Anne's life is  full to bursting. Still Mrs. Doctor can't  think of any place she'd rather be than her own  beloved Ingleside. Until the day she begins to worry  that her adored Gilbert doesn't love her anymore.  How could that be? She may be a little older, but  she's still the same irrepressible, irreplaceable  redhead -- the wonderful Anne of Green Gables, all  grown up. . . She's ready to make her cherished  husband fall in love with her all over again!",
        "Category": "",
        "Publisher": "Starfire",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Little House on the Prairie (Little House, No 3)",
        "Authors": "By Wilder, Laura Ingalls and Williams, Garth (ILT)",
        "Description": "Based on the real-life adventures of Laura Ingalls Wilder, Little House on the Prairie is the third book in the award-winning Little House series, which has captivated generations of readers. This edition features the classic black-and-white artwork from Garth Williams.Laura Ingalls and her family are heading to Kansas! Leaving behind their home in the Big Woods of Wisconsin, they travel by covered wagon until they find the perfect spot to build a little house on the prairie. Laura and her sister Mary love exploring the rolling hills around their new home, but the family must soon get to work, farming and hunting and gathering food for themselves and for their livestock. Just when the Ingalls family starts to settle into their new home, they find themselves caught in the middle of a conflict. Will they have to move again?The nine books in the timeless Little House series tell the story of Laura’s real childhood as an American pioneer, and are cherished by readers of all generations. They offer a unique glimpse into life on the American frontier, and tell the heartwarming, unforgettable story of a loving family.",
        "Category": " Juvenile Fiction , Social Themes , New Experience",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "23.48",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "By the Shores of Silver Lake (Little House, 5)",
        "Authors": "By Wilder, Laura Ingalls and Williams, Garth (ILT)",
        "Description": "The adventures of Laura Ingalls and her family continue as they move from their little house on the banks of Plum Creek to the wilderness of the unsettled Dakota Territory. Here Pa works on the new railroad until he finds a homestead claim that is perfect for their new little house. Laura takes her first train ride as she, her sisters, and their mother come out to live with Pa on the shores of Silver Lake. After a lonely winter in the surveyors' house, Pa puts up the first building in what will soon be a brand-new town on the beautiful shores of Silver Lake. The Ingallses' covered-wagon travels are finally over.Correlates to the Common Core State Standards in English Language Arts",
        "Category": " Juvenile Fiction , Lifestyles , Country Life",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "A Little Princess",
        "Authors": "By Burnett, Frances Hodgson and Tudor, Tasha (ILT)",
        "Description": "Generations of children have treasured the story of Sara Crewe, the little girl who imagines shes a princess in order to survive hard times at Miss Minchins London boarding school. Now, this classic novel is available in two beautiful new collectors editions. With Tasha Tudors enchanting black-and-white illustrations, and lovely details like a satin ribbon marker and glorious full-color plates in the hardcover, these new editions of A Little Princess are must-haves for anyone who wants to rediscover the magic of this beloved story.",
        "Category": " Juvenile Fiction , Family , Orphans & Foster Homes",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Close Encounters! (The Secret World of Alex Mack, No.18)",
        "Authors": "By Dickens, Charles",
        "Description": "Camping in the desert with her family, Alex is invited by her sister to test the full range of her powers, but she must hold herself back when snoopy UFO investigators target her for a government science experiment. Original.",
        "Category": "",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Corrections: A Novel",
        "Authors": "By Franzen, Jonathan",
        "Description": "Winner of the 2001 National Book Award for FictionAfter almost fifty years as a wife and mother, Enid Lambert is ready to have some fun. Unfortunately, her husband, Alfred, is losing his sanity to Parkinson's disease, and their children have long since flown the family nest to the catastrophes of their own lives. The oldest, Gary, a once-stable portfolio manager and family man, is trying to convince his wife and himself, despite clear signs to the contrary, that he is not clinically depressed. The middle child, Chip, has lost his seemingly secure academic job and is failing spectacularly at his new line of work. And Denise, the youngest, has escaped a disastrous marriage only to pour her youth and beauty down the drain of an affair with a married man-or so her mother fears. Desperate for some pleasure to look forward to, Enid has set her heart on an elusive goal: bringing her family together for one last Christmas at home.",
        "Category": " Fiction , Literary",
        "Publisher": "Picador",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Peace With God",
        "Authors": "By Graham, William Franklin",
        "Description": "The famous Evangelist offers spiritual guidance based on the Christian faith",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "World Wide Punlications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "More Than Coping",
        "Authors": "By Skoglund, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "World Wide Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "She Said Yes: The Unlikely Martyrdom Of Cassie Bernall",
        "Authors": "By Bernall, Misty",
        "Description": "The mother of one of the high school students killed in the Littleton shootings describes her daughter's religious faith",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Plough Pub House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Letters to the Corinthians (The Daily Study Bible Series.--Rev. Ed) (English and Hebrew Edition)",
        "Authors": "By Barclay, William (EDT)",
        "Description": "",
        "Category": " Religion , Biblical Commentary , New Testament",
        "Publisher": "Westminster John Knox Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "Reader's Digest Best Loved Books for Young Readers : Great Cases of Sherlock Holmes",
        "Authors": "By Doyle, Arthur Conan",
        "Description": "",
        "Category": "",
        "Publisher": "Choice Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Dr. Ruth's Guide for Married Lovers",
        "Authors": "By Westheimer, Ruth K.",
        "Description": "The ultimate guidebook to sexual fulfillment and good sexual health by the creator of the hit radio show \"Sexually Speaking\" answers difficult questions, dispels myths, and encourages responsible sex practices in the wake of the AIDS epidemic.",
        "Category": " Family & Relationships , General",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "1-2-3 Magic: Effective Discipline for Children 2\u009612",
        "Authors": "By Phelan, Thomas W.",
        "Description": "Designed to help parents to take charge of their home, offers tips on how to recognize six types of testing and manipulating behavior and how to constructively handle misbehavior at home and in public.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Parentmagic, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The American Spirit, I",
        "Authors": "By Bailey, Thomas Andrew, Kennedy, David M.",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin Harcourt (HMH)",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Primer on the Rheumatic Diseases",
        "Authors": "By Schumacher, H. Ralph (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Arthritis Foundation",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "America Yesterday & Today",
        "Authors": "By Hamer, Blythe",
        "Description": "At one of our country's lowest points in history, the celebration of all things American is at an all time high as we reflect on where we've been, where we're going in a context that has been irreversibly changed.",
        "Category": " History , United States , General",
        "Publisher": "Carlton Publishing Group",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Illusions",
        "Authors": "By Bach, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Laurel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "All I Really Need to Know I Learned in Kindergarten: The Essay That Became a Classic With Special Commentary by Robert Fulghum",
        "Authors": "By Fulghum, Robert",
        "Description": "Most of what I really need to know about how to live and what to do and how to be I learned in kindergarten. Wisdom was not at the top of the graduate school mountain, but there in the sandpile at Sunday School. These are the things I learned:Share everything.Play fair.Don't hit people.Put things back where you found them.Clean up your own mess.Don't take things that aren't yours.Say you're sorry when you hurt somebody.Wash your hands before you eat.Flush.Warm cookies and cold milk are good for you.Live a balanced life.Take a nap every afternoon.When you go out into the world, watch out for traffic, hold hands, and stick together.From the Trade Paperback edition.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Grafton Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    }
]