[
    {
        "Title": "Town Mouse, Country Mouse",
        "Authors": "By Brett, Jan",
        "Description": "The classic tale of a town mouse and a country mouse takes on a new dimension in the imaginative and talented hands of Jan Brett. She introduces two engaging mouse couples eager to get away from their everyday lives. But when they agree to swap homes, they are plunged into unexpected adventures at every turn.In a story filled with suspense and humor, lush green country scenes alternate with the elegant details of a fine Victorian townhouse, making this a breathtakingly beautiful picture book.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "WW III: Signs of the Impending Battle of Armageddon",
        "Authors": "By White, John Wesley",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1977"
        }
    },
    {
        "Title": "Nea: Propaganda Front of the Radical Left",
        "Authors": "By Reed, Sally D.",
        "Description": "",
        "Category": "",
        "Publisher": "Sally D. Reed",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Ninth Grade Slays",
        "Authors": "By Brewer, Heather",
        "Description": "Freshman year stinks for Vlad Tod. Bullies still harass him. The photographer from the school newspaper is tailing him. And failing his studies could be deadly. A trip to Siberia gives ?study abroad? a whole new meaning as Vlad connects with other vampires and advances his mind-control abilities, but will he return home with the skills to recognize a vampire slayer when he sees one? In this thrilling sequel to Eighth Grade Bites, Vlad must confront the secrets of the past and battle forces that once again threaten his life.",
        "Category": " Young Adult Fiction , Fantasy , Contemporary",
        "Publisher": "Speak",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Hunted (House of Night, Book 5)",
        "Authors": "By Cast, P. C. and Cast, Kristin",
        "Description": "What if the hottest guy in the world was hiding a nameless evil, and all he wanted was you?At the start of this heart-pounding new installment of the bestselling House of Night series, Zoey's friends have her back again and Stevie Rae and the red fledglings aren't Neferet's secrets any longer.  But an unexpected danger has emerged. Neferet guards her powerful new consort, Kalona, and no one at the House of Night seems to understand the threat he poses.  Kalona looks gorgeous, and he has the House of Night under his spell. A past life holds the key to breaking his rapidly spreading influence, but what if this past life shows Zoey secrets she doesn't want to hear and truths she can't face?On the run and holed up in Tulsa's Prohibition-era tunnels, Zoey and her gang must discover a way to deal with something that might bring them all down.  Meanwhile, Zoey has a few other little problems.  The red fledglings have cleaned up well – they've even managed to make the dark, creepy tunnels feel more like home – but are they really as friendly as they seem?  On the boyfriend front, Zoey has a chance to make things right with super-hot ex-, Erik, but she can't stop thinking about Stark, the archer who died in her arms after one unforgettable night, and she is driven to try to save him from Neferet's sinister influence at all costs.  Will anyone believe the power evil has to hide among us?",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Edge of Battle",
        "Authors": "By Brown, Dale",
        "Description": "With tensions escalating along the U.S.-Mexican border, thanks to battles between rival drug lords and the flow of illegal immigrants, the U.S. launches Operation Rampart under the command of Major Jason Richter and his Task Force TALON, who find themselves targeted by drug kingpin Enrique Fuera and a nationalist Mexican president out to regain control of the U.S. Southwest. Reprint.",
        "Category": " Fiction , War & Military",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Fundamentals of Anatomy & Physiology",
        "Authors": "By Martini, Frederic",
        "Description": "",
        "Category": " Science , Life Sciences , Human Anatomy & Physiology",
        "Publisher": "Prentice Hall College Div",
        "Price Starting With ($)": "10.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Night Sky (Pocket Guide Oceana)",
        "Authors": "By An Oceana Book",
        "Description": "",
        "Category": "",
        "Publisher": "Oceana",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Ashana",
        "Authors": "By Roesch, E. P.",
        "Description": "In the 1750s, Russian fur traders invade the Alaskan village of the Athabaskans, taking the beautiful Ashana as a hostage, in a novel based on a true story of a young woman who tries to keep her tribe's culture alive",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Pathophysiology: Clinical Concepts of Disease Processes",
        "Authors": "By Price, Sylvia Anderson (EDT), Wilson, Lorraine McCarty (EDT), and Brudon, Margaret Croup (ILT)",
        "Description": "The new edition of this well-respected text uses a body system approach to present diseases, focusing on alterations in biologic processes that affect the body's equilibrium. The book retains the easy readability, shorter chapter lengths, innovative and numerous end-of-chapter study questions, and outstanding pedagogic elements of previous editions. New features include full-color plates, new and revised illustrations, a new chapter on pain, and significant content updates.",
        "Category": " Medical , Pathophysiology",
        "Publisher": "Mosby",
        "Price Starting With ($)": "10.34",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Fundamentals of Anatomy & Physiology, Sixth Edition",
        "Authors": "By Martini, Frederic",
        "Description": "",
        "Category": " Science , Life Sciences , Human Anatomy & Physiology",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Act of War",
        "Authors": "By Brown, Dale",
        "Description": "Near Houston, Texas, an oil refinery belonging to one of the world's largest energy companies is obliterated by a \"backpack\" nuclear device -- the first of many planned global attacks against corporations and government organizations accused of plundering the world's natural resources.A horrific act of war has been perpetrated against the U.S. and her interests -- and Major Jason Richter and his top-secret, high-tech Task Force TALON are dispatched to pursue, engage, and destroy this virulent new strain of terrorism.Yet Richter's plan of swift, brutal, and unconventional action is threatened by an enemy buried deep in the highest level of government -- a mole whose blind desire for personal vengeance could doom Richter and his team . . . and America.",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Death and Honor (Honor Bound, Book 4)",
        "Authors": "By Griffin, W. E. B. and Butterworth, William E., IV",
        "Description": "In 1943, Argentina Marine pilotturned- agent Cletus Frade is setting up an OSS-operated airline. But before Frade can get airborne, two interwoven German operations must be grounded. And for Frade-whose father was killed by the Nazis-the mission is about to get personal.",
        "Category": " Fiction , War & Military",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Istanbul: The Imperial City",
        "Authors": "By Freely, John",
        "Description": "\"Surrounded by a garland of waters\" on the narrow straits of the Bosporus dividing Europe and Asia, Istanbul, formerly known as Constantinople, has been an unrivaled locus of cultural exchange since its beginnings as the Greek colony Byzantium. In its more than twenty-six centuries of existence the city has survived countless natural and political catastrophes, foreign conquests, and dynastic upheavals, enduring fantastic changes in religion, language, political status, and name. Despite these onslaughts of time, a vibrant local character and spirit have abided. This fascinating history of the city from its foundation to the present is a guide for the curious traveler as well as an evocation of an illustrious past.    Also included is a comprehensive gazetteer of all major monuments and museums",
        "Category": " History , Middle East , General",
        "Publisher": "Penguin Books Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Sponging, Etc (Creative Touches)",
        "Authors": "By Cy Decosse Incorporated (EDT)",
        "Description": "Offers instructions for sponge painting, color washing, and using paint glazes with common household materials to achieve various effects on walls, furniture, and accessories",
        "Category": " Reference , Research",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Sand in My Bra and Other Misadventures: Funny Women Write from the Road (Travelers' Tales)",
        "Authors": "By Leo, Jennifer L. (EDT)",
        "Description": "Travel isn’t always what we dream it will be, but...oh the stories that follow! For the 25 women in this book who packed their sense of humor as they traveled from Alaska to Zanzibar, the journey brought tales of misadventure that their children and grandchildren, and readers of this book, will never forget. Smile, chuckle, and laugh out loud to the candid and comical accounts of these memorable trips.Brigid Kelso gets bitten and beaten by a healer possessed by a goddess in Kathmandu in \"Llamo Dolkar\"\"Fifteen Minutes Can Last Forever\" when JoAnn Hornak is being chased by a herd of fifty African elephantsEllen Degeneres’s fear of flying comes out in ripe language shocking the nun in the next seat in \"The Plane Truth\"\"Herbal Girl\" Deborah Bear tests the strength of ginger when sea sickness overcomes her on a not-so-idyllic voyageSandra Tsing Loh vacations in \"Tahiti!\" where she finds the freedom to be fat\"A Prude in Patpong,\" Jennifer Leo discovers the outrageous world of Bangkok’s sex showsCooking up a \"Rainbow Special\" in Guatemala, Cara Tabachnick inadvertantly poisons her new friends with explosive and hilarious results",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Travelers' Tales",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Complete Idiot's Guide to Financial Aid for College",
        "Authors": "By Rye, David",
        "Description": "",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Artists of the Old West",
        "Authors": "By Ewers, John Canfield",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "65.76",
        "Publish Date": {
            "Month": "December",
            "Year": "1973"
        }
    },
    {
        "Title": "Lucinda's Secret (Spiderwick Chronicles, Book 3)",
        "Authors": "By DiTerlizzi, Tony and Black, Holly",
        "Description": "Let the story of my niece and nephews be a warning. The more you know, the more danger you're in. And trust me, you don't want to meddle with the Little People. -- S.S.  One thrilling adventure -- The Spiderwick Chronicles!  Their world is closer than you think.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Ideas for Great Kids' Rooms",
        "Authors": "By Lang, Susan",
        "Description": "Offers practical advice on decorating a child's room, shows a variety of styles, and discusses beds, tables, desks, chairs, storage, flooring, wall and window treatments, and lighting.",
        "Category": " House & Home , Decorating",
        "Publisher": "Sunset Living",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Black & Decker: The Complete Guide to Painting & Decorating (Black & Decker Home Improvement Library)",
        "Authors": "By Creative Publishing",
        "Description": "Presents decorating ideas for improving the appearance and style of any room",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Horse Sense: A Complete Guide to Horse Selection & Care",
        "Authors": "By Mettler, John J. and Sears, Elayne (ILT)",
        "Description": "Offering a regimen of preventative care that will ensure your horse’s long-term health, this guide covers everything from selecting a healthy horse to dealing with pregnancy, equine nutrition, and the special needs of older horses. Providing in-depth discussions of immunizations, worming, and dental care, Horse Sense also includes techniques for effectively treating common maladies like colic, choke, and founder. Monitor your animal’s health, prevent debilitating illnesses, and keep your horse thriving and happy for years to come.",
        "Category": " Pets , Horses",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Paris Out of Hand: A Wayward Guide",
        "Authors": "By Hodgson, Barbara, Bantock, Nick, and Gordon, Karen Elizabeth",
        "Description": "From the author of The Transitive Vampire, comes an invitation to a strangely illuminated City of Light, Paris out of Hand. This seductively beautiful replica of a 19th-century travel book?replete with illustrations of sights you will never see and maps that may plummet you into a different era?guides readers through the Paris that is, that might be, and that never was. Amid the Parisian locales you know and love, unheard-of temptations abound. If your visit to the Cafe Conjugal ends in a spat, you can make up at the luscious and fantastic Museum of Lips and Books. From the disconcerting Brasserie Loplop, steal your chair for the Cinema Pont Neuf, whose movies flow onto the Seine. Your curiosity sated for the day, check into Hotel des Etrangers, where phantoms change the sheets and your room in the middle of the night. Unhandy glossaries help you talk your way through these provocative encounters, with such apropos comments as J'aimerais sortir avec votre hyene pour boire un verre (I'd like to take your hyena out for a drink). A rare and rowdy entertainment that dares its readers to explore a Paris one can only wish existed.",
        "Category": " Travel , Europe , France",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Six Sigma Demystified: A Self-Teaching Guide",
        "Authors": "By Keller, Paul A.",
        "Description": "Taking the mystery out of Six Sigma implementationThis easy-to-understand reference in the popular Demystified series teaches the methods of Six Sigma, explains their applications, and tests expertise without confusing statistics and formulas. Expert Paul Keller and Six Sigma guru Tom Pyzdek describe helpful tools for Six Sigma teams, identifying their uses, limitations, and application during multiple stages of DMAIC. They also outline additional tools for full effectiveness and provide necessary calculations and assumptions. In addition, they provide:Detailed examples and diagrams Practical exercises and complete solutions A final exam to test overall knowledge Materials ideal for self-study or for training groups of Black Belts and Green Belts",
        "Category": " Business & Economics , Total Quality Management",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Moments for Teachers: Heartwarming Lessons for Givers of Knowledge (Moments for Series)",
        "Authors": "By Strand, Robert",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "New Leaf Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "The Gold at the Starbow's End",
        "Authors": "By Frederik Pohl",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "August",
            "Year": "1972"
        }
    },
    {
        "Title": "All You Need to Be Impossibly French: A Witty Investigation into the Lives, Lusts, and Little Secrets of French Women",
        "Authors": "By Powell, Helena Frith",
        "Description": "The allure of the Frenchwoman—sexy, sophisticated, flirtatious, and glamorous—is legendary. More than an eye for fashion or a taste for elegance, the French je ne sais quoi embodies the essential ingredients for looking and feeling beautiful.With wit, whimsy, and wonder, British expatriate Helena Frith Powell uncovers the secrets of chic living in All You Need to Be Impossibly French, a cheeky guide to releasing your inner Frenchwoman. Delving deep into a mysterious realm of face creams, silk lingerie, and shopping-as-exercise, Powell reveals how French women stay impossibly thin and irresistibly sexy by achieving the maximum effect from the minimum amount of effort. Forget diet and inspiration books and style guides—this is all you need to embrace the wisdom of French living, and learn how to turn every day into la petite aventure.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Julie and Julia: My Year of Cooking Dangerously",
        "Authors": "By Powell, Julie",
        "Description": "Julie & Julia, the bestselling memoir that's \"irresistible....A kind of Bridget Jones meets The French Chef\" (Philadelphia Inquirer), is now a major motion picture.  Julie Powell, nearing thirty and trapped in a dead-end secretarial job, resolves to reclaim her life by cooking in the span of a single year, every one of the 524 recipes in Julia Child's legendary Mastering the Art of French Cooking. Her unexpected reward: not just a newfound respect for calves' livers and aspic, but a new life-lived with gusto.  The film is written and directed by Nora Ephron and stars Amy Adams as Julie and Meryl Streep as Julia.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "A Stranger's Game (A Bitter Creek Novel)",
        "Authors": "By Johnston, Joan",
        "Description": "From New York Times bestselling author Joan Johnston, the thrilling seventh Bitter Creek novel featuring passion and intrigue mixed with an explosive, spine-tingling tale of murder, wrongful imprisonment, and a woman who counts no cost too high to see a killer brought to justice.FBI Special Agent Breed Grayhawk has the hottest sex in his life with a stranger who calls herself Grace Smith, only to discover early the next morning that she’s a convicted double murderer who broke her parole a year ago and disappeared. Now she’s his prime suspect in an assassination plot against the US president.Grace Caldwell—a.k.a. Grace Smith—is determined to find the killer who framed her for the murder of her father and stepmother—and make him pay. She burgles the home of her #1 suspect and nets a surprising haul: a hot-pink, silk-covered diary—the record of a sex-addicted wife’s adventures—which suggests that Grace’s top suspect is a serial killer. But her theft has been caught on tape, and the man she’s been chasing becomes the hunter…with Grace as his prey.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "A Taste of Magic",
        "Authors": "By Madison, Tracy",
        "Description": "When Liz Stevens, armed with ancient gypsy magic passed down from her grandmother, becomes empowered, everything she bakes has special ingredients that profoundly impact those around her including her hunky policeman neighbor and her loser of an ex-husband. Original.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Love Spell Paranormal Romance",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The Girl with the Dragon Tattoo (Millennium)",
        "Authors": "By Larsson, Stieg and Keeland, Reg (TRN)",
        "Description": "An International Bestselling Sensation A murder mystery, family saga, love story, and a tale of financial intrigue wrapped into one satisfyingly complex and entertainingly atmospheric novel.Harriet Vanger, scion of one of Sweden's wealthiest families, disappeared over forty years ago. All these years later, her aged uncle continues to seek the truth. He hires Mikael Blomkvist, a crusading journalist recently trapped by a libel conviction, to investigate. He is aided by the pieced and tattooed punk prodigy Lisbeth Salander. Together they tap into a vein of unfathomable iniquity and astonishing corruption.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Smoke Screen",
        "Authors": "By Brown, Sandra",
        "Description": "From the #1 New York Times bestsellng author of Seeing Red comes a \"scorching...action-filled\" (Publishers Weekly) tale of corruption and betrayal, revenge, and reversal.When newswoman Britt Shelley wakes up to find herself in bed with Jay Burgess, a star detective in the Charleston PD, she remembers nothing of how she got there—or how Jay wound up dead. Handsome, hard-partying Jay was one of four heroic city officials who risked their lives five years earlier to lead others to safety from a catastrophic fire. His lifelong friend, Raley Gannon, was later assigned to investigate the blaze. But Raley never finished the inquiry because one calamitous night his career was destroyed by scandal. Now, the newswoman whose biased reporting helped bring about Raley's downfall might be his only chance to vindicate himself and get justice for the fire's victims. But the more Raley and Britt discover about that fateful day, the more perilous the situation becomes, until they're not only chasing the truth but running for their lives.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "The Handmaiden's Necklace",
        "Authors": "By Martin, Kat",
        "Description": "Discovering that he was tricked into believing that the woman he loved, Danielle Duval, betrayed him, Rafael, Duke of Sheffield, follows Dani to America and, placing her in a compromising position, forces her to marry him and gives her a priceless necklace rumored to right the wrongs of the past. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Needlepoint Techniques and Projects",
        "Authors": "By Sunset",
        "Description": "Offers guidance in creating original designs as well as providing instructions for making pillows, pincushions, coasters, and pictures",
        "Category": " Art , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Blue Moon (Nightcreature, Book 1)",
        "Authors": "By Handeland, Lori",
        "Description": "Miniwa, Wisconsin is under siege, but not by the usual summer tourists. The area's normally shy wolf population has begun stalking human prey, and their victims have been disappearing...or worse. Something is happening in the woods. Something brutal and primitive...Officer Jessie McQuade has seen plenty in her years on the force-but nothing as intriguing as the gorgeous, naked man she encounters while tracking a rogue wolf. Professor Will Cadotte is a Native American activist. He's also the only man capable of distracting Jessie from her work. And for a cop, distraction-no matter how pleasurable-can be deadly. It's against Jessie's better judgment to accept Will's help in her investigation, yet she soon finds herself doing exactly that-and more. Will's dark, penetrating eyes see into a part of Jessie's soul she never knew existed. It's exhilarating...and terrifying.Now, as a town's deepest secrets come to light, no one is safe: not friends, lovers, or strangers. And as Jessie follows a bloody trail to the shocking truth, she'll have to decide who she can trust when the moon is full...  Lori Handeland's Blue Moon is the winner of a 2005 RITA Award.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Outcast (The Benedict Brothers)",
        "Authors": "By Johnston, Joan",
        "Description": "Society bachelor and former army sniper Ben Benedict moves between two worlds&#151;from high-society Washington to the mean city streets, from tuxedos to Glocks. His powerful Virginia family wants him out of harm's way, but Ben stays on the job, determined to make amends for a past that haunts him.Dr. Anna Schuster is fighting demons of her own when she crosses paths with Agent Benedict. The two become adversaries&#151;and lovers&#151;as they search for an Al Qaeda operative bent on revenge.Ben must fight against time&#151;and his own darkness&#151;to rescue millions of innocents and the woman he loves from a virulent bioweapon in the hands of a dangerous enemy.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "The Lone Drow (Drizzt \"4: Paths of Darkness\") (The Legend of Drizzt)",
        "Authors": "By Salvatore, R. A.",
        "Description": "The latest New York Times best-seller from R.A. Salvatore is now in paperback! The Lone Drow is yet another top release from premiere Forgotten Realms author R.A. Salvatore. This mass market reprint focuses primarily on his signature character, Drizzt Do'Urden, who has been the subject of most of Salvatore's best-selling Forgotten Realms titles. This title includes a sample chapter from the author's next hardcover, The Two Swords.Continues the adventures of the Dark Elf hero, Drizzt Do-Urden, and his companions.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Wizards of the Coast",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "It's a Ziggy World",
        "Authors": "By Wilson, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1975"
        }
    },
    {
        "Title": "Lion's Bride",
        "Authors": "By Johansen, Iris",
        "Description": "A sizzling novel of passion, peril, and searing sensuality from “a master among master storytellers” (Affaire de Coeur)—a magical weaver of spellbinding tales, enticing characters, and unforgettable romance.The darkly handsome warrior found her in the hot desert night, the last survivor of a caravan devastated by a brutal attack. But Thea could hardly have found a less likely savior. Brooding and powerful, the infamous Lord Ware felt no need to rescue a total stranger, but Thea’s striking beauty and fighting spirit moved him. So the knight in tarnished armor carried her away to his secret stronghold at Dundragon, where she would become his prisoner, his tormentor, his lover . . . and the one weapon his deadly enemy could use to destroy him.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Empress's New Lingerie: Bedtime Stories for Grownups",
        "Authors": "By Rollins, Hillary",
        "Description": "Presenting erotic new renditions of traditional fairy tales, this witty collection recounts the stories of a haughty princess who ends up revealing more than her leadership skills to her people, a Cinderella who attends the palace ball in a pair of patent-leather stiletto heels, and a Goldilocks who sets out to discover which of three \"bare\" bachelors is just right. 25,000 first printing.",
        "Category": " Fiction , Erotica",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "How to Eat Like a Thin Person: The Dieter's Handbook of Do's and Don'ts",
        "Authors": "By Dusky, Lorraine",
        "Description": "Offers helpful tips for dieters on such topics as exercise, alcohol, eating in restaurants, and nutrition",
        "Category": " Health & Fitness , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Courage, Commitment & Change: A Personal History of Landon School",
        "Authors": "By Dixon, Thomas W.",
        "Description": "",
        "Category": "",
        "Publisher": "Landon School",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Apartment in Paris: Renting, Roaming, Wining, and Dining",
        "Authors": "By Kloman, Erasmus H.",
        "Description": "The author relates his experiences renting vacation apartments in different areas of Paris and provides suggestions and advice for visitors who wish to live as Parisians rather than tourists",
        "Category": " Travel , Europe , France",
        "Publisher": "Hastings House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Heart Of The Dragon (Atlantis, Book 1)",
        "Authors": "By Showalter, Gena",
        "Description": "Searching for her missing brother, Grace Carlyle never dreamed she would discover a secret world populated by mythological monsters&#151;or find herself facing a sword-wielding being whose looks put mortal men to shame.But there he was, Darius en Kragin, one of a race of shape-shifting warriors bound to guard the gates of Atlantis, and kill all travelers who strayed within its borders.Now Grace's life was in his hands, and Darius had to choose between his centuries-old vow and the woman who had slipped beneath his defenses and stolen the heart of Atlantis's fiercest dragon.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Michelin THE GREEN GUIDE Paris, 3e (THE GREEN GUIDE)",
        "Authors": "By Pneu Michelin",
        "Description": "",
        "Category": " Travel , Europe , France",
        "Publisher": "Michelin Travel Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Yours Until Dawn (Avon Historical Romance)",
        "Authors": "By Medeiros, Teresa",
        "Description": "Gabriel Fairchild's valor during battle earns him the reputation of hero, but costs him both his sight and his hope for the future. Abandoned by the fiancée he adored, the man who once walked like a prince among London's elite secludes himself in his family's mansion, cursing his way through dark days and darker nights.Prim nurse Samantha Wickersham arrives at Fairchild Park to find her new charge behaving more like a beast than a man. Determined to do her duty, she engages the arrogant earl in a battle of both wit and wills. Although he claims she doesn't possess an ounce of womanly softness, she can feel his heart racing at her slightest touch. As Samantha begins to let the light back into Gabriel's life and his heart, they both discover that some secrets -- and some pleasures -- are best explored in the dark ...",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Insiders' French: Beyond the Dictionary",
        "Authors": "By Levieux, Michel and Levieux, Eleanor",
        "Description": "If you had been living in France in the 1990s, the language you would have heard on the radio and television or seen in the newspapers would be far removed from the French language of ten or twenty years ago. The country and its language have changed tremendously in a relatively short period of time, and, as a result, English speakers with a grounding in French can still find themselves struggling to understand terms commonly encountered in contemporary French society. Luckily, Eleanor and Michel Levieux now bring us up to date with their Insiders' French, an utterly entertaining and informative guide to the language of the \"new France.\"This \"new France\" is a country poised to experience the European single currency but uncertain about being part of Europe. It is hooked on fast food but ambivalent about the country where it originated. France today has record unemployment and an increasingly controversial immigrant population. Clearly, given the rapidly changing conditions and lifestyles, conventional French dictionaries alone cannot completely inform readers and visitors. Insiders' French offers a solution to the incomprehension, a unique handbook in which you'll find the language of European union, the space program, abortion and women's rights, high-tech industries, and health care, among other topics. Entries proceed by association of ideas and related terms, with extensive cross-referencing, while still being alphabetized for easy reference like a standard dictionary. Cartoons from major French journals add to your understanding and enjoyment.Insiders' French opens up the secret territory of French politics and culture that is often not understood by visitors or students, and it does so with wit and verve--qualities that remain in the French language despite its recent changes.",
        "Category": " Foreign Language Study , French",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Seduction of an Unknown Lady",
        "Authors": "By James, Samantha",
        "Description": "Seduction is something Fionna Hawkes knows nothing about. So when she encounters a sexy stranger on a moonlit street, her first instinct is to defend herself against her darkly handsome suitor. But letting go of suspicion and allowing herself to fall for Lord Aidan McBride brings even greater danger. In his eyes, she glimpses a powerful passion she longs to fulfill. In his arms, she aches with the secret she longs to unburden. A secret that could cost her her livelihood—and her life.Aidan could never resist a mystery, especially one as mesmerizing as the lovely Miss Hawkes! Drawing her into the shelter of his embrace, he won't rest until he convinces her to reveal everything. Braving the danger that stalks Fionna at every turn, Aidan is determined to defend her—and just as determined to claim her as his own.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "U.S. Atlas For Young People - Pbk (Troll Reference Library)",
        "Authors": "By Smith, Kathie Billingslea",
        "Description": "Presents brief information, photographs, and a map for each state and possession of the United States",
        "Category": " Juvenile Nonfiction , Reference , Atlases",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Wedding Challenge (Matchmakers)",
        "Authors": "By Camp, Candace",
        "Description": "When her overprotective brother warns her to stay away from the mysterious Earl of Bromwell, Lady Calandra, defying brother's wishes, is determined to see the Earl again, only to walk straight into a trap. Original.",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Devil in Winter",
        "Authors": "By Kleypas, Lisa",
        "Description": "\"I'm Sebastian, Lord St. Vincent. I can't be celibate. Everyone knows that.\"Desperate to escape her scheming relatives, Evangeline Jenner has sought the help of the most infamous scoundrel in London.A marriage of convenience is the only solution.No one would have ever paired the shy, stammering wallflower with the sinfully handsome viscount. It quickly becomes clear, however, that Evie is a woman of hidden strength—and Sebastian desires her more than any woman he's ever known.Determined to win her husband's elusive heart, Evie dares to strike a bargain with the devil: If Sebastian can stay celibate for three months, she will allow him into her bed.When Evie is threatened by a vengeful enemy from the past, Sebastian vows to do whatever it takes to protect his wife . . . even at the expense of his own life.Together they will defy their perilous fate, for the sake of all-consuming love.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Snakes & Reptiles Ls",
        "Authors": "By Elting, Mary",
        "Description": "Describes the characteristics, habits, and habitat of an often misunderstood group of animals that includes snakes, crocodiles, alligators, turtles, and lizards.",
        "Category": "",
        "Publisher": "Simon & Schuster Children's Publishing",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "24 Girls in 7 Days",
        "Authors": "By Bradley, Alex",
        "Description": "There are few things sadder than Jack Grammar’s love life. So when his friends take it upon themselves to get him a date to the prom by placing an intensely humiliating ad in the school paper, they think they are doing him a favor. Jack doesn’t agree. But then the most amazing thing happens: responses to the ad are overwhelming. So overwhelming, in fact, that Jack must narrow the list down. A lot. Not an easy task. Turns out, the girls at City High are quite competitive. From drive-by flashings to breaking and entering to cell phone stalkers, these potential prom dates will stop at nothing to snag the suddenly popular Jack. How will he ever choose just one?",
        "Category": " Young Adult Fiction , Social Themes , Dating & Sex",
        "Publisher": "Speak",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Better Homes and Gardens at the Zoo (Fun-to-do Project Books)",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Shares recipes, games and ideas for things to make, including clay zoo babies, big cat masks and zoo suits",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Cold as Ice (The Ice Series, 2)",
        "Authors": "By Stuart, Anne",
        "Description": "The job was supposed to be dead easy—hand-deliver some legal papers to billionaire philanthropist Harry Van Dorn's extravagant yacht, get his signature and be done. But Manhattan lawyer Genevieve Spenser soon realizes she's in the wrong place at the wrong time, and that the publicly benevolent playboy has a sick, vicious side. As he tries to make her his plaything for the evening, eager to use and abuse her until he discards her with the rest of his victims, Genevieve must keep her wits if she intends to survive the night.But there's someone else on the ship who knows the true depths of Van Dorn's evil. Peter Jensen is far more than the unassuming personal assistant he pretends to be—he's a secret operative who will stop at nothing to ensure Harry's deadly Rule of Seven terror campaign dies with him. But Genevieve's presence has thrown a wrench into his plans, and now he must decide whether to risk his mission to keep her alive, or allow her to become collateral damage&#133;.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Unofficial Guide to Beating Stress",
        "Authors": "By Goudey, Pat",
        "Description": "The dictionary definition of stress includes anything that stimulates and increases awareness. So there's no getting rid of it: stress is always there, in both personal and professional lives. The trick is to learn how to handle it -- readers need to know how to make that adrenaline rush work for rather than against them! The ability to handle life's crises can mean the difference between health problems and psychological burnout and the exhiliration of meeting stressful situations -- and people -- head on and besting them. The Unofficial Guide to Beating Stress offers readers savvy tips on: Telling the difference between good stress and bad stressStaying clear of high-stress foodsWorking out adrenaline surges at the gym or dance studioWarding off the physical damages of stress through massage, chirpractic, and osteopathic techniquesThe Unofficial Panel of Experts members include: Paul J. Rosch, M.D., F.A.C.P., President of The American Institute of Stress!",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Top Ten: Writers Pick Their Favorite Books",
        "Authors": "By Zane, J. Peder (EDT)",
        "Description": "You'll find the answer in The Top Ten: Writers Pick Their Favorite Books: the ultimate guide to the world's greatest books. As writers such as Norman Mailer, Annie Proulx, Stephen King, Jonathan Franzen, Claire Messud, Margaret Drabble, Michael Chabon and Peter Carey name the ten books that have meant the most to them, you'll be reminded of books you have always loved and introduced to works awaiting your discovery.The Top Ten includes summaries of 544 books—each of which is considered to be among the ten greatest books ever written by at least one leading writer. In addition to each writer's Top Ten List, the book features Top Ten Lists tabulated from their picks, including:• The Top Ten Books of All Time• The Top Ten Books by Living Writers• The Top Ten Books of the Twentieth Century• The Top Ten Mysteries• The Top Ten ComediesAlready sparking debate, The Top Ten will help readers answer the most pressing question of all: What should I read next?",
        "Category": " Literary Criticism , Books & Reading",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Jeb Stuart",
        "Authors": "By Thomason, John",
        "Description": "",
        "Category": "",
        "Publisher": "Koneckey & Konecky, 1992.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Book of Inventions",
        "Authors": "By Harrison, Ian and Fry, Art (FRW)",
        "Description": "Combining curious and colorful anecdotes with intricate research and photographs, National Geographic presents a fact-filled and lively history of inventions and their inventors. With a creative and humorous approach to reference, The Book of Inventions is a spirited and engaging look at knowledge and history.From the tiny paperclip to the massive jet engine, and from mastermind Leonardo da Vinci to quirky vacuum-cleaner inventor James Dyson, The Book of Inventions is encyclopedic in scope and entertaining in the extreme. Learn the dates, details, and amazing stories of how some of our most interesting and useful objects have been invented. Presented in an eye-catching retro style, the book's nine chapters reveal how innovations as diverse as the disposable diaper, the zipper, the hair dryer, the photocopier, the artificial heart, and the traffic light have affected all aspects of our daily lives. Compelling and colorful layouts enhance each spread and break down information into small bits that are accessible to readers of all ages.",
        "Category": " Technology & Engineering , Inventions",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Great Upheaval: America and the Birth of the Modern World, 1788-1800",
        "Authors": "By Winik, Jay",
        "Description": "It is an era that redefined history. As the 1790s began, a fragile America teetered on the brink of oblivion, Russia towered as a vast imperial power, and France plunged into revolution. But in contrast to the way conventional histories tell it, none of these remarkable events occurred in isolation. Now, for the first time, in The Great Upheaval, acclaimed historian Jay Winik masterfully illuminates how their fates combined in one extraordinary moment to change the course of civilization.In this sweeping, magisterial drama, Winik brings his vast, meticulous research and narrative genius to the cold, dark battlefields and deadly clashes of ideologies that defined this age. Here is a savage world war, the top-pling of a great dynasty, and an America struggling to survive at home and abroad. Here, too, is the first modern holy war between Islam and a resurgent Christian empire. And here is the richest cast of characters to walk upon the world stage: Washington and Jefferson, Louis XVI and Robespierre, Catherine the Great, Adams, Napoleon, and Selim III. With powerful echoes for understanding the international chaos that confronts the globe today, we see them all fighting desperately for the ideals they believed in, whether man-made democracy or divinely inspired autocracy, whether republicanism or Allah's law.Exquisitely written and utterly compelling, The Great Upheaval vividly depicts an arc of revolutionary fervor stretching from Philadelphia and Paris to St. Petersburg and Cairo—with fateful results. A landmark in historical literature, Winik's gripping, epic portrait of this tumultuous decade will forever transform the way we see America's beginnings and our world.",
        "Category": " History , United States , Revolutionary Period (1775-1800)",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Pillsbury Doughboy Slow Cooker Recipes: 140 New Ways to Have Dinner Ready and Waiting!",
        "Authors": "By Kilen, Kelly (EDT)",
        "Description": "Want to come home every night to a hot, hearty meal ready and waiting? Now you can. From America's most trusted kitchens come a cookbook with 140 slow cooker recipes fro main dishes, side dishes, soups and more!* Honey-Dijon Pork Roast* Mango Chutney-Chicken Curry* Creamy Butternut Squash Soup* Winter Vegetables Stew* Texas Chili* Hot Turkey Sandwiches* Old Fashioned Baked Beans* Garlic Smashed Red Potatoes",
        "Category": " Cooking , Methods , Slow Cooking",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "The Longest Trip Home: A Memoir",
        "Authors": "By Grogan, John",
        "Description": "“As he did in Marley, Grogan makes readers feel they have a seat at the family dinner table….4 stars.”—People John Grogan, author of the phenomenal #1 New York Times bestseller, Marley & Me, once again takes readers into his past, his memories, and his heart in The Longest Trip Home—a funny and poignant memoir of faith, family, and identity. A New York Times bestseller in its own right, The Longest Trip Home has earned glowing accolades from the critics (“Genuinely heartrending,” —New York Times “Wry and witty,” —Washington Post; “Entertaining, funny, and, best of all, always honest at its core,” —St. Louis Post-Dispatch). And, just as Marley & Me was more than simply “a dog book,” John Grogan’s Longest Trip is much, much more than your typical story of a boy’s coming-of-age.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Blue Moon (Anita Blake, Vampire Hunter, Book 8)",
        "Authors": "By Hamilton, Laurell K.",
        "Description": "The Anita Blake, Vampire Hunter backlist lights up the night.  In her eighth adventure, Anita Blake can't turn her back on a former lover during the full moon. Especially since he's behind bars-and he's a werewolf...",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Sea creatures (Eyes on nature)",
        "Authors": "By Jane Resnick and Anton Ericson",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Wild Animals (Eyes on Nature Series)",
        "Authors": "By Donald Olson, John Grassy Jane P. Resnic",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "More Than Words: Stories Of Courage: Homecoming Season\\The Yellow Ribbon\\Hanging By A Thread",
        "Authors": "By Wiggs, Susan, Sala, Sharon, and Richards, Emilie",
        "Description": "Somewhere, at this very moment, a woman's caring and commitment is changing a life in her community &#133; and changing the world. Three of these exceptional women have been selected as recipients of Harlequin's More Than Words award. And three bestselling authors have kindly offered their creativity to write original short stories inspired by these real-life heroines.We hope these stories of courage will touch your heart and inspire the heroine living inside you.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "In His Image (Book One of the Christ Clone Trilogy, 2nd Edition)",
        "Authors": "By Beauseigneur, James",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Selectivehouse Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Uncommon: Finding Your Path to Significance",
        "Authors": "By Dungy, Tony and Whitaker, Nathan",
        "Description": "2009 Retailer's Choice Award winner!Super Bowl–winning coach and #1 New York Times best selling author Tony Dungy has had an unusual opportunity to reflect on what it takes to achieve significance. He is looked to by many as the epitome of the success and significance that is highly valued in our culture. He also works every day with young men who are trying to achieve significance through football and all that goes with a professional athletic career—such as money, power, and celebrity. Coach Dungy has had all that, but he passionately believes that there is a different path to significance, a path characterized by attitudes, ambitions, and allegiances that are all too rare but uncommonly rewarding. Uncommon reveals lessons on achieving significance that the coach has learned from his remarkable parents, his athletic and coaching career, his mentors, and his journey with God. A particular focus of the book: what it means to be a man of significance in a culture that is offering young men few positive role models.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Tyndale Momentum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Emeril's Potluck: Comfort Food with a Kicked-Up Attitude",
        "Authors": "By Lagasse, Emeril",
        "Description": "America's favorite chef Emeril Lagasse is ready to party. Parties and celebrations mean food. Lots of food: tureens of soup, platters of chicken, bowls of salad, casseroles of baked pasta. From family reunions to holiday buffets, summer barbecues to tailgate parties, and weekend brunches to bridal showers, Emeril's Potluck offers crowd-pleasing dishes perfect for gatherings with friends and family.Emeril's Potluck brings together everything Emeril loves most about cooking and eating. The food is simple, flavorful, and perfect for sharing at any get-together. Each recipe serves a whopping 8 to 10 people, but don't assume you're making too much -- everyone will be heading back for seconds and thirds of these Emerilized starters, entrees, drinks, sides, and desserts.Start by toasting the occasion with a glass of Champagne Punch, a Watermelon Daiquiri, or an Orange Emeril. Then let the feast begin! Classic Blue Cheese Dip, Alain's Sweet and Spicy Asian Wings, or Sausage-Stuffed Mushrooms will get your party started right! Main courses range from Olive-Stuffed Leg of Lamb and Creole Mustard and Herb-Wrapped Beef Tenderloin to homey favorites such as Charlotte's Lasagna Bolognese, Penne à la Vodka Casserole, and Tuna Tetrazzini. Of course, it wouldn't be a party without dessert, so save room for Chocolate Peanut Butter Pie, Strawberry Shortcake, and Emeril's Tiramisu.The recipes are quick, easy, and portable. Enjoy these dishes at home or take them on the road. Emeril's Potluck -- so foolproof, so easy, so crowd pleasing that luck has nothing to do with it.",
        "Category": " Cooking , Entertaining",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Sexual Pleasure: Reaching New Heights of Sexual Arousal & Intimacy",
        "Authors": "By Keesling, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "Hunter House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Building a Partnership with Your Boss (Take-Charge Assistant S)",
        "Authors": "By Wisinski, Jerry",
        "Description": "The Boss and The Assistant. It's a basic business relationship, and the structure is easy: The Boss gives orders, and The Assistant obeys. But there’s an alternative that's better for both assistant and boss, and it's called \"partnership.\" In this eye-opening book, assistants learn how they can break out of old, narrow roles and enjoy working with a boss instead of for a boss. This change liberates creativity and self-confidence, and reveals hidden skills and interests. It also makes an assistant more valuable (and promotable) to the boss and the company. Readers learn specific techniques for how to: * initiate the transition to a partnering relationship * understand their boss's work style and adapt to it -- without losing their sense of self * become a proactive worker who takes responsibility for mistakes and credit for successes",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Amacom Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Adventures of Huckleberry Finn (Barnes & Noble Classics Series) (B&N Classics)",
        "Authors": "By Twain, Mark",
        "Description": "The Adventures of Huckleberry Finn, by Mark Twain, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics: New introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. \"Adventures of Huckleberry Finn is the only one of Mark Twain's various books which can be called a masterpiece. I do not suggest that it is his only book of permanent interest; but it is the only one in which his genius is completely realized, and the only one which creates its own category.\" T. S. EliotHuckleberry Finn, rebel against school and church, casual inheritor of gold treasure, rafter of the Mississippi, and savior of Jim the runaway slave, is the archetypical American maverick.Fleeing the respectable society that wants to \"sivilize\" him, Huck Finn shoves off with Jim on a rhapsodic raft journey down the Mississippi River. The two bind themselves to one another, becoming intimate friends and agreeing \"there warn't no home like a raft, after all. Other places do seem so cramped up and smothery, but a raft don't. You feel mighty free and easy and comfortable on a raft.\"As Huck learns about love, responsibility, and morality, the trip becomes a metaphoric voyage through his own soul, culminating in the glorious moment when he decides to \"go to hell\" rather than return Jim to slavery.Mark Twain defined classic as \"a book which people praise and don't read\"; Huckleberry Finn is a happy exception to his own rule. Twain's mastery of dialect, coupled with his famous wit, has made Adventures of Huckleberry Finn one of the most loved and distinctly American classics ever written. Nominated for a Grammy for his work as co-producer of the five-CD box set The Jazz Singers (1998), Robert O'Meally is Zora Neale Hurston Professor of Literature at Columbia University and Director of Columbia University's Center for Jazz Studies. He is the principal writer of Seeing Jazz (1997), the catalogue for the Smithsonian's exhibit on jazz and literature, and the co-editor of The Norton Anthology of African American Literature (1996).",
        "Category": " Fiction , Classics",
        "Publisher": "Barnes Noble Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Miss Martha Mary Crawford",
        "Authors": "By Catherine Cookson",
        "Description": "",
        "Category": "",
        "Publisher": "Dell Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Measure of Our Days: A Spiritual Exploration of Illness",
        "Authors": "By Groopman, Jerome",
        "Description": "With The Measure of Our Days, Dr. Jerome Groopman established himself as an eloquent new voice in the literature of medicine. In these eight moving portraits, he offers us a compelling look at what is to be learned when life itself can no longer be taken for granted. These stories are diverse--from Kirk, an aggressive venture capitalist determined to play the odds with controversial chemotherapy treatments; to Elizabeth, an imperious dowager humbled by a rare blood disease; to Elliott, who triumphs over leukemia and creates for himself a definition of success--but each, in the words of Maggie Scarf, \"transmute the misery of terrible suffering into a marvelous celebration of the sweetness of human life.\" Far from medical case studies, these are spiritual journeys of questioning and self-awareness, embarked on by the physician as well as the patient.",
        "Category": " Body, Mind & Spirit , Healing , Prayer & Spiritual",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The European and the Indian: Essays in the Ethnohistory of Colonial North America",
        "Authors": "By Axtell, James",
        "Description": "Studies the interaction between white settlers and native Americans during the colonial period",
        "Category": " Business & Economics , Finance , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "Spoiling Childhood: How Well-Meaning Parents Are Giving Children Too Much - But Not What They Need",
        "Authors": "By Ehrensaft, Diane",
        "Description": "Vividly encapsulating the absurdities, heartbreaks, and possibilities of contemporary child rearing, this book shows how parents today are all too often caught up in a guilt-driven pendulum swing between parenting too little and parenting too much. Dr. Ehrensaft helps us imagine a society where we can overcome the treacherous balancing acts of work and family demands; where \"good-enough\" replaces perfect parenting, harriedness is traded for harmony, and children grow on a healthy continuum from infancy to adulthood.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "The Gilded Web (The Web Trilogy)",
        "Authors": "By Balogh, Mary",
        "Description": "From one of America’s most beloved storytellers comes a classic love story—the breathtaking tale of a man and a woman caught in a web of temptation and seduction.All she wanted was to escape the hot, crowded London ballroom. But moments after stepping into the bitterly cold night, she is seized by a pair of strong hands and spirited away. Fully expecting to be ravished, sheltered Alexandra Purnell instead finds herself at the mercy of the man who saved her from certain scandal. Edmund, Earl of Amberley, is bold and sensual, tempting Alexandra to be reckless for the first time in her life. But as passion ignites, Edmund’s offer of marriage takes Alexandra completely by surprise. Now a woman who craves her freedom above all else is about to discover how far one man will go to protect and possess the woman he loves.…",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Mad, Bad Duke",
        "Authors": "By Ashley, Jennifer",
        "Description": "When a love spell lands her in the arms of Alexander, a scandalous rake known as the Mad, Bad Duke, Meagan Tavistock finds herself forced into marriage with this dangerous man, who introduces her to a world of intense pleasure. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Dorchester Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Selling the Lite of Heaven",
        "Authors": "By Shea, Suzanne Strempek",
        "Description": "There it was in The Pennysaver - nestled among the other classified ads bravely singing out their romantic wares - each cleverly written heading masking a story of broken dreams. But who would believe hers? Who in her small western Massachusetts town would believe that the dutiful only daughter of Stanislaus and Edna, having against all odds and her mother's expectations finally found true love, has not only been left at the altar but for it? That she's a woman who has been left for God?Fittingly, her holy alliance with Eddie Balicki had begun in church, just after he mysteriously abandoned the big city and moved back to his boyhood town. One glimpse was all it took.His hands were folded in a way you only see in First Communion photos or in portraits of the Pope - fingers meeting exactly and pointing toward heaven, thumbs crossed and locked....With his eyes closed, he looked like he should have been a statue up on the altar, reeling in the ecstasy of what he already knew about heaven.But now the worst has happened. In one ghastly moment on Good Friday, her brightly lit future, her technicolor dreams, have turned to black and white. She has died, and he has gone to heaven.It is one thing to call the caterer, cancel the hall and the band, return the gifts. But selling the ring is another matter. One by one the prospective customers come to view, appraise, and haggle, treading through and over the life of the woman whose earlier days had been ruled by a simple rhythm: up and off to watch other peoples' lives develop in the machine at Fast Foto, then home to eat cabbage with her very Polish, very old-world parents. There's a beefy man shopping for a ring while patiently waiting for his fiancee's mother to \"croak\" so they can inherit the family manse. Then there are the browsers, the women looking to fill an afternoon and to gloat over someone else's misfortune. And finally, there is Randy, who glows almost as brightly as the ring, and who, despite the demands of his own engagement, finds every opportunity to return to inspect the Lite of Heaven.In this funny, wise, and sure-handed first novel, Suzanne Strempek Shea takes us on a journey of self-discovery, finding romance and comedy in unlikely places. Her tone never wavers, and the voice of her heroine rings as true as a church bell. Best of all, Selling the Lite of Heaven evokes in loving and exquisite detail a Polish-Catholic neighborhood where love flares briefly, where the polka music is turned up, and where faith and family persist even in the face of change.",
        "Category": " Fiction , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Perfectionism: What's Bad About Being Too Good?",
        "Authors": "By Adderholdt-Elliott, Miriam",
        "Description": "Discusses the dangers of being a perfectionist, with tips for easing up on oneself, gaining control over life, and getting professional help",
        "Category": "",
        "Publisher": "Free Spirit+publishing Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Preserving Capital and Making It Grow",
        "Authors": "By Train, John",
        "Description": "A noted investment counselor presents a guide on how to become a successful investor, with advice on market cycles, stock market investments, and non-stock opportunities, such as real estate, collectibles, gold, and fine art",
        "Category": " Business & Economics , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "A View of the River",
        "Authors": "By Eagle, Kathleen",
        "Description": "When local shaman and single father Birch Trueblood is hired to communicate with the ghosts that inhabit a bed-and-breakfast run by Rochelle LeClair, who believes him to be a fraud, he discovers family rivalries, dark secrets, and the key to winning Rochelle's heart. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Do The Write Thing: Seven Steps to Publishing Success",
        "Authors": "By Foxx, Nina and Alexander, Kwame",
        "Description": "",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Manisy WIllows Books",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Managing Global Issues: Lessons Learned",
        "Authors": "By Simmons, P. J. (EDT), De Jonge Oudraat, Chantal (EDT), and Jonge Oudraat, Chantal De (EDT)",
        "Description": "Globalization is pushing to the fore a wide variety of global problems that demand urgent policy attention. Managing Global Issues provides a comprehensive comparative assessment of international efforts to manage global problems. It identifies and explains successes and failures of such efforts, examines the roles of different actors, and outlines lessons that may guide future action by governments, international organizations, nongovernmental organizations, and the private sector.  The volume's 16 case studies examine organized crime, drugs, corruption, human rights, labor rights, health, trade, financial markets, development assistance, the environment, the global commons, communications, weapons of mass destruction, conventional weapons, internal conflicts, and refugees.  Managing Global Issues is the result of an international multidisciplinary research team composed of experts in specific global issue areas. The book's broad scope, numerous case studies and its rigorous comparative analytical framework offers a unique and valuable contribution to the rapidly growing literature on global governance.  Contributors include Vinod K. Aggarwal (University of California, Berkeley), Thomas Bernauer (University of Zürich), William Drake (Carnegie Endowment), Octavio Gómez-Dantés (National Institute of Public Health, Mexico), Catherine Gwin (World Bank), Peter M. Haas (University of Massachusetts, Amherst), Christopher C. Joyner (Georgetown University), Brian Langille (University of Toronto), Robert E. Litan (Brookings Institution), Kathleen Newland (Carnegie Endowment), Peter Richardson (Transparency International), Peter H. Sand (Institute of International Law, Munich), Dinah L. Shelton (Notre Dame Law School), Timothy D. Sisk (University of Denver), Joanna Spear (King's College, London), and Phil Williams (University of Pittsburgh).",
        "Category": " Political Science , Public Policy , General",
        "Publisher": "Carnegie Endowment for Int'l Peace",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Goodnight, Irene (Irene Kelly Mysteries (Paperback))",
        "Authors": "By Burke, Jan",
        "Description": "For thirty-five years the identity of the dismembered woman found under the Las Piernas pier has remained a mystery. What secret did she take to her grave? Southern California reporter Irene Kelly has uncovered a maze of forensic records and confidential files that suggest a motive far more sinister than anyone imagined. The discovery has brought her close to Detective Frank Harriman, and closer still to exposing a killer who will resort to anything to keep his secrets buried -- and Irene silenced forever.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Once a Gentleman (Ladies' Fashionable Cabinet Trilogy, 3)",
        "Authors": "By Hern, Candice",
        "Description": "When two friends are found in a compromising situation, their marriage of convenience turns into something neither was looking for ... and something neither can live without.Nicholas Parrish wakes one morning to pounding at the front door of his London townhouse. Standing before him is the irate father of Prudence Armitage and several of her scowling brothers. They accuse him of compromising Prudence, and to his astonishment the woman in question walks out of his study, looking as if she's just been roused from her bed! Prudence had a tiring night putting the finishing touches to The Ladies' Fashionable Cabinet, the magazine she and Nicholas, along with his sister Edwina, have been working on.With Edwina on an extended wedding trip, Prudence had wanted everything to be perfect. But she fell asleep at her desk, and when she walks out of the office and sees her family ready to murder the man she had secretly had a crush on, Prudence is appalled. And when a marriage is forced between them, she is devastated. The damage is done, though, and now she's determined to make things right between herself and her new husband . . . by making him fall in love with her.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Naughty Neighbor",
        "Authors": "By Evanovich, Janet",
        "Description": "Dear Reader:In a previous life, before the time of Plum, I wrote twelve short romance novels. Red-hot screwball comedies, each and every one of them. Nine of these stories were originally published by the Loveswept line between the years 1988 and 1992. All immediately went out of print and could be found only at used bookstores and yard sales.I'm excited to tell you that those nine stories are now being re-released by HarperCollins. Naughty Neighbor is the eighth in the lineup, and it's presented here in almost original form. Usually when I edit these books I do some modernizing. For instance, I change VHS to DVD, and roller skates to Rollerblades, and sticks of gum are now pieces of gum. I do this because the books were meant to be contemporary (as opposed to historical), and I don't want the reader to have a time disconnect. In the beginning of the original Naughty Neighbor, my heroine throws a handheld phone into the toilet, and the next morning she goes into the bathroom and sees the \"slim silver antenna caught between the toilet lid and seat.\" Okay, so most phones don't have extended antennas anymore, but I just loved the image . . . so I left it in. And I don't know how many women wear front-closure bras anymore, but that got left in, too.Naughty Neighbor is probably the most romancey of all the Loveswepts I wrote, but there's still a small mystery to unravel. Louisa Brannigan is a no-nonsense, hardworking press secretary, fighting her way to the top of Capitol Hill, with no help from her annoying neighbor, Pete Streeter. He receives phone calls all night long, he steals her morning paper, he thinks jeans are formal wear, and worst of all he's involved Louisa in the disappearance of a pig. So this is the story of a pig in Witness Protection and love being found by a workaholic woman and a fun-loving man who makes terrible pots of coffee.Enjoy!Janet Evanovich",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Big Bug Book",
        "Authors": "By Taylor, Barbara, Farndon, John, and Green, Dr. Jen",
        "Description": "",
        "Category": "",
        "Publisher": "LORENZ BOOKS (AURU)",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Black Duck",
        "Authors": "By Lisle, Janet Taylor",
        "Description": "Years afterwards, Ruben Hart tells the story of how, in 1929 Newport, Rhode Island, his family and his best friend's family were caught up in the violent competition among groups trying to control the local rum-smuggling trade.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Philomel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Pillsbury: One-Dish Meals Cookbook: More Than 300 Recipes for Casseroles, Skillet Dishes and Slow-Cooker Meals",
        "Authors": "By Pillsbury Company (EDT)",
        "Description": "One-Dish Meals CookbookMore Than 300 Recipes for Casseroles, Skillet Dishes and Slow-Cooker MealsFrom America's most trusted kitchens comes a collection of delicious and easy recipes for one-dish meals that everyone--even the cook--can enjoy.Featuring:  Kids' Favorites, Easy Entertaining, Tried and True Family Favorites, Brunch SpecialtiesConvenient casseroles, quick and healthy stir-fries, comfort foods from the slow-cooker: One-dish meals are perfect for today's busy cook. Pillsbury, America's most trusted name in the kitchen, has collected more than 300 delicious recipes for casseroles, skillet dishes, and slow-cooker meals that everyone--including the cook--can enjoy.        From Celebration Brunch Strata to Ratatouille with Hot Pepper Tortellini to Old-Fashioned Beef Stew, Pillsbury: One-Dish Meals Cookbook presents updated family favorites alongside elegant dishes and exciting new flavors inspired by today's culinary trends.  In addition to its easy-to-follow recipes and more than 100 beautiful photographs, this latest edition to Pillsbury's library includes step-by-step features designed to guide readers through specific cooking techniques. For the practiced family cook or the culinary novice, this collection of sure-to-please soups, stews, casseroles, skillet meals and more is a must-have. With their irresistible and infinitely reliable recipes, the experts at Pillsbury prove that one dish is all today's time-savvy cook needs to make delicious meals.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "6.38",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Odd Hours: An Odd Thomas Novel",
        "Authors": "By Koontz, Dean R.",
        "Description": "#1 NEW YORK TIMES BESTSELLER   Only a handful of fictional characters are recognized by first name alone. Dean Koontz’s Odd Thomas is one such literary hero, who has come alive in readers’ imaginations as he explores the greatest mysteries of this world and the next with his inimitable wit, heart, and quiet gallantry. Now Koontz follows Odd as he is drawn onward, to a destiny he cannot imagine. Haunted by dreams of an all-encompassing red tide, Odd is pulled inexorably to the sea, to a small California coastal town where nothing is as it seems.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Frommers National Park Guide (Frommer's Single Title Travel Guides)",
        "Authors": "By Frome, Michael",
        "Description": "An in-depth guide to America's diverse national parks provides vivid descriptions of each site, as well as its history, landmarks, wildlife, and park activities and includes, for the first time, up-to-date information on Canadian national parks. Original.",
        "Category": " Travel , Parks & Campgrounds",
        "Publisher": "Frommer",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "One Last Scream",
        "Authors": "By O'Brien, Kevin",
        "Description": "New York Times BestsellerWhen You're Caught In A Killer's Web.  .  .  Twelve women have vanished, leaving behind no trace or clue--their whereabouts still a mystery after eleven years.  .  .    The Only Thing That Can Save You Is.  .  .  Amelia Faraday is beautiful, smart, and a walking disaster. Suffering from blackouts, she also suffers from something worse--the feeling that she is personally involved in a series of deaths.     One Last Scream.  .  .   Now as a new series of murders begins, and she continues to suffer from blackouts, Amelia is left wondering if she is a cold-blooded killer--or a pawn in a deadly game that's only just beginning.  .  .    Praise for the Novels of Kevin O'Brien      \"A fast-paced thriller.  .  .O'Brien's crisp, clear writing, and taut suspense elevate this above similar fare.\"  --Publishers Weekly    \"Another page-turner.\"--Seattle Post-Intelligencer",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Pinnacle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Mental Health Nursing PN Edition Review Module",
        "Authors": "By Campbell, Lucindra and Finkelman, Anita W.",
        "Description": "",
        "Category": "",
        "Publisher": "Assessment Technologies Instit",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Ring on Her Finger",
        "Authors": "By Bevarly, Elizabeth",
        "Description": "Heiress Lucinda Hollander decides to get engaged -- to a man who thrusts a rock on her finger and promptly disappears -- leaving Lucinda to take the rap for a crime she didn't commit. Lucinda goes on the lam, and even though she's never held -- or used -- a dust mop she goes \"underground\" as a housekeeper on a large estate. After all, she knows her way around big houses, and making floors sparkle is a whole lot better than making license plates. She quickly figures there's something suspicious going on in the servants' quarters -- especially with Max Hogan, \"the car guy.\" He's strong, sexy -- and sure knows how to work with his hands. But he's more than a little silent about his past, which makes Lucinda wonder what he's up to ... and what will happen when her secret comes out. Still, she hopes they can have a future together ... If only she could get that darn ring off her finger.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Blind Into Baghdad: America's War in Iraq",
        "Authors": "By Fallows, James",
        "Description": "In the autumn of 2002, Atlantic Monthly national correspondent James Fallows wrote an article predicting many of the problems America would face if it invaded Iraq. After events confirmed many of his predictions, Fallows went on to write some of the most acclaimed, award-winning journalism on the planning and execution of the war, much of which has been assigned as required reading within the U.S. military.In Blind Into Baghdad, Fallows takes us from the planning of the war through the struggles of reconstruction. With unparalleled access and incisive analysis, he shows us how many of the difficulties were anticipated by experts whom the administration ignored. Fallows examines how the war in Iraq undercut the larger ”war on terror” and why Iraq still had no army two years after the invasion. In a sobering conclusion, he interviews soldiers, spies, and diplomats to imagine how a war in Iran might play out. This is an important and essential book to understand where and how the war went wrong, and what it means for America.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Illustrated Manual of Nursing Practice",
        "Authors": "By Springhouse Publishing",
        "Description": "",
        "Category": " Medical , Nursing , Fundamentals & Skills",
        "Publisher": "Springhouse Pub Co",
        "Price Starting With ($)": "10.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Arthur Trilogy #3: King of the Middle March",
        "Authors": "By Crossley-Holland, Kevin",
        "Description": "Kevin Crossley-Holland's award-winning Arthur trilogy comes to its triumphant and moving close.Arthur de Caldicot waits eagerly in Venice for the start of the Fourth Crusade. But it's now when Arthur's future should be clearest that he feels the most doubt. Jealousies and greed rive the Crusade, leading him to question its true mission. Back in England, his engagement to Winnie remains uncertain, while his search for his birth mother has been stymied by his vicious father. And his seeing stone shows him the last days of King Arthur's court--a great dream destroyed, but also a glorious legend rising from the ruins.  Likewise in this book, Arthur becomes a man worthy of his kingly name.",
        "Category": " Young Adult Fiction , Historical , Europe",
        "Publisher": "Arthur A. Levine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Mediterranean By Cruise Ship: The Complete Guide to Mediterranean Cruising, Third Edition",
        "Authors": "By Vipond, Anne",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Ocean Cruise Guides",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Sisters & Lovers: A Novel",
        "Authors": "By Briscoe, Connie",
        "Description": "Beverly, Charmaine, and Evelyn -- three sisters living in the same Maryland town outside Washington, D.C., each wishing her life were just a little different. Beverly is twenty-nine and single. She's a successful magazine editor who would love to be in love. The problem is, no man can meet her high standards. Charmaine longs to finish her degree, but meanwhile, she has to juggle a thankless job, a beautiful child, and an irresponsible husband she doesn't quite have the nerve to leave. Evelyn seems to have it made. She has a successful psychology practice and her husband is a partner in a prestigious law firm. But there's trouble in paradise, and Evelyn refuses to face the facts.Warm and bittersweet, believable and real, SISTERS & LOVERS is a novel of family and love, heartache and hope, and above all, the triumph of sisterhood.\"\"Riveting . . . Lively . . . Hilarious . . . Three sisters who are remarkably different except in one respect: their men are driving them crazy.\" -- Mademoiselle",
        "Category": " Fiction , Psychological",
        "Publisher": "One World",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    }
]