[
    {
        "Title": "The Global Class War : How America's Bipartisan Elite Lost Our Future - and What It Will Take to Win it Back",
        "Authors": "By Faux, Geoffrey P.",
        "Description": "Acclaim for The Global Class War\"\"You will never think about 'free trade' the same way after reading Jeff Faux's superb book. As Faux makes clear, the globalization debate is really about whose interests are served by global elites, and how we need to go about reclaiming a democracy that serves ordinary people. This book should transform public discourse in America.\"\"-Robert Kuttner, founding coeditor of the American Prospect and a contributing columnist to BusinessWeek\"\"Jeff Faux's astonishing story of how class works will scandalize the best names in Wall Street and Washington-especially the much admired Robert Rubin, who along with other elites colluded behind the backs of ordinary citizens in Mexico, Canada, and the United States. The most cynical Americans will be shocked by the sordid details. This really is an important book.\"\"-William Greider, author of The Soul of Capitalism and Secrets of the Temple\"\"Globalization is a cover for American imperialism, but the beneficiaries are not the American people at the expense of foreigners but corporate executives at the expense of working-class and poor people wherever they may be. Jeff Faux offers a comprehensive and devastating analysis.\"\"-Chalmers Johnson, author of The Sorrows of Empire",
        "Category": " Political Science , Globalization",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "How To Make Money In Stocks: A Winning System in Good Times or Bad, 3rd Edition",
        "Authors": "By O'Neil,William",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Sugar Bust for Life!...With the Brennans, Part II : Cookbook and Companion Guide",
        "Authors": "By Brennan, Ellen C. and Brennan, Theodore M.",
        "Description": "",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "Shamrock Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Bowman Test",
        "Authors": "By Albert J. Elias",
        "Description": "",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Shades of Grace",
        "Authors": "By Delinsky, Barbara",
        "Description": "Grace Dorian is a national treasure. She is The Confidante, a seasoned advice columnist whose practicality and good sense have guided two generations of American women in her syndicated daily column. Grace's daughter, Francine, and granddaughter, Sophie, manage the vast Dorian empire, overseeing Grace's speaking engagements, interviews, and demanding publicity schedules. But suddenly Grace does not seem right. Her razor-sharp mind is occasionally forgetful; her columns wander. Grace finds herself vehemently denying - but is clearly suffering from - the early symptoms of Alzheimer's disease.In a frantic struggle to regain control within the family and the business, Francine must step forth and fill her legendary mother's shoes. She must cope with Grace's mortal fear and inability to continue as The Confidante, as well as her own new role of writing her mother's column, answering her fan mail, and preserving the secret of her mother's health until Grace comes to terms with it herself. But Francine must also struggle to live her own life. Long divorced and existing in her mother's shadow, Francine battles her new role in the face of affections from Grace's doctor, a rugged and kind man whose interest leaves Francine torn between devotion to her mother and commitment to rebuilding her own life. And Francine must think of her daughter, Sophie, who at twenty-three needs Francine's guidance as much as, and perhaps more than, The Confidante's public does. Sophie watches the role reversal in her family and attempts to understand the drastic changes in a grandmother whom she has always loved but found overbearing.",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Witches' Hammer",
        "Authors": "By Hitchcock, Jane Stanton",
        "Description": "Jane Stanton Hitchcock's second novel is a chilling and unpredictable story in which the powers of darkness and pathology lurk just beneath the surface of modern life.Her first novel, Trick of the Eye, was nominated for both the Edgar Award and the Hammett Prize for \"best first mystery novel.\" Now Hitchcock practices her narrative skills even more convincingly in this sinister thriller about a vulnerable young woman drawn deep into a web of evil who must unravel the coils of her own sexual identity and womanhood.Beatrice O'Connell's orderly life is shattered when her father, a gentle man preoccupied with rare-book collecting, is viciously murdered. Discovered missing from his library is a seemingly harmless fifteenth-century grimoire - a manual of black magic or, as some would believe, the \"work of the Devil.\" What is the secret of this apparently unprepossessing volume that powerful people are prepared to risk so much to possess? Does it contain a demonic spell? Or is the map for a hidden treasure buried within its timeworn pages? And so what begins with the casual acceptance of a book of black magic with obscene illustrations ends with the discovery of a vast contemporary witch-hunt.With the help of a chain-smoking occultist, a libidinous social worker in Spanish Harlem, and a remorseful ex-husband, Beatrice struggles to piece together the puzzle...in Oklahoma, where the book first surfaced; in upstate New York, home of an enormously wealthy foundation with strong ties to the Church; in London, where the daughter of a Nazi official sheds light on one corner of the dark Nazi past; in Italy, where a demented former Vatican official forces Beatrice to pay an uncompromisingly high price for a vital piece of the puzzle. And finally in Switzerland, where she must confront evil incarnate in the most direct way imaginable.Exposing evil that is at once centuries old and efficiently modern, and probing the dark paths of sexuality and madness, Jane Stanton Hitchcock has written a rich, complex, relentlessly suspenseful thriller.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "McNally's Bluff (Sanders, Lawrence)",
        "Authors": "By Sanders, Lawrence and Lardo, Vincent",
        "Description": "Secrets, surprises, and at least one dead body come out of the closet in the Palm Beach P.I.'s most twisted case yet.  When self-styled impresario and former human cannonball Matthew Hayes rents a luxury villa on Palm Beach's famed South Ocean Boulevard, the locals roll their eyes. But when he scuttles the traditional backyard accoutrements of swimming pool and tennis court in favor of a grand garden hedge maze modeled after the one at Hampton Court, the South Florida smart set can't wait for their invitations -to the gala opening of the Amazin' Maze of Matthew Hayes.  The big night arrives and gasps of wonder and delight are replaced by those of horror, as Hayes's ladylove, Marlena Marvel, in the role of Venus, is discovered at the center of the maze, very dead indeed. Is the gruff but grieving widower somehow involved in his wife's demise? Or are there other forces-and more devious minds-at work? Hayes's carnival background and flair for the dramatic only complicate a mystery that has more false leads than his amazin' maze. It's up to Archy McNally to see through the scam and catch a killer.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Straight from the Heart: A Novel (Loveswept)",
        "Authors": "By Hoag, Tami",
        "Description": "From #1 New York Times bestselling author Tami Hoag comes this powerful novel of passion, heartbreak, and redemption—a story that celebrates our capacity to love one time, for all time, even in the face of adversity and change.They say that each of us becomes an entirely new person every seven years. But Rebecca Bradshaw doesn’t feel any different when an old lover shows up severely injured at the hospital where she runs the physical therapy department. Seven years ago baseball player Jace Cooper left her without a second thought or the chance to share the life-changing secret she swore she’d keep from him forever. Now he was back, wanting both her help and a second chance. Becca hadn’t changed, and she didn’t believe Jace had either, but as she helped him repair his broken body and his fractured past, she would find she was wrong on both counts. The only thing that had stayed the same was the most important thing of all—and now suddenly time was running out.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Kodak Guide to 35Mm Photography (Kodak publication)",
        "Authors": "By Eastman Kodak Company",
        "Description": "",
        "Category": " Photography , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Jane Eyre (Signet Classics)",
        "Authors": "By Bronte, Charlotte",
        "Description": "Featuring a new introduction written by Erica Jong, the classic 1847 novel traces the doomed love affair between an orphaned, independent-minded governess and her brooding employer, Mr. Rochester. Reprint.",
        "Category": " Fiction , Classics",
        "Publisher": "Signet Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Essentials of Sociology: A Down-to-Earth Approach, 7th Edition (MySocLab Series)",
        "Authors": "By Henslin, James M.",
        "Description": "",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Robert's Rules of Order (Newly Revised, 10th Edition)",
        "Authors": "By Robert, Henry M., Evans, William J., Robert, Sarah Corbin, Honemann, Daniel H., and Balch, Thomas J.",
        "Description": "Originally published as a slim document in 1896, General Henry M. Robert's classic guide to smooth, orderly, and fairly conducted meetings has sold close to five million copies in nine editions. The only book containing the completely developed Robert's Rules of Order subject matter, this latest edition will continue the book's reputation as the gold standard of meeting procedure for parliamentarians and novice club presidents and members alike. Thoroughly revised and updated to reflect the past decade's technological advances and usage, this tenth edition contains new information on how to conduct meetings over the Internet, on phone and video conference calls, and with members in absentia. The best book from which to learn all about running and taking an effective part in meetings, General Robert's gift of order is as indispensable now as it was a century ago.",
        "Category": " Reference , General",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Reader's Digest Pathfinders Sharks and Other Sea Creatures",
        "Authors": "By Leighton Taylor",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest Children's Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Dark Zone (Stephen Coonts' Deep Black, Book 3)",
        "Authors": "By Coonts, Stephen and DeFelice, Jim",
        "Description": "In a secluded headquarters on the other side of the globe a terrorist mission is underway-a plan to set-off an underwater explosion so great, and with such hellish force, that it could shift the very foundation of the earth's surface causing untold calamity and world-wide disaster. The terrorists call it God's Revenge.A nuclear warhead has gone missing. Small in size, it packs up to ten times the kilotons that exploded over Hiroshima. It's now in the wrong hands, ready to detonate a world war of unfathomable proportions.In the top secret headquarters of the National Security Agency, a small cadre of special agents form Deep Black, designed to bring a techno edge to covert operations and eliminate the cyber threats to world peace.  This is Charlie Dean's world-an NSA ex-marine sniper now enlisted to stop the unthinkable. But when his suspicions of a traitor in his shadow become frighteningly true, Dean's race against time could mean the end of the free world.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Unraveled Sleeve (Needlecraft Mysteries, No. 4)",
        "Authors": "By Ferris, Monica",
        "Description": "The art of needlecraft requires patience, discipline, and creativity. So, too, does the art of detection. Just ask Betsy Devonshire—who’s learning that life in a small-town needlecraft shop can reveal an unexpected knack for knitting…and a hidden talent for unraveling crime.Unraveled SleeveBetsy Devonshire has settled into her new home in Excelsior, Minnesota, as owner of the town’s needlecraft shop. So why is she suffering from terrifying nightmares? She hasn’t a clue—but she thinks maybe it would help to get away for a while. With her friend Jill in tow, she heads north for a “stitch-in” at a remote, rustic lodge. But her nightmares only get worse—especially after she finds a dead woman no one else had seen. Then the body disappears—and she knows she won’t get any rest until she untangles the mysterious threads of the crime….",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Criminal Seduction",
        "Authors": "By North, Darian",
        "Description": "As author Owen Byrne covers the trial of the beautiful wife of renowned artist Bram Serian, accused of her husband's murder, his growing obsession with the widow leads him into a nightmare of passion, mystery, seduction, and murder that threatens his life. Reprint.",
        "Category": " Fiction , General",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Beautiful in God's Eyes",
        "Authors": "By George, Elizabeth",
        "Description": "",
        "Category": " Religion , Biblical Commentary , Old Testament",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "101 Ways To Promote Yourself: Tricks Of The Trade For Taking Charge Of Your Own Success",
        "Authors": "By Pinskey, Raleigh",
        "Description": "You may have the most outstanding business, product, idea or talent in the world, but in order to be successful, you have to let the world know about it. Raleigh Pinskey offers you a crash course on how to get the attention you need. 101 Ways to Promote Yourself reveals the insider secrets learned from years of experience and how these low-cost, high-powered techniques can carry you to the top of your market and beyond.Find out how to:   Develop hot new leads   Project a positive image   Get your name in front of potential customers   Promote instant name recognition   Hold on to valued customers   Build on your success by cultivating referrals   Position yourself for greater visibility in your market   Grow and expand your network and database   Explore media opportunities   Market effectively on the Internet   Create goodwill in your community",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Dark Need: A Novel of the Darkyn",
        "Authors": "By Viehl, Lynn",
        "Description": "AN ACHING EMPTINESS...Homicide detective Samantha Brown is a tough, highly decorated cop. But for the past twelve lonely years, since she nearly died of a gunshot wound, she has felt a deep inner longing.A LONG-LOST LOVE...The mysterious Lucan, with his timeless ability to seduce women, is focusing on the emotionally battered Samantha, who has awakened his wild memories of a long-ago love.A PASSION THAT WILL BE FULFILLED.As Samantha pursues a deranged killer, her only clue is a medieval cross inscribed “Lucan”—the name of a man who owns a nightclub near the murder scene. Drawn into a seamy underworld, Samantha falls for Lucan, who believes that he’s a vampire and that Samantha is his reincarnated first love. Now she must save this man who seems beyond redemption—and who fulfills her deepest, darkest desires....",
        "Category": " Fiction , Romance , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Shosha",
        "Authors": "By Singer, Isaac Bashevis",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Crest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Born Bad: Collected Stories",
        "Authors": "By Vachss, Andrew H.",
        "Description": "From a writer whose novels have been acclaimed for their unflinching exploration of evil comes a brilliant collection of short stories—some never before published—that distill dread back down to its essence—and inject it straight into the reader's back brain. Andrew Vachss might have scissored his characters from today's headlines: a stalker prowling around an anonymous high-rise; a serial killer whose transgressions reflect a childhood of hideous abuse; an inner-city gunman who is willing to take out a blockful of victims in order to win a moment of acceptance.Tautly written and endowed with murderous ironic spin, Born Bad plunges us into the hell that lies just outside our bedroom windows.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Vintage Crime/Black Lizard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "The Outcasts of Poker Flat and Other Tales",
        "Authors": "By Harte, Bret",
        "Description": "",
        "Category": "",
        "Publisher": "Signet Classic/New American Lib",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "The Art of Closing Any Deal:  How to Be a \"Master Closer\" in Everything You Do",
        "Authors": "By Pickens, James W.",
        "Description": "In the tradition of Zig Ziglar, Tom Hopkins, and Joe Girard, this is the one-million copy \"sale closer's bible\" that fully explains the exact, proven techniques salespeople need to close any deal written by a master closer.",
        "Category": " Business & Economics , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Christian Prayer Through the Centuries (English and German Edition)",
        "Authors": "By Jungman, Josef A.",
        "Description": "",
        "Category": " Religion , Christian Life , Prayer",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "Shakespeare Alive!: America's Foremost Theater Producer Brings Shakespeare's England to Life",
        "Authors": "By Papp, Joseph",
        "Description": "From Joseph Papp, American’s foremost theater producer, and writer Elizabeth Kirkland: a captivating tour through the world of William Shakespeare.  Discover the London of Shakespeare's time, a fascinating place to be—full of mayhem and magic, exploration and exploitation, courtiers and foreigners. Stroll through narrow, winding streets crowded with merchants and minstrels, hoist a pint in a rowdy alehouse, and hurry across the river to the open-air Globe Theater to see that latest play written by a young man named Will Shakespeare.  Shakespeare Alive! spirits you back  to the very years of that London—as everyday people might have experienced it. Find out how young people fell in love, how workers and artists made ends meet, what people found funny and what they feared most. Go on location with an Elizabethan theater company to learn how plays were produced, where Shakespeare’s plots came from and how he transformed them. Hear the music of Shakespeare’s language and words we still use today that were first  spoken in his time. Open the book and elbow your way into the Globe with the groundlings. You’ll be joining one of the most democratic audiences the theater has ever known—alewives, apprentices,  shoemakers and nobles—in applauding the dazzling wordplay and swordplay brought to you by William Shakespeare.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Robert Schuller, My Father & My Friend",
        "Authors": "By Coleman, Sheila Schuller",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Publishing Corporation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Flamingo's Smile: Reflections in Natural History",
        "Authors": "By Gould, Stephen Jay",
        "Description": "\"Gould himself is a rare and wonderful animal—a member of the endangered species known as the ruby-throated polymath. . . . [He] is a leading theorist on large-scale patterns in evolution . . . [and] one of the sharpest and most humane thinkers in the sciences.\" --David Quammen, New York Times Book Review",
        "Category": " Nature , Essays",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Stupidest Angel: A Heartwarming Tale of Christmas Terror",
        "Authors": "By Moore, Christopher",
        "Description": "Christmas crept into Pine Cove like a creeping Christmas thing: dragging garland, ribbon, and sleigh bells, oozing eggnog, reeking of pine, and threatening festive doom like a cold sore under the mistletoe.'Twas the night (okay, more like the week) before Christmas, and all through the tiny community of Pine Cove, California, people are busy buying, wrapping, packing, and generally getting into the holiday spirit. It is the hap-hap-happiest time of the year, after all.But not everybody is feeling the joy. Little Joshua Barker is in desperate need of a holiday miracle. No, he's not on his deathbed; no, his dog hasn't run away from home. But Josh is sure that he saw Santa take a shovel to the head, and now the seven-year-old has only one prayer: Please, Santa, come back from the dead.But hold on! There's an angel waiting in the wings. (Wings, get it?) It's none other than the Archangel Raziel come to Earth seeking a small child with a wish that needs granting. Unfortunately, our angel's not sporting the brightest halo in the bunch, and before you can say \"Kris Kringle,\" he's botched his sacred mission and sent the residents of Pine Cove headlong into Christmas chaos, culminating in the most hilarious and horrifying holiday party the town has ever seen.Only Christopher Moore, the man who brought you the outrageous lost gospel Lamb and the hysterical fish tale Fluke could have devised a new holiday classic that tugs at the heartstrings and serves up a healthy slice of fruitcake to boot.Move over, Charles Dickens -- it's Christopher Moore time.",
        "Category": " Fiction , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Boom! Voices of the Sixties: Personal Reflections on the '60s and Today",
        "Authors": "By Tom Brokaw",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Play Better Golf (Golf Clinic)",
        "Authors": "By Beverly Lewis",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Missing Piece",
        "Authors": "By Silverstein, Shel",
        "Description": "From Shel Silverstein, the celebrated author of The Giving Tree and Where the Sidewalk Ends, comes The Missing Piece, a charming fable that gently probes the nature of quest and fulfillment.It was missing a piece. And it was not happy. What it finds on its search for the missing piece is simply and touchingly told. This inventive and heartwarming book can be read on many levels, and Silverstein’s iconic drawings and humor are sure to delight fans of all ages.So it set off in searchof its missing piece.And as it rolledit sang this song— Oh I'm lookin' for my missin' pieceI'm lookin' for my missin' pieceHi-dee-ho, here I go,Lookin' for my missin' piece.And don't miss Runny Babbit Returns, the new book from Shel Silverstein!",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "264.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Other Voice: Twentieth-Century Women's Poetry in Translation (English and Multilingual Edition)",
        "Authors": "By Bankier, Joanna (EDT)",
        "Description": "Remarkable poems by women from every continent and region of the world are translated for the American reader",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1976"
        }
    },
    {
        "Title": "The Presidency and the Management of National Security",
        "Authors": "By Lord, Carnes",
        "Description": "Examines the National Security Council, its history, staff, policymaking processes, and abuses by eight presidential administrations",
        "Category": " Political Science , General",
        "Publisher": "Free Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "You On a Diet: The Owner's Manual for Waist Management",
        "Authors": "By Roizen, Michael F., Oz, Mehmet C.",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster Audio",
        "Price Starting With ($)": "14.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "An Inconvenient Book: Real Solutions to the World's Biggest Problems",
        "Authors": "By Beck, Glenn and Beck, Glenn (NRT)",
        "Description": "Now available in trade paperback, the #1 bestselling New York Times author Glenn Beck tackles some of our country’s biggest problems in this funny, outrageous, and entertaining book.Glenn Beck believes that the reason why some of our biggest problems never seem to get fixed is simple: the solutions just aren’t very convenient. And as the host of a nationally syndicated radio show and a prime-time television show on CNN Headline News, Glenn Beck doesn’t care much about convenience; he cares about common sense. Take the issue of poverty, for example. Over the last forty years, America’s poorest cities all had one simple thing in common, but politicians will never reveal what that is (or explain how easy it would be to change). Global warming is another issue that’s rife with lies and distortion. How many times have we heard that carbon dioxide is responsible for huge natural disasters that have killed millions of people? The truth is, it’s actually the other way around: as CO2 has increased, deaths from extreme weather have decreased. But that would never be shown in an Al Gore slide show. Combining honesty with a biting sense of humor, An Inconvenient Book contains hundreds of these \"why have I never heard that before?\" types of facts that will leave readers wondering how political correctness, special interests, and outright stupidity have gotten us so far away from the common sense solutions this country was built on.",
        "Category": " Political Science , Essays",
        "Publisher": "Simon & Schuster Audio",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "41 Ways to Lick the IRS With a Postage Stamp",
        "Authors": "By Pilla, Daniel",
        "Description": "",
        "Category": " Law , General",
        "Publisher": "Winning Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "American History (Minipedias)",
        "Authors": "By phd. rana k. williams",
        "Description": "Covers the most significant moments in the history of America, from prehistory to the 21st century.",
        "Category": " History , United States , General",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Human Resource Management (with InfoTrac) (Available Titles CengageNOW)",
        "Authors": "By Mathis, Robert L. and Jackson, John H.",
        "Description": "Human Resource Management by Mathis and Jackson is viewed as a highly authoritative, current, and reliable textbook.  In this new edition, the authors have taken great care to ensure that the elements that make this book successful are still the foundation in the new edition.  However, they realize that HR is a dynamic field and that transformation is occurring HR.  In the 11th edition, the authors discuss factors that are driving change in HR Management and how HR is being shaped by many factors such as Technology and Globalization.  The authors of this book have excellent professional reputations and are well-connected with the Society for Human Resource Management.  Now in its 11th edition, Bob Mathis and John Jackson have written an extremely successful human resource management book that is suitable for learners who will eventually work as HR generalists and managers, business students who are not HR majors, and current HR professionals, especially those who are preparing for their professional certification.  This text is widely used in preparation for professional examinations (PHR, SPHR) given by the highly regarded Human Resource Certification Institute, a part of SHRM.  Human Resource Management is a highly regarded book written by authors who are well known and extremely knowledgeable in their field.",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Best-Ever Holiday Recipe Collection",
        "Authors": "By",
        "Description": "",
        "Category": " Cooking , Holiday",
        "Publisher": "Kraft",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The Beer Lover's Rating Guide",
        "Authors": "By Klein, Robert",
        "Description": "",
        "Category": " Cooking , Beverages , Alcoholic , Beer",
        "Publisher": "Workman Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "A Yankee Christmas: Feasts, Treats, Crafts and Traditions of Wintertime New England : Featuring Nantucket Noel",
        "Authors": "By Brady, Sally Ryder",
        "Description": "Tells how to make gifts, wreaths, centerpieces, and Christmas decorations and ornaments, suggests holiday menus, and offers advice on gift wrapping",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "11.69",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Glorious Christmas Crafts: A Treasury of Wonderful Creations for the Holiday Sea",
        "Authors": "By Anna Hobbs",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House Madison Press Book",
        "Price Starting With ($)": "7.77",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Treasury of Christmas recipes from your favorite brand name companies",
        "Authors": "By Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Appliquilt for Christmas",
        "Authors": "By White, Tonee",
        "Description": "",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "That Patchwork PLace Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Dog Owner's Home Veterinary Handbook",
        "Authors": "By Carlson, Delbert G., Giffin, James M.",
        "Description": "Centers on such topics as intestinal parasites, infectious diseases, skin, eyes, ears, nose, oral cavity, sex and reproduction, pregnancy and whelping, antibiotics, each body system, and medical emergencies",
        "Category": "",
        "Publisher": "Howell Books",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "July",
            "Year": "1980"
        }
    },
    {
        "Title": "Christmas Gifts of Good Taste Book: Festive Recipes and Easy Crafts, Book 6",
        "Authors": "By Gunter, Julie (EDT), Van Wagner Childs, Anne (EDT), and Leisure Arts, Inc. (EDT)",
        "Description": "Thoroughly revised and updated, this latest edition of the delectable holiday handbook gathers an assortment of kitchen-tested recipes for food gifts and step-by-step instructions for making decorations and other crafts for the Christmas season.",
        "Category": " Cooking , Seasonal",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Christmas Bazaar (Rodales's Treasury of Christmas Crafts)",
        "Authors": "By Balitas, Margaret Lydic, Bolesta, Karen, and Reames, Nancy (CON)",
        "Description": "Complete step-by-step, easy-to-follow instructions mark a collection of more than one hundred novel Christmas craft projects for beginners and experts alike, including fancy Christmas stockings, ornaments, garlands, and gifts.",
        "Category": " Art , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Pillsbury Family Christmas Cookbook: Celebrate the Season with More Than 150 Recipes, Plus Fun Craft Ideas",
        "Authors": "By Pillsbury Company (COM)",
        "Description": "All too often, preparing for Christmas festivities can take you away from family and friends. Luckily, the Pillsbury Editors have collected 155 delicious, kitchen-tested and totally reliable recipes, plus activities and kid-pleasing crafts so you can spend more time creating special holiday memories together. There are dishes to suit any kind of holiday get-together, whether you’re expecting three guests or thirty, from a post-shopping party to a Christmas Day feast. Entrées such as Slow-Cooked Beef Burgundy, Party Chicken Cacciatore, Pineapple-Orange Glazed Ham and Italian Roasted Salmon are as simple to make as they are impressive on the holiday table. Seasonal salads, vegetable sides and sweet treats like Cranberry-Walnut White Fudge will help you achieve a multicourse meal everyone will love. Snacks and appetizers, along with an array of breads, will satisfy even the pickiest eaters. You’ll also find strategies for alleviating holiday stress while making memories. Whether it’s inviting a friend over to help with holiday baking or letting others lend a hand at parties, every tip will help you focus on spending quality time with family and friends. And to keep the little ones cabin-fever-free over winter breaks, activities such as making Fido’s Favorite Treats and Santa Grahams are fun and easy boredom busters. Recipes for thoughtful gifts, including Hot Buttered Rum Sauce and Orange-Spice Coffee Mix, add a personal touch to the holiday that can’t be achieved with a harried trip to a store.From ideas for homemade gifts to recipes for the main entrée at the holiday meal, Pillsbury Family Christmas Cookbook is a one-stop guide to yuletide planning.",
        "Category": " Cooking , Holiday",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The Creative Art of Party Decorations",
        "Authors": "By Suzie Major",
        "Description": "",
        "Category": "",
        "Publisher": "Longmeadow Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Family Celebrations for Christmas",
        "Authors": "By Hibbard, Ann",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Ravens Ridge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Here to Stay (Tesoro Books)",
        "Authors": "By Hersey, John",
        "Description": "Relates true stories of modern man's courage and determination in the face of great odds, from an old woman's escape from death by drowning during a flood to the struggles of the Hiroshima survivors",
        "Category": " History , General",
        "Publisher": "Paragon House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "McClane's New Standard Fishing Encyclopedia and International Angling Guide",
        "Authors": "By McClane, Albert Jules (EDT)",
        "Description": "Compiles a wealth of information concerning fresh and saltwater fish",
        "Category": "",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "13.5",
        "Publish Date": {
            "Month": "October",
            "Year": "1974"
        }
    },
    {
        "Title": "Copernicus' Secret: How the Scientific Revolution Began",
        "Authors": "By Repcheck, Jack",
        "Description": "Nicolaus Copernicus gave the world perhaps the most important scientific insight of the modern age, the theory that the earth and the other planets revolve around the sun. He was also the first to proclaim that the earth rotates on its axis once every twenty-four hours. His theory was truly radical: during his lifetime nearly everyone believed that a perfectly still earth rested in the middle of the cosmos, where all the heavenly bodies revolved around it. One of the transcendent geniuses of the early Renaissance, Copernicus was also a flawed and conflicted person. A cleric who lived during the tumultuous years of the early Reformation, he may have been sympathetic to the teachings of the Lutherans. Although he had taken a vow of celibacy, he kept at least one mistress. Supremely confident intellectually, he hesitated to disseminate his work among other scholars. It fact, he kept his astronomical work a secret, revealing it to only a few intimates, and the manuscript containing his revolutionary theory, which he refined for at least twenty years, remained \"hidden among my things.\" It is unlikely that Copernicus' masterwork would ever have been published if not for a young mathematics professor named Georg Joachim Rheticus. He had heard of Copernicus' ideas, and with his imagination on fire he journeyed hundreds of miles to a land where, as a Lutheran, he was forbidden to travel. Rheticus' meeting with Copernicus in a small cathedral town in northern Poland proved to be one of the most important encounters in history.Copernicus' Secret recreates the life and world of the scientific genius whose work revolutionized astronomy and altered our understanding of our place in the world. It tells the surprising, little-known story behind the dawn of the scientific age.",
        "Category": " Science , History",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Feingold: A New Democratic Party",
        "Authors": "By Horwitt, Sanford D.",
        "Description": "Russ Feingold is a rarity in American politics. A staunch civil libertarian, he was the only member of the U.S. Senate who voted against the ill-conceived USA Patriot Act that was rushed through Congress in the wake of the September 11 terrorist attacks. In 2002, while the Bush administration's fabrications and scare tactics persuaded an overwhelming majority of the Senate to vote for the Iraq war resolution, Feingold opposed it. Washington insiders thought such controversial votes could doom Feingold's 2004 reelection. But he won by a near landslide, far outdistancing his party's presidential candidate, John Kerry.   Sanford D. Horwitt writes in this timely, compelling independent biography that Russ Feingold \"represents the progressive side of the Democratic divide more clearly and authentically than any successful politician on the national stage.\" The third-term senator's willingness to take bold stands -- he was the first in the Senate to call for a timetable for redeploying U.S. troops from Iraq -- has inspired a growing number of rank-and-file Democrats across the country.   Drawing on scores of interviews and historical documents, Horwitt shows that Feingold's authenticity is deeply rooted in the old progressive tradition personified by one of his heroes, Robert M. La Follette, the legendary Wisconsin governor and U.S. senator. \"Fighting Bob\" and the other great reformers of the Progressive Era placed a high value on honest, efficient government, investment in public education, health and infrastructure, and curbs on corporate power and other wealthy interests in the political process.   Feingold became known to a national audience when he teamed up with Republican John McCain on campaign finance reform legislation. After a seven-year battle, the McCain-Feingold bill became the first major reform of the campaign laws since the Watergate era.   Feingold, who grew up in a small southeastern Wisconsin town, is a man of modest means and the grandson of Jewish immigrants. In this lively portrait, Horwitt evokes mid-century Janesville, a Republican stronghold on the banks of the Rock River, where a precocious Rusty Feingold absorbed lifelong lessons about the importance of community and personal integrity.   Beginning with his first election to public office, he has defied conventional political wisdom and long odds, Horwitt tells us, a pattern that has been repeated throughout his career. Feingold has shown how a new, reinvigorated Democratic Party can stand for progressive ideals, resist the corrupting influence of special interests and win elections.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Countess Veronica",
        "Authors": "By Robinson, Nancy K.",
        "Description": "Excited when her mother begins dating Count Carleton, Veronica fantasizes about becoming a young countess should her mother and the Count marry, but she finds trouble when she brags about her chess skills. Reprint.",
        "Category": "",
        "Publisher": "Apple",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Flying Birthday Cake? (Marvin Redpost 6, paper)",
        "Authors": "By Wummer, Amy (ILT) and Sachar, Louis",
        "Description": "This chapter book in Newbery Honor–winning and bestselling author Louis Sachar’s Marvin Redpost series offers a sidesplitting take on being the new kid at school.    When Marvin and Stuart sleep over at Nick Tuffle’s house for Nick’s birthday, they set up sleeping bags in the back yard. Stuart and Nick go right to sleep, but Marvin tosses and turns. Then he hears a noise and something glowing zooms over his head. Is it really a flying birthday cake? Or could it be something even more bizarre? The next day, a very strange new kid shows up at school….    Hilarious and relatable, Marvin Redpost is perfect for kids who love to bond with quirky characters like Junie B. Jones and George Brown, Class Clown.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Prince of the Pond: Otherwise Known as De Fawg Pin",
        "Authors": "By Napoli, Donna Jo and Schachner, Judith Byron (ILT)",
        "Description": "From the author of The Magic Circle, Zel, and Stones in Water.Who is that handsome green stranger? None of the pond dwellers has ever seen the peculiar new frog before. They found him sitting in a pile of human clothes outside the hag’s house. What a strange frog he is! He gets his feet tangled when he tries to jump, he refuses to eat bugs, and he can’t tell a toad from a frog. He calls himself “De Fawg Pin,” and he’s about to turn pond life topsy-turvy!   “The frog prince motif has inspired many books, but few as original as this novel.”—Booklist   “An animal fantasy that fairy tale readers will relish.”—Bulletin of the Center for Children’s Books, starred review",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Adaptations",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Just Plain Cat (An Apple Paperback)",
        "Authors": "By Robinson, Nancy K.",
        "Description": "While caring for his new pet, a cat, third grader Chris learns a lot about friendship, understanding, and caring. Reissue.",
        "Category": " Juvenile Fiction , Animals , Cats",
        "Publisher": "Apple",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "The Phantom Pen Pal (Black Cat Club)",
        "Authors": "By Saunders, Susan and Manning, Jane (ILT)",
        "Description": "Exchanging letters with a mysterious new pen pal who shares all of his interests, Andrew exhibits strange behaviors and ostracizes his friends, prompting the Black Cat Club to find out the truth about the pen pal. Original.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "24.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Hannah In Between",
        "Authors": "By Rodowsky, Colby F.",
        "Description": "The growing suspicion that her mother might be an alcoholic, despite her family's denials, threatens twelve-year-old Hannah's safe and predictable world when she decides to face the truth about her mother's condition",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Lily and the Creep (Young Women of Faith: Lily Series, Book 3)",
        "Authors": "By Rue, Nancy N.",
        "Description": "Lily and Shad are into it again. But this time, Lily and her friends are fed up with his teasing and decide to give Shad a taste of his own medicine. When Lily and her friends play the ultimate prank on Shad, guess who's left to take the fall? Lily. Lily and Shad get assigned a project that they must complete TOGETHER after school. Will this finally bring an end to the infamous feud between Lily and Shad? Or is it the beginning of something much worse? See what happens when Lily makes an unpleasant discovery and has to decide what's important---becoming someone she can like or someone God can like.",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Zonderkidz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Here's Lily! (Young Women of Faith: Lily Series, Book 1)",
        "Authors": "By Rue, Nancy N.",
        "Description": "Welcome to the wonderful world of Lily Robbins! In this fun, first story in a series that has sold over one million copies, you'll meet the awkward sixth-grader named Lily. After receiving a compliment about her looks from a high-powered woman in the fashion industry, Lily obsesses over becoming a model, setting her sights on winning the 'model search' fashion show. She packs away her rock and feather collection in exchange for pictures of teen models and fashion magazines. But when the unthinkable happens the night before the fashion show, Lily learns a valuable lesson about real beauty.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Zonderkidz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Golden Ring: A Christmas Story",
        "Authors": "By Snyder, John",
        "Description": "In 1918, in the snowy coal country of Pennsylvania, there lived an idealistic young girl named Anna Beal. Anna loved her mother and her five siblings dearly. But it was her father, Joseph, a hardworking engineer on the B & O Railroad, who was her hero. On her ninth birthday, Anna's parents gave her a beautiful golden ring. She cherished it more than anything she had ever owned.Yet as Christmas Day drew closer and closer, it became apparent - both in mysterious dreams shared by Anna and Joseph, and through astonishing events during their waking hours - that the ring was very special. It would prove to be the harbinger of significant and poignant truths.",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Black Rain: A Novel",
        "Authors": "By Ibuse, Masuji and Bester, John",
        "Description": "Black Rain is centered around the story of a young woman who was caught in the radioactive \"black rain\" that fell after the bombing of Hiroshima. lbuse bases his tale on real-life diaries and interviews with victims of the holocaust; the result is a book that is free from sentimentality yet manages to reveal the magnitude of the human suffering caused by the atom bomb. The life of Yasuko, on whom the black rain fell, is changed forever by periodic bouts of radiation sickness and the suspicion that her future children, too, may be affected.lbuse tempers the horror of his subject with the gentle humor for which he is famous. His sensitivity to the complex web of emotions in a traditional community torn asunder by this historical event has made Black Rain one of the most acclaimed treatments of the Hiroshima story.",
        "Category": " Fiction , Historical",
        "Publisher": "Kodansha USA",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Forward From Here: Leaving Middle Age--and Other Unexpected Adventures",
        "Authors": "By Lindbergh, Reeve",
        "Description": "In her funny and wistful new book, Reeve Lindbergh contemplates entering a new stage in life, turning sixty, the period her mother, Anne Morrow Lindbergh, once described as \"the youth of old age.\" It is a time of life, she writes, that produces some unexpected surprises. Age brings loss, but also love; disaster, but also delight. The second-graders Reeve taught many years ago are now middle-aged; her own children grow, marry, have children themselves. \"Time flies,\" she observes, \"but if I am willing to fly with it, then I can be airborne, too.\" A milestone birthday is also an opportunity to take stock of oneself, although such self-reflection may lead to nothing more than the realization, as Reeve puts it, \"that I just seem to continue being me, the same person I was at twelve and at fifty.\" At sixty, as she observes, \"all I really can do with the rest of my life is to...feel all of it, every bit of it, as much as I can for as long as I can.\"Age is only one of many subjects that Reeve writes about with perception and insight. In northern Vermont, nature is an integral part of daily life, especially on a farm. Whether it is the arrival and departure of certain birds in spring and fall, wandering turtles, or the springtime ritual of lambing, the natural world is a constant revelation.With a wry sense of humor, Reeve contemplates the infirmities of the aging body, as well as the many new drugs that treat these maladies. Briefly considering the risks of drug dependency, she writes that \"the least we [the \"Sixties Generation\"] can do for ourselves is live up to our mythology, and take lots of drugs.\" Legal drugs, that is -- although what sustains us as we grow older is not drugs but an appreciation for life, augmented by compassion, a sense of humor, and common sense.And of course there is family -- especially with the Lindberghs. Reeve writes about discovering, thirty years after her father's death and two and a half years after her mother's, that her father had three secret families in Europe. She travels to meet them, learning to expand her self-understanding: \"daughter of,\" \"mother of,\" \"sister of\" -- sister of many more siblings than she'd known, in a family more complicated than even she had imagined.Forward from Here is a brave book, a reflective book, a funny book -- a book that will charm and fascinate anyone on the journey from middle age to the uncertain future that lies ahead.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Come...and Behold Him",
        "Authors": "By Hayford, Jack W.",
        "Description": "Break the grip of shallow commercialism on the holiday season by preparing your heart to worship Emmanuel as never before. You can rediscover-with childlike wonder!-the miracle of Jesus' birth through warm meditations, joyous new carols, and enduring Scriptures as beloved pastor Dr. Jack Hayford leads you into a deeper experience of Christ's presence and power.",
        "Category": " Religion , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Temple of Jerusalem",
        "Authors": "By Comay, Joan",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart, and Winston",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The One Year Devotions for Men on the Go",
        "Authors": "By Arterburn, Stephen and Farrel, Bill",
        "Description": "Designed to encourage readers to spend time reading and meditating on the truth of God's Word, these brief devotions, based solidly in Scripture, are ideal for reading over morning coffee, waiting in the car for children after school, or anytime people “on the go” want to make the most of just a few minutes. These devotions will encourage men and women to meditate on God's Word daily, even in the midst of a busy, active schedule.",
        "Category": " Religion , Inspirational",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Whitewash: What the Media Won't Tell You About Hillary Clinton, but Conservatives Will",
        "Authors": "By Graham, Tim and Bozell, L. Brent, III",
        "Description": "“The overriding question is: Why Hillary? Here we come to 2008 and she is the de facto nominee. . . . But what has she done?”—Rush Limbaugh, in an exclusive interview for Whitewash Amid all the discussion of Hillary Rodham Clinton’s presidential prospects, the most important question is ignored: Why Hillary? How did the First Lady to a disgraced, impeached president become a presidential front-runner despite never having held elective office before 2001; her staggering number of personal, political, and financial scandals; and her leftist political agenda?The answer is that for two decades she has had the most powerful weapon in politics—the national “news” media—shamelessly promoting her presidential aspirations.In Whitewash, L. Brent Bozell III and Tim Graham of the Media Research Center, America’s preeminent media watchdog organization, expose the unprecedented media favoritism that is the real key to Hillary’s political career. Marshalling stunning evidence compiled exclusively by the Media Research Center, the authors show how the media have relentlessly promoted Hillary from the moment Time magazine introduced her to the country as an “amalgam of Betty Crocker, Mother Teresa, and Oliver Wendell Holmes.” To expose the truth about Hillary that the supposedly objective media have buried, Bozell and Graham have interviewed dozens of leading conservatives who are fighting to let Americans hear the whole story: Rush Limbaugh, Newt Gingrich, Sean Hannity, Ann Coulter, Mark Levin, Mary Matalin, Laura Ingraham, Cal Thomas, and many others.Whitewash reveals:• How the frequent claim that no one has been more investigated than Hillary Clinton is not just incorrect, but utterly absurd• How prominent female reporters admit that they’re “rooting” for Mrs. Clinton, their “mascot”• The surprising ways Hillary’s media allies have tried to fend off Barack Obama’s challenge • How the national media continue to promote Mrs. Clinton’s socialist health care takeover as “ahead of its time”• The network news anchor to whom Hillary gushed, “Thank you. Thank you. Thank you.” • The Republican congressman who tells how the Clintons “went after” him “mercilessly” for daring to investigate Hillary scandals• How the press ruthlessly attacks anyone in the alternative media who dares challenge HillaryMrs. Clinton’s media flacks deride every negative charge against her as “old news,” but Whitewash shows that Hillary’s pattern of deception, corruption, and overreaching political schemes has been repeated again and again precisely because the media ignore the scandalous behavior. And the pattern will be repeated in 2008 and beyond if Americans aren’t exposed at last to the truth that the servile national media have obscured.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Crown Forum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Trust Me on This",
        "Authors": "By Westlake, Donald E.",
        "Description": "Newswoman Sara Joslyn goes to work for a notorious supermarket tabloid in Florida and finds herself dealing with assorted big stories and a corpse in a Buick",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "39.56",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Take Command: 10 Leadership Principles I Learned in the Military and Put to Work for Donald Trump",
        "Authors": "By Perdew, Kelly",
        "Description": "The winner of \"The Apprentice 2\" and former US Army Intelligence Officer and Airborne Ranger identifies the principles he learned in the military that led to his success in business and on the hit NBC show. He also interviews business luminaries who talk about their military experiences.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Stone Monkey (Lincoln Rhyme Novels)",
        "Authors": "By Deaver, Jeffery",
        "Description": "The page-turning New York Times bestseller from Jeffery Deaver’s “simply outstanding” (San Jose Mercury News) Lincoln Rhyme series! The FBI has recruited forensics expert Lincoln Rhyme and his protégée, Amelia Sachs, to capture “the Ghost,” a homicidal immigrant smuggler. But when they corner him aboard a cargo ship, the bust goes disastrously wrong and the Ghost escapes. Now the killer must eliminate two families who witnessed his flight before they jumped ship and vanished. . . . Searching New York City’s Chinatown, can Rhyme and Sachs find the Ghost’s targets before he does?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Seventh Heaven",
        "Authors": "By Hoffman, Alice",
        "Description": "During the steamy summer of 1959, a sleepy Long Island suburban community is transformed by the arrival of Nora Silk, an attractive young divorcee, and her two young sons",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Turtle Moon",
        "Authors": "By Hoffman, Alice",
        "Description": "When Lucy Rosen and her son Keith move to Verity, Florida, Keith runs away with the baby of a murdered woman, and Lucy and Officer Julian Cash chase after him. By the author of Illumination Night. Reprint.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Soldier Boys",
        "Authors": "By Hughes, Dean and McGillivray, Kim",
        "Description": "Spencer Morgan And Dieter Hedrick Are On Opposite Sides Of The War And Fighting For The Same Thing.  At the age of fifteen, Dieter's blind devotion gets him promoted from Hitler Youth into the German army. Dieter's determined to prove his allegiance and bravery all costs.  Spence, just sixteen, drops out of his Utah high school to begin training as a paratrooper. He's seen how boys who weren't much in high school can come home heroes, and Spence wants to prove to his friends and family that he really can be something.  Their worst fear was that the war would end too soon -- that they wouldn't get the chance to prove themselves. But when they finally see the action they were hoping for, it's like nothing they could have ever imagined.",
        "Category": " Young Adult Fiction , Historical , Military & Wars",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Strike Zion!",
        "Authors": "By Stevenson, William",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Kill and Tell: A Novel",
        "Authors": "By Howard, Linda",
        "Description": "Romantic suspense superstar Linda Howard’s seductive New York Times bestseller “meshes hot sex, emotional impact, and gripping tension” (Publishers Weekly) into a sizzling, heart-pounding thriller!Still reeling from her mother’s recent death, Karen Whitlaw is stunned when she receives a package containing a mysterious notebook from her estranged father, whom she has barely seen since his return from the Vietnam War decades ago. Then, a shocking phone call: Karen’s father has been murdered on the gritty streets of New Orleans. For homicide detective Marc Chastain, something about the case of a murdered homeless man just doesn’t add up—especially after he meets the victim’s daughter. Far from the cold woman he expected, Karen Whitlaw is warm and passionate. She is also in serious danger. A string of “accidents” have shaken Karen to the core and forced her into the protective embrace of the charming detective she vowed to resist. Together they unravel a disturbing story of politics, power, and murder—and face a killer who will stop at nothing to get his hands on her father’s secrets.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Isaac Bashevis Singer, the magician of West 86th Street: A biography",
        "Authors": "By Kresh, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "Dial Press",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Demon's Kiss (Wings in the Night, Book 1)",
        "Authors": "By Shayne, Maggie",
        "Description": "Even by vampire standards, Reaper is a loner, and his current mission to destroy a gang of rogue bloodsuckers is definitely a one-vamp job. Then fate takes a hand, and before he knows it, he's surrounded by a ragtag crew of misfit helpers: the newbie, the princess, the shape-shifter and the human healer. Seth is new to immortality, but he's sharp and strong&#151;and he'll risk anything for the rogues' strange female captive, a secretive creature he doesn't understand but feels compelled to save.Vixen is confused by the emotions that swirl through her at the sight of her impulsive hero. She only hopes the brutal Gregor and his bloodthirsty renegades will leave her alive long enough to explore them.Or will Reaper himself be the one to destroy them all?",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Ice Blue (The Ice Series, 3)",
        "Authors": "By Stuart, Anne",
        "Description": "Museum curator Summer Hawthorne considered theexquisite ice-blue ceramic bowl given to her by herbeloved Japanese nanny a treasure of sentimentalvalue&#151;until somebody tried to kill her for it.The priceless relic is about to ignite a global powerstruggle that must be stopped at all costs. It's adesperate situation, and international operativeTakashi O'Brien has received his directive: everybodyis expendable. Everybody. Especially the woman whois getting dangerously under his skin as the lethalgame crosses the Pacific to the remote and beautifulmountains of Japan, where the truth can be asseductive as it is deadly&#133;.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Grave Sight (Harper Connelly Mysteries, Book 1)",
        "Authors": "By Harris, Charlaine",
        "Description": "The first Harper Connelly mystery from #1 New York Times bestselling author Charlaine Harris! Harper Connelly has what you might call a strange job: she finds dead people. She can sense the final location of a person who’s passed, and share their very last moment. Harper and her stepbrother Tolliver are experts at getting in, getting paid, and then getting out of town fast—because the people who hire Harper have a funny habit of not really wanting to know what she has to tell them.At first, the little Ozarks town of Sarne seems like no exception.  A teenage girl has gone missing, but the secrets of her death—and the secrets of the town—are deep enough that even Harper’s special ability can’t uncover them.  With hostility welling up all around them, she and Tolliver would like nothing better than to be on their way.  But then another woman is murdered.  And the killer’s not finished yet...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "No Holding Back",
        "Authors": "By Etherington, Wendy",
        "Description": "SHE HAS ONLY ONE WEAKNESS… Isabel Turner knows how perilous the professional racing world can be—on and off the track. As a PR executive representing NASCAR's top drivers, she spent years proving her worth. Now, as she's about to take over her uncle's high-powered position at the firm, Isabel stands to lose her reputation, job and her uncle's respect—just to have racer Cade Garrison in her bed once more.There's no denying the combustible yet forbidden attraction between the two. Cade is more than tempted, but the last thing the bad boy of the Garrison family racing team needs is another scandal jeopardizing his career. Are they foolish enough to risk it all?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "In Deep Voodoo",
        "Authors": "By Bond, Stephanie",
        "Description": "Start With Bad Mojo . . . There's something strange afoot in the small town of Mojo, Louisiana. Yet even as the annual voodoo festival gets underway, Penny Francisco, who runs a health food business, refuses to believe in black magic. Her mind is on celebrating her divorce from her lying, cheating husband Deke. Add a Pinprick of Revenge . . . Fueled by run-ins with her ex-mother-in-law and Deke's busty mistress, Penny is eager for the \"emancipation party\" her friends plan. When she receives a Deke voodoo doll as a gag gift, she sticks it with a pin as a joke. But when Deke winds up fatally stabbed, the police aren't laughing. And Watch Things Boil Over . . . A junk-food junkie P.I. offers his services, and although Penny is wary of the sexy Cajun's motives (and his diet), she's desperate. Dodging a media sideshow and a looming murder rap, Penny realizes that somehow she's landed herself In Deep Voodoo.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Jacob (The Nightwalkers, Book 1)",
        "Authors": "By Frank, Jacquelyn",
        "Description": "Jacob, an enforcer who makes certain that his people uphold the ancient law of a Nightwalker, which is to never fall in love with a human, breaks this code of honor when he succumbs to forbidden temptation with a mortal beauty after he saves her life. Original.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Zebra",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Second Chance: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "As editor-in-chief of New York’s leading fashion magazine, Fiona Monaghan was utterly content with her life, jetting back and forth between her stylish Manhattan and Europe—until the sweltering June day John Anderson strolled into her office. A widower with two daughters, John was as conservative as Fiona was freewheeling, both amused and appalled by her world of high-strung designers, anorexic models, Fendi-stuffed closets, and Sir Winston, her snoring bulldog. But after Fiona impulsively invited John to the Paris couture shows, somewhere between the magic of the runway and the stroll along the Seine, she let him into her heart. And within weeks of their return to New York, John was making friends with Sir Winston—and Fiona was making room in her closets.   It didn’t take long for the dominoes to start falling. First, John introduced Fiona to his hostile daughters and their bloodthirsty Pekingese and snarling housekeeper. Then, after a disastrous dinner party with John’s biggest client, Fiona and John’s relationship began to unravel with alarming speed. What happens next will set Fiona on a journey filled with pain, revelation, and awakening. When she risks everything and returns to Paris alone, an extraordinary series of events begins to unfold. And as the snow falls on the city of light, the curtain will rise on a second act Fiona never saw coming.   In a dazzling tale of modern misadventures and career-crossed relationships, Danielle Steel captures the heady magic of instant attraction, the challenges of change—and the hope that comes when we dare to do it all over again.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Wonder Worker",
        "Authors": "By Howatch, Susan",
        "Description": "Nicholas Darrow, a clergyman who heads a ministry of healing in a small London church, finds his peaceful, sedate life turned upside down by a needy young woman who sets his equilibrium hurtling out of control. By the author of Absolute Truths. 40,000 first printing.",
        "Category": " Fiction , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Long Spoon Lane (Charlotte & Thomas Pitt Novels)",
        "Authors": "By Perry, Anne",
        "Description": "Anne Perry’s bestselling Victorian novels offer readers an elixir as addictively rich as Devonshire cream or English ale–enticing millions into a literary world almost as real as the original. While flower sellers, costermongers, shopkeepers, and hansom drivers ply their trades, the London police watch over all. Or so people believe. . . .Early one morning, Thomas Pitt, dauntless mainstay of the Special Branch, is summoned to Long Spoon Lane, where anarchists are plotting an attack. Bombs explode, destroying the homes of many poor people. After a chase, two of the culprits are captured and the leader is shot . . . but by whom?As Pitt delves into the case, he finds that there is more to the terrorism than the destructive gestures of misguided idealists. The police are running a lucrative protection racket, and clues suggest that Inspector Wetron of Bow Street is the mastermind. As the shadowy leader of the Inner Circle, Wetron is using his influence with the press to whip up fears of more attacks–and to rush a bill through Parliament that would severely curtail civil liberties. This would make him the most powerful man in the country.To defeat Wetron, Pitt finds that he must run in harness with his old enemy, Sir Charles Voisey, and the unlikely allies are joined by Pitt’s clever wife, Charlotte, and her great aunt, Lady Vespasia Cumming-Gould. Can they prevail? As they strive to prevent future destruction, nothing less than the fate of the British Empire hangs in precarious balance.From the first sentence to the last, Long Spoon Lane is a miracle of suspense, of plot and counterplot, bluff and counterbluff, in a take-no-prisoners battle between good and evil. It is possibly the very best of all the wonderful Charlotte and Thomas Pitt novels.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Golden Bowl",
        "Authors": "By James, Henry",
        "Description": "",
        "Category": "",
        "Publisher": "Adamant Media Corporation",
        "Price Starting With ($)": "6.05",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Shakespeare's Scribe (Shakespeare Stealer)",
        "Authors": "By Blackwood, Gary L.",
        "Description": "When an outbreak of the deadly Black Plague closes the Globe Theatre, William Shakespeare's acting troupe sets off on a tour of England.  Widge, the orphan-turned-actor, knows that he'll be useful on the trip.  Not only does he love the stage, but his knack for a unique shorthand has proven him one of the most valuable apprentices in the troupe.  But then a mysterious man appears, claiming to know a secret from Widge's past-a secret that may forever force him from the theatre he loves.\"An exciting, well-written tale that is sure to leave [readers] clamoring for more.\" (School Library Journal, starred review)",
        "Category": " Young Adult Fiction , Historical , Europe",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Advanced Bass Fishing (The Hunting & Fishing Library)",
        "Authors": "By Sternberg, Dick",
        "Description": "If you've ever wondered how the pros catch the big bass, now's the time to find out. This book is loaded with detailed information and photos that demonstrate the techniques used by tournament pros. The latest innovations in the sport are presented, including information on tackle and presentation. Don't just learn how to catch bass, learn how to catch HUGE bass!",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Random House Canada",
        "Price Starting With ($)": "19.25",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "The Sweetheart Season: A Novel (Ballantine Reader's Circle)",
        "Authors": "By Fowler, Karen Joy",
        "Description": "In 1947, the bucolic mill town of Magrit, Minnesota, confronts the terrible problem that none of its young men want to return home, leaving the town's girls romantically bereft, until the old mill owner forms a ball team and puts them on the road. Reader's Guide included. Reissue. 15,000 first printing",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Anatomy & Physiology: The Unity of Form and Function 4th Edition",
        "Authors": "By Saladin, Kenneth S.",
        "Description": "From the completely new, exceptional art program, to the complete integration of the text with technology, Saladin has formed a teaching solution that will both motivate and enable your students to understand and appreciate the wonders of anatomy and physiology.   This distinctive text was developed to stand apart from all other A&P texts with unparalleled art, a writing style that has been acclaimed by both users and reviewers and clinical coverage that offers the perfect balance without being too much. Saladin’s well-accepted organization of topics is based upon the most logical physiological ties between body systems. The text requires no prior knowledge of college chemistry or cell biology, and is designed for a two-semester A&P college course.",
        "Category": " Medical , Physiology",
        "Publisher": "McGraw-Hill Science/Engineering/Math",
        "Price Starting With ($)": "11.3",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Stews (Williams-Sonoma Kitchen Library)",
        "Authors": "By Williams, Chuck (EDT), Rosenberg, Allan (PHT), and Brody, Lora",
        "Description": "A collection of recipes includes stews featuring poultry, meat, seafood, and vegetables",
        "Category": " Cooking , Courses & Dishes , Soups & Stews",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Cocktail Food: 50 Finger Foods with Attitude",
        "Authors": "By Barber, Mary Corpening, Narlock, Lori Lyn, Krasner, Carin (PHT), and Whiteford, Sara Corping",
        "Description": "The clink of glasses, the popping of corks, the spirited chatter of good friends-what more does an impromptu get-together need? Why, fabulous snacks, of course! With Cocktail Food, you can kiss those boring raw veggies goodbye because the best-selling authors of Smoothies and Wraps are whipping up bite-size delights like Shrimply Delish, Wonton Wonders, and Chive Talkin' Scallops. Voil! A humdrum happy hour turns into a glamorous soire. Cocktail Food takes the jitters out of entertaining with simple yet stylish recipes, plus great party-planning tips and fun theme ideasfrom Highball Sprees to Frozen F'tes. Let the good times roll!",
        "Category": " Cooking , Courses & Dishes , Appetizers",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Single Malt & Scotch Whiskey: Select and Savor Over 200 Brands and Varieties (Essential Connoisseur)",
        "Authors": "By Lerner, Daniel",
        "Description": "This informative guide features detailed ratings of over 200 brands and varieties of single malts and Scotch whiskies, plus in-depth discussions of aging, comparative strength, aromas, flavors, and distilleries. Illustrated with full-color photographs.",
        "Category": " Cooking , Beverages , Wine & Spirits",
        "Publisher": "Black Dog & Leventhal Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Starting from Scratch: A Different Kind of Writers' Manual",
        "Authors": "By Brown, Rita Mae",
        "Description": "From the best-selling author of  Rubyfruit Jungle and  Bingo, here is a writers' manual as provocative,  frank, and funny as her fiction. Unlike most  writers' guides, this one had as much to do with how  writers live as with mastering the tools of their  trade. Rita Mae Brown begins with a very personal  account of her own career, from her days as a young  poet who had written a novel no publisher wanted  to take a chance on, right up to her recent  adventures as a Hollywood screenwriter. In a sassy style  that makes her outspoken advice as entertaining as  it is useful, she provides straight talk about  paying the rent while maintaining the energy to  write; and dealing with agents, publishers, critics,  and the publicity circus; about pursuingj  ournalisim, academia, or screen-writing; and about rejecting  the Hemingway myth of the hard-living,  hard-drinking genius. In addition Brown, a former teacher or  writing, offers a serious examination of the  writer's tool--language, plotting, characters,  symbolism--plus exercises to sharpen the ear for dialogue,  and a fascinating, annoted reading list of  important works from the seventh century to the late  twentieth.",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Secrets: On the Ethics of Concealment and Revelation",
        "Authors": "By Bok, Sissela",
        "Description": "Provides a critical analysis of the ethical issues of individual secrecy in terms of family, friends, and career, discusses collective practices of concealment, and interprets the ethics and motivations of revelation",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "The Office Humor Book: Sidesplitting Signs, Moronic Memos, Perverted Paperwork, and Hilarious Office Hang-Ups (Punchline Book)",
        "Authors": "By Fagan, Pete (EDT), Schaffer, Mark (EDT), and Pallo, Drew (EDT)",
        "Description": "Offers cartoons about office work, parodies of memos, organizational charts, and work flow charts, and humorous observations on the way businesses are run",
        "Category": " Humor , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.33",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Bodies of Water",
        "Authors": "By Borthwick, J. S. and Borhtwick, J. S.",
        "Description": "Sarah Dean, self-described \"accident crime-prone English teacher,\" and her boyfriend, Dr. Alex McKenzie, are longing for a vacation. No classes, students or conferences for her-no patients, beepers or night calls for Alex.The two-week cruise aboard the Pilgrim, a luxury yacht owned by millionaire evangelist David Mallory, seems the perfect gateway...until one of the passengers turns up murdered...and those left on board are now both suspects and potential victims.Could the killer be the eccentric Mallory? His stern secretary Gracie (also sister of the victim)? The voluptuous chef, Andrea Elder? Ezra, the deckhand? Or even Sarah's younger brother Tony, the other member of the crew? Sarah and Alex must find out quickly, or they could become the next victims...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "The Book of Yoga",
        "Authors": "By Christina Brown",
        "Description": "",
        "Category": "",
        "Publisher": "Paragon Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    }
]