[
    {
        "Title": "Knights of the Black and White (The Templar Trilogy, Book 1)",
        "Authors": "By Whyte, Jack",
        "Description": "Shortly after his initiation into the Order of the Knights Templar, Sir Hugh St. Clair is drawn into the turbulence and violence of the First Crusade, until, broken by the savagery and slaughter, he is united with fellow members of the Order on a quest to uncover the true roots of the secret society that has guided their family for generations, in the first volume in a new historical trilogy.",
        "Category": " Fiction , Historical",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Strange Bedpersons",
        "Authors": "By Crusie, Jennifer",
        "Description": "When she agrees to accompany her ex-boyfriend Nick Jamieson, a conservative Republican lawyer who is desperate to make partner, on a weekend business trip as his fiancée, Tess Newhart, an outspoken woman of the world, discovers that opposites really do attact. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Baby, I'm Yours",
        "Authors": "By Andersen, Susan",
        "Description": "A Ride On the Wild SideThe last place Catherine MacPherson ever expected to find herself was sitting on a Greyhound bus, handcuffed to a surly bounty hunter, with only a suitcase of her twin sister's flashy, shrink-wrap clothing to wear! Just two hours ago, the respectable schoolteacher was sitting quietly at home when this bi macho hunk crashed through her door, mistook her for her errant Miami showgirl sister, and hauled her off in his strong arms. And no matter how sexy he is, she's furious!Twins-ha! Sam McKade's the last person to ever fall for that line. He's finally got the gorgeous, leggy redhead just where he wants her-and no matter what outrageous tricks she pulls, he's not letting her get away.The problem is, she's a lot smarter-and sweeter-than he'd expected. And he's got this deep-buried tenderness she hadn't expected. And their kisses are so hot, they just might burn up ... before they sort it all out.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Hot Item (Hot Zone, Book 3)",
        "Authors": "By Phillips, Carly",
        "Description": "What star quarterback has been spotted with a new flavor of arm candy? It's notorious bad boy Riley Nash, but his newest flame is the last person this reporter could imagine &#151; none other than Sophie Jordan, beautiful, buttoned-down co-owner of The Hot Zone, the industry's top sports management agency.What's behind this unlikely team? Some say it has to do with the sudden disappearance of superagent Spencer Atkins. Could there be a connection between the red-hot quarterback and the missing dealmaker? Or has the famous groupie magnet simply met his perfect match in cool, collected Sophie? Watch this space, because the resulting news is bound to be one Hot Item.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "The Cheating Culture: Why More Americans Are Doing Wrong to Get Ahead",
        "Authors": "By Callahan, David",
        "Description": "You're standing at an ATM. It can't access account information but allows unlimited withdrawals. Do you take more than your balance? David Callahan thinks most of us would. While there have always been those who cut corners, he shows that cheating on every level-from the highly publicized corporate scandals to Little League fraud-has risen dramatically in the last two decades. Why all the cheating? Why now?  Callahan pins the blame on the dog-eat-dog economic climate of the past two decades. An unfettered market and unprecedented economic inequality have corroded our values, he argues-and ultimately threaten the level playing field so central to American democracy itself. Through revealing interviews and extensive data, he takes us on a gripping tour of cheating in America and offers a powerful argument for why it matters. Lucidly written, scrupulously argued, The Cheating Culture is an important, original examination of the hidden costs of the boom years.",
        "Category": " Political Science , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Too Much Tuscan Sun: Confessions Of A Chianti Tour Guide",
        "Authors": "By Castagno, Dario",
        "Description": "",
        "Category": "",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Forgotten Soldiers",
        "Authors": "By Moynahan, Brian",
        "Description": "Presents military history that shows how the courage, intelligence or simple good fortune of the individual can exert a decisive influence on the outcome of a battle or campaign. This work tells the stories of fifteen unsung heroes, none of a rank higher than major, whose deeds changed the course of battles and - arguably - the course of history.",
        "Category": " History , Military , General",
        "Publisher": "Quercus",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Heart of a Warrior (Ly-San-Ter Family)",
        "Authors": "By Lindsey, Johanna",
        "Description": "Stunning statuesque Brittany Callaghan isn't used to seeing Nordic gods in her tiny California town. But when the spectacular blond Viking—whose name is Dalden—turns up at her doorstep, Brittany knows her dream man is very real. Dalden claims to be a barbarian warrior—since Brittany's passion has been running red–hot since she first saw him, the sexy giant can fancy himself anything he pleases!The truth is a very rude awakening—for Dalden is exactly what he claims to be: a warrior to the depths of his soul from a place where the women always obey. Intelligent, independent Brittany isn't about to be subservient to any male—not even one who's everything she ever wanted in a lover. But the proud, powerful barbarian is accustomed to fighting for what he wants—and winning. And what her wants most of all . . . is Brittany.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Annie's Song",
        "Authors": "By Anderson, Catherine",
        "Description": "Only her gift of love can heal . . . Annie Trimble lives in a solitary world that no one enters or understands. As delicate and beautiful as the tender blossoms of the Oregon spring, she is shunned by a town that doesn&#39;t understand her.But cruelty cannot destroy the love Annie holds in her heart.When Alex Montgomery learns of the injustice sweet Annie has suffered, he vows to do whatever it takes to set it right—even if it means marrying her. He never dreams he will fall for her childlike innocence, her womanly charms, and the wondrous way she views her world as Alex becomes captive to Annie&#39;s sweet song of love.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "129.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2013"
        }
    },
    {
        "Title": "Everything Collectibles (Everything Series)",
        "Authors": "By Nigro, Nicholas J.",
        "Description": "A helpful guide to buying and selling collectibles focuses on Americana, autographs, dolls, figurines, sports collectibles, stamps, and coins, among many other items. Original.",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Everything",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Last of the Mohicans (Barnes & Noble Classics)",
        "Authors": "By Cooper, James Fenimore and Railton, Stephen (INT)",
        "Description": "&&LDIV&&R&&LDIV&&R&&LDIV&&R&&LI&&RThe Last of the Mohicans&&L/I&&R, by &&LB&&RJames Fenimore Cooper&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&RDuring the fierce French and Indian wars, an adroit scout named Hawkeye and his companion Chingachgook weave through the spectacular and dangerous wilderness of upstate New York, fighting to save the beautiful Munro sisters from the Huron renegade Magua. &&LP&&R&&LI&&RThe Last of the Mohicans&&L/I&&R is the most popular of &&LB&&RJames Fenimore Cooper&&L/B&&R’s five &&LI&&RLeatherstocking Tales&&L/I&&R. With its death-defying chases and teeth-clenching suspense, this American classic established many archetypes of American frontier fiction. &&LP&&RAn engrossing “Western” by America’s first great novelist, &&LI&&RThe Last of the Mohicans &&L/I&&Ris a story of survival and treachery, love and deliverance.&&L/P&&R&&LDIV&&R&&LB&&RStephen Railton&&L/B&&R, Professor of English at the University of Virginia, has written books on Cooper, Mark Twain, and the American Renaissance, and has created major websites on Twain, &&LI&&RUncle Tom’s Cabin&&L/I&&R, and American culture.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R",
        "Category": " Fiction , Classics",
        "Publisher": "Sterling Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Equus",
        "Authors": "By Shaffer, Peter",
        "Description": "An explosive play that took critics and audiences by storm, Equus is Peter Shaffer's exploration of the way modern society has destroyed our ability to feel passion. Alan Strang is a disturbed youth whose dangerous obsession with horses leads him to commit an unspeakable act of violence. As psychiatrist Martin Dysart struggles to understand the motivation for Alan's brutality, he is increasingly drawn into Alan's web and eventually forced to question his own sanity. Equus is a timeless classic and a cornerstone of contemporary drama that delves into the darkest recesses of human existence.",
        "Category": " Drama , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "129.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Like Silk",
        "Authors": "By Baxter, Mary Lynn",
        "Description": "When Collier Smith, a high-powered attorney, encounters Brittany Banks, a battered and bruised woman from the wrong side of town, on a rainy night, he tries to deny his powerful attraction to this beautiful woman who reminds him of the past he longs to forget. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Bedford Guide for College Writers: With Reader, Research Manual, and Handbook",
        "Authors": "By Kennedy, Dorothy M. and Holladay, Sylvia A.",
        "Description": "When it was first published twenty years ago, The Bedford Guide for College Writers brought a lively and innovative new approach to the teaching of writing. Since that time, authors X. J. and Dorothy M. Kennedy have won praise for their friendly tone and their view, apparent on every page of the text, that writing is the \"usually surprising, often rewarding art of thinking while working with language.\" More recently, experienced teacher and writer Marcia F. Muth joined the author team, adding more practical advice to help all students — even those underprepared for college work — become successful academic writers. While retaining the highly praised \"Kennedy touch,\" The Bedford Guide continues to evolve to meet classroom needs. The new edition does even more to build essential academic writing skills, with expanded coverage of audience analysis, source-based writing, argumentation and reasoning, and more.",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "6.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "EasyWriter: A Pocket Reference",
        "Authors": "By Lunsford, Andrea A. and Horowitz, Franklin E.",
        "Description": "A student-friendly pocket guide to the essentials of writing and research, EasyWriter is an ideal, inexpensive reference handbook for any course where writing is required. Now more visual and even easier to use and understand,EasyWriter offers practical help with research and documentation and expanded coverage of academic writing for students in all disciplines.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Draw Comics: A Step-by-Step Guide for the Aspiring Comics Artist",
        "Authors": "By Tony Tallarico",
        "Description": "",
        "Category": "",
        "Publisher": "Mud Puddle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Lake of Souls (Cirque Du Freak #10)",
        "Authors": "By Shan, Darren",
        "Description": "\"If you step through after Harkat, you might never come back. Is your friend worth such an enormous risk?\"Darren and Harkat face monstrous obstacles on their desperate quest to the Lake of Souls. Will they survive the savage journey? And what awaits them in the murky waters of the dead? Be careful what you fish for...",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Lord Loss (The Demonata, 1)",
        "Authors": "By Shan, Darren",
        "Description": "The first novel in a chilling new series by Darren Shan, author of the New York Times bestselling Cirque Du Freak series, will keep readers turning page after horrifying page.  Grubbs Grady has stiff red hair and is a little big for his age, which means he can get into R-rated movies. He hates history and loves bacon, rats, and playing tricks on his squeamish older sister. When he opts out of a family weekend trip, he never guesses that he is about to take a terrifying journey into darkness. Hungry demons and howling werewolves haunt his waking nightmares... and threaten his life.",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Winged Man",
        "Authors": "By A. E Van Vogt",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "20.85",
        "Publish Date": {
            "Month": "December",
            "Year": "1973"
        }
    },
    {
        "Title": "Managing High-Technology Programs and Projects, 2nd Edition",
        "Authors": "By Archibald, Russell D.",
        "Description": "Don?t just manage a project?master it! Managing High-Technology Programs and Projects 2nd Edition As diverse as high-technology programs and projects are, there are as many factors that they hold in common, such as time and budget parameters and their multidisciplinary nature. Yet there has never been a single source that every project manager can consult to manage any kind of project, from start-up to close-out. Managing High-Technology Programs and Projects, Second Edition is just such a book. In concise yet thorough detail, it presents a practical, proven system for managing all types of programs and projects, with emphasis on high-technology projects. Illustrated with numerous forms and illustrations, plus checklists for project start-up and close-out, it offers step-by-step coverage of: Understanding the differences and similarities among different types of programs and projects Organizing the project management function Setting up the project team and building project commitment Starting up a project rapidly and efficiently Managing multiple projects Selecting project planning and scheduling software packages Conducting in-progress evaluations and providing product direction Ensuring the effective completion of the project?on time, within budget and meeting specifications",
        "Category": " Business & Economics , Strategic Planning",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Summer for the Gods: The Scopes Trial and America's Continuing Debate over Science and Religion",
        "Authors": "By Larson, Edward J.",
        "Description": "With this authoritative and engaging book, Edward J. Larson examines the many facets of the Scopes trial and shows how its enduring legacy has crossed religious, cultural, educational, and political lines.The \"Monkey Trial,\" as it was playfully nicknamed, was instigated by the American Civil Liberties Union to challenge a controversial Tennessee law banning the teaching of human evolution in public schools. The Tennessee statute represented the first major victory for an intense national campaign against Darwinism, launched in the 1920s by Protestant fundamentalists and led by the famed politician and orator William Jennings Bryan. At the behest of the ACLU, a teacher named John Scopes agreed to challenge the statute, and what resulted was a trial of mythic proportions. Bryan joined the prosecutors and acclaimed criminal attorney Clarence Darrow led the defense - a dramatic legal matchup that spurred enormous media attention and later inspired the classic play Inherit the Wind.The Scopes trial marked a watershed in our national discussion of science and religion. In addition to symbolizing the clash between evolutionists and creationists, the trial helped shape the development of both popular religion and constitutional law in America, serving as a precedent for more recent legal and political battles.",
        "Category": " Social Science , Anthropology , General",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Sensational Smoothies (A Healthy Exchanges Cookbook)",
        "Authors": "By Lund, JoAnna M. and Alpert, Barbara",
        "Description": "It's breakfast-on-the-go. A year-round treat. A healthy dessert. And it's taken America by storm.  Now JoAnna Lund offers a wealth of original smoothie recipes-nutritious, healthy, and delicious-that can be made at home, simply and inexpensively. She shows readers how to create flavorful smoothies at home, the Healthy Exchanges way: low in sugar, low fat, and packed with nutrition.  Includes the delicious Banana Flip, Orange Coconut, and Creamy Strawberry Daiquiri. Plus, there's a bonus section on getting creative with the blender featuring recipes such as Quick Chili con Queso supper or the No-Bake Blender Cheesecake.",
        "Category": " Cooking , Beverages , Juices & Smoothies",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Paper Mage",
        "Authors": "By Cutter, Leah R.",
        "Description": "In a small Chinese village during the Tang Dynasty, an unsure young woman has managed to elude the conventions of her society to become a gifted paper mage-one who creates magic with the ancient art of paper folding. Because her gifts are in demand for the protection they can offer, Xiao Yen must leave behind her beloved family and embark on a dangerous mission. Yet she has no idea that this looming adventure will shape the very woman she is to become.",
        "Category": " Fiction , Fantasy , Historical",
        "Publisher": "Roc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Blood Beast (The Demonata, Book 5)",
        "Authors": "By Shan, Darren",
        "Description": "Grubbs Grady has so far escaped the family curse, but when he begins to experience alarming symptoms at the onset of the full moon, he is scared that the jaws of fate are opening and about to swallow him whole. He has cheated death, defeated demons, moved on with his life. But Grubbs is torn between the world of magic and his wolfen genes. Can he fight the beast inside or will he fall victim to his tainted blood?",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Natural Health, Natural Medicine: The Complete Guide to Wellness and Self-Care for Optimum Health",
        "Authors": "By Weil, Andrew",
        "Description": "The best-selling books of Andrew Weil, \"the guru of alternative medicine,\" (San Francisco Examiner) offer a comprehensive blend of traditional and alternative methods that help to achieve better health in the modern world. Natural Health, Natural Medicine is a comprehensive resource for everything you need to know to maintain optimum health and treat common ailments. This landmark book incorporates Dr. Weil’s theories of preventive health maintenance and alternative healing into one extremely useful and readable reference, featuring general diet and nutrition information as well as simple recipes, answers to readers’ most pressing questions, a catalogue of home remedies, invaluable resources, and hundreds of practical tips. This edition includes up-to-the-minute scientific findings and has been expanded to provide trustworthy advice about low-carb diets, hormone replacement therapy, Alzheimer’s, attention deficit disorder, reflux disease, autism, type 2 diabetes, erectile dysfunction, the flu, and much more.",
        "Category": " Health & Fitness , Naturopathy",
        "Publisher": "Harvest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "America's Game",
        "Authors": "By Kurkjian, Tim",
        "Description": "An illustrated tour of the history of baseball tells the story of baseball in a series of doublepage photo spreads and features such important images as the handwritten lyrics of \"Take Me Out to the Ballgame\" and the contract transferring Babe Ruth from the Red Sox to the Yankees. 50,000 first printing.",
        "Category": " Sports & Recreation , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Videohound's Epics: Giants of the Big Screen",
        "Authors": "By Hopp, Glenn",
        "Description": "Lists and reviews 200 of the biggest motion pictures of all time and provides information on the release year, running time, cast and crew, ratings, and video availability",
        "Category": " Performing Arts , Film & Video , Reference",
        "Publisher": "Visible Ink Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "CliffsQuickReview Anatomy and Physiology",
        "Authors": "By Pack, Phillip E.",
        "Description": "CliffsQuickReview course guides cover the essentials of your toughest classes. Get a firm grip on core concepts and key material, and test your newfound knowledge with review questions.Whether you're in high school or medical school, CliffsQuickReview Anatomy and Physiology can help you understand how your body is built and the different functions it performs. This guide introduces each topic, defines key terms, and carefully walks you through each sample problem step-by-step. In no time, you'll be ready to tackle other concepts in this book such asCell divisionOrganization of the skeletal systemNervous system organizationHormonesImmune system and other body defensesReproductive systemCliffsQuickReview Anatomy and Physiology acts as a supplement to your textbook and to classroom lectures. Use this reference in any way that fits your personal style for study and review — you decide what works best with your needs. Here are just a few ways you can search for topics:Use the free Pocket Guide full of essential informationGet a glimpse of what you'll gain from a chapter by reading through the Chapter Check-In at the beginning of each chapterUse the Chapter Checkout at the end of each chapter to gauge your grasp of the important information you need to knowTest your knowledge more completely in the CQR Review and look for additional sources of information in the CQR Resource CenterUse the glossary to find key terms fast.With titles available for all the most popular high school and college courses, CliffsQuickReview guides are a comprehensive resource that can help you get the best possible grades.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Great taste-low fat: Over 200 delicious recipes under 400 calories",
        "Authors": "By Young, Grace, and Time-Life Boo Sandra Rose",
        "Description": "",
        "Category": "",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "6.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Baby, Don't Go",
        "Authors": "By Andersen, Susan",
        "Description": "Some Rules Were Made to Be BrokenPhotographer Nick Coltrane broke Daisy Parker&#39;s heart nine years ago. And now he wants to hire her as his bodyguard. She wants to tell him where he can go, but her fledgling company desperately needs the cash flow. She once broke her own rules, only to watch his sexy self run for the door. Providing round-the-clock protection for him is out of the question . . . right?Nick needs Daisy around to keep the hired thugs who are out for his blood from actually getting it. If he can make amends for the way he screwed up nine years ago in the process, then so much the better. Except time has done nothing to dull the memory of how Daisy once rocked his world off its axis, and her cocky attitude and mouthwatering curves still have the power to turn his brain to mush.Now two people who once were friends and used to be lovers will discover whether love and trust can come from a passion that breaks every rule.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2014"
        }
    },
    {
        "Title": "John Madden's Heroes of Football",
        "Authors": "By Madden, John and Gutman, Bill",
        "Description": "A Super Bowl-winning coach, an Emmy Award-winning analyst, and the namesake of the Madden NFL video game shares his extensive knowledge in an ultimate football resource that traces the sport's history, profiles prominent players, reveals game-making plays, and much more.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Sports & Recreation",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Baseball legends of all time",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The best of baseball: Baseball's greatest players, teams, games, and more",
        "Authors": "By Adomites, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Lion, the Witch and the Wardrobe, Movie Tie-in Edition (Narnia)",
        "Authors": "By Lewis, C. S. and Baynes, Pauline (ILT)",
        "Description": "A mass-market paperback edition of The Lion, the Witch and the Wardrobe, book two in the classic fantasy series The Chronicles of Narnia. This edition features black-and-white illustrations by the original illustrator, Pauline Baynes, and eight pages of stills from the epic motion picture.Four adventurous siblings—Peter, Susan, Edmund, and Lucy Pevensie—step through a wardrobe door and into the land of Narnia, a land frozen in eternal winter and enslaved by the power of the White Witch. But when almost all hope is lost, the return of the Great Lion, Aslan, signals a great change . . . and a great sacrifice.Step through the wardrobe and into The Lion, the Witch and the Wardrobe, the second book in C. S. Lewis's classic fantasy series, which has been enchanting readers of all ages for over sixty years. This is a stand-alone novel, but if you want to return to Narnia, read The Horse and His Boy, the third book in The Chronicles of Narnia.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Masquerade (The DeWarenne Dynasty, 2)",
        "Authors": "By Joyce, Brenda",
        "Description": "When a chance encounter with the man she has secretly loved for years results in a child, Elizabeth Anne Fitzgerald becomes immersed in a web of lies, scandal, and deception when the father of her child, Tyrell de Warenne, sets out to find the truth and expose her as a liar. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Vacations That Can Change Your Life",
        "Authors": "By Lederman, Ellen",
        "Description": "Describes travel to places and programs aimed for physical, psychological, and spiritual growth",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Sourcebooks",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Lord of the Shadows (Cirque Du Freak: The Saga of Darren Shan, Book 11)",
        "Authors": "By Shan, Darren",
        "Description": "Darren Shan is going home--and his world is going to hell. Old enemies await. Scores must be settled. Destiny looks certain to destroy him, and the world is doomed to fall to the Ruler of the Night.",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Blueprints for Life: Building on the Foundation of Christ",
        "Authors": "By Tim Wesemann",
        "Description": "",
        "Category": "",
        "Publisher": "CTA, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Fatal Flaws",
        "Authors": "By Hanegraaff, Hank",
        "Description": "Materials drawn from The Face That Demonstrates The Farce of Evolution (ISBN 0-8499-4272-1) Today's generation is bombarded with theories about humankind and its origins. The danger for Christians lies in the wealth of misinformation and miscommunication about simple biblical truths such as:How and when the world beganWhether humans are unique or merely a happenstance of evolutionThe distinction between humankind and other living creaturesThe evolution of life on this planetThe spiritual dimensions of the human soulHank Hanegraff keeps Christians from falling prey to corrupting scientific speculation about the origins of life and reminds us that we are God's creation. This common sense approach puts the concept of evolution in the grasp of everyday Christians and reminds us that ultimately the key to our purpose in this life comes from understanding whose we are and who created us.",
        "Category": " Religion , Christian Theology , Apologetics",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Essential Slow Cooker Recipes",
        "Authors": "By Munson, Carol Heding",
        "Description": "",
        "Category": "",
        "Publisher": "Sterling*+ Publishing Company",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Too Soon To Say Goodbye by Buchwald, Art (2006) Paperback",
        "Authors": "By Buchwald, Art",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "A Novel Idea (The Romantic Comedies)",
        "Authors": "By Friedman, Aimee",
        "Description": "Required reading has never been so hot.   Once upon a time there was a Brooklyn hipster named Norah. Unlucky in love, and short on extracurriculars for her college apps, Norah decided to start a book group. She knew the perfect locale -- a local indie bookstore with a crush-worthy cutie manning the soy latte counter.   When the first meeting arrives, Norah gets a page-turning surprise. The attendees may be bookish, but there are also a few hotties! Most noteworthy: sweet, literary James. He's like a modern Jane Austen hero.... Only, how to snag him?   Ever the romantic heroine, Norah devises a secret plan. And if it works, Norah may just find her \"Happily Ever After\" love story. The End.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Seventh Son (Tales of Alvin Maker, Vol. I)",
        "Authors": "By Card, Orson Scott",
        "Description": "Blending folklore and myth, this novel follows young Alvin Maker as he begins a dangerous journey to discover the secret of a magical power",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Three Days",
        "Authors": "By Napoli, Donna Jo",
        "Description": "While driving in the Italian countryside, eleven-year-old Jackie's father suddenly collapses at the wheel. Fear for her father's life quickly turns to terror when two Italian men kidnap her and drive to their remote home in the countryside.  Jackie soon discovers that her captors are actually a family, plagued by a mysterious secret. Award-winning novelist Donna Jo Napoli has created a haunting thriller that gives life to Jackie's utter desperation and determination to escape.",
        "Category": " Juvenile Fiction , Law & Crime",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Prom Nights from Hell",
        "Authors": "By Cabot, Meg, Myracle, Lauren, Meyer, Stephenie, Jaffe, Michele, and Harrison, Kim",
        "Description": "In this exciting collection, bestselling authors Meg Cabot (How to Be Popular), Kim Harrison (A Fistful of Charms), Michele Jaffe (Bad Kitty), Stephenie Meyer (Twilight), and Lauren Myracle (ttyl) take bad prom nights to a whole new level—a paranormally bad level. Wardrobe malfunctions and two left feet don't hold a candle to discovering your date is the Grim Reaper—and he isn't here to tell you how hot you look. From angels fighting demons to a creepy take on getting what you wish for, these five stories will entertain better than any DJ in a bad tux. No corsage or limo rental necessary. Just good, scary fun.",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "THE NO.1 LADIES' DETECTIVE AGENCY",
        "Authors": "By McCall Smith, Alexander",
        "Description": "The No. 1 Ladies' Detective Agency consists of one woman, the engaging and sassy Precious Ramotswe, who sets up shop in Gaborone, Botswana. A cross between Kinsey Millhone and Miss Marple, this unlikely heroine specialises in missing husbands, wayward daughters, con men and imposters. When she sets out on the trail of a missing child she is tumbled headlong into some strange situations and not a little danger.",
        "Category": " Fiction , General",
        "Publisher": "Polygon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "From Emeril's Kitchens: Favorite Recipes from Emeril's Restaurants",
        "Authors": "By Lagasse, Emeril",
        "Description": "What's the next best thing to eating at one of Emeril's restaurants? Making your favorite Emeril dishes at home! And now you can with Emeril's new book, From Emeril's Kitchens. Emeril Lagasse, America's favorite chef, has gathered 150 of the most popular, most requested recipes from six of his restaurants, and has included two dozen new personal favorites as well. If you are one of the many fans who have enjoyed a memorable meal at one of Emeril's restaurants or tuned into his television cooking shows, and want to share that extraordinary experience with friends and family,From Emeril's Kitchens is the book for you.From Emeril's New Orleans, try your hand at the Home-Smoked Salmon Cheesecake or the Barbecued Shrimp with Rosemary Biscuits. NOLA in the French Quarter is known for the Cedar-Planked Fish with Citrus Horseradish Crust and Citrus Butter Sauce and the over-the-top dessert Chicory Coffee Crème Brûlées with Brown Sugar Shortbread Cookies. Entertain at weekend brunch as they do at Emeril's Delmonico and make the elegant Poached Eggs Erato or Souffléd Spinachand Brie Crêpes. Explore the tropics with dishes from Emeril's Orlando such as the Poached Grouper with Mango Salsa, Smashed Avocado, Coconut-CilantroRice Pilaf, Black Bean Sauce, and Tortilla Chips.Looking for a true steak house experience? The Seared Beef Tournedos with Herb-Roasted Potatoes and Sauce au Poivre from Delmonico Steakhouse in Las Vegas are just the ticket. Seafood lovers can dig into Poached Oysters in Herbsaint Cream or the Spiny Lobster-Tomato Saffron Stew with Shaved Artichoke and Olive Salad from Emeril's New Orleans Fish House.So, spread the food of love and kick up your kitchen another notch with From Emeril's Kitchens!Emeril Lagasse is donating a portion of his proceeds from the book to The Emeril Lagasse Foundation, a nonprofit organization established  to support and encourage programs that create developmental and educational opportunities for children.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Pot Pies: Comfort Food Under Cover",
        "Authors": "By Phillips, Diane",
        "Description": "Eighty-five scruptious recipes for \"comfort food\" include chicken pot pie, biscuits, beef stew, soups, and many other cozy, life-affirming foods.",
        "Category": " Cooking , General",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Road to Hell (Hell on Earth, Book 2)",
        "Authors": "By Kessler, Jackie",
        "Description": "While trying to keep her past from Paul, her super-sexy new boyfriend, Jesse, a former soul-stealing succubus, must deal with bad boy incubus Daunuan, her former associates, supernatural entities, and an enemy from the Underworld who wants Paul's immortal soul. By the author of Hell's Belles. Original.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Table for Five",
        "Authors": "By Wiggs, Susan",
        "Description": "When an estranged couple is killed in a tragic accident, strangers Lily Robinson and Sean McGuire are named the guardians of their three orphaned children and must find a way to become a family. Reprint.",
        "Category": " Fiction , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Secret Santa",
        "Authors": "By James, Sabrina",
        "Description": "A tale of love, romance, confusion, and Christmas perfectly timed for the holiday season.Noelle, a hopeless romantic, just knows that her gifts have to be from her senior crush!  And geeky Froggy thinks the game is the perfect way to get super-popular Celia to fall for him...except she thinks his gifts are from Jake, the school's resident bad boy, and starts to crush on him!   Romantic mishaps abound, but all is revealed the night of the Winter Dance, where there's more than one surprise waiting under the mistletoe!",
        "Category": " Young Adult Fiction , Holidays & Celebrations",
        "Publisher": "Point",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Measures for Clinical Practice: A Sourcebook, Volume 2, Adults",
        "Authors": "By Corcoran, Kevin and Fischer, Joel",
        "Description": "Today, as practitioners in all areas of the human services are increasingly held accountable for monitoring and evaluating their practices in an objective and efficient manner, a sound familiarity with objective measurement is more essential than ever before. In addition, practitioners must also be concerned with satisfying a dizzying array of state, agency, health maintenance organization, and insurance company guidelines.  For more than twelve years, through two highly acclaimed editions and now in an updated and expanded third edition, Kevin Corcoran and Joel Fischer's standard reference, Measures for Clinical Practice, has enabled professionals to gather this vital information easily and effectively. In Measures for Clinical Practice, Volume 1: Couples, Families, and Children, and Volume 2: Adults, Corcoran and Fischer provide an extensive collection of more than 400\"rapid assessment instruments\" (RAIs), including many questionnaires and scales, which assess virtually any problem commonly encountered in clinical practice. Corcoran and Fischer have revised this edition to reflect new research and contemporary clinical practices. They include new scales and materials in areas such as assessment in culturally diverse populations and measurement in managed care systems, as well as the best instruments updated from the previous editions.  Brief and easy to administer, these \"best practice measures\" will be useful for all types of therapeutic and theoretical orientations. All instruments are actually reprinted in the book, and are carefully introduced and evaluated to aid in their selection. Corcoran and Fischer explain the principles of measurement and how to apply them in practice. They explore the range of assessment techniques available, including behavioral observations, rating scales, and client logs, as well as unobtrusive, electromechanical, and standardized measures. And after examining the advantages and disadvantages of rapid assessment instruments, they show practitioners how to effectively select and administer these measures as part of the treatment process.  More comprehensive than ever, this edition of Measures for Clinical Practice is essential to every practitioner and student of social work, psychology, psychiatry, nursing, counseling, and the rehabilitative therapies.",
        "Category": " Psychology , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Return to Summerhouse",
        "Authors": "By Deveraux, Jude",
        "Description": "With her shining gift for \"exquisite and enchanting\" (BookPage) storytelling, Jude Deveraux sweeps readers away in a breathtaking follow-up to her beloved New York Times bestseller, The Summerhouse -- where a marvelous new adventure awaits.   Magic most definitely resides in the Maine summerhouse where the mysterious Madame Zoya has granted the innermost wishes of its visitors. Now, three women have come to this special place with one thing in common: a painful past they would each like to rewrite. Amy, who hides a heartbreaking loss behind her seemingly perfect marriage and family...Faith, a widow in her thirties whose deepest grief is for a man from years ago...and Zoë, an artist shunned by her hometown for reasons she doesn't know, after a traumatic night erased her memory. With their mystical powers, Madame Zoya and her sister Primrose are about to transport the trio to eighteenth-century England to alter Amy's ancestry. But although surprises await each of them, will stepping back in time bring the women the happy endings they seek?",
        "Category": " Fiction , Romance , Time Travel",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Out of the Light, Into the Shadows",
        "Authors": "By McCarthy, Erin, Foster, Lori, and Foster, L. L.",
        "Description": "The darkest hour is before the dawn... headlines a sinful new anthology where the dark and light sides of desire collide... Embrace the darkness and experience the light in this all-new anthology filled with touching stories of happily ever after alongside smoldering tales of irresistibly dangerous, otherworldly passion. From bewitching emotions and untamed desire to dazzling romance and tantalizing sensuality, these novellas explore the complex facets of the human heart-both the light side and the dark.",
        "Category": " Fiction , Romance , Collections & Anthologies",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Storm of Visions (Chosen Ones, Book 1)",
        "Authors": "By Dodd, Christina",
        "Description": "First in a new back-to- back series from the New York Times bestselling authorHailed as \"a star in any genre,\"(New York Times bestselling author J. R. Ward) Christina Dodd delivers an exciting new paranormal romance that introduces The Seven, a secret society created to combat evil in all its deadly forms...",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Close to You (Lost Texas Hearts, Book 3)",
        "Authors": "By Dodd, Christina",
        "Description": "“White-hot action and sizzling sensuality power…[the] high-octane, blow-out finale” (Publishers Weekly, starred review) of New York Times bestselling author Christina Dodd’s thrilling Lost Hearts romantic suspense series.Caitlin Prescott was only a baby when her parents disappeared. Adopted by a wealthy Texas oil family, she became Kate Montgomery and grew up with no memory of her parents or siblings, who have been searching for her, hoping to right a terrible wrong that was committed twenty-two years ago in a small Texas town. Now an ambitious young news reporter, Kate realizes she is being stalked soon after landing her dream job at an Austin TV station. Why did a car try to run her down? Who would want to kill her? Turning her precarious situation into a story, she takes on a bodyguard and follows him on the job. But she didn’t plan on the cool, blade-sharp strength of Teague Ramos or the attraction that sizzles between them. When Teague connects the death of an Austin socialite to unanswered questions about Kate’s childhood, she finds herself unlocking dangerous doors to her past. Now, with only her mysterious bodyguard to protect her, Kate is on a high-stakes chase that may lead her to the family she has never known—or into the trap of a ruthless killer.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Killer Cruise",
        "Authors": "By Shaw, Jennifer",
        "Description": "Onboard facilities Pool 1, Caribbean DeckMet hot crewmember while soaking up the sun! The Santorini Restaurant, Olympia DeckHeard about last year's mysterious disappearance on board. What could have happened? Movie Theater, Fiesta DeckStill can't stand horror flicks. Too scary. Paris Boutique, Panama DeckThen again, so was my near-death fall overboard last night . . . Glamorama Spa, Bermuda DeckMust relax. No one's trying to kill me—I'm just being paranoid. Club Paradise, Diablo DeckBut what if someone does want me dead?",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Simple As 1 2 3 Slow Cooker (Favorite Brand Name Recipes)",
        "Authors": "By Publications International Ltd., Favorite Brand Name Recipes",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "3 Books in 1 3-4-5- Ingredient Cookbook",
        "Authors": "By the editors of Publications International",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "favorite brand name",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Historic Haunted America",
        "Authors": "By Norman, Michael and Scott, Beth",
        "Description": "Historic Haunted America is an engrossing investigation into North American ghost legends, a comprehensive documenting yesterday and today's most shocking hauntings in the United States and Canada.From the ghost-ridden forts in Old Tucson to the \"Inn of the 17 Ghosts\" near Philadelphia, from the haunted plantations of Louisiana and Georgia to a haunted community playhouse in Sioux Falls, South Dakota, Michael Norman and Beth Scott tell stories of the past and present so terrifyingly real that even the most skeptical reader will believe.",
        "Category": " Body, Mind & Spirit , Supernatural (incl. Ghosts)",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Crush du Jour (Simon Romantic Comedies)",
        "Authors": "By Ostow, Micol",
        "Description": "When a girl bites off more than she can chew...   Laine barely has enough time for herself, much less for romance. But she's always hungry for more projects -- so she signs up to teach a cooking class at her local community center. As it turns out, the guy co-teaching the class with her, Seth, is not just cute, but downright delicious! When Seth offers her a waitressing job at his family's restaurant, Hype, Laine can't resist.   Just as Seth finally warms up to Laine, she finds out that Callie, another waitress at Hype, is cooking up a plan to steal Seth for herself. But tensions really reach their boiling point when Laine's restaurant critic mother writes a scathing review of Hype! Will Laine have to put love on the back burner again?",
        "Category": " Young Adult Fiction , Humorous , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Hearts Divided: An Anthology",
        "Authors": "By Stone, Katherine (EDT), Macomber, Debbie (EDT), and Dyer, Lois Faye (EDT)",
        "Description": "A trio of heartwarming romances features Debbie Macomber's \"5-B Poppy Lane,\" in which Ruth Shelton, while asking for advice on her own romance with a soldier, stumbles upon a secret from her grandmother's past. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Irish Magic",
        "Authors": "By Wiggs, Susan, Llywelyn, Morgan, Samuel, Barbara, and Gellis, Roberta",
        "Description": "In the brilliant green of Ireland’s hills and the majestic thunder of its waves, ancient Eriu’s lore tempts lovers to abandon their hearts to the power of the land and its legends…   IRISH MAGIC   “Galway Bay” by Morgan Llywelyn When street-smart New Yorker Eileen escapes to a seaside Irish town to explore the mysteries of its people and their folklore, she never expects to find adventure and love awaiting her…   “The Harper’s Daughter” by Barbara Samuel Dierdre has believed all her life that her extraordinary beauty has been nothing but a curse and has avoided getting involved romantically with anyone. But when she meets a handsome stranger, she wonders if she can have the happiness she’s always longed for…   “The Trysting Hour” by Susan Wiggs Aideen has found a true love, an immortal joining of bodies and hearts. But it may haunt her forever— unless she and her lost lover can find a way to remember…   “Rarer Than A White Crow” by Roberta Gellis A malicious spell compels warrior woman Cáer to take a blue-eyed immortal to her bed. But it also might offer her one chance for romance and the most irresistible passion…",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "That Summer Place: An Anthology",
        "Authors": "By Macomber, Debbie, Wiggs, Susan, and Barnett, Jill",
        "Description": "Presents the stories of three couples who prove that opposites do attract as they find love and passion under the roof of a Victorian summerhouse called Rainshadow Lodge.",
        "Category": " Fiction , Romance , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Father Knows Best (By Request 3'S)",
        "Authors": "By Arnold, Judith",
        "Description": "Three fathers find unexpected romance and passion when they attend the Daddy School, in a charming trio of stories that includes Father Found, in which Jamie McCoy, the writer of \"Guy Stuff,\" finds a baby girl on his doorstep and calls the Daddy School's Allison Winslow for advice, as well as Father Christmas and Father of Two. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Jane's Warlord (Berkley Sensation)",
        "Authors": "By Knight, Angela",
        "Description": "On the trail of a sadistic killer, who has the ability to travel through time, reporter Jane Colby discovers she is destined to become the killer's next victim when Baran Arvid, a genetically engineered warrior from the future, arrives to protect her from harm. Original.",
        "Category": " Fiction , Gothic",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Master of the Night",
        "Authors": "By Knight, Angela",
        "Description": "Hired to seduce gorgeous millionaire Reece Champion in order to gain entrance to a murderous organization, agent Erin Grayson gets more than she bargained for when she discovers that Reece is a vampire--and secret agent--who has his own agenda. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Too Much Temptation",
        "Authors": "By Foster, Lori",
        "Description": "Innocent in the ways of love and desire, Grace Jenkins finds herself fantasizing about Noah Harper, a devastatingly sexy man whose engagement has just ended in disgrace, and when Grace offers him her support and friendship, her fantasies soon become a passionate reality. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Say No to Joe? (Visitation, Book 1)",
        "Authors": "By Foster, Lori",
        "Description": "You met Joe Winston in Lori Foster's Wild. Now, the Winston brothers' seductive, bad-boy cousin is back and up against a woman who's immune to his considerable charms. . .or so it seems. . .Irresistible Force--Meet Immovable ObjectJoe Winston has a routine with women: he exists; they swoon; roll credits. With his smoldering looks, macho style, and irrepressible charm, Joe can have any woman--except the one he really wants. Secretly, Luna Clark may lust after Joe, but she's made it clear that she's too smart to fall for him. He can just keep holding his breath, thank you very much. But now, Luna's inherited two kids who need more than she alone can give in a small town that seems hell-bent on driving them away. She needs someone to help out. . .someone who can't be intimidated. . .someone just like Joe. Becoming an instant family wasn't exactly what Joe had in mind, but hey, it's a start, and you can't blame a guy for trying every angle.After all, where there's a Joe, there's a way. . .straight into a woman's heart.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Edge of Twilight (Wings in the Night, 10)",
        "Authors": "By Shayne, Maggie",
        "Description": "In order to quench his thirst for revenge, Edge, the last of the Immortals, joins forces with Amber Lily, the only half human, half vampire ever born, to destroy the enemy--an alliance that plunges them into a dark realm of evil where passion is the key to their survival. Original.",
        "Category": " Fiction , Gothic",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Nowhere to Run: A Novel",
        "Authors": "By Clark, Mary Jane",
        "Description": "New York Times bestselling author Mary Jane Clark delivers Nowhere to Run, a thrilling novel of psychological suspense set in the world she knows best--network newsBotulism, anthrax, smallpox, plague: as medical producer for television's highly-rated morning news program, Annabelle Murphy makes her living explaining horrific conditions to the nation. So when a KEY News colleague dies with symptoms terrifyingly similar to those of anthrax, she knows the panic spreading through the corridors of the Broadcast Center is justified. As one death follows another, Annabelle's co-workers look to her for assurance, but she finds it hard to give comfort. To her, the circumstances surrounding the infections suggest diabolical murders. And when the authorities lock down the Broadcast Center with the identity of the killer still unknown, neither the victims nor the murderer can escape...Nowhere To Run is full of Mary Jane Clark's signature intricate plotting and taut psychological suspense.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "THE AGE OF REFORM (Vintage Book V-95)",
        "Authors": "By Hofstadter, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Master of Desire (MacAllister Series, 1)",
        "Authors": "By MacGregor, Kinley",
        "Description": "With the success of Kinley MacGregor's latest New York Times Expanded and USA Today bestseller A Dark Champion, we are in the perfect position to republish her backlist gem Master of Desire.A Dream of Desire Awakened . . .Beautiful Lady Emily dreams of the rapture of love and the joys of marriage. The youngest daughter of an English lord at war, she is shaken by the arrival of a mysterious stranger to her father's castle. Could this breathtaking man be Emily's yearned-for lover? Indeed, Draven de Montague, Earl of Ravenswood, has come for Emily . . . but romance has nothing to do with it.In the Tender Embrace of an Enemy . . .Draven would never have entered the home of his most hated adversary had not the King himself ordered him to take in his foe's daughter for a year to forge bonds of peace between their two feuding houses. Worse still, here is a lass whose exquisite loveliness could tempt Draven to betray his sworn vow never to let anther close to his heart. Emily knows the searing heat of her passion could burn down the defenses of this proud warrior. But will the surrender of the sweet nectar of his lips and his bold, sensuous caress ignite a blaze so hot it consumes them both?",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Cryptography: The Science of Secret Writing",
        "Authors": "By Smith, Laurence D.",
        "Description": "\"Those who delight in puzzles can find much to ponder here.\" — Science News Letter\"Will be well received by anyone really interested in the subject.\" — Scientific Book Club ReviewReaders interested in secret writing will find this book an excellent elementary explanation of transposition and substitution ciphers, codes, and their solutions. More than 150 problems provide practical application as well as tests of skill and ingenuity.After a brief description of the history of secret writing, the reader is introduced to fundamental principles of ciphers — transposition and substitution — and given an understanding of the various methods of enciphering and deciphering secret messages. The author covers geometrical patterns, route transcription, columnar transposition, and other methods used in transposition; under substitution, he treats mixed cipher systems, single-alphabet and polyalphabetical substitution, mechanical devices, the Vigenère system, etc. A discussion of cryptanalysis leads the reader into 151 problems for which answers are provided at the end. Appendixes offer notes on enciphering Japanese; and explanation of the Baconian Biliteral Cipher; frequency tables for English, French, German, Italian, and Spanish.",
        "Category": " Games & Activities , Puzzles",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1955"
        }
    },
    {
        "Title": "Warlock And Son (Warlock of Gramarye, Book 11)",
        "Authors": "By Stasheff, Christopher",
        "Description": "When Warlock's young son, Magnus, embarks on his own adventurous journeys around the world, Warlock cannot resist following him, but when Magnus is faced with danger and the responsibilities of growing up, he is on his own. Reissue.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Sinner (Jane Rizzoli, Book 3)",
        "Authors": "By Gerritsen, Tess",
        "Description": "Not even the icy temperatures of a typical New England winter can match the bone-chilling scene of carnage discovered at the chapel of Our Lady of Divine Light. Within the cloistered convent lie two nuns–one dead, one critically injured–victims of an unspeakably savage attacker. The brutal crime appears to be without motive, but medical examiner Maura Isles’s autopsy of the dead woman yields a shocking surprise: Twenty-year-old Sister Camille gave birth before she was murdered. Then another body is found, mutilated beyond recognition. Together, Isles and homicide detective Jane Rizzoli uncover an ancient horror that connects these terrible slaughters. As long-buried secrets come to light, Maura Isles finds herself drawn inexorably toward the heart of an investigation that strikes close to home–and toward a dawning revelation about the killer’s identity too shattering to consider.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Under the Radar (Sisterhood Series, No. 13)",
        "Authors": "By Michaels, Fern",
        "Description": "In The Middle Of The Night, The Sisterhood Is Your Only HopeA Sister's work is never done--not when there are wrongs to right and underdogs to defend. Just returned to their mountaintop hideaway after their latest successful mission, the seven fearless friends enjoy a celebratory dinner and retire to bed. But within an hour, an alarm sounds, and the ladies rush into the compound in time to see Myra and their mentor, Charles, climbing aboard a helicopter. All that's left is a mysterious note, signed by Charles. Still reeling, the Sisters receive an urgent call from retired justice Pearl Barnes. Pearl runs an underground railroad to help abused and displaced women, and she's just rescued fourteen pregnant teenagers who belong to a highly secretive and controversial polygamy sect. But keeping the girls safe will require the kind of help only the Sisterhood can provide--if they can band together and go it alone.  .  .Praise for Fern Michaels and her Sisterhood novels.  .  .\"Revenge is a dish best served with cloth napkins and floral centerpieces.  .  .fast-paced.  .  .puts poetic justice first.\"--Publishers Weekly on Payback\"Delectable.  .  .deliver[s] revenge that's creatively swift and sweet, Michaels-style.\" --Publishers Weekly on Hokus Pokus",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Zebra",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "The Front (Win Garano)",
        "Authors": "By Cornwell, Patricia Daniels",
        "Description": "When Patricia Cornwell introduced a quicksilver, cut-to-the-bone style and extraordinary cast of characters in At Risk, the result was electrifying. Now, America's #1 bestselling crime writer returns with an audacious new adventure.View the trailer for \"Patricia Cornwell's The Front\", premiering on Lifetime on April 10, 2010.Watch a Video",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "The Mephisto Club (Jane Rizzoli, Book 6)",
        "Authors": "By Gerritsen, Tess",
        "Description": "Evil exists. Evil walks the streets. And evil has spawned a diabolical new disciple  in this white-knuckle thriller from New York Times bestselling author Tess Gerritsen. PECCAVIThe Latin word is scrawled in blood at the scene of a young woman’s brutal  murder: I HAVE SINNED. It’s a chilling Christmas greeting for Boston medical examiner  Maura Isles and Detective Jane Rizzoli, who swiftly link the victim to controversial  celebrity psychiatrist Joyce O’Donnell–Jane’s professional nemesis and member of  a sinister cabal called the Mephisto Club. On top of Beacon Hill, the club’s acolytes  devote themselves to the analysis of evil: Can it be explained by science? Does it  have a physical presence? Do demons walk the earth? Drawing on a wealth of dark historical  data and mysterious religious symbolism, the Mephisto scholars aim to prove a startling  theory: that Satan himself exists among us.  With the grisly appearance of a corpse  on their doorstep, it’s clear that someone–or something–is indeed prowling the city.  The members of the club begin to fear the very subject of their study. Could this  maniacal killer be one of their own–or have they inadvertently summoned an evil entity  from the darkness?  Delving deep into the most baffling and unusual case of their  careers, Maura and Jane embark on a terrifying journey to the very heart of evil,  where they encounter a malevolent foe more dangerous than any they have ever faced  . . . one whose work is only just beginning.From the Hardcover edition.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Field Instruction: A Guide for Social Work Students (3rd Edition)",
        "Authors": "By Royse, David D., Dhooper, Surjit Singh, and Rompf, Elizabeth Lewis",
        "Description": "Field Instruction: A Guide for Social Work Students, Third Edition, offers practical advice for some of the most common questions raised by students beginning their first field practicum. Known for its conversational style, useful case examples, and thorough coverage of issues involved in field instruction, the third edition includes such features as: new sections on managed care, new and revised material on legal and ethical issues, new and revised material on diversity, new material on safety issues, new material on handling stress, and new examples and illustrations throughout.",
        "Category": " Social Science , Reference",
        "Publisher": "Longman Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "First Impressions: An Anthology",
        "Authors": "By Roberts, Nora",
        "Description": "Escaping the traps of gold-digging women, wealthy businessman Vance Banning moves to rural Maryland. All he wants is peace, quiet and to keep away from women.  The last thing he needs is his sassy, sexy neighbor Shane Abbott. But he has no idea how determined Shane will be when it comes to giving a helping hand&#151;or a loving heart.When small-town girl Hilary Baxter is offered a prestigious six-month modeling contract by Bret Bardoff, handsome, charming and the owner and publisher of fashionable Mode Magazine, the sky is the limit. Thrust into a glamorous career in New York, Hilary knows she has it all&#133;except for the one thing she really wants: Bret's love.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Bungalow 2: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "Danielle Steel takes us beyond the dazzle of Hollywood in her compelling new novel—the    story of one woman’s journey from suburban mom to award-winning screenwriter...and  all the joy, heartbreak, and challenges along the way.   Bungalow 2  The phone call  came on a hot July day—a day like any other for Marin County mom and freelance writer  Tanya Harris.  But this call—from Tanya’s agent—was anything but ordinary, offering  a once-in-a-lifetime opportunity: the chance to write a major Hollywood screenplay,  a dream she had put aside long ago to devote her energies to her family.  This time,  Tanya knows she cannot refuse, even though she’s torn about leaving her husband and  their daughters. From the moment she steps into her lush bungalow at the fabled Beverly  Hills Hotel, Tanya is thrust into an intoxicating new world where she feels reborn—energized  by the creativity swirling around her—yet the pull of her family at home is strong.     Suddenly she’s working alongside A-list actors and a Hollywood legend: Oscar-winning  producer Douglas Wayne, a man who always gets what he wants–and who seems to have  his sights set on her. Flying home between shoots, struggling to reconnect with a  family that seems to need her less and less, Tanya watches helplessly as her old  life is pulled out from under her in the most crushing of ways.  As her two lives  collide, as one award-winning film leads to another, Tanya begins to wonder if she  can be a wife, a mother, and a writer at the same time.  And just as she confronts  the toughest choice she has faced, she is offered another dazzling opportunity—one  that could recast her story in an amazing new direction, complete with an ending  she never could have written herself.  In Bungalow 2, Danielle Steel takes us into  a world few ever see—a world of fame and fortune, celebrity and genius–daring to  show us the real lives, real dreams, and real struggles hidden beneath the flash  and glitter of Hollywood.From the Hardcover edition.",
        "Category": " Fiction , Literary",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Here And Then",
        "Authors": "By Miller, Linda Lael and Miller, Lad Linda",
        "Description": "The author of four romantic best-sellers presents a time-travel love story that sends Rue Claridge back to the Old West of 1892, where her fate depends on Marshal Farley Haynes, who responds by arresting her. Reissue.",
        "Category": " Fiction , Romance , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Return of the King (Lord of the Rings, Book 3)",
        "Authors": "By J.R.R. Tolkien.",
        "Description": "",
        "Category": "",
        "Publisher": "Bookspan",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Changeling (Sisters of the Moon, Book 2)",
        "Authors": "By Galenorn, Yasmine",
        "Description": "\"The first in an engrossing new series, [Witchling was] a whimsical reminder of fantasy's importance in life\" (Publishers Weekly). Now comes Changeling-again featuring Camille, the good witch, Menolly, the vampire, and Delilah, a feline shapeshifter. They're the D'Artigo sisters, half-human, half-Faerie supernatural agents who are now enlisted to find the fiends responsible for slaughtering the weres of Rainier Puma Pride.",
        "Category": " Fiction , Romance , Paranormal",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Robin MacNaughton's Sun Sign Personality Guide:  A Complete Love and Compatibility Guide for Every Sign in the Zodiac",
        "Authors": "By MacNaughton, Robin",
        "Description": "Let Robin MacNaughton help you discover who you really are through Astrology.  Do you have a million friends and no lovers?  Do you like to play boss even when you're not?  Does mediocrity drive you to despair?  Are you fiercely competitive and determined to succeed?  Do your emotions play havoc with your health?  Robin MacNaughton's fascinating new book is a complete personality guide, with special emphasis on love and compatibility.  Find out who your soul-mate is--which signs are right for romance.  Learn how to live up to your potential--what's holding you back and how you can overcome it.  Discover how the planetary cycles can influence your relationships, health, career and happiness.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1983"
        }
    },
    {
        "Title": "The Summoner (Chronicles of the Necromancer, Book 1)",
        "Authors": "By Martin, Gail Z.",
        "Description": "The comfortable world of Martris Drayke, second son of King Bricen of Margolan, is shattered when his older half-brother, Jared, and Jared¿s dark mage, Foor Arontala, kill the king and seize the throne. Tris is the only surviving member of the royal family aside from Jared the traitor. Tris flees with three friends: Soterius, captain of the guard; Carroway, the court¿s master bard; and Harrtuck, a member of the royal guard. Tris harbors a deep secret. In a land where spirits walk openly and influence the affairs of the living, he suspects he may be the mage heir to the power of his grandmother, Bava K¿aa, once the greatest sorceress of her age. Such magic would make Tris a Summoner, the rarest of magic gifts, capable of arbitrating between the living and the dead.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Solaris",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Blood Drive (The Anna Strong Chronicles, Book 2)",
        "Authors": "By Stein, Jeanne C.",
        "Description": "Anna Strong was a tough-as-nails bounty hunter, until the night she was attacked-and changed forever.  Now a vampire, Anna discovers that her long-dead brother may have had a daughter-and the girl's in serious trouble. There are some very dangerous people after her, but they're about to learn that to a bounty hunter with an unnatural thirst for blood, even the deadliest human predators are easy prey.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Aspern Papers and The Turn of the Screw",
        "Authors": "By James, Henry and Curtis, Anthony",
        "Description": "A literary historian develops a scheme to gain possession of love letters written by an American poet, and a governess tries to protect the two young children in her care from the ghosts she perceives haunting them",
        "Category": " Fiction , General",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Church Before the Watching World : A Practical Ecclesiology",
        "Authors": "By Schaeffer, Francis A.",
        "Description": "",
        "Category": "",
        "Publisher": "Inter-Varsity Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Shell Game",
        "Authors": "By Alten, Steve",
        "Description": "The SHELL GAME is far more than a thriller, it is a MUST-READ cautionary tale that exposes the next “9/11 event” a deception that will lead to a retaliatory chemical weapons strike on Iran and the terrorist elements the regime supports. Though the novel is written as fiction, it is filled with all-too-real details provided by insiders in the oil industry, military, and Middle Eastern affairs that extrapolates real events from the past and present that will lead us down a path of self-destruction...unless we stop the insanity now!   The story opens in 2007 when two CIA spooks meet with an American Colonel in military intelligence. The war is going badly, and President Bush, who steadfastly refuses to back down, remains unchallenged at home as Democrats and Republicans continue to toss verbal grenades –  positioning themselves for the 2008 elections. Meanwhile, Iran’s pursuit of nuclear energy will yield enriched uranium within five years -- uranium that can be used to manufacture suitcase nukes. The United States’ military is too drained to invade Iran, and a preemptive strike is out of the question...unless a nuclear detonation were to occur in an American city -- the enriched uranium traced back to Iran. A U.S. reprisal would strike a death-blow against radical Islam, quell the insurgent violence in Iraq...and yield more oil. Yes, the cost is unthinkable – but if we sit back and do nothing then one day a dozen suitcase bombs could go off in a dozen American cities – bringing with it anarchy and the collapse of Western civilization.December 2011: Ashley “Ace” Futrell is an oil expert working for PetroConsultants, married to Kelli Doyle, a former National Security Advisor and one of the CIA spooks from the opening scene. When Kelli threatens to expose the plot, Ace finds his existence hurtling down a rabbit’s hole of deceit where the orchestrated lies of the powerful few could lead to the darkest days of human existence... and the death knell for billions.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Sweetwater Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Undead and Unappreciated (Queen Betsy, Book 3) (Berkley Sensation)",
        "Authors": "By Davidson, MaryJanice",
        "Description": "Reluctant vampire queen Betsy Taylor may rule the topsy-turvy world of the undead, but now Betsy's discovered that she has a long-lost half-sister who's the devil's daughter--and destined to rule the underworld.",
        "Category": " Fiction , Romance , Paranormal",
        "Publisher": "Berkley Sensation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "One Summer: A Novel",
        "Authors": "By Robards, Karen",
        "Description": "He was pure, unadulterated trouble.  Johnny Harris is home again, his too-tight jeans and damn-your-eyes belligerence honed to perfection by a ten-year stretch in federal prison for murder.  Now he's out on parole and ready for the job Rachel Grant has promised to help him begin a new life.  Unlike the rest of the town, Rachel has always believed in her former student's innocence.  But one thing has changed...The sullenly handsome boy she remembers is still sullen, still handsome...but no longer a boy.  And now the small Kentucky town is alive with gossip and whispers of a scandal, as friendship turns to passion and Rachel abandons a lifetime of propriety in the ex-con's arms.  Then the killer strikes again. All evidence points to Johnny Harris, but Rachel knows he is innocent.  And she knows she is next...as a shattering truth is uncovered and dark passions explode in the relentless summer heat.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Tick Tock",
        "Authors": "By Koontz, Dean R.",
        "Description": "Tommy Phan is a successful detective novelist living the American Dream in southern California. One evening he comes home to find a small rag doll on his doorstep. It’s a simple doll, covered entirely in white cloth, with crossed black stitches for the eyes and mouth, and another pair forming an X over the heart. Curious, he brings it inside.That night Tommy hears an odd popping sound and looks up to see the stitches breaking over the doll’s heart. And in minutes the fabric of Tommy Phan’s reality will be torn apart. Something terrifying emerges from the pristine white cloth, something that will follow Tommy wherever he goes. Something that he can’t destroy. It wants Tommy’s life, and he doesn’t know why. He has only one ally, a beautiful, strangely intuitive waitress he meets by chance—or by a design far beyond his comprehension. He has too many questions, no answers, and very little time. Because the vicious and demonically clever doll has left this warning on Tommy’s computer screen:The deadline is dawn.TicktockTime is running out.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Throat (Blue Rose, Book 3)",
        "Authors": "By Straub, Peter",
        "Description": "The continuing mystery of the Blue Rose Murders draws Tim Underhill back to his home town, where he will help a friend accused of murdering his wife clear his name. By the author of Koko. Reissue.",
        "Category": " Fiction , General",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Roman Army (Cambridge Introduction to World History)",
        "Authors": "By WILKES, JOHN",
        "Description": "Discusses the way of life, training, and equipment of the Roman army and examines the duties of officers and soldiers of the legion",
        "Category": " History , General",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1973"
        }
    },
    {
        "Title": "The Maiden's Heart",
        "Authors": "By Beard, Julie",
        "Description": "When knight errant Hugh de Greyhurst marries a baron's daughter sight unseen, he discovers that his lovely bride, Margrete Trewsbury, has vowed to remain forever chaste, until a deadly conspiracy unites them against a common threat. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Jove",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Delaney Christmas Carol (The Delaneys)",
        "Authors": "By Preston, Fayrene, Hooper, Kay, and Johansen, Iris",
        "Description": "From three of the brightest stars in contemporary fiction comes a festive trio of romantic classics about an unforgettable family—and the enchanted heirloom that links one generation to the next.…Christmas Past by Iris JohansenKillara, Arizona, 1893. Kevin Delaney doesn’t know what to make of the Gypsy beauty he finds rummaging in the attic of Killara, his family’s estate. She claims she’s there to recover an old mirror with extraordinary powers. While Kevin doesn’t believe her mystical talk, there’s no doubt a kind of magic is at work on his heart—just in time for Christmas.…Christmas Present by Fayrene PrestonBria Delaney is at Killara for the holidays when she discovers a mirror that reveals more than her reflection. Appearing in the glass is a startlingly handsome man who just as mysteriously disappears—until she meets him in person that night, leading to a Christmas they’ll never forget.…Christmas Future by Kay HooperA heartbreaking vision in the legendary Delaney mirror drove Brett Delaney to the other side of the world. Now his father’s death bequeaths him the mirror, and its prophecy sends him back to Killara for Christmas, determined to save the home—and the woman—he’s always loved.",
        "Category": " Fiction , Romance , Collections & Anthologies",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Only For You (Zebra Historical Romance)",
        "Authors": "By Howell, Hannah",
        "Description": "Hannah Howell spins lush, romantic stories that sparkle with intrigue and  passion. Now, she gives is her most exciting novel yet: a medieval tale set on  the untamed Scottish border, where a man and a woman risk their hearts on  the stormy battlefield of love!  As wild as the rugged north country where she was raised, Saxan Honey  Todd has sworn to avenge the murder of her twin brother. Recklessly, she  gallops  across the English countryside in pursuit of the man she believes to  be his murderer: Botolf, Earl of Regenford.  As hard and unyielding as the armor he wears in battle, Botolf is irresistibly  drawn to the impetuous beauty who has come to wage war with him. Saxan  stirs his passion to the point of madness.  .  .but to love her would be madness  indeed.  Now, as a desperate enemy stalks him and the greensward runs with innocent  blood, Botolf brings Saxan to his castle.  .  .as his bride. But Saxan needs  more: to fight by Botolf's side and triumph over the danger that surrounds  them--as the beloved mistress of his very heart and soul.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Florence (Art Guide with Folding Map) (Bonechi Golden Book Collection)",
        "Authors": "By Luciano Berti",
        "Description": "",
        "Category": "",
        "Publisher": "Casa Editrice Bonechi",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    }
]