[
    {
        "Title": "Your Baby in Pictures: The New Parents' Guide to Photographing Your Baby's First Year",
        "Authors": "By Koh, Me Ra",
        "Description": "Capture the story of your baby’s first year! The first twelve months of your child’s life are full of precious, fleeting moments, from sleepy newborn yawns to first smiles and wobbly first steps. Why entrust your memories to hastily taken snapshots—or worse yet, none at all? Let professional photographer (and mom) Me Ra Koh help you capture the moments with 40 beautiful “photo recipes” anyone can do, with any camera. Telling your baby’s story in pictures has never been easier!",
        "Category": " Photography , Subjects & Themes , Portraits & Selfies",
        "Publisher": "Amphoto Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Fodor's See It London, 4th Edition (Full-color Travel Guide)",
        "Authors": "By Hawkins, Sheila (EDT), Smith, Stephanie (EDT), Bamber, Judith (CON), Cavendish, Richard (CON), and Edwards, Nick (CON)",
        "Description": "",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Be Intolerant: Because Some Things Are Just Stupid",
        "Authors": "By Dobson, Ryan and Scott, Jefferson",
        "Description": "\"Whatever\" is now the password into civilized youth culture. Alarming numbers of Christians eighteen to twenty-five years old believe that there is no such thing as absolute truth. Yet, Ryan Dobson proclaims, we can't even function if we believe that everything is relative. In his first book, the impassioned youth speaker explains God's establishment of absolutes, using relevant examples to awaken Christians to the world's desperate hunger for absolute truth -- and the church's duty to proclaim it.OUR GENERATION IS BEING DESTROYED BY RAMPANT TOLERANCE.  Somebody’s cheating at school?  “Well, that’s his business.”  Your roommate wants an abortion?  “I wouldn’t do it, but hey, it’s her life.”  Accepting everything means you believe in nothing. When it comes to right and wrong, sitting on the fence won’t get you—or the people you love—anywhere. Passiveness is not love. Love is getting in people’s face and telling them the truth.  Finally, someone has the courage to point out that some ideas are simply stupid. Honest and unflinching, Ryan Dobson will show you how to back up your beliefs and be intolerant—in love.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Unfinished Desires: A Novel (Random House Reader's Circle)",
        "Authors": "By Godwin, Gail",
        "Description": "From Gail Godwin, three-time National Book Award finalist and acclaimed New York Times bestselling author of Evensong and The Finishing School, comes a sweeping new novel of friendship, loyalty, rivalries, redemption, and memory.It is the fall of 1951 at Mount St. Gabriel’s, an all-girls school tucked away in the mountains of North Carolina. Tildy Stratton, the undisputed queen bee of her class, befriends Chloe Starnes, a new student recently orphaned by the untimely and mysterious death of her mother. Their friendship fills a void for both girls but also sets in motion a chain of events that will profoundly affect the course of many lives, including the girls’ young teacher and the school’s matriarch, Mother Suzanne Ravenel. Fifty years on, the headmistress relives one pivotal night, trying to reconcile past and present, reaching back even further to her own senior year at the school, where the roots of a tragedy are buried.In Unfinished Desires, a beloved author delivers a gorgeous new novel in which thwarted desires are passed on for generations–and captures the rare moment when a soul breaks free.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "In the Heart of the Canyon (Vintage Contemporaries)",
        "Authors": "By Hyde, Elisabeth",
        "Description": "Over the course of thirteen long days, twelve assorted passengers, three rafting guides and one stray dog will navigate the rapids of the Colorado River through the Grand Canyon together. From their early-morning rise on the shore of the river to the adrenaline rush of paddling through Lava Falls, they will soon come to know each other more intimately than they could have expected. Tempers will flare and decisions will be second-guessed . . . and ultimately all of them, from an unhappy teenager to an aging river guide, will realize that sometimes the most daunting adventures have nothing to do with white-water rapids, and everything to do with reconfiguring the rocky canyons of the heart.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Fodor's Vancouver & Victoria, 2nd Edition: with Whistler, Vancouver Island & the Okanagan Valley (Full-color Travel Guide)",
        "Authors": "By Trefler, Caroline (EDT)",
        "Description": "Full-color guide • Make your trip to Vancouver & Victoria unforgettableCustomize your trip with simple planning tools • Top experiences & attractions • Best Bets for restauants and hotels • Easy-to-read color neighborhood and regional mapsExplore Vancouver, Victoria, Whistlery and beyond • Discerning Fodor’s Choice picks for hotels, restaurants, sights, and more • “Word of Mouth” tips from fellow Fodor’s travelers • Best outdoor activities, museums, shopping, and whale-watching opportunitiesOpinions from destination experts • Fodor’s Vancouver- and Victoria-based writers reveal their favorite local haunts • Frequently updated to provide the latest information",
        "Category": " Travel , Canada , Western Provinces (AB, BC)",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "The Thieves of Manhattan: A Novel",
        "Authors": "By Langer, Adam",
        "Description": "The famously false memoirs of James Frey may be yesterday’s news, but as this funny riff reminds us, literary fakes are as old as literature itself. Ian Minot is an aspiring writer who labors over short stories that seem destined to remain unread. His beautiful Romanian girlfriend, Anya Petrescu, finds success more easily—and leaves Ian for Blade Markham, a bloviating ex-gangbanger whose “so-called memoir” is a best-seller. When Ian is approached by ex-editor Jed Roth, who wants Ian to publish Jed’s pulpy tale of book theft and murder as a memoir, then renounce it, it’s a chance for both of them to get revenge: Jed on his former employer, and Ian on the world. Although Langer may be too cute for some (he employs made-up slang in which a penis is a portnoy), he does an engaging job with the hall-of-mirrors plot. And if readers can predict that the book they’re reading is the one that Ian ends up writing, they’ll never guess the ending. Just when you want a surprising twist, Langer delivers several.",
        "Category": " Fiction , Crime",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Cleopatra's Daughter: A Novel (Egyptian Royals Collection)",
        "Authors": "By Moran, Michelle",
        "Description": "From the internationally bestselling author of Nefertiti comes the tumultuous story of Antony and Celopatra's daughter, Selene. The marriage of Marc Antony and Cleopatra is one of the greatest love stories of  all time, a tale of unbridled passion with earth-shaking political consequences.  When the lovers choose to die by their own hands, their three orphaned children are taken in chains to Rome; only two—the ten-year-old  twins Selene and Alexander—survive the journey. Delivered to the household of Octavian’s sister, the siblings cling to each other and to the hope that they will return  one day to their rightful place on the throne of Egypt. Recounted in Selene’s youthful and engaging voice, Moran introduces  a compelling cast of historical characters: Octavia, the emperor Octavian’s kind  and compassionate sister, abandoned by Marc Antony for Cleopatra; Livia, Octavian's  bitter and jealous wife; Marcellus, Octavian’s handsome, flirtatious nephew and heir  apparent; Tiberius, Livia’s sardonic son and Marcellus’s great rival for power; and  Juba, Octavian’s watchful aide, whose honored position at court has far-reaching  effects on the lives of the young Egyptian royals. Selene’s narrative is animated  by the concerns of a young girl in any time and place—the possibility of finding  love, the pull of friendship and family, and the pursuit of her unique interests  and talents. And as Selene and Alexander come of  age, they  are buffeted by the personal ambitions of Octavian’s family  and court, by the ever-present  threat of slave rebellion, and by the  longings and desires deep within their own  hearts.Based on meticulous research, Cleopatra’s Daughter is a fascinating  portrait of imperial Rome and of the people and events of this glorious and most volatile period in human history. Emerging from the shadows of the past, Selene,  a young woman of irresistible charm and preternatural intelligence, will capture  your heart.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "The Thousand",
        "Authors": "By Guilfoile, Kevin",
        "Description": "\"Kevin Guilfoile's riveting new novel defies pigeonholing. Part thriller, part dystopian science fiction, The thousand takes the reader on a spine-tingling ride from Las Vegas to Chicago, from ancient Greece to modern America. With a painstakingly constructed conspiracy based on followers of Pythagoras, The Thousand is the story, above all, of a young woman's efforts to tell truth from lies as a network of powerful people tries to use her for its own gain. If you're like me, you'll stay up all night until all the pieces fall into place.\"---Sara Paretsky, author of Hardball\"Part thught-provoking mystery, part flat-out thriller, The Tousand is superb. Kevin Guilfoile's second novel is every bit as inventive---Umberto Eco meets Stan Lee---and well crafted as his first, which is saying something. Guilfoile patiently develops an array of unique characters and adroitly weaves them into a provocative, relentless labyrinth of a story. It's a rare treat---a book to savor, contemplate, and admire.\" ---Stephen White, author of The Stege\"Kevin Guilfoile is a writer of stunning talent.\"---James Rollins, author of The Doomsday KeyKevin Guilfoile is a terrific new novelist with guts, brains, wit, and imagination... Guilfoile is a bright new star in the crime fiction universe, but so much more than that.\"---C.J. Box, Edgar Award winner and author of Bellow ZeroKevin Guilfoile's rivering follow-up to Cast of Shadows (\"spellbinding\"---Chicago Tribune; \"a masterpiece of intelligent plotting\"---Slon) centers on an extraordinary young wonman's race to find her Father's killer and to free herself from the cross fire of a centuries-old civil war in which she has unknowingly become ensnared.In 530 B.C., a mysterious ship appeared off the rainy shores of Croton, in what is now Italy. After thre days the skies finally cleared and a man disembarded to address the curious and frightened crowd that had gathered along the wet sands. He called himself Pythagoras. Exactly what he said that day is unknown, but a thousand men and women abandoned their lives and families to follow him. they became a community. A school. A cult dedicated to the search for a mathematical theory of everything. Although Pythagoras would die years later, following a bloody purge, his disciples would influence Western philosophy, science, and mathematics for all time.Chicago, the present day. Canada Gold, a girl both gifted and burdened by uncanny mental abilities, is putting her skills to questionable use in the casinos and courthouses of Las Vegas when she finds herself drawn back to the city in which her father, the renowned coposer Solomon Gold, was killed while composing his magnum opus. Beautiful, brilliant, troubled, Canada has never heard of the Thousand, a clandestine group of powerful individuals safeguarding and exploiting the secret teachings of Pythagoras. But as she struggles to understand her father's unsolved murder, she finds herself caught in the violence erupting between members of the fractured ancient cult while she is relentlessly pursued by those who want to use her those who want to kill her, and the one person who wants to save her.BR>In an irresistibly ambitious novel that fuses historical fact with contemporary suspense, Kevin Guilfoile delivers an erudite, propulsively entertaining thriller that seamlessly traverses the realms of math, science, music, and philosophy. the Thousand is ringing confirmation of Guilfoile's enormous talent.",
        "Category": " Fiction , Mystery & Detective , Historical",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Juliet",
        "Authors": "By Fortier, Anne",
        "Description": "Twenty-five-year-old Julie Jacobs is heartbroken over the death of her beloved aunt Rose. But the shock goes even deeper when she learns that the woman who has been like a mother to her has left her entire estate to Julie’s twin sister. The only thing Julie receives is a key—one carried by her mother on the day she herself died—to a safety-deposit box in Siena, Italy.    This key sends Julie on a journey that will change her life forever—a journey into the troubled past of her ancestor Giulietta Tolomei. In 1340, still reeling from the slaughter of her parents, Giulietta was smuggled into Siena, where she met a young man named Romeo. Their ill-fated love turned medieval Siena upside-down and went on to inspire generations of poets and artists, the story reaching its pinnacle in Shakespeare’s famous tragedy.     But six centuries have a way of catching up to the present, and Julie gradually begins to discover that here, in this ancient city, the past and present are hard to tell apart. The deeper she delves into the history of Romeo and Giulietta, and the closer she gets to the treasure they allegedly left behind, the greater the danger surrounding her—superstitions, ancient hostilities, and personal vendettas. As Julie crosses paths with the descendants of the families involved in the unforgettable blood feud, she begins to fear that the notorious curse—“A plague on both your houses!”—is still at work, and that she is destined to be its next target. Only someone like Romeo, it seems, could save her from this dreaded fate, but his story ended long ago. Or did it?    From Anne Fortier comes a sweeping, beautifully written novel of intrigue and identity, of love and legacy, as a young woman discovers that her own fate is irrevocably tied—for better or worse—to literature’s greatest star-crossed lovers.",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "The Man Who Smiled (Kurt Wallander Series)",
        "Authors": "By Mankell, Henning",
        "Description": "From the dean of Scandinavian noir, comes a riveting installment in the internationally bestselling and universally acclaimed Kurt Wallander series, the basis for the PBS series staring Kenneth Branagh.After killing a man in the line of duty, Kurt Wallander resolves to quit the Ystad police. However, a bizarre case gets under his skin.A lawyer driving home at night stops to investigate an effigy sitting in a chair in the middle of the highway. The lawyer is hit over the head and dies. Within a week the lawyer’s son is also killed. These deeply puzzling mysteries compel Wallander to remain on the force. The prime suspect is a powerful corporate mogul with a gleaming smile that Wallander believes hides the evil glee of a killer. Joined by Ann-Britt Hoglund, Wallander begins to uncover the truth, but the same merciless individuals responsible for the murders are now closing in on him.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Vintage Crime/Black Lizard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Essential Mediterranean Cookbook",
        "Authors": "By Bay Books",
        "Description": "",
        "Category": "",
        "Publisher": "Bay Books",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Cat Owner's Problem Solver (Owner's Problem Solvers)",
        "Authors": "By Bower, John and Bower, Caroline",
        "Description": "Offers advice on feline health and behavior with profiles on the most popular breeds",
        "Category": " Pets , Cats , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Living Theatre",
        "Authors": "By Rice, Elmer",
        "Description": "",
        "Category": "",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Restaurant Favorites at Home (The Best Recipe)",
        "Authors": "By Cook's Illustrated Magazine (EDT)",
        "Description": "The editors of the popular magazine offer 150 favorite restaurant recipes reworked and tested for the home kitchen.",
        "Category": " Cooking , Methods , Professional",
        "Publisher": "America's Test Kitchen",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "O is for Obama: An Irreverent A-to-Z Guide to Washington and Beltway Politics",
        "Authors": "By Anderson, Mark (ILT) and Milbank, Dana",
        "Description": "F is for fun and L is for laughs in this rollicking romp through the alphabet poking good natured fun at Washington politics and politicians. The book takes unerring aim at the foibles and frailties of the political class and their inside-the-beltway blustering. With illustrations provided by award-winning artist Mark Anderson and verses and text written by Washington Post political writer Dana Milbank, this is political satire at its best. O is for Obama is a witty, non-partisan, and equal-opportunity ribbing of not just out-of-touch politicians, but also of greedy businessmen, tone-deaf bureaucrats, and ivory-tower elites that no frustrated voter fed up with Washington will want to be without.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Triumph Books Entertainment",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The birth of civilization in the Near East (Doubleday anchor books)",
        "Authors": "By Frankfort, Henri",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "UPRISING",
        "Authors": "By McManus, Erwin Raphael",
        "Description": "Warning: This book may not be for you!This book is dangerous!It is only for those who are ready to join an uprising?a revolution of the soul that will change an ordinary life into an extraordinary one. It is only for those who want something more out of life, who desire to tap into the divine potential that was placed in them at their creation.You were in God's imagination before you were ever born. All the talent, gifting, and creativity you possess was placed in you by God Himself. Can you imagine the things you could do, the impact you could have on the world, if you tapped into the dreams God has for your life?In Uprising: A Revolution of the Soul, Erwin Raphael McManus boldly invites you to join the revolution. He illuminates the desperate heart cry of every human being?\"I want to live!\"?and then serves as a guide on a quest to answer that cry.Find your true purpose and destiny in the pursuit of the passion and character of God. Be a part of a revolution that changes a life of imitation and mediocrity into one of passion and character . . . a radical revolt that will forever change the world!",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Ultimate Guitar Songbook: The Complete Resource for Every Guitar Player!",
        "Authors": "By Hal Leonard Publishing Corporation (EDT)",
        "Description": "The complete resource for every guitar player! This incredible book features 110 songs from all styles of music. It includes a variety of note-for-note transcriptions, riffs, and arrangements for easy guitar, chord melody, fingerstyle, and classical guitar. It's perfect for students and teachers! Songs include: Achy Breaky Heart * Ave Maria * All Right Now * Beauty and the Beast * Born to Be Wild * Crazy * Day Tripper * Don't Speak * Dust in the Wind * Free Bird * Greensleeves * I Feel Fine * Iron Man * Layla * Misty * Money * My Girl * Name * O Little Town of Bethlehem * Oh, Pretty Woman * The Star Spangled Banner * Tears in Heaven * Wonderwall * You Were Meant for Me * Your Song * many more.",
        "Category": " Music , Printed Music , General",
        "Publisher": "Hal Leonard Corporation",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "INVESTIGATIONS 2008 STUDENT MATH HANDBOOK GRADE 3",
        "Authors": "By Scott Foresman",
        "Description": "",
        "Category": " Juvenile Nonfiction , Mathematics , General",
        "Publisher": "Scott Foresman",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Margret And H.A. Rey's Merry Christmas, Curious George",
        "Authors": "By Hapka, Cathy and illustrated by Mary O'Keefe Young",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Pathophysiology: The Biologic Basis for Disease in Adults and Children",
        "Authors": "By Huether, Sue E. and McCance, Kathryn L. (EDT)",
        "Description": "",
        "Category": " Medical , Nursing , Research & Theory",
        "Publisher": "Mosby-Year Book",
        "Price Starting With ($)": "11.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Classic Paints & Faux",
        "Authors": "By Sloan, Annie and Gwynn, Kate",
        "Description": "The authors of The Complete Guide to Decorative Paint Techniques provide a comprehensive guide to various do-it-yourself decorative techniques, with step-by-step instructions, equipment and color directories, and supplier listings. 35,000 first printing.",
        "Category": " Art , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Barbecues and Salads: The Summer Collection",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Curriculum enrichment outdoors",
        "Authors": "By John Hug",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "The Royal Year 1989",
        "Authors": "By Graham, Tim",
        "Description": "Two hundred full-color photographs capture the busy year of the British royal family, at official functions and during relaxed moments, in this royal book of visual record for 1989",
        "Category": " History , General",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Savannah Seasons",
        "Authors": "By Terry, Elizabeth and Terry, Alexis",
        "Description": "The South is known for its hospitality, and award-winning chef Elizabeth Terry is known for her ability to create magic in the kitchen. With Savannah Seasons Chef Terry, working with her daughter Alexis, brings all the warmth of the South, and the secrets of her culinary wizardry, into the kitchens of home cooks everywhere.She began cooking simply for her family--husband Michael, and daughters Alexis and Celeste--but for the past fifteen years Elizabeth Terry, winner of the l995 James Beard Award as Best Chef in the Southeast, and her eponymous restaurant in Savannah, have been known for serving simply prepared, perfectly fresh, innovative dishes in the Southern tradition. Unlike most great restaurants, Elizabeth on 37th is a family enterprise--as is Savannah Seasons. All of the two hundred recipes collected here have been tested by co-author Alexis in the Terry home kitchen (located \"above the store\") to ensure that they are well within the range of any amateur cook. From Hearty Okra Gumbo with Chicken and Shrimp to Savannah Red Rice, from Soft Shell Crabs to Ragout of Venison, you will find interpreted within these pages all the native bounty of a rich regional cuisine--shellfish, sweet Vidalia onions, and black-eyed peas; recipes for relishes and marinades; crisp, fresh salads; delicious baked goods, and much more. And throughout there are chef's tips and stories, in the voices of Elizabeth, Alexis, Michael, and Celeste, about the food, about life in Savannah, and about their experiences at \"the family restaurant.\" Savannah Seasons is not only a book of outstanding recipes but a book full of warmth, joy, and hospitality.",
        "Category": " Cooking , Seasonal",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Complete Outdoor Living Cookbook (Williams-Sonoma Outdoors Collection)",
        "Authors": "By Chain Sales Marketing",
        "Description": "",
        "Category": "",
        "Publisher": "Weldon Owen",
        "Price Starting With ($)": "7.5",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Glass Pantry: Preserving Seasonal Flavors",
        "Authors": "By Brennan, Georgeanne and Kleinman, Kathryn (PHT)",
        "Description": "Features recipes for jams, preserves, marmalades, jellies, conserves, brandied fruit, mustards, chutneys, and more",
        "Category": " Cooking , Reference",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "The World of Shakespeare",
        "Authors": "By Claybourne, Anna and Treays, Rebecca",
        "Description": "",
        "Category": "",
        "Publisher": "Edc Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Lights for Minneapolis (The American Adventure)",
        "Authors": "By Miller, Susan Martins and Wallenta, Adam (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Look Who Lives in the Ocean",
        "Authors": "By Baker, Alan",
        "Description": "",
        "Category": "",
        "Publisher": "Hodder Wayland",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Audubon Society Encyclopedia of North American Birds",
        "Authors": "By Terres, John K.",
        "Description": "Provides articles on all aspects of bird life and biographies of notable ornithologists",
        "Category": " Science , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "12.02",
        "Publish Date": {
            "Month": "December",
            "Year": "1980"
        }
    },
    {
        "Title": "Search the Sky",
        "Authors": "By Frederik Pohl, C. M. Kornbluth",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1954"
        }
    },
    {
        "Title": "Book of Oriental Carpets and Rugs",
        "Authors": "By Bennett, Ian",
        "Description": "",
        "Category": "",
        "Publisher": "Hamlyn Publ Group Ltd",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Racing Around (MathStart 2)",
        "Authors": "By Murphy, Stuart J. and Reed, Mike (ILT)",
        "Description": "Even though his big brother and sister tell him that he is too young to enter the 15-kilometer bike race that follows Perimeter Path around the park, Mike knows that he can do it, especially with the help of a friend. Simultaneous.",
        "Category": " Juvenile Nonfiction , Mathematics , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Tuff Stuff: A Children's Book About Trauma",
        "Authors": "By Joy Wilt",
        "Description": "",
        "Category": "",
        "Publisher": "Word",
        "Price Starting With ($)": "5.45",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Stealth Fighter Pilot",
        "Authors": "By D.M. Giangreco",
        "Description": "",
        "Category": "",
        "Publisher": "Motorbooks International Publishers and Wholesalers",
        "Price Starting With ($)": "19.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Greener Than You Think",
        "Authors": "By Ward MOORE",
        "Description": "",
        "Category": "",
        "Publisher": "Crown Publishers",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Laughing Classroom: Everyone's Guide to Teaching with Humor and Play",
        "Authors": "By Weston, Martha, Loomans, Diana, and Kolberg, Karen J.",
        "Description": "Shows how to create a positive learning environment with techniques that incorporate humor into the classroom",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "HJ Kramer",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "A Piece of Mine: Stories",
        "Authors": "By Cooper, J. California",
        "Description": "In her acclaimed novels and short stories, J. California Cooper portrays the lives of African Americans, bringing to light the impact of history, social and economic hardship, and enduring cultural strengths on the experiences of individuals and families. The questions, discussion topics, suggested reading list, and author biography that follow are designed to enhance your group's discussion of her works, which range across time and place but share the passion, humor, and wisdom that mark J. California Cooper as one of the most original and engaging storytellers of our time.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Traditional Crafts of Saudi Arabia",
        "Authors": "By Topham, John",
        "Description": "",
        "Category": " Crafts & Hobbies , Reference",
        "Publisher": "Stacey International Publishers",
        "Price Starting With ($)": "27.5",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "THE GOOD APPRENTICE.",
        "Authors": "By Murdoch, Iris",
        "Description": "",
        "Category": "",
        "Publisher": "VIKING. NY 1986",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Inventing America: Jefferson's Declaration of Independence",
        "Authors": "By Wills, Garry",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Company",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "If Not Now, When?: Duty and Sacrifice in America's Time of Need",
        "Authors": "By Williams, Brian (FRW), Century, Douglas, and Jacobs, Jack",
        "Description": "A Medal of Honor recipient looks back at his own service in the Vietnam War—and ahead to America’s future.Jack Jacobs was acting as an advisor to the South Vietnamese when he and his men came under devastating attack. Wounded, 1st Lt. Jacobs took command and withdrew the unit, returning again and again, saving fourteen lives—for which he received the Medal of Honor.  Here, Col. Jacobs tells his stirring story of heroism, honor, and the personal code by which he has lived his life, and expounds with blunt honesty and insight his views on our contemporary world, and the nature and necessity of sacrifice.  If Not Now, When? is a compelling account of a unique life at both war and peace, and the all-too-often unexamined role of the citizenry in the service and defense of the Republic.",
        "Category": " History , Military , Wars & Conflicts (Other)",
        "Publisher": "Dutton Caliber",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Mickey Mouse Clubhouse: Animals",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Disney Publications International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Sounds Like Crazy",
        "Authors": "By Mahaffey, Shana",
        "Description": "Though she doesn't remember the trauma that caused it, Holly Miller has Dissociative Identity Disorder. Her personality has fractured into five different identities. There's the faceless Boy, the prayerful Silent One, the protective Sarge, the rotund Ruffles, and the high-maintenance Betty Jane. Together, they form the Committee. And, as much as they call make Holly's life hell, she can't live without them.In fact, her life is taking a turn for the better because of them. At the Manhattan diner where she works, Holly makes tips when Betty Jane's flirty Southern personality takes over. And now one of her customers wants Holly to do the voice (well, Betty Jane's voice) for the new animated television show his boss is developing. Betty Jane wants nothing more than to he in the spotlight. The rest of the Committee wants Betty Jane to shut up. Holly's therapist wants to get to the bottom of her broken psyche. And Holly? She's just along for the ride.",
        "Category": " Fiction , Women",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Dragon House",
        "Authors": "By Shors, John",
        "Description": "From the critically acclaimed author of Beneath a Marble Sky and Beside a Burning Sea—the new novel from “a master storyteller,”* set in contemporary Asia.From John Shors comes an unforgettable story of redemption set in modern-day Vietnam. Dragon House tells the tale of Iris and Noah—two Americans who, as a way of healing their own painful pasts, open a center to house and educate Vietnamese street children. In the slums of a city that has known little but war for generations, Iris and Noah befriend children who dream of nothing more than of going to school, having a home, and being loved. Learning from the poorest of the poor, the most silent of the unheard, Iris and Noah find themselves reborn. Resounding with powerful themes of suffering, sacrifice, friendship, and love, Dragon House brings together East and West, war and peace, and celebrates the resilience of the human spirit.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "SellPhotos.Com: Your Guide to Establishing a Successful Stock Photography Business on the Internet",
        "Authors": "By Engh, Rohn",
        "Description": "A guide to setting up a Web site that can be used to sell photos across the Internet. After a discussion of the basics of the Internet, the author discusses how to create the page, promote the site, and transact business. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Photography , Commercial",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Keys to Buying Foreclosed and Bargain Homes (Barron's Business Keys)",
        "Authors": "By Friedman, Jack P. and Harris, Jack C.",
        "Description": "Barron's Business Keys have gained deserved reputations as easy-to-read books of sound advice for consumers and non-experts. These brief, fact-filled volumes cut through business and financial jargon and speak to consumers in plain English. They offer information and advice on saving, investing, protecting one's assets, coping with taxes, and prudent management of personal finances. Updated to reflect the current real estate market, this book presents an informed view of the advantages and potential pitfalls connected with buying foreclosed and bargain properties. Various sources are described including lending institutions, the FHA, the Farmer's Home Administration, and others. There are valuable tips for buying at auction and for taking advantages of special programs such as urban homesteading.",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Classic Treasury of Silly Poetry",
        "Authors": "By Resnick, Jane Parker (EDT) and Gallup, Joan (ILT)",
        "Description": "Silly puns, nonsense stories, and jabberwocky fill the pages of a children's poetry collection that features the works of such authors as Rudyard Kipling, Edward Lear, and Mother Goose.",
        "Category": " Poetry , General",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Keys to Happiness: Steps to Christ",
        "Authors": "By Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Happiness Christian Ministries",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Covered Bridges of the South",
        "Authors": "By Allen, Richard Sande",
        "Description": "",
        "Category": "",
        "Publisher": "Random House~trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Painting Garden Decor with Donna Dewberry",
        "Authors": "By Dewberry, Donna S",
        "Description": "",
        "Category": " Crafts & Hobbies , Flower Arranging",
        "Publisher": "F & W Publications, Incorporat",
        "Price Starting With ($)": "6.13",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "I Am My Brother (Hallmark crown editions)",
        "Authors": "By Seymour, Peter S.",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark Cards",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Cooking with the Pennsylvania \"Dutch\": A collection of choice and tried old-time home and farm recipes",
        "Authors": "By Aurand, A. Monroe",
        "Description": "",
        "Category": "",
        "Publisher": "Aurand Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1946"
        }
    },
    {
        "Title": "Larryboy Versus the Volcano",
        "Authors": "By Peterson, Doug and Moore, Michael (ILT)",
        "Description": "When LarryBoy and his superhero buddies are invited to Superhero Island, they are in for a surprise of volcanic proportions. Trouble erupts when LarryBoy discovers he’s a second-class citizen, because he doesn’t have “super” powers like his buddies. Bumblyburg’s newest supervillain, Chili Pepper and his henchman Coconut, are cooking up a plot for disaster to destroy all superheroes.  Will Larryboy help after his vacation is ruined and his friends treat him poorly? Kids will enjoy the adventure of finding out as Larryboy tumbles into a secret hideaway and uncovers Chili Pepper’s tourist trap. But is it too late when the volcano explodes?Will LarryBoy save himself or will he save the day before the island is covered in hot, molten chili? How will Larryboy learn that everyone is important in God’s eyes, even after being excluded from his friends?",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "ZonderKidz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Origin of the Universe (Masters of Science)",
        "Authors": "By Barrow, John D.",
        "Description": "",
        "Category": "",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Fantastic Furniture: Intriguing Paint Techniques & Projects",
        "Authors": "By Baskett, Mickey",
        "Description": "All it takes is paint, a little time, and some inspired, quick, and easy decorative ideas to give old furniture a new lease on life--or transform unpainted pieces into works of art. These 29 ways to use stenciling, stamping, sponging, distressing, stippling, and glazing techniques will result in magnificent, strikingly original focal points for every room in the house.  Choose a style. Some are whimsical, bursting with color and fun details, like the \"busy bees\" that embellish a honey-colored cupboard. Others, including a Southern Magnolias Armoire, add a touch of old-fashioned romance. And still more are just right for a child. Information on choosing supplies, and on cleaning, stripping old paint, sanding, and preparing furniture, enable even beginners to get started instantly--and templates make tracing patterns simple. Complete these attractive designs as is...or adapt them to fit a variety of pieces and decors.  The author lives in Decatur, GA.  128 pages (all in color), 8 1/2 x 11. NEW IN PAPERBACK",
        "Category": " Art , General",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Caring for Your Aging Parents: When Love Is Not Enough",
        "Authors": "By Deane, B.",
        "Description": "In this warm and well-researched guide, author and caregiver Barbara Deane gives the emotional support and practical advice caregivers need to provide good care--and keep from burning out in the process.",
        "Category": " Family & Relationships , Eldercare",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Favorite Things (Disney Mickey Mouse Clubhouse)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Disney Publications International",
        "Price Starting With ($)": "4.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "A Star in the Breaking (Mcgee & Me! Series Vol 2)",
        "Authors": "By Focus on the Family",
        "Description": "",
        "Category": "",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Song to Demeter",
        "Authors": "By Birrer, Cynthia",
        "Description": "",
        "Category": "",
        "Publisher": "Lothrop, Lee & Shepard Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Granny's Fish Story.",
        "Authors": "By La Farge, Phyllis",
        "Description": "",
        "Category": "",
        "Publisher": "Parents' Magazine Press",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "February",
            "Year": "1977"
        }
    },
    {
        "Title": "Good Food, Good Mood: Treating Your Hidden Allergies",
        "Authors": "By Null, Gary and Feldman, Martin",
        "Description": "",
        "Category": " Health & Fitness , Allergies",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Best of O. Henry",
        "Authors": "By Henry, O.",
        "Description": "O. Henry's understanding of the ironies of life and the dreams and desires that move ordinary people to do extraordinary things is evident in a collection of twenty-six short stories that appeared originally in the New York World",
        "Category": " Literary Criticism , General",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The Best Basic & Easy Recipes of New England.",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Curteich",
        "Price Starting With ($)": "6.77",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Can You Find It in a Rain Forest",
        "Authors": "By Dee Phillips",
        "Description": "",
        "Category": "",
        "Publisher": "Unknown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Everyone's Hero: The Movie Storybook",
        "Authors": "By West, Tracey",
        "Description": "With the help of Screwie, a foul-mouthed ball, Yankee Irving must find Babe Ruth's missing bat Darlin' before the last out of the inning or the New York Yankees will lose the World Series.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Traditional Acupuncture: The Law of the Five Elements",
        "Authors": "By Connelly, Dianne M.",
        "Description": "",
        "Category": " Health & Fitness , Acupressure & Acupuncture",
        "Publisher": "Wisdomwell Press",
        "Price Starting With ($)": "9.56",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "ATLAS ICHTHYOLOGIQUE V 8 (Atlas of Fishes of the Dutch East Indies)",
        "Authors": "By Bleeker, Pieter",
        "Description": "",
        "Category": " Travel , Asia , General",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "24.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Saint Saul: A Skeleton Key to the Historical Jesus",
        "Authors": "By Akenson, Donald Harman",
        "Description": "The gospels, scholars agree, were written after the destruction of the Second Temple in 70 CE. This catastrophic event, argues Donald Akenson, forever altered the outlook--and the agenda--of the Christian and Jewish faiths. Of all the New Testament writings, only Paul's letters were composed before 70 CE. Thus, Akenson says, they are the only direct evidence we have that is untainted by this profound and lasting shift in perspective. And yet this most important source on the life of Jesus is also the most neglected.       In Saint Saul, Akenson offers a lively and provocative account of what we can learn about Jesus by reading the letters of Paul, providing fresh new insights into both Jesus and Paul. Akenson painstakingly recreates the world of Christ, a time rich with ideas, prophets, factions, priests, savants, and god-drunk fanatics. He insistently stresses throughout the Jewishness of Jesus (for example, referring to Jesus and Paul as Yeshua and Saul, as they were then known). Equally important, he dismisses the traditional method of searching for facts about Jesus by looking for parallels among the four gospels; they were handed down to us as a unit by a later generation, he argues. Saul, although he did not know Yeshua personally, knew his most important followers, and wrote immediately after Yeshua's death. Saul's teachings were approved (though sometimes reluctantly) by Yeshua's brothers and other early leaders.      As an eminent historian, Akenson approaches his subject with a fresh eye and a scholarly rigor that is all too rare in this hotly disputed field. The result is a vibrantly written and provocative book that will captivate anyone seeking to know more about the historical Jesus and the earliest Christians.",
        "Category": " Religion , Biblical Criticism & Interpretation , New Testament",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Horrible Harry Goes to the Moon",
        "Authors": "By Kline, Suzy, Remkiewicz, Frank (ILT), and Remkiewicz, Frank",
        "Description": "When Harry finds an ad in the paper for a used telescope, Miss Mackle suggests that the class raise money to buy it. The telescope will make their moon study unit even more exciting! Once they get the telescope, the class can have a nighttime moonwatch. But Harry wants to do more than watch the moon-he wants to go there! Can Harry really take a trip into outer space?   \"There's laughs aplenty in the short snappy text-just the thing to turn new readers on to books.\" (Booklist)",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "ATLAS ICHTHYOLOGIQUE V 4 (ATLAS OF FISHES OF THE DUTCH EAST INDIES)",
        "Authors": "By Bleeker, Pieter",
        "Description": "",
        "Category": "",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "49.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "ATLAS ICHTHYOLOGIQUE V 6",
        "Authors": "By Bleeker, Pieter",
        "Description": "",
        "Category": " Travel , Caribbean & West Indies",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "49.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "Cleopatra's Nose: Essays on the Unexpected",
        "Authors": "By Boorstin, Daniel J. and Boorstin, Ruth Frankel (EDT)",
        "Description": "The Pulitzer Prize-winning author of The Discoverers demonstrates the truth behind the aphorism that if Cleopatra's nose had been shorter, the face of the world would have been changed. Boorstin goes on to uncover the elements of accident, improvisation and contradiction at the core of American institutions and beliefs.",
        "Category": " Social Science , Sociology , Social Theory",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "ATLAS ICHTHYOLOGIQUE V 5",
        "Authors": "By Bleeker, Pieter",
        "Description": "",
        "Category": "",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "49.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Maui's Floral Splendor",
        "Authors": "By Kepler, Angela Kay",
        "Description": "",
        "Category": " Nature , Plants , General",
        "Publisher": "Mutual Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "ATLAS ICHTHYOLOGIQUE V 9",
        "Authors": "By Bleeker, Pieter",
        "Description": "",
        "Category": " Travel , Caribbean & West Indies",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "49.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "So That Your Values Live On: Ethical Wills and How to Prepare Them",
        "Authors": "By Riemer, Jack and Stampfer, Nathaniel (EDT)",
        "Description": "With this book, anyone, from any tradition, can write an ethical will.Words that come from the heart enter the heart.” Many of these wills come from plain ordinary fathers and mothers, yet they touch the hearts of all who read them. And so I suggest that you read these wills, and then that you try your hand at writing one of your own. If you do, you will leave a gift to the future, and the not-yet-born children of your children’s children will thank you and bless you for it.from the Introduction Ethical wills are precious spiritual documents, windows into the souls of those who write them. Those who write ethical wills—often parents writing letters to their children or grandparents to their grandchildren—try to sum up what they have learned in life, and what they want most for, and from, their loved ones. In this unique combination of “What Is” and “How To,” Riemer and Stampfer show how to prepare an ethical will and provide as guides examples of ethical wills written by almost 100 famous and ordinary people. This wide range of contemporary ethical wills reveals the ongoing relevance of ethical wills for people of all faiths, all backgrounds.",
        "Category": " Religion , Ethics",
        "Publisher": "Jewish Lights",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Are You Kidding Me?: The Story of Rocco Mediate's Extraordinary Battle with Tiger Woods at the US Open",
        "Authors": "By Feinstein, John and Mediate, Rocco",
        "Description": "The U.S. Open in June 2008 produced one of the most unexpected, dramatic, and memorable showdowns in golf history. Day after day, Rocco Mediate, a respected journeyman whose career had been dogged by injuries, pushed the seemingly invincible Tiger Woods to his physical and mental limits. Not even Mediate would ever have predicted that for five days, he would match the unbeaten world number one player, explosive shot for explosive shot.The first 72 holes ended with Mediate and Woods locked in a dead heat, and an 18-hole Monday playoff was required to decide a winner. When this was still not enough to break the tie, the two men went into a sudden-death round before a champion was finally crowned. Through each stage, the irrepressible Rocco rose to the ever-escalating pressure with clutch shots, grace, and humor, emerging as one of the most likable and intriguing golfers of our time.Now, at last, Rocco Mediate tells his own story: his life in golf, the battles to stay healthy enough to play, the everyday struggles of a tour player. It all leads up to his story of the Open, and the joy he felt as he seized the challenge he'd dreamed of and trained for his entire life. In this intimate collaboration with bestselling author John Feinstein, Rocco Mediate looks back at his life through the prism of the 2008 season and the life-changing tournament. And through interviews with Rocco's family, friends, and other top golfers, Feinstein vividly brings to life one of the most heroic golfing battles of all time.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "The One Year Devotions for Women on the Go (One Year Books)",
        "Authors": "By Arterburn, Stephen and Farrel, Pam",
        "Description": "Designed to encourage readers to spend time reading and meditating on the truth of God's Word, these brief devotions, based solidly in Scripture, are ideal for reading over morning coffee, waiting in the car for children after school, or anytime people “on the go” want to make the most of just a few minutes. These devotions will encourage men and women to meditate on God's Word daily, even in the midst of a busy, active schedule.",
        "Category": " Religion , Inspirational",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The Seasons of Rome: A Journal",
        "Authors": "By Hofmann, Paul",
        "Description": "Delving into the daily life of a city that is in so many ways larger than life, Paul Hofmann steers us beyond the tourist board, revealing a fetish for Vatican gossip, the idiosyncrasies of the gattare (cat women who care for the city's stray cats), and the vagaries of the ever-volatile Roman government. As he winds through Rome's ancient streets, we listen with him to the voices of the city, past and present, and we discover with him the intricacies and the beauty of Italy's finest city.",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Cambridge Companion to Shakespeare Studies (Cambridge Companions to Literature)",
        "Authors": "By Wells, Stanley",
        "Description": "The Cambridge Companion to Shakespeare Studies offers a comprehensive introduction to the study of Shakespeare in a series of essays specially written by an international team of eminent scholars. Studies of Shakespeare's life, and of his relationship to the thought of his time, are followed by essays connecting his writings to the literary, dramatic, and theatrical conventions of his age. There are accounts of the transmission of his text, and of the theatrical and critical fortunes of his plays from his own time to ours. Particular attention is given to the twentieth century in studies of criticism, theatre history, the plays on film and television, new critical approaches, and reference books. Each essay is followed by a reading list. A successor to Cambridge's original Companion to Shakespeare Studies (1934) and the New Companion to Shakespeare Studies (1971) this attractively written and helpfully organized volume will be an indispensable companion to anyone with a serious interest in Shakespeare.",
        "Category": " Drama , European , English, Irish, Scottish, Welsh",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "Bad Things Happen (David Loogan)",
        "Authors": "By Dolan, Harry",
        "Description": "A gripping novel about a man trying to escape his violent past and soon becomes a murder suspect when a publisher—and the husband of the woman he's having an affair with—turns up dead.The man who calls himself David Loogan is hoping to escape a violent past by living a quiet, anonymous life in Ann Arbor, Michigan. But when he's hired as an editor at a mystery magazine, he is drawn into an affair with the sleek blond wife of the publisher, Tom Kristoll—a man who soon turns up dead.Elizabeth Waishkey is the most talented detective in the Ann Arbor Police Department, but even she doesn't know if Loogan is a killer or an ally who might help her find the truth. As more deaths start mounting up—some of them echoing stories published in the magazine—it's up to Elizabeth to solve both the murders and the mystery of Loogan himself.\"Witty, sophisticated, suspenseful and endless fun...the best first novel I've read this year.\" —Washington Post \"A hypnotically readable novel, with...dialog worthy of Elmore Leonard.\"—Douglas Preston \"Fans of Peter Abrahams and Scott Turow will find a lot to like.\"—Publishers Weekly (starred review)",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Little Brother Moose",
        "Authors": "By Holman, Karlyn (ILT) and Kasperson, James",
        "Description": "Attracted by human civilization, Moss, a young moose, wanders into town and must find his way back to the wilds",
        "Category": " Juvenile Fiction , Science & Nature , General",
        "Publisher": "Dawn Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Cow of No Color: Riddle Stories and  Justice Tales from Around the World",
        "Authors": "By Zeitlin, Steven J., Jaffe, Nina, and Sherman, Whitney (ILT)",
        "Description": "In this outstanding multicultural collection from the authors of the prizewinningWhile Standing on One Foot, readers must try to outsmart evil kings, answer questions from Death, even puzzle with angels over the justice of God. Every tale returns to the most basic question: What is fair?With tales from Africa, Asia, and Europe, from Irish, Jews, and Muslims, from American schools and courtrooms,The Cow of No Color is truly an international gathering. Ranging from tricks to watch for in playground games to big issues to ponder for a lifetime, here is a book with insights and challenges for every member of every family.In this outstanding multicultural collection from the authors of the prizewinningWhile Standing on One Foot, readers must try to outsmart evil kings, answer questions from Death, even puzzle with angels over the justice of God. Every tale returns to the most basic question: What is fair?With tales from Africa, Asia, and Europe, from Irish, Jews, and Muslims, from American schools and courtrooms,The Cow of No Color is truly an international gathering. Ranging from tricks to watch for in playground games to big issues to ponder for a lifetime, here is a book with insights and challenges for every member of every family.",
        "Category": " Juvenile Nonfiction , Social Topics , Values & Virtues",
        "Publisher": "Henry Holt and Co. (BYR)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Gala!: The Special Event Planner for Professionals and Volunteers (Capital Ideas)",
        "Authors": "By Coons, Patricia and Baron, Lois M.",
        "Description": "If you are responsible for your organization's next big event - whether it is a black tie dinner, a political barbecue, a charity walk-a-thon, a celebrity speech, a school auction, a capital campaign, or a business launch to benefit your favorite cause - everything you need to know and do is in this easy-to-use book.    From this handy check-listed guide, you'll learn how to select an event to fit the cause, set your fund-raising goals, plan and execute the entire event using a month-by-month event calendar and checklists, develop an effective charity team to assist you all along the way with the duties of each defined, get media attention using sample public service announcements and great new promotion ideas, build contacts and network with the community and other organizations, find sponsors, prepare inviting invitations and programs, and critique your event and maintain support for the future.",
        "Category": " Reference , Etiquette",
        "Publisher": "Capital Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Millennium; A History of the Last Thousand Years",
        "Authors": "By Fernandez-Armesto, Felipe",
        "Description": "An Oxford scholar presents a genuine global history that spans ten centuries and combines two vantage points, one a sweeping vision that links times together and the other a smaller, more particular look at the things that made up world events. Reprint. 25,000 first printing.",
        "Category": " History , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "911 Beauty Secrets",
        "Authors": "By Irons, Diane",
        "Description": "",
        "Category": "",
        "Publisher": "Sourcebooks Inc+(il",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Colossus: The Price of America's Empire",
        "Authors": "By Ferguson, Niall",
        "Description": "Is America an empire? Certainly not, according to our government. Despite the conquest of two sovereign states in as many years, despite the presence of more than 750 military installations in two thirds of the world’s countries and despite his stated intention \"to extend the benefits of freedom...to every corner of the world,\" George W. Bush maintains that \"America has never been an empire.\" \"We don’t seek empires,\" insists Defense Secretary Rumsfeld. \"We’re not imperialistic.\"Nonsense, says Niall Ferguson. In Colossus he argues that in both military and economic terms America is nothing less than the most powerful empire the world has ever seen. Just like the British Empire a century ago, the United States aspires to globalize free markets, the rule of law, and representative government. In theory it’s a good project, says Ferguson. Yet Americans shy away from the long-term commitments of manpower and money that are indispensable if rogue regimes and failed states really are to be changed for the better. Ours, he argues, is an empire with an attention deficit disorder, imposing ever more unrealistic timescales on its overseas interventions. Worse, it’s an empire in denial—a hyperpower that simply refuses to admit the scale of its global responsibilities. And the negative consequences will be felt at home as well as abroad. In an alarmingly persuasive final chapter Ferguson warns that this chronic myopia also applies to our domestic responsibilities. When overstretch comes, he warns, it will come from within—and it will reveal that more than just the feet of the American colossus is made of clay.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Penguin Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "History of Europe",
        "Authors": "By J. M. Roberts",
        "Description": "",
        "Category": "",
        "Publisher": "Allen Lane - Penguin",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Ransomed Heart: A Collection of Devotional Readings",
        "Authors": "By Eldredge, John",
        "Description": "For millions of people, reading the writings of John Eldredge has been a deep and profound experience, generating a hunger to integrate his ideas and insights into their daily lives. Meeting that need in an innovative way, The Ransomed Heart features 365 daily readings gleaned from John's best-known works, including Wild at Heart, Captivating, Waking the Dead, The Journey of Desire, The Sacred Romance, and Epic. More than a daily devotional, this volume is a portable library that will prompt readers to soulful reflection and deeper intimacy with God.",
        "Category": " Religion , Spirituality",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Cosmos: An Illustrated Guide to Our Solar System and the Universe",
        "Authors": "By John and Goodwin, Simon Gribbin",
        "Description": "",
        "Category": "",
        "Publisher": "Magpie Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "100 Christian Women Who Changed the 20th Century",
        "Authors": "By Hosier, Helen Kooiman",
        "Description": "From Elizabeth Dole to Mary Kay, from Fanny Crosby to Annie Dillard, here is a century of women who made a difference. Great family reading.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Revell",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Progressive Revolution: How the Best in America Came to Be",
        "Authors": "By Lux, Michael",
        "Description": "This is an accessible book that delineates how progressives and the progressive movement have created the American idea and ideals and forged the kind of country in which we want to live. It creates a platform from which to argue how progressives today are fighting to improve America, in contrast to how conservatives have always worked to defend the interests of elites.Each chapter will tell the reader a story focusing on different subjects, such as efforts to enact civil rights laws, social security, the middle class, how the idea of America changed the world, and why most of us can vote.Lux points out what he feels the Democrats have done wrong during the last decades and how the lessons of history can point to making positives changes. Lux shows how the progressives have been instrumental in creating big positive change moments, and argues that as a new administration takes office in 2009 the time will be ripe for a new big change moment,. He outlines how he believes progressive policies can be channeled to solves the big problems facing us today.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "I WONDER - Reader",
        "Authors": "By Ruth K. Hobbs",
        "Description": "",
        "Category": "",
        "Publisher": "Christian Light Education",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Ce Concurrent Engineering: The Product Development Environment for the 1990s",
        "Authors": "By Carter, Donald E. and Baker, Barbara Stilwell",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Addison Wesley Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Time Management for Dummies (For Dummies (Lifestyles Paperback))",
        "Authors": "By Mayer, Jeffrey J.",
        "Description": "",
        "Category": "",
        "Publisher": "IDG Books Worldwide, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "When Television Was Young: The Inside Story With Memories by Legends of the Small Screen",
        "Authors": "By McMahon, Ed",
        "Description": "When television was young . . .Legendary movie producer Darryl Zanuck declared, \"People will soon get tired of staring at a plywood box every night.Before 5:30, there were only test patterns. Howdy Doody was the first show of the day.CBS agreed to put I Love Lucy on film only if Desi and Lucy paid part of the production fee. In return, CBS gave them ownership of the shows, including the right to rerun it forever.Kukla, Fran, and Ollie was the first network show broadcast in color.50,000 fans showed up in a New Orleans department store to meet Hopalong Cassidy.Movie studios would not let motion icture stars appear on television for fear that if people saw the stars on TV, they wouldn't go to the movies.Filled with fascinating stories, When Television Was Young is a hilarious, entertaining, behind-the-scenes look at the world of the small screen.",
        "Category": " Performing Arts , Television , History & Criticism",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    }
]