[
    {
        "Title": "Big Papi: My Story of Big Dreams and Big Hits",
        "Authors": "By Ortiz, David and Massaroti, Tony",
        "Description": "Raised in the Dominican Republic, signed by the Seattle Mariners, and released by the Minnesota Twins, David Ortiz landed in baseball-crazy Boston, of all places. Generally regarded as an underachiever to that point in his career, Ortiz blossomed into one of the most feared and adored sluggers in baseball while altering the course of the game's history, helping Boston win its first World Series in eighty-six years and thereby breaking the infamous \"Curse of the Bambino.\"Along the way, Ortiz established his place as a truly Ruthian figure in the annals of our national pastime: an imposing figure in the batter's box, yet an endearing man to the young, particularly in his native Dominican Republic, where he has focused his charitable efforts on improving the health of children. The son of two caring parents, and a loving father of three, Ortiz is a hero to many.Now, in his memoir, the man affectionately known as \"Big Papi\" recounts his life from growing up in an impoverished area of the Dominican Republic (where baseball is king) to his ascension in Boston (where he became one). Ortiz discusses, in detail, his historic and record-setting performances as a member of the Red Sox, his exploding popularity, the challenges of playing in Boston, and life in the Red Sox clubhouse.BIG PAPI is a unique memoir by a charismatic man who appeals to young and old, on the baseball field or off.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Remorseful Day (Inspector Morse Mysteries)",
        "Authors": "By Dexter, Colin",
        "Description": "For a year, the murder of Yvonne Harrison at her home in the Cotswold village of Lower Swinstead has baffled the Thames Valley CID. But one man has yet to tackle the case - and it is just the sort of puzzle at which Chief Inspector Morse excels.So why is he adamant that he will not lead the reinvestigation, despite two anonymous phone calls that hint at new evidence? And why, if he refuses to take on the case officially, does he seem to be carrying out his own private inquiries?When Sergeant Lewis learns that Morse was once friendly with Yvonne Harrison, he begins to suspect that the man who has earned his admiration, and exasperation, over so many years knows more about her death than he is letting on. When Morse finally does take over, the Investigation leads down highways and byways that are disturbing to all concerned.And then there is that final twist!",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Crown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Dogs of God",
        "Authors": "By Benedict, Pinckney",
        "Description": "",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Financial Survival In the Age of New Money",
        "Authors": "By WILLIAMS, Gordon",
        "Description": "Explains the causes of inflation, analyzes the Reagan administration's economic policies, and offers five rules for achieving personal prosperity",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "November",
            "Year": "1981"
        }
    },
    {
        "Title": "Is Bill Cosby Right?: Or Has the Black Middle Class Lost Its Mind",
        "Authors": "By Dyson, Michael Eric",
        "Description": "Nothing exposed the class and generational divide in black America more starkly than Bill Cosby’s now-infamous assault on the black poor when he received an NAACP award in the spring of 2004. The comedian-cum-social critic lamented the lack of parenting, poor academic performance, sexual promiscuity, and criminal behavior among what he called the “knuckleheads” of the African-American community. Even more surprising than his comments, however, was the fact that his audience laughed and applauded.Best-selling writer, preacher, and scholar Michael Eric Dyson uses the Cosby brouhaha as a window on a growing cultural divide within the African-American community. According to Dyson, the “Afristocracy”—lawyers, physicians, intellectuals, bankers, civil rights leaders, entertainers, and other professionals—looks with disdain upon the black poor who make up the “Ghettocracy”—single mothers on welfare, the married, single, and working poor, the incarcerated, and a battalion of impoverished children. Dyson explains why the black middle class has joined mainstream America to blame the poor for their troubles, rather than tackling the systemic injustices that shape their lives. He exposes the flawed logic of Cosby’s diatribe and offers a principled defense of the wrongly maligned black citizens at the bottom of the social totem pole. Displaying the critical prowess that has made him the nation’s preeminent spokesman for the hip-hop generation, Dyson challenges us all—black and white—to confront the social problems that the civil rights movement failed to solve.",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Civitas Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Soft Edge:Nat Hist&Future Info",
        "Authors": "By Levinson, Paul",
        "Description": "The Soft Edge is a one-of-a-kind history of the information revolution. In his lucid and direct style, Paul Levinson, historian and philosopher of media and communications, gives us more than just a history of information technologies. The Soft Edge is a book about theories on the evolution of technology, the effects that human choice has on this (r)evolution, and what's in store for us in the future.Paul Levinson's engaging voice guides us on a tour that explains how communications media have been responsible for major developments in history and for profound changes in our day-to-day lives. Levinson presents the intriguing argument that technology actually becomes more human. We see how information technologies are selected on the basis of how well they meet human needs. Why is email more like speech than print is? Why didn't the arrival of television destroy the radio? These and many more thought provoking questions are answered in The Soft Edge.Boldly extending and deepening the pathways blazed by McLuhan, Paul Levinson has provided us with a brilliant and exciting study of life with our old media, our new media, and the media still to come.",
        "Category": " Technology & Engineering , Industrial Technology",
        "Publisher": "Routledge",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Dawning of Deliverance (The Russians) (Book 5)",
        "Authors": "By Pella, Judith",
        "Description": "Arriving in Port Arthur to serve as a nurse during the Russo-Japanese War, Mariana Remizov meets American war correspondent Daniel Trent, while Anna tries to raise two sons in the light of Sergei's highly scrutinized revolutionary involvements. Original.  IP.",
        "Category": " Fiction , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Secret Place of Thunder (Cheney Duvall, M.D. Series #5)",
        "Authors": "By Morris, Gilbert and Morris, Lynn",
        "Description": "A disturbing letter from her great-aunts has brought Cheney Duvall to their indigo plantation outside of New Orleans, but what she and Shiloh Irons discover is much more serious and dangerous than they imagined",
        "Category": " Fiction , Historical",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Miami",
        "Authors": "By Booth, Pat",
        "Description": "Christa Kenwood opens a modeling agency in Miami, bagging three top clients--supermodel Lisa Rodriguez, photographer Steve Pitts, and perfumer Mary McGregor--in a multimillion-dollar deal that could make her the target of love and vengeance",
        "Category": " Fiction , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Hold Your Horses: Nuggets of Truth for People Who Love Horses...No Matter What (Gift book for adult horse-lovers)",
        "Authors": "By Timmons, Bonnie",
        "Description": "Celebrate the mysterious bond between horse and horse-lover. The pleasure of whoa. The surprise of the “unscheduled dismount.” And why, when jumping, to throw your heart over first. Drawing on her lifelong passion for horses and riding, award-winning artist Bonnie Timmons offers up a book full of whimsy and wisdom and a huge helping of giddy up. These are the truths as recorded by an astute observer: Of little girls who spend every minute after school mucking out the barn in hope of one trail rideOf the mechanics of riding: the walk, the trot, the canter, the gallop—a gait so fast your worries can’t keep upOf English vs. Cowboy-speak. Of Outfits and Accessories, and Good Horse-Keeping Tips, (including how to weigh your horse so you know how much to feed him: 1. Weigh yourself. 2. Weigh yourself holding your horse. 3. Subtract 1. from 2.)And finally, of knowing at the end of the day that when you hold your hoses, they will hold you right back",
        "Category": " Pets , Horses",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Keep Your Hands Off My Orangutan! (Zoey & Me)",
        "Authors": "By Tarcher, Mallory",
        "Description": "When Zoey turns one-year-old, a faraway zoo comes to claim her, but Molly gets suspicious of the nasty zookeeper, and discovers that she is planning to put Zoey in a traveling show",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Out to Lunch #2 (Katie Kazoo, Switcheroo)",
        "Authors": "By Krulik, Nancy E.",
        "Description": "It's been a couple of weeks since Katie turned into the class hamster, and she's beginning to hope that maybe her transforming days are through. But more excitement lies ahead for Katie as she becomes Lucille, the cafeteria lunch lady! Unfortunately, the principal isn't too happy with a lunch lady who throws egg salad and starts food fights. . . so it's up to Katie (back in her own body) and her classmates to save the day.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Oswald's Tale: An American Mystery",
        "Authors": "By Mailer, Norman",
        "Description": "In this book, Norman Mailer asks the essential question about the assassination of JFK: not \"Who killed Kennedy?\" but \"Who was Oswald?\" for only by answering the latter question can we hope to answer the first. In 1959, Lee Harvey Oswald defected to the Soviet Union and was sent to Minsk, where he lived for two and a half years and remained under constant KGB surveillance, on suspicion of being a CIA agent. In 1993, Norman Mailer spent six months in Russia, where he interviewed Oswald's former friends and sweethearts and obtained exclusive interviews with the KGB officers assigned to monitor Oswald's every move. He was also given exclusive access to the KGB files on Oswald, including transcripts of conversations overheard in the apartment that Lee shared with his Russian wife, Marina.In Oswald's Tale: An American Mystery, Mailer reconstructs the life of this ambitious if doom-laden young man, giving a full account for the first time not only of the Minsk years, a hitherto uncharted period in Oswald's life, but also of Oswald's disastrous childhood, his years in the Marine Corps, and the events leading from his return to the United States in 1961 to his death in Dallas in 1963. The portrait of Oswald that emerges will greatly surprise readers who have thought of Oswald as a hapless loner: socially awkward, inarticulate, and an unremarkable loser.",
        "Category": " Social Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "U.S. oil pipe lines: An examination of how oil pipe lines operate and the current public policy issues concerning their ownership",
        "Authors": "By Wolbert, George S",
        "Description": "",
        "Category": "",
        "Publisher": "American Petroleum Institute",
        "Price Starting With ($)": "41.75",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Complete Idiot's Guide(r) to Human Resource Management",
        "Authors": "By Pell, Arthur R.",
        "Description": "You’re no idiot, of course. You know that your employees are essential to your company’s success. But when it comes to training, motivating, hiring, and firing them, you feel like a few of the many hats you wear don’t fit as well as they should.    Don’t outsource your HR function just yet! The Complete Idiot’s Guide® to Human Resource Management will simplify everything you need to know about the people business.  In this Complete Idiot’s Guide®, you learn:                --How to locate, hire, and retain the most qualified people for positions.                --What you need to know about the law and regulations to avoid costly legal battles.                --How to organize and administer an effective compensation and benefits plan.                --Training tools and techniques to boost employee motivation and performance.",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Frommer's 96 Frugal Traveler's Guides: London from $60 a Day (Serial)",
        "Authors": "By Wood, Marilyn",
        "Description": "Provides information on travel, accommodations, restaurants, and activities",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "Frommer",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Merriam-Webster's Concise Handbook for Writers",
        "Authors": "By Merriam-Webster",
        "Description": "\"An essential tool for improving writing skills. Covers punctuation, capitalization, plurals, and more. Includes information on copyediting and proofreading. Filled with examples for quick comprehension.\"",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Merriam-Webster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Lose Your Mummy Tummy",
        "Authors": "By Gould, Jodie and Tupler, Julie",
        "Description": "Pregnancy naturally separates a mother's outermost abdominal muscles to make room for her growing uterus. Called a diastasis, this separation doesn't fully close up in 98 percent of new moms. The larger the diastasis, the weaker the muscles and the greater chance for mom to develop back problems down the road. Of perhaps greater concern for moms, new and veteran alike, the larger the diastasis, the bigger the belly that just won't seem to go away after baby's delivery!Lose Your Mummy Tummy introduces the Tupler Technique, a set of deceptively simple abdominal and breathing exercises that decrease the diastasis and result in a firmer, flatter, and stronger belly. Like Kegels-those all-important and privately-practiced pregnancy exercises-the Tupler Technique can be practiced almost anywhere and at anytime. Including illustrations for a 15 or a 30-minute at-home exercise routine, Lose Your Mummy Tummy ensures: A tighter, flatter stomach A smaller waistline A reduction or elimination of back pain The ability to safely lift your baby and heavy objects More energy Better posture The perfect preparation for your next pregnancy",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Index to the Map of the City and County of Baltimore: 1850",
        "Authors": "By Dawn Beitler Smith",
        "Description": "",
        "Category": "",
        "Publisher": "Westminster, MD: Family Line Publications",
        "Price Starting With ($)": "11.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Old Flames (The Inspector Troy Novels, 1)",
        "Authors": "By Lawton, John",
        "Description": "It is April 1956 at the height of the Cold War: Khrushchev and Bulganin, leaders of the Soviet Union, are in Britain on an official visit. Chief Inspector Troy of Scotland Yard, son of a distinguished Russian emigre, is assigned to be Khrushchev's bodyguard and to spy on him. Soon after, a Royal Navy diver is found dead and mutilated beyond recognition in Portsmouth Harbor. What was he doing under the hull of Khrushchev's ship and who sent him there? Is the corpse that of Arnold Cockerell, a furniture salesman with a mysterious source of income and a bizarre fetish for scuba gear, or did Cockerell fake his own death to escape an unknown nemesis? And what did Khrushchev mean when he leaned over at the dinner table and whispered, \"Do It\"?Troy embarks on an investigation that takes him to the rotten heart of MI6, to the distant days of his childhood, and into the dangerous arms of an old flame, Larissa Tosca, late of the U.S Army, later still of Khrushchev's KGB. As the mystery of Cockerell deepens - was he a spy or a red herring? agent or double agent? - inexplicable murders begin following Troy wherever he goes, and now they are getting closer and closer to home.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Atlantic Monthly Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "What Matters Most: A Novel",
        "Authors": "By Rice, Luanne",
        "Description": "With every New York Times bestseller, Luanne Rice illuminates yet another of the secret wonders of the heart. Her unforgettable evocations of family, friendship, and loves lost and won in such novels as The Edge of Winter, Sandcastles, and Summer of Roses give voice to our most powerful emotions. Now she brings back two of her most beloved characters to tell of their journey across the sea to unravel the mysteries of a shared past—and two undying love affairs.…What Matters MostSister Bernadette Ignatius has returned to Ireland in the company of Tom Kelly to search for the past—and the son—they left behind. For it was here that these two long-ago lovers spent a season of magic before Bernadette’s calling led her to a vocation as Mother Superior at Star of the Sea Academy on the sea-tossed Connecticut shore. For Tom, Bernadette’s choice meant giving up his fortune and taking the job as caretaker at Star of the Sea, where he could be close to the woman he could no longer have but whom he never stopped loving. And while one miracle drew them apart, another is about to bring them together again.For somewhere in Dublin a young man named Seamus Sullivan is also on a search, dreaming of being reunited with his own first love, the only “family” he’s ever known. They’d been inseparable growing up together at St. Augustine’s Children’s Home, until Kathleen Murphy’s parents claimed her and she vanished across the sea to America. Now, in a Newport mansion, that very girl, grown to womanhood, works as a maid and waits with a faith that defies all reason for the miracle that will bring back the only boy she’s ever loved.That miracle is at hand—but like most miracles, it can come only after the darkest of nights and the deepest of heartbreaks. For life can be as precarious as a walk along a cliff, and its greatest rewards reached only by those who dare to risk everything…for what matters most.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Center of The Storm",
        "Authors": "By Harris, Katherine",
        "Description": "The battle for the White House following the election of November 7, 2000, was arguably one of the biggest controversies in U.S. history. And one woman stood at the center of the storm-Katherine Harris, Florida's secretary of state.As the Florida recount unfolded in a maze of bizarre events, Harris was faced with the challenge of a lifetime. What enabled her to maintain her integrity, stick by her guns, and hold true to her principles? Here she tells all.In Center of the Storm, Harris discusess the behind-the-scenes negotiations and backroom bartering that everyone suspected, but no one dared disclose. Through never-told-before anecdotes, she reveals seventeen essential skills that helped her not just survive but thrive. She clearly illustrates how we, too, can learn these skills that will help us in times of crises.",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "WND Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Twilight",
        "Authors": "By Heitzmann, Kristen",
        "Description": "Returning to her hometown was the last thing Laurie ever expected. But with two children in tow, she must begin anew... and face the life--and man--she turned her back on. Cal has been struggling with his own problems, but the arrival of Laurie brings new hope and meaning to his life. Can he push aside his feelings to simply be the friend she desperately needs? And when the dangers of her hidden past threaten, can Cal overcome the haunting memories of his own past failures to rescue the only woman he's ever loved?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Inner Circles: How America Changed the World : A Memoir",
        "Authors": "By Haig, Alexander Meigs",
        "Description": "To a degree virtually unmatched by any other American of his time, Alexander M. Haig, Jr. has participated in an astounding range of historical events. Among them: the Korean War, Vietnam, the Secret War against Castro's Cuba, Watergate, Nixon's establishment of diplomatic relations with China, the events surrounding the tragic death of John F. Kennedy, and the attempted assassination of Ronald Reagan.Now Alexander Haig, the man who served six U.S. presidents, presents a fiery, fascinating portrait of these events in the order that they occurred in his life, from his post as a young Army staff officer under MacArthur and combat in Korea to his rise inside the White House, to his stormy career as Richard Nixon's last Chief of Staff and his years as a Supreme Commander of NATO. In the process, Haig unravels mysteries and misperceptions of much of recent America and world political history and those who helped make it, from presidents to apparatchiks.Looking back at a career filled with controversy and honors, Haig draws provocative conclusions about American policy successes and failures. Looking ahead, he challenges the current crop of American politicians to improve our record in international affairs and makes specific recommendations by solving the most pressing issues at home, including urban decay and the budget deficit.In a dramatic, blow-by-blow account of Watergate Haig gives new and fascinating commentary on such key elements as the \"Saturday Night Massacre,\" the Nixon tap, and \"Deep Throat.\" In addition, he provides the most thorough, fascinating portrait yet of Nixon himself during that time - why the essentially reclusive President made the decisions he did, and how he was both served and sabotaged by those around him.Inner Circles gives unforgettable insights into the towering figures of Haig's career, including Lyndon Johnson, whose inferiority complex about the Kennedys led to a mismanagement of the Vietnam situation, Henry Kissinger, and such other dramatis personae as General MacArthur, Robert McNamara, George F. Kennan, Spiro Agnew, Leonid Brezhnev, Golda Meir, Le Duc Tho, and Anwar Sadat.Some of the many revelations Haig makes in this book are: evidence the government had in 1963 that Castro, who rightfully felt he was at war with the Kennedys, had been involved in the JFK assassination; a bizarre meeting between Kissinger and J. Edgar Hoover over the issue of leaks and wiretapping; the astounding indecision that gripped the Oval Office during the Gulf of Tonkin affair, and how Washington's failure to order the rescue of a downed U.S. flier would serve as a symbol of future U.S. strategy in Vietnam; and a remarkable conversation with Zhou Enlai in 1972, in which the Communist Chinese leader told Haig: \"Do not lose in Vietnam.\"A memoir, a study of diplomacy, a story of history in the making, and a book of rare frankness about the way the United States government really works, Inner Circles shows world leaders as they are behind closed doors. Most of all, it helps Americans understand how honorable and sometimes less-than honorable men and women come together, clash, form alliances, and shape the policies that change our lives.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Promise Remains",
        "Authors": "By Thrasher, Travis",
        "Description": "The Promise Remains is a heartrending story about a young couple, long separated, who find their way back to each other, along the way learning about God's provision in the face of their own doubts and fears. A contemporary setting with great character development. The first novel from a promising new author.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Tyndale House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Joan of Arc (Wishbone Classics #4)",
        "Authors": "By Twain, Mark, Yingling, Kathryn (ILT), Parker, Ed (ILT), and Selene, Patrice",
        "Description": "When a peasant girl named Joan leads the French in a battle against brutal English invaders, powerful men convince her followers that she is not a hero but instead a witch who must be destroyed, and she must fight the battle for her life alone. Original.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "HarperEntertainment",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "First They Killed My Father: A Daughter of Cambodia Remembers",
        "Authors": "By Ung, Loung",
        "Description": "Until the age of five, Loung Ung lived in Phnom Penh, one of seven children of a high-ranking government official.She was a precocious child who loved the open city markets, fried crickets, chicken fights, and sassing her parents. When Pol Pot's Khmer Rouge army stormed into Phnom Penh in April 1975, Ung's family was forced to flee their home and hide their previous life of privilege. Eventually, they dispersed in order to survive. Loung was trained as a child soldier in a work camp for orphans while her other siblings were sent to labor camps. Only after the Vietnamese destroyed the Khmer Rouge were Loung and her surviving siblings slowly reunited.Bolstered by the shocking bravery of one brother and sustained by her sister's gentle kindness amid brutality, Loung forged ahead to create a courageous new life. Harrowing yet hopeful, insightful and compelling, this family's story is truly unforgettable.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Court",
        "Authors": "By Walker, Elizabeth",
        "Description": "The four highly visible, much-talked-about Hellyn children, heirs to their crumbling family edifice, The Court, struggle with their own, individual problems while trying to save their ancestral home",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Football Hall of Shame 2",
        "Authors": "By Nash, Bruce and Zullo, Allan",
        "Description": "This second compilation of football's most embarrassing moments records the most outrageous blunders made by players, owners, managers and fans",
        "Category": " Sports & Recreation , General",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Ethnicity and Family Therapy (The Guilford Family Therapy Series)",
        "Authors": "By McGoldrick, Monica (CON)",
        "Description": "",
        "Category": " Psychology , Psychotherapy , Couples & Family",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "Against Our Will : Men, Women, and Rape",
        "Authors": "By Brownmiller, Susan",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The God Catchers Experiencing The Manifest Presence Of God",
        "Authors": "By Tenney, Tommy",
        "Description": "Why do some believers experience genuine, life-changing, personal revival while others don't? In The God Catchers, the sequel to the phenomenalThe God Chasers, Tommy explains the difference: \"God in a sense plays hide and seek. But like a loving parent, He always makes sure He can be found by those who take the time to look.\" Simply put, those who earnestly seek God rather than wait for something to happen find Him. Full of biblical and contemporary accounts of believers who chased God and caught Him, The God Catchers will motivate readers to discover the joy of finding God and having a loving relationship with Him.",
        "Category": " Religion , Christianity , Pentecostal & Charismatic",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "God's Eye View: Worshiping Your Way To A Higher Perspective",
        "Authors": "By Tenney, Tommy",
        "Description": "In God's Eye View, Tommy Tenney explores how worship lifts us up to see the trouble we face from God's perspective instead of being trapped in an earthly, time-bound viewpoint. The higher we go, the smaller our problems seem. Tenney also teaches the Principle of Magnification: The closer you get to something, the bigger it appears. In other words, worship not only \"shrinks\" our problems; it also magnifies God in our lives and to others.Worship doesn't really change our problems; it just minimizes their influence over us as we focus on God. He doesn't promise to remove all of our circumstances, but God does assure us that in His presence and from His perspective--we can see things as they really are and not how they appear to be.In the book of Revelation John was instructed to \"behold the Lion,\" but from an earthly perspective John saw only the Lamb. The heavenly perspective reveals that the Lamb is the Lion, the babe of Bethlehem is the \"ancient of days,\" and the dragon is really a weakened lizard. God's eye view is higher than man's.Higher than a bird's eye view, higher than a man's eye view is God's eye view.",
        "Category": " Religion , Christianity , Pentecostal & Charismatic",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Last Trout in Venice: The Far-Flung Escapades of an Accidental Adventurer",
        "Authors": "By Lansky, Doug",
        "Description": "With a bottomless taste for the absurd, Doug Lansky takes the reader on a global odyssey. In Naples, reputedly the world’s worst place to drive, Lansky rents a car. In Berlin, he dons a latex jumpsuit and spiked collar for a visit to the notoriously erotic Kit Kat Club. And in Tokyo, determined to deepen his appreciation for sumo wrestling, Lansky takes lessons from a master and rediscovers how it feels to be lifted into the air by a wedgie. Other adventures include climbing Mount Kilimanjaro in ill-fitting hiking boots, competing with the mobs to get picked for The Price Is Right, and tandem hang gliding with a daredevil pilot in New Zealand.",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "Travelers' Tales",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "There's a (Slight) Chance I Might Be Going to Hell: A Novel of Sewer Pipes, Pageant Queens, and Big Trouble",
        "Authors": "By Notaro, Laurie",
        "Description": "The first novel from the New York Times bestselling author of The Idiot Girls’ Action-Adventure Club is a rollicking tale of small-town peculiarity, dark secrets, and one extraordinary beauty pageant.When her husband is offered a post at a small university, Maye is only too happy to pack up and leave the relentless Phoenix heat for the lush green quietude of Spaulding, Washington. While she loves the odd little town, there is one thing she didn’t anticipate: just how heartbreaking it would be leaving her friends behind. And when you’re a childless thirtysomething freelance writer who works at home, making new friends can be quite a challenge.After a series of false starts nearly gets her exiled from town, Maye decides that her last chance to connect with her new neighbors is to enter the annual Sewer Pipe Queen Pageant, a kooky but dead-serious local tradition open to contestants of all ages and genders. Aided by a deranged former pageant queen with one eyebrow, Maye doesn’t just make a splash, she uncovers a sinister mystery that has haunted the town for decades.“[Laurie Notaro] may be the funniest writer in this solar system.”–The Miami Herald",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Storms in Space",
        "Authors": "By Freeman, John W.",
        "Description": "Imagine what an extra-terrestrial Weather Channel would be like, with a professional space weatherman as your forecaster, and you get rather close to the astounding aspects of nature described in John Freeman's Storms in Space. Known only to a handful of space scientists, yet capable of disrupting technical systems as extensive as communication satellites and electric power grids  Storms in Space is the first book to unveil the unseen elements of outer space.    Opening with a series of vignettes (describing how the Northern and Southern lights [the aurora] are a visible manifestation of space storms, or how satellites serve as weather stations in space), Freeman provides visual analogies to help illustrate the effects of a storm in space on people. These vignettes explore the chain of events that lead to the storm and to connect the facets of the storm with the scenes in the vignettes. Freeman details the state of the art in forecasting space storms, the models that are used, and the prospects for their future improvement.  He also describes the hazards of space storms for human technological systems including human space flight.  Storms in Space provides both a new understanding and appreciation of how seemingly insignificant disturbances out there can have major effects right here.   John W. Freeman is Professor Emeritus and Research Professor of Physics and Astronomy at Rice University.  Over the past 35 years he has directed a number of satellite instrumentation projects, including the Apollo 12, 14, and 15 projects for which he was awarded the NASA Medal for Exceptional Scientific Achievement (1973).  He has also served as Editor-in-Chief of Space Power.  Freeman is currently working to develop a model that will forecast the intensity of the Van Allen Radiation Belts and helping to build a National Space Weather Service.",
        "Category": " Science , Earth Sciences , General",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Body Sculpting Bible For Abs: Women's Edition",
        "Authors": "By Villepigue, James C. and Peck, Peter Field (PHT)",
        "Description": "Outlines a training and nutrition program specifically for women designed to strengthen and smooth the abdominal muscles, provides instructions for a variety of exercises, and lays out a schedule of workouts.",
        "Category": " Health & Fitness , Exercise , General",
        "Publisher": "Hatherleigh Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Reconstructing America: The Symbol of America in Modern Thought",
        "Authors": "By Ceaser, James W.",
        "Description": "For too many people, America has become the primary symbol of all that is grotesque, deadening, and oppressive?or, as Heidegger once put it, the \"emerging monstrousness of modern times.\" This image of a degenerate America, constructed by European intellectuals, has been gradually accepted within the United States, for America is now under siege by its own philosophers, literary critics, and postmodern thinkers. It is time, says James Ceaser in this provocative book, to take America back, to reaffirm confidence in our principles, and to remind ourselves that the real Americas opposed to the symbolic one has forged a system of liberal democratic government that has shaped the destiny of the modern world.With wit and passion, Ceaser traces the origins of the negative images of America, beginning with French scientists in the middle of the eighteenth century who viewed the country as a land of racial and physical degeneracy, and continuing with German thinkers from Hegel to Nietzsche, Spengler, and Heidegger, who viewed America as culturally inferior and a technological wasteland. Ceaser puts these critics of America in a dialogue with the country’s defenders?among them Alexander Hamilton, Alexis de Tocqueville, and Leo Strauss. By revealing the sources of the hostility to America, Ceaser undermines the position of its present attackers. He contends that only if we reassert political science rather than cultural and literary criticism as the proper intellectual discipline to direct politics will we free the real America from the symbolic America and vindicate its name.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "1900",
        "Authors": "By West, Rebecca Dame",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Guitar Method 1 (Belwin's 21st Century Guitar Library)",
        "Authors": "By Warner Bros.",
        "Description": "This innovative guitar method contains all styles of music including rock, pop, folk and classical. Tablature is used as an aid in learning new material, and suggested accompaniment parts enable the teacher and student to play together. The unique Rock Workshop sections teach rock rhythm and lead guitar styles and are correlated to the Guitar Rock Shop books. Available with or without a play-along recording. Book 1 includes reading music in first position, all basic chords, strumming, eighth note rhythm, power chords, the blues form, basic rock rhythm, guitar techniques, and pop songs such as: Surfin' Safari * Blue Eyes Crying in the Rain * Old Time Rock and Roll.",
        "Category": " Music , Printed Music , General",
        "Publisher": "Alfred Music",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Theory : Level Three (Bastien Piano Basic Wp208)",
        "Authors": "By Bastien, Jane",
        "Description": "",
        "Category": "",
        "Publisher": "Kjos Music Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "A Case of Two Cities: An Inspector Chen Novel (Detective Inspector Chen Novels)",
        "Authors": "By Qiu, Xiaolong",
        "Description": "Chief Inspector Chen Cao of the Shanghai Police Bureau is increasingly seen as a man on the rise - he is a poet with a popular new collection, a Party cadre recently appointed to the city congress, and a respected police inspector. But appearances can't always be trusted.When a major new anti-corruption campaign is announced at the highest levels, Inspector Chen is summoned by an official of the Party to take the lead in a high-profile case, one in which the principal figure, Xing Xing, and his family have long since fled to the United States and beyond the reach of the Chinese government. But Xing left behind his organization, and Chen is charged with uncovering his connections and partners, and is authorized to take whatever means he has to to end the corruption ring. The assignment is potentially dangerous - a detective working on the case in Fujian was found dead in embarrassing and suspicious circumstances - and one that could have disastrous consequences for Chen, his friends, and his family.In a twisting case that takes him from Shanghai all the way to the U.S., reuniting him with his colleague and counterpart from the U.S. Marshall's Service, Inspector Catherine Rhon, Chen finds himself at odds with hidden, powerful, and vicious enemies.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Pritikin Weight Loss Breakthrough: Five Easy Steps to Outsmart Your Fat Instinct",
        "Authors": "By Pritikin, Robert",
        "Description": "In The Pritikin Weight Loss Breakthrough, Robert Pritikin, director of the Pritikin Longevity Center, reveals why even the most health-conscious of us has trouble resisting foods high in fat and cholesterol. It is not self-indulgence or lack of willpower. It is a genetic key called the \"fat instinct.\" Understanding our biological programming is the first step in conquering fad diets and leading healthier lives. In this breakthrough book, Pritikin explains how the fat instinct develops, the unique behaviors it triggers, and how it defeats our efforts to lose weight and promote healthy eating habits by making us crave the wrong kinds of food.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "America Alone: The Neo-Conservatives and the Global Order",
        "Authors": "By Clarke, Jonathan and Halper, Stefan",
        "Description": "George W. Bush's election and the confusion and fear that followed Sept. 11, 2001, combined to allow a small group of radical intellectuals to seize control of US national security policy. Foreign policy experts Halper (Cambridge U.) and Clarke (Cato Institute)--mainstream Republicans and former cold warriors--show how an inexperienced president was persuaded to abandon his campaign pledges and the bipartisan diplomacy that had managed the Soviet threat for half a century and adopt a neo-conservative foreign policy emphasizing military confrontation and \"nation building.\" The costs, the authors argue, have been great and the benefits few. Their analysis lays out how incremental changes have created a huge shift in just a few years, and why the casualty is America's moral authority. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , American Government , General",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Take Care of Yourself : Center for Corporate Health",
        "Authors": "By Vickery",
        "Description": "",
        "Category": "",
        "Publisher": "Mass & Calif: Addison Wesley",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "How to Be a Gentleman: A Contemporary Guide to Common Courtesy",
        "Authors": "By Bridges, John",
        "Description": "Should you take a business call on your cellular phone during a dinner date? How do you act at a funeral? What is the best way to accept a compliment? When do you say, \"I'm sorry\"? John Bridges answers these questions and more in a book for men that combines Emily Post and Miss Manners without being snobbish, boring, or intimidating. This book is an indispensable guide for men of all ages who aspire to become gentlemen.",
        "Category": " Reference , Etiquette",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Einstein: A Life",
        "Authors": "By Brian, Denis",
        "Description": "Blends the brilliance of the scientific genius with the compassion, playfulness, and wit of the private figure  \"A fascinating read with more interesting material about Einstein as a human being than I have ever seen before.\"--Robert Jastrow, astrophysicist and bestselling author  \"A thoughtful and captivating account of one whom I had the joy of knowing and loving.\"--George Wald, Nobel Prize Laureate  His face is one of the most recognized on the planet. His very name is synonymous with genius. Yet, for all the attention and countless biographies, our images of Albert Einstein rarely go beyond the eccentric and larger-than-life scientist unraveling one cosmic mystery after another.  In this engaging popular biography, Denis Brian draws on a wealth of new information recently opened to the public to bring us a broader, more authentic portrait of Einstein than previously available. The first full-scale Einstein life published in 20 years, it is also the first to integrate Einstein's genius with his private and public life to give us a complete impression of the real person.  We meet an Einstein with a gift for friendship, a romantic with a roving eye for women. We confront a man whose countless scientific triumphs were tempered by tragic ironies in his personal life. We encounter Einstein the humanist who showed compassion for the children of others yet neglected his own sons. We learn from his former assistants how they revered Einstein, how he worked at his science, and of his warm relationships with other physicists.  Based on information drawn from new access to the Einstein archives as well as exclusive interviews with colleagues and friends, Einstein: A Life reveals an endearing and sensititve man, but one slightly detached from even those closest to him, as if he inhabited his own world of lofty thoughts and cosmic dreams.  DENIS BRIAN (West Palm Beach, Florida) is the author of The True Gen: An Intimate Portrait of Hemingway by Those Who Knew Him and Genius Talk: Conversations with Nobel Scientists and Other Luminaries.",
        "Category": " Biography & Autobiography , Science & Technology",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Awakening and Selected Short Stories (Bantam Classics)",
        "Authors": "By Chopin, Kate",
        "Description": "First published in 1899, this beautiful, brief  novel so disturbed critics and the public that it  was banished for decades afterward. Now widely read  and admired, The Awakening has  been hailed as an early vision of woman's  emancipation. This sensuous book tells of a woman's  abandonment of her family, her seduction, and her  awakening to desires and passions that threated to  consumer her. Originally entitled \"A Solitary  Soul,\" this portrait of twenty-eight-year-old  Edna Pontellier is a landmark in American fiction,  rooted firmly in the romantic tradition of Herman  Melville and Emily Dickinson. Here, a woman in  search of self-discovery turns away from convention and  society, and toward the primal, from convention  and society, and toward the primal, irresistibly  attracted to nature and the sensesThe  Awakening, Kate Chopin's last novel, has been  praised by Edmund Wilson as \"beautifully  written.\" And Willa Cather described its style as  \"exquisite,\" \"sensitive,\" and  \"iridescent.\" This edition of The  Awakening also includes a selection of  short stories by Kate Chopin. \"This seems to me a  higher order of feminism than repeating the story  of woman as victim... Kate Chopin gives her female  protagonist the central role, normally reserved  for Man, in a meditation on identity and culture,  consciousness and art.\" -- From the  introduction by Marilynne Robinson.",
        "Category": " Fiction , Classics",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "The Exercise High",
        "Authors": "By Maharam, Lewis G.",
        "Description": "A top sports physician shows aerobic exercisers how they can vary the duration and frequency of their workouts to eliminate underperformance and overexertion and maintain a constant exercise high. Reprint.",
        "Category": " Health & Fitness , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "7.17",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Coaching Kids For Dummies",
        "Authors": "By Wolff, Rick",
        "Description": "What could be easier or more fun than coaching youth sports? How complicated could it be—it’s all fun and games, right? Unfortunately, coaching kids isn’t that simple. If you’ve ever watched a youth league game, you know that all sorts of pressures, worries, concerns, and emotions come into play when your kid is out on the field. In fact, it’s not unusual to witness at least one ugly incident at a game where a coach or parent has gotten out of control. The good news is, as a coach, you can guarantee that kids have fun, get the physical and psychological boost they need, and want to play on your team next year. And now this book shows you how.Written by a nationally recognized sports-parenting expert, coach, and author who is also a former professional baseball player, Coaching Kids For Dummies shows you step by step how to make sports a positive experience for kids of all ages. Packed with practical advice for coaches and parents, it shows you how to:Help kids select the best sports for themCommunicate effectively with your young athletesDeal with losses and winsProvide encouragement without pushing too hardMotivate kids and boost performanceFoster good sportsmanshipPrevent sports burnoutHandle irate parentsEvaluate travel teamsNo matter what your prior experience with youth league sports—even if you weren’t in one yourself as a kid—Coaching Kids For Dummies coaches you in all the essentials. Topics you’ll explore include:What every parent should know about youth sports, including the right age to get them started, how leagues work, and what your kid and you can expectBasic coaching tasks and responsibilities, such as pregame preparation, practice sessions, team meetings with kids and parents, and moreCommunication and motivational skills every coach needs to developCoaching challenges, including scheduling, hostile parents, dealing with injuries, and coaching your own kidsLoaded with tested-in-the-trenches strategies for helping kids get the most out of sports, Coaching Kids For Dummies is every youth league coach’s survival guide.",
        "Category": " Sports & Recreation , Coaching , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Hunan Hand and Other Ailments: Letters to the New England Journal of Medicine",
        "Authors": "By Moskow, Shirley Blotnick (EDT)",
        "Description": "Features a collection of the most amusing and provocative letters addressed to the \"Correspondence\" section of the \"New England Journal of Medicine\"",
        "Category": " Medical , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Women Like Us: What Is Happening to the Women of the Harvard Business School, Class of '75--The Women Who Had the First Chance to Make It to the Top",
        "Authors": "By Gallese, Liz Roman",
        "Description": "Provides an in-depth examination, based on numerous interviews, of the personal and professional lives of six women graduates of the Harvard Business School whose careers best represent their class as a whole",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "6.61",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Stripped (Jonathan Stride)",
        "Authors": "By Freeman, Brian",
        "Description": "In this stunning follow-up to Brian Freeman’s remarkable debut novel, Immoral, Detective Jonathan Stride discovers that there are only two ways to go in Las Vegas.  You can hit the jackpot.  Or you can get Stripped... They looked like isolated cases: a hit-and-run and a celebrity murdered during a fling with a prostitute.  No one could ever imagine they’d be linked to a brutal crime in Las Vegas’s steamy past—and that the race against the clock to corner a determined serial killer would stir up secrets long thought buried with the dead.  As detectives Jonathan Stride and Serena Dial are called separately to investigate, they have no idea what they’re stepping into: a world where desperate ambition rules and loyalties know no bounds, and where their own uncharted emotions and sexual desires will reach an explosive conclusion.Shocking, twisted, with edge-of-your-seat suspense, Stripped pushes the limits of its heroes and keeps the reader turning ever page until the last plot twist.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "His Way: An Everyday Plan for Following Jesus",
        "Authors": "By Knight, David",
        "Description": "",
        "Category": "",
        "Publisher": "St. Anthony Messenger Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Suspect (Dismas Hardy)",
        "Authors": "By Lescroart, John T.",
        "Description": "Dr. Caryn Dryden is found floating dead in her hot tub, and homicide inspector Devin Juhle targets a suspect close to home: her husband, Stuart Gorman. After all, Caryn recently asked for a divorce ... and Stuart stands to gain millions in insurance. His alibi - that he was at his cabin on Echo Lake that weekend - doesn't keep him out of hot water. But maybe a shrewd attorney will.Gina Roarke, a partner in Dismas Hardy's firm, is eager to take on such a high-profile case, especially when the client's innocence seems so easy to prove. Yet the more time she spends with Stuart, the more complicated her feelings become; she feels strangely drawn to him at first, then has to confront the possibility of a dark history lurking in his past. Desperate to know the truth, Gina calls in Wyatt Hunt to investigate. But as the damning facts accumulate, and as the rabid press concludes that Stuart is guilty, Gina must face the possibility that Stuart may not find mercy in the courtroom either.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Norton Anthology of English Literature: The Major Authors",
        "Authors": "By Abrams, M. H. (EDT)",
        "Description": "",
        "Category": " Literary Criticism , General",
        "Publisher": "W W Norton & Co Inc (Np)",
        "Price Starting With ($)": "7.1",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Mystery of the Ivory Charm",
        "Authors": "By Carolyn Keene",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1936"
        }
    },
    {
        "Title": "Nixon and Kissinger: Partners in Power",
        "Authors": "By Dallek, Robert",
        "Description": "With the publication of his magisterial biography of John F. Kennedy, An Unfinished Life, Robert Dallek cemented his reputation as one of the greatest historians of our time. Now, in this epic joint biography, he offers a provocative, groundbreaking portrait of a pair of outsize leaders whose unlikely partnership dominated the world stage and changed the course of history. More than thirty years after working side-by-side in the White House, Richard Nixon and Henry Kissinger remain two of the most compelling, contradictory, and powerful men in America in the second half of the twentieth century. While their personalities could hardly have seemed more different, they were drawn together by the same magnetic force. Both were largely self-made men, brimming with ambition, driven by their own inner demons, and often ruthless in pursuit of their goals. At the height of their power, the collaboration and rivalry between them led to a sweeping series of policies that would leave a defining mark on the Nixon presidency.Tapping into a wealth of recently declassified archives, Robert Dallek uncovers fascinating details about Nixon and Kissinger's tumultuous personal relationship and the extent to which they struggled to outdo each other in the reach for achievements in foreign affairs. Dallek also brilliantly analyzes their dealings with power brokers at home and abroad—including the nightmare of Vietnam, the unprecedented opening to China, détente with the Soviet Union, the Yom Kippur War in the Middle East, the disastrous overthrow of Allende in Chile, and growing tensions between India and Pakistan—while recognizing how both men were continually plotting to distract the American public's attention from the growing scandal of Watergate. With unprecedented detail, Dallek reveals Nixon's erratic behavior during Watergate and the extent to which Kissinger was complicit in trying to help Nixon use national security to prevent his impeachment or resignation.Illuminating, authoritative, revelatory, and utterly engrossing, Nixon and Kissinger provides a startling new picture of the immense power and sway these two men held in changing world history.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Harper",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Phantom: Chainfire Trilogy, Part 2 (Sword of Truth, Book 10)",
        "Authors": "By Goodkind, Terry",
        "Description": "Bestselling author Terry Goodkind's epic Sword of Truth series continues with the next stunning installment, PhantomOn the day she awoke remembering nothing but her name, Kahlan Amnell became the most dangerous woman alive.  For everyone else, that was the day that the world began to end.As her husband, Richard, desperately searches for his beloved, whom only he remembers, he knows that if she doesn't soon discover who she really is, she will unwittingly become the instrument that will unleash annihilation.  But Kahlan learns that if she ever were to unlock the truth of her lost identity, then evil itself would finally possess her, body and soul.If she is to survive in a murky world of deception and betrayal, where life is not only cheap but fleeting, Kahlan must find out why she is such a central figure in the war-torn world swirling around her.  What she uncovers are secrets darker than she could ever have imagined.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "50+: Igniting a Revolution to Reinvent America",
        "Authors": "By Novelli, Bill, Workman, Boe (CON), and Case, Steve (FRW)",
        "Description": "50+ is a call to arms. It’s a groundbreaking look at the revolution that’s going on right now among seventy-eight million American baby boomers. From age 50+ on up, Americans are refusing to rock away their retirement. They’re starting new careers, rallying for causes close to their hearts, raising grandchildren, becoming more active in their communities, and, above all else, changing the face of aging in America.             Bill Novelli, CEO of AARP, knows that with the largest generation of Americans ever recorded nearing traditional retirement age, this revolution is changing the way 50+ Americans live their lives. The boomers have vast technological expertise, are actively involved in maintaining a healthy lifestyle, have been politically active throughout their lives, and are comfortable managing their own finances. They’re no strangers to the gym, the voting booth, online investing sites, or the day-to-day management of their 401(k)s, and they’re joining an already active and savvy group of Americans 50+ and beyond who are determined to leave their mark on the world. Novelli knows that there’s strength in numbers and that 50+ Americans can seize the day by: --Working to transform health care not only by demanding quality care and lower pharmaceutical costs, but also by engaging in healthy lifestyles and preventive care --Creating a secure retirement by planning personal finances well in advance and working to make Social Security solvent for all Americans --Revolutionizing the workplace so those of us who want or need to continue working can do so in a way that benefits everyone. --Building livable communities with improved housing, transportation, and services, allowing all Americans to age in place. --Changing the marketplace by driving the development of innovative products and services that add value to 50+ lives, and using collective purchasing power to make them affordable --Advocating for causes that will really make a difference --Creating a lasting legacy so we can leave the world a better place than we found it. By discovering the possibilities that lie within all of us, we can ignite a twenty-first-century revolution to make America better and stronger. If you’re 50+, Bill Novelli has a message for you: The best is yet to come.",
        "Category": " Political Science , Public Policy , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Immediate Family",
        "Authors": "By Goudge, Eileen",
        "Description": "What does it mean to be a family? New York Times bestselling author Eileen Goudge's engaging new novel is a powerful adventure into the heart of marriage, motherhood, and four friends who discover they may be the best family they ever had.   Fifteen years after graduation, best friends Jay, Franny, Emerson, and Stevie meet at their college reunion. Life has taken each of them in different directions -- Jay is a married man with a baby on the way while Franny yearns for a child as she searches for love in all the wrong places. Divorced single mom Emerson is drawn to a man who challenges everything she's come to believe about finding a once-in-a-lifetime love. And Stevie's life has recently been rocked by a shocking revelation -- the answer to a family secret that will shatter everything she believes about herself.   Now the bond between the foursome takes a surprising twist, one that changes how each feels about family and friendship. One thing is certain: They will all find their heart's desires in the last place they imagine -- as they discover that family is less about blood ties than the warm embrace of ones who accept them as they are.   \"Eileen Goudge writes like a house on fire, creating characters you come to love and hate to leave,\" praises Nora Roberts -- and nowhere do Goudge's bestselling storytelling talents shine brighter than in Immediate Family.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Fences",
        "Authors": "By Wilson, August",
        "Description": "• Now a Major Motion Picture directed by Denzel Washington, and starring Denzel Washington and Viola Davis (winner of the Academy Award and Golden Globe for her role)• Winner of the Pulitzer Prize for Drama and the Tony Award for Best Play \"In his work, Mr. Wilson depicted the struggles of black Americans with uncommon lyrical richness, theatrical density and emotional heft, in plays that give vivid voices to people on the frayed margins of life.\"—The New York TimesFrom legendary playwright August Wilson, the powerful, stunning dramatic work that won him critical acclaim, including the Tony Award for Best Play and the Pulitzer Prize.Troy Maxson is a strong man, a hard man. He has had to be to survive. Troy Maxson has gone through life in an America where to be proud and black is to face pressures that could crush a man, body and soul. But the 1950s are yielding to the new spirit of liberation in the 1960s, a spirit that is changing the world Troy Maxson has learned to deal with the only way he can, a spirit that is making him a stranger, angry and afraid, in a world he never knew and to a wife and son he understands less and less.Denzel Washington’s film adaptation received nominations for awards from the Academy Awards, African-American Film Critics Association, American Film Institute, Critics' Choice Movie Awards, Golden Globe Awards, and NAACP Image Awards, among others.",
        "Category": " Drama , American , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Keep Walking: One Man's Journey to Feed the World One Child at a Time",
        "Authors": "By Jones, Larry",
        "Description": "In an uplifting memoir, the founder of Feed The Children tells the story of his organization and its remarkable, life-affirming work, both here and abroad.In 1979, Larry Jones was ministering in Haiti, where he was approached by a young boy who hadn’t eaten all day. The child asked for a nickel to buy a roll. Recalling the wheat surplus back home in Oklahoma, Jones soon started Feed The Children, initially a wheat-exporting outreach that grew into one of the world’s largest and most respected charities. Year after year, it efficiently distributes food and other essentials to impoverished families throughout the United States and much of the rest of the world.In Keep Walking, Jones describes his journey from a childhood as the son of two barbers in America’s heartland to a career that takes him to war-torn countries and areas devastated by natural disasters—as well as into the halls of Congress and the offices of foreign governments to solicit support and funding. Rich in moving stories, Keep Walking offers vivid insights into the faith that moved Jones to do God’s work and shows readers that they, too, can make a difference.",
        "Category": " Religion , Institutions & Organizations",
        "Publisher": "Doubleday Religion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Patron Saint of First Communicants: The Story of Blessed Imelda Lambertini (Stories of the Saints for Young People Ages 10 to 100)",
        "Authors": "By WINDEATT MARY FABYAN",
        "Description": "Gifts were piled high for 5-year-old Imelda\\'s birthday. Imelda was delighted, but still she asked, \\\"I was wondering if I could have just one more present.\\\" \\\"Greedy girl!\\\" laughed her father. Unfortunately, her parents could not give her this one present--Our Lord in Holy Communion. But Imelda decided to ask Our Lord Himself. What would He reply? This book gives the answer and tells how little Imelda came to be the Patroness of First Communicants.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "TAN Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Male Menopause",
        "Authors": "By Diamond, Jed",
        "Description": "Describes the medical, psychological, and emotional symptoms of menopause in men, covering such issues as aging, sexuality, and relationships",
        "Category": " Health & Fitness , Men's Health",
        "Publisher": "Sourcebooks Inc",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Bloodsworth: The True Story of the First Death Row Inmate Exonerated by DNA Evidence",
        "Authors": "By Junkin, Tim",
        "Description": "“Chilling, heartbreaking, and ultimately inspiring. I urge you to read it.” —SISTER HELEN PREJEAN, author of Dead Man Walking   CHARGED WITH THE RAPE AND MURDER of a nine-year-old girl in 1984, Kirk Bloodsworth was tried, convicted, and sentenced to die in Maryland’s gas chamber. Maintaining his innocence, he read everything on criminal law available in the prison library and persuaded a new lawyer to petition for the then-innovative DNA testing. After nine years in one of the harshest prisons in America, Kirk Bloodsworth became the first death row inmate exonerated by DNA evidence. He was pardoned by the governor of Maryland and has gone on to become a tireless spokesman against capital punishment. Bloodsworth’s story speaks for 159 others who were wrongly convicted and have since been released, and for the thousands still in prison waiting for DNA testing.   “The reader will be swept along to an amazing and shocking conclusion that could never be believed as fiction.” —JOSEPH WAMBAUGH, author of The New Centurions   “Unbroken by the horror and anguish of his ordeal, [Kirk Bloodsworth] has now dedicated himself to saving other innocents from the living hell he endured.” —SENATOR PATRICK LEAHY, ranking member of the Senate Judiciary Committee   * CHRISTIAN SCIENCE MONITOR NOTEWORTHY NONFICTION, 2004 * ATLANTA JOURNAL CONSTITUTION BEST NONFICTION OF 2004",
        "Category": " True Crime , Murder , General",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Don't Wake Me at Doyles: A Memoir",
        "Authors": "By Murphy, Maura",
        "Description": "\"Murphy's skillful storytelling and optimistic spirit give even the grimmest moments of her difficult life story levity in this hopeful, spunky sister to Angela's Ashes.\"- Publishers WeeklyMaura Murphy's memoir of life in Ireland and beyond resonates with the people, places, and struggles of an almost forgotten generation. Born \"chronically ugly and cross as a briar\" into a poor, rural homestead in 1920s Ireland, Maura faced adversity from birth. She grew up in the bogs of the Irish countryside and left school at fourteen for Dublin, working in service there until her marriage to a hardworking but hard-drinking womanizer. Poverty stricken and hoping to find a better life for her five young children, she left Ireland with her family for 1950s Birmingham, England.But life doesn't always change when places do, and Maura's fear that she'd be \"waked\" at Doyles bar upon her death is funny but dead serious. Her voice is feisty and fearless, and she needed to be all those things to survive an extraordinary series of privations and abuses. And now, seventy-five and having survived her childhood, recovered from cancer, and left her marriage of fifty years, Maura has finally recorded the story of her life. Don't Wake Me at Doyles is the compelling account of a life set against by bad odds and worse luck: a memoir of survival and success in the face of the limits of class, education, nationality, religion, gender, and even health. A fearlessly honest writer, Maura invites us into her world, through her destructive marriage, and the birth of her nine children, and towards a life-or-death choice that would change her forever. Told with biting wit, Don't Wake Me at Doyles is a personal story of one woman's endurance, and the remarkable memoir of an ordinary woman's extraordinary life.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Can You Believe Your Eyes?",
        "Authors": "By Block, J. Richard and Yuker, Harold E.",
        "Description": "Presents over 250 visual illusions gathered from around the world to explore the psychology of vision, and discusses the phenomenon of human perception and the use of illusions in society",
        "Category": " Games & Activities , Quizzes",
        "Publisher": "Routledge",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Defending the Left: An Individual's Guide to Fighting for Social Justice, Individual Rights, and the Environment",
        "Authors": "By Driver, David E.",
        "Description": "",
        "Category": "",
        "Publisher": "Noble Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Ballet and Modern Dance (World of art)",
        "Authors": "By Au, Susan",
        "Description": "Traces the development of ballet, describes influential choreographers, dances, and dancers, and looks at modern trends in dance",
        "Category": "",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "ACLU: The Devil's Advocate: The Seduction of Civil Liberties in America",
        "Authors": "By Smith, Lagard F.",
        "Description": "",
        "Category": "",
        "Publisher": "Marcon 3",
        "Price Starting With ($)": "7.07",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "The Passion of the Western Mind: Understanding the Ideas that Have Shaped Our World View",
        "Authors": "By Tarnas, Richard",
        "Description": "\"[This] magnificent critical survey, with its inherent respect for both the 'Westt's mainstream high culture' and the 'radically changing world' of the 1990s, offers a new breakthrough for lay and scholarly readers alike....Allows readers to grasp the big picture of Western culture for the first time.\"SAN FRANCISCO CHRONICLEHere are the great minds of Western civilization and their pivotal ideas, from Plato to Hegel, from Augustine to Nietzsche, from Copernicus to Freud. Richard Tarnas performs the near-miracle of describing profound philosophical concepts simply but without simplifying them. Ten years in the making and already hailed as a classic, THE PASSION OF THE WESERN MIND is truly a complete liberal education in a single volume.",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "AWAY: A Novel",
        "Authors": "By Bloom, Amy",
        "Description": "Panoramic in scope, Away is the epic and intimate story of young Lillian Leyb, a dangerous innocent, an accidental heroine. When her family is destroyed in a Russian pogrom, Lillian comes to America alone, determined to make her way in a new land. When word comes that her daughter, Sophie, might still be alive, Lillian embarks on an odyssey that takes her from the world of the Yiddish theater on New York’s Lower East Side, to Seattle’s Jazz District, and up to Alaska, along the fabled Telegraph Trail toward Siberia. All of the qualities readers love in Amy Bloom’s work–her humor and wit, her elegant and irreverent language, her unflinching understanding of passion and the human heart–come together in the embrace of this brilliant novel, which is at once heartbreaking, romantic, and completely unforgettable.",
        "Category": " Fiction , Historical",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Sick Kids and Those Who Love Them",
        "Authors": "By Rhea, Karen",
        "Description": "",
        "Category": " Family & Relationships , Children with Special Needs",
        "Publisher": "Xulon Press",
        "Price Starting With ($)": "7.44",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Is Your Thyroid Making You Fat: The Doctor's 28-Day Diet that Tests Your Metabolism as You Lose Weight",
        "Authors": "By Siegal, Sanford",
        "Description": "Siegal outlines a noninvasive, 28-day program designed to help identify thyroid malfunction. The program consists of eating a healthy percentage of protein, carbohydrates and fat over a 28-day period while taking weight and temperature measurements. Once diagnosed, he provides recommended medication and a special eating plan.",
        "Category": " Health & Fitness , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Life: The '60s",
        "Authors": "By O'Neil, Doris C. (EDT) and Neary, John (EDT)",
        "Description": "Hundreds of photographs from the archives of \"Life\" magazine capture the images of the 1960s",
        "Category": " History , General",
        "Publisher": "Bulfinch Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The People's Guide To Deadly Drug Interactions: How To Protect Yourself From Life-Threatening Drug-Drug, Drug-Food, Drug-Vitamin Combinations",
        "Authors": "By Graedon, Joe and Graedon, Teresa, Ph.D.",
        "Description": "The People's Guide to Deadly Drug Interactions cuts through drug company fine print to focus on the interactions that are the most deadly and that involve the remedies you're most likely to take. It organizes the thousands of hazardous combinations into easy-to-read, easy-to-understand Interaction Charts. Printed in three colors, these unique charts clearly show whether a drug combo may be life-threatening, dangerous, or troublesome - and, most important, describe the symptoms of those interactions.Unlike other drug references, The People's Guide to Deadly Drug Interactions pulls out the critical information buried in technical drug literature and highlights it in dozens of at-a-glance charts and tables.",
        "Category": " Medical , Pharmacology",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "What You Didn't Know About the Bible",
        "Authors": "By Swain, J. Carter",
        "Description": "This fascinating volume is a complete book-by-book, question-and-answer approach to an understanding of the background, contents, and teachings of the \"Book of Books.\" Over 2,650 thought-provoking questions and answers on the Old and New Testaments, as well as the Apocrypha, cover a multitude of topics:         ¸         What words from Leviticus are inscribed on the Liberty Bell?         ¸         What was Solomon's program of public works?         ¸         What Psalm is regularly sung at Harvard ceremonies?         ¸         What psychosomatic insights are found in Proverbs?         ¸         What is the meaning of the word \"Apocrypha\"?        The introductory section answers questions about the Bible as a whole: what constitutes the \"Canon of Scripture;\" what is meant by an \"authorized version;\" the significance of the Gutenberg Bible; and other basic facts. Specific information about the sources, the writers, the historical periods, and the political situations is given for each of the Biblical books. Extensive use of quotations by chapter and verse supplies the exact scriptural words that are needed in the answers, and other relevant passages and citations are quoted from other books.        What You Didn't Know About the Bible is a unique resource for study of the Bible.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Testament",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Amateurs",
        "Authors": "By Halberstam, David",
        "Description": "\"Astonishing . . . Moving . . . One of the best books ever written about a sport.\" *Walter Clemons Newsweek\"A PENETRATING, FASCINATING AND REMARKABLY SUSPENSEFUL NARRATIVE.\" *David Guy Chicago TribuneIn The Amateurs, David Halberstam once again displays the unique brand of reportage, both penetrating and supple, that distinguished his bestselling The Best and the Brightest and October 1964. This time he has taken for his subject the dramatic and special world of amateur rowing. While other athletes are earning fortunes in salaries and-or endorsements, the oarsmen gain fame only with each other and strive without any hope of financial reward.What drives these men to endure a physical pain known to no other sport? Who are they? Where do they come from? How do they regard themselves and their competitors? What have they sacrificed, and what inner demons have they appeased? In answering these questions, David Halberstam takes as his focus the 1984 single sculls trials in Princeton. The man who wins will gain the right to represent the United States in the 84 Olympiad; the losers will then have to struggle further to gain a place in the two- or four-man boats. And even if they succeed, they will have to live with the bitter knowledge that they were not the best, only close to it.Informative and compelling, The Amateurs combines the vividness of superb sportswriting with the narrative skills of a Pulitzer Prize-winning correspondent.\"RIVETING.\" *Christopher Lehmann-Haupt The New York Times\"[A] MASTERFUL JOB . . . Maintains the suspense to the very last stroke . . . Halberstam makes us care about the four men, their disappointments and the brutal testing of their friendships.\" *Dan Levin Sports Illustrated",
        "Category": " Sports & Recreation , Essays",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Vulnerability, coping, and growth: From infancy to adolescence",
        "Authors": "By Lois Barclay Murphy, Alice E. Moriarty",
        "Description": "",
        "Category": "",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "A Dsm-III Casebook of Differential Therapeutics: A Clinical Guide to Treatment Selection",
        "Authors": "By Frances, Allen, Perry, Samuel, and Clarkin, John",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Brunner-Routledge",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Investing in Real Estate (Third Edition)",
        "Authors": "By McLean, Andrew James and Eldred, Gary W.",
        "Description": "",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "You and Your Rights",
        "Authors": "By Reader's Digest Association",
        "Description": "Describes the services, benefits, and assistance programs available to citizens through local, state, and federal governments, in chapters arranged chronologically--from preschool years through retirement",
        "Category": " Social Science , General",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "9.19",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "The Bank Book",
        "Authors": "By Mrkvicka, Edward F., Jr.",
        "Description": "Discusses credit, mortgages and savings accounts, criticizes unfair banking practices, and tells how to negotiate a loan",
        "Category": " Business & Economics , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Guide to Clinical Preventive Services: Report of the U S Preventive Services Task Force",
        "Authors": "By U. S. Preventive Services Task Force (COR)",
        "Description": "Offers guidelines for physicians, students in health fields, and managers and payers, on the use of clinical preventive services. Sections I contains detailed screening information for various conditions. Section II discusses counseling patients on lifestyle issues. Section III covers immunizations and chemoprophylaxis. Includes a set of cards noting risks and recommendations for specific age groups. This second edition contains eleven new chapters. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Medical , Preventive Medicine",
        "Publisher": "Williams & Wilkins",
        "Price Starting With ($)": "6.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Trojan Horse",
        "Authors": "By Christopher Morley",
        "Description": "",
        "Category": "",
        "Publisher": "J. B. Lippincott",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1937"
        }
    },
    {
        "Title": "Retire on Less Than You Think: The New York Times Guide to Planning Your Financial Future",
        "Authors": "By Brock, Fred",
        "Description": "02 From the New York Times retirement expert, an authoritative resource for successfully assessing and tackling the real costs and challenges of retirement Only a few years ago, the question on many Americans’ minds wasn’t “how will I retire” but “when.” Now, with 401(k)s and IRAs at a fraction of their previous value and health-care costs soaring, it’s time for a definitive guide book that walks you through the fundamentals of retirement. With his biweekly “Seniority” column in The New York Times, Fred Brock has earned a reputation for providing frank and pragmatic advice on the changing landscape of retirement. In chapters written exclusively and originally for this book, he offers updated thinking on all the essentials for a smart and secure retirement, including how to • determine new personal finance and investing goals • find untapped asset streams, such as reverse mortgages • deal with the tangle of taxes on pensions, family gifts, and other income • work during retirement • choose a community and housing • maximize your health insurance • assess long-term assisted-living arrangements He offers indispensable tools for analyzing your true costs of retirement, independent of the mutual-fund industry hype and Social Security scares. And a substantial list of national, regional, and online resources as well as worksheets allow you to customize and realize your retirement plan.  From the New York Times retirement expert, an authoritative resource for successfully assessing and tackling the real costs and challenges of retirement Only a few years ago, the question on many Americans’ minds wasn’t “how will I retire” but “when.” Now, with 401(k)s and IRAs at a fraction of their previous value and health-care costs soaring, it’s time for a definitive guide book that walks you through the fundamentals of retirement. With his biweekly “Seniority” column in The New York Times, Fred Brock has earned a reputation for providing frank and pragmatic advice on the changing landscape of retirement. In chapters written exclusively and originally for this book, he offers updated thinking on all the essentials for a smart and secure retirement, including how to • determine new personal finance and investing goals • find untapped asset streams, such as reverse mortgages • deal with the tangle of taxes on pensions, family gifts, and other income • work during retirement • choose a community and housing • maximize your health insurance • assess long-term assisted-living arrangements He offers indispensable tools for analyzing your true costs of retirement, independent of the mutual-fund industry hype and Social Security scares. And a substantial list of national, regional, and online resources as well as worksheets allow you to customize and realize your retirement plan.",
        "Category": " Business & Economics , Personal Finance , Retirement Planning",
        "Publisher": "Times Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "How to Become a Rainmaker: The Rules for Getting and Keeping Customers and Clients",
        "Authors": "By Fox, Jeffrey J.",
        "Description": "Now Updated and with New Success Tips! Rainmakers are not born. They are made. And Jeffrey Fox's powerful HOW TO BECOME A RAINMAKER will get you there. Filled with smart tips given in the Fox signature style, counter-intuitive, controversial, and practiced, this hard-hitting collection of sales advice shows readers how to woo, pursue, and finally win any customer. In witty, succinct chapters, Fox offers surprising, daring, and totally practical wisdom that will help readers rise above the competition in any company in any field. A terrific resource for CEOs, as well as anyone looking to distinguish themselves in sales--be it books, cars, or real estate--How to Become a Rainmaker offers the opportunity to rise above the competition in any company, in any field.",
        "Category": " Business & Economics , Customer Relations",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Stronger Abs and Back",
        "Authors": "By Brittenham, Dean and Brittenham, Greg",
        "Description": "Ancient Greek and Chinese leaders have stressed it for centuries, but only in the past decade have fitness and sports conditioning experts emphasized the development of abdominal and back muscles. Now we have the science to support the argument that the body&#39;s stability and power comes from its center.Stronger Abs and Back shows how to develop the body&#39;s core musculature for maximum fitness and athletic performance. Strong abdominal and torso muscles will enhance physical appearance and mobility as well as contribute to the prevention of low back pain--the most common physical ailment in the industrialized world.Because of its extensive benefits, Stronger Abs and Back applies to a broad readership: office workers who stiffen up while sitting at a desk all week; weekend warriors who play 36 holes on a free day at the course; serious athletes who want the utmost power to perform closer to their potential; and coaches who develop training programs with the best and most comprehensive fitness level of their athletes in mind.The book features 165 exercises for developing flexibility, strength, and power. It also shows how to select and sequence these exercises in a 24-week sample program for abs and back development.",
        "Category": " Health & Fitness , Exercise , General",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "World Series: An Opinionated Chronicle",
        "Authors": "By Wallace, Joseph E.",
        "Description": "A stirring survey of the World Series relives great moments in the game through words and images, including the heartbreaking 1919 Black Sox scandal, Game 7 of the 1946 World Series, and the Brooklyn Dodgers' legendary crown in 1955, capturing all the wonder and pathos of the game. 25,000 first printing.",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Fear Brokers",
        "Authors": "By McIntyre, Thomas J.",
        "Description": "The former U.S. Senator comments on the Conservative resurgence in the U.S., arguing that the New Right has exploited the fears, resentments, and grievances of the people",
        "Category": " Political Science , General",
        "Publisher": "Pilgrim Pr",
        "Price Starting With ($)": "17.48",
        "Publish Date": {
            "Month": "May",
            "Year": "1979"
        }
    },
    {
        "Title": "Romance Rekindled: The Art of Loving Your Spouse",
        "Authors": "By Bundschuh, Rick and Gilbert, Dave",
        "Description": "",
        "Category": "",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Jesus",
        "Authors": "By Wangerin, Walter",
        "Description": "Walter Wangerin Jr. sweeps away centuries of tradition and reveals a man of flesh-and-heart immediacy. Passionate, intelligent, and irresistibly real, this is a Jesus pulsing with life who will captivate you as thoroughly as he did the men and women who journeyed with him across Galilee's rugged countryside.Days of centuries past become today, lit with bright colors of the imagination. Tracing Jesus's footsteps from his boyhood in Nazareth, Wangerin offers an intimate, moment-by-moment unfolding of Jesus - who and how he was and the life he lived - viewed through the eyes of the two people who loved him best: the disciple called \"beloved,\" and the woman Mary, Jesus's mother.Jesus: A Novel is a magnum opus of image and emotion, portraying lives swept up in the drama of one man who would change the world forever. From his humble origins in a tiny back-country community, this lowly carpenter would rise to the ranks of teacher - and beyond, to prophet, miracle-worker, leader of the people ... and something greater still. Challenging traditions that broke hearts and minds, he would point the way toward a freedom none had imagined.",
        "Category": " Fiction , Religious",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Great Wine Made Simple: Straight Talk from a Master Sommelier",
        "Authors": "By Immer, Andrea",
        "Description": "At last, a wine book that makes selecting and enjoying wine truly simple. With renowned wine expert Andrea Immer as your guide, never again will you have to fear pricey bottles that don't deliver, snobby wine waiters, foreign terminology, or encyclopedic restaurant wine lists. You'll be able to buy or order wine with confidence-and get just the wine you want-by learning how the \"Big Six\" basic styles taste and how to read any wine label.Andrea Immer genuinely knows more about wine than most wine lovers could ever hope (or want) to learn. But she doesn't believe that you have to join a stuffy, exclusive wine-tasting set to become a savvy wine buyer. Unlike other guides on the market, Great Wine Made Simple makes it easy to master the ins and outs of choosing a wine that you and your guests will love-on any budget.Shunning yesterday's 100-point scales and lectures on \"bouquet,\" Great Wine Made Simple explains wine in commonsense terms. Featuring a core curriculum of the six grapes that comprise 80 percent of today's top-selling wines, along with a complete flavor map that explains what tastes you can expect from climates around the globe, Great Wine Made Simple uses easy and fun tasting lessons to help you identify what you like and learn how to spot it on a menu or shelf.Immer reveals the secret weapons of wine experts and explains how to decipher those enigmatic labels. In her fresh, encouraging tones, she provides enlightening exercises (such as \"milk tasting\" for understanding variations in wine texture) and vocabulary sessions. On a mission to empower the everyday wine buyer, with Great Wine Made Simple Immer creates a refreshing new way to choose the perfect wine for every palate and occasion.",
        "Category": " Cooking , Beverages , Alcoholic , Wine",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Pacific Street",
        "Authors": "By Holland, Cecelia",
        "Description": "A small black woman and an Indian carpenter form a conspiracy against an enticing blond performer for the Shining Light saloon, in a vivid tale set against the backdrop of the ramshackle, half-built San Francisco during the Gold Rush. 15,000 first printing.",
        "Category": " Fiction , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "20.49",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Gods of War, Gods of Peace: How the Meeting of Native and Colonial Religions Shaped Early America",
        "Authors": "By Bourne, Russell",
        "Description": "Through dramatic comparisons of Native American and early colonial politics, history, and religion, historian Russell Bourne offers a complete and insightful look at how these two disparate groups influenced each other and how this interchange helped forge the basis for the culture we live in today. Despite living in a war-torn world, both sides made heroic efforts to reach out to each other. The religious and cultural concepts of the Native Americans helped to transform the colonists, turning many into pantheists, communal villagers, and woodland warriors. Similarly, many of the Native Americans became evangelical Christians, farmers, traders, and even commanders of nationalistic armies. Benjamin Franklin, marveling at the cooperation and mutual respect evident among the Six Nations of the Iroquois, suggested that colonial leaders should follow their lead. Yet, in the end, differences and treacheries drove the two peoples apart. Based on extensive historical research and consultation with numerous Native American and academic sources, Gods of War, Gods of Peace offers a revelatory new view of how Native American and colonial religions shaped America and its ideals.",
        "Category": " History , Native American",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Charlie Wilson's War: The Extraordinary Story of How the Wildest Man in Congress and a Rogue CIA Agent Changed the History of Our Times",
        "Authors": "By Crile, George",
        "Description": "It's common knowledge that the U.S. armed the Afghans in their fight against the Soviet Union, but until now, the fact that this was possibly the biggest, meanest covert operation in history has been absent from press reports. In one of the most detailed descriptions of a CIA operation every written, the bizarre twists and turns of the full story are told in CHARLIE WILSON'S WAR. Veteran 60 Minutes producer George Crile explains how one Congressman was able to provide the CIA with hundreds of millions of dollars to fund the Afghan program, dwarfing the price tag for arming the Nicaraguan Contras that occurred at virtually the same time.\"The scope and nature of this campaign has still not registered in the consciousness of most Americans,\" Crile writes in the book's Epilogue. \"Nor is it understood that such secret undertakings inevitably have unforeseen and unintended consequences which, in this case, remain largely ignored.\"When Crile produced his first story about Texas Congressman Charlie Wilson for 60 Minutes in 1989, he too underestimated the vastness of the program and its consequences. It was a later trip to the Arab world with Wilson, the Wilson's \"princely\" reception, and the events of 9/11 that opened his eyes to the far bigger picture of CHARLIE WILSON'S WAR.Among the book's more startling revelations:By the latter years of the 1980s the CIA was not just providing arms to a half million Afghans, it had taken 150,000 of them and transformed them into what it called a force of \"techno holy warriors.\" \"From today's perspective,\" Crile observes, \"that may seem more than a bit ill advised-particularly when you factor in the specialized training in urban warfare that the Agency sponsored to include the use of pipe bombs, bicycle bombs, car bombs, camel bombs, along with a host of other tactics to wreak havoc with the army of a modern superpower.\"The United States continued to fund the Afghan rebels long after the withdrawal of the Soviet Union. Incredibly, the subsidies continued despite the fact that one of the most important mujahid leaders sided with Saddam Hussein in the Gulf War.In addition to $200 million in aid from the U.S. and $200 million from Saudi Arabia, in 1991 and 1992 the rebels received Iraqi weapons captured by U.S. forces during the Gulf War. At the same time, the Berlin Wall came down and the Soviet Union ceased to exist. The Cold War was effectively over but what began as a war against Communism was continuing to be funded.\"The question that has puzzled so many Americans: 'Why do they hate us?' is not so difficult to understand if you put yourself into the shoes of the Afghan veterans in the aftermath of the Soviet departure,\" Crile says. To them, the real superpower in their struggle was Allah. The United States eventually cut off its support in the 1990s. In the Afghan's minds, Allah did not.CHARLIE WILSON'S WAR is nothing short of a critical missing chapter in our political consciousness. Without a clear understanding of its impact, it may be impossible to comprehend the two world changing events that shook the United States on either side of the millennium: the sudden and mysterious collapse of the Soviet Union and the equally inexplicable appearance of a new global foe in the form of militant Islam. At its core, it tells of an unorthodox alliance-of a scandal-prone Texas Congressman named Charlie Wilson and an out-of-favor CIA operative named Gust Avrakotos-that armed and sustained the Afghan jihad and turned Afghanistan into the Soviet Union's Vietnam.\"The origins of this book go back to a time when the Afghans were viewed by most everyone in the U.S. government as freedom fighters and allies against a common foe,\" Crile writes in the Epilogue. In 1988, Crile produced a 60 Minutes profile of Wilson that he now realizes barely scratched the surface of this fascinating story. Later, while, accompanying Wilson on a tr",
        "Category": " Political Science , Intelligence & Espionage",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Classroom Instruction That Works: Research-Based Strategies for Increasing Student Achievement",
        "Authors": "By Marzano, Robert J., Pickering, Debra, and Pollock, Jane E.",
        "Description": "Draws from more than one hundred studies of classroom management to explain four important general components of effective classroom management and their impact on student engagement and achievement.",
        "Category": " Education , General",
        "Publisher": "Assn for Supervision & Curriculum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Succeeding with Standards: Linking Curriculum, Assessment, and Action Planning",
        "Authors": "By Carr, Judy F. and Harris, Douglas E.",
        "Description": "Discusses how to link all aspects of local curriculum to state and national standards and explains the eleven components involved in the standards-linking process.",
        "Category": " Education , Testing & Measurement",
        "Publisher": "ASCD",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The kids' fun-filled question & answer book",
        "Authors": "By Resnick, Jane Parker",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    }
]