[
    {
        "Title": "Harnessing the Wind for Home Energy",
        "Authors": "By McGuigan, Dermot",
        "Description": "Describes methods for creating an inexhaustible, economical, non-polluting source of power through simple wind-energy systems and lists windmill manufacturers and distributors",
        "Category": "",
        "Publisher": "Garden Way Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1978"
        }
    },
    {
        "Title": "The Frugal Gourmet Cooks Italian: Recipes from the New and Old Worlds, Simplified for the American Kitchen",
        "Authors": "By Smith, Jeff",
        "Description": "Jeff Smith fell in love with Italy as a college student. And in the course of nearly three hundred and twenty televised cooking shows and nine cookbooks, he has given us many Italian recipes. In one of them, The Frugal Gourmet Cooks Three Ancient Cuisines, a whole section described the cooking of Rome. But this is the first time he has devoted a single volume to a country where food has been a sustaining passion and is taken as seriously as religion, art, and politics.Companion to a brand-new two-year 40-part Public Television series of the same name, The Frugal Gourmet Cooks Italian shows us how Italians really prepare and enjoy their cuisines. That's right, cuisines. For in Italy, the \"Frug\" tells us, recipes vary from house to house, from town to town. In his fabulous new cookbook, Jeff tells us how Florentine sausages differ from those found in Naples, how Northern Italy has turned the mushroom into an icon, how sandwiches change their shape from city to city. He even shows us how the roots of Italian cooking have flourished when transplanted to the soil of Boston, Philadelphia, and New York.Packed with more than 350 recipes encompassing every course, from a scrumptious antipasto of Carpaccio with Lemon Olive Oil Mustard Sauce to a not-to-be-missed Tiramisu, this is the cookbook we've all been waiting for - here just in time to satisfy our hunger for the regional food of Italy.In these pages you'll discover: an unusual pasta soup made with a spaetzle press; the marriage of two great Italian specialties in artichokes stuffed with caponata, the Sicilian eggplant relish; more than a dozen recipes for polenta, the delicious and versatile cornmeal dish, an Italian staple whose charms are unknown to many Americans; an elegant seafood risotto, both light and hearty; and scores of vegetable recipes - like Asparagus Milanese and a spectacular dish of Fried Radicchio Filled with Cheese.There are also dozens of splendid new pasta recipes, including a stunning version with pesto sauce (this one has green beans and potatoes with penne), and Pasta with Walnuts, a recipe lovingly given to Jeff by a priest in New Jersey. Plus lots of fun breads, pizzas, focaccias (including one stuffed with sausage from Manhattan's Little Italy), and a recipe for cheese breadsticks that's a snap to make. There are of course recipes for meat lovers, among them a Roast Pork with Black Olive Paste that is so good it may bring you to tears and scores of chicken and fish dishes, starring a fabulous Venetian fish soup.It would not be a cookbook by Jeff Smith if he didn't give us: a useful glossary of cooking terms; an invaluable section on Italian wines; and informative essays on the ingredients essential to the Italian kitchen. Olive oil, prosciutto di Parma, Parmigiano-Reggiano cheese, and balsamic vinegar are only a few of the foods Jeff discusses. Throughout this delightful cookbook, America's most beloved cooking personality acts as your generous tour guide, furnishing helpful suggestions on regional markets and humorous anecdotes about everything from Neapolitan taxi drivers to Venetian cats. The Frugal Gourmet Cooks Italian is a cookbook that captures us the way the tastes and sounds of Italy cast their spell over the American visitor. Jeff shows us, once again, that food is more than eating and cooking - it's history and something we each invariably take part in whenever we sit down at table. So, mangia, with the \"Frug.\"",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Conquering the SAT: How Parents Can Help Teens Overcome the Pressure and Succeed",
        "Authors": "By Johnson, Ned and Eskelsen, Emily Warner",
        "Description": "This insightful and practical guide for parents shows how we often undermine rather than encourage our teens’ success on one of the most stressful standardized tests—the SAT—and what strategies will remedy the problem. In recent years this test has taken on fearsome proportions, matched only by the growing competition for slots at major universities. Success is now as much a matter of navigating the maze of changing testing structures, crippling self-conceptions, and family dynamics as it is about memorizing vocabulary words. Tutors Ned Johnson and Emily Warner Eskelsen tackle the trials of the SAT head-on, revealing that the way our culture values this test is just as important as the answers teens fill in. Johnson and Eskelsen cover a wide range of topics including: * Anxiety and ways to avoid “choking” on the test* Best ways to prepare before the test – from exercise to nutrition to sleep* Family communication* What the SAT is actually testing* How test-taking strategies will help teens in all walks of life * Learning differences in teens and strategies for success",
        "Category": " Study Aids , SAT",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Jewish Quiz Book",
        "Authors": "By Carlinsky, Dan",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "Say When: A Novel",
        "Authors": "By Berg, Elizabeth",
        "Description": "When is a marriage worth saving and when is it best to let go? When do half-truths turn into full-blown lies? When does betrayal end and passion begin?  Say When is a compelling, complex novel that takes readers into the heart of a modern marriage where companionship and intimacy, and denial and pain, so often collide. \"Of course he knew she was seeing someone,\" begins the story of Frank Griffin, a man who's willing to overlook his wife's infidelity -- he would let her have this, this thrilling little romance -- for the sake of keeping his family intact. But when the forty-year-old Ellen requests a divorce on the basis that she has finally found true, romantic love, Griffin must decide whether to fight or flee...or search elsewhere for the kind of life he always dreamed of.  With Elizabeth Berg's trademark blend of rare insight, raw emotion, and hard-won wisdom, Say When is a work of startling revelation that no reader will soon forget.",
        "Category": " Fiction , General",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "New York Times Everyday Reader's Dictionary of Misunderstood Misused Mispronounced Words",
        "Authors": "By Urdang, Laurence",
        "Description": "",
        "Category": "",
        "Publisher": "Random House~trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "A Brilliant Madness: Living With Manic-Depressive Illness",
        "Authors": "By Duke, Patty and Hochman, Gloria",
        "Description": "In her revealing bestseller Call Me Anna, Patty Duke shared her long-kept secret: The talented actress who won an Oscar for her brilliant portrayal of Helen Keller in The Miracle Worker, three Emmy Awards, and the hearts of millions of fans who grew up with the adorable star of The Patty Duke Show, was suffering from a serious--but treatable--mental illness called manic depression. Now, in this compassionate, moving, and eloquent book, she joins with medical reporter Gloria Hochman to reveal fully what it's like to live with this powerful, paradoxical, and destructive illness--and how it can be brought under control.As with many manic-depressives, Patty Duke's symptoms started in her late teens. From that point on until she was correctly diagnosed at the age of thirty-five, she struggled for control of her life. At times she experienced euphoric highs: periods when she talked nonstop, was overcome by delusions, became irrationally angry, and acted impulsively with no thought of the consequences. Then, suddenly, she'd slip into debilitating, suicidal lows, periods of depression that found her cowering under the covers for weeks on end. This is the nature of manic-depressive illness: extremes of feeling and behavior that play havoc with a person's health, relationships, career, and self-esteem.In A Brilliant Madness, Patty recounts with painful honesty her temper tantrums, crying jags, hospital stays, suicide attempts, panic attacks, spending sprees, crushing depressions, and plunges into near bankruptcy. She reveals frankly how her disease helped to destroy two marriages and deeply hurt her children.But Patty's story has a happy ending: diagnosis after years of on-again, off-again therapy, a treatment--lithium--that offered a near-miraculous recovery, a new marriage, and the joy she feels today as she contemplates a future filled with life's normal ups and downs.Manic depression is a complex disorder that often masquerades as other illnesses. In alternating chapters, Gloria Hochman reports on the latest findings about its probable causes, its wide range of symptoms, and the most effective treatments. Vivid case histories reveal the many faces of manic depression--and why some patients resist treatment. She also offers fascinating insights into the link between creativity and manic depression--from the brilliant acting of Patty Duke to the disease's influence on prominent entrepreneurs, politicians, musicians, and writers.For all those who suffer from mood disorders, and for the family, friends, and physicians who love and care for them, A Brilliant Madness provides new and profound insight into the challenge of mental illness.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Still Summer",
        "Authors": "By Mitchard, Jacquelyn",
        "Description": "Mitchard's 'Still Summer' plunges into terrorBy Carol Memmott, USA TODAYSecure your life preserver. Tie yourself to the mast. It's late August, but it's still summer, and Jacquelyn Mitchard is taking you on a thrill ride you won't forget.Mitchard made her mark in the literary world in 1996 when TheDeep End of the Ocean was chosen as the first pick for Oprah Winfrey's now-legendary book club. Since then, she has written six other novels, but none matches the suspenseful pitch of Still Summer.It's a tale of terror on the high seas, but this is no Pirates of the Caribbean wannabe.Readers know something terrible is going to happen, but Mitchard ratchets up the suspense by allowing her story to unfold at a leisurely pace. She painstakingly fleshes out her characters, because as readers will discover, their temperaments and personalities are as crucial to the story as the mounting disasters.Tracy Kyle, Holly Solvig and Olivia Montefalco, lifelong friends in their early 40s, charter a yacht and two-man crew for a sailing vacation that will take them from St. Thomas to Grenada.The trip starts out as an innocent adventure in paradise until two accidents in quick succession strand the women without their crew. What else can go wrong? In a word, everything. The engine conks out, the sails are torn, lack of electricity spoils their food and limits their drinking water - and then there's the injury to Holly's leg.Nature's fury, murderous drug dealers and, possibly most deadly of all, their own frailties and secrets are added to the list.Readers will wring their hands with frustration, weep with sadness and second-guess the choices these women make. But since characters must do the bidding of the authors who create them, we can only sit back - or sit on the edge of our seats - and let Mitchard's terror-filled tale wash over us.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "101 Ways To Boost Your Writing Skills",
        "Authors": "By Aber, Linda Williams",
        "Description": "",
        "Category": " Juvenile Nonfiction , School & Education",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "The Time Machine (A Stepping Stone Book(TM))",
        "Authors": "By Wells, H. G., Martin, Les (ADP), and Edens, John (ILT)",
        "Description": "Illus. in black-and-white. When a turn-of-the-century scientist travels into the distant future in his time machine, he expects to find progress and superior people. But instead he discovers a world in decay. Reading level: 2.4.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Clans & Tartans of Scotland",
        "Authors": "By Zaczek, Iain",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Rashi's Daughters, Book 1: Joheved",
        "Authors": "By Anton, Maggie",
        "Description": "",
        "Category": " Fiction , Historical",
        "Publisher": "Banot Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Alaska: A Photo Memory",
        "Authors": "By Randy Brandon",
        "Description": "",
        "Category": "",
        "Publisher": "Todd Communications",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Evergreen Shrubs (Gardener's Guide)",
        "Authors": "By Time-Life Books (EDT) and Galle, Fred C. (EDT)",
        "Description": "Discusses the selection, planting, care and pruning of evergreen shrubs, and includes a dictionary of popular varieties with tips on suitability and care",
        "Category": " Gardening , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Becoming the Parent You Want to Be: A Sourcebook of Strategies for the First Five Years",
        "Authors": "By Davis, Laura and Keyser, Janis (CON)",
        "Description": "Informative, inspiring, and enlightening, Becoming the Parent You Want to Be provides parents with the building blocks they need to discover their own parenting philosophy and develop effective parenting strategies.  Through in-depth information, practical suggestions, and many lively first-person stories, the authors address the many dilemmas and joys that the parent of young children encounter and demonstrate a range of solutions to the major issues that arise in the raising of babies, toddlers and preschoolers.  Full of warmth, clarity, humor, and respect, Becoming the Parent You Want to Be gives parents permission to be human: to question, to learn, to make mistakes, to struggle and to grow, and, most of all, to have fun with their children.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Warriors: Navajo Code Talkers",
        "Authors": "By Kawano, Kenji",
        "Description": "The American offensive in the Pacific during World War II [was] hampered by the Japanese ability to crack the most secret U.S. Codes. Navajo was virtually unknown outside the reservations, ... and [their] code proved uncrackable. Kenji Kawano's striking photographs capture the quiet dignity of the surviving veterans as they recall their actions —Los Angeles Times",
        "Category": " Literary Criticism , Native American",
        "Publisher": "Cooper Square Publishing Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Worry: Hope and Help for a Common Condition",
        "Authors": "By Hallowell, Edward M.",
        "Description": "Here is the first book to explore every facet of the most common and debilitating emotional state: worry. While a healthy level of worry can help us perform efficiently at work, anticipate dangers, and learn from past errors, in its extreme forms worry can become \"toxic\"--poisoning our pleasures, sabotaging our achievements, and preventing us from resolving actual problems.In this lucid, reassuring book, Dr. Hallowell discusses all types of worry, explores their underlying causes, and considers the best strategies for coping. Case histories and anecdotes illuminate such issues as worry in relationships; the correlation between worry and conditions like , depression, social phobia, generalized anxiety disorder, and obsessive-compulsive disorder; worry at work; and the worried child. In an effective section titled \"Remedies That Work,\" Dr. Hallowell shows us how to evaluate, control, and manage worry, both with and without medication.Even \"born\" worriers can learn to use their worry wisely and channel it healthily. This book is the key. Filled with practical solutions and insightful guidance, Worry is an invaluable aid to living a happier, calmer, and more rewarding emotional life.",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Stuff on My Cat: The Book",
        "Authors": "By Garza, Mario",
        "Description": "It began with a handful of digital photographs of office supplies, toys, and spare computer parts thoughtfully placed on Mario Garza's snoozing cat, Love. Over time, the objects became bigger: remote controls, shoes, empty pizza boxes. And then cat owners everywhere were sucked into the Internet phenomenon that is defined by a simple motto:stuff + cats = awesome. From Stuffonmycat.com (the amazingly popular website that redefines hilarious and that was named one of the coolest sites of the year by Yahoo! AndGQ magazine) comes Stuff On My Cat: The Book. Culled from the thousands of outrageous photographs submitted by mischievous animal lovers, here are 200 of the most unbelievably entertaining images of cats with all manner of things on them: wigs, Easter eggs, dogs, cheeseburgers, cookware, gummi bears, action figures, tiaras, beer cans, pinecones, a statue of the Buddha, and much more. An introduction by the site's creator explains theStuff on My Cat philosophy, and playful illustrations and graphics are sprinkled throughout. Just try to keep a straight face.",
        "Category": " Photography , Subjects & Themes , Plants & Animals",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Be Nice (Or Else!): And What's In It For You",
        "Authors": "By Claybough, Winn",
        "Description": "Congratulations! You're about to join the planet's largest celebration of Be Nice! This exquisitely irresistible and highly practical guide shows you how to start your own be nice revolution at home, at work, and even with total strangers. You work hard at so many things-getting ahead, being successful, and even feeling happy. As it turns out, being nice is the one to absolutely guarantee a life you love. Besides, being nice is easy, and the rewards are immeasurable.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Von Curtis Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "A Little Trouble with the Facts: A Novel",
        "Authors": "By Siegal, Nina",
        "Description": "Valerie Vane was an up-and-coming lifestyle reporter at a prominent New York City daily. Then she stumbled, rather publicly, and lost it all—her column, her fiancé, her access behind the city's velvet ropes. Now she's on the obituary desk writing death notices, and it feels like a dead end. However, when she writes about a recently deceased once-famous graffiti artist, the phone calls start. A mysterious voice on the other end of the line tells her the artist's death was a murder—and if she were a real reporter, she'd investigate. But can Valerie trade her stilettos for gumshoes?",
        "Category": " Fiction , General",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Eat That Frog!: 21 Great Ways to Stop Procrastinating and Get More Done in Less Time",
        "Authors": "By Tracy, Brian",
        "Description": "Stop Procrastinating  Get More of the Important Things Done—Today!  There just isn’t enough time for everything on our to-do list—and there never will be. Successful people don’t try to do everything. They learn to focus on the most important tasks and make sure those get done. They eat their frogs. There’s an old saying that if the first thing you do each morning is eat a live frog, you’ll have the satisfaction of knowing you’re done with the worst thing you’ll have to do all day. For Tracy, eating a frog is a metaphor for tackling your most challenging task—but also the one that can have the greatest positive impact on your life. Eat That Frog! shows you how to organize each day so you can zero in on these critical tasks and accomplish them efficiently and effectively. In this fully revised and updated edition, Tracy adds two new chapters. The first explains how you can use technology to remind yourself of what is most important and protect yourself from what is least important. The second offers advice for maintaining focus in our era of constant distractions, electronic and otherwise.  But one thing remains unchanged: Brian Tracy cuts to the core of what is vital to effective time management: decision, discipline, and determination. This life-changing book will ensure that you get more of your important tasks done—today!",
        "Category": " Business & Economics , Motivational",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Flower Girl",
        "Authors": "By Godwin, Laura and Wallace, John (ILT)",
        "Description": "With soft, sweet illustrations and rhyming text, this picturebook covers all the excitement of a wedding, from morning preparations to reception celebrations-the perfect present for any young flower girl.",
        "Category": " Juvenile Fiction , Love & Romance",
        "Publisher": "Hyperion Book CH",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "God's Little Devotional Books for Kids",
        "Authors": "By Beers, V. Gilbert",
        "Description": "Offers prayers, poems, meditations, and scriptural verses for young children on acceptance, sharing, joy, and love",
        "Category": " Religion , Devotional",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Lonely Planet Japan",
        "Authors": "By Rowthorn, Chris, Benson, Sara, Florence, Mason, and Ashburne, John",
        "Description": "",
        "Category": " Travel , Asia , Japan",
        "Publisher": "Lonely Planet Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Make Way for Sam Houston",
        "Authors": "By Fritz, Jean",
        "Description": "A portrait of Sam Houston is set against the backdrop of Texas' battle for independence from Mexico, Texas' annexation to the United States, and the growth of the Western frontier",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "Putnam Juvenile",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Just Listen",
        "Authors": "By Dessen, Sarah",
        "Description": "A New York Times bestseller To find the truth you’ve got to be willing to hear it.   When she’s modeling, Annabel is the picture of perfection.   But her real life is far from perfect.   Fortunately, she’s got Owen. He’s intense, music-obsessed, and dedicated to always telling the truth.   And most of all, he’s determined to make Annabel happy. . .   ?This is young adult fiction at its best.” ?School Library Journal   Also by Sarah Dessen: Along for the Ride Dreamland Keeping the Moon Lock and Key The Moon and More Someone Like You That Summer This Lullaby The Truth About Forever What Happened to Goodbye",
        "Category": " Young Adult Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "No Wonder They Call Him the Savior: Experiencing the Truth of the Cross (Chronicles of the Cross)",
        "Authors": "By Lucado, Max",
        "Description": "The cross.It rests on the time line of history. Like a compelling diamond ...Its tragedy summons all the sufferers ...Its absurdity attracts all cynics ...Its hope lures all searchers.Far more than a gold-plated symbol of religious belief, the cross is the centerpiece of the Christian faith -- the meeting place of time and eternity. Where God and man encounter each other.Max Lucado takes you through the drama of the death and resurrection of Jesus Christ -- bringing to life Peter's denial, Pilate's hesitancy, and John's loyalty. Relive the events leading up to Jesus' crucifixion, from the foggy garden of Gethsemane to the incandescent room of the resurrection.No Wonder They Call Him the Savior leads you up the hill of mankind's highest hope and reminds you why he deserves to be called our Savior.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Thomas Nelson Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Bernie Magruder and the Parachute Peril",
        "Authors": "By Naylor, Phyllis Reynolds",
        "Description": "Life in Middleburg is mighty strange these days -- a mysterious building is going up in the next town over and Bernie's absentminded sister, Delores, shocks everyone by devoting her life to a career in parachute-making. But when Delores is summoned to jump from a plane wearing one of her own parachutes, Bernie and his friends smell trouble. Who would volunteer Delores for such a stunt and just who is that suspicious guy hanging around the new building?",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Aladdin Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "CliffsNotes on Shakespeare’s A Midsummer Night’s Dream (Dummies Trade)",
        "Authors": "By Jacobson, Karin",
        "Description": "The original CliffsNotes study guides offer a look into critical elements and ideas within classic works of literature.In CliffsNotes on A Midsummer Night's Dream, you dig into Shakespeare's entertaining story of young lovers as they're toyed with by mischievous forest sprites.Shakespeare claimed to have written this romantic comedy to show that \"love hath no law but its own.\" This study guide follows the action from scene to scene with commentaries that bring sense to the entertaining play, which is neither realistic nor tragic. Other features that help you figure out this important work includeLife and background of the authorIntroduction to and synopsis of the playAnalyses of all the characters and a character mapSummaries of each of the five actsA review section that tests your knowledge and suggests essay topicsClassic literature or modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Literary Criticism , Shakespeare",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "World Without Borders",
        "Authors": "By Brown, Lester Russell",
        "Description": "Provides an overview of major world problems and the growing need for peaceful coexistence among all nations",
        "Category": "",
        "Publisher": "Random House Inc",
        "Price Starting With ($)": "13.46",
        "Publish Date": {
            "Month": "August",
            "Year": "1972"
        }
    },
    {
        "Title": "A Tale of Two Sisters",
        "Authors": "By Maxted, Anna",
        "Description": "Cassie is slender, clever, charismatic, successful. The one flaw in her perfect life may be her marriage. Her sister Lizbet is plumper, plainer, dreamier. An aspiring journalist, she?s stuck writing embarrassing articles on sex for Ladz Mag. Her one achievement is her relationship with Tim, who thinks she?s amusing and smart. Despite Cassie being the favored child, she and Lizbet have always been best friends. But then Lizbet gets pregnant.  Forced apart by mistakes not their own, enticed by new loves, and confronted by challenges they never asked for, Cassie and Lizbet struggle to rediscover the simple goodness of their sisterhood, even as their lives take them on a collision course of heartache and new beginnings.  A Tale of Two Sisters is Anna Maxted at her best?a highly entertaining yet deeply involving story of sisters who lose their way and need each other to find themselves again..",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "How to Develop a Professional Portfolio: A Manual for Teachers (2nd Edition)",
        "Authors": "By Campbell, Dorothy M. (EDT), Cignetti, Pamela Bondi (EDT), Melenyzer, Beverly J. (EDT), Nettles, Diane H. (EDT), and Wyman, Richard M. (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Undress your stress: 30 curiously fun ways to take off tension",
        "Authors": "By Levy, Lois B",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Dupont Circle: A Novel",
        "Authors": "By Kafka-Gibbons, Paul",
        "Description": "Set in the nation's capital, this delightful comedy of manners centers on the busy intersection of Dupont Circle, where old meets young, gay meets straight, rich meets poor, and past meets present. Love and family intersect in similar ways in Paul Kafka-Gibbons's witty and entertaining novel. In a plot revolving around a judicial hearing on gay marriage, Kafka-Gibbons explores the lives of three distinctly different couples, examining marriage and domesticity in all its contemporary guises. With great charm and goodwill, DUPONT CIRCLE engages the issues as well as the heart.",
        "Category": " Fiction , Literary",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Tale of Peter Rabbit Story Board Book",
        "Authors": "By Potter, Beatrix",
        "Description": "Finally, The Tale of Peter Rabbit is available in a colorful board book. This generously sized book tells Beatrix Potter's famous tale of naughty Peter Rabbit's adventures in Mr. McGregor's garden. Young children will be enchanted by the simple text and beautiful illustrations, which bring a classic story vibrantly to life. The board book format is sturdy and accessible, perfect for young readers, but adults will enjoy it too for bed-time read-aloud. As a board book, The Tale of Peter Rabbit will captivate children and offer them an early introduction to the world of Peter Rabbit and all his friends.",
        "Category": " Juvenile Fiction , Lifestyles , Country Life",
        "Publisher": "Warne",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Bread Machine Magic Book of Helpful Hints: Dozens of Problem-Solving Hints and Troubleshooting Techniques for Getting the Most Out of Your Bread",
        "Authors": "By Rehberg, Linda and Conway, Lois",
        "Description": "A delectable cookbook by the authors of Bread Machine Magic features more than 140 new recipes, such as Buttermilk Wheat Bread and Challah, and offers clear, step-by-step baking instructions, preparation hints, and helpful tips. Original.",
        "Category": " Cooking , Courses & Dishes , Bread",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "North River: A Novel",
        "Authors": "By Hamill, Pete",
        "Description": "One snowy New Year's Day, in the midst of the Great Depression, Dr. James Delaney--haunted by the slaughters of the Great War, and abandoned by his wife and daughter--returns home to find his three-year-old grandson on his doorstep, left by his mother in Delaney's care.  Coping with this unexpected arrival, Delaney hires Rose, a tough, decent Sicilian woman with a secret in her past. Slowly, as Rose and the boy begin to care for the good doctor, the numbness in Delaney begins to melt.  Recreating 1930s New York with the vibrancy and rich detail that are his trademarks, Pete Hamill weaves a story of honor, family, and one man's simple courage that no reader will soon forget.",
        "Category": " Fiction , Literary",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "The Knight at Dawn (Magic Tree House, No. 2)",
        "Authors": "By Murdocca, Sal (ILT) and Osborne, Mary Pope",
        "Description": "The #1 bestselling chapter book series of all time celebrates 25 years with new covers and a new, easy-to-use numbering system!A castle with a secret passage! That's what Jack and Annie find when the Magic Tree House whisks them back to the Middle Ages for another wild adventure. In the Great Hall of the castle, a feast is under way. But Jack and Annie aren't exactly welcome guests!Did you know that there’s a Magic Tree House book for every kid?Magic Tree House: Adventures with Jack and Annie, perfect for readers who are just beginning chapter booksMerlin Missions: More challenging adventures for the experienced readerSuper Edition: A longer and more dangerous adventureFact Trackers: Nonfiction companions to your favorite Magic Tree House adventuresHave more fun with Jack and Annie at MagicTreeHouse.com!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Found: God's Will (Find the Direction and Purpose God Wants for Your Life)",
        "Authors": "By MacArthur, John",
        "Description": "Over 250,000 in print!       GET READY FOR A SURPRISE!       You may want to jump and shout when you read the sixth principle for knowing     when you have found God's will.       The sixth principle is \"Do whatever you want\" as long as the first five principles     are operating in your life.       Read about all six principles to better understand what the psalmist means when     he urges, \"Delight thyself also in the Lord; and He shall give thee the desires     of thine heart\" (Psalm 37:4).     The MacArthur Study Series is designed to help Christians better understand     and apply the Bible by better understanding some of its key truths and doctrines.",
        "Category": " Religion , Christianity , General",
        "Publisher": "David C Cook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Praying Through the Tough Times",
        "Authors": "By Ogilvie, Lloyd John",
        "Description": "",
        "Category": "",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Christian Basics: A Primer for Pilgrims",
        "Authors": "By Fackre, Gabriel and Fackre, Dorothy",
        "Description": "",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Wm. B. Eerdmans-Lightning Source",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "The Essential Guide to Nature Walking in the United States",
        "Authors": "By Cook, Charles",
        "Description": "From one of our nation's greatest outdoor enthusiasts, a man whose wide-ranging experience includes walking America's most spectacular trails, comes this invaluable state-by-state guide to an extraordinary range of areas for easy-to-moderate nature walks. This book is ideal for walkers of all ages and abilities who wish to sample more of nature's beauty - from seniors to young adventurers, from fitness walkers to those who want to take it easy. Cook explains how, with very little equipment, anyone can delight in the almost instantaneous lift offered by nature, and his writing will inspire you to join the millions who have learned that walking is the quickest way to appreciate the outdoors. He shares his years of experience, with practical tips on clothing and gear, safety and comfort, and nature observation and conservation. Addresses and phone numbers are included to make it easy to get additional information, and state maps show the location of each area.",
        "Category": "",
        "Publisher": "Owlet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Group Therapy With Children and Adolescents: A Treatment Manual",
        "Authors": "By Siepker, Barbara B. and Kandaras, Christine S. (EDT)",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Human Sciences Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Meditations for Parents Who Do Too Much",
        "Authors": "By Lazear, Jonathon and Lazear, Wendy",
        "Description": "A guide to coping with parenthood uses quotations from a wide variety of sources to look at the obligations, responsibilities, and rewards of raising children and offers advice to parents on how to take better care of their children and themselves. Original.",
        "Category": " Social Science , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Apple's America: The Discriminating Traveler's Guide to 40 Great Cities in the United States and Canada",
        "Authors": "By Apple, R. W., Jr.",
        "Description": "Unpretentious, sophisticated, and always appetizing advice from a celebrated authorityFor more than thirty years, R. W. Apple Jr. has roamed the United States as an eyewitness to history. Here, in Apple's America, his robust enthusiasm for the food and culture of New England, the South and West, the Atlantic and Pacific coasts, and his native Middle West carries him to forty great cities, where he proves to be our ideal guide--amused and amusing, knowledgeable, indefatigable, and endlessly curious.\\From Boston to Honolulu, from Montreal to Las Vegas, Cincinnati to Seattle, Johnny Apple explores the landmarks, architecture, business, culture, and, of course, the food and beverages of his favorite urban communities. Capturing the tone and style of American city life to perfection, he shows us the hidden treasures, the best buildings, the famous landmarks, the historical aura, and the present-day realities that make each city so memorable. And in each he recommends several places to stay, numerous places to eat, and sites or activities you shouldn't miss. No traveler in the United States will want to do without his recommendations.",
        "Category": " Travel , United States , General",
        "Publisher": "North Point Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "On Liberty",
        "Authors": "By Mill, John Stuart and Himmelfarb, Gertrude",
        "Description": "Presents the British political philosopher's classic work on the nature of personal freedom and the individual's relationship to society.",
        "Category": " Philosophy , General",
        "Publisher": "Longman",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Following Jesus Without Embarrassing God",
        "Authors": "By Campolo, Tony",
        "Description": "With candor and insight, Tony Campolo passionately hits on hot button issues that impact the Christian life, including how to: protect yourself from technology without becoming Amish; have a devotional life without becoming a monk, and figure out the will of God without hearing voices from Heaven.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Word Publishing",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Slumber of Christianity: Awakening a Passion for Heaven on Earth",
        "Authors": "By Dekker, Ted",
        "Description": "As believers, our walk with God is motivated by hope-not the bland, vague notion most people have, but the expectation of an exotic, pleasurable inheritance that guides us and fires our passion...or, at least, should.Ted Dekker has written an expose on the death of pleasure within the Church. Because many of us have set aside hope and the inspired imagination that drives it, Dekker says we have been lulled into a slumber of boredom, even despondency. Our faith wanes, the joy at having been liberated fades, and we feel powerless. The Slumber of Christianity explores what robs us of happiness and how we can rediscover it and live lives that rekindle hope. The pursuit of pleasure is a gift to all humans-a function of the Creator himself, who is bent upon our happiness. It's time for Christians to reclaim our inheritance of pleasure. The Slumber of Christianity will inflame hearts toward full-fledged, mind-expanding encounters with hope, through the imagination.",
        "Category": " Religion , Spirituality",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "You can make it!",
        "Authors": "By Bakker, Jim",
        "Description": "",
        "Category": "",
        "Publisher": "PTL Enterprises",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Dollars & Sense of Battlefield Preservation: The Economic Benefits of Protecting Civil War Battlefields: A Handbook for  Community Leaders",
        "Authors": "By Kennedy, Frances H.",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "Preservation Pr",
        "Price Starting With ($)": "7.06",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "When the Last Leaf Falls",
        "Authors": "By Myers, Bill",
        "Description": "What emotions fill the heart of a father whose child is struggling with cancer? Pastor Paul Newcombe feels them all. The fear. The hope. The heartbreak of seeing his spirited teenage daughter endure the ravages of a deadly disease. The tests of faith.Yet in the midst of Ally’s illness, love takes on a new richness. The tensions of chemotherapy and surgery find their release not just in tears but also in unexpected times of laughter as golden memories are cherished and new ones are created. The death-defying adventures of Dad on roller blades . . . Ally’s first driving lesson (insisting she begin with stick shift was a big mistake) . . . the visit to the art museum, young love, family food fights . . . through it all, the bond between a father and his daughter emerges, warm, humorous, poignant, triumphant.So, too, does the faith of Grandpa Newcombe. Having traded the pastorate for the paintbrush after a lifetime of ministry, his passionate quest is to express the love of God through his art. It’s a goal his best efforts never quite seem to capture. But while he may never paint his great work of art, he is definitely helping to shape another masterpiece . . . his granddaughter.Based on The Last Leaf, a short story by O. Henry, When the Last Leaf Falls is a celebration of family and faith filled with laughter and tears, and an unforgettable portrait of God’s unfailing love.",
        "Category": " Religion , Devotional",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Collateral Damage (The Sisterhood: Rules of the Game, Book 4)",
        "Authors": "By Michaels, Fern",
        "Description": "The Sisterhood is asked by a mysterious client to find a computer hacker who has stolen a list of secret fundraisers' names and sold it to an identity-theft ring, and they soon discover that the job is more dangerous than they expected.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Hannah's Dream: A Novel",
        "Authors": "By Hammond, Diane",
        "Description": "An elephant never forgets . . . but can she dream?For forty-one years, Samson Brown has been caring for Hannah, the lone elephant at the down-at-the-heels Max L. Biedelman Zoo. Having vowed not to retire until an equally loving and devoted caretaker is found to replace him, Sam rejoices when smart, compassionate Neva Wilson is hired as the new elephant keeper. But Neva quickly discovers what Sam already knows: that despite their loving care, Hannah is isolated from other elephants and her feet are nearly ruined from standing on hard concrete all day. Using her contacts in the zookeeping world, Neva and Sam hatch a plan to send Hannah to an elephant sanctuary—just as the zoo's angry, unhappy director launches an aggressive revitalization campaign that spotlights Hannah as the star attraction, inextricably tying Hannah's future to the fate of the Max L. Biedelman Zoo.A charming, poignant, and captivating novel certain to enthrall readers of Water for Elephants, Diane Hammond's Hannah's Dream is a beautifully told tale rich in heart, humor, and intelligence.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Last of the Mohicans (Cliffs Notes)",
        "Authors": "By Roundtree, Thomas J.",
        "Description": "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background. The latest generation of titles in this series also feature glossaries and visual elements that complement the classic, familiar format.CliffsNotes on The Last of the Mohicans is a fanciful and romantic tale of the Mohicans, a disappearing tribe of Native Americans in the frontier. The action centers on a frontier scout during the French and Indian Wars, who plays a part in the wresting of a continent from nature and the original inhabitants.With expert commentaries and critical analyses, this study guide helps you explore the American Frontier in the mid-eighteenth century and how conflicting forces meet head-on – with tragic results. You'll also gain insight into the man behind this American classic, James Fenimore Cooper. Other features that help you study includeCharacter analyses of major playersCritical essays on the plot, setting, and themesA review section that tests your knowledgeGlossary of key words and termsClassic literature or modern modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliff Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1965"
        }
    },
    {
        "Title": "Homer's Iliad",
        "Authors": "By Sider, David, Konstan, David, and Brodwin, Stanley",
        "Description": "",
        "Category": " Study Aids , General",
        "Publisher": "Monarch Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Revolution in the Third World",
        "Authors": "By Chaliand, Gerard",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1978"
        }
    },
    {
        "Title": "The Ultimate Bridal Shower Idea Book: How to Have a Fun, Fabulous, and Memorable Party",
        "Authors": "By Naylor, Sharon",
        "Description": "A complete guide to planning a memorable bridal shower presents a host of innovative suggestions for original party themes, games, prizes, and more, along with a host of practical tips on invitations, food, guest lists, and other essentials. Original. 15,000 first printing.",
        "Category": " Reference , Weddings",
        "Publisher": "Prima Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Why I'm Like This: True Stories",
        "Authors": "By Kaplan, Cynthia",
        "Description": "Cynthia Kaplan takes us on a hilarious and sometimes heartbreaking journey through her unique, uncensored world—her bungled romantic encounters and unsung theatrical experiences; her gadget-obsessed father, her pill-popping therapist, and her eccentric grandmothers; her fearless husband, whom she engages in an ongoing battle over which of them is the most popular person in their apartment; and, of course, her vengeful, power-hungry one-year-old son.Kaplan's voice is a lot like the one in our heads—the one that most of us are only willing to listen to late at night . . . maybe while locked in a closet. What a relief it is that someone finally admits that she is afraid of nearly everything; that she is jealous even of people whose lives are on the verge of collapse; and that she has, at times, tried to pass for a gentile.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Myths and Legends of Indians of the Southwest: Book II : Hopi, Acoma, Tewa, Zuni",
        "Authors": "By Dutton, Bertha and Olin, Caroline",
        "Description": "",
        "Category": " Social Science , Ethnic Studies , Native American Studies",
        "Publisher": "Bellerophon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1978"
        }
    },
    {
        "Title": "The Wonderful Journey",
        "Authors": "By McBarnet, Gill",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Ruwanga Trading",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Blue at the Mizzen (Aubrey / Maturin)",
        "Authors": "By O'Brian, Patrick",
        "Description": "",
        "Category": "",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Spark Notes 1984",
        "Authors": "By Orwell, George",
        "Description": "Get your \"A\" in gear!They're today's most popular study guides-with everything you need to succeed in school. Written by Harvard students for students, since its inception SparkNotes™ has developed a loyal community of dedicated users and become a major education brand. Consumer demand has been so strong that the guides have expanded to over 150 titles. SparkNotes'™ motto is Smarter, Better, Faster because:They feature the most current ideas and themes, written by experts.They're easier to understand, because the same people who use them have also written them.The clear writing style and edited content enables students to read through the material quickly, saving valuable time.And with everything covered--context; plot overview; character lists; themes, motifs, and symbols; summary and analysis, key facts; study questions and essay topics; and reviews and resources--you don't have to go anywhere else!",
        "Category": " Study Aids , Book Notes",
        "Publisher": "SparkNotes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Under and Alone: The True Story of the Undercover Agent Who Infiltrated America's Most Violent Outlaw Motorcycle Gang",
        "Authors": "By Queen, William",
        "Description": "In 1998, William Queen was a veteran law enforcement agent with a lifelong love of motorcycles and a lack of patience with paperwork. When a “confidential informant” made contact with his boss at the Bureau of Alcohol, Tobacco and Firearms, offering to take an agent inside the San Fernando chapter of the Mongols (the scourge of Southern California, and one of the most dangerous gangs in America), Queen jumped at the chance, not realizing that he was kicking-starting the most extensive undercover operation inside an outlaw motorcycle gang in the history of American law enforcement. Nor did Queen suspect that he would penetrate the gang so successfully that he would become a fully “patched-in” member, eventually rising through their ranks to the office of treasurer, where he had unprecedented access to evidence of their criminal activity. After Queen spent twenty-eight months as “Billy St. John,” the bearded, beer-swilling, Harley-riding gang-banger, the truth of his identity became blurry, even to himself.During his initial “prospecting” phase, Queen was at the mercy of crank-fueled criminal psychopaths who sought to have him test his mettle and prove his fealty by any means necessary, from selling (and doing) drugs, to arms trafficking, stealing motorcycles, driving getaway cars, and, in one shocking instance, stitching up the face of a Mongol “ol’ lady” after a particularly brutal beating at the hands of her boyfriend.Yet despite the constant criminality of the gang, for whom planning cop killings and gang rapes were business as usual, Queen also came to see the genuine camaraderie they shared. When his lengthy undercover work totally isolated Queen from family, his friends, and ATF colleagues, the Mongols felt like the only family he had left. “I had no doubt these guys genuinely loved Billy St. John and would have laid down their lives for him. But they wouldn’t hesitate to murder Billy Queen.”From Queen’s first sleight of hand with a line of methamphetamine in front of him and a knife at his throat, to the fearsome face-off with their decades-old enemy, the Hell’s Angels (a brawl that left three bikers dead), to the heartbreaking scene of a father ostracized at Parents’ Night because his deranged-outlaw appearance precluded any interaction with regular citizens, Under and Alone is a breathless, adrenaline-charged read that puts you on the street with some of the most dangerous men in America and with the law enforcement agents who risk everything to bring them in.",
        "Category": " True Crime , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "A Prayer for the City",
        "Authors": "By Bissinger, Buzz",
        "Description": "From the Pulitzer Prize-winning author of Friday Night Lights, the heart-wrenching and hilarious true story of an American city on its knees and a man who will do anything to save it.A Prayer for the City is acclaimed journalist Buzz Bissinger's true epic of Philadelphia mayor Ed Rendell, an utterly unique, unorthodox, and idiosyncratic leader willing to go to any length for the sake of his city: take unions head on, personally lobby President Clinton to save 10,000 defense jobs, or wrestle Smiley the Pig on Hot Dog Day—all the while bearing in mind the eternal fickleness of constituents whose favor may hinge on a missed garbage pick-up or an overzealous meter maid. It is also the story of citizens in crisis: a woman fighting ceaselessly to give her great-grandchildren a better life, a father of six who may lose his job at the Navy Shipyard, and a policy analyst whose experiences as a crime victim tempt her to abandon her job and ideals. \"Fascinating, humane\" (The New Yorker) and alive with detail and insight, A Prayer for the City describes the rare combination of political courage and optimism that may be the only hope for America's urban centers.",
        "Category": " Political Science , Public Policy , City Planning & Urban Development",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Lord of promises",
        "Authors": "By Lawson, E. LeRoy",
        "Description": "",
        "Category": "",
        "Publisher": "Standard Pub",
        "Price Starting With ($)": "7.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Look Back All the Green Valley: A Novel",
        "Authors": "By Chappell, Fred",
        "Description": "When Jess Kirkman returns to his hometown in the North Carolina mountains ten years after his father's death, he finds, in a hidden workroom, a map, a strange machine, and hints about a secret side of his father's life. 20,000 first printing. Tour.",
        "Category": " Fiction , Literary",
        "Publisher": "Picador USA",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Commoner: A Novel (Vintage Contemporaries)",
        "Authors": "By Schwartz, John Burnham",
        "Description": "In this national bestseller from the author of Reservation Road, a young woman, Haruko, becomes the first nonaristocratic woman to penetrate the Japanese monarchy. When she marries the Crown Prince of Japan in 1959, Haruko is met with cruelty and suspicion by the Empress, and controlled at every turn as she tries to navigate this mysterious, hermetic world, suffering a nervous breakdown after finally giving birth to a son. Thirty years later, now Empress herself, she plays a crucial role in persuading another young woman to accept the marriage proposal of her son, with tragic consequences. Based on extensive research, The Commoner is a stunning novel about a brutally rarified and controlled existence, and the complex relationship between two isolated women who are truly understood only by each other.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Accademia Gallery: The Official Guide",
        "Authors": "By Franca Falletti",
        "Description": "",
        "Category": "",
        "Publisher": "Giunti Editore",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Senator's Wife (Vintage Contemporaries)",
        "Authors": "By Miller, Sue",
        "Description": "Meri is newly married, pregnant, and standing on the cusp of her life as a wife and mother, recognizing with some terror the gap between reality and expectation. Delia—wife of the two-term liberal senator Tom Naughton—is Meri's new neighbor in the adjacent New England town house. Tom's chronic infidelity has been an open secret in Washington circles, but despite the complexity of their relationship, the bond between them remains strong. Soon Delia and Meri find themselves leading strangely parallel lives, as they both reckon with the contours and mysteries of marriage: one refined and abraded by years of complicated intimacy, the other barely begun. With precision and a rich vitality, Sue Miller—beloved and bestselling author of While I Was Gone—brings us a highly charged, superlative novel about marriage and forgiveness.",
        "Category": " Fiction , Women",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Obedience: A Novel",
        "Authors": "By Lavender, Will",
        "Description": "When the students in Winchester University’s Logic and Reasoning 204 arrive for their first day of class, they are greeted not with a syllabus or texts, but with a startling assignment from Professor Williams: Find a hypothetical missing girl named Polly. If after being given a series of clues and details the class has not found her before the end of the term in six weeks, she will be murdered.At first the students are as intrigued by the premise of their puzzle as they are wary of the strange and slightly creepy Professor Williams. But as they delve deeper into the mystery, the boundary between the classroom and the real world is blurred and the students wonder if it is their own lives they are being asked to save.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Lark and Termite",
        "Authors": "By Phillips, Jayne Anne",
        "Description": "A rich, wonderfully alive novel from one of our most admired and best-loved writers, her first book in nine years. Lark and Termite is set during the 1950s in West Virginia and Korea. It is a story of the power of loss and love, the echoing ramifications of war, family secrets, dreams and ghosts, and the unseen, almost magical bonds that unite and sustain us.At its center, two children: Lark, on the verge of adulthood, and her brother, Termite, a child unable to walk and talk but filled with radiance. Around them, their mother, Lola, a haunting but absent presence; their aunt Nonie, a matronly, vibrant woman in her fifties, who raises them; and Termite’s father, Corporal Robert Leavitt, who finds himself caught up in the chaotic early months of the Korean War.Told with deep feeling, the novel invites us to enter into the hearts and thoughts of the leading characters, even into Termite’s intricate, shuttered consciousness. We are with Leavitt, trapped by friendly fire alongside the Korean children he tries to rescue. We see Lark’s dreams for Termite and her own future, and how, with the aid of a childhood love and a spectral social worker, she makes them happen. We learn of Lola’s love for her soldier husband and her children, and unravel the mystery of her relationship with Nonie. We discover the lasting connections between past and future on the night the town experiences an overwhelming flood, and we follow Lark and Termite as their lives are changed forever.",
        "Category": " Fiction , Coming of Age",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Banquet at Delmonico's: Great Minds, the Gilded Age, and the Triumph of Evolution in America",
        "Authors": "By Werth, Barry",
        "Description": "In Banquet at Delmonico’s, Barry Werth, the acclaimed author of The Scarlet Professor, draws readers inside the circle of philosophers, scientists, politicians, businessmen, clergymen, and scholars who brought Charles Darwin’s controversial ideas to America in the crucial years after the Civil War.The United States in the 1870s and ’80s was deep in turmoil–a brash young nation torn by a great depression, mired in scandal and corruption, rocked by crises in government, violently conflicted over science and race, and fired up by spiritual and sexual upheavals. Secularism was rising, most notably in academia. Evolution–and its catchphrase, “survival of the fittest”–animated and guided this Gilded Age.Darwin’s theory of natural selection was extended to society and morals not by Darwin himself but by the English philosopher Herbert Spencer, father of “the Law of Equal Freedom,” which holds that “every man is free to do that which he wills,” provided it doesn’t infringe on the equal freedom of others. As this justification took root as a social, economic, and ethical doctrine, Spencer won numerous influential American disciples and allies, including industrialist Andrew Carnegie, clergyman Henry Ward Beecher, and political reformer Carl Schurz. Churches, campuses, and newspapers convulsed with debate over the proper role of government in regulating Americans’ behavior, this country’s place among nations, and, most explosively, the question of God’s existence.In late 1882, most of the main figures who brought about and popularized these developments gathered at Delmonico’s, New York’s most venerable restaurant, in an exclusive farewell dinner to honor Spencer and to toast the social applications of the theory of evolution. It was a historic celebration from which the repercussions still ripple throughout our society.Banquet at Delmonico’s is social history at its finest, richest, and most appetizing, a brilliant narrative bristling with personal intrigue, tantalizing insights, and greater truths about American life and culture.",
        "Category": " History , United States , 19th Century",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Who Will Write Our History?: Rediscovering a Hidden Archive from the Warsaw Ghetto",
        "Authors": "By Kassow, Samuel D.",
        "Description": "In 1940, in the Jewish ghetto of Nazi-occupied Warsaw, the Polish historian Emanuel Ringelblum established a clandestine scholarly organization called the Oyneg Shabes to record the experiences of the ghetto's inhabitants. For three years, members of the Oyneb Shabes worked in secret to chronicle the lives of hundereds of thousands as they suffered starvation, disease, and deportation by the Nazis. Shortly before the Warsaw ghetto was emptied and razed  in 1943, the Oyneg Shabes buried thousands of documents from this massive archive in milk cans and tin boxes, ensuring that the voice and culture of a doomed people would outlast the efforts of their enemies to silence them. Impeccably researched and thoroughly compelling, Samuel D. Kassow's Who Will Write Our History? tells the tragic story of Ringelblum and his heroic determination to use historical scholarship to preserve the memory of a threatened people.",
        "Category": " History , Europe , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "7.1",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Translator: A Memoir",
        "Authors": "By Hari, Daoud, Burke, Dennis Michael (CON), and McKenna, Megan M. (CON)",
        "Description": "The young life of Daoud Hari–his friends call him David–has been one of bravery and mesmerizing adventure. The Translator is a suspenseful, harrowing, and deeply moving memoir of how one person has made a difference in the world, an on-the-ground account of one of the biggest stories of our time: the brutal genocide under way in Darfur.In 2003, Daoud Hari, a Zaghawa tribesman, was among the hundreds of thousands of villagers attacked and driven from their homes by Sudanese-government-backed militia groups. Though Hari’s village was burned to the ground, his family decimated and dispersed, he himself escaped, eventually finding safety across the border. With his high school knowledge of languages, Hari offered his services as a translator and guide. In doing so, however, he had to return to the heart of darkness–and he has risked his life again and again to help ensure that the story of his people is told while there is still time to save them.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Guilty: Liberal \"Victims\" and Their Assault on America",
        "Authors": "By Coulter, Ann H.",
        "Description": "“Liberals seem to have hit upon a reverse Christ story as their belief system. He suffered and died for our sins; liberals make the rest of us suffer for sins we didn’t commit.”Who are the victims here? To hear liberals tell it, you’d think they do nothing but suffer at the hands of ruthless entities like the “Republican Attack Machine” and Fox News.Really?It’s just another instance of the Big Lie, of course, told so often that some people have actually started to believe it. In Guilty, Ann Coulter explodes this myth to reveal that when it comes to bullying, no one outdoes the Left. Citing case after case, ranging from the hilariously absurd to the shockingly vicious, Coulter dissects these so-called victims who are invariably the oppressors. For instance:•Single mothers: Getting pregnant isn’t like catching the flu. There are volitional acts involved–someone else explain it to Dennis Kucinich. By this purposeful act, single mothers cause irreparable harm to other human beings–their own children–as countless studies on the subject make clear.•The myth of the Republican Attack Machine: The most amazing thing liberals have done is create the myth of a compliant right-wing media with Republicans badgering baffled reporters into attacking Democrats. It’s so mad, it’s brilliant. It’s one kind of lie to say the Holocaust occurred when the Swedes killed the Jews. But it’s another kind of lie entirely to say the Holocaust occurred when the Jews killed the Nazis.•“Brave” liberals: In addition to being beautiful, compassionate tribunes of the downtrodden, liberals are brave. I know that because they’re always telling me how brave they are. Why, five nights a week, MSNBC’s Keith Olbermann courageously books guests who completely agree with him. It doesn’t get much braver than that.•Obambi’s luck: While B. Hussein Obama piously condemned attacks on candidates’ ­families, his media and campaign surrogates ripped open the court-sealed divorce records of his two principal opponents in his Senate race in Illinois.•The offenders are offended!: Republican senator George Allen’s career was destroyed when he made a joking remark to a privileged Indian American harassing him at campaign stops. When did rich kids become a new protected category that must be shielded from words that are insulting in other languages? How did Sidarth become a specially anointed victim? What did we ever do to India? And why didn’t we ever hear about the far more offensive anti-Semitic flyers of Allen’s opponent Jim Webb?One essential and recurring truth about self-righteous liberals, says Coulter, is that “they viciously attack all while wailing that they are the true victims.” With Guilty–a mordantly witty and shockingly specific catalog of offenses that liberals would rather we ignore and forget–Ann Coulter presents exhibits A through Z.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Crown Forum",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Child Care Today: Getting It Right for Everyone",
        "Authors": "By Leach, Penelope",
        "Description": "From the universally admired author of the best-selling classic Your Baby and Child, the first comprehensive—and objective—book on the state of child care in America and the world today. Who is caring for today’s children? How well are they succeeding? What does care cost, and who is paying for it? How do parents go about choosing care for their children, and are they satisfied with what they find? Penelope Leach answers these and other urgent questions with facts and figures gathered from the most current research, brought to life by the voices of parents, including those involved in her own five-year study.Leach sees “work-home balance” as being the major conundrum of the day. She delineates the challenge of fitting children’s unchanged needs into society’s changing demands and the dilemma of today’s parents needing to be in two places at once. She describes in detail the various ways Western countries address that challenge: care given by parents, extended family, and nonfamily; care provided in the child’s home, in other homes, and in professional settings; child care funded by paying parents or by the government. Considering the issues from the various viewpoints of politicians, policy makers, professionals, parents, and children themselves, the author discusses the impact of each kind of care on children of different ages.Leach highlights the urgent need in America today for measures to raise the quality of child care, and to make the best care we can provide available to all families, just as it is (often by government mandate) in most other developed nations. Setting out clearly and candidly what is known about every aspect of child care—including the often hidden feelings and fears of parents—Penelope Leach presents a critical case for building and implementing an agenda for change.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Well-Dressed Ape: A Natural History of Myself",
        "Authors": "By Holmes, Hannah",
        "Description": "The well-dressed ape, aka Homo sapiens, is a strange mammal. It mates remarkably often, and with unprecedented affection. With similar enthusiasm, it will eat to the point of undermining its own health–behavior unthinkable in wild animals. The human marks its territory with doors, fences, and plastic flamingos, yet if it’s too isolated it becomes depressed. It thinks of itself as complex, intelligent, and in every way superior to other animals–but is it, really?With wit, humility, and penetrating insight, science journalist Hannah Holmes casts the inquisitive eye of a trained researcher and reporter on . . . herself. And not just herself, but on our whole species–what Shakespeare called “the paragon of animals.” In this surprising, humorous, and edifying book, Holmes explores how the human animal–the eponymous well-dressed ape–fits into the natural world, even as we humans change that world in both constructive and destructive ways.Comparing and contrasting the biology and behavior of humans with that of other creatures, Holmes demonstrates our position as an animal among other animals, a product of–and subject to–the same evolutionary processes. And not only are we animals–we are, in some important ways (such as our senses of smell and of vision), pitiably inferior ones. That such an animal came to exist at all is unlikely. That we have survived and prospered is extraordinary. At the same time, Holmes reveals the ways in which Homo sapiens stands apart from other mammals and, indeed, all other animals. Despite the vast common ground we share with our fellow creatures, there are significant areas in which we are unique. No other animal, as far as we know, shares the human capacity for self-reflective thought or our talent for changing ourselves or our environment in response to natural challenges and opportunities. One result of these extraordinary characteristics is the spread of our species across the entire planet; another, unfortunately, is global warming.  Deftly mixing personal stories and observations with the latest scientific theories and research results, Hannah Holmes has fashioned an engaging and informative field guide to that oddest and yet most fascinating of primates: ourselves.",
        "Category": " Science , Life Sciences , Anatomy & Physiology",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Five Silly Turkeys",
        "Authors": "By Yoon, Salina",
        "Description": "Toddlers will love the silly Thanksgiving turkeys in this fun counting book full of silly turkeys doing very silly things!  From twirling on a dance floor to being chased by a bee to tanning in the sun, these are no ordinary Thanksgiving turkeys. This shiny fabric–tabbed book is a holiday treat that is sure to be gobbled up quickly.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "My Very First Book of Colors",
        "Authors": "By Carle, Eric",
        "Description": "What color is a bluebird? Easy to answer, but even easier when you have thecolor to match it with. Find the color in the top half of a page that matches the picture on the bottom half. From pink flowers to purple grapes, this colorful book is full of fun and surprises. Children will love solving these color puzzles featuring Eric Carle's bold and vibrant artwork.",
        "Category": " Juvenile Nonfiction , Concepts , Colors",
        "Publisher": "World of Eric Carle",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "DK Readers: Jobs People Do -- A Day in a Life of a Firefighter (Level 1: Beginning to Read) (DK Readers Level 1)",
        "Authors": "By Hayward, Linda",
        "Description": "A Level 1 DK Reader that accurately portrays a day in the life of a real firefighter, perfect for young children who are just learning to read.The fire alarm goes off! Rob Green and the other firefighters go into action. Is there time to save a little girl's dog? Find out in DK Readers: Jobs People Do — A Day in the Life of a Firefighter (Level 1: Beginning to Read).Perfect for 3–5 year-olds learning to read, Level 1 titles contain short, simple sentences with an emphasis on frequently used words. Stunning photographic images with labels provide visual clues to introduce and reinforce vocabulary.",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "It's Not News, It's Fark: How Mass Media Tries to Pass Off Crap As News",
        "Authors": "By Curtis, Drew",
        "Description": "A hilarious exposé on the media gone awry, from the creator of the wildly popular Fark.com.Have you ever noticed certain patterns in the news you see and read each day? Perhaps it’s the blatant fear-mongering in the absence of facts on your local six o’clock news (“Tsunami could hit the Atlantic any day!” Everybody panic!), or the seasonal articles that appear year after year (“Roads will be crowded this holiday season.” Thanks, AAA.). It’s Not News, It’s Fark is Drew Curtis’s clever examination of the state of the media today and a hilarious look at the go-to stories mass media uses when there’s just not enough hard news to fill a newspaper or a news broadcast. Drew exposes eight stranger-than-fiction media patterns that prove just how little reporting is going on in the world of reporters today. It’s Not News, It’s Fark examines all the “news” that was never fit for print in the first place, and promises to have you laughing along the way.",
        "Category": " Social Science , Media Studies",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Speeches for All Occasions",
        "Authors": "By Sonntag, Linda",
        "Description": "",
        "Category": "",
        "Publisher": "Mimosa Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "The Joys of Entertaining",
        "Authors": "By Bultman, Bethany Ewald and Church, Beverly Reese",
        "Description": "With the aid of this book's savvy authors, anyone can give--and enjoy giving--a successful, memorable party. Color photos and a lively text demonstrate how to set the stage for a truly festive affair; there are a dozens of table settings, eye-catching centerpieces, and fabulous invitations that defy refusal. Whether you give parties once a year or once a week, The Joys of Entertaining is the most comprehensive source on the subject.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Abbeville Pr",
        "Price Starting With ($)": "7.94",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Words That Sell",
        "Authors": "By Bayan, Richard",
        "Description": "\"A thesaurus that works as hard as you do . . . you'll wonder how you ever managed without it.\" -- Advertising Age  Listing more than 2,500 high-powered words, phrases, and slogans, Words That Sell is the ultimate reference for anyone who needs instant access to the key words that make the difference in selling. Arranged by category for handy reference, it covers everything from \"snappy transitions\" to \"knocking the competition,\" from \"grabbers\" to \"clinchers.\" There are 62 ways to say \"exciting\" alone; 57 variations on \"reliable\"!  Whether you are selling ideas or widgets, Words That Sell guarantees the expert sales professional an expanded, rejuvenated repertoire and the novice a feeling of confidence.  Features:    Cross-referencing of word categories to stimulate creative thinking Advice on targeting words to your specific market Tips on word usage A thorough index A concise copywriting primer A special section on selling yourself    The first real improvement to the thesaurus since Roget, Words That Sell is an indispensable guide to helping you find great words fast.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "The Life of the Party: How to Throw the Best Party You Ever Went to",
        "Authors": "By Callan, K.",
        "Description": "",
        "Category": "",
        "Publisher": "Sweden Pr",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Diane Warner's Big Book of Parties",
        "Authors": "By Warner, Diane",
        "Description": "This book covers everything from when to send out the invitations to making a list of guests, planning a menu, and creating a theme. There are hundreds of ideas in this book for every kind of party you can imagine.",
        "Category": " Cooking , Entertaining",
        "Publisher": "New Page Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Roosevelt's Secret War: FDR and World War II Espionage",
        "Authors": "By Persico, Joseph E.",
        "Description": "Despite all that has already been written on Franklin Delano Roosevelt, Joseph Persico has uncovered a hitherto overlooked dimension of FDR's wartime leadership: his involvement in intelligence and espionage operations.Roosevelt's Secret War is crowded with remarkable revelations:-FDR wanted to bomb Tokyo before Pearl Harbor-A defector from Hitler's inner circle reported directly to the Oval Office-Roosevelt knew before any other world leader of Hitler's plan to invade Russia-Roosevelt and Churchill concealed a disaster costing hundreds of British soldiers' lives in order to protect Ultra, the British codebreaking secret-An unwitting Japanese diplomat provided the President with a direct pipeline into Hitler's councilsRoosevelt's Secret War also describes how much FDR had been told--before the Holocaust--about the coming fate of Europe's Jews.   And Persico also provides a definitive answer to the perennial question Did FDR know in advance about the attack on Pearl Harbor?By temperament and character, no American president was better suited for secret warfare than FDR.  He manipulated, compartmentalized, dissembled, and misled, demonstrating a spymaster's talent for intrigue.  He once remarked, \"I never let my right hand know what my left hand does.\"  Not only did Roosevelt create America's first central intelligence agency, the OSS, under \"Wild Bill\" Donovan, but he ran spy rings directly from the Oval Office, enlisting well-placed socialite friends. FDR was also spied against. Roosevelt's Secret War presents evidence that the Soviet Union had a source inside the Roosevelt White House; that British agents fed FDR total fabrications to draw the United States into war; and that Roosevelt, by yielding to Churchill's demand that British scientists be allowed to work on the Manhattan Project, enabled the secrets of the bomb to be stolen.  And these are only a few of the scores of revelations in this constantly surprising story of Roosevelt's hidden role in World War II.",
        "Category": " History , Military , World War II",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "We've Never Done It Like This Before: 10 Creative Approaches to the Same Old Church Tasks",
        "Authors": "By Woods, C. Jeff",
        "Description": "",
        "Category": " Religion , Reference",
        "Publisher": "Rowman & Littlefield Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Hacking Exposed: Network Security Secrets & Solutions, Fourth Edition (Hacking Exposed)",
        "Authors": "By McClure, Stuart, Scambray, Joel, and Kurtz, George",
        "Description": "This text unveils the methods hackers use to break into systems, networks, and software, and suggest steps administrators can take to secure their computers at the different layers.  The fourth edition covers the latest hacking methods and adds a chapter on 802.11 wireless networks. The DVD-ROM contains a video presentation with PowerPoint slides. Annotation (c) Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Computers , Security , General",
        "Publisher": "McGraw-Hill Osborne Media",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "The Power of Intention",
        "Authors": "By Dyer, Wayne W.",
        "Description": "Intention is generally viewed as a pit-bull kind of determination propelling one to succeed at all costs by never giving up on an inner picture. In this view, an attitude that combines hard work with an indefatigable drive toward excellence is the way to succeed. However, intention is viewed very differently in this book. Dr. Wayne W. Dyerhas researched intention as a force in the universe that allows the act of creation to take place. This book explores intentionnot as something you dobut as an energy you’re a part of. We’re allintended here through the invisible power of intention. This is the first book to look at intention as a field of energy that you can access to begin co-creating your life with the power of intention.Part I deals with the principles of intention, offering true stories and examples on ways to make the connection. Dr. Dyer identifies the attributes of the all-creating universal mind of intention as creative, kind, loving, beautiful, expanding, endlessly abundant, and receptive, explaining the importance of emulating this source of creativity. In Part II, Dr. Dyer offers an intention guide with specific ways to apply the co-creating principles in daily life. Part III is an exhilarating description of Dr. Dyer’s vision of a world in harmony with the universal mind of intention.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Hay House",
        "Price Starting With ($)": "6.49",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Darwin's Radio",
        "Authors": "By Bear, Greg",
        "Description": "A 2000 HUGO AWARD NOMINEEGreg Bear's powerfully written, brilliantly inventive novels combine cutting-edge science and unforgettable characters, illuminating dazzling new technologies--and their dangers. Now, in Darwin's Radio, Bear draws on state-of-the-art biological and anthropological research to give us an ingeniously plotted thriller that questions everything we believe about human origins and destiny--as civilization confronts the next terrifying step in evolution.A mass grave in Russia that conceals the mummified remains of two women, both with child--and the conspiracy to keep it secret . . . a major discovery high in the Alps: the preserved bodies of a prehistoric family--the newborn infant possessing disturbing characteristics . . . a mysterious disease that strikes only pregnant women, resulting in miscarriage. Three disparate facts that will converge into one science-shattering truth.Molecular biologist Kaye Lang, a specialist in retroviruses, believes that ancient diseases encoded in the DNA of humans can again come to life. But her theory soon becomes chilling reality. For Christopher Dicken--a \"virus hunter\" at the Epidemic Intelligence Service--has pursued an elusive flu-like disease that strikes down expectant mothers and their offspring. The shocking link: something that has slept in our genes for millions of years is waking up. Now, as the outbreak of this terrifying disease threatens to become a deadly epidemic, Dicken and Lang, along with anthropologist Mitch Rafelson, must race against time to assemble the pieces of a puzzle only they are equipped to solve. An evolutionary puzzle that will determine the future of the human race . . . if a future exists at all.A fiercely intelligent, utterly enthralling novel of adventure and ideas, genetics and evolution, a fast-paced thriller that is grounded in the timeless human themes of struggle, loss, and redemption, Darwin's Radio is sure to become one of the most talked-about books of the year.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Slow Dance in Autumn",
        "Authors": "By Williams, Philip Lee",
        "Description": "Meet Hank Prince, Atlanta’s most engaging private eye.Meet Hank Prince, Atlanta’s most engaging private eye. He’s bold. He’s tough. He’s tenderhearted. A former AAA baseball player turned detective, Prince is a literate jock with an abiding appreciation of food, wine, and women. Lately Prince has fallen on hard times. His last love ran off with an encyclopedia salesman. He lost his boat, his house, and most of its contents, and he sloshes when he jogs, all due in part to his fondness for Evan Williams bourbon.Prince is ready to bail out of the private eye business altogether when he gets drawn into the mystery surrounding an old friend’s disappearance. Reinvigorated by the search, Prince pursues the truth and trips acorss a priceless artifact that seems to point to a reason for his friend’s demise. He also stumbles upon Ginny Calvert, and rediscovers the thrill of a new love.Hardboiled, appealing, Hank Prince might not be the world’s most perfect detective, but he knows the difference between right and wrong, and that’s the code he lives by. When you’ve finished reading Slow Dance in Autumn, you’ll be ready for Hank Prince’s next case.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Peachtree Publishers",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Instruction for All Students",
        "Authors": "By Rutherford, Paula",
        "Description": "The second edition of this popular book is updated to reflect current research about best practice in teaching and learning in standards-based classrooms. In addition to resources for actively engaging students and multiple approaches to lesson and unite design, this text includes information on technology integration, formative assessment, 21st century thinking skills that promote rigor and relevance, and formats for job-embedded learning. A CD-ROM of templates is included.",
        "Category": " Education , Educational Policy & Reform , General",
        "Publisher": "Just Ask Pubns",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Rodale's Encyclopedia of Indoor Gardening",
        "Authors": "By Halpin, Anne Moyer (EDT)",
        "Description": "Advice on growing healthy ornamental and edible plants without using toxic chemicals, incorporating tips on creating energy-efficient environments, augments a special encyclopedia section providing detailed cultural information on 250 plants",
        "Category": " Technology & Engineering , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "October",
            "Year": "1980"
        }
    },
    {
        "Title": "A Guiding Star (Gables of Legacy Volume Two)",
        "Authors": "By Stansfield, Anita",
        "Description": "",
        "Category": " Fiction , Religious",
        "Publisher": "Covenant Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Bioinformatics: A Practical Guide to the Analysis of Genes and Proteins, Second Edition",
        "Authors": "By Baxevanis, Andreas D. (EDT) and Ouellette, B. F. Francis (EDT)",
        "Description": "\"In this book, Andy Baxevanis and Francis Ouellette . . . have undertaken the difficult task of organizing the knowledge in this field in a logical progression and presenting it in a digestible form. And they have done an excellent job. This fine text will make a major impact on biological research and, in turn, on progress in biomedicine. We are all in their debt.\"-Eric Lander from the Foreword Reviews from the First Edition \"...provides a broad overview of the basic tools for sequence analysis ... For biologists approaching this subject for the first time, it will be a very useful handbook to keep on the shelf after the first reading, close to the computer.\"-Nature Structural Biology \"...should be in the personal library of any biologist who uses the Internet for the analysis of DNA and protein sequence data.\" -Science \"...a wonderful primer designed to navigate the novice through the intricacies of in scripto analysis ... The accomplished gene searcher will also find this book a useful addition to their library ... an excellent reference to the principles of bioinformatics.\"-Trends in Biochemical Sciences This new edition of the highly successful Bioinformatics: A Practical Guide to the Analysis of Genes and Proteins provides a sound foundation of basic concepts, with practical discussions and comparisons of both computational tools and databases relevant to biological research. Equipping biologists with the modern tools necessary to solve practical problems in sequence data analysis, the Second Edition covers the broad spectrum of topics in bioinformatics, ranging from Internet concepts to predictive algorithms used on sequence, structure, and expression data. With chapters written by experts in the field, this up-to-date reference thoroughly covers vital concepts and is appropriate for both the novice and the experienced practitioner. Written in clear, simple language, the book is accessible to users without an advanced mathematical or computer science background. This new edition includes: * All new end-of-chapter Web resources, bibliographies, and problem sets * Accompanying Web site containing the answers to the problems, as well as links to relevant Web resources * New coverage of comparative genomics, large-scale genome analysis, sequence assembly, and expressed sequence tags * A glossary of commonly used terms in bioinformatics and genomics Bioinformatics: A Practical Guide to the Analysis of Genes and Proteins, Second Edition is essential reading for researchers, instructors, and students of all levels in molecular biology and bioinformatics, as well as for investigators involved in genomics, positional cloning, clinical research, and computational biology.",
        "Category": " Science , Life Sciences , Biochemistry",
        "Publisher": "Wiley-Interscience",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Easy Computing For Seniors",
        "Authors": "By Frank W. Cawood and Associates (EDT)",
        "Description": "",
        "Category": " Computers , Reference",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "The Easter Story (St. Joseph Picture Books,)",
        "Authors": "By Winkler, Jude",
        "Description": "",
        "Category": " Religion , Christian Rituals & Practice , Worship & Liturgy",
        "Publisher": "Winker Jude",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Jesus Loves Me (Cuddle and Sing Board Book)",
        "Authors": "By Anderson, Debby",
        "Description": "Cuddle and Sing is the bestselling board book series that teaches the love of Jesus to children ages zero to three. This series teaches biblical truths through brightly colored art and tunes young children know and love. New cover designs add freshness. Ages 0-3.",
        "Category": " Juvenile Nonfiction , Religion , Christianity",
        "Publisher": "David C Cook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Peek-a Who? (Lift the Flap Books, Interactive Books for Kids, Interactive Read Aloud Books)",
        "Authors": "By Laden, Nina",
        "Description": "Scholastic Magazine's 100 Greatest Books for KidsNearly a million copies in print!Colorful pictures and simple rhyming texts help children guess what's peeking through the die-cut windows in this delightful board book. The anticipation of what's hiding on the next page and the bright, engaging illustrations will keep curious babies and toddlers guessing and giggling all the way to the surprise ending.And don't forget to check out the Peek-a Who Matching Game!",
        "Category": " Juvenile Fiction , Sports & Recreation , Games",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    }
]