[
    {
        "Title": "The Joy of Work: Dilbert's Guide to Finding Happiness at the Expense of Your Co-Workers",
        "Authors": "By Adams, Scott",
        "Description": "‘I cried because I did not have an office with a door, until I met a man who had no cubicle.’ DilbertA message from Scott Adams:I think the next wave of office design will focus on eliminating the only remaining obstacle to office productivity: your happiness. Happiness isn’t a physical thing, like walls and doors. But it’s closely related. Managers know that if they can eliminate all traces of happiness, the employees won’t be so picky about their physical surroundings. Once you’re hopelessly unhappy, you won’t bother to complain if your boss rolls you up in a tight ball and crams you into a cardboard box.As soon as I noticed this disturbing threat to workplace happiness, I did some investigative work and discovered it wasn’t confined to the issue of office design. Companies were making a direct frontal assault on employee happiness in every possible way! I knew there was only one thing that could stop the horror.It was time for another Dilbert book. It might sound corny, but I felt an obligation to society. People told me it was time for me to ‘give something back to the community.’ This scared me, until I realised that no one knows I furnished my house with street signs and park benches. So I interpreted the ‘give something back to the community’ message as a plea for me to write this book and then charge the community to read it.In the first part of this book I will tell you how to find happiness at the expense of your co-workers, managers, customers, and – best of all – those lazy stockholders. The second part of the book teaches you my top-secret methods for mining humour out of ordinary situations, thus making it easier to mock the people around you. The third part of the book is made entirely of invisible pages. If the book seems heavier than it looks, that’s why.Office Prank #44: Sounds That Drive Co-workers Crazy. You can produce sounds in the office that will drive your co-workers insane. That can be very entertaining. Every co-worker is different, so you might have to experiment to find the sounds that are most annoying to your cubicle neighbour. It’s worth the effort.",
        "Category": " Humor , Topic , Business & Professional",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Shades of Gray",
        "Authors": "By Reeder, Carolyn",
        "Description": "In the aftermath of the Civil War, recently orphaned Will must start a new life and overcome his prejudices. Courage wears many faces… The Civil War may be over, but for twelve-year-old Will Page, the pain and bitterness haven’t ended. How could they have, when the Yankees were responsible for the deaths of everyone in his entire immediate family? And now Will has to leave his comfortable home in the Shenandoah Valley and live with relatives he has never met, people struggling to eke out a living on their farm in the war-torn Virginia Piedmont. But the worst of it is that Will’s uncle Jed had refused to fight for the Confederacy. At first, Will regards his uncle as a traitor—or at least a coward. But as they work side by side, Will begins to respect the man. And when he sees his uncle stand up for what he believes in, Will realizes that he must rethink his definition of honor and courage.",
        "Category": " Young Adult Fiction , Historical , United States , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Center of Everything",
        "Authors": "By Moriarty, Laura",
        "Description": "\"A warm, beguiling book full of hard-won wisdom.\"--Janet Maslin, The New York Times \"The Center of Everything is as realistic and familiar as a summer day in Kansas--brave and gritty, strong voiced and spare.\"--O, The Oprah Magazine Set in Kerrville, Kansas, The Center of Everything is told by Evelyn Bucknow, an endearing character with a wholly refreshing way of looking at the world. Living with her single mother in a small apartment, Evelyn Bucknow is a young girl wincing her way through adolescence. With a voice that is as charming as it is recognizable, Evelyn immerses the reader in the dramas of an entire community. The people of Kerrville, stuck at once in the middle of nowhere but also at the center of everything, are the source from which Moriarty draws on universal dilemmas of love and belief to render a story that grows in emotional intensity until it lifts the reader to heights achieved only by the finest of fiction.",
        "Category": " Fiction , Coming of Age",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Our Sacred Honor: Words of Advice from the Founders in Stories, Letters, Poems, and Speeches",
        "Authors": "By Bennett, William J. (EDT)",
        "Description": "",
        "Category": " History , United States , Revolutionary Period (1775-1800)",
        "Publisher": "B & H Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Born Free: A Lioness of Two Worlds",
        "Authors": "By Adamson, Joy",
        "Description": "There have been many accounts of the return to the wild of tame animals, but since its original publication in 1960, when the New York Times hailed it as a \"fascinating and remarkable book,\" Born Free has stood alone in its power to move us.Joy Adamson's story of a lion cub in transition between the captivity in which she is raised and the fearsome wild to which she is returned captures the abilities of both humans and animals to cross the seemingly unbridgeable gap between their radically different worlds. Especially now, at a time when the sanctity of the wild and its inhabitants is increasingly threatened by human development and natural disaster, Adamson's remarkable tale is an idyll, and a model, to return to again and again.Illustrated with the same beautiful, evocative photographs that first enchanted the world forty years ago and updated with a new introduction by George Page, former host and executive editor of the PBS series Nature and author of Inside the Animal Mind, this anniversary edition introduces to a new generation one of the most heartwarming associations between man and animal.",
        "Category": " Nature , Animals , Wildlife",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Paradise Alley: A Novel",
        "Authors": "By Baker, Kevin",
        "Description": "At the height of the Civil War, word spreads through the poorest quarters of New York City that a military draft is about to be implemented -- a draft from which any rich man's son can buy an exemption. The outrage this inspires escalates into the worst urban conflagration in American history.Down in the waterfront slum of Paradise Alley, three women -- Deirdre Dolan O'Kane, Ruth Dove, and Maddy Boyle -- struggle with their private fears as they wait for the storm to descend upon them. Deirdre, devastated by the news that her husband, Tom, has been wounded at Gettysburg, must turn for comfort and aid to two women she has always judged as morally depraved -- Ruth, married to an ex-slave, and Maddy, a hard-living prostitute. Kevin Baker's acclaimed masterpiece is an unforgettable portrait of three women who come together to protect their homes and families from the brutality of a city -- and a nation -- gone mad.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The American South: Four Seasons of the Land",
        "Authors": "By Bake, William",
        "Description": "A respected newsman and television commentator and a veteran photographer combine forces to create an affectionate homage to the American South, capturing the beauty of country and city life and displaying the South's great regional diversity",
        "Category": " Photography , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "7.59",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "Brightness Reef (Bantam Spectra Book)",
        "Authors": "By Brin, David",
        "Description": "A million years ago, the advanced Buyur civilization held sway on Jijo. Then the Buyur abandoned the world, leaving it to rest and restore its ecological balance. Now the vast civilization of the Five Galaxies uses patrols, guardian machines, and sanctions of law to prevent resettlement until the planet is once more ready for civilized life.But over the centuries it has been resettled. Groups of sapient beings, fleeing persecution or neglect, have ignored the laws and evaded the patrols, landing in secret. After years of warfare and mistrust, a new society has evolved on forbidden Jijo, based on tolerance and respect among its six intelligent races: the mysterious hoon, the crablike qheuens, the centaurlike urs, the wheel-borne g'Kek, the multiple-personality-bearing graeki, and last of all to land on Jijo, humans from Earth, bringing with them a new technology allowing civilization to blossom in the wilderness. They all now live in hiding under canopies of camouflage, in dread of Judgment Day, when the Five Galaxies will certainly discover their illegal colony.Then the unthinkable happens. A strange starship arrives in Jijo's skies, landing near the settlers' holiest place. The passengers' appearance is familiar, their manner friendly. But do they bring long-feared judgment, or something far worse? Are they willing to destroy the six races of Jijo to cover their crimes?",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "You and I and Yesterday.",
        "Authors": "By Holmes, Marjorie",
        "Description": "The author fondly recalls the joys and simplicity of her childhood days spent in the small Iowa town of Storm Lake during the twenties",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "September",
            "Year": "1973"
        }
    },
    {
        "Title": "Confessions of a Neglected African Daughter",
        "Authors": "By Kwasi Bosompem",
        "Description": "",
        "Category": "",
        "Publisher": "PRDC Publishing",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "April",
            "Year": "2015"
        }
    },
    {
        "Title": "The 25-year War (Da Capo Paperback)",
        "Authors": "By Palmer, Bruce",
        "Description": "From May 1st, 1950, the day President Truman authorized the first U.S. military assistance to Indochina, to April 30th, 1975, the day Saigon fell to the North Vietnamese regime, America was engaged in the longest conflict in its history. This is the story of what went wrong. Bruce Palmer was the Vice Chief of Staff of the U.S. Army from 1968 to 1973. His insights into the key events and decisions that shaped America's military role in Vietnam are uncommonly perceptive. In this penetrating work, he not only presents an insider's history of the war, but also gives an astute critique of America's military strengths and weaknesses. This book is certain to become a standard reference for anyone seriously interested in how America lost the Vietnam war.",
        "Category": " History , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Treasures of the Library of Congress",
        "Authors": "By Goodrum, Charles A",
        "Description": "",
        "Category": "",
        "Publisher": "Harry Abrams",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Song of Eve: Mythology and Symbols of the Goddess",
        "Authors": "By Mascetti, Manuela Dunn",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Georgian Locomotive",
        "Authors": "By Bryant, H Stanford",
        "Description": "",
        "Category": "",
        "Publisher": "Random House~trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "When Will Jesus Bring the Pork Chops?",
        "Authors": "By Carlin, George",
        "Description": "Now in paperback, the New York Times bestseller that takes readers on a riotous journey through the mind of one of America's premier comics George Carlin's legendary irreverence and iconoclasm are on full display in When Will Jesus Bring the Pork Chops? as he vainly scours the American landscape for signs of intelligence in his third national bestseller. Ranging from his absurdist side (Message from a Cockroach; TV News: The Death of Humpty Dumpty; Tips for Serial Killers) to his unerring ear for American speech (Politician Talk; Societal Clichs; Euphemisms: 13 sections) to his unsparing views on America and its values (War, God, Stuff Like That; Zero Tolerance; Tired of the Handi-crap), Carlin delivers everything that his fans expect, and then adds a few surprises. Carlin on the battle of the sexes: Here's all you have to know about men and women: Women are crazy, men are stupid. And the main reason women are crazy is that men are stupid.",
        "Category": " Humor , Topic , Adult",
        "Publisher": "Hyperion-Acquired Assets",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "A New Treasury of Poetry",
        "Authors": "By Philip, Neil and Lawrence, John (ILT)",
        "Description": "The 288 poems, chosen for their appeal to young people, represent writers including Emily Dickinson, e.e. cummings, Langston Hughes, Gwendolyn Brooks, Dylan Thomas, R.L. Stevenson, W.B. Yeats, Walt Whitman, and William Blake. Illustrated throughout with magical woodcuts by John Lawrence. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "It's Not Fair Pb",
        "Authors": "By Wolf, Anthony E.",
        "Description": "Anthony Wolf's groundbreaking book focuses on the most difficult challenges of parenting post-infant to pre-teen children—setting limits and making demands. Dr. Wolf covers all the class parenting problem areas: family disputes, including who's in charge (Mom or Dad), sibling fights, and divorce; day-to-day issues such as bedtime, grumpiness, and public tantrums; and problems that might not be problems after all, like aggression, lying, and spoiling. Positive, loving, and, above all, effective, this guide offers parents what they want most: more time to enjoy their children.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Fsg Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "One Magical Sunday: (But Winning Isn't Everything)",
        "Authors": "By Phillips, Donald T. and Mickelson, Phil",
        "Description": "It is a moment ingrained in the hearts and minds of millions, a moment of epic triumph and destiny fulfilled that will be remembered for the ages. But for Phil Mickelson, winning the 2004 Masters was merely another stop in an odyssey that began many years ago. Born into a sporting family, with a putter drawn on his birth announcement, Phil knew early on that golf would always be his passion. His parents embraced and nurtured that dream, but they taught him that winning isn't everything.In One Magical Sunday, Phil Mickelson takes us on a journey inside a life few have seen up close, but a life whose lessons can be cherished forever. As we travel hole-by-hole through that triumphant Sunday at the Masters, Phil looks back at the influences that made him the man he is today: his mom and dad, who mentored him on the balance between family and golf; his wife, Amy, who has given him so much happiness and fulfillment; and their three children, who remain their top priority.With personal insights from Phil's family and never-before-seen photos of his most treasured moments, One Magical Sunday is a book not only for Phil's millions of fans, but for everyone who finds inspiration in reading about a champion on and off the course.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "A Mother's Legacy: Wisdom from Mothers to Daughters",
        "Authors": "By Rainey, Barbara (EDT) and Escue, Ashley Rainey",
        "Description": "This pictorial memory album of mothers and daughters looks at a mother's legacy, a mother's teaching, and a mother's love and devotion. Stories from many mothers and daughters, some well-known, show how family values and traditions are passed from one generation to another. Beautifully illustrated. A Mother's Legacy also includes a presentation page for gift giving and includes space for personal reflections. A perfect gift for Mother's Day, baby showers, birthdays or Christmas.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Life is an Attitude (Fifty-Minute S.)",
        "Authors": "By Chapman, Elwood N.",
        "Description": "Take charge of your attitude and take charge of your life with new strategies for beating negativity, eliminating doubts, and setting positive goals. Take charge of your attitude and take charge of your life with new strategies for beating negativity, eliminating doubts, and setting positive goals.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Crisp Pub Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Blue Frontier : Saving America's Living Seas",
        "Authors": "By Helvarg, David",
        "Description": "Oceans cover over 71% of the earth’s surface, absorb far greater amounts of carbon dioxide than rain forests, and exert a powerful control over climate, clouds, and weather.  Yet our living oceans are imperiled as never before, plagued by overfishing, reckless development, and pollution.  Will future generations be able to enjoy the riches of our nation’s greatest environmental treasure?A fascinating account of America’s oceans and ocean politics, Blue Frontier explores the impact of history, commerce and policy on marine life - and by extension all life on earth.  From the legacy of Navy-funded ocean research and development since World War II to the latest controversies surrounding beach closures, collapsing fish stocks, killer algae, hurricanes, and oil spills, Blue Frontier takes readers on an adventure-filled tour of America’s last great wilderness range.   Helvarg argues that sensible policies can still halt the onslaught of industrial destruction, despite today’s wide-open development along our coasts and in our offshore waters.  Profiling the growing number of coastal citizen-activists, local governments, and waterfront communities that are working to protect and restore healthy seas for all of us, he shows how informed individuals can make a difference.  An impassioned call for a new approach to ocean stewardship, Blue Frontier is essential reading for anyone interested in saving our maritime culture and heritage. Oceans cover over 71% of the earth’s surface, absorb far greater amounts of carbon dioxide than rain forests, and exert a powerful control over climate, clouds, and weather.  Yet our living oceans are imperiled as never before, plagued by overfishing, reckless development, and pollution.  Will future generations be able to enjoy the riches of our nation’s greatest environmental treasure?A fascinating account of America’s oceans and ocean politics, Blue Frontier explores the impact of history, commerce and policy on marine life - and by extension all life on earth.  From the legacy of Navy-funded ocean research and development since World War II to the latest controversies surrounding beach closures, collapsing fish stocks, killer algae, hurricanes, and oil spills, Blue Frontier takes readers on an adventure-filled tour of America’s last great wilderness range.   Helvarg argues that sensible policies can still halt the onslaught of industrial destruction, despite today’s wide-open development along our coasts and in our offshore waters.  Profiling the growing number of coastal citizen-activists, local governments, and waterfront communities that are working to protect and restore healthy seas for all of us, he shows how informed individuals can make a difference.  An impassioned call for a new approach to ocean stewardship, Blue Frontier is essential reading for anyone interested in saving our maritime culture and heritage.",
        "Category": " Nature , Animals , Marine Life",
        "Publisher": "W. H. Freeman",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Metropolitan Opera: Stories of the Great Operas",
        "Authors": "By Freeman, John W. (EDT) and Metropolitan Opera (New York, N. Y.) (COR)",
        "Description": "Here at last is the definitive opera story collection, the only one now authorized by the Metropolitan Opera. Written by the associate editor of Opera News magazine, the volume includes the complete plots of 150 different operas, biographical information on all of the 72 composers represented, easy access to the stories through both a table of contents and an index, and a foreword by Peter Allen.",
        "Category": " Music , Genres & Styles , Opera",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Financial Accounting: An Introduction to Concepts, Methods and Uses",
        "Authors": "By Stickney, Clyde P. and Weil, Roman L.",
        "Description": "With its widely popular conceptual approach, this classic textbook has been revised in full color and will continue to be the leader in its field. The text incorporates many real-world examples and financial statement as well as integrating international topics throughout the text. Ideal for the graduate level, the text's authoritative user-orientation teaches students to interpret and understand financial information in a changing business environment.",
        "Category": " Business & Economics , Accounting , Financial",
        "Publisher": "South-Western College Pub",
        "Price Starting With ($)": "8.43",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Commitment to freedom; the story of the Christian Science Monitor",
        "Authors": "By Canham, Erwin D",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "6.26",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "Tortured for Christ",
        "Authors": "By Wurmbrand, Richard",
        "Description": "",
        "Category": " Religion , Christianity , Lutheran",
        "Publisher": "Living Sacrifice Book Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Who Put That Hair in My Toothbrush?",
        "Authors": "By Spinelli, Jerry",
        "Description": "Who Put That Hair in My Toothbrush? Sibling rivalry at its finest! Whether it's on the hockey ice, at school, or at home, Greg and Megin just can't seem to get along. She calls him Grosso, he calls her Megamouth. They battle with donuts, cockroaches, and hair. Will it take a tragedy for them to realize how much they actually care for each other?",
        "Category": " Young Adult Fiction , Family , Siblings",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The imperial Post: The Meyers, the Grahams, and the paper that rules Washington",
        "Authors": "By Kelly, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "Morrow",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "When the Fairy Dust Settles: A Mother and Her Daughter Discuss What Really Matters",
        "Authors": "By Parshall, Janet, Parshall, Sarah, and Perry, Sarah Parshall",
        "Description": "A host of a daily Christian radio show and her daughter address the challenges of living according to the Scriptures in modern society, in a guide that covers a wide range of topics including extramarital affairs, financial problems, and plastic surgery. Original.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Young Cam Jansen and the Lost Tooth (Penguin Young Readers, L3)",
        "Authors": "By Adler, David A. and Natti, Susanna (ILT)",
        "Description": "Cam Jansen's photographic memory is put to the test when Annie's tooth falls out? and disappears! Cam has a picture in her head of everything she sees. But does she have the picture she needs to solve the mystery of the lost tooth?",
        "Category": " Juvenile Fiction , Readers , Intermediate",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Yummy Yucky (Leslie Patricelli board books)",
        "Authors": "By Patricelli, Leslie and Patricelli, Leslie (ILT)",
        "Description": "Learning about opposites has never been more fun - or funny - than with this winning board book. Yummy!Spaghetti is yummy, but worms - and blue crayons, and sand, and other things too gross to mention - are definitely yucky when tasted. Amiably illustrated in a bright, graphic style, Leslie Patricelli’s spirited board book, Yummy Yucky stars an obliging, bald, and very expressive toddler who acts out each pair of opposites with comically dramatic effect.",
        "Category": " Juvenile Fiction , Concepts , Senses & Sensation",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "On the Bright Side, I'm Now the Girlfriend of a Sex God (Further Confessions of Georgia Nicolson)",
        "Authors": "By Rennison, Louise",
        "Description": "Georgia Nicolson has started dating the Sex God (aka Robbie). So life should be perfect . . . except in Georgia's life, nothing is ever perfect. Her cat, Angus (the size of a small Labrador), is terrorizing the neighborhood. Her sister, Libby (who is slightly mad), hides her pooey knickers at the bottom of Georgia's bed.Then the Sex God breaks it off because she's too young. It's time for a plan. It's time for a Red Herring. It's time for Georgia to become a \"heartless boy magnet!\"",
        "Category": " Young Adult Fiction , Humorous , General",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Love Is Letting Go of Fear",
        "Authors": "By Jampolsky, Gerald G.",
        "Description": "After a quarter century, LOVE IS LETTING GO OF FEAR is still one of the most widely read and best-loved books on personal transformation and has become a classic all over the world. This helpful and hopeful little guide is comprised of twelve carefully crafted lessons that are designed to help us let go of the past and stay focused on the present as we step confidently toward the future. Renowned founder and teacher of Attitudinal Healing, Dr. Gerald Jampolsky reminds us that the only impediments to the life we yearn for are the limitations imposed on us by our own minds. Revealing our true selves, the essence of which is love, is a matter of releasing those limited and limiting thoughts. LOVE IS LETTING GO OF FEAR has guided millions of readers toward self-healing with this deeply powerful yet profoundly simple message. Embrace it with an open mind and an open heart and let it guide you to a life in which fear, doubt, and negativity are replaced with optimism, joy, and love.",
        "Category": " Religion , Spirituality",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "Andromaque",
        "Authors": "By Racine",
        "Description": "",
        "Category": "",
        "Publisher": "Larousse Kingfisher+chambers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Understanding mass communication",
        "Authors": "By Defleur, Melvin L.",
        "Description": "",
        "Category": "",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Women Travel: The Rough Guide, First Edition",
        "Authors": "By Davies, Miranda and Jansz, Natania (EDT)",
        "Description": "",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Rough Guides",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "In Defense of Elitism",
        "Authors": "By Henry, William A., III",
        "Description": "From the Pulitzer Prize-winning culture critic  for Time magazine comes the  tremendously controversial, yet highly persuasive,  argument that our devotion to the largely  unexamined myth of egalitarianism lies at the heart of the  ongoing \"dumbing of America.\"Americans have always stubbornly clung to the  myth of egalitarianism, of the supremacy of the  individual average man. But here, at long last,  Pulitzer Prize-winning critic William A. Henry III  takes on, and debunks, some basic, fundamentally  ingrained ideas: that everyone is pretty much alike  (and should be); that self-fulfillment is more  imortant thant objective achievement; that everyone  has something significant to contribute; that all  cultures offer something equally worthwhile; that  a truly just society would automatically produce  equal success results across lines of race,  class, and gender; and that the common man is almost  always right. Henry makes clear, in a book full of  vivid examples and unflinching opinions, that  while these notions are seductively democratic they  are also hopelessly wrong.",
        "Category": " Social Science , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Who Says a Dog Goes Bow-Wow?",
        "Authors": "By MacDonald, Suse (ILT) and De Zutter, Hank",
        "Description": "Reflecting the languages and cultures of the world's people, a collage-style introduction to the animal world features turkeys, bees, monkeys, and ducks, among other anmials from around the world.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Doubleday Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Low-fat Pasta Collection",
        "Authors": "By Oxmoor House",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Cooking With Hot Flashes: And Other Ways to Make Middle Age Profitable",
        "Authors": "By Bolton, Martha",
        "Description": "Martha Bolton's observations about life and growing older nail what everyone feels but can't express. \"Who Put All This Sand in My Hourglass Figure,\" \"When I Am Old I Shall Be Purple,\" and \"Allow Me to Repeat Myself...Again\" are just a few of the topics her fans--both new and old--will be laughing at as they nod in agreement. To complete her memorable recipe, Martha mixes in an ample sampling of poignant, touching stories, reminding readers what life is about and what is truly important.",
        "Category": " Humor , Topic , Religion",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Adrian Mole: The Cappuccino Years",
        "Authors": "By Townsend, Sue",
        "Description": "The latest addition to the Adrian Mole saga uses his diaries to focus on life at the age of thirty, after his breakup with his Nigerian wife. Reprint. 12,500 first printing.",
        "Category": " Fiction , Humorous",
        "Publisher": "Soho Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "The Art of Adventure",
        "Authors": "By Rowell, Galen",
        "Description": "",
        "Category": " Photography , General",
        "Publisher": "Collins Pub San Francisco",
        "Price Starting With ($)": "49.97",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Lighthouse Ghosts",
        "Authors": "By Butterworth-McKittrick, Norma Elizabeth, Roberts, Bruce (PHT), and Elizabeth, Norma",
        "Description": "",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Crane Hill Publishers",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Action Hero's Handbook: How to Catch a Great White Shark, Perform the Vulcan Nerve Pinch, Track a Fugitive, and Dozens of Other TV and Movie Skills",
        "Authors": "By Borgenicht, David and Borgenicht, Joe",
        "Description": "The Ultimate Guide to Keeping Up with the Indiana Joneses   For everyone who’s ever wanted to be as smooth as James Bond, as clever as Captain Kirk, or as tough as Charlie’s Angels, The Action Hero’s Handbook is the ultimate guide to the essential skills every action hero needs to survive and thrive in this dangerous but exciting world.   This book features dozens of real-life action hero techniques, directly from experts in the subjects at hand: FBI agents, sexologists, stuntmen, hypnotists, karate masters, criminologists, detectives, and many others. Learn how to:       •  Catch a great white shark     •  Deliver the Vulcan Nerve Pinch     •  Spyproof your hotel room     •  Win a fight when outnumbered     •  Climb down Mount Rushmore National Monument   And dozens of other Good Guy Skills, Paranormal Skills, Fighting Skills, and Escape Skills. With meticulously researched step-by-step instructions and easy-to-follow illustrations, The Action Hero’s Handbook will get you ready for anything. Good luck—we’re all counting on you.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Quirk Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Ideas for Great Window Treatments",
        "Authors": "By Sunset Books (COR), Barnes, Christine, and Lang, Susan",
        "Description": "",
        "Category": " House & Home , Decorating",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "History of Art: A survey of the major visual arts from the dawn of history to the present day",
        "Authors": "By H. W. Janson",
        "Description": "Traces the growth of man's aesthetic vision and the stylistic development of art, architecture, and sculpture since ancient times",
        "Category": "",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "11.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "CHICKEN AND OTHER POULTRY DISHES (Marie-Pierre Moine's French Kitchen)",
        "Authors": "By Moine, Marie-Pierre and Wickenden, Nadine (ILT)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Human Body (Explorer Plus, Ladybird)",
        "Authors": "By Graham, Nick and Walker, Richard (EDT)",
        "Description": "Covers bones, muscles, the digestive system, lungs, heart, brain, eyes, and reproductive system and their functions",
        "Category": " Juvenile Nonfiction , Science & Nature , Biology",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "A Beautiful Mind: The Life of Mathematical Genius and Nobel Laureate John Nash",
        "Authors": "By Nasar, Sylvia",
        "Description": "How could you, a mathematician, believe that extraterrestrials were sending you messages?\" the visitor from Harvard asked the West Virginian with the movie-star looks and Olympian manner. \"Because the ideas I had about supernatural beings came to me the same way my mathematical ideas did,\" came the answer. \"So I took them seriously.\" Thus begins the true story of John Nash, the mathematical genius who was a legend by age thirty when he slipped into madness, and who -- thanks to the selflessness of a beautiful woman and the loyalty of the mathematics community -- emerged after decades of ghostlike existence to win a Nobel Prize and world acclaim. The inspiration for a major motion picture, Sylvia Nasar's award-winning biography is a drama about the mystery of the human mind, triumph over incredible adversity, and the healing power of love.",
        "Category": " Psychology , Psychopathology , Schizophrenia",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Seven Types of Ambiguity",
        "Authors": "By Perlman, Elliot",
        "Description": "Seven Types of Ambiguity is a psychological thriller and a literary adventure of breathtaking scope. Celebrated as a novelist in the tradition of Jonathan Franzen and Philip Roth, Elliot Perlman writes of impulse and paralysis, empty marriages, lovers, gambling, and the stock market; of adult children and their parents; of poetry and prostitution, psychiatry and the law. Comic, poetic, and full of satiric insight, Seven Types of Ambiguity is, above all, a deeply romantic novel that speaks with unforgettable force about the redemptive power of love.The story is told in seven parts, by six different narrators, whose lives are entangled in unexpected ways. Following years of unrequited love, an out-of-work schoolteacher decides to take matters into his own hands, triggering a chain of events that neither he nor his psychiatrist could have anticipated. Brimming with emotional, intellectual, and moral dilemmas, this novel-reminiscent of the richest fiction of the nineteenth century in its labyrinthine complexity-unfolds at a rapid-fire pace to reveal the full extent to which these people have been affected by one another and by the insecure and uncertain times in which they live. Our times, now.",
        "Category": " Fiction , Psychological",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "The Don't Sweat Guide for Parents: Reduce Stress and Enjoy Your Kids More (Don't Sweat Guides)",
        "Authors": "By Carlson, Richard",
        "Description": "In this incredibly stressful world in which we live, parents seem to be the people who come under fire most. Hectic work schedules combined with chauffeuring children to extracurricular activities make us crave more quiet time with our children. The Don't Sweat Guide for Parents provides suggestions for enjoying your children more while being less stressed and more present with them in every moment of their lives. Including such strategies as:  Admit That You Could Use Some Help The Hardest Job in the World Learn to Take a Breather Because I Said So Keep the Job at the Office Enjoy Your Kids Every Day This book will help you to be a better, calmer, happier mom or dad.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "What Madness Brought Me Here: New and Selected Poems, 1968–1988 (Wesleyan Poetry Series)",
        "Authors": "By McElroy, Colleen J.",
        "Description": "A collection of new and old poems that explore the relationship between language and the self.",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Wesleyan University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "The Power of Beauty",
        "Authors": "By Friday, Nancy",
        "Description": "The Power of Beauty traces the importance of looks in our lives from our first hours in the nursery through childhood, adolescence, and the years as adults and parents to old age. It examines developmentally the author's own experiences, the stages of life itself, the feminist revolution that for the past thirty years has rocked relationships between men and women, and contemporary culture from high art to pop. In addition, it draws on a decade of research Friday has conducted on the psychology of physical appearance, including focus groups, symposia, and a national survey conducted with DYG Inc.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "I'm Just a DJ But...It Makes Sense to Me",
        "Authors": "By Joyner, Tom and Boyce, Mary Flowers",
        "Description": "Hall of Fame disc jockey Tom Joyner uses his signature brand of humor to discuss everything from business to careers to relationships as he shares the insights and lessons he's learned along the way.Now the host of a radio show that is the most popular media outlet ever among African Americans, Joyner started his career at a small AM radio station in his home state of Alabama, working his way across the midwest, and eventually landing in Chicago.In 1985, he made headlines as \"The Hardest Working Man in Radio\" when he worked a morning show in Dallas in addition to his afternoon show in Chicago. His daily commute earned him the nickname \"The Fly Jock.\" In 1994, he convinced ABC Radio to syndicate his program, and The Tom Joyner Show?a mix of comedy music, and guests who range from Stevie Wonder to Tipper Gore?was born.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Fish! Tales: Real-Life Stories to Help You Transform Your Workplace and Your Life",
        "Authors": "By Lundin, Stephen C., Paul, Harry, Christensen, John, and Strand, Philip",
        "Description": "Fish! told the story of a fictional company which transformed itself by applying lessons learned from Seattles famous Pike Place Fish market. Now, with Fish! Tales, readers can learn how real-life businesses and individuals energized their workplaces--and their lives--by implementing the lessons from Fish! Best of all, the book stands on its own for newcomers to the Fish! philosophy. Fish! Tales focuses on diverse companies, such as a bustling Sprint regional customer service center, a quiet neuro-surgical unit at a major hospital, and a brilliant car dealership. It features dozens of short takesquick and easy ways to apply the Fish! philosophy right now. And it includes a detailed program with specific steps and action plans.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Maryland's Historic Restaurants and Their Recipes",
        "Authors": "By O'Brien, Dawn and Schenck, Rebecca",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Blair",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Before the Change: Taking Charge of Your Perimenopause",
        "Authors": "By Gittleman, Ann Louise",
        "Description": "From renowned nutritionist and author of the bestselling Fat Flush Plan comes a revised and updated guide to taking charge of your perimenopause. Filled with the latest research as well as practical tips and menus, Gittleman also incorporates timely information, especially pertaining to Hormone Replacement Therapy. Learn How You Can head off Depression and Mood Swings, Weight Shifts, Erratic Sleep, Memory Loss, and Other Changes Leading to Menopause. Take charge of your perimenopause simply, safely, and naturally! This breakthrough book details a gentle incremental program for understanding your own changes and offers a wide range of options for taking care of yourself. By following the author's proven techniques for controlling the symptoms of perimenopause, you can continue to feel great through this vital phase of your life. With this essential do–it–yourself program, you can say good–bye to hormone havoc and sail through your perimenopause, the period of about ten years leading up to menopause, by understanding and controlling its symptoms. Before the Change. .clearly explains the symptoms of perimenopause and offers a self–diagnosis quiz; .details safe and natural alternatives to hormone therapy, including healing vitamins, minerals, herbs and natural hormones.gives you a powerful Changing Diet, with tips and recipes for foods that prevent and alleviate symptoms",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Sleep Toward Heaven: A Novel",
        "Authors": "By Ward, Amanda Eyre",
        "Description": "Amanda Eyre Ward's debut novel is an intimate portrait of three women whose lives collide during a brutal Texas summer.In Gatestown, Texas, twenty-nine-year-old Karen Lowens awaits her execution with a host of convicted serial killers on death row. In Manhattan, Dr. Franny Wren, also twenty-nine, tends to a young cancer patient, and resists the urge to run from her fiancé and her carefully crafted life. In Austin, Texas, brassy Celia Mills, a once-vibrant librarian, mourns her murdered husband.Over the course of the summer, fate pushes these eerily recognizable women together, culminating in a revelation of the possibility of faith, the responsibility of friendship, and the value of life. Sleep Toward Heaven is a luminous story of murder and desire, solitude and grace -- a rare literary page-turner where redemption seems perpetually within arm's reach.",
        "Category": " Fiction , Psychological",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Get Healthy Now! A Complete Guide to Prevention, Treatment and Healthy Living",
        "Authors": "By Null, Gary",
        "Description": "A New York Times BestsellerThe fully revised and updated edition to the national bestseller Get Healthy Now! includes new research and nutritional advice for treating allergies, Diabetes, PMS, Andropause, and everything in-between. From healthy skin and hair to foot and leg care, and featuring an up-to-date Alternative Practitioners Guide, Get Healthy Now! is your one-stop guide to becoming healthier from top to bottom, inside and out.Let \"the new Mr. Natural\" (Time Magazine) show you the best alternatives to drugs, surgical intervention, and other standard Western techniques. Drawing from methods that have been supported by thousands of years of use in other societies, as well as more recent discoveries in modern medicine, this comprehensive guide to healthy living offers a wide range of alternative approaches to help you stay healthy.",
        "Category": " Health & Fitness , Reference",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "7.88",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Life's 2 Percent Solution: Simple Steps to Achieve Happiness and Balance",
        "Authors": "By Hughes, Marcia M.",
        "Description": "The secret to a more fulfilling life comes down to only thirty minutes a day! Building on the work of eminent thinkers and scholars in the areas of emotional intelligence and whole-mind thinking, Marcia Hughes has successfully introduced a new way to connect with your core strengths and values, balance productivity and reflection and fully integrate passion with action. Life's 2% Solution: Simple Steps to Achieve Happiness and Balance presents a field-tested process and proven techniques for fully integrating your professional and spiritual selves. Filled with first-hand experiences of people whose lives have been turned around by the 2% Solution, this book shows you how to personalize an action plan based on your individual needs, use your strengths to guide you, cope with changes, apply your plan in the workplace and work toward the final goal of self-actualization.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Burn Before Reading: Presidents, CIA Directors, and Secret Intelligence",
        "Authors": "By Turner, Stansfield",
        "Description": "In this \"thoughtful, entertaining, and often insightful\" book, a former CIA director explores the delicate give-and-take between the Oval Office and Langley.With the disastrous intelligence failures of the last few years still fresh in Americans minds--and to all appearances still continuing--there has never been a more urgent need for a book like this.In Burn Before Reading, Admiral Stansfield Turner, the CIA director under President Jimmy Carter, takes the reader inside the Beltway to examine the complicated, often strained relationships between presidents and their CIA chiefs. From FDR and \"Wild Bill\" Donovan to George W. Bush and George Tenet, twelve pairings are studied in these pages, and the results are eye-opening and provocative. Throughout, Turner offers a fascinating look into the machinery of intelligence gathering, revealing how personal and political issues often interfere with government business--and the nation's safety.",
        "Category": " Political Science , Intelligence & Espionage",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Moon Dance (Sparkle Books)",
        "Authors": "By Lassen, Christian Riese",
        "Description": "Amazing sparkle-accentuated illustrations by Christian Lassen accompany this exciting tour of marine life below the surface of the sea.",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Penton Overseas Inc. Distributed by Ideals Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "What Goes Up: The Uncensored History of Modern Wall Street as Told by the Bankers, Brokers, CEOs, and Scoundrels Who Made It Happen",
        "Authors": "By Weiner, Eric J.",
        "Description": "Traces the rise and fall of modern Wall Street from the perspectives of billionaires and back-room figures from both sides of the law who were direct contributors, in an oral history that cites the involvement of such individuals as David Rockefeller, Charles Schwab, and Peter Lynch. 60,000 first printing.",
        "Category": " Business & Economics , Corporate & Business History",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Lipstick Jungle",
        "Authors": "By Bushnell, Candace",
        "Description": "The new novel that fans of the bestselling author have been waiting for, about three sexy, powerful career women who will do anything to stay at the top of their fieldsVictory Ford is the darling of the fashion world. Single, attractive, and iconoclastic, she has worked for years to create her own signature line. As Victory struggles to keep her company afloat, she learns crucial lessons about what she really wants in a relationship.Nico O'Neilly is the glamorous, brilliant editor of Bonfire Magazine--the pop-culture bible for fashion, show business, and politics. Considered one of the most powerful women in publishing, she seems to have it all. But in a mid-life crisis, she suddenly realizes this isn't enough. Wendy Healy's chutzpah has propelled her to the very top of the cut-throat movie industry. When it becomes clear that a competitor is trying to oust her, something has to give--and Wendy must decide between her career and her marriage.In Lipstick Jungle, Bushnell once again delivers an addictive page-turner of sex and scandal that will keep readers enthralled and guessing to the very last page.",
        "Category": " Fiction , Women",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Snow Angel",
        "Authors": "By Boone, Debby and Ferrer, Gabriel (ILT)",
        "Description": "Rose and her grandfather seem to be the only people left in their village who know how to dream and experience the beauty of the world, until a snow angel comes to life and creates a wondrous event.",
        "Category": "",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Watercolor (Artist's Library series #02)",
        "Authors": "By Light, Duane R.",
        "Description": "\"Master the basics of drawing, composition, and value, as well as the specific techniques unique to painting in watercolor.Even if you've never touched a paintbrush, this book is the perfect way to get started out in the vibrant, colorful world of watercolor painting. This selection from the Artist's Library Series includes comprehensive instructions for painting a variety of subjects in watercolor. You will learn to master the basics of drawing, composition, and value, and then move on to specific techniques for painting in watercolor. The book is filled with information and encouragement; and, as you're learning from a professional artist, you can expect only the highest quality of information and instruction.\"",
        "Category": " Crafts & Hobbies , Painting",
        "Publisher": "Walter Foster Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Butcher of Beverly Hills: A Novel",
        "Authors": "By Colt, Jennifer",
        "Description": "Who is killing the rich society widows of Beverly Hills?Meet Kerry and Terry McAfee—identical twin sisters who have nothing in common, save their red hair and California-girl looks. Kerry’s the good girl, a straight-A student who won a scholarship to UCLA. Terry’s the bad girl, whose appetite for nose candy won her a spot in the slammer. When Terry gets out of jail, the twins decide to open their own business as private investigators—and soon they’re keeping LA safe with the help of their trusty sidekicks: a Pomeranian named Paquito and a pug named Muffy.When wealthy socialite Lenore Richling’s twentysomething gold-digging boy toy of a husband absconds with ten thousand dollars' worth of her jewelry, she does what anyone in her position would do: she checks herself in for a plastic surgery shopping spree, then calls the McAfee twins for help. While Lenore recuperates from her face-lift in a luxury hotel, the gals hop on their hot-pink Harley-Davidson and begin investigating a bevy of suspicious characters, including Barbie, a bimbo beauty consultant with buns of steel; Daniel Hattrick, a painkiller-pushing plastic surgeon; and Hugh Binion, a silver-haired, snake-tongued Hollywood attorney. Before they know it, the twins are wading in dead husbands, purloined cash, crotchless panties, mystery pills, and a body count high enough to make even tough cookies like them a little squeamish.With a razor-sharp wit that brilliantly brings to life LA’s most eccentric personalities, The Butcher of Beverly Hills marks the debut of two of the hottest sleuths since Stephanie Plum—and delivers a fast-paced, highly original tale that will keep you guessing until the very end.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Naturalists : Pioneers of Natural History",
        "Authors": "By Jenkins",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Rutledge Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1978"
        }
    },
    {
        "Title": "The Bust Guide to the New Girl Order",
        "Authors": "By Karp, Marcelle (EDT) and Stoller, Debbie (EDT)",
        "Description": "Both a literary magazine and a chronicle of girl culture, Bust was born in 1993. With contributors who are funny, fierce, and too smart to be anything but feminist, Bust is the original grrrl zine, with a base of loyal female fans--all those women who know that Glamour is garbage, Vogue is vapid, and Cosmo is clueless.  The Bust Guide to the New Girl Order contains brand new, funny, sharp, trenchant essays along with some of the best writings from the magazine: Courtney Love's (unsolicited) piece on Bad Girls; the already immortal \"Dont's For Boys\"; an interview with girl-hero Judy Blume; and lots of other shocking, titillating, truthful articles. A kind of Our Bodies, Ourselves for Generation XX, The Bust Guide to the New Girl Order is destined to become required reading for today's hip urban girl and her admirers.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Eternity Code (Artemis Fowl, Book 3)",
        "Authors": "By Colfer, Eoin",
        "Description": "Ever the resourceful young criminal mastermind, Artemis has found a way to construct a supercomputer from stolen fairy technology. Called the \"C Cube,\" it will render all existing human technology obsolete. Artemis then arranges a meeting with a Chicago businessman, Jon Spiro, to offer to suppress the Cube for one year in return for gold, his favorite substance. But the meeting is a trap, and Spiro steals the Cube and mortally injures Butler. Artemis knows his only hope to save Butler lies in fairy magic, so once again he is forced to contact his old rival, Captain Holly Short of the LEPrepcon fairy police. Miraculously, Butler is healed, but there is a catch: he has aged fifteen years. Thus, Butler's infamously ditzy sister, Juliet, is called in as Artemis's bodyguard. Together, they travel to Chicago to steal back the Cube and ensure that Jon Spiro is put out of business-permanently.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Disney Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "How to Live Like a King's Kid",
        "Authors": "By Julia Hill Harold Hill",
        "Description": "",
        "Category": "",
        "Publisher": "Bridge Logos",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Disney Princess: Happily Ever After Stories (Disney Storybook Collections)",
        "Authors": "By Walt Disney Enterprises (COR) and Giuliani, Alfred",
        "Description": "The latest edition to our storybook collection series is a follow-up to the best-selling Disney's Princess Collection: Love & Friendship Stories. Join everyone's favorite Disney Princesses, including Belle, Ariel, Snow White, and Cinderella, as they embark on royal adventures and live happily ever after. This beautifully illustrated storybook collection will keep little princesses entertained for hours.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Anthologies",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Warrior of the skies,",
        "Authors": "By Giegling, John A",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "12.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Mr. Midshipman Hornblower (Hornblower Saga (Paperback))",
        "Authors": "By Forester, C. S.",
        "Description": "The year is 1793, the eve of the Napoleonic Wars, and Horatio Hornblower, a seventeen-year-old boy unschooled in seafaring and the ways of seamen, is ordered to board a French merchant ship and take command of crew and cargo for the glory of England. Though not an unqualified success, this first naval adventure teaches the young midshipman enough to launch him on a series of increasingly glorious exploits. This novel-in which young Horatio gets his sea legs, proves his mettle, and shows the makings of the legend he will become-is the first of the eleven swashbuckling Hornblower tales that are today regarded as classic adventure stories of the sea.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "White: A Novel",
        "Authors": "By Whitcomb, Christopher",
        "Description": "Islamic and Christian fundamentalists unleash a well-coordinated series of attacks all across the American heartland. Stolen radioactive material, a high-level spy, a mysterious break into top-secret data-encryption technology, twisting plots and spiraling conspiracies are all linked with fast-paced, cinematic crosscutting.  In this thriller, FBI agent Jeremy Waller returns, as does tough-as-nails Elizabeth Beechum, now vice president, and the enigmatic billionaire Jordan Mitchell.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Mr. Popper's Penguins",
        "Authors": "By Atwater, Richard, Atwater, Florence, and Lawson, Robert (ILT)",
        "Description": "This Newbery Honor-winning novel, with over 1 million copies sold, now celebrates its 80th anniversary with a new look and interior illustrations!Mr. Popper's Penguins is one of the handful of American books for children that has attained the status of a classic. A humble house painter is sent a male penguin by the great Admiral Drake and, thanks to the arrival of a female penguin, soon has twelve penguins living in his house. First published in 1938, Mr. Popper's Penguins has amused and enchanted generations of children and their parents.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Boatbuilding manual",
        "Authors": "By STEWARD, ROBERT M.",
        "Description": "",
        "Category": "",
        "Publisher": "International Marine Pub. Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The Stuntwoman's Workout: Get Your Body Ready for Anything",
        "Authors": "By Burgio, Danielle and Worick, Jennifer (CON)",
        "Description": "Get the body of an action heroine!   Whether she’s diving from a tall building, being set on fire, going mano-a-mano with the bad guys, or outrunning an avalanche, premier Hollywood stuntwoman Danielle Burgio must be not only fit, but also quick-thinking, focused, and calm in the face of enormous physical and mental demands.   Now Danielle reveals her fitness regimen for integrating mind, body, and spirit in a simple program people at any fitness level can follow.        •  Go beyond the gym with strengthening and cardio exercises that prime your body for weight loss and tone.      •  Gain focus, flexibility, and coordination through breathing exercises, splits, and stretching techniques to promote total body awareness.      •  Energize your workout with sprints and roundhouse kicks that build agility and endurance.      •  Get in tune with your body with martial arts-inspired parrying techniques that introduce new levels of activity and fitness.   Fitness means more than just looking good—it means being prepared for any challnge that lies ahead! With more than 50 exercises and five easy-to-master daily circuits that focus on putting some fun in your workout, The Stuntwoman’s Workout is your ultimate guide to staying fit and embracing a life full of action.",
        "Category": " Health & Fitness , Exercise , General",
        "Publisher": "Quirk Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "A Christmas Promise (Cape Light, Book 5)",
        "Authors": "By Kinkade, Thomas and Spencer, Katherine",
        "Description": "In this novel in Thomas Kinkade and Katherine Spencer’s heartwarming series, it’s the most wonderful time of the year, and Cape Light has received two special Christmas guests...   James Cameron, a minister who runs a mission in Central America, has decided to spend the holidays in Cape Light. But when his car collides with another car, a hint of trouble befalls this close-knit community. No one is hurt, but out-of-towner Leigh Baxter is forced to stay in town until her car is fixed. What she doesn’t expect, however, is that the charm of this beautiful seaside hamlet and its citizens will soon win her over—and that she will fall in love with James, who has so generously welcomed her into his life. But will James accept Leigh in his heart once her dark secrets come to light? In the meantime, Jessica and Sam Morgan’s relationship is put to the test. More than anything else this Christmas, they want a baby to call their own. But soon they’ll discover that life’s most precious gifts often come in unexpected packages...",
        "Category": " Fiction , Christian , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The United States of Wal-Mart",
        "Authors": "By Dicker, John",
        "Description": "An irreverent, hard-hitting examination of the world's largest-and most reviled-corporation, which reveals that while Wal-Mart's dominance may be providing consumers with cheap goods and plentiful jobs, it may also be breeding a culture of discontent.   It employs one of every 115 American workers. If it were a nation-state, it would be one of the world's top twenty economies. With yearly sales of nearly $260 billion and an average way of $8 an hour, Wal-Mart represents an unprecedented-and perhaps unstoppable-force in capitalism. And there have been few corporations that have evoked the same levels of reverence and ire.   The United States of Wal-Mart is a hard-hitting examination of how Sam Walton's empire has infiltrated not just the geography of America but also its consciousness. Peeling away layers of propaganda and politics, investigative journalist John Dicker reveals an American (and, increasingly, a global) story that has no clear-cut villains or heroes-one that could be the confused, complicated story of America itself.   Pitched battles between economic progress and quality of life, between the preservation of regional identity and national homogeneity, and between low prices and the dignity of the American worker are beginning to coalesce into an all-out war to define our modern era. And, Dicker argues, Wal-Mart is winning. Revealing that the company's business practices have been shaping American culture, including the nation's social, political, and industrial policy, The United States of Wal-Mart provides fresh insight into a controversy that isn't going away.",
        "Category": " Business & Economics , Industries , Retailing",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Houses of Stone",
        "Authors": "By Michaels, Barbara",
        "Description": "When young professor of English Karen Holloway happens on a privately printed volume of verse dating from the early nineteenth century, it's all in a day's work. But when a battered manuscript bearing the same mysterious attribution, \"Ismene,\" turns up, Karen realizes that it is an important discovery that could be the making of her academic career.Karen immerses herself in a headlong search for the true identity of the unknown author, tracking the provenance of the manuscript to Virginia's historic Tidewater region. She is not alone in her quest; academic rivals shadow her steps, trying to gain possession of the valuable manuscript, and the locals are more inquisitive about her activities than seems natural.Fortunately, Karen has the help of her eccentric and able mentor, Peggy, whose historical expertise proves to be invaluable. And, as she painstakingly deciphers the crabbed, charred pages, she begins to wonder whether she has the assistance of Ismene herself. Is the tale of Gothic horror that Ismene tells not a novel but a memoir, the very possession of which may jeopardize Karen's life? Ismene's legacy calls out from the past, from an eerie world fraught with terrifying impressions of fire and ice that will not die until the painful truths that inhabit houses of stone are revealed.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Wallys Workshop P",
        "Authors": "By W.brunner, Pan media produ",
        "Description": "",
        "Category": "",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1974"
        }
    },
    {
        "Title": "The Couple's Comfort Book: A Creative Guide for Renewing Passion, Pleasure, and Commitment",
        "Authors": "By Louden, Jennifer",
        "Description": "The author of The Woman's Comfort Book presents a compendium of creative, comforting, and kinky ideas to keep a relationship supercharged with sex, love, and friendship. Original. 40,000 first printing. $50,000 ad/promo.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "HarperSanFrancisco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Mirror of Merlin",
        "Authors": "By Barron, T. A.",
        "Description": "What is the nature of fate? Is young Merlin destined to be a powerful wizard, or does he have a choice? These are the questions Merlin must answer as he travels with the deer woman Hallia to the Haunted Marsh where the marsh ghouls have begun a campaign of destruction. Or are the ghouls being manipulated by an even greater source of evil? An evil that seeks to destroy not the marsh, but Merlin himself?Here, in the fourth installment of the Lost Years of Merlin, epic master storytellerT. A. Barron weaves a tale of humor, adventure, and surprise as Merlin unravels the mystery of the Haunted Marsh, meets a boy named Arthur, and travels through a mirror of mist that brings him face to face with his destiny.",
        "Category": " Young Adult Fiction , Legends, Myths, Fables , Arthurian",
        "Publisher": "Philomel",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Visible Universe (Voyage Through the Universe)",
        "Authors": "By By the Editors of Time-life Books",
        "Description": "Looks at the history of the telescope, explains how modern telescopes work, and discusses technical advances, including charge-coupled devices, the space telescope, spin-casting, and new optical systems",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Thinking Together: Making Meetings Work",
        "Authors": "By Howard, V. A. and Barton, J. H.",
        "Description": "A guide to participating in rational discussions in the fields of business, teaching, or communication shows how to plan group inquiry, make decisions, and establish policy, all in a fair and impartial manner",
        "Category": " Education , General",
        "Publisher": "Quill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Annette Annechild's Wok Your Way Skinny",
        "Authors": "By Annechild, Annette",
        "Description": "Supplies recipes for cooking a wide variety of nutritious low-calorie foods, including egg dishes, vegetables, meats, and seafood, using a wok",
        "Category": " Cooking , Methods , Wok",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "A Girl and Her Money",
        "Authors": "By Durling, Sharon",
        "Description": "From managing her own finances as a single woman to transacting billions for her clients as a bond broker, author Sharon Durling knows money--what to do with it and how to multiply it. Better yet, she shares the 411 so we can easily understand it and get control of our pocket books and bank accounts.Engagingly written and highly interactive, A Girl and Her Money will change the way women everywhere think and feel about money. Never has money-talk been so enjoyable and empowering!Topics include:Identifying Your Spending PersonalityChoosing a Money LifestyleChemo for Chronic Bad Debt\"If Men Are from Home Depot, Women Are from Macy's\"Coming Soon:A Girl and Her Brilliant InvestmentsA Girl and Her Luminous RetirementA Girl and Her Fabulous Home Business",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Spy's Guide: Office Espionage",
        "Authors": "By Swierczynski, Duane (CON), Melton, H. Keith, and Piligian, Craig",
        "Description": "Advance Your Career—With Espionage!   In today’s business world, information is everything—and no one gathers information more effectively than spies. So why not bring real spying techniques into your workplace? The same tactics developed by professional intelligence agents can be used at businesses of any size to help you get ahead fast! The Spy’s Guide: Office Espionage features illustrated instructions on planting “bugs,” disguising your identity at a trade show, sending anonymous e-mails, and much more. You’ll also discover techniques for:        •  encrypting your address book      •  photographing confidential documents      •  reassembling shredded reports      •  securing your desk      •  using invisible inks      •  and much more!   The authors also share the real-life exploits of professional spies in the CIA, the KGB, Fortune 500 companies, and other business settings. Now put these tactics to work for yourself!",
        "Category": " Humor , Topic , Business & Professional",
        "Publisher": "Quirk Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Principles of Community Psychology: Perspectives and Applications",
        "Authors": "By Levine, Murray and Perkins, David V.",
        "Description": "Principles of Community Psychology, now in a new edition, is a comprehensive text integrating theory, research, and practice across the diverse subject matter of community mental health and community psychology. Emphasizing an ecological approach, this text places problems in both their current and historical perspectives,  focusing on the individual in the environment and the influences that shape and change behavior and mental health. Conceptually built around the models of stressful life events, social support, and coping, it applies these concepts as a key integrative device for analyzing diverse phenomena and interventions which include self-help, prevention, and social action. Thoroughly updated, this second edition has been completely rewritten to include updated references and research, boxes on current topics, chapter outlines, expanded case studies, practical examples, and chapter discussions. The authors have made their arguments and research less abstract and more practical, offering students a more accessible text that presents concrete, detailed, up-to-date examples of programs, research, and scholarship from many different fields. The text covers the history of community mental health and shows its relationship to social welfare policies and legal and political systems. It also shows the limits inherent in the medical model of practice in dealing with such a full range of formal mental health problems, including the every day stressful life events that make up the Soap Opera life. Principles of Community Psychology ultimately challenges community psychologists as well as students of  psychology, sociology, and social work to look at the impact of the new conservatism on human services and the opportunities that are presented for innovative approaches in the new political climate.",
        "Category": " Psychology , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Men Against Time: Salvage Archaeology in the United States",
        "Authors": "By Silverberg, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "MACMILLAN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Amazing Grace",
        "Authors": "By Shull, Megan",
        "Description": "Grace Kincaid, the Anna Kournikova of the tennis world (beautiful, teenaged, and the BEST in the world), calls her mother on the eve of the U.S. Open and says three little words: \"I want out.\" Whereupon her mother flies to her daughter's side, cancels all further engagements, endorsements, press conferences, tournaments, and gives Grace an entirely new identity. Which includes a make-under, a former FBI agent as a mentor and bodyguard, and a new life in Medicine Hat, Alaska, population 318.  How one teenager goes from superstar to almost-normal is the subject taken on by Megan Shull, a sparkling new voice in teen fiction.",
        "Category": " Young Adult Fiction , Romance , General",
        "Publisher": "Hyperion Book CH",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Write If You Get Work: The Best of Bob and Ray",
        "Authors": "By Elliott, Bob",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Adventures With Polarfleece: A Sewing Expedition",
        "Authors": "By Cornwell, Nancy",
        "Description": "",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Krause Pubns Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "American Sucker",
        "Authors": "By Denby, David",
        "Description": "The author of Great Books presents a candid memoir of money, desire, greed, and love as he describes his divorce, its effects on his life, and his irrational plunge into the stock market madness of the high-tech boom, discussing his own motives and illusions in terms of the simultaneous blindness and greed that consumed the nation. 60,000 first printing.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Legal Problem Solver: A Quick-and-Easy Action Guide to the Law",
        "Authors": "By Reader's Digest",
        "Description": "Nearly seven hundred alphabetized and cross-referenced entries, complemented by true-to-life case histories, address common legal issues, such as buying a home, insurance, wills, auto accidents, and more. 25,000 first printing. $35,000 ad/promo.",
        "Category": " Law , General",
        "Publisher": "Reader's Digest Association",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Beyond Belief",
        "Authors": "By Edward W. Bauman",
        "Description": "",
        "Category": "",
        "Publisher": "The Westerminster Press",
        "Price Starting With ($)": "5.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Decorative Paint and Faux Finishes",
        "Authors": "By Sunset Books (COR), Selden, Linda J. (EDT), and Spier, Carol (EDT)",
        "Description": "Instructs how to create decorative finishes on walls using a variety of painting techniques including rubbing, sponging, spattering, stamping, and stenciling",
        "Category": " House & Home , Decorating",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Organic Chemistry",
        "Authors": "By McMurry, Susan",
        "Description": "",
        "Category": " Science , Chemistry , Organic",
        "Publisher": "Brooks/Cole Pub Co",
        "Price Starting With ($)": "8.39",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Walking in the Garden of Souls",
        "Authors": "By Anderson, George and Barone, Andrew",
        "Description": "After decades of listening to the dead speak, the author is ready to share the wisdom imparted on him from people who have crossed over--advice on how to make the most of life in the present. 60,000 first printing.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Undercover Golf: An Off-the Links Guide to Improving Your Game - at Work, at Home, and on the Sly",
        "Authors": "By Borgenicht, Joe and Robinson, R. D.",
        "Description": "Getting through a day off the links   Minor obligations like work and family shouldn’t stand in the way of your game. Undercover Golf will help you perfect your grip, your stance, your swing, and your putt—anytime, anywhere—without anyone catching on, and without clubs, balls or tees.   You’ll learn how to:       •  Check proper hand position in a meeting     •  Practice weight distribution while drinking at a bar     •  Turn your center point while sweeping in the kitchen     •  Practice inside arm/knee pressure while hugging your significant other   Whether you are hiking, shopping, mopping, or dining out, this complete secret swingers training course means time spent off the course doesn’t have to be time spent off your game.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Quirk Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    }
]