[
    {
        "Title": "Space: Exploration and Discovery",
        "Authors": "By Anthony Feldman",
        "Description": "",
        "Category": "",
        "Publisher": "Facts on File Publications",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Armadillo Ray",
        "Authors": "By Turley, Peggy (ILT) and Beifuss, John",
        "Description": "Ray is a curious armadillo, and what he is most curious about is the moon. Ray wonders how it can have so many shapes and why it sometimes disappears. He decides to find out the answers to his questions by asking his desert animal friends, from the prairie dog to the desert grouse, each of whom has his own fanciful idea. But it isn't until Ray meets a wise old owl that he learns exactly what the moon is—and discovers that sometimes the truth is the most unbelievable explanation of all!This enchanting story is brought to life by stunning oil pastel illustrations. Also included is an afterword giving a brief explanation of the phases of the moon, as well as a note about the role that the moon has played in legends around the world.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Long Day's Journey Into Night",
        "Authors": "By O'Neill, Eugene",
        "Description": "This play about a family of four psychologically disturbed people reveals aspects of the author's own life",
        "Category": "",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1962"
        }
    },
    {
        "Title": "The Invisible Wall: Germans and Jews : A Personal Exploration",
        "Authors": "By Blumenthal, W. Michael",
        "Description": "Recounts the stories of six of the author's ancestors in an attempt to understand the failure of the German-Jewish relationship",
        "Category": " History , Europe , Germany",
        "Publisher": "Counterpoint",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Time Life History of the Civil War",
        "Authors": "By Ronald H. Bailey",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Lord's Motel",
        "Authors": "By Storey, Gail Donohue",
        "Description": "A story about the bittersweet, often absurd, quality of modern single life follows the travails of Colleen Sweeney as she confides in the other residents of her apartment complex--The Lord's Motel. A first novel.",
        "Category": " Fiction , General",
        "Publisher": "Persea Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Illustrated Dictionary of Bible Life and Times",
        "Authors": "By Editors of Reader's Digest",
        "Description": "More than 1500 entries in alphabetical order, accompanied by biblical chapter and verse references, helps the modern reader learn what the writers of the Bible meant when they wrote about Aaron's rod or a zealot.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Stranger on the Square",
        "Authors": "By Koestler, Arthur and Koestler, Cynthia",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Psychology of Women: A Study of Bio-Cultural Conflicts",
        "Authors": "By Bardwick, Judith M.",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Passion Artist",
        "Authors": "By John Hawkes",
        "Description": "",
        "Category": "",
        "Publisher": "Harper and Row, 1979",
        "Price Starting With ($)": "7.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "A Personal Reflection of the Holocaust",
        "Authors": "By Stummer, Deli",
        "Description": "",
        "Category": " History , Holocaust",
        "Publisher": "Aurich Pr",
        "Price Starting With ($)": "7.66",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Alice and the Space Telescope",
        "Authors": "By Longair, M. S.",
        "Description": "Longair (Astronomer Royal, Scotland; Lewis Carroll fan) explains the nature, capabilities, and mission of the Hubble Space Telescope, scheduled for launch into Earth orbit in 1990. Suitable for junior high and high school. Well illustrated. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Science , General",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Managing the World's Forests:  Looking for Balance Between Conservation and Development",
        "Authors": "By Narendra P. Sharma",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Kendall Hunt Pub Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Analysis for public decisions",
        "Authors": "By Quade, E. S.",
        "Description": "Examines traditional methods of and pitfalls encountered in policy analysis and suggests alternatives for improved decision making. Bibliogs",
        "Category": "",
        "Publisher": "American Elsevier Pub. Co",
        "Price Starting With ($)": "6.02",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "From Poor Law to Welfare State 4th Edition (a History of Social Welfare in Ame",
        "Authors": "By Trattner, Walter I.",
        "Description": "Over twenty-five years and through five editions, Walter I. Trattner's From Poor Law to Welfare State has served as the standard text on the history of welfare policy in the United States. The only comprehensive account of American social welfare history from the colonial era to the present, the new sixth edition has been updated to include the latest developments in our society as well as trends in social welfare.Trattner provides in-depth examination of developments in child welfare, public health, and the evolution of social work as a profession, showing how all these changes affected the treatment of the poor and needy in America. He explores the impact of public policies on social workers and other helping professions -- all against the backdrop of social and intellectual trends in American history.From Poor Law to Welfare State directly addresses racism and sexism and pays special attention to the worsening problems of child abuse, neglect, and homelessness. Topics new to this sixth edition include:A review of President Clinton's health-care reform and its failure, and his efforts to \"end welfare as we know it\"Recent developments in child welfare including an expanded section on the voluntary use of children's institutions by parents in the nineteenth century, and the continued discrimination against black youth in the juvenile justice systemAn in-depth discussion of Charles Murray and Richard Herrnstein's controversial book,The Bell Curve, which provided social conservatives new weapons in their war on the black poor and social welfare in generalThe latest information on AIDS and the reappearance of tuberculosis -- and their impact on public health policyA new Preface and Conclusion, and substantially updated BibliographiesWritten for students in social work and other human service professions, From Poor Law to Welfare State: A History of Social Welfare in America is also an essential resource for historians, political scientists, sociologists, and policymakers.",
        "Category": " History , United States , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "East Meets Southwest: Natural Fusion Cuisine",
        "Authors": "By Walters, Lynn",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Natural Foods",
        "Publisher": "Crossing Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Restructuring American Foreign Policy",
        "Authors": "By Steinbruner, John D.",
        "Description": "In the final days of this century, the United States will need to amend the core of its foreign policy&#151;a formidable task in a large democracy. American thinking, still grounded in post-World War II perceptions, has failed to keep pace with the demands of a changing world. New realities in the U.S. and international economies, in security conditions, and in world politics call for restructuring American foreign policy.The policy experts contributing to this volume state the process of public debate that must precede the hard political choices ahead. Barry P. Bosworth and Robert Z. Lawrence consider the ramifications of an American economy no longer an implicit source of leverage in pursuing policy objectives. William W. Kaufmann prescribes ways to preserve international commitments and ensure American security in spite of fiscally constrained defense budgets. John D. Steinbruner discusses efforts to achieve a more stable military balance. In a related chapters, Kenneth Flamm and Thomas L. McNaugher propose a redraft of American investment patterns to make the defense technology more consistent with contemporary security requirements.All of this domestic restructuring will take place within the constraints and opportunities created by recent changes in China and the Soviet Union, continued economic expansion in Japan, and persistent unrest in the Middle East. Harry Harding and Ed A. Hewett review the prospects for reform in China and the Soviet Union. Harry Harding and Edward Lincoln describe the surge in many Asian economies and the increased importance of Japan as a world power. And in the final chapter, Harold H. Saunders turns attention to the Middle East, where identifying desirable solutions continues to be far easier than finding realistic methods for achieving them.The inauguration of a new administration creates an opportunity for political debate, a new conceptual focus, and effective political consensus. Restructuring American Foreign Policy opens the debate.",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Goof and Other Stories",
        "Authors": "By Enright, Sean",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Creative Arts Book Co",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The Acting President",
        "Authors": "By Schieffer, Bob and Gates, Gary Paul",
        "Description": "An exhaustive analysis of the Reagan years from inside the White House by a pair of acute political observers. Covers decision-making and the participants: Deaver, Haig, Casey, Poindexter. Acidic paper; no bibliography. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Arthritis: What Works (An Arthritis Survey Publication)",
        "Authors": "By Sobel, Dava and Klein, Arthur C.",
        "Description": "Backed by careful research, a nationwide survey of more than one thousand arthritis sufferers reveals the latest data on medication, exercise and nutrition, surgery, and other remedies for relieving arthritis pain",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The queen's messenger",
        "Authors": "By W. R. Duncan",
        "Description": "",
        "Category": "",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "In & Out of the Kitchen: In 15 Minutes or Less",
        "Authors": "By Willan, Anne",
        "Description": "",
        "Category": "",
        "Publisher": "Rizzoli",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Turned On: Eight Vital Insights to Energize Your People, Customers, and Profits",
        "Authors": "By Dow, Roger and Cook, Susan",
        "Description": "\"Turned On captures the passion and energy of people who thrive on making things better every day for their customers, organizations and themselves.\" -- Ken Blanchard, Chairman, Blanchard Training and Development, co-author, Raving Fans and The One Minute Manager \"Impressive examples of what people working toward a common goal can accomplish. The hospitals and inner-city communities profiled are laying groundwork to turn around our cities and healthcare.\" -- Jack Kemp, Co-Director, Empower America \"Turned On is the definitive book on leading ordinary companies to extraordinary customer satisfaction and profits, using proven principles practiced by the best and brightest organizations\" -- Charles Schwab & Co., Mary Kay Cosmetics, Intel, USAA, Xerox, Levi Strauss & Co., SEMATECH and The Ritz-Carlton, to name a few. Roger Dow and Susan Cook focus on the human aspects of these star companies, then show how managers can follow their example to energize their own people, customers and profits. With action checklists, brain teasers and firsthand accounts, Turned On offers managers and employees at all levels lessons that bring immediate results. Turned On guides managers in enabling their people to take control of their jobs, think in new ways and find no-nonsense, commonsense approaches to working better. The insights are real, from the front line and provide the much needed clarity, faith and hope vital to working in today&#39;s tumultuous, high-stress environment.",
        "Category": " Business & Economics , Management",
        "Publisher": "Harperbusiness",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Death by Diet",
        "Authors": "By Barefoot, Robert",
        "Description": "Argues that mainstream medicine, along with the pharmaceutical industry, suppresses information on the effects of diet on health, and in particular the role of calcium and other minerals in preventing and treating diseases.",
        "Category": " Health & Fitness , Healing",
        "Publisher": "Bokar Consultants",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Sell and Re-sell Your Photos",
        "Authors": "By Engh, Rohn",
        "Description": "",
        "Category": "",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Power in the Blood: Land, Memory, and a Southern Family",
        "Authors": "By Mays, John Bentley",
        "Description": "John Bentley Mays left his ancestral region because, like many members of his generation, he believed a larger, more interesting life awaited him beyond the American South. The distance he put between himself and his Southern homeland widened until he eventually settled in Canada and into modern metropolitan life.Decades later, on a spring morning in 1990, the death of Mays' Aunt Vandalia summons him back to the South. As a result of his fateful return, Mays experiences an awakening of feelings and attitudes linked to his early life and family heritage, and he begins an exploration of his past. The secrets he uncovers in Vandalia's home motivate him to search for answers through the Virginia tidewater forests his ancestors cleared, the colonial plantations of his distant antebellum relatives, and the towns in South Carolina, Mississippi, and Louisiana where they lived through almost four hundred years of American history. Along the route of his journey he encounters echoes of Faulkner, remnants of civil war, and the spirits of colonial-era roads now laden with strip malls. And like many before him whose ties to their homelands have been broken, Mays struggles with the facts, stereotypes, and contradictions that exist today and color his native cultural landscape.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Baby's Bedtime Book",
        "Authors": "By Chorao, Kay",
        "Description": "Presents twenty-seven traditional rhymes, poems, and lullabies for bedtime from a variety of sources.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Bach, Beethoven, and the Boys: Music History As It Ought to Be Taught",
        "Authors": "By Barber, David W. and Donald, Dave (ILT)",
        "Description": "",
        "Category": "",
        "Publisher": "Sound & Vision Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Dora, Doralina",
        "Authors": "By De Queiroz, Rachel",
        "Description": "Dora and her dominating mother, who is the mistress of a wealthy Brazilian estate, become rivals for the same man and face betrayal, pain, and death",
        "Category": " Fiction , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "The Devil Tree",
        "Authors": "By Kosinski, Jerzy N.",
        "Description": "Unable to cope with his huge inheritance, Jonathan Whalen searches for an escape in the drug culture",
        "Category": " Fiction , Literary",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "19.25",
        "Publish Date": {
            "Month": "July",
            "Year": "1973"
        }
    },
    {
        "Title": "Doing business on the Internet: How the electronic highway is transforming American companies",
        "Authors": "By Cronin, Mary J",
        "Description": "",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Maestro: Greenspan's Fed and the American Boom (Greenspan, Alan)",
        "Authors": "By Woodward, Bob",
        "Description": "Perhaps the last Washington secret is how the Federal Reserve and its enigmatic chairman, Alan Greenspan, operate. In Maestro, Bob Woodward uses his proven interviewing and research techniques to take you inside the Fed and Greenspan's thinking. Woodward presents the Greenspan years as a gripping narrative, a remarkable portrait of a man who has become the symbol of American economic preeminence.",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Quick-Quilted Home Decor With Your Sewing Machine (Contemporary Quilting)",
        "Authors": "By Dodson, Jackie",
        "Description": "Provides instructions for making a sampler, tablecloth, pillow top, lampshade cover, wallhanging, shower curtain, bath mat, guest towel, summer quilt, and Indian basket",
        "Category": " Art , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "How Companies Lie: Why Enron Is Just the Tip of the Iceberg",
        "Authors": "By Elliott, A. Larry and Schroth, Richard Joseph",
        "Description": "An incisive study of deception in American business offers an inside look at the Enron debacle that explores the factors that led to the company's collapse, the questionable operations and machinations used by executives to make a company look better than it is, and how investors can protect themselves and their money against other at-risk corporations. 25,000 first printing.",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "Crown Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Grudge",
        "Authors": "By Chevalier, Paul",
        "Description": "After counteracting a Third Reich command, a German pilot ironically finds refuge in England, camouflaged as a British friend of the unwitting Marsh family, to evade the deadly pursuit of both Himmler and British Intelligence",
        "Category": " Literary Criticism , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "29.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Talk: NPR's Susan Stamberg Considers All Things",
        "Authors": "By Stamberg, Susan",
        "Description": "The former host of National Public Radio's \"All Things Considered\" presents a collection of her interviews with the world's most influential people, including James Baldwin, Robert Altman, Rosa Parks, Helen Hayes, and Georgia O'Keeffe. 35,000 first printing. Tour.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Blues",
        "Authors": "By Hersey, John",
        "Description": "While on a fishing trip an experienced fisherman teaches a young stranger about bluefish and life",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "The Day Diana Died",
        "Authors": "By Andersen, Christopher P.",
        "Description": "Where were you the day Diana died? Christopher Andersen draws on important sources - many of whom have agreed to speak here for the first time - to re-create in vivid and often startling detail the events leading up to that fateful night in Paris. Among the revelations: important new information about Diana's final moments alive, the accident itself - and what no one knew about the other convicted drunk driver in the car that night; Prince Charles's surprising reaction to the news of Diana's death - including his shock the first time he saw her body - the Queen's bizarre request, and a riveting account of how Prince William and Prince Harry coped with their shock and grief; the broken romance that pushed her into the arms of Dodi Fayed, their curious relationship, and whether or not she truly planned to marry him; and a behind-the-scenes account of the battle royal that raged between the Queen and Prince Charles in the days leading up to the funeral.",
        "Category": " Biography & Autobiography , Rich & Famous",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Spin Cycle: Inside the Clinton Propaganda Machine",
        "Authors": "By Kurtz, Howard",
        "Description": "Bill Clinton is the most investigated president since Richard Nixon?facing inquiries into Whitewater, campaign fundraising abuses, and sexual misconduct?and yet he improbably began 1998 with approval ratings as high as those of Ronald Reagan. But the new year has brought a barrage of new allegations, and the president and his advisers face once again the challenge of spinning the news to their advantage, a challenge they have mastered many times before.In Spin Cycle, award-winning Washington Post reporter Howard Kurtz reveals the inside workings of Clinton's well-oiled propaganda machine?arguably the most successful team of White House spin doctors in history. He takes the reader into closed-door meetings where Bill Clinton, Al Gore, Mike McCurry, Lanny Davis, and other top officials plot strategy to beat back the scandals and neutralize a hostile press corps through stonewalling, stage managing, and outright intimidation. He depicts a White House obsessed with spin and pulls back the curtain on events and tactics that the administration would prefer to keep hidden, including: The secret report that Hillary Clinton ordered on a reporter investigating the Whitewater affair as part of a plan to discredit her.A tense, almost paranoid White House atmosphere in which the spinmeisters do not question the President about the various scandals because they don't want to learn information they might have to reveal to prosecutors or the press.The secret meeting between a Clinton operative and the editor of The New York Times that led to a presidential interview in which Clinton knew the questions in advance.Bill Clinton's success in reaping favorable publicity by secretly courting selected reporters and columnists in off-the-record White House meetings.Al Gore's feelings of betrayal as the scandal-hungry press turned on him and jeopardized his presidential candidacy in 2000. Spin Cycle is an all-too-human drama in which political operatives wrestle with their consciences as they struggle to protect the boss. As the scandal drums beat louder and louder, Kurtz shows what it takes for the president and his people to survive, and what happens to the truth along the way.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Simon & Schuster Listener's Guide to Opera",
        "Authors": "By Rich, Alan",
        "Description": "",
        "Category": "",
        "Publisher": "Fireside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Good Fight: The Education of an American Reformer",
        "Authors": "By Hart, Gary",
        "Description": "Presenting case studies that illustrate attempts at political reform throughout history, the author explains how the legislative process ran amok after the election of Ronald Reagan to the presidency. 25,000 first printing. Tour.",
        "Category": " Political Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Cholesterol Cures: From Almonds and Antioxidants to Garlic, Golf, Wine and Yogurt - 325 Quick and Easy Ways to Lower Cholesterol and Live Longer",
        "Authors": "By Trubo, Richard",
        "Description": "This A-to-Z encyclopedia of more than 50 all-natural remedies for high cholesterol gives you simple, practical advice from more than 30 experts in cardiovascular health, including Dean Ornish, M.D., president and director of the Preventive Medicine Research Institute in Sausalito, California, and Peter O. Kwiterovich, Jr., M.D., director of the Lipid Research and Atherosclerosis Unit at Johns Hopkins University School of Medicine in Baltimore.You'll discover three vitamins that help you keep your arteries clear; five ways to savor heart-healthy soy foods; new ways to cut fat - not flavor - from 20 can't-live-without dishes; how expert doctors and top chefs trim the fat from their own diets; stress reduction techniques that can benefit your heart; and a convenient 500-food fat and cholesterol counter to help you root out the fat in your diet.",
        "Category": " Health & Fitness , Healing",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Every Woman Has a Story: Many Voices, Many Lessons, Many Lives : True Tales",
        "Authors": "By Underhill, Daryl Ott (COM)",
        "Description": "A warm and inspiring collection of true-life tales gathered from everyday women captures all of the joy, heartbreak, hope, and despair of modern-day life, examining such subjects as motherhood, turning thirty, and empty nest syndrome. 125,000 first printing.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Yesterday I Cried: Celebrating the Lessons of Living and Loving",
        "Authors": "By Vanzant, Iyanla",
        "Description": "What is the lesson in abuse, neglect, abandonment, rejection?  What is the lesson when you lose someone you really love?  Just what are the lessons of life's hard times?  Bestselling author Iyanla Vanzant has had an amazing and difficult life -- one of great challenges that unmasked her wonderful gifts and led to wisdom gained. In this simple book, she uses her own personal experiences to show how life's hardships can be re-languaged and re-visioned to become lessons that teach us as we grow, heal, and learn to love. The pain of the past does not have to be today's reality. Iyanla Vanzant is an example of how yesterday's tears become the seeds of today's hope, renewal, and strength.",
        "Category": " Psychology , Social Psychology",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Chadwick and the Garplegrungen",
        "Authors": "By Cummings, Priscilla and Cohen, A. R. (ILT)",
        "Description": "A crab leaves his home at the National Aquarium in Baltimore to help clean up the pollution in the Chesapeake Bay which is threatening the lives of his animal friends.",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Schiffer Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Study Guide to Accompany Fundamentals of Nursing: Human Health and Function",
        "Authors": "By Craven, Ruth F., Hirnle, Constance J., Vaughans, Bennita W., Prather-Hicks, Phyllis, Johnson, Joyce Young",
        "Description": "",
        "Category": "",
        "Publisher": "Lippincott Williams & Wilkins",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "A Sense of the Country: A Seasonal Guide to Decorating Your Home With Flowers, Fruits and Natural Objects",
        "Authors": "By Burgess, Linda and Conder, Susan",
        "Description": "Divided into seasonal chapters, each showing how to use fruits, vegetables, flowers, and found objects to create unique arrangements",
        "Category": " Art , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Make Believe",
        "Authors": "By Fujikawa, Gyo",
        "Description": "",
        "Category": "",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "Setting the World",
        "Authors": "By Wilson, Angus",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1980"
        }
    },
    {
        "Title": "Pontiff",
        "Authors": "By Thomas, Gordon and Morgan-Witts, Max",
        "Description": "A behind-the-scenes view of the Vatican offers a revealing look at the lives of Paul VI, John Paul I, and John Paul II, the attempted assassination, the Vatican's financial dealings, and its undisclosed relationship with Solidarity",
        "Category": " Religion , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "Venture Catalyst : The Five Strategies for Explosive Corporate Growth",
        "Authors": "By Laurie, Donald L.",
        "Description": "Where's the growth? While the NASDAQ has generated over three trillion dollars in new wealth over the past ten years, many companies are still playing by yesterday's rules, growing incrementally or expanding through risky mergers and acquisitions. In today's high-stakes environment, the question is not whether to venture but how far and fast can your company grow through new business creation. In Venture Catalyst, Don Laurie offers an insider's perspective on the explosive world of corporate venturing through interviews with such pioneers as Roger Ackerman of Corning, David Wetherell of CMGI, and Mitch Kapor of Accel. Moreover, he offers a practical framework for identifying new sources of growth, launching and managing ventures, balancing the tension between established discipline and entrepreneurial creativity, and maximizing the value of ventures. For executives, managers, entrepreneurs, and investors alike, Venture Catalyst is a powerful guide to thriving in the new economy.",
        "Category": " Business & Economics , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Limerick",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Value Proprietary",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Black Lives, White Lives: Three Decades of Race Relations in America",
        "Authors": "By Blauner, Bob",
        "Description": "One evening in 1955, Howard Spence, a Mississippi field representative for the NAACP investigating the Emmett Till murder, was confronted by Klansmen who burned an eight-foot cross on his front lawn. \"I felt my life wasn't worth a penny with a hole in it.\" Twenty-four years later, Spence had become a respected pillar of that same Mississippi town, serving as its first black alderman.The story of Howard Spence is just one of the remarkable personal dramas recounted in Black Lives, White Lives. Not all of the tales told by the sixteen blacks and twelve whites interviewed are as encouraging; some are bitter accounts of failed promises, misunderstandings, and lost opportunities. Black and white, rich and poor, men and women, collectively they reveal in their own words the paradoxical realities wrought by three decades of tumultuous racial change.Beginning in 1968, Bob Blauner and a team of interviewers began to record the words of those caught up in the crucible of rapid racial, social, and political change. Unlike most restrospective oral histories, these interviews capture \"live\" the intense racial tension of 1968 as people talk with unusual candor about their deepest fears and prejudices. The diverse experiences and changing beliefs of these individuals, most of whom were interviewed again in 1979 and 1986, become an extraordinary commentary on the development of race relations since the 1960s.",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "The star of Bethlehem: The history, mystery, and beauty of the Christmas star",
        "Authors": "By Wolff, Glenn (ILT) and Hanson, Jeanne K.",
        "Description": "Jeanne Hanson explores one of our culture's most powerful icons of hope and mystery from a number of fascinating perspectives. Interspersed among Hanson's descriptions of the religious, scientific, scholarly, and philosophical importance of the star are dozens of passages from literature and fable that illustrate how the Star of Bethlehem has captivated Babylonian clerics, Chinese astronomers, and modern-day watchers of the sky.",
        "Category": "",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Statistics: Concepts and Controversies",
        "Authors": "By Moore, David S.",
        "Description": "",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "The Zen of Food",
        "Authors": "By Murphey, Sallyann J.",
        "Description": "A spiritual approach to the simple joys and wonders of a well-cooked meal, this \"philosophy of nourishment\" helps readers appreciate the role that food plays in our lives, offering a more contemplative and joyous existence. Original.",
        "Category": " Religion , Spirituality",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Witches of Salem",
        "Authors": "By Nevins, Winfield S.",
        "Description": "",
        "Category": " History , United States , State & Local , New England (CT, MA, ME, NH, RI, VT)",
        "Publisher": "Longmeadow Pr Promotional",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Oxford Starter French Dictionary (Oxford Starter Dictionaries)",
        "Authors": "By Correard, Marie-Helene (EDT) and O'Neill, Mary (EDT)",
        "Description": "Thoroughly revised, this dictionary breaks fresh ground in language-learning, providing essential information in a unique, user-friendly way. Specially designed for beginners, this volume contains nearly 20,000 words and covers everyday vocabulary and core survival phrases. From irregular verb forms to common idiomatic usage, it provides generous coverage of those aspects of the French language that are difficult to decode for English speakers. These innovative teaching tools make this dictionary an unparalleled introduction to the French language.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Convention",
        "Authors": "By Reeves, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Man In The Dugout, The: Baseball's Top: Managers and How They Got That Way",
        "Authors": "By Koppett, Leonard",
        "Description": "Leonard Koppett, newly elected to the writer's wing of the Baseball Hall of Fame, takes a thoughtful and lively look at the long, colorful tradition of major-league baseball managers.What sort of men are the major-league managers? What are they like? Where do they come from? How do they learn their craft? Why do some have one style and others another? And, most of all, how come some are more successful than others, more respected, more important in the history of their field?Koppett shows how the most successful and influential of the more than 500 men who have actually managed in the majors can trace their descent from three exceptional men: John McGraw, Branch Rickey, and Connie Mack. They not only fashioned modern baseball's development in the first half of the twentieth century, but their direct influence is still visible and ubiquitous in every ballpark today.Filled with anecdotes and the author's firsthand observations of the many managers he has known during his long career, The Man in the Dugout is destined to become the armchair-general's and second-guesser's bible - required reading for all fans, sports-writers, athletes, big-league managers, and would-be big-league managers.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Speaking His Mind: (American Council on Education Oryx Press Series on Higher Education)",
        "Authors": "By Trachtenberg, Stephen Joel",
        "Description": "An enlightening and fascinating collection of speeches by Stephen Trachtenberg, this book touches upon many of the fundamental issues facing institutions of higher education. Trachtenberg asks why, although everybody agrees something must be done about our public education system, nothing, or next to nothing, has actually happened? If what our students most lack are technical and mathematical skills, is the debate over western tradition vs. multiculturalism a red herring? Can total quality management really work in the stratified environment of American higher education? Whether examining the role of business in education, the value of political correctness, the frayed self-image of American higher education, or the legacy of Martin Luther King, Jr., Trachtenberg brings to each topic not only his thought-provoking insight and wry humor, but his own wealth of real-life experience in education, government, and business.",
        "Category": " Education , Higher",
        "Publisher": "Praeger",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "You Don't Have to Be Thin to Win: The Official Chub Club Coach's Workout Program",
        "Authors": "By Molnar, Judy and Babbitt, Bob",
        "Description": "A woman who lost 130 pounds through diet and exercise, turned her life, and became a coach on Rosie O'Donnell's  \"Chub Club\" tells her inspiring story.",
        "Category": " Health & Fitness , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Tracey Takes On",
        "Authors": "By Ullman, Tracey",
        "Description": "Forever in a category by herself, award-winning actress and comic chameleon Tracey Ullman has been practicing her unique brand of comedy for American audiences for over a decade. First on her comedy variety show on Fox and then through her critically acclaimed hit HBO series, Tracey Takes On, Tracey has fashioned an astonishingly diverse gallery of richly imagined characters, each of whom has something profoundly amusing to say about the best and worst of the human condition.In Tracey Takes On - the book - these vivid creations are given an opportunity to spout off on such loaded topics as mothers, royalty, and childhood. They're all here - Mrs. Noh Nang Ning, the wily donut shop owner who's a bottomless well of home-spun, donut-centric philosophy; Chic, the Middle Eastern New York City cab driver and unabashed Disco-machismo reactionary; the wickedly superior and detached Her Royal Highness; Trevor Ayliss, the endearingly contemplative gay flight attendant who's seen it all; Long Island yenta Fern Rosenthal; Sydney Kross, the slick, misanthropic criminal-defense lawyer; washed-up bombshell actress and shameless self-promoter Linda Granger; and many more, including Tracey herself.",
        "Category": " Humor , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "How to Do Just About Anything: A Money-Saving A-To-Z Guide to over 1,200 Practical Problems",
        "Authors": "By Not Applicable (Na )",
        "Description": "Brief articles provide information on cooking, safety, gardening, photography, household maintenance, child care, fishing, games, personal finance, hygiene, and car care",
        "Category": "",
        "Publisher": "The Reader's Digest Association, Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Side Dishes Creative and Simple: Vegetable & Fruit Accompaniments for All Occasions",
        "Authors": "By Davis, Deirdre",
        "Description": "Help at last for the cook who is  bored with serving the same old vegetables with a pat of butter who has neither the time nor the inclination to make a production of a side dish.  Deidre Davis provides more than 100 recipes for accompaniments, from the novel to the traditional - all simple enough to make while the main course is cooking.",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "Chapters Pub Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Golf Nut's Book of Amazing Feats",
        "Authors": "By White, George, Nash, Bruce, and Zullo, Allan",
        "Description": "Biggest Alligator Flipped Over by a Golfer (see page 25)  Most Shots Over Par on a Hole After Heeding the Call of Nature in a Major Tournament (see page 36)    Eye-popping aces, out-of-control pros, and outrageous Opens are  the name of the game in this hilarious and all-too-true collection of golf's funniest moments. These true tall tales feature touring pros Lee Trevino, Seve Ballesteros, Greg Norman, Sam Snead, Nick Faldo, Jack Nicklaus, Craig Stadler, and Gary Player as well as celebrity golfers Fred Astaire and Bobby Knight, among others. In the unpredictable world of nutty golf records, golf balls wind up in some extremely hard-to-hit places--up trees, in pockets, or in the beaks of hungry ravens-while putters and drivers are strangled, hurled for distance, or dragged behind cars by their revenge-seeking owners. Topless dancers, de-pantsed pros, streaking fans, and caddying llamas find their way onto some of America's most famous courses. Witty, wild, and wacky, The Golf Nut's Book of Amazing Feats and Records is your guide to the fairway phenomena that never find their way into standard golf record books.   Bruce Nash and Allan Zullo are the authors of the Sports Hall of Shame book series and the nationally syndicated \"Sports Hall of \"Shame\" comic feature. George White is golf editor of the Orlando Sentinel and contributes to many golf magazines.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Mcgraw Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Jim Fixx's Second Book of Running",
        "Authors": "By Fixx, James F.",
        "Description": "Provides an overview of the sport and experience of running, discussing a variety of topics including inertia, the equipment explosion, marathons, podiatrists, the literature of running, and running in faraway places",
        "Category": " Sports & Recreation , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1980"
        }
    },
    {
        "Title": "How to instill values that count (Christian parenting library)",
        "Authors": "By McEwan, Elaine K.",
        "Description": "",
        "Category": "",
        "Publisher": "LifeJourney Books, David C. Cook Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Nutri/System Flavor Set-Point Weight-Loss Cookbook",
        "Authors": "By Scobey, Joan and Schiffman, Susan S.",
        "Description": "Suggests a new approach to weight loss, shares a variety of low-fat, low-salt recipes, and offers advice on menu planing",
        "Category": " Health & Fitness , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "New Times In The Old South: Or Why Scarlett's in Therapy & Tara's Going Condo",
        "Authors": "By Schwartz, Maryln",
        "Description": "Offers humorous insights concerning the trials and tribulations of social climbing in the South",
        "Category": " Humor , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Hollyhocks, Lambs and Other Passions",
        "Authors": "By Hardie, Dee",
        "Description": "This memoir, by the author of \"House Beautiful's\" popular column, \"View from Thornhill,\" recounts her life in Thornhill Farm, a place made special--and beautiful--by a woman's love and care",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "My Old Man and the Sea: A Father and Son Sail Around Cape Horn",
        "Authors": "By Hays, David and Hays, Daniel",
        "Description": "Some fathers and sons go fishing together. Some play baseball. David and Daniel Hays decided to sail a tiny boat 17,000 miles to the bottom of the world and back. This is their story.David is romantic, excitable, and reflective; Daniel is wry, comic, and down-to-earth. Together their alternating voices weave a story of travel, of adventure, and of difficult, dangerous blue-water sailing. The Caribbean, the Panama Canal, the Galapagos Islands, Easter Island, Cape Horn, the Falklands - these far-flung places spring vividly to life in My Old Man and the Sea.Father and son don't always get along, though. Daniel has been an uneasy and uneven student. Now, just out of college, he's unsure what to do next. He sees his father growing older, slower, more forgetful. David is haunted by memories of his own father, of the things they never said to each other, and the fear that he'll make the same mistakes with his son. But he gets angry when Daniel treats him like an old man.On this voyage, the son will become the captain, and the father will relinquish control. Before long they are at sea, headed for the huge waves and unceasing wind of the Southern Ocean with only their skill as sailors, a compass, a sextant, a ship's cat, and Sparrow, the 25-foot boat they've built together.Lovers of sailing and travel books will find this often hilarious, often moving tale of voyage and self-discovery to be in the tradition of Farley Mowat's The Boat Who Wouldn't Float, Bruce Chatwin's In Patagonia, and Paul Theroux's The Happy Isles of Oceania. But more than that, it's the story of a father and son who go down to the sea to find each other, and of what they bring back.",
        "Category": " Biography & Autobiography , Reference",
        "Publisher": "Algonquin Books of Chapel Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Reason to Believe",
        "Authors": "By Cuomo, Mario Matthew",
        "Description": "With the unmistakable fire that has lit up Democratic thinking for more than a decade, Mario Cuomo delivers in these pages a vivid rebuke to the radical Republicans running riot in Washington - and a clear-eyed, commonsense assessment of \"where we are, where we're going, and what we should do about it.\"Forthright in confessing his party's own failings, Cuomo is relentless in dismantling the opposition, using the floodlight of his clear prose to reveal the evasion and show the inadequacy of the Contract with America. In its place he offers a hopeful vision of what we the people might achieve if we can only learn to remember that \"we're all in this together.\"Those who feel Congress has swung dangerously rightward will find here both hope and ammunition. But the book is not for partisans only: all of us can benefit from Cuomo's plain-English explanations of the great social and economic challenges that dog America's present and define her future.Written with a depth of understanding drawn from twenty years of daily involvement with local, state, and federal government and six decades as the American son of quintessential immigrants, this book is, as Cuomo explains, in many ways a tribute to the extraordinary, uncompromising wisdom of people like his parents and the parents of his wife, Matilda, seekers and believers who taught him the lesson America needs so badly now: \"that what is right is usually also what is necessary; that in helping one another we almost always help ourselves.\"",
        "Category": " Political Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Food and You: Everything a Woman Needs to Know About Loving Food--For Better Health, for a Beautiful Body and for Emotional Satisfaction",
        "Authors": "By Harrar, Sari (EDT), Loecher, m Barbara, Konner, Linda, and Faelten, Sharon (EDT)",
        "Description": "What is it that makes women obsess about their weight? Or use food to cope with their emotions? Or feel guilty after they eat? Food and You is the first book to help women understand the mysterious connection between food and their appetites, hormones, weight, emotions and overall health.Based on the latest findings and interviews with leading experts in weight control and nutrition, this book also reveals women's personal stories of their struggles with and victories over food. Food and You teaches women how to make peace with food and enjoy good health.",
        "Category": " Health & Fitness , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Big Blue: IBM's Use and Abuse of Power",
        "Authors": "By Delamarter, Richard T.",
        "Description": "Offers a surprising expose of IBM, its methods and strategies, its dominance of the information industry, and its past and prospective impact on free enterprise and democracy",
        "Category": " Business & Economics , General",
        "Publisher": "Dodd Mead",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Linda Eckhardt's Great Food Catalog",
        "Authors": "By Eckhardt, Linda West",
        "Description": "A directory of mail order food suppliers, including gourmet foods, regional specialties, and gift items",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "The Delany Sisters' Book of Everyday Wisdom",
        "Authors": "By Delany, Sarah, Delany, A. Elizabeth, and Hearth, Amy Hill",
        "Description": "Sarah and A. Elizabeth Delany, now 105 and 103 years old, took the reading public by storm with their surprise bestseller, Having Our Say: The Delany Sisters' First 100 Years. Since then, people all over the world have been writing and asking them questions.",
        "Category": " Self-help , Affirmations",
        "Publisher": "Kodansha USA Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Moving Beyond Words",
        "Authors": "By Steinem, Gloria",
        "Description": "Gloria Steinem is one of the country's most influential and innovative writers and activists. In Revolution from Within, Marilyn: Norma Jean, and Outrageous Acts and Everyday Rebellions, she created a dialogue with her readers that shapes the way we think about human possibilities. In this newest six-part adventure of essays that \"begin in a personal place, and arrive at a larger point,\" she offers more revolutionary ideas, compassionate insights, and one truly over-the-top fantasy. Three of its six parts appear here for the first time. Three of them have a seed, seedling, or partly grown plant in a previously published article. As Steinem writes in the Preface, \"Each of these six parts is rather like a condensed book....Since there seems to be no genre for this, I've found myself explaining it this way: If you added water to any of these parts, it would become a book.\"",
        "Category": " Social Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "When I Think of Bobby: A Personal Memoir of the Kennedy Years",
        "Authors": "By Rogers, Warren",
        "Description": "A friend of Robert Kennedy relates with humor and affection parties, crises involving RFK's children, his work, his friends, his account of Kennedy's assassination, and other incidents. 20,000 first printing. $30,000 ad/promo.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Fresh Blood",
        "Authors": "By Ungar, Sanford J.",
        "Description": "Drawing on richly textured interviews conducted from one end of the country to the other, veteran journalist Sanford J. Ungar documents the real-life struggles and triumphs of America's newest immigrants and assesses their contributions. He finds that the self-chosen who arrive every day, most of them legally, still enrich our national character and experience and make invaluable political, economic, social, and even gastronomic contributions.Ungar takes us inside immigrant communities - the Koreans in Los Angeles, the Poles in Chicago, the Cubans in Miami, the Ethiopians in Washington - and shows how our melting pot is becoming a mosaic in which ethnic groups proudly maintain their identities and yet add to the common good. He also introduces us to remarkable individuals - an Indian hotel keeper in Pensacola, a Vietnamese samaritan in rural Ohio, a Syrian traditionalist in Houston, a Haitian community organizer in Boston - all grappling with what it means to become an American today. Here, too, are glimpses inside the little-known worlds of the undocumented Irish, competing to win visas in the federal lottery, and of the tiny community of Iranian Jewish immigrants from Mashad, fighting to preserve their uniqueness from the perceived threat of assimilation.Ranging the country's southern frontier, the author goes on night duty with Border Patrol agents in Texas and California, crosses from Tijuana with Mexicans trying to evade the law, and visits a sanctuary for illegal immigrants in Brownsville. He explores immigration crises on both coasts and examines the new anti-immigrant mood sweeping America, finally concluding that California's Proposition 187 is as un-American a law as any we have today.",
        "Category": " Social Science , Emigration & Immigration",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "How Could You Do That?! The Abdication of Character, Courage, and Conscience",
        "Authors": "By Schlessinger, Laura",
        "Description": "In her hard-hitting new book, Dr. Laura Schlessinger delivers a witty, wise, and workable moral philosophy - based on the principle of personal responsibility. How Could You Do That?! argues passionately against the self-indulgent subjective morality used in our society to excuse all sorts of bad behavior.In her lively, pull-no-punches style, Dr. Laura takes on the moral dilemmas of our time: from the mindless pursuit of pleasure and immediate gratification to taking the easy way out when those actions produce ugly or uncomfortable life-altering consequences. She demonstrates in no uncertain terms that personal values are never someone else's responsibility, but our own, and why choosing not to honor them actually compounds unhappiness. Finally, she explains that by disciplining self-indulgence and rising above temptation we can discover the infinite pleasures, the true happiness, of the moral high ground.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "All Too Human: A Political Education",
        "Authors": "By Stephanopoulos, George",
        "Description": "All Too Human is a new-generation political memoir, written from the refreshing perspective of one who got his hands on the levers of awesome power at an early age. At thirty, the author was at Bill Clinton's side during the presidential campaign of 1992, & for the next five years he was rarely more than a step away from the president & his other advisers at every important moment of the first term. What Liar's Poker did to Wall Street, this book will do to politics. It is an irreverent & intimate portrait of how the nation's weighty business is conducted by people whose egos & idiosyncrasies are no sturdier than anyone else's. Including sharp portraits of the Clintons, Al Gore, Dick Morris, Colin Powell, & scores of others, as well as candid & revelatory accounts of the famous debacles & triumphs of an administration that constantly went over the top, All Too Human is, like its author, a brilliant combination of pragmatic insight & idealism. It is destined to be the most important & enduring book to come out of the Clinton administration.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "The Romance of Paula Vaughan",
        "Authors": "By Vaughan, Paula",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Leisure Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Landing",
        "Authors": "By Johnson, Haynes and Simons, Howard",
        "Description": "A Nazi plan to infiltrate key institutions and, ultimately, to assassinate President Franklin Delano Roosevelt challenges the daring and ingenuity of the three Americans who can thwart it--government investigator Henry Wyatt Eaton, FBI employee ConstanceAiken, and Leon Thomas, a dedicated black cop",
        "Category": " Fiction , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Mayday: Eisenhower, Khrushchev, and the U-2 Affair",
        "Authors": "By Beschloss, Michael R.",
        "Description": "Uncovers the story of Francis Gary Powers's flight in a CIA U-2 spy plane into Soviet airspace two weeks before a vital Paris summit meeting in 1960 between Eisenhower and Khrushchev",
        "Category": " History , United States , General",
        "Publisher": "Harper and Row",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Strictly Personal",
        "Authors": "By Eisenhower, John S. D.",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The Pyramid Cookbook: Pleasures of the Food Guide Pyramid",
        "Authors": "By Baird, Pat",
        "Description": "A guide to the USDA's new Food Pyramid explains the different layers of the pyramid, defining what constitutes a serving, and presents more than one hundred recipes that are low in fat, cholesterol, and sodium. 30,000 first printing. Tour.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Breaking with Moscow",
        "Authors": "By Shevchenko, Arkady N.",
        "Description": "The author, a former advisor to Soviet Foreign Minister Andrei Gromyko, discusses the reasons for his defection and recounts his experiences as a reluctant spy for the United States",
        "Category": " Political Science , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Student's Guide for Writing College Papers",
        "Authors": "By Turabian, Kate L.",
        "Description": "This third edition of Kate L. Turabian's Student's Guide for Writing College Papers is designed for high school, junior college, or college students faced with writing their first long, documented paper. Besides the book's step-by-step directions for all aspects of paper writing, the sixth chapter, \"Some Matters of Style,\" has been extensively revised, and the List of Reference Works useful to students has been recompiled and greatly expanded by Donald F. Bond, a specialist in bibliography. Students and teachers will appreciate a new system of numbering each paragraph which facilitates locating any desired item through the Index or cross-references in the text.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1977"
        }
    },
    {
        "Title": "Holt Guide to Documentation and Writing In the Disciplines",
        "Authors": "By Kirszner, Mandell",
        "Description": "",
        "Category": "",
        "Publisher": "International Thomson Publishing",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Basically Bach: A 300th Birthday Celebration",
        "Authors": "By Kupferberg, Herbert",
        "Description": "Gathers quotations by Bach, provides information about his life and career, and summarizes modern opinion about his work",
        "Category": " Music , General",
        "Publisher": "Mcgraw Hill",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Losing a Parent: Passage to a New Way of Living",
        "Authors": "By Kennedy, Alexandra",
        "Description": "Kennedy shares her own story of facing the loss of a parent and offers innovative strategies for healing and transformation.",
        "Category": " Self-help , Death, Grief, Bereavement",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Infinity's Shore (Bantam Spectra Book)",
        "Authors": "By Brin, David",
        "Description": "For two thousand years, Jijo, planet of fugitives, has sheltered six bands of sapient beings, each with a different reason for fleeing the ancient civilization of the Five Galaxies. On Jijo, races that had been deadly enemies on the star lanes have instead found ways to get along, in a rough but promising peace. Their greatest wish: to be left alone. Their greatest fear, foretold in a dour religion: an inevitable Judgment Day, when godlike Galactic authorities will punish their illegal colony.Has that day now come? As starships fill Jijo's skies, humans and other settlers realize that things are even worse than that. With galaxies in turmoil, all the venerable laws have been cast aside. Now meddlers, criminals, and fanatics feel free to plunder this isolated world or carry out ancient grudges, including genocide for one of Jijo's six races - and possibly for all.Amid this crisis, human settlers and their neighbors must make heroic - and terrifying - choices. A scientist must turn against the benefactors she'd been trained to love. A heretic finds himself called upon to rally believers in a cause he never shared. And four youngsters from wildly different races find that what started as a simple adventure - imitating exploits they read about in Earthling books by Verne and Twain - will take them to the dark abyss of Jijo's ocean in search of answers...and then far beyond.Above all, this is the tale of Earth Survey Ship Streaker, with her fugitive dolphin crew, whose forlorn odyssey brought her at last to Jijo in desperate search of refuge. What she finds instead are secrets that have lain hidden since the spiral galaxies first burgeoned with intelligence; that may spell Jijo's salvation - or destruction; and that may unlock destiny, not just for Earthclan, but for all Five Galaxies.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Scent of Magic",
        "Authors": "By Norton, Andre",
        "Description": "Norton's latest creation is a faraway dukedom rich in intoxicating aromas: powerful fragrances carried on gentle breezes, some with the capacity to enchant and befuddle, some capable even of toppling great leaders from their thrones. A scullery maid - an orphaned child - possesses an uncanny ability to sense and understand the magical odors that pervade her world; a talent/curse that carries young Willadene far from the fetid kitchen and a repulsive impending marriage, into an apprenticeship with a revered herbalist and, ultimately, to the highest circles of the Ducal court.But there is a malevolence lurking within the castle's walls, inspiring brazen treacheries and usurpations...and a foul abduction as unthinkable as it is unexpected. Something horribly strange and forbidden has struck at the dawn of a new day of corruption and terror. And a young girl finds the heightened sense that has been her fortune now drawing her inextricably down into a maelstrom of evil. Now a great quest is in Willadene's future: a journey to a place of darkness; of tainted covenants and ancient battles of blood and sacrifice when monsters warred with heroes. For the extraordinary power that has molded her destiny is propelling her toward shocking self-knowledge and an impossible rescue in a realm of shadows, secrets, and devastated hope where the invincible lord of abominations reigns.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Eos",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Ghost",
        "Authors": "By Anthony, Piers",
        "Description": "When Space Captain Shetland, commander of an experimental deep time ship, happens upon a ghost universe, his crew are shattered into beings of pure will, and he must help them to regain their humanity",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Mazeway",
        "Authors": "By Williamson, Jack",
        "Description": "Benn Dain, an inhabitant of a shattered Earth, journeys to Mazeway, where she must compete in the Eldrens test of worthiness, the outcome of which will seal the fate of the human race",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Deserted Cities of the Heart",
        "Authors": "By Shiner, Lewis",
        "Description": "The jungles and cities of contemporary Mexico are the setting for this novel of revolution and the apocalypse, and of a shattering odyssey into the Mayan underworld",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Basic Skills (Lettering Workbooks)",
        "Authors": "By Trudgill, Anne",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Watson-Guptill Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "The Decorative Art of Dried Flower Arrangement",
        "Authors": "By Vance, Georgia S.",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1972"
        }
    },
    {
        "Title": "Douglas MacArthur: The Far Eastern General",
        "Authors": "By Schaller, Michael",
        "Description": "With his chiseled face, corn-cob pipe, and a voice which \"could trumpet and drum,\" General Douglas MacArthur looked the part of a \"heaven born general.\"  Although he became arguably the best-known and most flamboyant American military leader of the twentieth century, the men who served in the trenches of Bataan sneeringly referred to him as \"Dugout Doug.\"  FDR privately termed MacArthur's defense of Corregidor \"criminal,\" and Truman called his self-promoted \"return\" to the Philippines \"a fiasco.\"      This eye-opening book, written by one of America's leading authorities on United States-East Asian relations, offers an intimately detailed portrait of MacArthur, focusing particularly on the General's two decades in the Far East. Far from depicting him in a flattering light, Michael Schaller demythologizes the \"American Caesar,\" and along the way gives us an insightful analysis of American foreign policy in Asia during those years.      Revealing MacArthur's military failings, Schaller describes the costly consequences of MacArthur's indecisive Pacific Island campaign during World War II, which the popular press often hailed as brilliant.  He also examines MacArthur's three futile attempts at the presidency and his destructive interference in foreign policy--ranging from his manipulation of policies in occupied Japan and his constant attacks on Truman's policy in China, to the Korean War when the seventy-year-old general willfully risked war with China and the Soviet Union to salvage his pride and humiliate his political enemies in Washington.       This thought-provoking biography provides invaluable background to America's present relations with the Far East, as well as an unforgettable portrait of a man driven by talent, opportunism, vision, egotism, and jealousy.",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    }
]