[
    {
        "Title": "Katherine Hepburn",
        "Authors": "By Gary carey",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1975"
        }
    },
    {
        "Title": "Weekends With Friends (Williams-Sonoma Lifestyles)",
        "Authors": "By Williams, Chuck (EDT), Pool, Joyce Oudkerk (PHT), and Rosbottom, Betty (EDT)",
        "Description": "",
        "Category": " Cooking , Entertaining",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Feast of Good Cooking - Inspired Baking",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "World Pubns",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "To Improve Health and Health Care Volume X: The Robert Wood Johnson Foundation Anthology (Public Health/Robert Wood Johnson Foundation Anthology)",
        "Authors": "By Isaacs, Stephen L. (EDT) and Knickman, James R. (EDT)",
        "Description": "Since 1972, the Robert Wood Johnson Foundation has been the nation's largest philanthropy devoted exclusively to health. To further its mission of improving the health and health care of all Americans, the Foundation strives to foster innovation, develop ideas, disseminate information, and enable committed people to devote their energies to improving the nation's well-being. As part of the Foundation's efforts to inform the public, To Improve Health and Health Care, the tenth volume in the Robert Wood Johnson Foundation Anthology series, provides an in-depth look into the programs it funds. Written for policymakers and practitioners, as well as interested members of the public, the series offers valuable lessons for leaders and educators developing plans for the coming years.",
        "Category": " Medical , Public Health",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Bread Book",
        "Authors": "By Smith, Bill",
        "Description": "A collection of original bread recipes features instructions for basic breads, entrees, main courses, and after-dinner desserts",
        "Category": " Cooking , Courses & Dishes , Bread",
        "Publisher": "Crescent",
        "Price Starting With ($)": "6.28",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "Bernstein's Reverse Dictionary",
        "Authors": "By Bernstein, Theodore Menline, Grambs, David, and Feighan, Francis X.",
        "Description": "Provides an alphabetical listing of more than thirteen thousand meanings and the words they define",
        "Category": " Reference , Dictionaries",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Healthy, Wealthy, and Wise",
        "Authors": "By No Author",
        "Description": "",
        "Category": "",
        "Publisher": "FC&A Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Get Off the Dime: The Secret of Changing Who Pays for Your Healthcare",
        "Authors": "By Potarazu, Sreedhar, M.D.",
        "Description": "",
        "Category": " Business & Economics , Insurance , Health",
        "Publisher": "Trinity Press",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "French Family Cooking",
        "Authors": "By Bernard, Francoise",
        "Description": "Presenting 250 recipes from every region of France, this cookbook is arranged by course and features elegantly simple dishes, beginning with soups and hor d'oeuvres and ending with desserts",
        "Category": " Cooking , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "The Vestry Handbook",
        "Authors": "By Webber, Christopher L.",
        "Description": "",
        "Category": "",
        "Publisher": "Morehouse Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Men of the Bible: A One Year Devotional Study of Men in Scripture",
        "Authors": "By Spangler, Ann and Wolgemuth, Robert D.",
        "Description": "Men of the Bible takes a close-up look at fifty-two men in Scripture—complex flesh-and-blood characters whose strengths and weaknesses often seem strangely similar to our own. Heroes and villains, sinners and prophets, commoners and kings . . . their dramatic life stories provide us with fresh perspective on the unfolding story of redemption.Though our culture differs vastly from theirs, the fundamental issues we face in relation to God and the world remain the same. We still reach for great dreams and selfish ambitions. We wrestle with fear and indecision, struggle with sexual temptation, and experience the ache of loneliness and the devastation of betrayal. And, like many of these men, we long to walk more closely with the God who calls us into an intimate relationship with himself and who enables us to fulfill his purpose for our lives. Men of the Bible offers men and women today a unique devotional experience that combines five elements. Each week becomes a personal retreat focused on the life of a particular man:Monday: His Story—a narrative retelling of the biblical storyTuesday: A Look at the Man—focusing on the heart of the man and how his story connects with your own lifeWednesday: His Legacy in Scripture—a Bible study on principles revealed through the life of the manThursday: His Legacy of Promise—Bible promises that apply to his life and yoursFriday: His Legacy of Prayer—praying in light of his storyDesigned for personal prayer and study or for use in small groups, Men of the Bible will help you make Bible reading a daily habit. Whether you dip into portions or read every page, this book will help you grow in character, wisdom, and obedience as a person after God’s own heart.",
        "Category": " Religion , Christian Life , Devotional",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Hows and whys of French cooking",
        "Authors": "By Lach, Alma S.",
        "Description": "",
        "Category": "",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "100 Styles of French Cooking",
        "Authors": "By Wurzer, Karl",
        "Description": "This encyclopedic cookbook describes French food terms and cooking styles from l'Albigeoise to a la Zingara and contains recipes for entrees, side dishes, and desserts for each classic style",
        "Category": " Cooking , Regional & Ethnic , French",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "37.58",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "Philosophy: an introduction (College outline series, no. 41)",
        "Authors": "By Randall, John Herman, Buchler, Justus",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Making The Most Of Your Life: A Love Letter To My Grandchildren",
        "Authors": "By Shuster, Bud",
        "Description": "Making the Most of Your Life! A Love Letter to My Grandchildren describes how Bud Shuster rose from the bleakest of times to become a successful computer industry entrepreneur, United States Congressman, and the creator of an enduring legacy for his family.Even more important, Shuster translates the experiences of his extraordinary life - his successes and failures, his gutsy decisions and mistakes - into a guide for anyone who wants to make the most of his or her own life. Young and old alike can profit from the practical wisdom contained in the pages of this touching and easily readable book.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Ragged Edge Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Fundamentals of Mathematics, Vol. 1: Foundations of Mathematics: The Real Number System and Algebra",
        "Authors": "By Behnke, H. (EDT), Bachmann, F. (EDT), Fladt, K. (EDT), and Suss, W. (EDT)",
        "Description": "Fundamentals of Mathematics represents a new kind of mathematical publication. While excellent technical treatises have been written about specialized fields, they provide little help for the nonspecialist; and other books, some of them semipopular in nature, give an overview of mathematics while omitting some necessary details. Fundamentals of Mathematics strikes a unique balance, presenting an irreproachable treatment of specialized fields and at the same time providing a very clear view of their interrelations, a feature of great value to students, instructors, and those who use mathematics in applied and scientific endeavors. Moreover, as noted in a review of the German edition in Mathematical Reviews, the work is \"designed to acquaint [the student] with modern viewpoints and developments. The articles are well illustrated and supplied with references to the literature, both current and 'classical.'\"The outstanding pedagogical quality of this work was made possible only by the unique method by which it was written. There are, in general, two authors for each chapter: one a university researcher, the other a teacher of long experience in the German educational system. (In a few cases, more than two authors have collaborated.) And the whole book has been coordinated in repeated conferences, involving altogether about 150 authors and coordinators.Volume I opens with a section on mathematical foundations. It covers such topics as axiomatization, the concept of an algorithm, proofs, the theory of sets, the theory of relations, Boolean algebra, and antinomies. The closing section, on the real number system and algebra, takes up natural numbers, groups, linear algebra, polynomials, rings and ideals, the theory of numbers, algebraic extensions of a fields, complex numbers and quaternions, lattices, the theory of structure, and Zorn's lemma.Volume II begins with eight chapters on the foundations of geometry, followed by eight others on its analytic treatment. The latter include discussions of affine and Euclidean geometry, algebraic geometry, the Erlanger Program and higher geometry, group theory approaches, differential geometry, convex figures, and aspects of topology.Volume III, on analysis, covers convergence, functions, integral and measure, fundamental concepts of probability theory, alternating differential forms, complex numbers and variables, points at infinity, ordinary and partial differential equations, difference equations and definite integrals, functional analysis, real functions, and analytic number theory. An important concluding chapter examines \"The Changing Structure of Modern Mathematics.\"",
        "Category": " Mathematics , General",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "43.95",
        "Publish Date": {
            "Month": "October",
            "Year": "1974"
        }
    },
    {
        "Title": "Mosby's Pocket Dictionary of Medicine, Nursing, & Allied Health",
        "Authors": "By Mosby",
        "Description": "The revised and updated New Edition distills all of the essential information from Mosby's Medical, Nursing, & Allied Health Dictionary, 6th Edition. It's still the only the only pocket-sized dictionary with a strong emphasis on nursing terminology. Comprehensive, compact, and affordable, it includes 3,000 new definitions (with 10,000 revised definitions), word roots and pronunciations for many entries, screened thumb tabs, and much more!Spanish version of 1st edition also available, ISBN: 84-8174-301-1",
        "Category": " Medical , Reference",
        "Publisher": "Mosby",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Cheese: 40 Sumptuous Cheese Recipes for All Occasions",
        "Authors": "By Parragon (COR)",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Dairy",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Death By Chocolate Cookies",
        "Authors": "By Desaulniers, Marcel",
        "Description": "Marcel Desaulniers, the prize-winning, bestselling author of such classics as Death by Chocolate, The Burger Meisters, and Desserts To Die For, continues down the decadent road he has paved with sweets, turning his attention to one of America's favorite temptations: cookies.  With his customary wit and clarity of style, Desaulniers has taken cookies to new heights in this stunning collection of seventy-five easy-to-follow recipes, each of which is captured in full-color splendor. Pared-down preparations, concise instructions, and satisfying results make the chocolate indulgences offered in this book the perfect antidote for anyone who has ever considered baking \"work.\"  No one will be able to withstand the temptation of these chocolate cookie combinations, from the simple and delightful Chocolate Peanut Butter Bengal Cookies or Chocolate Raspberry \"Cookiecupcakes,\" to the intricate and impressive Golden Spider Webs with Wicked Ganache and Raspberry Rapture and Chocolate Balloon Cups with Oven-Roasted Pears. Desaulniers also lets us in on some old family recipes; Hessie Rae's Chocolate Pecan Tart Cookies and Mrs. D's Chocolate Chip Cookies make you wonder what other undivulged secrets he's been saving.  As Desaulniers writes in his introduction, \"Rather than showcasing towering confections like those in Death by Chocolate and Desserts To Die For, this is a collection of chocolate cookies, bars, brownies, nougat, brittle, praline, ice-cream sandwiches, candies, and biscuits that you can hold in your hand and pop in your mouth. O.K., so I went overboard and pulled out the plate in the chapter 'More Than a Mouthful.' But as Mae West said, 'Too much of a good thing is wonderful.'\"",
        "Category": " Cooking , Courses & Dishes , Cookies",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Camera Trickery",
        "Authors": "By Croy, O.R.",
        "Description": "",
        "Category": "",
        "Publisher": "Focal Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Fit Over 40 For Dummies",
        "Authors": "By Yorkey, Mike and McCormack, Betsy Nagelson",
        "Description": "Tired of feeling tired all the time? Do you find yourself thinking wistfully of the days when your belt-size was less than your age...your dress size less than your kid’s last birthday? Remember when the only spare tire you had to worry about was the one in your trunk? Do you find yourself gasping for breath at the top of the basement stairs? If any of this sounds familiar, then you’re ready for an over 40 fitness plan. And Fit Over 40 For Dummies is the place to start.Your complete guide to being fit and fabulous over 40, it shows you step-by-step how to set up a personalized fitness routine and stick to it, no matter what your age, weight, or athletic ability. Packed with practical know-how and inspiring anecdotes it shows you how to:Lose weight and inches from your waistlineBoost your energy levelsLower or prevent high blood pressureReduce your risk of cardiovascular disease and diabetesImprove your muscle toneGive your skin a healthy glowHave a more vibrant sex lifeRebound from life-changing events more quicklyGet fitter than couch potatoes half your ageLive a longer, healthier lifeCombing her own experiences with the latest scientific research, retired women’s tennis pro, Betsy Nagelsen McCormack explores what it takes to be fit over forty. And, step-by-step, she shows you how to:Assess your fitness levelEat right for maximum fitnessChoose and buying exercise equipmentSelect the right gymDevelop a balanced program of aerobics, weight training and stretchingIntegrate exercise into your daily routinePrevent and working around common injuries and ailmentsExplore sports, outdoor activities, and moreStop thinking about how great it would be to feel twenty-five again and do something about it. Fit Over 40 For Dummies helps you get on the road to health and well-being.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Kingdom of Cages",
        "Authors": "By Zettel, Sarah",
        "Description": "With its colonies scattered and humankind confronting extinction, the remnants of humanity hope to find a new home on the planet Pandora, a near match to Earth, but for Chena and Teal Trust their move becomes a nightmare when their mother is murdered and they must battle the ruthless scientific bureaucracy that killed her and that wants their own genetic material. Reprint.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Aspect",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Human Rights Reader: Major Political Essays, Speeches and Documents from the Bible to the Present",
        "Authors": "By Ishay, Micheline R. (EDT)",
        "Description": "Classical and modern readings trace the evolution of the rights debate beginning with passages from both the Old and New Testament, the Koran, and early Buddhist writings. Ishay (U. of Denver) includes selections that address contemporary issues such as women's rights, the rights of gays and lesbians, and the question of humanitarian intervention. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Political Science , International Relations , Arms Control",
        "Publisher": "Routledge",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "A Father's Memories to His Child",
        "Authors": "By Kinkade, Thomas (ILT) and Fortner, Tama",
        "Description": "This beautiful journal is the perfect guide to encourage recording memories from father to children. Featuring the art of Thomas Kinkade, the \"Painter of LightTM,\" this is a beautiful record book that will be a treasure for generations as fathers preserve on paper the special memories of their life.",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Cocolat: Extraordinary Chocolate Desserts",
        "Authors": "By Brabant, Patricia (PHT) and Medrich, Alice",
        "Description": "For the millions of chocolate lovers everywhere, here is a stunning dessert cookbook complete with lavish, mouth-watering, full-color photographs, from the respected gourmet known to her peers as \"Madam Cocolat\".",
        "Category": " Cooking , Specific Ingredients , Chocolate",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Steak Book",
        "Authors": "By Susanna Tee",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Ortho's All About Decorative Painting",
        "Authors": "By Ortho (EDT)",
        "Description": "Explains how to use decorative painting and faux finishes to customize or refurbish walls and furniture, covering topics including primers, brushes, antiquing, crackling, gold leafing, wood graining, marbling, and stenciling.",
        "Category": " Crafts & Hobbies , Painting",
        "Publisher": "Ortho",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Complete Decorative Painter",
        "Authors": "By Spargo, Gillie, Japp, David",
        "Description": "",
        "Category": "",
        "Publisher": "Colour Library Books",
        "Price Starting With ($)": "6.74",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Baking: A Commonsense Guide",
        "Authors": "By Murdoch Books Test Kitchen",
        "Description": "",
        "Category": "",
        "Publisher": "Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Fruit Desserts (Williams-Sonoma Kitchen Library)",
        "Authors": "By Williams, Chuck (EDT), Rosenberg, Allan (PHT), and Brody, Lora",
        "Description": "Offers forty-five recipes for fruit desserts and includes recipes for sauces and edible containers to enhance the desserts",
        "Category": " Cooking , Specific Ingredients , Fruit",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Your Family Time With God: A Weekly Plan for Family Devotions",
        "Authors": "By Maxwell, John C. and Lewis, Brad",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Chariot Victor Pub",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Prevention's Decadent Desserts for Diabetics: 125 Luscious Recipes for the Whole Family",
        "Authors": "By Ragone, Regina (EDT)",
        "Description": "Here's the latest news in diabetes, short and sweet: Desserts are no longer forbidden! Gone are the days when doctors advised their diabetic patients to \"avoid sugar.\" Today research shows that sweets can be part of a balanced diabetic eating plan. In fact, sweet treats may actually help keep you healthier! Prevention's Decadent Desserts for Diabetics serves up 125 scrumptious recipes including cakes, pies, brownies, cookies, puddings and more. While these \"sinful\" dishes are created for diabetics, they are so tempting and delicious that non-diabetics will enjoy them just as much! This extraordinary cookbook is the only cookbook you'll ever need to create delectable desserts that help you to control your diabetes without feeling deprived. No more forbidden foods! Here are some of the valuable features that put this book in a class by itself. The most recent nutritional breakthroughs in diabetes research A safe and simple 8-step program that helps you to plan a balanced meal and eat those sweet treats you thought were forever banned Clever cooking tips to support a healthier lifestyle 125 recipes for sumptuous, rich desserts that are sure to tempt you and your family Beautiful photographs and easy-to-understand directions Dishes that are made with wholesome ingredients. No sugar substitutes or artificial ingredients are needed Complete nutritional analysis with every recipe to make it easy to track important nutrients.",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "The Runner's Yoga Book: A Balanced Approach to Fitness",
        "Authors": "By Couch, Jean",
        "Description": "The Runner’s Yoga Book is an ideal companion for the weekend or professional athlete, for the reader who wants to stretch and relax, and for the developing yoga student who wants to establish a home practice. Drawing on over thirty years of teaching and personal practice, author Jean Couch offers precise instruction in all types of poses, guidelines for home practice, yoga routines for other sports (including bicycling, skiing, swimming, tennis, and walking), a resource guide for further study, and a yoga-poses-by-alphabetical-listing index. With over 400 photographs and illustrations showing students at various levels of expertise, The Runner’s Yoga Book is a complete guide for yoga students of all ages and most levels of fitness.",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "Rodmell Press",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "After-School Crafts (Anytime Craft Series)",
        "Authors": "By Dondiego, Barbara L. and Cawley, Jacqueline (ILT)",
        "Description": "Presents craft ideas and recipes, including how to make juice can animal banks, papier mache masks, tissue paper flowers, egg crafts, posterboard projects, and chocolate raisin bars",
        "Category": " Crafts & Hobbies , Crafts for Children",
        "Publisher": "TAB Books",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Photo Tour New York",
        "Authors": "By Krist, Bob",
        "Description": "The Big Apple comes alive in this colorful and exciting souvernir coffee-table book.",
        "Category": " Photography , Subjects & Themes , Regional",
        "Publisher": "Photo Tour Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Warman's Flea Market Price Guide (Warman's Flea Market Price Guide, 2nd ed)",
        "Authors": "By Johnson, Don and Schroy, Ellen T.",
        "Description": "Following tips on flea market shopping and collecting trends, veteran writers on antiques and collectibles present  A  (ABC children's items)-through- Z  (Zeppelins) entries. The book includes a knowledge quiz, and color and b&w illustrations on finds from a Kodak Brownie Hawkeye camera (worth $5) to a 1897 \"A Christmas Dinner\" game valued at $1,000. No date is given for the first edition. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Warman Pub Co",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Pastoral Spirituality",
        "Authors": "By Johnson, Ben Campbell",
        "Description": "",
        "Category": " Religion , Christian Church , Administration",
        "Publisher": "Westminster John Knox Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Stellar Short Novels",
        "Authors": "By Gordon R. Dickson, Richard S. Weinstein, Andrew J. Offutt",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "September",
            "Year": "1976"
        }
    },
    {
        "Title": "The Tournament Of Roses",
        "Authors": "By Hendrickson, Joe",
        "Description": "",
        "Category": "",
        "Publisher": "Brooke House Publishers",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "A Shared Destiny: Community Effects of Uninsurance",
        "Authors": "By Committee on the Consequences of Uninsur and Committee on Consequences of Uninsurance",
        "Description": "The use of emergency hospital rooms by uninsured people as one of their only outlets to health care impacts on the resources of the hospital available to the whole community. This is only one of the spillover effects that large uninsured populations can have a community at large. This report investigates the effects that large uninsurance rates have on access to care, discuss the economic and social implications, and explore what uninsurance means for community health as a whole. Annotation (c) Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Medical , Practice Management & Reimbursement",
        "Publisher": "National Academies Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Abyss",
        "Authors": "By Wilhelm, Kate",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "John Hedgecoe's Camcorder Basics: A Quick and Easy Guide to Making Videos",
        "Authors": "By Hedgecoe, John",
        "Description": "Offers advice on choosing a camcorder and peripheral equipment, suggests ways to improve your videos, and includes ideas for videotaping children, weddings, vacations, nature, and stories",
        "Category": " Photography , Techniques , Cinematography & Videography",
        "Publisher": "Amphoto Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The World's Greatest Short Stories (Dover Thrift Editions)",
        "Authors": "By Daley, James (EDT)",
        "Description": "Wonderfully wide-ranging and enjoyable, this outstanding collection features short stories by great 19- and 20th-century writers from America, the United Kingdom, Ireland, and Western Europe. Included are Hemingway's \"A Clean, Well-Lighted Place,\" in which two waiters and a lonely customer in a Spanish cafe confront the concept of nothingness; \"A & P,\" John Updike's most anthologized story and one of his most popular; \"Borges and I,\" typical Jorge Luis Borges — imaginative, philosophical, and mysterious; as well as short masterpieces by Leo Tolstoy, Anton Chekhov, Herman Melville, Thomas Mann, Guy de Maupassant, Charlotte Perkins Gilman, D. H. Lawrence, and ten other great writers.Prime examples of the classic short story, these enduring literary treasures will be invaluable to students and teachers as well as to anyone who appreciates the finely turned tale.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Humor in Uniform",
        "Authors": "By Reader's Digest Association (EDT)",
        "Description": "This side-splitting collection of humor delivers hundreds of the best jokes, anecdotes, cartoons, quotes, and stories from men and women in the armed forces or their families proving that life is often funnier than fiction.If laughter is the best medicine, then look no further to cure whatever ails you. The column “Offbase,” formally known as “Humor in Uniform,” has appeared in the Reader's Digest magazine for over half a century, and has published more than 3,500 jokes, quotes, and funny stories from the more than a million readers who have submitted them. This volume—from the world’s #1 source of humor—contains laugh-out-loud gems from one of Reader’s Digest’s most popular columns.   This side-splitting collection of humor delivers hundreds of the best jokes, anecdotes, cartoons, quotes, and stories from men and women in the armed forces or their families proving that life is often funnier than fiction. Such as: ·         From a Family Member: My son regaled me with stories about how they do things in the modern Air Force. Being an old Air Force man myself, I scoffed at their complicated methods. “That’s not the way we did it when I was in the service,” I said. “Yeah,” he shot back. “But when you were in, there were only two pilots, Wilbur and Orville”        — Ted Shirley ·         From an Army Soldier: Our Army Unit was overseas conducting maneuvers with the Marines. On shift one night, a Marine asked my sergeant where he was from. “I’m originally from Central America,” said the sergeant. “Oh, yeah?” asked the Marine. “Kansas?” — David Denbek ·         From Iraq: At the end of a tough day in Iraq, my daughter, the airman, collapsed onto the first seat in the transport truck, forcing everyone else to climb over her. “Private!” hollered the sergeant, “Skinny girls get in the back so when we men get on with our weapons and equipment, we don’t have to climb over you. Have I made myself clear?” Suddenly my daughter perked up, “Do you really think I’m skinny?” —    Margaret Culbertson ·         About the Military: A soldier stationed at Fort Bliss, Texas, actually got a letter addressed to “Fort Ignorance.” “How did you know where to deliver it?” she asked the mailman. “We were stumped at first,” he admitted. “But then I remembered, ignorance is bliss.” — William De Graf   For yourself, a friend, or family member—what could be better than the gift of laughter?",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Killer Cuts: A Dead-End Job Mystery",
        "Authors": "By Viets, Elaine",
        "Description": "Helen Hawthorne's latest gig is working in Miguel Angel's Fort Lauderdale hair salon, where a trim can cost as much as a car payment and a blowout can wipe you out. But when a famous husband of one of the salon's clients is murdered at their wedding reception, things get a little hairy...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "A History of Soviet Russia",
        "Authors": "By Von Rauch, Georg",
        "Description": "",
        "Category": "",
        "Publisher": "Praeger",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "Grow Your Church from the Outside In: Understanding the Unchurched and How to Reach Them",
        "Authors": "By Barna, George",
        "Description": "According to the author, America has more unchurched people than the entire populations of all but 11 of the world's 194 nations! Based on research among several thousand unchurched people, the book discusses their values, attitudes, beliefs, religious practices, demographics, life goals, and spiritual expectations. Using additional research conducted among churches that have had great success in attracting and retaining unchurched people, the author also outlines perspectives and effective strategies for churches that wish to reach those who avoid churches. Understanding what makes the unchurched tick will give you a better chance of relating to them in meaningful ways.",
        "Category": " Religion , Christian Church , Administration",
        "Publisher": "Regal",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The 50 Best Cheesecakes in the World: The Winning Recipes from the Nationwide \"Love that Cheesecake\" Contest",
        "Authors": "By Zisman, Larry and Zisman, Honey",
        "Description": "If you're passionate about cheesecake, you'll love the gourmet and classic recipes assembled in this tempting book. Featured are the winning recipes from the Nationwide \"Love That Cheesecake\" Contest-50 of the richest, sweetest, creamiest, most delectable cheesecakes imaginable.Organized by pan size, the recipes include: key-lime cheesecake, marzipan-raspberry cheesecake, chocolate-malt cheesecake, hazelnut-heaven cheesecake, white-Christmas cheesecake, pumpkin party cheesecake, Black Forest cheesecake, tri-colored Italian cheesecake, southern sweet-potato cheesecake. Also included are irresistible cheesecake recipes from the Plaza Hotel, the Williamsburg Inn, the Hotel Hershey, and other renowned kitchens across the country.Complete with helpful recipe hints for preparing the perfect cheesecake, along with a generous dollop of cheesecake trivia, this sublime little cookbook is sure to delight everyone who loves sinking a fork into a fresh piece of New York cheesecake. These easy, no bake desserts are simple to make and include how to guides to enjoy your favorite flavors from chocolate to strawberry to peanut butter, raspberry and more.",
        "Category": " Cooking , Courses & Dishes , Cakes",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Masters of World Architecture: Le Corbusier, Frank Lloyd Wright, Pier Luigi Nervi, Antonio Gaudi, Ludwig Mies Van Der Rohe, Alvar Allto",
        "Authors": "By Various Authors",
        "Description": "",
        "Category": "",
        "Publisher": "George Braziller",
        "Price Starting With ($)": "41.75",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "The Mystery at the Dog Show (35) (The Boxcar Children Mysteries)",
        "Authors": "By Warner, Gertrude Chandler and Tang, Charles (ILT)",
        "Description": "The Aldens attend Greenfield's first dog show, where some trickster mysteriously shaves a prize-winning poodle and releases a cat in the middle of the show, and the Boxcar Children search for the culprit. Simultaneous.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Albert Whitman & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "101 Things to Do Before You're Old and Boring",
        "Authors": "By Horne, Richard and Szirtes, Helen",
        "Description": "There is nothing worse than being boring, except for being old and boring! This exciting new book will help teens discover 101 ways to live life to its fullest before it's too late.  The interactive format contains fill-in pages, checklists, and adhesive stars to place on each page when the suggested task has been completed. Both entertaining and educational, this book suggests trying some of the following:* #26 Help Save the Planet                 * #36 Start a Blog* #7 Prepare Yourself for Fame          * #30 Make a Movie* #39 Be a Genius                               * #14 See a Ghost* #69 Make a Scene in Public             * #74 Become a SpySo, what are you waiting for?  Get going and get this perfect gift for a teen in your life!",
        "Category": " Juvenile Nonfiction , Activity Books",
        "Publisher": "Walker Childrens",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Federal Benefits for Veterans, Dependents, & Survivors, 2009",
        "Authors": "By Department of Veterans Affairs",
        "Description": "",
        "Category": " Business & Economics , Reference",
        "Publisher": "Office of Public Affairs",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "The Elements of Job Hunting",
        "Authors": "By Noble, John H.",
        "Description": "Provides practical advice on attracting the attention of employers, resumes, interviews and other forms of contact, accepting a position, career planning, and preparing for a job search",
        "Category": "",
        "Publisher": "Adams Media Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Whole Education",
        "Authors": "By Nasr, Raja Tewfik",
        "Description": "This book suggests ways to bring about a more relevant and meaningful education for individual students and a safer, happier, and more dynamic life in society.",
        "Category": " Education , Secondary",
        "Publisher": "UPA",
        "Price Starting With ($)": "8.08",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "The Thunderbird Song a Story of Mysticism",
        "Authors": "By Montgomery, Carl",
        "Description": "",
        "Category": "",
        "Publisher": "EXPOSITION PRESS",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "North Carolina Hiking Trails",
        "Authors": "By De Hart, Llen",
        "Description": "",
        "Category": "",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Playbill Broadway Yearbook: June 1 2005 - May 31 2006",
        "Authors": "By Viagas, Robert (EDT), Asch, Amy (EDT), Reuben, Aubrey (PHT), and Strothmann, Ben (PHT)",
        "Description": "(Playbill Broadway Yearbook). This second edition of  The Playbill Broadway Yearbook  has a chapter for each of the 71 Broadway shows that were running between June 2005 and May 2006, including \"alumni\" pages for shows held over from previous seasons. In addition, every show has a correspondent who records the special moments and relationships that develop during rehearsals and the run. Actor hangouts, most memorable ad-lib, celebrity visitors, and the record number of cell phone rings during a performance are among the information recorded. An insider Events section reports on such annual milestones as The Tony Awards, Gypsy of the Year, Broadway Bares, and the annual Broadway softball championship in Central Park Once again, in addition to all the headshots of all the actors who appeared in  Playbill , the book includes photos of producers, writers, designers, stage managers, stagehands and musicians. The goal is to include as many of the faces who worked on Broadway as possible. As a special treat, the Yearbook includes photos of opening night curtain calls from many shows. This is a book no Broadway buff will want to be without.",
        "Category": " Performing Arts , Theater , General",
        "Publisher": "Playbill",
        "Price Starting With ($)": "8.88",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Become a TOP Consultant: How the Experts Do It",
        "Authors": "By Tepper, Ron",
        "Description": "Ten of today's top consultants explain why and how they left the 9-to-5 grind behind, built new careers, and became the best in their field! Become a Top Consultant How the Experts Do it What does it take to build a successful consulting practice? Ron Tepper asked ten consultants in a diverse range of fields and found the formula to be a winning blend of skills, specialized knowledge, strategy, and technique. Now, Tepper shows you how to build a consulting practice of your own simply by following the examples of these ten experts in engineering, data processing, government, accounting, management, sales, real estate, and law. Become A Top Consultant takes you step by step through writing and submitting superior proposals, marketing your consulting services, setting fees, billing, getting help, even moonlighting. You'll learn the basic concepts, practices, specialized skills and consulting requirements for each different field. Best of all, you'll identify easily with the consultants--you'll meet an accountant and a sales trainer, a civil engineer, a football player-turned-headhunter/personnel accountant, an investment advisor who never finished college, and a former real estate salesman who's now a phenomenally successful attorney. They're all top consultants, from all walks of life--the best in the business. And they all started out where you are today. Become A Top Consultant--it's like having a live panel of consulting experts at your service, eager to help you launch your consulting career.",
        "Category": " Business & Economics , Consulting",
        "Publisher": "John Wiley &Sons",
        "Price Starting With ($)": "6.51",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to the Internet",
        "Authors": "By Kent, Peter",
        "Description": "Offers an overview of the Internet, explains how to get connected, and discusses the World Wide Web, newsgroups, FTP, Gopher, chat groups, safety on-line, e-mail, and multimedia on the Internet",
        "Category": " Computers , Internet , General",
        "Publisher": "Que Pub",
        "Price Starting With ($)": "5.65",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Assault on Reason (Thorndike Press Large Print Basic Series)",
        "Authors": "By Gore, Albert",
        "Description": "An analysis of the consequences of the Bush administration's fear, secrecy, and faith-based initiatives explains how the administration has dangerously compromised America's capacity for addressing long-term challenges.",
        "Category": " Political Science , American Government , National",
        "Publisher": "Thorndike Pr",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The New World of Welfare",
        "Authors": "By Haskins, Ron (EDT) and Blank, Rebecca M. (EDT)",
        "Description": "Congress must reauthorize the sweeping 1996 welfare reform legislation by October 1, 2002. A number of issues that were prominent in the 1995-96 battle over welfare reform are likely to resurface in the debate over reauthorization. Among those issues are the five-year time limit, provisions to reduce out-of-wedlock births, the adequacy of child care funding, problems with Medicaid and food stamp receipt by working families, and work requirements. Funding levels are also certain to be controversial. Fiscal conservatives will try to lower grant spending levels, while states will seek to maintain them and gain additional discretion in the use of funds. Finally, a movement to encourage states to promote marriage among low-income families is already taking shape.The need for reauthorization presents an opportunity to assess what welfare reform has accomplished and what remains to be done.  The New World of Welfare is an attempt to frame the policy debate for reauthorization, and to inform the policy discussion among the states and at the federal level, especially by drawing lessons from research on the effects of welfare reform. In the book, a diverse set of welfare experts&#151;liberal and conservative, academic and nonacademic&#151;engage in rigorous debate on topics ranging from work experience programs, to job availability, to child well-being, to family formation. In order to provide a comprehensive overview of the current state of research on welfare reform, the contributors cover subjects including work and wages, effects of reform on family income and poverty, the politics of conservative welfare reform, sanctions and time limits, financial work incentives for low-wage earners, the use of medicaid and food stamps, welfare-to-work, child support, child care, and welfare reform and immigration.Preparation of the volume was supported by funds from the Annie E. Casey Foundation and the Charles Stewart Mott Foundation.",
        "Category": " Political Science , Public Policy , Social Services & Welfare",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.62",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "A Purse-driven Christmas: So, What Did You Get Me?",
        "Authors": "By Renfroe, Anita",
        "Description": "",
        "Category": " Humor , Topic , Religion",
        "Publisher": "Navpress Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Natural Prostate Healers",
        "Authors": "By Fillon, Mike",
        "Description": "A men's guide to achieving prostate health offers an all-natural regimen, without surgery or drugs, that helps identify the early stages of prostate problems, discussing exercise, diet supplements, and food suggestions, including recipes, and showing how to reduce stress. Original. 15,000 first printing.",
        "Category": " Health & Fitness , Men's Health",
        "Publisher": "Prentice Hall Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Wimpy Kid Movie Diary (How Greg Heffley Went Hollywood)",
        "Authors": "By Jeff Kinney",
        "Description": "",
        "Category": "",
        "Publisher": "Amulet Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "For Goodness Taste",
        "Authors": "By Junior League of Rochester",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Favorite Recipes Pr",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Catholic Spirituality from A to Z: An Inspirational Dictionary",
        "Authors": "By Muto, Susan",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Charis Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Harrods Book of Chocolates and Other Edible Gifts",
        "Authors": "By Edden, Gill",
        "Description": "Gives advice on making candy, shares recipes for chocolates, fondants, fudge, toffee, petit fours, and candied fruits, and tells how to package them as gifts",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "Arbor House Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "The Yale Dictionary of Art and Artists",
        "Authors": "By Langmuir, Erika and Lynton, Norbert",
        "Description": "",
        "Category": " Art , Reference",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Cooking Ingredients",
        "Authors": "By Christine Ingram",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The cook's book of essential information: A kitchen handbook",
        "Authors": "By Hill, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "Sumner House Press",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Story of Maps",
        "Authors": "By Brown, Lloyd Arnold",
        "Description": "\"An important and scholarly work; bringing together much information available heretofore only in scattered sources … easily readable.\" — Gerald I. Alexander, F.R.G.S. Cartographer, Map Division, New York Public LibraryEarly map making was characterized by secrecy. Maps were precious documents, drawn by astrologers and travelers, worn out through use or purposely destroyed. Just as men first mapped the earth indirectly, via the sun and stars, so must the history of maps be approached circuitously, through chronicles, astronomy, Strabo and Ptolemy, seamanship, commerce, politics. From the first determination of latitude 2000 years ago through the dramatic unraveling of longitude 1700 years later, the story of maps plots the course of civilization. This book charts the course with a breadth and depth still unsurpassed in a scholarly survey.Lloyd A. Brown's cartographic erudition came through his years as librarian of the Peabody Institute, Baltimore, and as curator of maps at the Clements Library, University of Michigan, where he devised a system for classifying and cataloging some 25,000 old maps. He researched The Story of Maps over four years, seeking out as many pertinent sources as possible for a definitive history and summation of map lore.The Story of Maps follows the peaks and declines of western societies, with marine and topographic knowledge flourishing secretly with the sea powers of Minoan Crete and the Phoenicians, surfacing again with Hipparchus, Eratosthenes, Strabo, and Ptolemy, then waning until the Crusades brought travel and trade back to prominence. The Genoese, Venetians, Portuguese, Dutch, Spanish, and English all had their years of hegemony, great navigators and charts, aided by the mapping ideas of Mercator and Edward Wright. The most brilliant minds of the era, including Galileo and Newton, attempted to solve the problem of longitude at sea; the solution came from a Yorkshire clockmaker named John Harrison, who won a 20,000 pound prize for his pains.The Story of Maps celebrates cartography from Strabo to World War II. Eighty-six remarkable illustrations, including early maps, prints and portraits, many unique and seen only in museums, supplement the texts. The exhaustive bibliography matches the text in span and usefulness for those who will undoubtedly be stimulated by this book to read more regarding maps.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "February",
            "Year": "1980"
        }
    },
    {
        "Title": "The Mysterious Bender Bones.",
        "Authors": "By Meyers, Susan",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Cilantro",
        "Authors": "By Birosik, Patti Jean",
        "Description": "Gathers recipes for appetizers, salads, soups, side dishes, vegetarian dishes, fish, seafood, poultry, meat, and desserts that feature cilantro, also known as coriander or Chinese parsley",
        "Category": " Cooking , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Rules of the Game: Simple Truths Learned from Little League",
        "Authors": "By Hohenstein, Kurt",
        "Description": "",
        "Category": " Sports & Recreation , Baseball , Essays & Writings",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Big Book of Healthy Family Dinners (Better Homes & Gardens)",
        "Authors": "By Fuller, Kristi (EDT) and Meredith Books (COR)",
        "Description": "Now families can eat food that’s good for them without sacrificing good taste! This easy-to-use, timesaving cookbook features hundreds of delicious, healthy recipes for busy home cooks.Better Homes and Gardens kitchen-tested recipes.Color photos, nutrition facts, and preparation and cooking times for every recipe.Tips on eating a healthful diet.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "A Guide Book of United States Coins, 39th Edition, 1986",
        "Authors": "By Two-Can (COR), Barraclough, Sue, Canals, Sonia (ILT), and Canals, Sonia",
        "Description": "",
        "Category": " Juvenile Nonfiction , Concepts , General",
        "Publisher": "Whitman Coin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Sandwiches, Panini, and Wraps: Recipes for the Original Anytime and Anywhere Meal",
        "Authors": "By Ridgaway, Dwayne",
        "Description": "Whether the occasion is a picnic, lunch, brunch, or late night entertaining, sandwiches, panini, and warps provide a unique alternative to the usual fare. Sandwiches, Panini, and Wraps covers everything you need to create these taste-tempting meals. It begins with an overview of the sandwich from a historical perspective and then it deconstructs these multilayered concoctions. ThereÆs an overview of breads, basic ingredients, and equipment used to create these recipes, providing readers with a knowledge base that they can use to create their own dishes.This book features 50 recipes for everything from grilled sandwiches to cold sandwiches, wraps, pitas (including vegetarian and salad sandwiches), soups, salads, side dishes, condiments and spreads, and dessert suggestions to top off the savory meals with something sweet. The author also includes plenty of entertaining and serving suggestions.Sandwiches, Panini, and Wraps is lavishly photographed and includes easy instructions and creative food ideas for the imaginative sandwich maker.",
        "Category": " Cooking , Courses & Dishes , Sandwiches",
        "Publisher": "Quarry Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "An Illustrated Encyclopedia of British Pottery and Porcelain",
        "Authors": "By Geoffrey A. Godden",
        "Description": "",
        "Category": "",
        "Publisher": "Bonanza Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Conversing With God In Scripture: A Contemporary Approach To Lectio Divina",
        "Authors": "By Binz, Stephen J.",
        "Description": "With a clarity that all will welcome, Stephen Binz shows how we can read and reflect on Scripture in ways that enable us to hear God speaking to us in our hearts. Examples of the ancient practice of lectio divina using seven biblical passages are included as well as questions for reflection and discussion, making this book a useful tool for those in faith-sharing groups. Suitable both for beginners and those seasoned in prayer.“I would like in particular to recall and recommend the ancient tradition of lectio divina. . . . If it is effectively promoted, this practice will bring to the Church—I am convinced of it—a new spiritual springtime.” —Pope Benedict XVI, Address to Congress on Sacred Scripture in the Life of the Church, September 16, 2005 “An inspiring explanation of lectio divina, based on ancient Church traditions. Those who follow Binz’s guidelines will experience Scripture coming alive in prayer.”  —George Martin, founder, God’s Word Today magazine and author, Bringing the Gospel of Mark to Life",
        "Category": " Religion , Christian Living , Spiritual Growth",
        "Publisher": "Word Among Us Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "I Have a Dream The Story of Martin Luther King In Text and Pictures",
        "Authors": "By Osborne, Charles, Ed",
        "Description": "",
        "Category": "",
        "Publisher": "-",
        "Price Starting With ($)": "19.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Physics of Superheroes",
        "Authors": "By Kakalios, James",
        "Description": "James Kakalios explores the scientific plausibility of the powers and feats of the most famous superheroes — and discovers that in many cases the comic writers got their science surprisingly right. Along the way he provides an engaging and witty commentary while introducing the lay reader to both classic and cutting-edge concepts in physics, including: What Superman’s strength can tell us about the Newtonian physics of force, mass, and acceleration  How Iceman’s and Storm’s powers illustrate the principles of thermal dynamics  The physics behind the death of Spider-Man’s girlfriend Gwen Stacy  Why physics professors gone bad are the most dangerous evil geniuses!",
        "Category": " Literary Criticism , Comics & Graphic Novels",
        "Publisher": "Avery",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Every Day Chinese Cook Book",
        "Authors": "By Doeser, Linda (EDT)",
        "Description": "Hundreds of Chinese and Asian recipes in one accessible and brightly photographed collection.",
        "Category": " Cooking , Regional & Ethnic , Chinese",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "August",
            "Year": "2018"
        }
    },
    {
        "Title": "Cooking A to Z: New and Revised Edition (Cole's Kitchen Arts Series)",
        "Authors": "By Horn, Jane (EDT), Fletcher, Janet, and Gooch, Annette",
        "Description": "Cooking A to Z - first choice of more than 250,000 home cooks, professional chefs, food enthusiasts, and cookbook collectors; winner of James Beard and International Association of Cooking Professionals awards - now has a vibrant new look and feel, updated information, new recipes, and nearly 550 mouthwatering photographs. This newly revised classic covers basic cooking techniques and terms from al dente to zest, then demonstrates their use in more than 800 exceptional recipes ranging from adobo to zabaglione.",
        "Category": " Cooking , Methods , General",
        "Publisher": "Cole Pub Co",
        "Price Starting With ($)": "8.01",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Grasshopper Pie and Other Poems (Penguin Young Readers, Level 3)",
        "Authors": "By Steinberg, David and Sinnott, Adrian (ILT)",
        "Description": "Meet upside-down Billy Ray Brown, the Tickle Monster, and a boy who makes grasshopper pie(with hilarious results!) in this wonderful celebration of what it means to be a kid.",
        "Category": " Juvenile Nonfiction , Poetry , Humorous",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Slow Cooker, Casseroles & More",
        "Authors": "By Favorite Brand Name",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "6.81",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Alexander Graham Bell (The Canadians)",
        "Authors": "By Petrie, A. Roy",
        "Description": "",
        "Category": "",
        "Publisher": "Fitzhenry & Whiteside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Real Beer And Good Eats: The Rebirth of America's Beer and Food Traditions (Knopf Cooks American)",
        "Authors": "By Kelly, Denis and Aidells, Bruce",
        "Description": "A cookbook and food-and-drink odyssey chronicles the history of beer and ale from the age of the Founding Fathers and offers early American recipes that include pickled oysters and quail, soft pretzels, and onion soup.",
        "Category": " Cooking , Beverages , Alcoholic , Beer",
        "Publisher": "knopf",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Twentieth Century Glass",
        "Authors": "By Cousins, Mark",
        "Description": "Reveals glass work as a beautiful but unpublicized art form, chronicling the artists, influences, forms and movements",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Tattered Treasures: Stylish Decorating with Flea Market Finds",
        "Authors": "By Powell, Lauren",
        "Description": "Enjoy your treasured collections, favorite items, and must-have finds with the help of enchanting full-color photographs, creative tips, display ideas, and plenty of projects. Create crackle and distressed finishes to \"age\" furniture. Use an old chair as a display stand for a special object. Artfully arrange a collection of interesting bottles. Wrap a small gift in a lovely vintage handkerchief. Recycle broken pieces of treasured china into a china-shard mosaic table. Embellish a basket to make an eye-catching centerpiece, or update a lamp with a fabric cover. An empty portrait frame can become a unique corkboard, and an old fireplace screen gets a new life with a stenciled design. You'll love decorating your home with these inexpensive, easy, and fun schemes and suggestions!",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Sterling",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Complete Outdoor Builder: From Arbors to Walkways: 150 Diy Projects",
        "Authors": "By Baldrica, Nancy (EDT)",
        "Description": "Every homeowner wants to make the most of his \"outdoor home.\" Black & Decker The Complete Outdoor Builder begins with sections on Tools & Materials, Building Codes, Yard Surveying, Drawing Plans, and includes a lengthy section on the basic techniques of working with wood, concrete, brick, stone, and roofing materials. Then comes the heart of the book-detailed chapters on Pathways; Fences, Walls & Gates; Patios; Decks; Porches & Entries; Sheds & Outbuildings; and Accessories. With 150 projects, there is value here for every reader, from the beginning DIY'er to seasoned veterans of outdoor building projects. Featured projects include: a three-season porch, a timber play structure for children, a Victorian gazebo, retaining walls, brick barbecue, cobblestone walkway, decorative fountains, a raised garden bed, and a garden pond. As with all Black & Decker home improvement books, this handy manual contains the most precise, detailed and easy-to-follow step-by-step instructions in home improvement publishing.",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Songs from the Mother Goose With the Traditional Melody for Each",
        "Authors": "By Spowart, Robin (ILT) and Larrick, Nancy",
        "Description": "A collection of Mother Goose rhymes including music, illustrations, an introduction by the compiler, and a selection of historical notes.",
        "Category": " Music , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Simple Handmade Garden Furniture: 23 Step-By-Step Weekend Projects (Simple Handmade Furniture)",
        "Authors": "By Haxell, Kate and Haxell, Philip",
        "Description": "",
        "Category": " Crafts & Hobbies , Furniture & Cabinetry",
        "Publisher": "Laurel Glen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Water (The Wonder of God's World)",
        "Authors": "By Searle-Barnes, Bonita and Smithson, Colin (ILT)",
        "Description": "Includes text and activities that explore water and what it does, with quotes from the Bible that encourage the reader to think about the wonders of the natural world.",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , General",
        "Publisher": "Chariot Victor Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "The Most Dangerous Place: Pakistan's Lawless Frontier",
        "Authors": "By Gul, Imtiaz",
        "Description": "\"One word comes to mind: `indispensable.' To understand the mess we're getting into in Pakistan's lawless tribal areas, there's no better book out there.\"---Robert Baer, former CIA agent and author of See No Evil\"Imtiaz Gul takes the reader into the lion's den---into Pakistan's tribal areas, the meanest, toughest region of the planet. He has a journalist's sharp eye for the personalities and conspiracy theories that are woven through this area. This is the best guide yet to understanding the fascinating, frightening place where Al Qaeda lives today.\"---David Ignatius, author of Body of Lies\"Veteran Pakistani reporter Imtiaz Gul brings his deep knowledge and reporting to bear on one of the world's most opaque and underreported places, Pakistan's tribal areas, the headquarters of Al Qaeda and key elements of the Taliban. Gul delivers a balanced account of the evolving relations that the Pakistani military, government, and public have had with Pakistan's own militant groups. This book could not be more well timed as President Obama faces the most important foreign policy challenge of his presidency from the violent extremists who call this place their home.\"---Peter Bergen, author of Holy war, Inc. and The Osama bin Laden I Know\"Imtiaz Gul has provided an invaluable service, drawing together reporting and research on Pakistan's tribal areas and adding his own firsthand experience. A timely and important work.\"---Jason Burke, author of Al-Qaeda and On the Road to KandabarEight years ago we chased the Taliban from Kabul and forced Al Qaeda to find a new home. One by one the militants crossed the border into Pakistan and settled in its tribal areas, terrorizing or bribing their way to power. This place---Pakistan's lawless frontier---is now the epicenter of global terrorism. It is, in President Obama's words, \"the most dangerous place,\" a hornet's nest of violent extremists, many of whom have turned against their own state.Hugely authoritative and astonishing in its revelations, The Most Dangerous Place tells the gripping story of how Pakistan was set on fire, with suicide bombers, unknown before 2002, now striking at least once a week. It confirms what everyone knows though few will admit: there will be no peace in Afghanistan until the Pakistani Taliban is brought under control. Can it be done? Who are these people and what are their links to Al Qaeda and the ISI, Pakistan's all-powerful intelligence agency?For twenty-five years, Imtiaz Gul has been fearlessly reporting on these groups for local and international media. He knows the key players and has unparalleled access to military and intelligence sources. Based on exclusive interviews with high-ranking intelligence, government, and military officers and extensive firsthand reporting in villages where no American journalist would be safe, The Most Dangerous Place is a gripping and explosive expose of a region that we all fear and need urgently to understand",
        "Category": " Social Science , Ethnic Studies , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Oceans: An Activity Guide for Ages 6-9",
        "Authors": "By Castaldo, Nancy F.",
        "Description": "Even kids in the Midwest, far from any salt water, can learn about the ocean and have fun with this activity guide. Only a handful of the activities need to be done at the seaside; most can be done at the kitchen table or in the classroom. Kids will experiment with salty water and learn about tides, currents, and waves. They’ll explore different ocean habitats, from tide pools to sunlit waters to the deep-water world where light does not penetrate. Tales of the ocean from around the world enhance the learning and the fun. Other activities include carving a polar bear in soap, playing an echolocation game, and testing various ways to clean up an oil spill. An extensive resource section lists aquariums around the world; books, videos, and interesting Web sites; a calendar of ocean events; and organizations that protect our oceans.",
        "Category": " Juvenile Nonfiction , Activity Books",
        "Publisher": "Chicago Review Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Patient Teaching Manual 1",
        "Authors": "By Ford, Regina Daley (EDT)",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Springhouse Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Salads (Companys Coming No 4)",
        "Authors": "By Pare, Jean",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Salads",
        "Publisher": "Companys Coming Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Wolfblade (The Hythrun Chronicles: Wolfblade Trilogy, Book 1)",
        "Authors": "By Fallon, Jennifer",
        "Description": "Marla Wolfblade of Hythria is determined to restore her family's great name, but conspirators surround her: the Sorcerers' Collective, the Patriots -- even members of her own family.  She must make sure her son Damin lives to be old enough to restore the Wolfblade name to its former glory. Elezaar the Dwarf is a small man with big secrets -- but that doesn't matter to Marla Wolfblade. Her brother is the High Prince of Hythria, and, in this fiercely patriarchal society, her fate will be decided on his whim. She needs someone politically astute to guide her through the maze of court politics -- and Elezaar the Dwarf knows more than he lets on. As Elezaar teaches Marla the Rules of Gaining and Wielding Power, Marla starts on the road to becoming a tactician and a wily diplomat -- but will that be enough to keep her son alive?",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "128 of the Greatest Stories from the Bible (Barbour Value Paperback)",
        "Authors": "By Reece, Colleen L., Harmon, Daniel E., and Reece-Demarco, Julie",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Mystic Arts of Erasing All Signs of Death: A Novel",
        "Authors": "By Huston, Charlie",
        "Description": "With his teaching career derailed by tragedy and his slacker days numbered, Webster Fillmore Goodhue makes an unlikely move and joins Clean Team, charged with tidying up L.A.'s grisly crime scenes. For Web, it's a steady gig, and he soon finds himself sponging a Malibu suicide's brains from a bathroom mirror and flirting with the man's bereaved and beautiful daughter.Then things get weird: The dead man's daughter asks a favor. Every cell in Web's brain tells him to turn her down, but something makes him hit the Harbor Freeway at midnight to help her however he can. Soon enough it's Web who needs the help when gun-toting California cowboys start showing up on his doorstep. What's the deal? Is it something to do with what he cleaned up in that motel room in Carson? Or is it all about the brewing war between rival trauma cleaners? Web doesn't have a clue, but he'll need to get one if he's going to keep from getting his face kicked in. Again. And again. And again.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    }
]