[
    {
        "Title": "Fire and Water: A Life of Peter the Great",
        "Authors": "By De Jonge, Alex",
        "Description": "Reviews the life and reign of the ruler considered to be the world's most excessive and enigmatic czar, a man whose intense passion for learning and discovery finally brought Russia out of the Middle Ages",
        "Category": "",
        "Publisher": "Coward Mc Cann",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1980"
        }
    },
    {
        "Title": "The Last Promise",
        "Authors": "By Evans, Richard Paul",
        "Description": "Richard Paul Evans is one of the world's most beloved storytellers. Here, in his latest novel, he tells a love story about facing the greatest decision of all...choosing between the love for a child and romantic love.  When Eliana, still called Ellen by her close friends back in America, moved to Italy the future was bright with promise. Tuscany held magic in its sprawling vineyards, great food, and centuries of art. It was a life of the senses, perfect for a blossoming, talented young artist such as Eliana. Her family and friends back home all thought she had made the right choice in following her heart, and the man she fell in love with and married, back to his native country. In America, Eliana's story was that of a fairy tale.  But in Italy, in the small, rustic village nestled in the Chianti countryside, Eliana found her husband to be a very different man. Over time he distances himself from her, leaving Eliana to care for their young son, struggling with the asthma that threatens to take his life.  Although she longs for the romance she'd known in America, Eliana is happy as a mother and with the time she spends with her child; yet when fellow American Ross Story, a deeply thoughtful man with a mysterious passion for art, arrives at the same villa, a chance encounter causes Eliana and Ross to look at their lives anew. And with their discovery that individuals may change and grow, they can never forget that the bonds of family last forever.  In The Last Promise Richard Paul Evans spins a passionate, bittersweet tale about the fantastic joy and great sorrow life can throw our way.  Rich and complex as a vintage Chianti wine, The Last Promise is in the end an uplifting, all-too-human tale about the magnificent power of true love.",
        "Category": " Fiction , Literary",
        "Publisher": "Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "In My Wildest Dreams: Simple Steps To A Fabulous Life",
        "Authors": "By Blanke, Gail",
        "Description": "Design the life of your dreams -- starting right now!  Have you ever thought about how your life would be if anything -- absolutely anything -- were possible? Gail Blanke, founder of Lifedesigns, is a living example of this philosophy, and In My Wildest Dreams gives you her tools for transforming your dreams into reality, for defining your great life however you define great. Like the thousands of women who have come to Blanke's workshops, you too will understand that you can design a life as outrageously wonderful as you can imagine. Clearly written techniques and a step-by-step set of exercises will show you how to:  * Unravel the mind-set that keeps you trapped in the past * Declare and redefine your interpretation of a great life * Listen powerfully to discover new possibilities * Connect to resources you have at your fingertips but may not see * Create a strong network of women committed to your progress, who will remind you of your dream, and ensure that you follow through on your life's joy!  So stop settling and starting soaring, right now!",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "We Are Our Mothers' Daughters",
        "Authors": "By Roberts, Cokie",
        "Description": "“[A] paean to feminism and the solidarity of womenkind. . . . This book is a celebration of women in their various roles: mother, sister, civil rights advocate, consumer advocate, first-class mechanic, politician—which Roberts’ own mother once was.” —Washington Post “The perfect combination of powerful feelings and a modulated style.” — Los Angeles Times From the much beloved Cokie Roberts comes a revised and expanded tenth-anniversary paperback edition of the #1 New York Times Bestseller We Are Our Mothers’ Daughters—complete with new profiles.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "What to Expect When the Babysitter Comes (What to Expect Kids)",
        "Authors": "By Murkoff, Heidi Eisenberg and Rader, Laura (ILT)",
        "Description": "Growing Up Just Got Easier ... With the help of Angus, the lovable Answer Dog, best-selling author Heidi Murkoff extends a hand to parents and children as they tackle life's first experiences together. Whether you're heading out for a night of romance, an afternoon of recreation, or a day of work, there will be plenty of times when you'll need to (or want to) leave home without children. Enter - the babysitter. What To Expect When the Babysitter Comes will help you answer your child's questions about babysitters - what they're for, what they're like, what they do - as well as explain how the day or night will be different (and the same) without Mommy and Daddy. Have fun! Heidi and Angus",
        "Category": " Juvenile Nonfiction , Family , General",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Seven From Heaven: The Miracle of the McCaughey Septuplets",
        "Authors": "By Lewis, Gregg, McCaughey, Bobbi, Lewis, Deborah Shaw, and McCaughey, Kenny",
        "Description": "Seven from Heaven is the amazing story of the famous septuplets and thecourage of a family that changed medical history. This story of simplefaith recounts the events leading up to, during, and following thebirths of the only living septuplets in the world.Tradepaper conversion. Hardcover originally released in 1998.",
        "Category": " Medical , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The New World Order",
        "Authors": "By Robertson, Pat",
        "Description": "An analysis of the current geopolitical arena explores the meanings of a new world order developing in Europe, the Middle East, and the United States",
        "Category": " History , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "How to boost your brainpower: Achieving peak intelligence, memory, and creativity",
        "Authors": "By Yepsen, Roger B.",
        "Description": "Describes the mental effects of food and considers the importance of stress, exercise, nutrition, and sleep as factors affecting our mental processes",
        "Category": "",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Best Recipes of the Great Food Companies",
        "Authors": "By Anderson, Judith",
        "Description": "More than four hundred carefully selected recipes from such companies as Nabisco, Pepperidge Farm, Campbell's, Lipton, Kellogg, and Oscar Mayer include appetizers, main courses, decadent desserts, and more.",
        "Category": " Cooking , Reference",
        "Publisher": "Bbs Pub Corp",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Smart Medicine for Menopause: Hormone Replacement Therapy and Its Natural Alternatives",
        "Authors": "By Cabot, Sandra",
        "Description": "Discusses menopause and how to minimize symptoms and maximize good health through the use of hormone replacement therapy, herbs, vitamins, foods, and natural supplements",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Avery Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Antonia Saw the Oryx First",
        "Authors": "By Thomas, Maria",
        "Description": "“A complex, deeply written and finely wrought double portrait of two women, one black, one white, picking their way through the debris of a shattered colonialism, discovering unexpected treasures buried in the rubble.”—Margaret Atwood   “Impressive.”—Vogue   “Sharp, surprising images of Africa.”—ELLE   “Exquisite. The year’s best novel.”—USA Today   Though American, Dr. Antonia Redmond is African-born and has lived in East Africa for almost her entire life. With the end of colonialism, like all whites, she faces exile. Only the intercession of an influential lover preserves her visa, but should she leave, she will not be allowed to return. As the inevitable reckoning comes and the white population dwindles, she clings to the land to which she feels a deep connection. Antonia Saw the Oryx First is a profound exploration of personal and cultural identity, love and leave-taking.",
        "Category": " Fiction , General",
        "Publisher": "Soho Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Shed 10 Years In 10 Weeks",
        "Authors": "By Whitaker, Julian",
        "Description": "",
        "Category": "",
        "Publisher": "Simon Schuster Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "1001 Ways to Reward Employees",
        "Authors": "By Nelson, Bob",
        "Description": "Why is 1001 Ways to Reward Employees, with over 1.4 million copies in print, such an extraordinary bestseller? Because a little over ten years ago Bob Nelson took the seeds of an idea and turned it into something indispensable for business. The idea? That it’s not a raise that motivates an employee, and it’s not a promotion—what really sparks a person to perform are those intangible, unexpected gestures that signify real appreciation for a job well done. Now, after having worked with thousands of organizations in the years since 11001 Ways to Reward. . . was first published, Bob Nelson presents a second edition packed with hundreds of new ideas and examples of how companies are using rewards and recognitions to boost productivity and keep their valued employees happy. Airplane mechanics are rewarded with balloons and pinwheels. Another manager calls his employees’ mothers and thanks them for raising such industrious children. There are ideas from the offbeat (The Margarita Award) to the company-wide (a quiet room) to the embarrassingly simple (a hand-written thank you note) to the wacky (the Laugh-a-Day challenge) to the formal (a two-week promotion to special assistant to the president). Each section includes no-cost rewards and low-cost rewards, both public and private, making this new edition an indispensable resource for making the person/achievement/reward equation work.",
        "Category": " Business & Economics , Management",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Anxiety Book: Developing Strength in the Face of Fear",
        "Authors": "By Dreher, Henry and Davidson, Jonathan, M.D.",
        "Description": "Do you have unhealthy anxiety? Do you suffer from sleeplessness, irritability, trouble relaxing, difficulty in concentrating, or fear of ambarrassment? From Dr. Jonathan Davidson, director of the Anxiety and Traumatic Stress Program at Duke University Medical Center and one of the most respected experts on anxiety disorders, comes the definitive and solution-filled book about anxiety. The Anxiety Book offers self-assessment tests and serves as a comprehesive treatment guide for one of the most common health concerns in America.",
        "Category": " Psychology , Mental Health",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Women on the Edge #1",
        "Authors": "By Maitena",
        "Description": "A collection of cartoons from Argentina depicts the changing lives of women at home, at work, and with their partners and their children.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Riverhead Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Animal Dreams",
        "Authors": "By Kingsolver, Barbara",
        "Description": "\"Animals dream about the things they do in the day time just like people do. If you want sweet dreams, you've got to live a sweet life.\" So says Loyd Peregrina, a handsome Apache trainman and latter-day philosopher. But when Codi Noline returns to her hometown, Loyd's advice is painfully out of her reach. Dreamless and at the end of her rope, Codi comes back to Grace, Arizona to confront her past and face her ailing, distant father. What the finds is a town threatened by a silent environmental catastrophe, some startling clues to her own identity, and a man whose view of the world could change the course of her life. Blending flashbacks, dreams, and Native American legends,Animal Dreams is a suspenseful love story and a moving exploration of life's largest commitments. With this work, the acclaimed author ofThe Bean Trees and Homeland and Other Stories sustains her familiar voice while giving readers her most remarkable book yet.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Life and Death on the Corporate Battlefield: How Companies Win, Lose, Survive",
        "Authors": "By Solman, Paul and Friedman, Thomas",
        "Description": "An inside look at the workings of American business documents the competition, decision-making process, corporate strategies, success, and failure of the American business world",
        "Category": " Business & Economics , General",
        "Publisher": "Bookthrift Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Early Reagan: The Rise to Power",
        "Authors": "By Edwards, Anne",
        "Description": "Interviews with more than two hundred friends, family members, and colleagues and extensive research that included access to the minutes of the Screen Actors Guild meetings and to the Warner Bros. archives provide the basis for this profile",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Club Fed",
        "Authors": "By Thomas, Bill",
        "Description": "In Club Fed Bill Thomas, former reporter for the Baltimore Sun, uncovers in uproarious fashion exactly how and why the work of Congress - barely - gets done. He laces his knowing dissection of the Hill with invaluable insights into the legislative business of Congress: how bills get written - and how lobbyists, it seems, write most of them; how a bill is passed - and who gets the favors; how a congressman campaigns for reelection - from day one, and with money controlled by more powerful congressmen; and how Capitol Hill reporters carefully avoid the real news.Since Washington, D.C., was founded in 1800, Capitol Hill has always been the worst possible neighborhood, both inside and outside the Capitol itself. It is still a dangerous area, where the murder rate rivals the South Bronx and the only people exempt from passing through metal detectors upon entering the Capitol are the members themselves.",
        "Category": " Political Science , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "A Trailside Guide: Winter Adventure (Trailside Guides)",
        "Authors": "By Krauzer, Steven M. and Stark, Peter",
        "Description": "This unique handbook covers over two dozen  cold-weather sports, from snowshoeing,  snowboarding, sledding, ice-sailing, and winter  camping to dog sledding, skijoring, animal  tracking, igloo-building, and even how to make  the perfect snow angel. Special sections treat  staying warm, equipment, technique, safety, and  tips for maximizing fun. Every winter adventurer will find something new here, from novice to  thrill-seeker to kids and the entire family.",
        "Category": " Sports & Recreation , Winter Sports",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Computers Simplified, Student Edition (3rd ed)",
        "Authors": "By Maran, Ruth",
        "Description": "Integrating visual explanations of computer concepts with simple words and pictures, Glencoe's New Visual Approach Series appeals to today's visually oriented learner. Designed for the classroom, the texts get your students up and running with today's most popular hardware and software. The Glencoe Visual Approach Series is simply the best - and easiest - graphics-format concepts content available.",
        "Category": " Computers , Computer Science",
        "Publisher": "Glencoe/McGraw-Hill",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Devices and Desires (Inspector Adam Dalgliesh)",
        "Authors": "By James, P. D.",
        "Description": "Commander Dalgliesh of Scotland Yard has just published a new book of poems and has taken a brief respite from publicity on the remote Larksoken headland in a converted windmill left to him by his aunt. But he cannot so easily escape murder. A psychotic strangler of young women is at large, and getting nearer to Larksoken with every killing. And when Dalgliesh discovers the murdered body of the Acting Administrative Officer on the beach, he finds himself caught up in the passions and dangerous secrets of the headland community and in one of the most baffling murder cases of his career.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Alred A. Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Chicken Soup for the Woman's Soul: 101 Stories to Open the Hearts and Rekindle the Spirits of Women (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Hawthorne, Jennifer Read (COM), and Shimoff, Marci (COM)",
        "Description": "There are many ways to define a woman: daughter, mother, wife, professional, friend, student... We are each special and unique, yet we share a common connection. What bonds all women are our mutual experiences of loving and learning: feeling the tenderness of love; forging lifelong friendships; pursuing a chosen career; giving birth to new life; juggling the responsibilities of job and family, and more.This shining collection brings you inspiration and comfort in special chapters on marriage, motherhood, aging, bridging the generations, attitude, self-esteem and higher wisdom. Stories honor the strength and reveal the beauty of the feminine spirit. Included are incredible stories from Oprah Winfrey, Leo Buscaglia, Linda Ellerbee, Robert Fulghum, Kathie Lee Gifford and many others.Whether you are a career woman or a stay-at-home mom, a teenager or a senior, a young woman just starting out or a woman of the world, this delightful book will be a treasured companion for many years to come.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Health Communications Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Fat Tuesday",
        "Authors": "By Brown, Sandra",
        "Description": "It's the day of sin, when sexuality explodes on the streets and no one is who they seem. For a cop turned outlaw, and for a beautiful woman held captive in a loveless marriage, New Orleans's Mardi Gras will offer them their last chance for freedom - and each other.Burke Basile is the hard-bitten cop whose world shattered when a fellow officer died from a bullet fired from Burke's own handgun. When his unhappy marriage crumbles, and he has nothing left to lose, Burke focuses his rage on his nemesis: Pinkie Duvall, a sinister, flamboyant defense attorney who has just helped a known killer get away with another murder. Determined to bring the powerful Duvall down, Burke strikes at the attorney's most vulnerable spot: the gorgeous wife Duvall pampers but keeps prisoner, a woman whose love Pinkie will never have.Remy Duvall was destitute and at the mercy of New Orleans's streets before Duvall made her his trophy. When Burke strikes, taking Remy as his captive, it sets off a duel between the criminal lawyer and the ex-cop that explodes from the streets of the French Quarter and intensifies in the steamy swamps.For Burke, who is struggling with his own anguished spirit, his fight with Duvall is a matter of honor. But the one thing he could never have imagined is the passion that erupts between himself and Duvall's wife. As dozens of players - from the innocent to the corrupt - are drawn into the drama, Burke and Remy have one way out: through a desperate confrontation in the middle of Mardi Gras madness.",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Cromwell File",
        "Authors": "By HARRINGTON, William",
        "Description": "Terrorist attacks on the art treasures of the Western world, carried out by a single individual dubbed \"Oliver Cromwell,\" lead up to a final assault aimed at Notre Dame de Paris and the dignitaries assembled for a memorial service for British agents kille",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Count Out Cholesterol: American Medical Association Campaign Against Cholesterol",
        "Authors": "By Ulene, Art",
        "Description": "Examines the causes of elevated cholesterol levels and explains how to become more healthy through a pesonally tailored program of diet and exercise",
        "Category": " Health & Fitness , Diet & Nutrition , Food Content Guides",
        "Publisher": "Feeling Fine",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "The Complete PC Upgrade and Maintenance Guide",
        "Authors": "By Sybex Inc. (EDT) and Minasi, Mark",
        "Description": "",
        "Category": " Computers , Hardware , General",
        "Publisher": "Sybex Inc",
        "Price Starting With ($)": "9.87",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Conceptual Selling: The Revolutionary System for Face-To-Face Selling Used by America's Best Companies",
        "Authors": "By Heiman, Stephen E. and Miller, Robert B.",
        "Description": "",
        "Category": "",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Lucy: The Beginnings of Humankind",
        "Authors": "By Johanson, Donald C. and Edey, Maitland Armstrong",
        "Description": "Johanson, the discoverer, in 1974, of \"Lucy\"--the oldest skelton of an erect-walking human yet found--reports the story of his internationally acclaimed find and speculates on its meaning for the understanding of our origin",
        "Category": " Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1981"
        }
    },
    {
        "Title": "Chicken Inspector No. 23",
        "Authors": "By S. J. Perelman",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.38",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "The Balanced Life: Achieving Success in Work & Love",
        "Authors": "By McGinnis, Alan Loy",
        "Description": "",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Augsburg Fortress Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Beyond Peace",
        "Authors": "By Nixon, Richard Milhous",
        "Description": "Beyond Peace is a manifesto for a new America, written with visionary insight and a realistic idealism by the thirty-seventh president of the United States. Richard Nixon offers a new agenda for the United States as it defines its role in the complex post-Cold War era.The collapse of communism, he argues, has offered the United States a unique opportunity for achieving an American renewal. The ultimate test of a nation's character is not just how it responds to adversity in war, but how it meets and masters the challenge of peace: During the Cold War, we sought a peace with justice. If America is to remain a great nation, we now need a mission beyond peace.Nixon charts the course America should take in the future to ensure that the opportunities of this new era beyond peace are not lost. With his unrivaled experience in foreign affairs, he addresses the key issues facing the United States today: why the United States should continue to play the leading role on the world stage, and what our policies should be toward Russia, Europe, China, Japan, and the Middle East.Nixon's answers are informed by a depth of knowledge gained over many years as a statesman in the international arena. His intimate portraits of world leaders, past and present, offer us a bird's-eye view of leadership and international politics.Turning to America, the former President perceives a crisis of spirit that extends beyond foreign affairs. It manifests itself in crime, in education, in race relations, in a selective moralism, in a notion of rights without responsibility, and most of all in a corrosive entitlement mentality that he describes as \"one of the greatest threats to our fiscal health, our moral fiber, and our ability to renew our nation.\"This book challenges us to seek a goal higher than peace alone. It must be a mission that will unify and inspire the country without war, built on peace but able to transcend it.Beyond Peace is Richard Nixon's tenth - and possibly most provocative - book.",
        "Category": " Political Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "McCall's no time to cook: Meals in minutes",
        "Authors": "By Elaine Prescott Wansavage",
        "Description": "",
        "Category": "",
        "Publisher": "Field Publications",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "A Ruling Passion",
        "Authors": "By Michael, Judith",
        "Description": "A socialite-reporter and her network-owning boss rekindle an old romance, but when she starts investigating his jealous ex-wife's TV ministry dangerous passions stir",
        "Category": " Fiction , General",
        "Publisher": "Poseidon Press",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Barbara Bush: A Memoir",
        "Authors": "By Bush, Barbara",
        "Description": "Barbara Bush is certainly among the most popular First Ladies ever to live in the White House. Politics aside, people worldwide have come to admire her wit, her candor and compassion, as well as her unswerving devotion to her husband and children.  In her memoir, Mrs. Bush for the first time gives readers a very private look at a life lived in the public eye for more than twenty-five years. She begins with a compelling portrait of her early years, including: growing up in Rye, New York, and meeting George Bush; life as a young bride and mother, moving far away from home to West Texas; and the almost unbearable pain of losing a child.  With contemporary American history as the backdrop, Mrs. Bush remembers the shock of learning that her fiancé has been shot down in the Pacific during World War II; the disbelief when a black friend is refused service in a Southern restaurant in the 1950s; and the fear when she is caught in the middle of a student protest march in the 1960s.  She recounts her years in public life, from first moving to Washington when George Bush was elected to Congress; to her experience living in New York as the wife of the Ambassador to the United Nations and in China as wife of the U.S. envoy. She talks candidly about the ups and downs of three presidential campaigns and describes her role as the wife of the Vice President, culminating in the climactic White House years.  Drawing upon excerpts from her diary, which she has compiled for more than thirty years, Mrs. Bush takes us behind the scenes of the Persian Gulf conflict and the end of the Cold War. She talks about both the Bushes' struggle to overcome Graves' disease and how she faced the controversy that erupted at Wellesley College before her commencement speech.  Through the friendships she developed over the years with world leaders and their spouses, we meet and get to know the Gorbachevs, the Thatchers, the Mitterrands, the Mubaraks, and many others. And she tells us why she threw so much of her energy and compassion behind the important cause of making more Americans literate.  This memoir includes hundreds of the funny, often self-deprecating, and occasionally touching anecdotes for which Mrs. Bush is well known: surprising a rat while swimming in the White House pool; accidentally stomping on Boris Yeltsin's foot under the table during a state dinner; wearing a $29 pair of shoes for her husband's inaugural ball.  She also talks about the disappointments of the 1992 presidential campaign and the joys of rediscovering private life, including driving and cooking again for the first time in twelve years.  This is a warm and funny memoir that will charm Mrs. Bush's millions of admirers and earn her many more.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Guideposts",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "From: The President: Richard Nixon's Secret Files",
        "Authors": "By Nixon, Richard Milhous (EDT) and Oudes, Bruce (EDT)",
        "Description": "The workings of Nixon's mind and his presidency are revealed in this selection of memos, detailing the behind-the-scenes political machinations, personal schemes, worries, and obsessions of the Nixon administration",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Last Raven",
        "Authors": "By Thomas, Craig",
        "Description": "Patrick Hyde, a top operative for spymaster Sir Kenneth Aubrey, is hunted by a renegade CIA agent after witnessing the destruction of a Russian airliner designed to kill a prominent Soviet reformer",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Up Island",
        "Authors": "By Siddons, Anne Rivers",
        "Description": "If there was ever one woman who knew what was important, that woman was Molly Bell Redwine. From childhood, Molly was taught by her charismatic, demanding mother that \"family is everything.\" But in what seems like an instant, Molly discovers that family can change without warning. Her husband of more than twenty years leaves her for a younger woman, her domineering mother dies, and her Atlanta clan scatters to the four winds. In a heartbeat Molly is set adrift. Devasting by her crumbling world, Molly takes refuge with a friend on Martha's Vineyard where she tries to come to terms with who she really is. After the summer season, Molly decides to stay on in this very different world, renting a small cottage on a remote up-island pond.As Molly's stay up island widens the distance between her and her old life in Atlanta, she lets go of her outworn notions of family and begins to become part of a strange -- and very real -- new family.  As the long Vineyard winter closes in, she braces herself for the search for renewal, identity, and strength, until the healing spring finally comes.",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "The Gladiators",
        "Authors": "By Englewood",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The Very Last Gambado",
        "Authors": "By Gash, Jonathan",
        "Description": "After being hired as an antiques consultant for a movie about a robbery at London's British Museum, Lovejoy is forced by local gangster Big John Sheehan into robbing Ben Clayton's Russian Exhibition",
        "Category": " Fiction , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Rivals",
        "Authors": "By Dailey, Janet",
        "Description": "Beautiful Flame Morgan and ruthless real-estate magnate Chance Stuart become involved, unaware of long-standing family rivalries, but as the truth comes to light, fierce battles are waged at a devastating price",
        "Category": " Fiction , Romance , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Loving Little Egypt",
        "Authors": "By McMahon, Thomas",
        "Description": "Mourly Vold, a nearly blind physics prodigy, embarks on a mission to reform the telephone system, and joins forces with the eccentric physicist Nikola Tesla to outwit William Randolph Hearst and his crony Thomas Edison",
        "Category": " Fiction , Historical",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "50",
        "Authors": "By Corman, Avery",
        "Description": "Doug Gardner, a sports columnist facing his fiftieth birthday, tries to find out who he is and what he should be as he searches for a younger woman",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "A Cast of Stars",
        "Authors": "By Prior, Alan",
        "Description": "Sir Harry and Sir Piers, friends and rivals for decades, are great, aging, actor-knights preparing for one more grand production among the theatrical lions and lionesses of London's West End",
        "Category": " Fiction , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "6.11",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "The Shepherd",
        "Authors": "By Girzone, Joseph F.",
        "Description": "A conservative bishop becomes a church reformer--to his superiors' dismay--after he meets a man named Joshua who urges him to unify Christ's divided flock",
        "Category": " Fiction , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Phoenix no more",
        "Authors": "By Gage, Edwin",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Outsider",
        "Authors": "By Fast, Howard",
        "Description": "From 1946 through the 1970s, Rabbi David Hartman, Congregational minister Martin Cooper, and their wives maintain a friendship that withstands small-town prejudices and envies and larger turmoil",
        "Category": " Fiction , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Gloriana: The Years of Elizabeth I",
        "Authors": "By Luke, Mary M.",
        "Description": "",
        "Category": "",
        "Publisher": "Coward, McCann & Geoghegan",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Prelude to Terror",
        "Authors": "By MacInnes, Helen",
        "Description": "Flying to Vienna to purchase at auction a painting whose present owner is a Hungarian planning defection, art consultant Colin Grant finds himself the key piece in a conspiracy of fraud, kidnapping, murder, and wholesale international terror",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "August",
            "Year": "1978"
        }
    },
    {
        "Title": "Wandering Stars: An Anthology of Jewish Fantasy and Science Fiction",
        "Authors": "By Dann, Jack (COP)",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "15.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Reuben",
        "Authors": "By Wideman, John Edgar",
        "Description": "An aging, highly intelligent black lawyer who lives in a cluttered trailer is the go-between for the poor blacks of Homewood who must deal with the authorities downtown",
        "Category": " Fiction , General",
        "Publisher": "Henry Holt",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Spock's World",
        "Authors": "By Duane, Diane",
        "Description": "Relates the story of the enigmatic Mr. Spock and his mysterious home of Vulcan, now threatened by a mysterious crisis",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Kissinger: Portrait of a Mind",
        "Authors": "By Graubard, Stephen Richards",
        "Description": "",
        "Category": "",
        "Publisher": "Norton",
        "Price Starting With ($)": "41.75",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Alnilam",
        "Authors": "By Dickey, James",
        "Description": "During the Second World War, Frank Cahill, recently blinded, is compelled to learn about his son's mysterious demise and enigmatic life",
        "Category": " Fiction , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Joy of Photography: A Guide to the Tools & Techniques of Better Photography",
        "Authors": "By Eastman Kodak Company, Quint, Bernard, and Taylor, Martin L.",
        "Description": "",
        "Category": "",
        "Publisher": "Addison-Wesley Publishing Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Bishop in the Back Seat, The",
        "Authors": "By Watson, Clarissa",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "18.77",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Double Homicide: Boston / Sante Fe",
        "Authors": "By Kellerman, Jonathan and Kellerman, Faye",
        "Description": "For the first time ever, bestselling novelists Jonathan Kellerman and Faye Kellerman team up to deliver the launch book in a thrilling new series of short crime novels!Its a readers dream come true: a new series co-written by the royal couple of crime fiction--Jonathan and Faye  Kellerman! Each book contains two novels jointly written by the duo, featuring different detectives solving crimes in different cities. In the Land of the Giants has Boston homicide detectives Michael MacCain and Doris Sylvestor investigating the suspicious death of a college basketball star. And in Still Life, the co-worker of a Santa Fe art gallery is murdered, forcing detectives Darryl Two Moons and Steve Katz to put aside holiday celebrations and set things right. Jonathan and Faye Kellerman live with their children in Southern California.PAGES: 256",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The Longevity Strategy: How to Live to 100 Using the Brain-Body Connection",
        "Authors": "By Mahoney, David J., Restak, Richard, M.D., and Mahoney, Short",
        "Description": "\"The longevity strategy...takes specific planning for physical health, for mental acuity, for financial security, for family and friendships and for the systematic shifts in emphasis of career and avocation that keep the mind alert and spirit alive.\" —From the foreword by William Safire. Will you be among the growing number of people who live active and secure lives until age 100 and beyond? Today, researchers are uncovering the reasons why some people stay sharp, happy, and healthy through old age. Drawing on the latest findings about how the brain works and revealing the vital connection between the brain and the body, this groundbreaking new book offers the strategy for a longer, better life. The Longevity Strategy is a landmark collaboration between two remarkable authors: David Mahoney, a longtime business figure and the nation's foremost layman involved in brain research, and Richard Restak, M.D., a bestselling writer and nationally known neurologist and neuropsychiatrist. Sharing their knowledge and expertise, these two authorities give extraordinary insights into successful longevity. The brain-body connection is the interaction among three factors: the health of our brains, our attitudes and thought patterns, and our physical health. Mahoney and Restak explain the vital importance of handling stress properly; lifelong education and mental activity (use it or lose it!); the social connection; physical exercise (even moderate); diversifying your career; and rearranging your brain's hardwiring toward optimism. They present a workable life plan —accessible to everyone —with these goals:  An optimally functioning brain in a sound body  Social support systems, with nurturing family and friends.  A multifaceted career and financial security.  The Longevity Strategy contains 31 practical, essential tactics that will develop and enhance your longevity potential. Armed with this breakthrough book, you can live better—and live longerÆstarting now. Use the power of your brain to get the longevity attitude! I learned the hard way about the validity of the brain-body connection. The Longevity Strategy will make it a great deal easier for you to learn just what it means, too.\" —Mike Wallace. \"Eloquent and vivid....You should read and adopt The Longevity Strategy. It could add years to your life.\" —Daniel Tosteson, M.D. Dean Emeritus, Harvard Medical School. \"This delightful book shows you that a long healthy life is not a struggle to survive but a result of learning how to thrive. In easy-to-understand style, Mahoney and Restak translate the latest research into simple but important steps on how to live long and prosper. Unlike many books about aging, this one is not about bland diets and exhausting exercise; it's about learning how to love living.\" —Paul Pearsall, Ph.D., New York Times bestselling author of Superimmunity, The Pleasure Prescription, and The Heart's Code. \"Superb . . . The Longevity Strategy reads like a Poor Richard's Almanac for the next millennium. It is chock full of practical scientific knowledge that can help one become and stay healthy, wealthy, and wise.\" —Bart Kosko, Ph.D. Professor, University of Southern California author of the bestselling Fuzzy Thinking. \"This intelligent, witty, and informative book is accessible to everyone. It may not enable us all to live 100 years, but it will help us get there. Most important, it will make the journey more rewarding.\" —Leon Cooper, Ph.D.,winner of the Nobel Prize in Physics, Professor and Director, Department of Physics and Neuroscience, Brown University.",
        "Category": " Self-help , Aging",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Second Honeymoon: A Pioneering Guide to Reviving the Mid-Life Marriage",
        "Authors": "By Rhodes, Sonya and Schneider, Susan",
        "Description": "Outlines the profoundly different midlife psychological changes experienced by men and women in order to help middle-aged couples understand themselves and discover a new lease on love. 50,000 first printing. $60,000 ad/promo. Tour.",
        "Category": " Social Science , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The Seeing Glass",
        "Authors": "By Gorman, Jacqueline Laks",
        "Description": "The author explain how she became blind due to a rare optic condition and isolated herself from others, reflecting on her life, her family, and, in particular, her autistic brother, who had been forcibly separated from the family and sent to live in a mental institution as a child.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Riverhead Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Stately Homicide (Detective Inspector Ben Jurnet)",
        "Authors": "By Haymon, S. T.",
        "Description": "Weaves a dark, psychologically acute tale of murder with detection in a stately English home",
        "Category": " Fiction , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "Dukakis: An American Odyssey",
        "Authors": "By Kenney, Charles and Turner, Robert L.",
        "Description": "Traces the presidential candidate's life from his immigrant parents, through his successful governorship, to his run for the Democratic presidential nomination.",
        "Category": "",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "We Are All in the Dumps with Jack and Guy: Two Nursery Rhymes with Pictures",
        "Authors": "By Sendak, Maurice",
        "Description": "We are all in the dumpsFor diamonds are thumps The kittens are gone to St. Paul's!The baby is bitThe moon's in a fitAnd the houses are built Without wallsJack and GuyWent out in the RyeAnd they found a little boyWith one black eyeCome says Jack let's knock Him on the headNo says GuyLet's buy him some breadYou buy one loafAnd I'll buy twoAnd we'll bring him up As other folk doTwo traditional rhymes from Mother Goose, ingeniously joined and interpreted by Maurice Sendak.",
        "Category": " Juvenile Fiction , Social Themes , Homelessness & Poverty",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "A Family Christmas",
        "Authors": "By Reader's Digest Association",
        "Description": "Collects essays on the history and lore of popular Christmas customs, make-it-yourself projects related to each custom, menus and recipes--from James Beard--for four Christmas dinners, cookie recipes, stories, poems, and prayers",
        "Category": " Social Science , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "The Harvest",
        "Authors": "By Levin, Meyer",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "12.81",
        "Publish Date": {
            "Month": "February",
            "Year": "1978"
        }
    },
    {
        "Title": "Daybreak",
        "Authors": "By Plain, Belva",
        "Description": "Few writers can move and captivate readers as Belva Plain can. In Daybreak, perhaps her best and boldest work yet, she creates a living, breathing portrait of two families joined by a devastating childhood illness, yet divided by the politics of hatred and by the sons they love.In a doctor's office, a man and a woman sit stunned as the doctor speaks: Blood tests show without a shadow of a doubt that the son they love so dearly, and who is now dying, is not their child. Incredible as it seems, there must have been a mix-up in the hospital where he was born. Enduring the pain of Peter's death is a blow they must bear, but Margaret and Arthur Crawfield must also confront the realization that somewhere their biological child still lives. And although they know their search will tear apart another family, they feel compelled to look for the child who has grown up in another home.At the same time that the Crawfield family's world is turning upside down, Laura Rice - Mrs. Homer \"Bud\" Rice - looking around her elegant home at her beloved piano and ancestral portraits, realizes that after nineteen years of marriage she and her husband are fundamentally strangers. Bud Rice is respectable and respected in their small southern town, a good father to their two sons - bright, healthy Tom and eleven-year-old Timmy, who despite his chronic illness is a gift of joy. But Bud is the reason, Laura believes, for Tom's involvement with a campus group of terrifying bigots.Now the Crawfield and the Rice families will come together, putting emotions in upheaval and leaving lives forever changed. Somewhere in the days ahead a mother must tell her son that he was born to another woman and has another family. And no one foresees the events gathering force to explode with violence in the quiet town as a political candidate plays on prejudice and fear. Newly discovered truths rock a family already under siege in Daybreak's jolting, soul-shattering conclusion.Timely, provocative, and as real as today's headlines, Daybreak pulses with truth, takes our breath away with its extraordinary grace and eloquence, and brings vividly to life men and women so real they will long remain in our minds and hearts.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Making It in America",
        "Authors": "By Hamrin, Robert and Jasinowski, Jerry",
        "Description": "Steadily, efficiently, almost without anyone's noticing, American industry has pulled off an astonishing turn-around in defiance of the dire media predictions of the \"death of manufacturing\" in the United States. Making It in America takes an up-close and in-depth look at the dramatic comeback that has made American manufacturing once again the industrial powerhouse of the world. It showcases ten paths to success followed by fifty top companies, such as Motorola, Xerox, and Whirlpool, that can help put any business - service or manufacturing - on its own customized path to success.What is really galvanizing the American business community today, according to authors Jerry Jasinowski and Robert Hamrin, is the dynamic tension between two powerful forces - a renewed commitment to fundamental values and a spirit of innovation to respond to the fast-changing needs of the marketplace. Jasinowski and Hamrin analyze the success stories of fifty companies at the forefront of this renaissance, including large yet constantly innovating companies such as Intel, Rubbermaid, and 3M as well as energetic smaller companies such as WillBurt, Cannondale, and Kingston Technology. (Each company's story concludes with a valuable and practical lesson.)The strategies devised by these companies were creative, bold, and highly effective: for example, Johnsonville Foods' employee empowerment initiative resulted in a 300 percent productivity increase (Path Number 1: Empower Employees): Dell Computer's commitment to customized service and \"pleased\" customers resulted in 70 percent of its buyers becoming repeat customers (Path Number 4: Exceed Customer Expectations); and Wadia Digital's focus on exports led to 70 to 80 percent of its revenues coming from exports in each of its first five years (Path Number 6: Go Global).",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.62",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Best Baby Name Book in the Whole Wide World",
        "Authors": "By Lansky, Bruce (EDT)",
        "Description": "The fun, easy way to name your baby!  * over 13,001 boys' and girls' names, nicknames and variations * origins, meanings, and famous namesakes * the most popular names In the US. and around the world * advice from \"Dear Abby\" * 15 steps to selecting the right name for your baby * psychological stereotypes of popular names * how to change names and famous people who did * current baby naming trends * fascinating facts about names * how to make the best final decision on your baby's name!",
        "Category": " Family & Relationships , Baby Names",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Like No Other Time: The 107th Congress and the Two Years That Changed America Forever",
        "Authors": "By D'Orso, Michael and Daschle, Thomas",
        "Description": "Tom Daschle, the Majority Leader of the historic 107th Senate, presents a candid insider’s account of the workings of the U.S. government during two of the most tumultuous years in the nation’s history.The 107th Congress faced a time like no other in the life of the nation. This was the era of the first presidential election to be decided by the United States Supreme Court, the fifty-fifty Senate, the horror of September 11, the anthrax attacks on media and the government (including Daschle’s own office), the war on terrorism, corporate scandals that shook the economy, the inexorable move toward war with Iraq, and other dramatic events, all leading up to the historic midterm elections of 2002.Through it all, Senator Tom Daschle had, with the exception of the President, the most privileged view of these unfolding developments, both in front of and behind the closed doors of government. In Like No Other Time, Daschle offers a riveting account of his singular perspective on a time when the nation faced deadly and elusive external enemies and a level of domestic political contention rarely seen in American history. Senator Daschle is un-flinching in his impressions of the key political figures of our time from both parties. The result is an acutely perceptive assessment of how our government met—and sometimes did not meet—the challenges of a remarkable era.As it was during the years of the 107th Congress, the United States is once again at a critical and historic crossroads. Our choices, based on what we have learned from our recent past, will affect our future in profound ways. For Senator Daschle, the first and perhaps most important choice lies with what kind of representation and leadership we want in government. It is a choice between a political party with a core philosophical belief in the power of our collective will to confront these challenges through our government, and one dominated by a group of people who don’t like and don’t believe in government.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "The bankers",
        "Authors": "By Mayer, Martin",
        "Description": "",
        "Category": "",
        "Publisher": "Weybright and Talley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Pritikin Program for Diet and Exercise",
        "Authors": "By Pritikin, Nathan",
        "Description": "A full diet and exercise program provides information on nutrients and food groups, advises on shopping, and cooking, and details an enjoyable weight-loss schedule",
        "Category": " Health & Fitness , General",
        "Publisher": "Putnam Pub Group",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "It's Not Easy Being Big! (Bright & Early Books(R))",
        "Authors": "By St. Pierre, Stephanie and Lund, John (ILT)",
        "Description": "Big Bird discovers that some things are easy to do if you are small and others are easy to do if you are big",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Penny Saved",
        "Authors": "By Godfrey, Neale S. and Richards, Tad",
        "Description": "Neale Godfrey's Money Doesn't Grow on Trees flew to the top of the bestseller lists by helping parents teach their kids the value and the uses of money. In A Penny Saved Godfrey builds on those basic concepts - for preschoolers through teenagers - and shows parents how to use money as a teaching tool to give children the life skills and values they will need to survive and thrive in society.In A Penny Saved, a lesson in budgeting becomes a lesson in goal setting and deferred gratification; a job chart reinforces the concept that you are paid for good work, not good behavior; a change-making game opens up a discussion of the importance of honesty.Work sheets, quizzes, teaching games, and exercises for preschoolers, school-age kids, and teenagers give kids hands-on opportunities to hone their practical skills.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Over What Hill?: Notes from the Pasture",
        "Authors": "By Wilder, Effie Leland and Klein, Laurie Allen (ILT)",
        "Description": "Hattie McNair and her cohorts at the FairAcres Home are back!The popular novel Out to Pasture left readers begging for more, so Effie Leland Wilder approaches her second novel with the same good humor and strong faith found in her first.This time, romance is in bloom at FairAcres, as Hattie’s friends Retta Gooding and Sidney Metcalf (“the unelected but undeniable Most Eligible Widower of FairAcres Home”) are drawn closer together while delivering Meals on Wheels. Hattie’s writing career takes off and the FairAcres folks make new friends: elderly Ben Stringfellow and his two young neighbors, Jamie and Jeffrey. Ben’s not quite ready for FairAcres but he is in need of some assistance, and Jamie and Jeffrey, stuck in a difficult home life, are looking for some honorary grandparents. Once again, different generations come together, and the results are entertaining and moving.",
        "Category": " Fiction , Women",
        "Publisher": "Peachtree Pub Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Walt Disney's Bambi",
        "Authors": "By Walt Disney Company",
        "Description": "With the help of his woodland friends, a young deer grows up in a forest",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Dude, Where's My Country?",
        "Authors": "By Moore, Michael",
        "Description": "If Moore's earlier work  Stupid White Men  didn't shake up the Bush administration, this latest exposé is another shout for attention. Moore, whose credits include the bestseller  Downsize This!  and the award-winning documentary \"Bowling for Columbine,\" challenges Dubya to either step down or explain his 25-year involvement with the bin Laden family, his relationship to the Saudi royal family, the Taliban's visit to Texas, and the Saudi connection to 9/11. He also attempts to sort out Bush's web of tall Texas tales regarding Saddam Hussein and the war in Iraq. In addition to pages of notes and credits, Moore includes a helpful chapter called \"How to talk to your conservative brother-in-law.\" Annotation (c) Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Low-Fat & Luscious",
        "Authors": "By Fuller, Kristi (EDT)",
        "Description": "A healthful and delectable assortment of low-fat, easy-to-prepare dishes furnishes ninety-eight recipes for breakfast, snacks, main dishes, meatless meals, and desserts, each of which comes complete with a breakdown of fat, food exchanges, and guidelines for determining fat allowances. 31,000 first printing.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Walt Disney's Snow White and the Seven Dwarfs (Disney's Wonderful World of Reading)",
        "Authors": "By Walt Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier Enterprises",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Money Matters for Parents and Their Kids",
        "Authors": "By Ron Blue, Judy Blue",
        "Description": "Tells parents how to teach their children the skills of budgeting, purchasing, decision making, and goal setting, and discusses allowances, work habits, and values",
        "Category": "",
        "Publisher": "Oliver-Nelson Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Disney's the Lion King (Disney Classic Series)",
        "Authors": "By Walt Disney Company and Ferguson, Don",
        "Description": "A richly illustrated retelling of Disney's new animated film follows the adventures of Simba, a young lion, as he grows to maturity, matches wits with the evil Scar, finds courage, and discovers true love.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Mouse Works",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Banish Your Belly, Butt and Thighs Forever!: The Real Woman's Guide to Body Shaping & Weight Loss",
        "Authors": "By Prevention Health Books for Women",
        "Description": "For real women! No more fad diets, frantic gym visits, and fastidious calorie counting.Here is the book that will show you how to lose weight and shape up and tone your trouble spot regardless of how hectic a life you lead. Banish Your Belly, Butt, and Thighs Forever! provides hundreds of ways for you to schedule in exercise painlessly, reduce the calorie content of your meals without giving up taste, and create healthier-- yet still realistic-- daily routines.Invite simple strategies, small changes, and a firmer, fitter body into your future.",
        "Category": " Health & Fitness , Exercise , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Mickey's Birthday Surprise:  Mickey's Young Readers Library Vol. 1",
        "Authors": "By Mary Packard",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Love Always, Patsy: Patsy Cline's Letters to a Friend",
        "Authors": "By Cline, Patsy, Hazen, Cindy, and Freeman, Mike",
        "Description": "A fan who carried on a four-year correspondence with Patsy Cline shares the best samples of this relationship, dozens of letters covering everything from her loneliness on the road to her joy over the birth of her daughter. Original.",
        "Category": " Biography & Autobiography , Composers & Musicians",
        "Publisher": "Berkley",
        "Price Starting With ($)": "12.57",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Cut Your Bills in Half: Thousands of Tips to Save Thousands of Dollars",
        "Authors": "By Editors of Rodale Press",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Understanding Nutrition",
        "Authors": "By Whitney, Eleanor Noss and Rolfes, Sharon Rady",
        "Description": "The leading text for the chemistry/biology-based course for nutrition and health science majors (or students taking nutrition for a science credit). Known for up-to-date presentation of research, emerging issues, and understandable coverage of complicated topics. Coverage of 1995 Dietary Guidelines included. Major revisions in lipids, weight control, vitamins, minerals, fitness, nutrition for older adults, and disease prevention. New problem sets reinforce nutrition concepts and calculations.",
        "Category": " Science , Life Sciences , Human Anatomy & Physiology",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "8.88",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "I'm a Big Brother",
        "Authors": "By Cole, Joanna and Chambliss, Maxie (ILT)",
        "Description": "The author/artist creators of How I Was Adopted present this child's-eye view of family life, deftly describing the joy of welcoming a new sibling into the family. A companion volume to I'm a Big Sister.",
        "Category": " Juvenile Fiction , Family , Siblings",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Blended Medicine: The Best Choices in Healing",
        "Authors": "By Castleman, Michael",
        "Description": "The Future of Healing IS IN YOUR HANDSMost doctors still practice conventional Western medicine-- end of story. But a growing number of physicians are embracing the future of healing: blended medicine.This revolutionary approach to healing combines the best options in mainstream medicine with gentle, natural, yet efffective alternative therapies, including Chinese and Ayurvedic medicine, yoga and massage, and exercise and nutrition.Blended Medicine shows you how you can wisely combine alternative medicine with all that conventional medicine has to offer--and afford yourself the best opportunity for good health and safe, effective treatment.IN THIS BOOK, YOU'LL DISCOVER ...* Blended-medicine \"menus\" for more than 100 diseases and health conditions* The best choices for each condition; recommended by experts in both conventional and alternative medicine* Which therapies you can use at home, and which require professional practitioners* Simple relaxation therapies that help short-circuit the stress component of many chronic conditions, from colds to cancer* Guidelines for safe use of vitamins, minerals, and herbs, including possible interactions",
        "Category": " Health & Fitness , Healing",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Cardiovascular disorders (Nurse's clinical library)",
        "Authors": "By Hamilton, Helen (editor) and Rose, Minnie B. (editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Springhouse Corp",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Ithaka: A Daughter's Memoir Of Being Found",
        "Authors": "By Saffian, Sarah",
        "Description": "”Hello, is Sarah Saffian there?” asks the voice on the other end of the line. ”My name is Hannah Morgan. I think I’m your birth mother.” So begins this powerful memoir by a young woman whose life changes dramatically when she receives a phone call from someone at once a stranger and her most intimate relation. Saffian’s riveting story of painful self-discovery and newfound joy is unique in its reversal of the usual adoption narrative: here, the biological parents seek out the adoptee. Weaving together letters, journal entries, memories and relections, Saffian tells of her adoption, her adoptive mother’s death six years later, and her upbringing in a loving family. She learns that her biological parents ended up marrying and having other children. She is thus faced with an entire family to whom she is genetically linked. Saffian’s boldly honest account reaches a moving climax with their reunion, three years after the first phone call. Along the way, it raises thorny questions: What is a family? Can we have more than one? What is the line between parental concern and intrusion? Is it hypocritical to be a pro-choice adoptee? How do nature and nurture work together to form a person’s identity? By turns earnest and playful, Ithica: A Daughter’s Memoir of Being Found is sure to touch readers everywhere who have grappled with who they are.Sarah Saffian is a former reporter for the New York Daily News and has also written for the Village Voice, Interview, Harper’s Bazaar, and Mirabella. She holds a B.A. from Brown University and an M.F.A. from Columbia University, and lives in her native New York City.",
        "Category": " Biography & Autobiography , Reference",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.14",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Making of a Country Lawyer",
        "Authors": "By Spence, Gerry",
        "Description": "The Making of a Country Lawyer is, like Clarence Darrow's The Story of My Life, the firsthand account of a beloved American attorney, a modern-day folk hero, a man who has devoted his life's work to the innocent and the damned. It is the riveting life story of a man born to missionary parents in a small Wyoming town in the virulent year of 1929. As a boy, Gerry Spence memorized Scripture in Sunday school, sold fresh bouquets of sweet peas door to door, herded sheep, and prowled the brothels of the Old West before he was fifteen. Tragically, it is also the haunting story of a deeply sensitive twenty-year-old son who learned one October morning that his God-fearing mother, seemingly depressed by her son's waywardness, had shot herself in the mouth with her husband's hunting rifle.More than any other single event, it was this tragedy that transformed the young Gerry Spence and fashioned his view of the world. It allowed him to become sensitive to the feelings of society's castoffs and prepared him to be a trial lawyer, eventually handling such landmark cases as the defense of Randy Weaver and the vindication of a dead plutonium plant worker named Karen Silkwood. The Making of a Country Lawyer not only follows Spence through law school (after graduating first in his class, he initially flunked the bar!), but also chronicles his years as a young prosecuting attorney, his first cases, his successful battle with alcoholism, and his consuming love affair with the woman who would save his life.",
        "Category": " Biography & Autobiography , Lawyers & Judges",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Prophets With Honor: Great Dissents and Great Dissenters in the Supreme Court",
        "Authors": "By Barth, Alan",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf; [distributed by Random House",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Jobmanship: How to Get Ahead by \"Psyching Out\" Your Boss and Co-Workers",
        "Authors": "By Fader, Shirley Sloan",
        "Description": "Offers realistic solutions to the problems of coping with the boss and other office workers, presents strategies for promotions, and gives advice on matching your job to your personality",
        "Category": " Business & Economics , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1978"
        }
    },
    {
        "Title": "Dear George: Advice and Answers From America's Leading Expert On Everything From A to B",
        "Authors": "By Burns, George",
        "Description": "The movie star and comedian answers a variety of questions and offers comic personal advice and practical solutions, as well as a generous selection of anecdotes from his show business career",
        "Category": " Reference , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "The Only Investment Guide You'll Ever Need",
        "Authors": "By Tobias, Andrew",
        "Description": "Thoroughly revised and updated, a new edition of the classic financial planning handbook furnishes guidelines for investing in insurance, stocks, bonds, real estate, collectibles, and more, along with information on taxes, budgeting, pensions, and other vital topics. Original.",
        "Category": " Business & Economics , Investments & Securities",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Petals on the River",
        "Authors": "By Woodiwiss, Kathleen E.",
        "Description": "The fiery and outspoken adopted daughter of one of England's most formidable women, Shemaine O'Hearn has made powerful enemies. And now her adversaries have found a way to remove the hot-blooded beauty from her life of privilege: by falsely convicting Shemaine of thievery and sending her in shackles to America, where she is to be sold in indentured servitude to the highest bidder.In a bustling port city in the colony of Virginia, she becomes the servant of Gage Thornton-a shipbuilder with a young child in need of a nanny. And despite whispered rumors condemning the handsome widower for the untimely death of his wife, Shemaine cannot ignore her desire for this caring, generous and enigmatic stranger who silently aches with his growing need for her-even as grave peril reaches out from across a vast ocean to threaten their flowering love.A proud and spirited woman whose life was stolen from her. . .A man of secrets accused of a terrible crime. . .In a place of new beginnings their destinies are joined--in a gloriously romantic new work from the incomparable storyteller.In an era of treacherous uncertainties, Shemaine O'Hearn--the fiery and outspoken daughter of one of England's most successful businessmen--has made powerful enemies. And those who wish her ill have found a way to remove the hot-blooded beauty from her life of privilege--falsely convicting her of thievery and forcing her in shackles aboard a crowded slave ship bound for America, where she is to be sold in indentured servitude to the highest bidder.In a bustling port city in the colony of Virginia, Shemaine becomes the servant of Gage Thorton--a shipbuilder with a young child in need of a nanny. In a rustic cabin in the woods, far from the whispered rumors that cruelly condemn the handsome widower for the untimely death of his wife, Shemaine cannot ignore her desire for this caring, generous and enigmatic man who silently aches with his growing need for her--even as a grave peril reaches out from across a vast ocean to invade their new life and threaten their flowering love.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Bradshaw on the Family: A Revolutionary Way of Self Discovery",
        "Authors": "By Bradshaw, John",
        "Description": "Analyzes the structure of families, examines the unexpressed rules used to raise children, and discusses family violence, child abuse, and dysfunctional families",
        "Category": " Social Science , General",
        "Publisher": "Hci",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "A Season Inside: One Year in College Basketball",
        "Authors": "By Feinstein, John",
        "Description": "Feinstein takes readers inside the locker rooms, the grueling practices,  the late-night strategy sessions. They get a close-up look at  recruiting, referees, injuries, winning, losing, and the private lives  of the game's biggest stars.",
        "Category": " Sports & Recreation , Basketball",
        "Publisher": "Villard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Katharine Graham's Washington: A Huge, Rich Gathering of Articles, Memoirs, Humor, and History, Chosen by Mrs. Graham, That Brings to Life Her Beloved City",
        "Authors": "By Graham, Katharine (EDT)",
        "Description": "As a fitting epilogue to a life intimately linked to Washington, D.C., Pulitzer Prize winner Katharine Graham, the woman who transformed The Washington Post into a paper of record, left behind this lovingly collected anthology of writings about the city she knew and loved, a moving tribute to the nation’s capital.To Russell Banks, it is a place where “no one is in charge and no one, therefore, can be held responsible for the mess.” To John Dos Passos, it is “essentially a town of lonely people.” Whatever your impressions of Washington, D.C., you will likely find them challenged here. Experience Christmas with the Roosevelts, as seen through the eyes of a White House housekeeper. Learn why David McCullough is happy to declare “I love Washington,” while The Washington Post’s Sally Quinn wonders, “Why Do They Hate Washington?” Glimpse David Brinkley’s depiction of the capital during World War II, then experience Henry Kissinger’s thoughts on “Peace at Last,” post-Vietnam. Written by a who’s who of journalists, historians, First Ladies, politicians, and more, these varied works offer a wonderful overview of Katharine Graham’s beloved city.",
        "Category": " History , United States , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Mothers and Daughters",
        "Authors": "By Wohlmuth, Sharon J. and Saline, Carol",
        "Description": "The authors of the best-selling Sisters present an album of essays and photographs celebrating the mother-daughter bond that includes contributions from Cindy Crawford, Ruth Bader Ginsburg, and Margaret Atwood, among others. Tour.",
        "Category": " Social Science , Sociology , Marriage & Family",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Quiltmaking For Your Home",
        "Authors": "By Eileen Gonin, Jill Newton",
        "Description": "",
        "Category": "",
        "Publisher": "Octopus Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    }
]