[
    {
        "Title": "Start-to-Finish Paths & Walkways",
        "Authors": "By Miller, Martin",
        "Description": "This book introduces a variety of options to help people design and create walkways that suit their lawns and gardens.Photos and illustrations inspire action and assure success: Planning and designLandscape construction basics Materials and techniquesHow-to that any do-it-yourselfer will understand:Functional design Staking and excavatingLow-cost optionsSolutions that experienced do-it-yourselfers might overlook:Grading dilemmasCoping with bog areasAssuring proper drainage",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "Ortho",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "All Segovia And Province",
        "Authors": "By María Jesús Herrero Sanz",
        "Description": "",
        "Category": "",
        "Publisher": "Escudo de Oro",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Standard Handbook of Environmental Engineering",
        "Authors": "By Corbitt, Robert A. (EDT)",
        "Description": "The first major handbook covering the entire field of environmental engineering Written by 36 leading experts in the field, this ``hands-on'' reference provides complete coverage of the latest environmental engineering practices, and includes up-to-date information on legislation and quality criteria to help you establish and prioritize your work goals and objectives. Packed with over 900 table, charts, and drawings, the Handbook covers air quality control, water supply, wastewater disposal, solid waste management, storm-water, and hazardous waste management. It's a must-have reference for anyone who needs to understand, manage, or evaluate environmental engineering technology.",
        "Category": "",
        "Publisher": "McGraw-Hill Professional",
        "Price Starting With ($)": "7.04",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "All Salamanca",
        "Authors": "By Leticia Hernandez",
        "Description": "",
        "Category": "",
        "Publisher": "Editorial Escudo",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Portable UNIX",
        "Authors": "By Topham, Douglas W.",
        "Description": "Using a dictionary-style format, organized by task rather than command, this is an accessible and easy-to-use reference on AT&T UNIX System V, Release 4. Utilities, text and number processing, file handling, printing, editing and formatting are among the many topics covered by the author, a well-known authority on UNIX.",
        "Category": " Computers , Operating Systems , UNIX",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Superfudge (Xover)",
        "Authors": "By Blume, Judy",
        "Description": "Twelve-year-old Peter can hardly survive life in the Hatcher household. Fudge is still his biggest problem, but now he has a whole new disaster to consider. Will the new Hatcher baby become a carbon copy of the zany Fudge?",
        "Category": " Juvenile Fiction , Family , Siblings",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Waddle Lot of Laughs (Disney Club Penguin)",
        "Authors": "By Mccarthy, Rebecca",
        "Description": "What?s black and white and goes round and round? A penguin in a revolving door! This book with adorable spot art is full of jokes, riddles, and puns about everything Club Penguin?related! Kids will love sharing these silly jokes with friends and penguin pals on Club Penguin.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Poems of Flowers",
        "Authors": "By Harvey, Gail",
        "Description": "A collection of poems about flowers features works by Wordsworth, Emily Dickinson, Robert Frost, and others",
        "Category": "",
        "Publisher": "Avenel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Holy Bible: Gift And Award Edition",
        "Authors": "By Thomas Nelson",
        "Description": "Celebrate special occasions with the gift of God’s Word. Choose the perfect gift for any celebration in life—from graduation, confirmation, and awards to family and friendships—with Thomas Nelson’sGift Edition Bible. Select from a variety of colors and bindings, all featuring bright, clean, and easy-to-read pages. Personalize your gift with the recipient’s name on the cover for a Bible that will be cherished for years to come. Give the gift of God’s Word . . . beautiful meaning, quality craftsmanship, and a timeless treasure.Additional features include: In-text subject headingsTranslation footnotesWord of Jesus in redOne-year Bible reading planGod’s answers to man’s concernsParables of JesusMiracles of JesusIllustrated dictionary-concordanceThe New King James Version—More than 60 million copies sold in 30 years",
        "Category": " Bibles , New King James Version , General",
        "Publisher": "Nelson Bibles",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Psychology (8th Edition)",
        "Authors": "By Wade, Carole and Tavris, Carol",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "7.42",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "The Beginner's Guide to Drawing Cartoons",
        "Authors": "By Paul B. Davies",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Cauldron (Cassette)",
        "Authors": "By Bond, Larry",
        "Description": "With Germany and France locked in a deadly battle against the United States, massive dogfights occur in the skies, and the U.S. Navy struggles for survival in waters alive with U-boats. Simultaneous.",
        "Category": " Fiction , General",
        "Publisher": "Audioworks",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Death & Taxes: Complete Guide To Family Inheritance Planning",
        "Authors": "By Doane, Randell C. and Doane, Rebecca G.",
        "Description": "Two attorneys explain the purposes of an estate plan and how to create an effective one, covering such topics as wills, living trusts, probate avoidance, property ownership, estate taxes, and life insurance, and addressing more than a hundred common questions. Simultaneous. UP.",
        "Category": " Business & Economics , Personal Finance , Taxation",
        "Publisher": "Swallow Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Baker's Chocolate and Coconut Favorites",
        "Authors": "By General Foods Kitchens",
        "Description": "",
        "Category": "",
        "Publisher": "General Foods Kitchens (Corporation)",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Streetwise Landlording & Property Management: Insider's Advice on How to Own Real Estate and Manage It Profitably",
        "Authors": "By Weiss, Mark B. and Baldwin, Dan",
        "Description": "As appealing and lucrative as property ownership can be, it isn&#39;t an occupation to be learned through trial and error. It&#39;s essential property owners understand all the ins and outs--legally and financially--for their own welfare as well as their tenants. Streetwise Landlording and Property Management addresses all aspects of the business, from the practical to the strategic. Property management is a 24/7 job with high risks as well as rewards. Streetwise Landlording and Property Management helps you assess whether or not you&#39;re cut out for the job.",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Jamestown: The Buried Truth",
        "Authors": "By Kelso, William M.",
        "Description": "What was life  really like for the band of adventurers who first set foot on the banks of the James River in 1607? Important as the accomplishments of these men and women were, the written records pertaining to them are scarce, ambiguous, and often conflicting, and those curious about the birthplace of the United States are left to turn to dramatic and often highly fictionalized reports. In  Jamestown, the Buried Truth, William Kelso takes us literally to the soil where the Jamestown colony began, unearthing the James Fort and its contents to reveal fascinating evidence of the lives and deaths of the first settlers, of their endeavors and struggles, and of their relationships with the Virginia Indians. He offers up a lively but fact-based account, framed around a narrative of the archaeological team's exciting discoveries. Once thought to have been washed away by the James River, James Fort still retains much of its structure, including palisade walls, bulwarks, interior buildings, a well, a warehouse, and several pits, and more than 500,000 objects have been cataloged, half dating to the time of Queen Elizabeth and King James. Artifacts especially reflective of life at James Fort include an ivory compass, Cabasset helmets and breastplates, glass and copper beads and ornaments, ceramics, tools, religious icons, a pewter flagon, and personal items. Dr. Kelso and his team of archaeologists have discovered the lost burial of one of Jamestown's early leaders, presumed to be Captain Bartholomew Gosnold, and the remains of several other early settlers, including a young man who died of a musket ball wound. In addition, they've uncovered and analyzed the remains of the foundations of Jamestown's massive capitol building. Refuting the now decades-old stereotype that attributed the high mortality rate of the Jamestown settlers to their laziness and ineptitude,  Jamestown, the Buried Truth produces a vivid picture of the settlement that is far more complex, incorporating the most recent archaeology to give Jamestown its rightful place in history and thus contributing to a broader understanding of the transatlantic world.",
        "Category": " History , United States , General",
        "Publisher": "Univ of Virginia Pr",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Final Beginnings",
        "Authors": "By Edward, John and Stoynoff, Natasha",
        "Description": "Drawing on his expertise in psychic phenomena, John Edwards spins a suspenseful, supernatural thriller that culminates in a midtown Manhattan tunnel where the lives and deaths of four characters converge.  75,000 first printing.",
        "Category": " Fiction , Visionary & Metaphysical",
        "Publisher": "Princess Books",
        "Price Starting With ($)": "16.21",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Plays by George Bernard Shaw",
        "Authors": "By Shaw, George Bernard",
        "Description": "",
        "Category": "",
        "Publisher": "Signet Classics",
        "Price Starting With ($)": "13.46",
        "Publish Date": {
            "Month": "August",
            "Year": "1960"
        }
    },
    {
        "Title": "Painless Science Projects (Painless Series)",
        "Authors": "By Morehouse, Hank (ILT) and Brynie, Faith Hickman",
        "Description": "This book was written for kids who find science courses--and especially, science projects--daunting. Author Faith Hickman Brynie promises that she will show them \"how to carry out a project that's as much fun as a day at the beach.\" Her opening chapter tells how to ask good science questions and shape them into promising plans for a project. Chapter 2 offers guidance in transforming an idea into a logical design that's safe, practical, and affordable. Succeeding chapters instruct on collecting and organizing data, writing a report or giving an oral presentation, building a display, and improving a project as it evolves. She also provides helpful checklists on topics ranging from safety to seeking expert help. Kids learn to enjoy doing original science projects, rather than merely repeating experiments taken from books. Middle school and high school students who think they hate science will change their minds in a hurry when they use this book.",
        "Category": " Young Adult Nonfiction , Science & Nature , General",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Pillsbury Christmas, 2007",
        "Authors": "By Inc. and Editor: Lois Tlusty General Mills",
        "Description": "",
        "Category": "",
        "Publisher": "Taste of Home Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "National Geographic Guide to the National Parks of the United States, 5th Ed.",
        "Authors": "By National Geographic Society",
        "Description": "Featuring 80 all new maps and more than 350 photos, this guide is the most comprehensive, up-to-the-minute book of its kind on the market today. A perennial favorite with almost a million copies sold in previous editions, it reflects National Geographic's century-long association with America's national parks system and its peerless reputation for travel expertise and cartographic excellence. The book opens with an essay by Yellowstone authority Paul Schullery, and an introduction to the guide with a locator map showing all 58 of these American treasures (including the newest, South Carolina's Congree National Park). Next, the parks are presented alphabetically region-by-region, with individual maps and geographical profiles of each. These colorfully illustrated descriptions offer tours tailored to the time available, whether it's an hour or a week, and tell visitors the best spots to enjoy hikes, spectacular vistas, wildlife and more. Itineraries and directions, special activities and advisories, and suggestions of hotels and campgrounds are provided, along with scores of ideas for excursions to nearby wildlife refuges, monuments, and other nature areas of exceptional interest?140 in all. From planning a trip to making the most of every minute, here's all the information anyone could want on the scenic national parks plus invaluable recommendations and advice from the National Geographic writers who know them well.",
        "Category": " Travel , Parks & Campgrounds",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Easy Journey to Other Planets",
        "Authors": "By A. C. Bhaktivedanta Swami Prabhupada",
        "Description": "",
        "Category": "",
        "Publisher": "Bhaktivedanta Book Trust",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1972"
        }
    },
    {
        "Title": "Heroes of the Valley",
        "Authors": "By Stroud, Jonathan",
        "Description": "Halli Sveinsson is stumpy and swarthy, with a quick mind and an aptitude for getting in trouble. Bored with everyday chores and shepherding, he enjoys playing practical jokes.  When he plays a trick on Ragnar of the House of Hakonsson, he sets in motion a chain of events that will forever alter his destiny.  He is forced to leave home and go on a hero's quest complete with highway  robbers, terrifying monsters, and a girl who may be as fearless as he is. Along the way he will discover the truth about the legends, his family, and himself.",
        "Category": " Young Adult Fiction , Historical , Medieval",
        "Publisher": "Hyperion Book CH",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Starting Out in Futures Trading",
        "Authors": "By Powers, Mark J.",
        "Description": "",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Probus Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Head to Toe Science: Over 40 Eye-Popping, Spine-Tingling, Heart-Pounding Activities That Teach Kids About the Human Body",
        "Authors": "By Wiese, Jim",
        "Description": "Untangle the Mystery of Human Hair! Listen to a Heart Throb! SniffOut Why Stinky Feet Stink!  SCIENCE THAT REALLY GETS UNDER YOUR SKIN!  Explore the amazing human body, from the hair on your head to yourstinky feet * Smell like a salmon * Build a balloon intestine * Mix up a batch of fake blood * Crack your genetic code  How much air do your lungs hold? How are your bones like a roll oftoilet paper? Where does all your old dead skin go? How can youfigure out how tall a person is from the size of his or her feet?You ll find out the answers in Head to Toe Science. More than 40fun, easy-to-do activities using ordinary products found aroundyour house let you discover the wonders of your body from top tobottom, inside and out your brain, your bones, your digestive,circulatory, and nervous systems, and much more!",
        "Category": " Juvenile Nonfiction , Science & Nature , Anatomy & Physiology",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The U.S. and Mexico: The Bear and the Porcupine",
        "Authors": "By Davidow, Jeffrey",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Markus Wiener Pub",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Herbal Almanac",
        "Authors": "By Rago, Linda Ours and Stodgell, Marjorie (ILT)",
        "Description": "",
        "Category": " Reference , Almanacs",
        "Publisher": "Starwood Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Sugaring Time",
        "Authors": "By Lasky, Kathryn and Knight, Christopher G.",
        "Description": "Text and photographs show how a family taps the sap from maple trees and processes it into maple syrup",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Everything Personal Finance In Your 20S And 30S (Everything Series)",
        "Authors": "By Fowles, Debby",
        "Description": "",
        "Category": " Business & Economics , Personal Finance , Budgeting",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Learning to Learn, Revised Edition: Strengthening Study Skills & Brain Power",
        "Authors": "By Frender, Gloria",
        "Description": "",
        "Category": " Study Aids , Study & Test-Taking Skills",
        "Publisher": "Incentive Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "A Scanner Darkly [Graphic Novel]",
        "Authors": "By Dick, Philip K.",
        "Description": "A haunting graphic version of one of Philip K. Dick’s most popular and best-selling novels. Bob Arctor is a dealer of the lethally addictive drug Substance D, which he also takes in massive quantities. Fred is the police agent assigned to tail and eventually bust him. What Fred doesn’t know is that Substance D gradually splits the user’s brain into two distinct, combative entities, and that he is, in fact, in frantic pursuit of himself. A Scanner Darkly is caustically funny and razor sharp in its depiction of drug-induced paranoia and madness; it’s an industrial-strength stress test of identity as unnerving as it is riveting. The novel is captured in this brilliant graphic vision, composed entirely of stills from the movie. Writer/Director Richard Linklater shot a live-action film, starring Keanu Reeves, Robert Downey Jr., Woody Harrelson, and Winona Ryder, and then animated over the underlying images. The result is an eerily lifelike, richly detailed animation that translates beautifully to the page.",
        "Category": " Comics & Graphic Novels , General",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "6.59",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Cloth of Heaven (Song of Erin #1)",
        "Authors": "By Hoff, B. J.",
        "Description": "Value priced! B. J. Hoff brings us an inspiring Irish-American saga of pain and triumph in the 1800s. Terese Sheridan, desperate to escape the poverty and tragedy of Ireland, traps herself and the man she loves in a web of deception that will have consequences for generations to come. Jack Kane, a rogue newspaperman, builds an empire from his youthful dreams and the kind ofValue priced! reckless courage that makes him a legend in nineteenth-century New York City. Hoff's magnificent epic brings to life one of the most colorful, dramatic eras in American history and weaves a story of love and faith that spans an entire ocean.",
        "Category": " Fiction , Religious",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "That Certain Spark",
        "Authors": "By Hake, Cathy Marie",
        "Description": "Gooding, Texas, is about to gain a double blessing--a veterinarian and a doctor. But when siblings Enoch and Taylor Bestman arrive, the discovery that Taylor is a lady doctor has the town up in arms. Especially Karl Van der Vort, the town blacksmith, who becomes the first patient...against his will. Though hesitant to believe in Taylor's doctoring skills, Karl finds himself oddly protective of this surprising woman who dares to drive about town on her own, wearing the color red, for heaven's sake! Taylor, on the other hand, wants only to prove that doctoring is her life's calling, despite the town's opposition. The result? Pride meets attraction head-on, and sparks begin to fly.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "INSTANT BORDERS: Cut-Out Patterns to Enhance Bulletin Boards. (Fearon Teacher-Aid Book)",
        "Authors": "By Flores, Anthony",
        "Description": "",
        "Category": "",
        "Publisher": "Lake Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "The Watcher (Anna Strong Vampire Chronicles, Book 3)",
        "Authors": "By Stein, Jeanne C.",
        "Description": "Newly-made vampire Anna has become a Watcher-one of the supernatural world's enforcers- even as she fights to control her vampiric rage. When a series of very dangerous events threatens to draw out her unstable powers, her Watcher mentor sends her away for her own safety. But if there's one thing Anna has always been able to find, it's trouble.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Apostles Jesus Special Helpers (Biblearn Series)",
        "Authors": "By Rowell, Edmon L., Jr. and Padgett, Jim",
        "Description": "Brief biographies of the 12 men who followed Jesus and spread His teachings.",
        "Category": " Religion , General",
        "Publisher": "Baptist Sunday School Board",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "Diamond Duo (Texas Fortunes Trilogy, Book 1)",
        "Authors": "By Gruver, Marcia",
        "Description": "Get ready to burn the midnight oil with Diamond Duo, a suspense-filled historical romance that will keep you reading with a white-knuckled grip. When Bertha Biddle meets an enigmatic charmer named Annie Monroe, she's hoping to learn from her the art of how to woo a man. But just how far will Bertha go to win her heart's desire? One woman's miserable end still haunts the town of Jefferson, Texas, today.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Skira Dictionary of Modern Decorative Arts",
        "Authors": "By Terraroli, Valerio",
        "Description": "The Skira Dictionary of Modern Decorative Arts spans, under nearly one thousand headings, a period defined by two crucial events in the intricate history of the transition from artisanal production of the decorative arts to industrial design:  the London World Fair, that opened in 1851 in Joseph Paxton's Crystal Palace, and the E42, designed for Rome and that, owing to the Second World War, was never carried out. Practically a century of history and of an artistic evolution that, arisen from the agelong, consummate technical, material and creative legacy of the European art craftsmanship of the preceding centuries, also took into account industrial production and the radical changes of society and taste that occurred in Europe and the United States between the second half of the nineteenth century and the 1950'sThe Dictionary, enhanced by over three hundred illustrations, provides information, critical commentaries, historical data about artists, designers, manufactories, laboratories, techniques and materials connected with glass and crystal, silverware and jewellery, processed metals, textiles and furnishings, pottery and porcelain, furniture, offering an appendix featuring a concise bibliography raisonné and a repertory of trademarks, related to pottery production, of of signatures and trademarks of artists working in the various fields. Perusual of the individual headings and the illustrations allows to review the history and the evolution of the decorative arts in Europe and the Unites States from Biedermeier to the eclectic and historicist taste, from international modernism, with its different Secessions and liberty versions, to art deco, from Novecento style up to industrial design.",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Skira",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Where Are They? More Than 1,000 Fun Things to Search and Find",
        "Authors": "By Anthony Tallarico",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Wolves & Coyotes (Eyes on Nature Series)",
        "Authors": "By Resnick, Jane",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Change Forces - The Sequel (Educational Change and Development Series)",
        "Authors": "By Fullan, Michael",
        "Description": "Fullan's first book on this subject was an instant and best-selling success. Now in Change Forces - The Sequel he extends and expands the use of chaos theory as a lens through which to view and comprehend change, and the forces which govern it. Educators have already widely embraced this approach, and taken on board the idea that change is not so straightforward as we might hope. As Fullan worked on his ideas relating them to school systems, higher education and research, the field of change forces was also developing significantly. This volume covers new aspects of this 'science of complexity' and helps educators obtain insights for delving deeper into moral purpose, and expanding into fresh dimensions of changing forces in the environment.The first volume appealed to a wide market from classroom teachers, through school administrators, to student teachers and academics. This volume will appeal to a similar cross-section.",
        "Category": " Education , Leadership",
        "Publisher": "Routledge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Fast Growth: A Career Acceleration Strategy",
        "Authors": "By Pritchett",
        "Description": "",
        "Category": "",
        "Publisher": "Pritchett, LP",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Hundreds of Years to Reform a Rake",
        "Authors": "By Brown, Laurene Krasny",
        "Description": "A modern career woman thrust back in time into the glittering Regency period and the arms of an unscrupulous rake... Josephine Drummond is a professional paranormal researcher (aka, a ghostbuster) hired to prove that the ghost of Lord Deverell Thornton, the very handsome Earl and a notorious rake in his time, haunts the crumbling Waite Castle. But the ghost drags Josephine back to the Regency period to help him try to prevent the swindle that impoverished the Earl and threatens to turn his castle into a most undignified modern-day tourist attraction. Josephine has to contend with being a modern career woman trying to navigate the complex social scene of the Regency period, make sure no one discovers her real identity and unmask a charlatan. But all of these are easier than resisting her undeniable attraction to the Earl, who is clearly determined to sweep her off her feet.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Sourcebooks Casablanca",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Dorflinger: America's Finest Glass, 1852-1921",
        "Authors": "By Feller, John",
        "Description": "",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Antique Publications",
        "Price Starting With ($)": "66.41",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Class Struggle: What's Wrong (and Right) with America's Best Public High Schools",
        "Authors": "By Mathews, Jay",
        "Description": "Jay Mathews examines America's elite suburban high schools and asks key questions about them: Do public high schools located in wealthy school districts succeed in providing all students with access to a quality education? What about students who have less ample means than their better-off classmates?Mathews spent three years taking the pulse of America's public high schools - including an extended stay at Mamaroneck High School in Westchester County, New York - to find out what they're doing right, what they're doing wrong, and how they could be doing much better. He emerges with a penetrating analysis of the competing forces that nurture the Ivy League goals of the academic elite while often quashing the less glamorous dreams and potential of the rest. His investigation shows that America's best high schools often cultivate complacency when challenges and incentives should be available to all.",
        "Category": " Education , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Kennedy",
        "Authors": "By Gadney, Reg",
        "Description": "",
        "Category": "",
        "Publisher": "HOLT, RINEHART AND WINSTON",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Murder of a Royal Pain: A Scumble River Mystery",
        "Authors": "By Swanson, Denise",
        "Description": "When school psychologist Skye Denison stumbles over the body of pushy “Promfest” chairperson Annette Paine during a Halloween fundraiser, it looks like a clear-cut case of promicide. Annette was not the only prom mom desperate to see her daughter crowned queen—and her skirt-chasing hubby is no prince either.  Skye’s anxious to investigate, but she keeps getting sidetracked by the overeager new social worker at school, and her current beau’s emotional distance. Still, one question haunts her: Annette Paine was wearing a witch costume identical to Skye’s, so which witch was the intended victim? Will Skye realize too late that finding this killer is a matter of her own life or death?",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Praying for Those We Love As They Serve Our Country",
        "Authors": "By Zondervan Publishing House",
        "Description": "A wonderful companion for family members or friends of anyone serving our country and protecting life and freedom. Filled with comforting scripture passages and prayers from the New International Version.",
        "Category": " Religion , Meditations",
        "Publisher": "Inspirio",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "The Belly Book (Beginner Books(R))",
        "Authors": "By Harris, Joe and Harris, Joe (ILT)",
        "Description": "Bellies come in all shapes and sizes. There are big ones, small ones, hot ones, cold  ones, and even green ones! Learn about all kinds of bellies and the best way to take  care of your very own belly–no matter what kind you have!Originally created by Dr. Seuss, Beginner Books encourage children to read all by themselves, with simple words and illustrations that give clues to their meaning.",
        "Category": " Juvenile Nonfiction , Science & Nature , Anatomy & Physiology",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Pretty in Plaid: A Life, A Witch, and a Wardrobe, or, the Wonder Years Before the Condescending, Egomaniacal, Self-Centered Smart-Ass Phase",
        "Authors": "By Lancaster, Jen",
        "Description": "Jen Lancaster's cultural inferiority complex had to come from somewhere...and now fans can find out where in this hilarious New York Times bestselling memoir from the author of Bitter is the New Black.   Before she was bitter, before she was lazy, Jen Lancaster was a badge-hungry Junior Girl Scout with a knack for extortion, an aspiring sorority girl who didn't know her Coach from her Louis Vuitton, and a budding executive who found herself bewildered by her first encounter with a fax machine. In this hilarious and touching memoir, Jen Lancaster looks back on her life—and wardrobe—and reveals a young woman not so different from the rest of us.  Prepare to take a long walk in her (drool-worthy) shoes in this humorous and heartwarming trip down memory lane.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Panda's Christmas Gifts",
        "Authors": "By Boyd, Aaron (ILT) and Morrow, Tara Jaye",
        "Description": "The adorable hero of Panda’s Easter Basket returns in a new, charming holiday story. It’s the night before Christmas, and Panda can hardly wait till tomorrow to open his presents. He reminds Mama of all the things he’d like: a basketball, a tricycle, a baseball glove, board games. But it’s the gift he least expects?a wooden sailboat that Papa carved just for him?that teaches Panda the true spirit of Christmas.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Halloween",
        "Authors": "By Bartlet, Wendy (EDT), Gardner, Charlie (EDT), Quasha, Jennifer (EDT), and King, Dave (PHT)",
        "Description": "This layered board book is full of Halloween surprises! From the front, all kinds of ghouls and treats can be seen sticking out of the grinning jack-o'-lantern. Then, page by page, each object is revealed along with its sometimes scary, sometimes silly companions. Boo!",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Halloween",
        "Publisher": "DK Preschool",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Heaven's Rogue (Romance of the Millennium)",
        "Authors": "By Shannon, Colleen",
        "Description": "",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Henry V (Dover Thrift Editions)",
        "Authors": "By Shakespeare, William",
        "Description": "By the time depicted in this play, Henry has turned into the greatest of English kings. Though he has retained the common touch and sense of humor he showed as Falstaff's bosom buddy in the two parts of Henry IV, he has become fiercely focused. He punishes those who have plotted against him; in battle against the French, he shows himself an indomitable leader of men; and, at the end, he conquers even the heart of Catherine, the beautiful daughter of the French king.Henry V is one of the most popular of Shakespeare's plays — partly because it brings further news of the downward-spiraling fortunes of some of the beloved scoundrels from Henry IV, and partly because it is so intensely patriotic. Who can keep dry-eyed, who can keep his or her heart from welling up, when Henry gives his great speech before the battle of Agincourt?",
        "Category": " Drama , Shakespeare",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Poppy's Return",
        "Authors": "By Avi and Floca, Brian (ILT)",
        "Description": "The fifth book in the beloved Poppy series by Newbery Medal–winning author Avi, with illustrations from Caldecott Medal–winning artist Brian Floca There's trouble at Gray House, the girlhood home that Poppy left long ago. Poppy's family has called her back to save them all—mother, father, sisters and brothers, and dozens and dozens of deer mouse cousins.Poppy invites her rebellious son, Junior, to join her on the long trip across Dimwood Forest, hoping the journey will bring them closer together. But with Junior's skunk pal, Mephitis, and Ereth, the cantankerous porcupine, in tow—sugared slug soup!—Poppy and Junior may be in for unexpected adventure.",
        "Category": " Young Adult Fiction , Animals , Pets",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Bleed",
        "Authors": "By Stolarz, Laurie Faria",
        "Description": "Over the course of a single summer day, ten teenagers in Salem, Massachusetts, will discover important truths about themselves and each other. There is Nicole, whose decision to betray her best friend will shock everyone, most of all herself; Kelly, who meets the convicted felon she has been writing to for years; Maria, whose definition of a true friend is someone who will cut her. Then there is Sadie, a chubby eleven-year-old whose mother forces her to wear a \"please don't feed me\" sign stapled to her shirt; while Joy, a fifteen-year-old waitress hoping for true intimacy narrowly escapes a very dark fate. Derik discovers that his usual good looks and charm won't help him hold onto the girl he wants, while nineteen-year-old drifter, Mearl, is desperately looking for a place to call home. Sean is torn between his loyalty to his girlfriend and the possibility of finding something more with her friend, while Ginger's single-minded pursuit to bring down her nemesis only proves that they may be more alike than she thought.Seamlessly woven together, this incredibly powerful and compelling collection of stories chronicles the very real trials of today's teen experience.",
        "Category": " Young Adult Fiction , Social Themes , General",
        "Publisher": "Hyperion Book CH",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Dawn Over Baghdad: How the U.S. Military Is Using Bullets and Ballots to Remake Iraq",
        "Authors": "By Zinsmeister, Karl",
        "Description": "THIS IS A COMPLETELY FRESH, close-up look at the guerilla struggle in Iraq. It is built on weeks spent re-embedded with U.S. soldiers in the most dangerous parts of the Sunni Triangle in early 2004, direct polling of Iraqis, and unmatched reporting on combat raids, interrogations, daily diplomacy, and reconstruction heroics.     It follows the author's \"Boots on the Ground: A Month with the 82nd Airborne in the Battle for Iraq,\" which was the first book from an embedded reporter describing the toppling of Saddam Hussein. Gripping, perceptive, funny, and bluntly honest, \"Boots\" became the most popular chronicle of the hot war in Iraq. Now Karl Zinsmeister has again beaten the pack with this groundbreaking sequel on the counterinsurgency phase of the war. This is a powerful, cliché-smashing, up-to-the-minute report on America's most urgent national struggle, as seen through the eyes of ordinary Iraqis and the U.S. servicemen doing today's dirty work.     \"Dawn Over Baghdad\" takes you into Iraq's urban neighborhoods, rural villages, and guerilla snake pits, and shows exactly how young American soldiers are quietly but inexorably choking off a terrorist insurrection and planting the seeds (sometimes at great personal cost) of a dramatically different Middle East. Zinsmeister brings home a fascinating, intimate, and insightful story missed by the major media: With the quiet cooperation of millions of everyday Iraqis, the U.S. is approaching something historic -- success in a tough guerilla war.      Includes a 32-page section of color photos taken by the author.",
        "Category": " Political Science , Political Ideologies , Democracy",
        "Publisher": "Encounter Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Soupy Saturdays with the Pain and the Great One (Pain and the Great One Series)",
        "Authors": "By Blume, Judy and Stevenson, James (ILT)",
        "Description": "MEET THE PAIN:My sister's name is Abigail. I call her The Great One because she thinks she's so great. Who cares if she's in third grade and I'm just in first?MEET THE GREAT ONE:My brother's name is Jacob Edward, but everyone calls him Jake. Everyone but me. I call him The Pain because that's what he is. He's a first-grade pain. I'll always know exactly what he's thinking. That's just the way it is.These seven warm-hearted stories will give readers a peek at how a brother and sister relate to each other.From the Hardcover edition.",
        "Category": " Juvenile Fiction , Family , Siblings",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Pediatric Environmental Health",
        "Authors": "By Etzel, Ruth Ann (EDT), Balk, Sophie J. (EDT), and Eztel, Ruth A. (EDT)",
        "Description": "Completely revised and expanded, the new 3rd edition is the comprehensive AAP  guide to the identification, prevention, and treatment of pediatric  environmental health problems.From playground  to classroom, at home and across town, environmental hazards are all around us –  an unfortunate fact of modern life.  And  no one is more vulnerable to the adverse health effects these hazards can cause  than our children.  It’s no wonder that  environmental hazards are among parents’ top health concerns for their children.  Yet little time is spent training physicians and other caregivers to recognize,  prevent, and treat ailments resulting from exposure to harmful substances and  environments.   This comprehensive guide puts critical  children’s health information and answers to parents’ questions at your  fingertips.  From asbestos to radiation,  ultraviolet rays, pesticides, asthma, lead, tobacco, childcare and school  environments – plus new chapters on global climate change, plasticizers,  developmental disabilities, environmental disasters, and more – current  information on an exhaustive range of environmental health issues is included.   The 3rd edition  features 59 topic-based chapters including the addition of 18 new  chapters. Contents:-  Background:  Addressing Environmental Health in Primary Care-  History and  Growth of Pediatric Environmental Health-  Children's  Unique Vulnerabilities to Environmental Hazards-  Individual  Susceptibility to Environmental Toxicants-  Taking an  Environmental History and Giving Anticipatory Guidance-  Medical  Laboratory Testing of Body Fluids and Tissues-  Environmental  Measurements Environments-   Preconceptional and Prenatal Exposures-  Built  Environment-  Child Care  Settings-   Schools-  Waste  Sites-  Work  Places-  Environmental  Health Considerations for Children in Developing Nations, and Implications for  Immigrants and Adoptees Food and  Water-  Breast  Milk-  Phytoestrogen  and Contaminants in Infant Formula",
        "Category": " Medical , Pediatrics",
        "Publisher": "Amer Academy of Pediatrics",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Expert in Murder, An: A Josephine Tey Mystery (Josephine Tey Mysteries, 1)",
        "Authors": "By Upson, Nicola",
        "Description": "March 1934. Revered mystery writer Josephine Tey is traveling from Scotland to London for the final week of her play Richard of Bordeaux, the surprise hit of the season, with pacifist themes that resonate in a world still haunted by war. But joy turns to horror when her arrival coincides with the murder of a young woman she had befriended on the train ride—and Tey is plunged into a mystery as puzzling as any in her own works. Detective Inspector Archie Penrose is convinced that the killing is connected to the play, and that Tey herself is in danger of becoming a victim of her own success. In the aftermath of a second murder, the writer and the policeman must join together to stop a ruthless killer who will apparently stop at nothing.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Maryland Selective Service in Peace and War 1940-1947",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "The State of Maryland",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "The Snowman (Harry Hole, Book 7) (Harry Hole Series)",
        "Authors": "By Nesbo, Jo and Bartlett, Don (TRN)",
        "Description": "Internationally acclaimed crime writer Jo Nesbø’s antihero police investigator, Harry Hole, is back: in a bone-chilling thriller that will take Hole to the brink of insanity.Oslo in November. The first snow of the season has fallen. A boy named Jonas wakes in the night to find his mother gone. Out his window, in the cold moonlight, he sees the snowman that inexplicably appeared in the yard earlier in the day. Around its neck is his mother’s pink scarf. Hole suspects a link between a menacing letter he’s received and the disappearance of Jonas’s mother—and of perhaps a dozen other women, all of whom went missing on the day of a first snowfall. As his investigation deepens, something else emerges: he is becoming a pawn in an increasingly terrifying game whose rules are devised—and constantly revised—by the killer.Fiercely suspenseful, its characters brilliantly realized, its atmosphere permeated with evil,The Snowman is the electrifying work of one of the best crime writers of our time.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Knopf Publishing Group",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Cool Stuff and How It Works",
        "Authors": "By Woodford, Chris (EDT), Collins, Luke, Witchalls, Clint, Morgan, Ben, and Flint, James",
        "Description": "Now in paperback! From microchips and iPods to robots in the human bloodstream, Cool Stuff and How It Works takes the reader on an eye-opening journey through the world of modern technology. Tech-savvy kids will love learning all about today's most innovative inventions-where they came from, how they do what they do, and where they might take us in the future.",
        "Category": " Juvenile Nonfiction , Technology , How Things Work-Are Made",
        "Publisher": "DK Children",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Tough Customer: A Novel",
        "Authors": "By Brown, Sandra",
        "Description": "The #1 New York Times bestselling author of Seeing Red “charges her characters and their relationships with electricity” (San Francisco Book Review) in this sizzling, sleep-with-the-lights-on novel of suspense.When a deranged stalker attempts to murder her daughter Berry, Caroline King has no doubts who to contact for help: Berry’s father, the cagey private investigator Dodge Hanley. It’s been thirty years since Dodge last saw Caroline, but the savvy real estate mogul still haunts his dreams. He has a whole bagful of grudging excuses for ignoring Caroline’s call—and one compelling reason to drop everything and fly down to Texas to protect the daughter he’s never met: guilt. As always, Dodge’s perseverance knows no bounds as he teams with a small-town sheriff, but the alarming situation worsens when the stalker claims other victims, leaving a trail of clues lethally pointing toward Berry. And Dodge—a street-smart fighter who has always put his life on the line—realizes that this time, he’s risking his heart as well...",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Sizzling Sixteen (Stephanie Plum Novels, 16)",
        "Authors": "By Evanovich, Janet",
        "Description": "Trenton, New Jersey, bounty hunter Stephanie Plum has inherited a \"lucky\" bottle from her Uncle Pip. Problem is, Uncle Pip didn't specify if the bottle brought good luck or bad luck….BAD LUCKVinnie, of Vincent Plum Bail Bonds, has run up a gambling debt of $786,000 with mobster Bobby Sunflower and is being held until the cash can be produced. GOOD LUCKBeing in the business of tracking down people, Stephanie, office manager Connie, and file clerk Lula have an advantage in finding Vinnie. BAD LUCKFinding a safe place to hide Vinnie turns out to be harder than raising $786,000. Not even local stoner Walter \"Moon Man\" Dunphy is up to the task.GOOD LUCKBetween a bonds office yard sale, Mooner's Hobbit-Con charity event, and Uncle Pip's lucky bottle, they just might raise enough money to save the business, and Vinnie, from ruin.BAD LUCKSaving Vincent Plum Bail Bonds means Stephanie can keep her job as a bounty hunter—and keep hunting down a man wanted for polygamy, a turnpike toilet paper bandit, and a drug dealer with a pet alligator named Mr. Jingles.GOOD LUCKBeing a bounty hunter comes with its perks, namely Trenton's hottest cop, Joe Morelli, and the dark and dangerous security expert, Ranger. With any luck at all, Uncle Pip's lucky bottle will have Stephanie getting lucky—the only question is…with whom?Janet Evanovich's Sizzling Sixteen…so hot, the pages might spontaneously combust!",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Encyclopedic Handbook of Private Practice",
        "Authors": "By Margenau, Eric (EDT)",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Gardner Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Tree House Trouble (The Cul-de-Sac Kids #16) (Book 16)",
        "Authors": "By Lewis, Beverly and Huntington, Janet (ILT)",
        "Description": "Abby and Stacy build a tree house and decide not to share it with the other Cul-de-sac Kids, even if they have to form a new all-girls club to get their way",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "SCIENCE EXPLORER 2E ANIMALS STUDENT EDITION 2002C (Prentice Hall Science Explorer)",
        "Authors": "By Padilla, Michael J., Miaoulis, Ioannis, Cyr, Martha, and Jenner, Jan",
        "Description": "",
        "Category": " Juvenile Nonfiction , Science & Nature , Zoology",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Search & Find: Where Are They?",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Understanding the European Union: A Concise Introduction",
        "Authors": "By McCormick, John",
        "Description": "An immediate success on first publication, Understanding the European Union provides a broad-ranging but concise introduction to the EU, covering all major aspects of European integration. This revised and updated new edition includes fuller coverage of policy and policy making and of theoretical approaches to the study of the EU.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Palgrave Macmillan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Creative Digital Photography: A Practical Guide to Image Enhancement Techniques",
        "Authors": "By Peter Cope",
        "Description": "",
        "Category": "",
        "Publisher": "Carlton Books Sevenoaks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Southwestern Cooking",
        "Authors": "By Richardson, Jo",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Mad Mary: A Bad Girl from Magdala, Transformed at His Appearing",
        "Authors": "By Higgs, Liz Curtis",
        "Description": "Drawing from more than one hundred sources, the author paints a portrait of the real Mary Magdalene of the Bible, following her unique story of deliverance and devotion, despair and recovery. By the author of Bad Girls of the Bible.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "WaterBrook Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "how to garden (A practical encyclopedia of gardening techniques with step-by-step photographs)",
        "Authors": "By Jonathoan Edwards",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Philadelphia Cream Cheese Classic Recipes",
        "Authors": "By",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Today's Dictionary of the Bible",
        "Authors": "By Bryant, T. A. (EDT)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Rocks and Minerals (Eye Wonder)",
        "Authors": "By Bingham, Caroline",
        "Description": "Dig down and discover amazing treasures, right under your feet! In Eye Wonder: Rocks and Minerals see how rocks form, learn the difference between igneous, metamorphic, and sedimentary rocks, discover precious gems, metals and crystals, find out what minerals are and the hundreds of uses we have for them.A precursor to DK's awarding-winning Eyewitness series, Eye Wonder was specially developed for children aged five plus, featuring astonishing photography exhibiting subjects within their natural setting, offering a whole new level of information through powerful images. The vocabulary is accessible to young readers, with the meanings of new, subject-related words clearly explained.Reissued with a new jacket and eight new pages of mazes, look-and-finds, quizzes, and interactive activities, the new generation ofEye Wonder will capture readers' imaginations and give them a reason to delve even deeper into each book.Supports the Common Core State Standards.",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , Rocks & Minerals",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Classic Starts®: Anne of Green Gables (Classic Starts® Series)",
        "Authors": "By Corvino, Lucy (ILT) and Olmstead, Kathleen",
        "Description": "Following Sterling's spectacularly successful launch of its children's classic novels (240,000 books in print to date),comes a dazzling new series: Classic Starts. The stories are abridged; the quality is complete. Classic Starts treats the world's beloved tales (and children) with the respect they deserve--all at an incomparable price.Lucy Maud Montgomery's classic tale, with its engaging heroine and evocative description of the Prince Edward Island landscape, never fails to delight youngsters. When Matthew Cuthbert goes to the train station to pick up the orphan he and his sister Marilla plan to adopt, he expects to meet a boy who can help on the family farm. Instead it's Anne--a talkative, dreamy, red-haired, freckle-faced 11-year-old little girl who transforms the Cuthberts' life forever and fills it with love and joy.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Union Square Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "More Creative Window Treatments Including Curtains, Shades & Top Treatments",
        "Authors": "By Home Decorating Institute (COR)",
        "Description": "",
        "Category": "",
        "Publisher": "The Home Decorating Institute",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Southern Living 1999 Garden Annual",
        "Authors": "By",
        "Description": "Month-by-month articles cover houseplants, lawn care, vegetables, flowers, trees and landscape design",
        "Category": " Gardening , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "THE RUNAWAY BRIDE",
        "Authors": "By Sandra Chastain",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam 1999/99",
        "Price Starting With ($)": "5.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Through a Brief Darkness",
        "Authors": "By Peck, Richard",
        "Description": "Forced to ask herself whether her father was indeed a criminal, Karen comes to rely on her own instincts and judgment as her situation becomes increasingly terrifying.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Viking Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1973"
        }
    },
    {
        "Title": "No Bones About It - Katie Kazoo Switcheroo",
        "Authors": "By NancyKrulik",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset&Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Scrapbooking the School Years",
        "Authors": "By Memory Makers Books (COR)",
        "Description": "Scrapbooking your kids from preschool to high schoolWhether they're happily singing songs and learning the alphabet or busily typing a history paper and computing algorithms, kids are making school-day memories that will last a lifetime. It may seem they trade picture books and crayons for textbooks and newly-sharpened pencils in the blink of an eye, but armed with a camera, a little creativity andScrapbooking the School Years, you've got all you need to document, record and remember the excitement and nostalgia.Awaiting inside:Stellar school-day scrapbook pages encompassing back-to-school rituals, daily routines, special activities and events, accomplishments and milestones ranging from the pre-school years to high schoolA variety of fresh styles and varying levels to suit every scrapbookerCool paper crafting projects including a color ring, growth chart, locker bulletin board, report card file folder and embellished notebooksTips and tricks for including memorabilia and journalingIllustrated step-by-step instructions for creative techniquesWith Scrapbooking the School Years, you'll be inspired to capture the life and times of your little scholar with sentiment, style and sass. Discover a treasure trove of endless possibilities sure to stir your imagination and capture your heart.",
        "Category": " Crafts & Hobbies , Scrapbooking",
        "Publisher": "Memory Makers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Ben Franklin, an affectionate portrait",
        "Authors": "By Nelson Beecher Keyes",
        "Description": "",
        "Category": "",
        "Publisher": "Hanover House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "The Women's Health Diet, the 6-week Plan to Shrink Your Belly and Sculpt Your New Body!",
        "Authors": "By stephen perrine",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Let's Read with Dora! (Dora the Explorer) (Ready-To-Read: Dora the Explorer)",
        "Authors": "By Aikins, Dave (ILT) and Inches, Alison",
        "Description": "Wealthy American actress Candi Maitlin needs a bodyguard to escort her to an orphanage where she wants to adopt a little girl. While trying to reconnect with April in South Africa, Tennyson agrees to help Candi, not realizing the mess he is walking into. Months later, Candi is married to a South American billionaire and the couple asks Tennyson to act as a bodyguard at the child’s birthday party. But something terrible goes wrong and the little girl is kidnapped. Fired by Candi and her husband, Tennyson is overwhelmed with guilt and can’t let the case rest. Soon he has discovered that the kidnappers are part of a Pan-African gang who operate in the United States. As Tennyson struggles to unravel the lies that surround the case—including the ones Candi tells him—the baby’s life is at stake. This thrilling page-turner will have readers waiting with bated breath to discover what lies behind the secrecy and causes men and women to risk jail (or worse) to gain power and wealth—even if it means risking the life of an innocent child.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Health Fitness Instructors Handbook",
        "Authors": "By Howley, Edward T. and Franks, B. Don",
        "Description": "This reference for health and fitness professionals discusses the fundamentals of fitness, exercise physiology, and biomechanics, and represents recent advances in physical fitness.  Representing the 2000 ACSM guidelines, the book also serves as a study guide for those preparing for heath fitness instructor certification exams.  Howley (University of Tennessee, Knoxville) and Franks (University of Maryland, College Park) offer advice on developing meaningful and safe fitness program, with particular attention to the needs of special populations. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Medical , Allied Health Services , General",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "7.91",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Father to Nobody's Children",
        "Authors": "By Fessenden, David E.",
        "Description": "",
        "Category": "",
        "Publisher": "Christian Literature Crusade",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Wild Turkey: Expert Advice for Locating and Calling Big Gobblers (The Complete Hunter)",
        "Authors": "By Clancy, Gary",
        "Description": "Although uncontrolled hunting once reduced turkey numbers, today there is a resurgence of the wild turkey population. This book will help you understand the wild turkey's habits and teach techniques you'll need to hunt them.  You'll learn about the equipment you'll need, several types of turkey calls, and how to ensure a clean kill. A day in the woods can be miserable for the ill-equipped hunter, and so we have a section on accessories that can help you select gear to enhance your hunting experience.   Once the gobbler has been collected, you'll learn how to preserve your trophy and even how to dress and cook it.   Concise information and beautiful, detailed photographs make this a wild turkey reference you'll want on your shelf.",
        "Category": " Sports & Recreation , Hunting",
        "Publisher": "Cool Springs Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Advanced Whitetail Hunting (The Complete Hunter)",
        "Authors": "By Clancy, Gary and Spomer, Ron",
        "Description": "The diligent hunter, who finds his buck and learns its territory and habits before hunting season opens, has a huge advantage over other hunters.This helpful resource is filled with detailed illustrations, charts, maps, and hundreds of color photos to show you how to outwit wary bucks.The main difference between this book and others, is that Advanced Whitetail Hunting contains secrets from some of North America's most successful trophy buck hunters. If you're tired of average deer and want to set your sights on a record-book buck -- this book is for you.Learn how to eliminate human odors that give you away. Find out what special areas you can hunt that most casual hunters will avoid, leaving the big deer for you. See how to lure a mature deer with rattling, calling and decoying.The photos and illustrations show you the techniques that will take your hunting to the next level.",
        "Category": " Nature , Animals , Fish",
        "Publisher": "Cool Springs Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Glacial Geology and the Pleistocene Epoch",
        "Authors": "By Flint, Richard Foster",
        "Description": "",
        "Category": "",
        "Publisher": "Wiley",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1949"
        }
    },
    {
        "Title": "501 Must Read Books",
        "Authors": "By Beare, Emma (EDT)",
        "Description": "501 Must Read Books\" is like the wisest, cleverest, best-read and most trusted friend you have ever had. The recommendations for inclusion in this comprehensive book were made by a bibliophile and writer with a peerless reputation. This comprehensive guide will inspire you to read more widely than you could have imagined and to explore the previously untrodden aisles in your bookstore or library.",
        "Category": " Literary Criticism , General",
        "Publisher": "Bounty Books",
        "Price Starting With ($)": "7.92",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "What's So Amazing About Grace? Participant's Guide",
        "Authors": "By Yancey, Philip",
        "Description": "In 1998, What’s So Amazing About Grace? was chosen as the Gold Medallion Book of the Year. Stamped with Philip Yancey’s journalistic gift for inquiry and personal passion for truth, this provocative best-seller has challenged and inspired more than half a million readers worldwide with a vision of the life–Experience the Impact of Grace It’s one thing to talk about grace; it’s another to taste its power. What’s So Amazing About Grace? ZondervanGroupware takes you and your study group for interactive, gut-level encounters with radical, life-changing grace. Through candid video interviews, Philip Yancey integrates true-life faces and experiences with 10 POWERFUL SESSIONS that will rock your preconceptions, get you thinking and talking, and help you discover together why grace is more amazing than you’ve ever dreamed.This Participant’s Guide will help you not only gain a better understanding of what grace is and why it is so precious, but also integrate it into your life. Engaging questions, provocative Bible studies, and lively discussions are just part of the package. You’ll also be challenged to look for grace where it counts the most: in your own character and personal life.If you’re ready to discover grace as more than just a fluffy concept, buckle your seat belt. You’re about to take a journey to the radical heart and soul of Christianity. The next life grace changes could be yours.",
        "Category": " Religion , Reference",
        "Publisher": "HarperChristian Resources",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "An Inconvenient Truth: The Crisis of Global Warming",
        "Authors": "By Gore, Albert",
        "Description": "Former Vice President Al Gore's New York Times #1 bestselling book is a daring call to action, exposing the shocking reality of how humankind has aided in the destruction of our planet and the future we face if we do not take action to stop global warming. Now, Viking has adapted this book for the most important audience of all: today's youth, who have no choice but to confront this climate crisis head-on.Dramatic full-color photos, illustrations, and graphs combine with Gore's effective and clear writing to explain global warming in very real terms: what it is, what causes it, and what will happen if we continue to ignore it. An Inconvenient Truth will change the way young people understand global warming and hopefully inspire them to help change the course of history.",
        "Category": " Young Adult Nonfiction , Science & Nature , Environmental Science & Ecosystems",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The World: Afghanistan to Zimbabwe (Rand McNally)",
        "Authors": "By Rand McNally (COR)",
        "Description": "Leading off the atlas is a 24-page section entitled World Superlatives and Information Tables. Colorful and highly illustrated, it provides the geographic information people seek most often: the world's longest rivers, highest mountains, largest lakes, most-populous countries, and many more fascinating facts. Next comes The World, Continents, and Oceans, 16 pages of highly detailed, beautifully rendered political and portrait maps offering an overview of the world's geography, topography, and political divisions. The core of the atlas is the 208-page Gazetteer of the Countries of the World, in which all of the world's countries are presented in alphabetical order. Global Locator Maps establish the global setting of each country. Articles present concise, substantive descriptions of each country. Regional Locator Maps show the location of each country in relation to neighboring countries and major bodies of water. Reference Maps of individual countries present a wealth of geographic information, including: country boundaries; principal cities and towns; railroads; terrain elevations and depths; and major geographic features such as rivers, lakes, mountain ranges, and deserts. Size Comparison Maps show how each country compares in size to the United States. Population and GDP Comparison Bar Graphs compare the subject country's population and Gross Domestic Product to those of the U.S. Ethnic Group Pie Charts show the ethnic makeup of the subject country's populace. Urban/Rural Bar Graphs show how each subject country's population breaks down with regard to urban dwellers and rural dwellers. Full-color photographs offer beautiful and fascinating glimpses of the landscapes, cityscapes, and peoples of the world's countries.",
        "Category": " Reference , Atlases, Gazetteers & Maps",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "How and Why Spiders Spin Silk (How and Why Series)",
        "Authors": "By Kupperstein, Joel (EDT), Pascoe, Elaine, and Kuhn, Dwight (PHT)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Animals , Insects, Spiders, etc.",
        "Publisher": "Creative Teaching Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Out of the Wild",
        "Authors": "By Durst, Sarah Beth",
        "Description": "Beware the Wild?it bites. Ever since Julie Marchen helped defeat the fairytale world of the Wild, life?s been pretty much back to normal. That is, as normal as life can be for a girl whose mom is Rapunzel. Yes, that Rapunzel. Then the Wild mysteriously releases Zel?s prince (Julie?s dad!)?a rescue-minded hero who crashes full-speed ahead into the 21st century! (YOU try teaching a 500-year-old prince to use a seatbelt.) Julie?s over the moon, but when a wicked Fairy Godmother kidnaps Sleeping Beauty and reawakens the Wild, Julie and her dad set off on an action-packed adventure to save the distressed damsel? and the world. If they can?t, they?ll spend eternity in a fairytale.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Razorbill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Alien in the Classroom (Nancy Drew Notebooks #23)",
        "Authors": "By Keene, Carolyn and Accardo, Anthony (ILT)",
        "Description": "Nancy and her friends laugh at the notion, purveyed in the National Snooper magazine, that the queen of planet Zagon has arrived on Earth, until the next day, when their substitute teacher turns out to be a Mrs. Zagon. Original.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Dork on the Run",
        "Authors": "By Gorman, Carol",
        "Description": "A Dork for President?   Here at his new school, with his new friends, Jerry Flack is shedding his former dorky image and feeling better about himself -- almost normal, even. So when he first thinks about running for class president, it seems like a great idea. But before Jerry can even decide to run, he discovers that he already has an opponent: someone willing to do almost anything to convince the whole class that no one wants a dork for president. How can Jerry run for president if it means risking a return to the depths of dorkdom?",
        "Category": " Juvenile Fiction , Social Themes , Self-Esteem & Self-Reliance",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    }
]