[
    {
        "Title": "Wilderness: The Lost Writings of Jim Morrison, Volume 1",
        "Authors": "By Morrison, Jim",
        "Description": "Compiled from the literary estate of the singer who brought a wildly lyrical poetry of the damned to the world of rock 'n' roll. Includes unpublished poems, drawings, photos, and a candid self-interview.",
        "Category": " Music , Genres & Styles , Rock",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Pacific Defense: Arms, Energy, and America's Future in Asia",
        "Authors": "By Calder, Kent E.",
        "Description": "Northeast Asia's stunningly successful political economy threatens to become a military danger zone - with global implications. In Pacific Defense, Kent E. Calder, director of the Program on U.S.-Japan Relations at Princeton's Woodrow Wilson School, shows how a combination of high-speed economic growth, impending energy shortages, and political insecurity could well provoke an accelerating arms buildup and deepening geopolitical rivalries. Here he explains the urgent need for a strategic, far-sighted American role in defusing these dangerous possibilities.Calder analyzes the risks to regional stability of Asia's continuing struggle for offshore oil, and the subtle dangers that regional energy dependence on the Middle East may bring. He also points to the possible links between efforts to acquire civilian nuclear power and the potential for nuclear armament.Political uncertainty casts deep shadows over Asia's key nations, as experienced leaders pass from the scene and popular frustrations mount, from the large cities of China to the crucial U.S.-Japan island military bastion of Okinawa. Calder provides a dynamic overview of where each country is headed politically and describes the role that the United States can play in these developments, from improving security relations with Japan to studying alternate sources of energy for China to resolving nuclear arms issues in North Korea.",
        "Category": " Political Science , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Venus Envy",
        "Authors": "By Brown, Rita Mae",
        "Description": "Now Rita Mae Brown, author of the bestselling classic Rubyfruit Jungle, returns with her most wonderfully irreverent and thoroughly entertaining novel yet. What happens when a wildly successful Southern belle inadvertently tells the truth about her life to her family, her friends, her lover, and herself?At thirty-five, Mary Frazier Armstrong, called \"Frazier\" by friends and enemies alike, is a sophisticated green-eyed blonde with a thriving art gallery, a healthy bank balance, and an enviable social position. In fact, she has everything to live for, but she's lying in a hospital bed with a morphine drip in her arm and a life expectancy measured in hours. \"Don't die a stranger\" Mandy Eisenhart, her assistant at the gallery, says on her last hospital visit. \"Tell the people you love who you are, or write them.\" And so, as her last act here on earth, Frazier writes letters to her closest family and friends, telling them exactly what she thinks of them and, since she will be dead by the time they receive the letters, the truth about herself: She's gay.The letters are sent. Then the manure hits the fan in Charlottesville, Virginia ... because Frazier Armstrong wakes up the next morning to hear her doctor explaining that it's all been a mistake. Frazier can look forward to a long, happy life. But if this formerly dutiful daughter isn't dying, she certainly seems to be facing a descent into hell: Her mother, Libby, committee woman extraordinaire,is throwing a hissy fit; her best friend, the gay hunk Billy Cicero, is cutting her dead; her former lover, Ann, is having hysterics now that \"everyone is going to know\"; and her gorgeous, charming brother Carter whose two favorite activities are getting drunk and getting laid, is gleefully spreading the word that his can-do-no-wrong sister is a dyke.Yet Frazier soon realizes she's spent her whole life steeling herself against people, and hiding - and not just because she is gay. After three decades of having \"a near-life experience,\" she is determined to make a new beginning - as a brash, brazen, and totally irresistible woman who will raise the act of coming out of the closet into an art form.Rita Mae Brown once told an interviewer \"Next time anyone calls me a lesbian writer I'm going to knock their teeth in. I'm a writer and I'm a woman and I'm from the South and I'm alive, and that is that.\" Frazier Armstrong couldn't have put it better.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "More Hand Shadows",
        "Authors": "By Bursill, H.",
        "Description": "",
        "Category": "",
        "Publisher": "Dover Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1971"
        }
    },
    {
        "Title": "Love for Lydia",
        "Authors": "By Bates, H. E.",
        "Description": "Lydia Aspen, a lonely English teenager of the 1930s, learns that men are intrigued by her and seeks to hide her vulnerability by bending them to her frivolous will",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Black Star Rising",
        "Authors": "By Pohl, Frederik",
        "Description": "When an alien spaceship demands a conference with the President of the United States, the Chinese rulers of North and South America send them a rice grower from Mississippi instead",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Encyclopedia Brown Finds the Clues (Book 3)",
        "Authors": "By Sobol, Donald J.",
        "Description": "The essential facts of ten mysteries are presented, giving the reader the opportunity to solve the cases before examining the boy detective's solutions",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1982"
        }
    },
    {
        "Title": "Homeopathy",
        "Authors": "By Vithoulkas, George",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice-Hall Canada, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "Finnegan's Week",
        "Authors": "By Wambaugh, Joseph",
        "Description": "No one portrays crime and cops with the outrageous humor and vibrant color of Joseph Wambaugh. Now, in a timely new novel, the bestselling author sends an unforgettable trio on a mission to make sense of a seemingly irrational conspiracy involving deadly toxic waste and a theft of U.S. Navy goods.A master of the skewering one-liner, and at that awkward age between mid-life crisis and catastrophe, San Diego police detective Finbar Brendan Finnegan is also an aspiring actor whose agent can't even get him an audition for a cheesy TV series. And the thrice-divorced, cynical police veteran thinks he's seen it all until he faces a killer more deadly than any psychopath: a fifty-five-gallon drum of deadly chemicals.That's what two disgruntled truckers are hauling for a toxic waste disposal company owned by yacht club playboy Jules Temple, an amoral practitioner of extortion, forgery, and much more. With their boss's entrepreneurial spirit, the two haulers decide to steal two thousand pairs of shoes from the U.S. Navy to sell on the Mexican black market, but once they cross south of the border their impulsive scheme goes haywire and results in horror and death.Sorting out various suspects, as well as EPA documents required for toxic chemical shipments, Fin joins forces with a pair of extraordinary female investigators. Nell Salter, an environmental crimes cop from the District Attorney's Office, is a fortyish beauty whose nose was broken by the only man she ever married, a mistake she'll not make again, or so she vows to even more unlucky-in-love Fin Finnegan, who hasn't married anybody since he's \"matured.\" Then there's U.S. Navy investigator Bobbie Ann Doggett of Kenosha, Wisconsin, nicknamed \"Bad Dog\" by her navy colleagues. This Bad Dog is a vivacious twenty-eight-year-old who falls in puppy love with Detective Fin Finnegan, that older gentleman of the Clinton-Gore generation. Finnegan is equally smitten by the young sailor, Much to the disgust of Nell Salter, who calls him a \"Peter Pan policeman.\"Sparks, fur and insults fly when this unique trio of investigators sets out to make sense of twisted schemes and murderous intentions involving environmental crime and U.S. Navy property, while disturbing personal feelings keep getting in the way. From millionaires' yachts in San Diego harbor to biker bars teeming with violence; from the machinations of evil and greed in the toxic waste business to the exotic killing streets of Tijuana, Finnegans' Week uncoils in an electrifying and unexpected finale. This is Joseph Wambaugh at his rousing best!",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "You're Not What I Expected: Learning to Love the Opposite Sex",
        "Authors": "By Young-Eisendrath, Polly",
        "Description": "What happens when the romance fades? Are lovers inevitably fated to disillusionment? Jungian analyst Polly Young-Eisendrath's You're Not What I Expected suggests a new and hopeful ending to the story about love between the sexes.A licensed psychologist in private practice, Dr. Young-Eisendrath follows four struggling couples through therapy and locates the psychological predicament at the root of failure-bound relationships: Actual lovers either don't correspond to their partners' idealized \"dream lovers\" or they exhibit traits reminiscent of previous unhappy experiences.Husbands ultimately fail to grow into the model \"Hero\" or they resemble their wives' \"Terrible Fathers.\" Wives who abandon the role of \"Maiden Lover\" metamorphose into a twentieth-century witch, the \"Terrible Mother.\" Polly Young-Eisendrath points the way to \"mature dependence\": an intimacy built on equality. You're Not What I Expected shows couples that dialogue is at the heart of friendship and trust.",
        "Category": " Psychology , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Walks, Walls & Patio Floors",
        "Authors": "By Atkinson, Scott (EDT)",
        "Description": "An illustrated guide to building garden walks and walls from bricks, asphalt, concrete, stones, tiles, and wood",
        "Category": " Technology & Engineering , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Lost Get-Back Boogie",
        "Authors": "By Burke, James Lee",
        "Description": "Recently paroled from prison, Ivy Paret settles in with fellow ex-convict Buddy Riordan and Riordan's family on sprawling ranch in Montana and becomes drawn into a tragic conflict involving the family and their neighbors",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Henry Holt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Down on the Farm with Grover: Featuring Jim Henson's Sesame Street Muppets",
        "Authors": "By Ray Sipherd",
        "Description": "When Grover takes care of his uncle's farm for the summer, he discovers being a farmer isn't as easy as he thought.",
        "Category": "",
        "Publisher": "Western Publishing / Children's Television Workshop",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Jewish Family and Life: Traditions, Holidays, and Values for Today's Parents and Children",
        "Authors": "By Abramowitz, Yosef I. and Silverman, Susan",
        "Description": "Jewish Family and Life: Traditions, Holidays, and Values for Today's Parents and Children has become the definitive book for parents to turn to for sound advice on important and current parenting issues.  It dispenses invaluable information that is relevant to Jewish families today, whether the family has a mixed marriage, two parents, a single parent, or adoptive parents.  The book's three parts--Traditions, Holidays and Values--investigate contemporary issues in raising children and show concrete ways in which Judaism can play a practical role in enriching a family's spiritual and moral education.  Each chapter includes lively, hands-on activities that you can do with your kids and simultaneously instill vital cultural and religious education.  Vetted by a prestigious advisory board that is co-chaired by Nobel Prize-winner Elie Weisel, this book with help unify the family and re-establish rich traditions that have been lost over the generations.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Shadow Puppets (The Shadow Series)",
        "Authors": "By Doel, Mark and Shardlow, Steven",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Decorative Painting 1-2-3",
        "Authors": "By Home Depot (COR) and Wing, Charles (EDT)",
        "Description": "Featuring a vast array of decorative painting techniques that will enhance any room, a do-it-yourself guide provides practical advice, tips, and techniques for paint selection, prep, and cleanup. 75,000 first printing.",
        "Category": " House & Home , Decorating",
        "Publisher": "Home Depot",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Overcoming Hurts & Anger: Finding Freedom from Negative Emotions",
        "Authors": "By Carlson, Dwight L.",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "These Golden Days (The Innocent Years, Book 2)",
        "Authors": "By Funderburk, Robert",
        "Description": "Jessie Temple moves to Hollywood to begin a career as a singer, while her father rejoins the Marines during the Korean War and her mother copes with her husband's absence",
        "Category": " Fiction , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "10,001 Food Facts, Chefs' Secrets, and Household Hints",
        "Authors": "By Bader, Myles",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "29.95",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Real Boys' Voices: Boys Speak out about Drugs, Sex, Violence, Bullying, Sports, Girls, School, Parents, and So Much More",
        "Authors": "By Pollack, William S. and Shuster, Todd",
        "Description": "What real boys have to say:\"A lot of people use words like 'psycho' or 'wacko' to refer to people who are feeling glum or think they might want to take their own life. I think these sorts of slang terms create further isolation in a teen, and that's not what you want to do to a teen who already feels alone\" —Alexander, 18, from a small town in the South\"A guy is supposed to be strong, tall, and fast and have the qualities of an ideal athlete. At the same time he's supposed to be smart. He's expected to be nearly perfect.\" —Chandler, 14, from a suburb in the Northwest\"What I hate about this school is that I am being picked on in the halls and just about everywhere else.\" —Cody, 14, from a suburb in New EnglandIn Real Boys, Dr. William Pollack explored the issues that most boys in our nation face today. In this fascinating follow-up bestseller, Pollack goes right to the source: boys ages 10 to 20-evoking the secret struggles and passions of America's adolescent males in their own words. Their voices are searingly honest and eager to be heard, revealing how society's outdated expectations force them to mask their feelings of isolation, depression, longing, love, and hope. We hear from boys and young men in big cities and small towns-including survivors of the Columbine High School massacre-who share compelling, extrordinarily candid stories about bullying, drugs, sports, school, parents, sex, love, and much more. Pollack also offers ways to start a dialog and illustrates through templates what to do in many situations. This is an eye-opening book for teenage boys and girls, but-with its insights and strategies for dealing with their issues-especially invaluable for all the people in their lives.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Games to Play With Babies",
        "Authors": "By Silberg, Jackie",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "Gryphon House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Breakout Principle: How to Activate the Natural Trigger That Maximizes Creativity, Athletic Performance, Productivity and Personal Well-Being",
        "Authors": "By Proctor, William and Benson, Herbert",
        "Description": "Would it surprise you to learn that to solve a seemingly unsolvable problem, you need to get up and leave the room? A walk in the woods will help you finish your novel? Humming can make you a better tennis player? Or completely giving up is the way to succeed?In The Breakout Principle, the bestselling author of The Relaxation Response delivers the ultimate self-help principle -- simple instructions to activate a powerful biological trigger that converts conflict and confusion into clarity and extraordinary performance, a state athletes refer to as \"the zone.\"More than three decades ago, Dr. Herbert Benson of the Harvard Medical School began research into why some people are devastated by stress while others thrive, turning it into brilliant achievement. Now The Breakout Principle reports the discovery of an easy-to-access inner switch that increases mental function, enhances creativity and productivity, maximizes athletic performance, and enriches spiritual life. The same internal mechanism that improves a tennis serve or golf putt strengthens your speaking skills, makes you a better negotiator, and fosters inner peace and belief.Dr. Benson and coauthor William Proctor explain the cutting-edge science behind the phenomenon in accessible language, clearly describe the four distinct phases of the Breakout, and provide simple, step-by-step instructions on how to activate the Breakout \"trigger.\" Compelling case histories and information on how to incorporate Breakouts into daily life are woven throughout the book.Dr. Benson's previous discoveries have helped millions reduce the harmful effects of stress. The Breakout Principle now reveals how to maximize your untapped abilities and powers.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Left-Brain Finance for Right-Brain People",
        "Authors": "By Monroe, Paula",
        "Description": "",
        "Category": "",
        "Publisher": "Sourcebooks Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Superleadership",
        "Authors": "By Sims, Henry P. and Manz, Charles C.",
        "Description": "",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Murder in the Rose Garden",
        "Authors": "By Roosevelt, Elliott",
        "Description": "When a seductive blackmailer is found murdered in the White House's Rose Garden and the suspects include several high-ranking politicians, the redoubtable Mrs. Roosevelt assists the police in their efforts",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Certain Prey",
        "Authors": "By Sandford, John",
        "Description": "",
        "Category": "",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Bella Tuscany: The Sweet Life in Italy",
        "Authors": "By Mayes, Frances",
        "Description": "A lovely sequel to the best-selling Under the Tuscan Sun returns to the idyllic Italian countryside as the author settles into her new life, offering authentic Tuscan recipes and intimately portraying the local people and the environment. 125,000 first printing. $175,000 ad/promo.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Broadway",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Period Style",
        "Authors": "By Gilliatt, Mary and Wilhide, Elizabeth",
        "Description": "Demonstrates how to restore or redecorate a home to particular period specifications, including advice on how to recreate authentically Empire, Art Deco, Modernist and other period styles",
        "Category": " Art , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Tomcat in Love: A Novel",
        "Authors": "By O'Brien, Tim",
        "Description": "A CLASSIC FROM THE NEW YORK TIMES BESTSELLING AUTHOR OF THE THINGS THEY CARRIEDIn this wildly funny, brilliantly inventive novel, Tim O'Brien has created the ultimate character for our times. Thomas Chippering, a 6'6\" professor of linguistics, is a man torn between two obsessions: the desperate need to win back his former wife, the faithless Lorna Sue, and a craving to test his erotic charms on every woman he meets.But there are complications, including Lorna Sue's brother, Herbie, with whom she has an all-too-close relationship, and the considerable charms of Chippering's new love, the attractive, and of course already married, Mrs. Robert Kooshof, who may at last satisfy Chippering's longing for intimacy.In Tomcat in Love, Tim O'Brien takes on the battle of the sexes with astonishing results. By turns hilarious, outrageous, romantic, and deeply moving, this is one of the most talked about novels in years: a novel for this and every age.",
        "Category": " Fiction , Literary",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Copper Beech",
        "Authors": "By Binchy, Maeve",
        "Description": "Carved on the trunk of the mighty copper beech that embraces the school yard in Shancarrig are declarations of love, hope, and identity - the youthful dreams of the children who played there. Now grown, yet shaped by their years in the schoolhouse, they lead different lives. The Copper Beech is about eight of these dreamers.From Ryan's Hotel to Barna Woods, where the gypsies came each year, from Nellie Dunne's sweet shop to Father Gunn's church, the tenor of life in this small Irish village is outwardly placid and uneventful. Some, like Nessa Ryan, in search of passion, would say deadly dull. But behind the calm exterior, serenity fades into unexpected drama: Maddy Ross has a secret love; Eddie Barton, a surprising friendship; and the Darcys, the glamorous newcomers, find a curious partner in poor Maura Brennan.In Shancarrig, where the river runs around the great rock for which the town is named, human life flows in all its variety. Lives intertwine just as names crisscross on the trunk of the copper beech. At the cottages where the Dunnes live in poverty; the grand house of Leo Murphy; the Kellys', near the school; Dr. Jims's, on The Terrace - nothing is as it seems. With humor, warmth, and a ruthless eye for the ironies of self-delusion, Maeve Binchy uncovers the secrets hidden in each person's heart, showing us that extraordinary stories can be found anywhere, if only one knows where to look.",
        "Category": " Fiction , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Stone Kiss (Peter Decker & Rina Lazarus)",
        "Authors": "By Kellerman, Faye",
        "Description": "A brutal homicide three thousand miles away has just shattered the tranquility of Lt. Peter Decker's household. The frantic phone call sends him and his wife, Rina, on a plane east to the home of Decker's half brother, a rabbi whose brother-in-law's naked body was found in a sleazy Manhattan hotel room. Even more disturbing: the dead man's fifteen-year-old niece - and possibly the last person to see him alive - has disappeared, leaving her family crazed with worry about her safety.The shocking crime propels Decker onto the streets of a city he hasn't walked in ten years, into an alien environment where his resources quickly run dry and the desperate hours pass without results. With little recourse, Decker is forced into New York's underbelly, seeking help from amoral souls who consider life as expendable as pocket change.Obsessed with his mission to find the girl, Decker follows a labyrinthine trail of cover-ups and lies, of vile deeds and sinister secrets that pit brother against brother. Soon he's questioning the very essence of his faith, battling an unregenerate evil that threatens everything he holds dear - including Rina.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Campbell'S Creative Cooking with Soup",
        "Authors": "By Campbell Soup Company",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Turquoise Boy (Native American Legends)",
        "Authors": "By Cohlene, Terri and Reasoner, Charles (ILT)",
        "Description": "A retelling of a Navajo Indian legend in which Turquoise Boy searches for something that will make the Navajo people's lives easier; includes a brief history of the Navajo people and their customs.",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Troll",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The Private World of Katharine Hepburn",
        "Authors": "By Bryson, John and Hepburn, Katharine",
        "Description": "Presents a collection of one hundred and fifty candid photographs of the legendary actress, taken over the last fifteen years",
        "Category": " Photography , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "7.87",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Burning Angel (Dave Robicheaux Mysteries)",
        "Authors": "By Burke, James Lee and Mulcahy, Pat (EDT)",
        "Description": "At the center of Burning Angel is Sonny Boy Marsallus, a fixer, a gambler, a lender of money to prostitutes who are trying to leave the life. But since Prohibition, the Giacano family has locked up the action in New Orleans and its surrounding parishes. When things get hot for Sonny Boy, he hightails it south of the border for parts unknown in El Salvador and Guatemala.When Sonny resurfaces in New Orleans, Detective Dave Robicheaux of the Iberia Parish sheriff's office couldn't be more surprised - that is, not until Sonny passes him a mysterious notebook for safekeeping that seems to contain dark secrets about his activities in Latin America.Robicheaux must wrestle with secrets closer to home as well when his help is enlisted by the Fontenot family, descendants of sharecroppers, whose claim to land they've lived on for almost one hundred years is jeopardized. Who wants the land so badly? And what of the longtime, clandestine affair between Moleen Bertrand, lord of the manor, and Ruthie Jean Fontenot, now reputed to be a local madam?As Dave determines to find out who's honing in on the Bertrand spread, he puts himself in increasing peril at the hands of local mobsters and a hired assassin with a shady past that intersects with that of Sonny Boy Marsallus.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "By My Side: An Anthology",
        "Authors": "By Roberts, Nora",
        "Description": "From This DayWhen B. J. Clark, manager of the Lakeside Inn, met the new owner, Taylor Reynolds, she was fully prepared to dislike him. She feared—and with good reason—that he planned to transform her lovely, sleepy old hotel into a resort for jet-setters. But when sparks flew between them, B.J. soon found herself torn between her professional antagonism and her growing attraction to the man she had sworn to despise.TemptationSocialite Eden Carlbough didn't expect running a girls' camp to be easy, but she never thought she'd literally be run up an apple tree by the little monsters—nor did she think she'd come crashing down into the capable arms of orchard owner Chase Elliot.  Chase knew he'd caught a windfall when he looked at the woman in his arms. He didn't like being cast as the serpent, but how could he resist when she'd just offered him such forbidden fruit?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Tsar: The Lost World of Nicholas and Alexandra",
        "Authors": "By Kurth, Peter and Christopher, Peter (PHT)",
        "Description": "This splendidly illustrated volume evokes the world of pre-revolutionary Russia on every page and tells the story of the last Romanovs as never before. Peter Kurth, author of Anastasia: The Riddle of Anna Anderson, recreates the private life of the imperial family with great clarity and new insights. He begins the story in 1913, a year of celebrations marking 300 years of Romanov rule, but also the last year before the onset of the Great War, which would bring a shattering end to the dynasty. From there he returns to the childhoods of Nicholas and Alexandra and follows them through their courtship, marriage and coronation to the Siberian cellar where their lives ended.The narrative is effectively complemented by archival images from the imperial family's personal albums and private collections, many of them never before published, matched with present-day color photographs of the palaces and places the Romanovs knew. A special visual section, The Imperial Year, documents the family in their palace outside St. Petersburg, at their seaside retreat in the Crimea, on board the royal yacht in the Gulf of Finland and visiting their hunting lodge at Spala, deep in the forests of Poland.Photographer Peter Christopher also followed the path of the imperial family, and his color photographs range from the splendors of Tsarskoe Selo to the remains of \"The House of Special Purpose\" in Ekaterinburg. The many questions still surrounding the murders that took place in that house are examined by Peter Kurth, and in the book's final chapter he details the recent discovery of the Romanov bones and the DNA tests used to determine their authenticity. The fascinating saga of Anna Anderson, the woman who claimed to be Anastasia, the tsar's youngest daughter, is also included along with a candid picture of the Russian aristocracy in exile.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "8.98",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Handbook for the Soul",
        "Authors": "By Carlson, Richard (EDT) and Shield, Benjamin (EDT)",
        "Description": "A collection of more than thirty essays, never before published, by today's most popular inspirational writers--including Jack Canfield, Robert Fulghum, and Thomas Moore--offers advice on nurturing the spirit. BOMC & QPB.",
        "Category": " Religion , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Uncle John's Bathroom Reader: Plunges into History",
        "Authors": "By Bathroom Readers' Hysterical Society",
        "Description": "Only the trivia gurus at the Bathroom Readers’ Institute could take a dry subject like history and make it so much fun! Uncle John’s Bathroom Reader Plunges into History will open your eyes to ages past and entertain you for ages to come.Whether you’re a history buff, or you just like reading great stories, you’ll see the past in a whole new light after reading Uncle John’s Bathroom Reader Plunges into History. Uncle John uncovers the truth behind some of history’s most persistent myths, flushes out information you were never taught in school, and gives history fans something they can really digest. Since 1987, the Bathroom Readers’ Institute has led the movement to stand up for those who sit down and read in the bathroom (and everywhere else for that matter). With more than 12 million books in print, the Uncle John’s Bathroom Reader series is the longest-running, most popular series of its kind in the world.   Where else could you learn about the 10 most forgotten people in history, mistakes that led to great discoveries, and how a fish had a hand (er, fin) in beating Napoleon? Uncle John rules the world of information and humor, so get ready to be thoroughly entertained. Read all about…   * The short history of underwear* Odd deaths of famous figures* Abe Lincoln, fashion icon* The real Lady Godiva* Royal inbreeds and promiscuous popes* The true story of Braveheart* And much more!",
        "Category": " Reference , Trivia",
        "Publisher": "Portable Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Tribe Apart",
        "Authors": "By Hersch, Patricia",
        "Description": "A former contributing editor to Psychology Today magazine draws on her three years of observation and conversation with a group of teenagers from a common American town to portray today's adolescents as a society unto themselves.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "I'm Still Hungry",
        "Authors": "By Wilson, Carnie and Pearlman, Cindy",
        "Description": "The author shares her experiences following gastric-bypass surgery, including the renewal of her career as a singer and actress, posing for Playboy, and maintaining her weight loss through diet and exercise.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Hay House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Solar age resource book",
        "Authors": "By Anderson, Bruce and McPhillips, Martin",
        "Description": "",
        "Category": "",
        "Publisher": "Everest House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Cloud Nine: A Novel",
        "Authors": "By Rice, Luanne",
        "Description": "What would you do with a second chance at life?Sarah Talbot thought she’d never see another birthday. But against all odds, she beat the illness that could have killed her, reopened her bedding shop, Cloud Nine, and vowed to make the most of a fresh start that few are given. With Thanksgiving approaching, Sarah charters a small plane to take her to Elk Island, a remote spot off the rugged Maine coast where she spent some of her happiest days and where she hopes to reunite with the two most important people in her life. She arrives on the island with pilot Will Burke, a kindred spirit with whom Sarah forges a bond that will give them the courage to confront the past and have faith in the future…no matter how uncertain.Once Sarah thought happy endings occurred only in books; now she believes they can happen for anyone. And as she and Will grow closer, and something unexpectedly real blossoms between them, she has him believing it, too. But is believing it enough? Is even love enough? Can real life be lived on cloud nine? In this stunning novel, New York Times bestselling author Luanne Rice tells a story you will cherish, peopled with indelible characters whose challenges are your own.",
        "Category": " Fiction , Psychological",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Pretend You Don't See Her",
        "Authors": "By Clark, Mary Higgins",
        "Description": "What happens when a young woman, having merely been in the wrong place at the wrong time, is accidentally caught up in a dangerous murder investigation?What happens when she is placed under police protection, forced to give up her identity and move to another part of the country, at least until the killer can be positively identified and apprehended?What happens when in her new life she meets the perfect man, only she can't risk falling in love because she can't tell anyone -- even him, especially him -- who she really is?Pretend You Don't See Her is Mary Higgins Clark's brilliant and terrifying new novel, her fifteenth, and her most chilling and suspense-filled yet. Set in New York and in Minneapolis-St. Paul, it is the story of Lacey Farrell, a young rising star on Manhattan's high-powered and competitive real estate scene.In the course of selling a luxurious skyline coop, Lacey becomes the witness to a murder and hears the dying words of the victim, a woman who is convinced that her attacker was after a journal kept by her daughter up until the day she died in what everyone but her grieving mother believes to have been a tragic accident. Lacey gives the journal to the police, but not before she makes a copy for herself -- an impetuous act that later proves to be almost fatal.Obliged to give up her family, her job, her very identity, Lacey is placed in the witness protection program and sent to live in the Minneapolis-St. Paul area, where she must assume a new life, at least until the killer can be brought to trial. Once there, she meets and quickly finds herself attracted to Tom Lynch, a young radio talk-show host. He likewise is drawn to her -- but Lacey becomes so upset and confused by the life of lies she is forced to live that she tries to break off their burgeoning relationship. How can she commit to him when she can't even tell him her true name?Then one day she discovers that the killer has traced her to Minneapolis and will soon place not only her but everyone around her in dire jeopardy. Realizing that she is no longer safe, she decides to go back to New York, determined to confront the threat to her life head on.Armed with nothing more than her own courage and the ambiguous and mystifying clues found in the journal, Lacey is caught in a fast-paced race against time as she tries to uncover who was behind the deaths of the two women before she, too, is killed -- not realizing that the journal itself is the reason for the murders....Chilling, spine-tingling suspense is the hallmark of Mary Higgins Clark's novels. In Pretend You Don't See Her, she surpasses herself.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Liberalism and its Challengers: FDR to Reagan",
        "Authors": "By Hamby, Alonzo L.",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Expressions of Love: Woman's Day Prizewinning Cross-Stitch Samplers",
        "Authors": "By Capuana, Theresa and Donnally, Helen (EDT)",
        "Description": "Offers instructions and patterns for thirty-three prizewinning cross-stitch samplers, with tips on materials, preparation of the fabric, and finishing touches",
        "Category": "",
        "Publisher": "Sedgewood Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Hugh Sidey's Portraits of the Presidents: Power and Personality in the Oval Office",
        "Authors": "By Hugh Sidey",
        "Description": "",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Time Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Floaters",
        "Authors": "By Wambaugh, Joseph",
        "Description": "Mick Fortney and his partner Leeds manage to cruise above the standard police stress-pools of coffee and Pepto-Bismol - they're water cops in the \"Club Harbor Unit,\" manning a patrol boat on San Diego's Mission Bay. A typically rough day's detail consists of scoping out body-sculpted beauties on pleasure craft, rescuing boating bozos who've run aground, jeering at lifeguards, and hauling in the occasional floater who comes to the surface.But now their days are anything but typical, because the America's Cup international sailing regattas have come to town and suddenly San Diego is swarming with yacht crazies of every nationality, the cuppies who want to love them, and the looky-loo tourists, racing spies, scam artists, and hookers who all want their piece of the action. It's the outstanding body and jaunty smile - full of mischief, full of hell - of one cuppie, a particularly fiery redhead named Blaze, that gets Leeds and Fortney's attention. First Leeds drowns in frustratingly unrequited boozy love from afar. Then, with her increasingly odd behavior, Blaze tweaks every one of their cop instincts, alerting them that something's not quite right on the waterfront.Indeed, Blaze will soon lead leggy Detective Anne Zorn and Mick Fortney along a bizarre criminal trail that would be hilarious if it didn't wind up just as nasty as it gets, with a pair of murders right on the eve of the biggest sailing race of all.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Never Let a Fool Kiss You or a Kiss Fool You : Chiasmus and a World of Quotations That Say What They Mean and Mean What They Say",
        "Authors": "By Grothe, Mardy",
        "Description": "An entertaining selection of quotations that demonstrate the classic linguistic trick of chiasmus presents a rich variety of wit and wisdom from Winston Churchill, Oscar Wilde, Ben Franklin, William Shakepeare, George Bernard Shaw, and Samuel Johnson, among others. 22,500 first printing.",
        "Category": " Reference , Quotations",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Just Be Honest: Authentic Communication Strategies That Get Results and Last a Lifetime",
        "Authors": "By Gaffney, Steven",
        "Description": "",
        "Category": "",
        "Publisher": "JMG Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "A Thousand Days in Venice (Ballantine Reader's Circle)",
        "Authors": "By De Blasi, Marlena",
        "Description": "He saw her across the Piazza San Marco and fell in love from afar. When he sees her again in a Venice café a year later, he knows it is fate. He knows little English; and she, a divorced American chef, speaks only food-based Italian. Marlena thinks she is incapable of intimacy, that her heart has lost its capacity for romantic love. But within months of their first meeting, she has packed up her house in St. Louis to marry Fernando—“the stranger,” as she calls him—and live in that achingly lovely city in which they met.Vibrant but vaguely baffled by this bold move, Marlena is overwhelmed by the sheer foreignness of her new home, its rituals and customs. But there are delicious moments when Venice opens up its arms to Marlena. She cooks an American feast of Mississippi caviar, cornbread, and fried onions for the locals . . . and takes the tango she learned in the Poughkeepsie middle school gym to a candlelit trattoría near the Rialto Bridge. All the while, she and Fernando, two disparate souls, build an extraordinary life of passion and possibility.Featuring Marlena’s own incredible recipes, A Thousand Days in Venice is the enchanting true story of a woman who opens her heart—and falls in love with both a man and a city.",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "52 Weekend Garden Projects",
        "Authors": "By Inouye, Carol (ILT) and Bubel, Nancy",
        "Description": "A collection of quick and easy year-round garden projects includes easy projects for vegetable, fruit, flower, nut, and herb gardens; weekend gardening activities; and discussions of selection, design, and more. Original. Organic Gardening Main. Practical Homeowners.",
        "Category": " House & Home , Reference",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Matarese Countdown",
        "Authors": "By Ludlum, Robert",
        "Description": "Secret deals are in the making, massive mysterious transactions steeped in corruption and murder. The players stand at the highest pinnacles of global finance and government. It is an unprecedented consolidation of money, power, and ruthlessness. Their ultimate aim: worldwide economic domination and all it entails ... by whatever means necessary.The Matarese dynasty is back in all its glory and evil. And the one man with enough knowledge to stop it, CIA case officer Cameron Pryce, may not have enough time. The Matarese countdown has begun and Pryce's only chance to cut it off is to follow the trail of blood money and stone-cold killers to the heart of this deadly conspiracy.From the Hamptons to Monte Carlo to London's Belgrave Square, Matarese assassins have already struck with brutal efficiency, eliminating all who stand in their way. But on Spain's Costa del Sol, one victim survived long enough to breathe these dying words: \"Find Beowulf Agate\" - words that reverberate all the way to CIA headquarters in Langley, Virginia. Beowulf Agate is the code name for legendary retired agent Brandon Scofield, the only man ever to penetrate the Matarese and survive.Now Cameron Pryce has to draw Scofield and his wife, Antonia, out of their Caribbean paradise hideaway and back to a place they thought thy'd never have to go again - back into the Matarese circle of death. For from the oil fields of the Persian Gulf to the boardrooms of Manhattan, from the hills of Corsica to the halls of power in Washington, the circle is closing, the noose is tightening, the panic is spreading. And Pryce has made a chilling discovery: the Matarese have broken new ground ... deep inside the CIA.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Practical flying;: A training manual for airplane pilots, (Ronald aeronautic series)",
        "Authors": "By Jones, Byron Q",
        "Description": "",
        "Category": "",
        "Publisher": "The Ronald Press Company",
        "Price Starting With ($)": "12.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1928"
        }
    },
    {
        "Title": "Extremely Loud and Incredibly Close",
        "Authors": "By Foer, Jonathan Safran",
        "Description": "Jonathan Safran Foer emerged as one of the most original writers of his generation with his best-selling debut novel, Everything Is Illuminated. Now, with humor, tenderness, and awe, he confronts the traumas of our recent history. What he discovers is solace in that most human quality, imagination. Meet Oskar Schell, an inventor, Francophile, tambourine player, Shakespearean actor, jeweler, pacifist, correspondent with Stephen Hawking and Ringo Starr. He is nine years old. And he is on an urgent, secret search through the five boroughs of New York. His mission is to find the lock that fits a mysterious key belonging to his father, who died in the World Trade Center on 9/11. An inspired innocent, Oskar is alternately endearing, exasperating, and hilarious as he careens from Central Park to Coney Island to Harlem on his search. Along the way he is always dreaming up inventions to keep those he loves safe from harm. What about a birdseed shirt to let you fly away? What if you could actually hear everyone&#39;s heartbeat? His goal is hopeful, but the past speaks a loud warning in stories of those who&#39;ve lost loved ones before. As Oskar roams New York, he encounters a motley assortment of humanity who are all survivors in their own way. He befriends a 103-year-old war reporter, a tour guide who never leaves the Empire State Building, and lovers enraptured or scorned. Ultimately, Oskar ends his journey where it began, at his father&#39;s grave. But now he is accompanied by the silent stranger who has been renting the spare room of his grandmother&#39;s apartment. They are there to dig up his father&#39;s empty coffin.",
        "Category": " Fiction , Literary",
        "Publisher": "Mariner Books Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Tale of the Body Thief (Vampire Chronicles)",
        "Authors": "By Rice, Anne",
        "Description": "In another feat of hypnotic storytelling, Anne Rice continues the extraordinary Vampire Chronicles that began with the now classic Interview with the Vampire and continued with The Vampire Lestat and The Queen of the Damned. Lestat speaks.  Vampire-hero, enchanter, seducer of mortals.  For centuries he has been a courted prince in the dark and flourishing universe of the living dead. Lestat is alone.  And suddenly all his vampire rationale--everything he has come to believe and feel safe with--is called into question. In his overwhelming need to destroy his doubts and his loneliness, Lestat embarks on the most dangerous enterprise he has undertaken in all the danger-haunted years of his long existence.The Tale of the Body Thief is told with the unique--and mesmerizing--passion, power, color, and invention that distinguish the novels of Anne Rice.",
        "Category": " Fiction , Horror",
        "Publisher": "Knopf",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Marie: An Invitation to Dance, Paris, 1775, Book 1 (Girlhood Journeys)",
        "Authors": "By Kudlinski, Kathleen V. and Durham, Lyn (ILT)",
        "Description": "Marie, who lives in eighteenth-century Paris, dreams of becoming a ballerina, but as a member of her modest family, her future of attending convent school, getting married, and having children is set, unless she can find a wealthy patron to sponsor her. Simultaneous.",
        "Category": " Juvenile Fiction , Historical , Europe",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "The Godfather Returns",
        "Authors": "By Winegardner, Mark and Puzo, Mario",
        "Description": "THE MISSING YEARS FROM THE GREATEST CRIME SAGA OF ALL TIMEThirty-five years ago, Mario Puzo’s great American tale, The Godfather, was published, and popular culture was indelibly changed. Now, in The Godfather Returns, acclaimed novelist Mark Winegardner continues the story–the years not covered in Puzo’s bestselling book or in Francis Ford Coppola’s classic films. It is 1955. Michael Corleone has won a bloody victory in the war among New York’s crime families. Now he wants to consolidate his power, save his marriage, and take his family into legitimate businesses. To do so, he must confront his most dangerous adversary yet, Nick Geraci, a former boxer who worked his way through law school as a Corleone street enforcer, and who is every bit as deadly and cunning as Michael. Their personal cold war will run from 1955 to 1962, exerting immense influence on the lives of America’s most powerful criminals and their loved ones, including Tom Hagen, the Corleone Family’s lawyer and consigliere, who embarks on a political career in Nevada while trying to protect his brother;Francesca Corleone, daughter of Michael’s late brother Sonny, who is suddenly learning her family’s true history and faces a difficult choice;Don Louie Russo, head of the Chicago mob, who plays dumb but has wily ambitions for muscling in on the Corleones’ territory;Peter Clemenza, the stalwart Corleone underboss, who knows more Family secrets than almost anyone;Ambassador M. Corbett Shea, a former Prohibition-era bootlegger and business ally of the Corleones’, who wants to get his son elected to the presidency–and needs some help from his old friends;Johnny Fontane, the world’s greatest saloon singer, who ascends to new heights as a recording artist, cozying up to Washington’s power elite and maintaining a precarious relationship with notorious underworld figures;Kay Adams Corleone, who finally discovers the truth about her husband, Michael–and must decide what it means for their marriage and their children andFredo Corleone, whose death has never been fully explained until now, and whose betrayal of the Family was part of a larger and more sinister chain of events.Sweeping from New York and Washington to Las Vegas and Cuba, The Godfather Returns is the spellbinding story of America’s criminal underworld at mid-century and its intersection with the political, legal, and entertainment empires. Mark Winegardner brings an original voice and vision to Mario Puzo’s mythic characters while creating several equally unforgettable characters of his own. The Godfather Returns stands on its own as a triumph–in a tale about what we love, yearn for, and sometimes have reason to fear . . . family.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Grimm's Grimmest",
        "Authors": "By Grimm, Wilhelm, Grimm, Jacob, Dockray, Tracy Arah (ILT), and Tatar, Maria (INT)",
        "Description": "Murder, kidnapping, cruel punishment, and violent revenge -- these are not the bedtime stories mummy used to read. Grimm's Grimmest presents nineteen of the original, unsanitized, unholy tales as they were first collected by the Brothers Grimm -- all fiendishly illustrated in full color. Grimm's Grimmest has the irresistible look and feel of a creaky old leatherbound volume, perhaps discovered in a forgotten trunk or dusty attic. With aged paper and a leathery stamped case, this delightfully shocking collection harkens back to a time when travelers risked roasting or worse and bad manners could yield frightful consequences. From the true horror of Aschenputtel (the original Cinderella story) to Rapunzel's dark secret, here are the authentic stories born long ago in the land of the Black Forest, at a time when fairy tales were not necessarily for children.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Bill and Hillary: The Marriage",
        "Authors": "By Andersen, Christopher P.",
        "Description": "Christopher Andersen draws on important sources - many speaking here for the first time - to take readers on a journey inside the world's most talked-about marriage. Among the revelations: What really goes on in the private residence at the White House - including the stormy clash between the President and the First Lady when he finally confessed his adultery to her; never-before-known details of their courtship, the real reason they stay together, and their bizarre links to Jack and Jackie Kennedy; from Barbra Streisand to a Miss America to Sharon Stone and Monica, the hundreds of women in Bill's life - and how Hillary has handled them; the day Bill's infidelity sent Hillary to the hospital; a riveting account of how Chelsea coped with her shock and grief, how Hillary tried to shield her daughter, and the heartbreaking toll the President's self-destructive acts have taken on both women; the disturbing reason the President's medical records remain under lock and key; how Bill still pursues other women even after his acquittal on impeachment charges.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Best American Essays 2003 (The Best American Series)",
        "Authors": "By Atwan, Robert (EDT) and Fadiman, Anne (EDT)",
        "Description": "Since 1986, The Best American Essays has gathered the most interesting and provocative writing of the year, establishing a firm place as the leading annual of its kind. The volume is edited each year by an esteemed writer who brings a fresh eye to the selections. Previous editors have included Elizabeth Hardwick, Susan Sontag, Geoffrey C. Ward, Cynthia Ozick, and Stephen Jay Gould. This year’s volume is terrifically diverse, with subjects ranging from driving lessons to animal rights to citizenship in times of emergency.",
        "Category": " Literary Collections , American , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Morgawr (The Voyage of the Jerle Shannara, Book 3)",
        "Authors": "By Brooks, Terry",
        "Description": "Harrowing confrontations with the merciless Ilse Witch and the monstrous Antrax have already taken their toil on the intrepid heroes of the Four Lands. But their darkest adversary now snaps at their heels, in the form of the Morgawr - master of the Ilse Witch, feeder upon the souls of his enemies, and centuries-old sorcerer of unimaginable might.With a fleet of airships and a crew of walking dead men at his command, the Morgawr is in relentless pursuit of the Jerle Shannara and the crew that mans her. For the Morgawr, the goal is twofold: to find and control the fabled ancient books of magic and to destroy the dark disciple who betrayed him - the Ilse Witch. But the Ilse Witch is already a prisoner...of herself. Exposed to the awesome power of the Sword of Shannara, and forced to confront the truth of her horrifying deeds, she has fled deep into her own mind. Now at the mercy of those who seek vengeance against her, her only protector is her long-lost brother, Bek Ohmsford, who is determined to redeem his beloved sister...and deliver her to the destiny predicted for her by the Druid Walker Boh.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Nowhere to Run",
        "Authors": "By Clark, Mary Jane",
        "Description": "A newsroom has nothing to hide . . . or does it?A killer has everything to lose . . . but is it worth it?A woman has no one to trust . . . so will she be next?Botulism, anthrax, small pox, plague: as medical producer for television's highly-rated morning news program, \"Key to America,\" Annabelle Murphy makes her living explaining horrific conditions to the nation. So when a KEY News colleague dies with symptoms terrifyingly similar to those of the latest scourge, she knows the panic spreading through the corridors of the Broadcast Center is justified. As one death follows another, Annabelle's co-workers look to her for assurance but she finds it hard to give comfort. To her, the circumstances of the infections begin to suggest that they may be diabolical murders. And when the authorities lock down the Broadcast Center with the identity of the killer still unknown, no one can be sure who to trust, and neither the victims nor the murderer can escape...  Nowhere To Run is full of Mary Jane Clark’s signature intricate plotting and taut psychological suspense.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Shadows",
        "Authors": "By Saul, John",
        "Description": "As one by one the children housed at The Academy, a clifftop mansion school for gifted children, begin to die mysterious deaths, Josh McCallum, a brilliant but lonely boy, knows that someone or something evil is to blame. 150,000 first printing.",
        "Category": " Fiction , Horror",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Rachel's Tears: The Spiritual Journey of Columbine Martyr Rachel Scott",
        "Authors": "By Scott, Darrell, Nimmo, Beth, and Rabey, Steve",
        "Description": "The Columbine tragedy in April 1999 pierced the heart of  our country.  In December 1999, we learned that the teenage killers specifically targeted Rachel Scott and mocked her Christian faith on their chilling, homemade videotapes.  Rachel Scott died for her faith.  Now her parents talk about Rachel's life and how they have found meaning in their daughter's martyrdom in the aftermath of the school shooting.  Rachel's Tears comes from a heartfelt need to celebrate this young girl's life, to work through the grief and the questions of a nation, and to comfort those who have been touched by violence in our schools today.  Using excerpts and drawings from Rachel's own journals, her parents offer a spiritual perspective on the Columbine tragedy and provide a vision of hope for preventing youth violence across the nation.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Thomas Nelson Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "And This Too Shall Pass: A Novel",
        "Authors": "By Harris, E. Lynn",
        "Description": "A stellar quarterback, an ambitious sportscaster.  What happens when rising stars collide?In And This Too Shall Pass, Harris takes us into the locker rooms and newsrooms of Chicago, where four lives are about to intersect in romance and scandal.  At the heart of the novel is the celibate Zurich, a rookiequarterback for the Chicago Cougars whose trajectory for superstardom is interrupted by a sexual assault charge by Mia, a sportscaster with her own sights on fame.  With his career in jeopardy, Zurich hires Tamela, a high-powered attorney, to defend him, while Sean, a gay sportswriter, covers the story and uncovers his heart.All of these characters face the challenge of keeping the faith--in themselves and in God--while Harris's heartfelt storytelling reveals how the love of family can help one to face the terrible legacy of long-held secrets. Throughout these characters' search for self-knowledge, Harris weaves the stories of MamaCee, Zurich's grandmother, whose lessons of faith teach one and all that \"this too shall pass.\"Breaking new ground in contemporary fiction, And This Too Shall Pass entertains and affirms with its stirring message about the healing power of family and faith.",
        "Category": " Fiction , LGBT , Gay",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "The Mimic Men",
        "Authors": "By Naipaul, V. S.",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1976"
        }
    },
    {
        "Title": "The Lexus and the Olive Tree: Understanding Globalization",
        "Authors": "By Friedman, Thomas L.",
        "Description": "From one of our most perceptive commentators and winner of the National Book Award, a comprehensive look at the new world of globalization, the international system that, more than anything else, is shaping world affairs today.As the Foreign Affairs columnist for The New York Times, Thomas L. Friedman has traveled the globe, interviewing people from all walks of contemporary life: Brazilian peasants in the Amazon rain forest, new entrepreneurs in Indonesia, Islamic students in Teheran, and the financial wizards on Wall Street and in Silicon Valley.Now Friedman has drawn on his years on the road to produce an engrossing and original look at globalization. Globalization, he argues, is not just a phenomenon and not just a passing trend. It is the international system that replaced the Cold War system; the new, well-greased, interconnected system: Globalization is the integration of capital, technology, and information across national borders, in a way that is creating a single global market and, to some degreee, a global village. Simply put, one can't possibly understand the morning news or one's own investments without some grasp of the system. Just one example: During the Cold War, we reached for the hot line between the White House and the Kremlin--a symbol that we were all divided but at least the two superpowers were in charge. In the era of globalization, we reach for the Internet--a symbol that we are all connected but nobody is totally in charge.With vivid stories and a set of original terms and concepts, Friedman offers readers remarkable access to his unique understanding of this new world order, and shows us how to see this new system. He dramatizes the conflict of \"the Lexus and the olive tree\"--the tension between the globalization system and ancient forces of culture, geography, tradition, and community. He also details the powerful backlash that globalization produces among those who feel brutalized by it, and he spells out what we all need to do to keep the system in balance. Finding the proper balance between the Lexus and the olive tree is the great drama of he globalization era, and the ultimate theme of Friedman's challenging, provocative book--essential reading for all who care about how the world really works.",
        "Category": " Political Science , Political Economy",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Fair Share Divorce for Women",
        "Authors": "By Miller, Kathleen A.",
        "Description": "",
        "Category": " Family & Relationships , Divorce & Separation",
        "Publisher": "Miller Advisors Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Taking Care of Business: A Psychiatrist's Guide for True Career Success",
        "Authors": "By Viscott, David",
        "Description": "Shows how to acquire communication skills important for business, with discussions of how to read people, how to listen, how to get a message across to a variety of co-workers, and more",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Bride's Book of Etiquette, Golden Anniversary Edition",
        "Authors": "By Bride's Magazine Editors",
        "Description": "",
        "Category": "",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Bride: A Celebration",
        "Authors": "By Tober, Barbara (EDT)",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Longmeadow Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Bachelor Brothers' Bed & Breakfast",
        "Authors": "By Richardson, Bill",
        "Description": "A pair of endearingly eccentric bachelors--in their fifties, and fraternal twins--own and operate a bed & breakfast establishment where people like them, the \"gentle and bookish and ever so slightly confused,\" can feel at home. Hector and Virgil think of their B&B as a refuge, a retreat, a haven, where folks may bring their own books or peruse the brothers' own substantial library. An antic blend of homespun and intellectual humor,Bachelor Brothers' Bed & Breakfast is a place readers will want to return to again and again.Bachelor Brothers' Bed & Breakfast, originally published by Douglas & McIntyre, won Canada's prestigious Stephen Lecock Award for Humour in 1994, and was published in hardcover by A Wyatt Book for St. Martin's Press in 1996. Its sequel, Bachelor Brothers' Bed & Breakfast Pillow Book, is a Canadian bestseller, and will be published in hardcover by A Wyatt Book in October 1997.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "You're Not a Kid Anymore...",
        "Authors": "By Foxworthy, Jeff and Boyd, David",
        "Description": "A well-known comic offers 150 clues to help recognize signs of adulthood, such as when your ears have more hair than your head, when you hope it does not snow, and when your bell-bottoms are belled at both ends. Original.",
        "Category": " Humor , Form , Jokes & Riddles",
        "Publisher": "Taylor Trade Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Pierre-Auguste Renoir (Art for Children)",
        "Authors": "By Raboff, Ernest",
        "Description": "A brief biography of the artist accompanies color reproductions and analyses of fifteen of his works.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Trophy Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Pocahontas: Princess of the River Tribes",
        "Authors": "By Raphael, Elaine and Bolognese, Don",
        "Description": "Easy-to-follow drawing instructions enable young artists, historians, and fans to create authentic scenes, costumes, and characters from the life of Pocahontas, a chief's daughter who saved the life of British settler John Smith. Reprint.",
        "Category": "",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Pearls of Wisdom from Grandma",
        "Authors": "By Hayes, J. G. (EDT)",
        "Description": "In the same tradition as Sisters   and Simple Abundance, Pearls of Wisdom from Grandma  explores the deep-rooted connections between grandmother and grandchild and the boundary between memory and experience. It shares with readers a timeless string of wisdom, warmth and wit from celebrities, political and business leaders, authors, children and others eager to reminisce about the profound effect their grandmothers had on their lives.   With an introduction by Demi Moore, Pearls of Wisdom from Grandma  is full of interesting personal stories and quotes from a multicultural swath of American society, from people like George and Barbara Bush, Alice Hoffman, Margaret Atwood, Edwidge Dandicott and Toni Braxton. The grandmother of noted fashion designer Vera Wang once told her: \"Always eat before going out, because it's very unfeminine to eat like a horse.\" Writer Dawna Markova tells us how her grandmother taught her to look at a boy who was missing his legs and see the love and riches he possessed, more so than the elegant man in a fur coat standing next to him. \"Feel what it is like to be him,\" her grandmother said. \"Feel his heart. Now look at him again. Look at that heart. It's pure gold and wide as the sky. He's a rich old soul whose path is to teach all of us about joy.\"   Together, these voices of love paint a heartfelt portrait of everything a grandmother can be: a healer, a guide and inspiration.",
        "Category": " Self-help , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Insect Pests",
        "Authors": "By Fichter, George S.",
        "Description": "Over 350 entries describing insect pests including suggested methods of control",
        "Category": " Technology & Engineering , General",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "14.97",
        "Publish Date": {
            "Month": "June",
            "Year": "1966"
        }
    },
    {
        "Title": "Men And Women Of The Corporation",
        "Authors": "By Kanter, Rosabeth M.",
        "Description": "",
        "Category": "",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "Angel of Death (Sean Dillon)",
        "Authors": "By Higgins, Jack",
        "Description": "In a world where terrorism is a fact of life, no one inspires more fear than \"January 30,\" the most mysterious terrorist group in Europe, whose targets appear to be everyone: Catholics and Protestants in Ireland, Israelis and Arabs, American and Russian diplomats. In London, the British prime minister launches a special investigation to hunt down the members of January 30.Enter Brigadier Charles Ferguson, of the British prime minister's elite Group Four, and Sean Dillon, once the Provisional IRA's most feared enforcer, now Ferguson's strong right hand and the hero of Thunder Point and On Dangerous Ground. As Ferguson and Dillon close in on the January 30 terrorists, a wild card changes everything. In an effort to maintain the ceasefire in effect in Northern Ireland, the president of the United States and the Irish and British prime ministers request Senator Patrick Keogh to mediate between the loyalist and Republican factions. The senator agrees, though he knows it means putting his life on the line. The worst fears of the governments of all three countries are realized when the terrorists, seizing the chance to disrupt the peace process, target the senator for death. It is up to Ferguson and Dillon to stop them.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "G.P Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Dave Barry's Greatest Hits",
        "Authors": "By Barry, Dave",
        "Description": "\"Mr. Barry is the funniest man in America and we should encourage him. Buy this book.\"THE NEW YORK TIMES BOOK REVIEWWhat Pultizer Prize-winning humorist Dave Barry did for American history in DAVE BARRY SLEPT HERE and for getting older in DAVE BARRY TURNS FORTY, he does for...everything else in America! The rapacious consumer of overpriced real estate, He Man action figures, and homemade beer sounds off on all the things that make life as we know it both ridiculous and sublime.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "A Stitch in Time",
        "Authors": "By Bottke, Allison",
        "Description": "Dee Decker is a successful fundraising executive in Southern California who works in a world populated by thin, designer outfitted women and has never felt like she fits in, but when she discovers that her husband is having an affair, she embarks on a journey of self discovery and plastic surgery that will transform her inside and out. Original. 25,000 first printing.",
        "Category": " Fiction , Religious",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "If This World Were Mine: A Novel",
        "Authors": "By Harris, E. Lynn",
        "Description": "Four friends, all graduates of Hampton Institute, keep a collective journal they call \"If This World Were Mine,\" and share their personal diaries each month at a gathering filled with humor, gossip, and affirmation. The four group members are as different as the seasons, yet they all share a love of one another. Yolanda, a media consultant, keeps it going on with a no-nonsense attitude and independence that are balanced by the theatrics of Riley, a former marketing executive whose marriage has reduced her to a \"kept woman with kids.\" Computer engineer Dwight's anger at the world is offset by the compassion of Leland, a gay psychiatrist whose clients make him question why God ever invented sex.But after five years, the once-strong bonds of friendship are weakening, and the group must handle challenges of work, lost love, and a stranger in their midst. As the group members confront their true feelings toward each other, resentments and long-held secrets surface, and the stability of the group begins to disintegrate. Is their past friendship strong enough to survive the future?",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Babyville: A Novel",
        "Authors": "By Green, Jane",
        "Description": "Meet Julia, a wildly successful television producer who appears to have the picture-perfect life. But beneath the surface, things are not as perfect as they seem. Stuck in a loveless relationship with her boyfriend, Mark, Julia thinks a baby is the answer . . . but she may want a baby more than she wants her boyfriend. Maeve, on the other hand, is allergic to commitment. A feisty, red-haired, high-power career girl, she breaks out in a rash every time she passes a stroller. But when her no-strings-attached nightlife leads to an unexpected pregnancy, her reaction may be just as unexpected . . . And then there&apos;s Samantha&apos;happily married and eager to be the perfect June-Cleaver mother. But baby George brings only exhaustion, extra pounds, and marital strife to her once tidy life. Is having an affair with a friend&apos;s incredibly sexy husband the answer? With Babyville, bestselling author Jane Green applies her golden touch to the next phase of a girl&apos;s life.  By turns witty, rollicking, and tender, this sparkling, sexy tale about the complexities of modern motherly love isn&apos;t really a story about babies&apos;it&apos;s about three friends whose lives are suddenly turned upside down by that life-changing event that hangs over the head of every single girl: motherhood.",
        "Category": " Fiction , Women",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Known World: A Novel",
        "Authors": "By Jones, Edward P.",
        "Description": "In one of the most acclaimed novels in recent memory, Edward P. Jones, two-time National Book Award finalist, tells the story of Henry Townsend, a black farmer and former slave who falls under the tutelage of William Robbins, the most powerful man in Manchester County, Virginia. Making certain he never circumvents the law, Townsend runs his affairs with unusual discipline. But when death takes him unexpectedly, his widow, Caldonia, can't uphold the estate's order and chaos ensues. In a daring and ambitious novel, Jones has woven a footnote of history into an epic that takes an unflinching look at slavery in all of its moral complexities.This P.S. edition features an extra 16 pages of insights into the book, including author interviews, recommended reading, and more.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Amistad",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Babies on the Go",
        "Authors": "By Dyer, Jane and Ashman, Linda",
        "Description": "Inside, outside, fast, or slow . . . Babies are most definitely on the move in this exuberant rhyming celebration of all the amazing ways animal parents carry their little ones.  And as for those babies? They're delighted to go along for the ride!",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Harcourt Childrens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "American Lighthouses: A Pictorial History",
        "Authors": "By Caravan, Jill",
        "Description": "A photographic history takes readers from the earliest sailor beacons through today's fully automated navigational systems, encompassing such topics as the first lighthouse in Boston, famous shipwrecks, and ghost stories.",
        "Category": " Business & Economics , General",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "A Christmas Homecoming Bill And Gloria Gaither Present:",
        "Authors": "By Gaither, Bill and Gaither, Gloria",
        "Description": "What better time for a Homecoming than at Christmas - and who better to celebrate this holy day with than with all your Homecoming Friends! It's A Homecoming Christmas - and your invited to join Bill and Gloria Gaither and all the Homecoming Friends as they share their most cherished Christmas traditions, recipes, songs, stories, and Scriptures.  Filled with brand new content as well as breathtaking photography, this is a Christmas keepsake that your entire family will cherish for year's to come.  It's the perfect stocking stuffer for the millions of Homecoming fans - and the perfect compliment to the new Christmas Homecoming video that also releases this Fall.",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The USA Today Weather Book: An Easy-to-Understand Guide to the USA's Weather",
        "Authors": "By Williams, Jack",
        "Description": "A guide to America's weather features full-color graphics from USA Today and discussions of hurricanes, blizzards, heat waves, cold fronts, tornadoes, draughts, and more. Original. 40,000 first printing.",
        "Category": " Science , Earth Sciences , Meteorology & Climatology",
        "Publisher": "Vintage",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "The Campaign",
        "Authors": "By Fuentes, Carlos",
        "Description": "In this witty and enthralling saga of revolutionary South America, Carlos Fuentes explores the period of profound upheaval he calls\" the romantic time.\" His hero, Baltasar Bustos, the son of a wealthy landowner, kidnaps the baby of a prominent judge, replacing it with the black baby of a prostitute. When he catches sight of the baby's mother, though, he falls instatnly in love with her and sets off on an anguished journey to repent his act and win her love.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Christian Caregiving: A Way of Life",
        "Authors": "By Haugk, Kenneth C.",
        "Description": "Will challenge and equip readers to care for others in a distinctively Christian way and help them feel comfortable talking about their faith, praying with others and trying to comfort a friend?",
        "Category": " Religion , Christian Ministry , General",
        "Publisher": "Augsburg Fortress Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Next",
        "Authors": "By Crichton, Michael",
        "Description": "Is a loved one missing some body parts? Are blondes becoming extinct? Is everyone at your dinner table of the same species? Humans and chimpanzees differ in only 400 genes; is that why a chimp fetus resembles a human being? And should that worry us? There's a new genetic cure for drug addiction—is it worse than the disease? We live in a time of momentous scientific leaps, a time when it's possible to sell our eggs and sperm online for thousands of dollars and to test our spouses for genetic maladies.We live in a time when one fifth of all our genes are owned by someone else, and an unsuspecting person and his family can be pursued cross-country because they happen to have certain valuable genes within their chromosomes . . .Devilishly clever, Next blends fact and fiction into a breathless tale of a new world where nothing is what it seems and a set of new possibilities can open at every turn.Next challenges our sense of reality and notions of morality. Balancing the comic and the bizarre with the genuinely frightening and disturbing, Next shatters our assumptions and reveals shocking new choices where we least expect. The future is closer than you think.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Life in the Chesapeake Bay. Illus. by Alice Jane Lippson",
        "Authors": "By Lippson, Alice Jane and Lippson, Robert L.",
        "Description": "Life in the Chesapeake Bay is the most important book ever published on America's largest estuary. Since publication of the first edition in 1984, tens of thousands of naturalists, boaters, fishermen, and conservationists have relied on the book's descriptions of the Bay's plants, animals, and diverse habitats. Superbly illustrated and clearly written, this acclaimed guide describes hundreds of plants and animals and their habitats, from diamondback terrapins to blue crabs to hornshell snails.Now in its third edition, the book has been updated with a new gallery of thirty-nine color photographs and dozens of new species descriptions and illustrations. The new edition retains the charm of an engaging classic while adding a decade of new research.This classic guide to the plants and animals of the Chesapeake Bay will appeal to a variety of readers—year-round residents and summer vacationers, professional biologists and amateur scientists, conservationists and sportsmen.",
        "Category": " Nature , Animals , Marine Life",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Kitchen Privileges: A Memoir",
        "Authors": "By Clark, Mary Higgins",
        "Description": "In her long-awaited memoir, Mary Higgins Clark, America's beloved and bestselling Queen of Suspense, recounts the early experiences that shaped her as a person and influenced her as a writer.  Even as a young girl, growing up in the Bronx, Mary Higgins Clark knew she wanted to be a writer. The gift of storytelling was a part of her Irish ancestry, so it followed naturally that she would later use her sharp eye, keen intelligence, and inquisitive nature to create stories about the people and things she observed.  Along with all Americans, those who lived in New York City's borough of the Bronx suffered during the Depression. So it followed that when Mary's father died, her mother, deciding to open the family home to boarders, placed a discreet sign next to the front door that read, FURNISHED ROOMS. KITCHEN PRIVILEGES. Very shortly the first in a succession of tenants arrived: a couple dodging bankruptcy who moved in with their wild-eyed boxer; a teacher who wept endlessly over her lost love; a deadbeat who tripped over a lamp while trying to sneak out in the middle of the night...  The family's struggle to make ends meet; her days as a scholarship student in an exclusive girls' academy; her after-school employment as a hotel switchboard operator (happily listening in on the guests' conversations); the death of her beloved older brother in World War II; her brief career as a flight attendant for Pan Am (a job taken after a friend who flew with the airline said ever so casually, \"God, it was beastly hot in Calcutta\"); her marriage to Warren Clark, on whom she'd had a crush for many years; sitting at the kitchen table, writing stories, and finally selling the first one for one hundred dollars (after six years and some forty rejections!) -- all these experiences figure into Kitchen Privileges, as does her husband's untimely death, which left her a widowed mother of five young children.  Determined to care for her family and to make a career for herself, she went to work writing scripts for a radio show, but in her spare time she began writing novels. Her first, a biographical novel about the life of George Washington titled Aspire to the Heavens, found a publisher but disappeared without a trace when the publisher folded. (Recently it was rediscovered by a descendant of the Washington family and was reissued under the title Mount Vernon Love Story.) The experience, however, gave her the background and the preparation for writing Where Are the Children? which went on to become an international bestseller. That novel launched her career and was the first of twenty-seven (and still counting!) bestselling books of suspense.  As Mary Higgins Clark has said when asked if she might consider giving up writing for a life of leisure, \"Never! To be happy for a year, win the lottery. To be happy for life, love what you do.\" In Kitchen Privileges, she reflects on the joy that her life as a writer has brought her, and shares with readers the love that she has found.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Bake Off Cook Book: From the 18th Annual Bake Off, 100 Prize Winning Recipes",
        "Authors": "By By the Pillsbury Company",
        "Description": "",
        "Category": "",
        "Publisher": "Pillsbury Co.",
        "Price Starting With ($)": "20.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "The Book of Fate",
        "Authors": "By Meltzer, Brad",
        "Description": "In six minutes, one of us would be dead. None of us knew it was coming. So says Wes Holloway, a once-cocky and ambitious presidential aide, about the day that changed his life forever. On that Fourth of July, Wes put Ron Boyle, the chief executive's oldest friend, into the presidential limousine. By the time the trip came to an end, Wes was permanently disfigured, and Boyle was dead, the victim of a crazed assassin.Eight years later, Boyle is spotted, alive and well, in Malaysia. In that moment, Wes has the chance to undo the worst day of his life. Trying to figure out what really happened takes Wes back to a decade-old presidential crossword puzzle, mysterious facts buried in Masonic history, and a two-hundred-year-old code invented by Thomas Jefferson.But what Wes doesn't realize is that The Book of Fate holds everyone's secrets. Especially the ones worth dying for.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Bitterroot",
        "Authors": "By Burke, James Lee",
        "Description": "Following his acclaimed bestseller Purple Cane Road, James Lee Burke returns with a triumphant tour de force.  Set in the Bitterroot Valley of Montana, home to celebrities seeking to escape the pressures of public life, as well as to xenophobes dedicated to establishing a bulkhead of patriotic paranoia, Burke's novel features Billy Bob Holland, former Texas Ranger and now a Texas-based lawyer, who has come to Big Sky Country for some fishing and ends up helping out an old friend in trouble.  And big trouble it is, not just for his friend but for Billy Bob himself -- in the form of Wyatt Dixon, a recent prison parolee sworn to kill Billy Bob as revenge for both his imprisonment and his sister's death, both of which he blames on the former Texas lawman. As the mysteries multiply and the body count mounts, the reader is drawn deeper into the tortured mind of Billy Bob Holland, a complex hero tormented by the mistakes of his past and driven to make things -- all things -- right. But beneath the guise of justice for the weak and downtrodden lies a tendency for violence that at times becomes more terrifying than the danger he is trying to eradicate.  As USA Today noted in discussing the parallels between Billy Bob Holland and Burke's other popular series hero, David Robicheaux, \"Robicheaux and Holland are two of a kind, white-hat heroes whose essential goodness doesn't keep them from fighting back. The two series describe different landscapes, but one theme remains constant: the inner conflict when upright men are provoked into violence in defense of hearth, home, women, and children. There are plenty of parallels. Billy Bob is an ex-Texas Ranger; Dave is an ex-New Orleans cop. Dave battles alcoholism and the ghosts of Vietnam; Billy Bob actually sees ghosts, including the Ranger he accidentally gunned down....But most of all, both protagonists hold a vision of a pure and simple life.\"  In Bitterroot, with its rugged and vivid setting, its intricate plot, and a set of remarkable, unforgettable characters, and crafted with the lyrical prose and the elegiac tone that have inspired many critics to compare him to William Faulkner, James Lee Burke has written a thriller destined to surpass the success of his previous novels.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Chamber",
        "Authors": "By Grisham, John",
        "Description": "In the corridors of Chicago's top law firm: Twenty-six-year-old Adam Hall stands on the brink  of a brilliant legal career. Now he is risking it  all for a death-row killer and an impossible case.  Maximum Security Unit, Mississippi State  Prison: Sam Cayhall is a former Klansman  and unrepentant racist now facing the death penalty  for a fatal bombing in 1967. He has run out of  chances -- except for one: the young, liberal Chicago  lawyer who just happens to be his grandson. While  the executioners prepare the gas chamber, while  the protesters gather and the TV  cameras wait, Adam has only days, hours, minutes  to save his client. For between the two men is a  chasm of shame, family lies, and secrets --  including the one secret that could save Sam Cayhall's  life...or cost Adam his. \"A dark and  thoughtful tale pulsing wit moral uncertainties...  Grisham is at his best.\"  --People. \"Compelling... Powerful...  The Chamber will make readers think  long and hard about the death penalty.\" --  USA Today. \"His best  yet.\" -- The Houston Post.  \"Mesmerizing... with an authority and  originality... and with a grasp of literary  complexity that makes Scott Turow's novels pale by  comparison -- Grisham returns.\" -- San  Francisco Chronicle.",
        "Category": " Fiction , Media Tie-In",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Dead Man's Dance",
        "Authors": "By Ferrigno, Robert",
        "Description": "A ruthless pair of quirky, sociopathic killers-for-hire. A father figure returned from the grave. A series of killings so cleverly executed, murder is not suspected in some instances - much less a connection to other deaths. These elements and more combust in Dead Man's Dance.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Newcomer's Handbook for Moving to Washington D.C. Including Northern Virginia and Suburban Maryland",
        "Authors": "By Livingston, Mike",
        "Description": "",
        "Category": "",
        "Publisher": "First Books Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    }
]