[
    {
        "Title": "Moose",
        "Authors": "By Hoshino, Michio",
        "Description": "",
        "Category": " Nature , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "State of Wonder",
        "Authors": "By Patchett, Ann",
        "Description": "“Expect miracles when you read Ann Patchett’s fiction.”—New York Times Book ReviewAward-winning, New York Times bestselling author Ann Patchett returns with a provocative and assured novel of morality and miracles, science and sacrifice set in the Amazon rainforest. Infusing the narrative with the same ingenuity and emotional urgency that pervaded her acclaimed previous novels Bel Canto, Taft, Run, The Magician’s Assistant, and The Patron Saint of Liars, Patchett delivers an enthrallingly innovative tale of aspiration, exploration, and attachment in State of Wonder—a gripping adventure story and a profound look at the difficult choices we make in the name of discovery and love.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "Calendar Companion for Winter",
        "Authors": "By Glover, Susanne and Glover, Georgeann",
        "Description": "",
        "Category": "",
        "Publisher": "Good Apple",
        "Price Starting With ($)": "15.41",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "What A Trip!",
        "Authors": "By Egielski, Richard (ILT) and Yorinks, Arthur",
        "Description": "While walking down the street one day in his simple town in New Jersey, Mel stumbles into another dimension where there isn't a single smooth side to be found, but when his friends dismiss his tales about his pointy adventure, Mel finds a way to prove to all that what he has been saying is true.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Michael di Capua Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "The Insider: A True Story",
        "Authors": "By Verton, Dan",
        "Description": "",
        "Category": " Business & Economics , Information Management",
        "Publisher": "Aeon Publishing Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Bible Promises for You",
        "Authors": "By Zondervan",
        "Description": "Bible Promises for You is an collection of promises taken from the New International Version of the Bible, and is categorized by topic for easy reference. For every circumstance and season of life, God has promises that offer direction, peace, perspective, and wisdom. Includes a presentation page for gift-giving at an affordable price.",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Norman Rockwell: A Centennial Celebration",
        "Authors": "By Norman Rockwell Museum at Stoc.",
        "Description": "",
        "Category": " Art , Individual Artists , General",
        "Publisher": "Thunder Bay Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Wounded Healer (Homeland Heroes, Book 1)",
        "Authors": "By Fleisher, Donna",
        "Description": "Flooded with panic, two words burst through Erin’s mind: GET HELP. She ran for the door, but someone grabbed her, twisted her arm behind her. Erin’s shriek was smothered by a cold, clammy hand. “Shhh—” Breath tickled her ear—“Just take it easy. . . .”Surrounded by the oppressive sand, heat, and tension of Operation Desert Storm, soldiers Erin Grayson and Christina McIntyre shared a special bond. But when an ugly secret from Chris’ past shattered their close friendship, they went their separate ways without even a goodbye. Four years have gone by since that day in the desert, but Chris has spent her entire life running from the past, hiding her deepest secrets from those who care for her most. And now tragedy has ripped apart her life. She sees no hope in tomorrow.It’s a good day to die. . . .Overcoming her own anger and doubt, Erin rushes to Chris’ Colorado cabin. When Chris’ fear of God and Erin’s faith in Him collide, they are involved in a different kind of war that only one of them can win. As Chris wrestles with grief, fear, and ghosts from the past, Erin fights to pull her from the brink of self-destruction. She will not lose Chris again.Chris’ life is at stake . . . as well as her soul.",
        "Category": " Fiction , Religious",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Essentials of Ecology",
        "Authors": "By Townsend, Colin R., Begon, Michael, and Harper, John L.",
        "Description": "This textbook presents introductory ecology in an accessible, state-of-the-art format designed to cultivate the novice student's understanding of, and fascination with, the natural world. In a concise, engaging style, this text outlines the essential principles of ecology from the theoretical fundamentals to their practical applications. Full color artwork, simple pedagogical features, and a wide range of carefully-chosen examples make this book an ideal introduction to ecology for students at all levels.The third edition of this successful text is much more than a simple update, reflecting the vibrancy of the field. With hundreds of new examples, it contains for the first time a separate chapter on evolutionary ecology, with all other chapters, especially those on applied aspects, having been extensively revised and re-written. The new edition also features new artwork and an enhanced design, making this book as attractive as it is up-to-date and relevant.Outstanding features of the third edition of Essentials of Ecology include:Dedicated website - available at www.blackwellpublishing.com/townsend, featuring study resources and web research questionsKey Concepts - summarized at the beginning of each chapterHistory boxes outlining key landmarks in the development of ecologyQuantitative boxes - allowing mathematical aspects of ecology to be explained clearly without interrupting the flow of the textTopical ECOncerns boxes - highlighting ethical, social and political questions in ecologyReview questions - included at the end of each chapter",
        "Category": " Science , Life Sciences , Ecology",
        "Publisher": "Wiley-Blackwell",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Sealed With a Kiss (Holly's Heart, Book 3)",
        "Authors": "By Lewis, Beverly",
        "Description": "Book 3 of Holly's Heart. Too many little white lies can create one big jam.  Holly and her best friend, Andie, are having a race to see who can collect the most pen pals by Labor Day. The contest was exciting and fun at first, but Holly eventually finds herself in a bit of a mess when she starts writing to a male pen pal. College-aged Lucas Leigh, Holly's newest and top-secret pen pal and the nephew of her favorite author, thinks Holly is a much older, published writer. Holly is thrilled when Lucas suggests they read each other's manuscripts, but her seemingly innocent deception backfires when Lucas asks to meet Holly in person: Now Holly must give up the opportunity to meet her favorite author…or face the consequences of telling lies.",
        "Category": " Young Adult Fiction , Religious , Christian , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Bread: The Breads of the World and How to Bake Them at Home",
        "Authors": "By Shapter, Jennie and Ingram,Christine",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Networking Survival Guide: Get the Success You Want By Tapping Into the People You Know",
        "Authors": "By Darling, Diane",
        "Description": "In today's dwindling job markets, people who rely on want ads and headhunters succeed about 5 percent of the time. But those who have mastered the art of networking find new positions nearly 66 percent of the time. Writing for job seekers and career builders alike, networking superstar Diane Darling shows how to cultivate a rich network of professional contacts and use it to find success.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "The Deadly Frost",
        "Authors": "By Moan, Terry",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1980"
        }
    },
    {
        "Title": "Basic psychiatric concepts in nursing",
        "Authors": "By Kyes, Joan J",
        "Description": "",
        "Category": "",
        "Publisher": "Lippincott",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Miral: A Novel",
        "Authors": "By Jebreal, Rula and Cullen, John (ILT)",
        "Description": "Soon to be a major motion picture from the award-winning director Julian Schnabel, starring Freida Pinto.    WRITTEN BY the much-admired Italo-Palestinian journalist Rula Jebreal, Miral is a novel that   focuses on remarkable women whose lives unfold in the turbulent political climate along the borders of Israel and   Palestine. The story begins with Hind, a woman who sacrifices everything to establish a school for refugee   Palestinian girls in East Jerusalem. Years later Miral arrives at the school after her mother commits suicide. Hind sees   that Miral has the potential to change the world peacefully-but Miral is appalled by the injustice that surrounds her,   and flirts with the notion of armed resistance. Hind desperately works to persuade her to stay the course of   education, hard work, and non-violent resolution-but is she too late?    Watch a Video",
        "Category": " Fiction , Psychological",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Moon Handbooks Coastal Carolinas",
        "Authors": "By Sigalas, Mike",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Moon Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Revenge Wears Rubies (Jaded Gentleman)",
        "Authors": "By Bernard, Renee",
        "Description": "Vengeance doesn't always turn out the way you planned. First in a sexy new series of erotic passion set in Victorian London  Galen Hawk desires nothing but revenge against the woman who betrayed his dearly departed friend. Instead of mourning the loss of her fiancé, Miss Haley Moreland is merrily celebrating her upcoming nuptials to another man. Now, Galen has one mission: to seduce Miss Moreland and enslave her heart. And when she is completely his, he will destroy her.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Favorite Bible Heroes (Children's Bible Classics)",
        "Authors": "By Jacobs, Timothy and Yenne, Bill",
        "Description": "It's hard for children to find heroes in today's world.  But the Bible is filled with the wonderful stories of everyday people who became larger-than-life heroes once they put their trust in God.  Excitement and adventure - combined with the timeless values of faith, trust, and obedience to God - make these Bible superheroes the traditional favorites of kids everywhere. Stories included: Noah and the Ark, Joseph and the Coat of Many Colors, The Story of Moses, Joshua and the Battle of Jericho, David and Goliath, and the Story of Jonah.",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.71",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Cure (A Medical Thriller)",
        "Authors": "By Cook, Robin",
        "Description": "Returning to work when her son's neuroblastoma goes into remission, New York City medical examiner Laurie Montgomery faces the case of her career involving the suspected poisoning murder of a CIA agent and possible links a powerful pharmaceutical company and start-up stem-cell research labs. By the best-selling author of Intervention. Reprint.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "Harrison's Principles of Internal Medicine/1 Volume Edition/Full Edition Bk1&2",
        "Authors": "By Isselbacher, Kurt J. and Martin, Joseph B. (EDT)",
        "Description": "A classic text, originally published in 1950, and most recently in 1991. The 11th edition of 1987 is cited in  Brandon-Hill .  The present edition is extensively revised to reflect important advances in the understanding of the biology and pathophysiology of disease and at the same time to build links between the extraordinary advances in basic science and clinical medicine. Includes 23 pages of color plates. Also available as a two-volume set. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Mcgraw-Hill (Tx)",
        "Price Starting With ($)": "12.05",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Complete Step-By-Step Cookbook: More Than 800 Recipes in Full Color",
        "Authors": "By Thunder Bay Press, McDowall, Anne",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Thunder Bay Pr",
        "Price Starting With ($)": "8.55",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Council of Shadows: A Novel of the Shadowspawn",
        "Authors": "By Stirling, S. M.",
        "Description": "New from the New York Times bestselling author of A Taint in the Blood.Adrian Brézé defied his own dark heritage as a near-purebred Shadowspawn for years, until his power-hungry sister Adrienne kidnapped his human lover Ellen.Now, Adrienne is dead, and the Council of Shadows is gathering its strength. To stop the Council from launching an apocalypse, Adrian and Ellen must ally with the Brotherhood, a resistance group dedicated to breaking the Council's hold on humankind...by any means necessary.In the coming confrontation, Adrian must fight not only the members of the Council but also his own nature-and, as he will come to suspect, traitors within the Brotherhood itself...",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Roc",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Truth sets free: Juniata Independent College in Pennsylvania, founded by the brethren, 1876 : a centennial history",
        "Authors": "By Kaylor, Earl C",
        "Description": "",
        "Category": "",
        "Publisher": "A. S. Barnes",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Desert Giant: The World of the Saguaro Cactus (Reading Rainbow Book)",
        "Authors": "By Bash, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "Sierra Club Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Pennsylvania sampler: A biography of the Keystone State and its people",
        "Authors": "By Beers, Paul B",
        "Description": "",
        "Category": "",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "500 Low-Carb Recipes",
        "Authors": "By Carpender, Dana",
        "Description": "",
        "Category": "",
        "Publisher": "Fair Winds Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Courageous: A Novel",
        "Authors": "By Kendrick, Stephen, Kendrick, Alex, and Alcorn, Randy",
        "Description": "Retailers Choice Award winner, 2012From the creators of Fireproof comes an inspiring new story about everyday heroes who long to be the kinds of dads that make a lifelong impact on their children. As law enforcement officers, Adam Mitchell, Nathan Hayes, and their partners willingly stand up to the worst the world can offer. Yet at the end of the day, they face a challenge that none of them are truly prepared to tackle: fatherhood. While they consistently give their best on the job, good enough seems to be all they can muster as dads. But they’re quickly discovering that their standard is missing the mark. They know that God desires to turn the hearts of fathers to their children, but their children are beginning to drift farther and farther away from them. Will they be able to find a way to serve and protect those who are most dear to them? When tragedy hits home, these men are left wrestling with their hopes, their fears, their faith, and their fathering. Can a newfound urgency help these dads draw closer to God . . . and to their children?",
        "Category": " Fiction , Christian , General",
        "Publisher": "Tyndale House Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "Rescue: A Novel",
        "Authors": "By Shreve, Anita",
        "Description": "A rookie paramedic pulls a young woman alive from her totaled car, a  first rescue that begins a lifelong tangle of love and wreckage.Peter Webster is a rookie paramedic when he pulls a young woman out of a car wreck that should have killed her. Sheila Arsenault haunts his thoughts, and despite his misgivings Peter is soon embroiled in an intense love affair--and in Sheila's troubled world.Eighteen years later, Sheila is long gone and Peter is raising their daughter, Rowan, alone. But Rowan is veering dangerously off course, and for the first time in their quiet life together Peter fears for her future. He seeks out the only person who may be able to help Rowan, although Sheila's return is sure to unleash all the questions he has carefully been keeping at bay: Why did a mother leave her family? How did the marriage of two people so deeply in love unravel?A story about trespass and forgiveness, secrets and the seismic force of the truth, Rescue is a masterful portrayal of a family trying to understand its fractured past and begin again.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "The Sellout: How Three Decades of Wall Street Greed and Government Mismanagement Destroyed the Global Financial System",
        "Authors": "By Gasparino, Charles",
        "Description": "In the spirit of Barbarians at the Gate and Liar’s Poker comes The Sellout, the definitive book on the recent collapse of Wall Street, one of the most dramatic and anxiety-ridden era in national socioeconomic history. In this powerful business narrative, Charles Gasparino, the author of Blood on the Floor and King of the Club, captures how avarice, arrogance, and sheer stupidity eroded Wall Street’s dominance, made many of our country’s most fabled financial institutions vulnerable to significant new foreign control, and profoundly weakened the financial security of millions of poor and middle-class American families.",
        "Category": " Business & Economics , International , Economics",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "The Baseball Hall of Fame 50th Anniversary Book",
        "Authors": "By Astor, Gerald",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "7.33",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "What You Don't Know About Turning 60: A Funny Birthday Quiz",
        "Authors": "By Witte, P. D.",
        "Description": "What You Don't Know About Turning 60 is a hilarious pop quiz to ease the pain of a 60th birthday. This charming humor book provides entertainment for over-the-hill birthday parties and is fun to read when the party's over and reality sets in.Sample jokes include:- Q: What's a senior screwdriver? A: Orange Juice and Metamucil.- Q: What do the following words bring to mind: \"free refills?\" A: If you said coffee, you're probably under 60. If you said a good prescription drug plan, you're probably 60 or older.",
        "Category": " Humor , Topic , Marriage & Family",
        "Publisher": "Running Press Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The Great Book of Combat Aircraft (Elite Attack Forces)",
        "Authors": "By Matricardi, Paolo",
        "Description": "",
        "Category": " Transportation , Aviation , History",
        "Publisher": "White Star Editions",
        "Price Starting With ($)": "9.07",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Antoine Gilly's feast of France: A cookbook of masterpieces in French cuisine",
        "Authors": "By Gilly, Antoine",
        "Description": "",
        "Category": "",
        "Publisher": "Galahad Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Unscientific America: How Scientific Illiteracy Threatens our Future",
        "Authors": "By Mooney, Chris and Kirshenbaum, Sheril",
        "Description": "In his famous 1959 Rede lecture at Cambridge University, the scientifically-trained novelist C.P. Snow described science and the humanities as \"two cultures,\" separated by a \"gulf of mutual incomprehension.\" And the humanists had all the cultural power—the low prestige of science, Snow argued, left Western leaders too little educated in scientific subjects that were increasingly central to world problems: the elementary physics behind nuclear weapons, for instance, or the basics of plant science needed to feed the world's growing population.Now, Chris Mooney and Sheril Kirshenbaum, a journalist-scientist team, offer an updated \"two cultures\" polemic for America in the 21st century. Just as in Snow's time, some of our gravest challenges—climate change, the energy crisis, national economic competitiveness—and gravest threats--global pandemics, nuclear proliferation—have fundamentally scientific underpinnings. Yet we still live in a culture that rarely takes science seriously or has it on the radar.For every five hours of cable news, less than a minute is devoted to science; 46 percent of Americans reject evolution and think the Earth is less than 10,000 years old; the number of newspapers with weekly science sections has shrunken by two-thirds over the past several decades. The public is polarized over climate change—an issue where political party affiliation determines one's view of reality—and in dangerous retreat from childhood vaccinations. Meanwhile, only 18 percent of Americans have even met a scientist to begin with; more than half can't name a living scientist role model.For this dismaying situation, Mooney and Kirshenbaum don't let anyone off the hook. They highlight the anti-intellectual tendencies of the American public (and particularly the politicians and journalists who are supposed to serve it), but also challenge the scientists themselves, who despite the best of intentions have often failed to communicate about their work effectively to a broad public—and so have ceded their critical place in the public sphere to religious and commercial propagandists.A plea for enhanced scientific literacy, Unscientific America urges those who care about the place of science in our society to take unprecedented action. We must begin to train a small army of ambassadors who can translate science's message and make it relevant to the media, to politicians, and to the public in the broadest sense. An impassioned call to arms worthy of Snow's original manifesto, this book lays the groundwork for reintegrating science into the public discourse--before it's too late.",
        "Category": " Political Science , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Don't Shoot Yourself in the Foot",
        "Authors": "By Amen, Daniel",
        "Description": "Self-defeating behavior plagues many people, making it impossible for them to be as successful as they could be. Using questionnaires and exercises to help turn one's career and personality around, this guide shows readers 27 self-sabotaging characteristics, ways to conquer self-defeating behavior, nine rules for defining success, and much more.",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "IdeaSpotting: How to Find Your Next Great Idea",
        "Authors": "By Harrison, Sam",
        "Description": "The next big idea is out there?You just have to know how to spot it Creativity is crucial to business and design success. How do you unleash bursts of creativity, increase occurrences of spontaneity and ultimately find great ideas? Through anecdotes, interviews, quotes, tips, creative exercises and success stories from the biggest corporations in the country, author Sam Harrison shows you how to think outside the box?then throw away the box for good. You'll be encouraged to: Listen and observe Step outside your daily routine Explore through travel Find ideas in nature Break out of ruts  Learn from mistakes Get past the surface Connect existing ideas Busy professionals CAN learn how to peek under the mundane to find the magical, to find insights rather than information, and to learn what makes their clients laugh, cry, scream?and ultimately buy.",
        "Category": " Psychology , Creative Ability",
        "Publisher": "HOW",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Runner's World Performance Nutrition for Runners: How to Fuel Your Body for Stronger Workouts, Faster Recovery, and Your Best Race Times Ever",
        "Authors": "By Fitzgerald, Matt",
        "Description": "Runner's World Performance Nutrition for Runners by Matt Fitzgerald offers runners up-to-date nutrition advice based on the latest scienceRunners have different nutrition and recovery needs than other endurance athletes. Yet until now, they've had no nutritional resource specifically addressing their concerns.This comprehensive guide distills the newest thinking in the science of exercise nutrition into practical, hands-on tips that will help runners stay healthy, recover faster, enjoy better workouts, and race successfully. Readers will learn:• detailed information on nutritional topics important to runners, from balancing internal energy stores to proper hydration• how to customize their diets to their individual training needs• shopping tips and dining-out strategies to help runners maximize their nutritional intake• the top 5 pre-race meals and top 5 healthiest snacks for runners• nutritional tips for special populations, including women, children, diabetics, and older runners",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "500 Ways to Change the World",
        "Authors": "By Temple, Nick (EDT)",
        "Description": "500 Ways to Change the World is a think tank for social inventions, great ideas, and proven projects that will help improve the world we live in. Inside, you will find hundreds of examples of creative people using their imaginations to benefit us all. From politics and relationships to housing and the arts, you will learn how to transform problems into possibilities. We hope you are inspired by the ideas and that you will use them and create your own.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.5",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Prayer of Mary",
        "Authors": "By Fournier, Keith A. and Gilbert, Lela",
        "Description": "In this readable, succinct volume, Keith Fournier portrays the young virgin of Nazareth in a fresh light as an antidote to the spiritual ills of the age. The Prayer of Mary presents humility, simplicity, and selfless love as fitting responses to the loving invitation of God, who visits people in their daily lives and invites them into a relationship with Him.",
        "Category": " Religion , Spirituality",
        "Publisher": "Thomas Nelson Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2012"
        }
    },
    {
        "Title": "The South Beach Heart Health Revolution: Cardiac Prevention That Can Reverse Heart Disease and Stop Heart Attacks and Strokes (The South Beach Diet)",
        "Authors": "By Agatston, Arthur, M.D.",
        "Description": "\"Another masterpiece! The author of The South Beach Diet has taken a sharpshooter's aim at heart disease, the Normandy Beach for half of all Americans.\"—Mehmet Oz, M.D., co-author of You: An Owner's Manual and You: On a DietHeart disease is the number one killer of men and women in this country. This year alone, 865,000 people will have a new or recurrent heart attack, and another 700,000 will have a stroke. Don't become a statistic—heart attacks and strokes can be prevented!In The South Beach Heart Health Revolution, Dr. Arthur Agatston's innovative approach to heart disease prevention will show you how to protect your heart and live a longer, healthier life. He not only explains how to assess your cardiac risks and avoid unneccessary surgery, but also teaches you how to make life-saving changes, including rethinking your eating and exercise habits, to beat the odds of suffering from cardiovascular disease.Dr. Agatston explains:How you can have a negative stress test and still be at risk for a heart attack Why your cholesterol level may not accurately indicate your risk for heart attack How a simple noninvasive heart scan can reveal if you are a cardiac time bomb Why belly fat can be deadly—and what you can do about it What you need to know about life-saving state-of-the-art blood testing, heart imaging, medications, and more How to transform your lifestyle with satisfying heart-healthy eating and an exercise program that's easy to integrate into your daily routineThe South Beach Heart Health Revolution will change the way you treat your health, your heart, and your approach to living well.\"This book is a must-read for everyone who wonders about their risk, and the risk of a loved one, to suffer a heart attack and what to do about it.\"—H. Robert Superko, MD, FACC, FAHA; chairman, Molecular, Genetic, and Preventative Cardiology, Fuqua Heart Center of AtlantaArthur Agatston, M.D., is a preventative cardiologist in Miami Beach and an associate professor of medicine at the University of Miami Miller School of Medicine. Combined sales of his mega-bestseller, The South Beach Diet, and companion titles, have topped 22 million copies. He has authored groundbreaking studies and is frequently quoted in the media as a diet and cardiac health expert.Previously published as The South Beach Heart Program",
        "Category": " Medical , Cardiology",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Something New to Do (Happy Times Adventures)",
        "Authors": "By Palmer, Jan (ILT), Pellowski, Michael, and Michaels, Ski",
        "Description": "Constantly in search of new things to do, a young octopus has some scary experiences",
        "Category": "",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Wonderful Wire Works: An Easy Decorative Craft",
        "Authors": "By Baskett, Mickey",
        "Description": "“Material of choice is wire—as in screens, meshes, and filaments....Tools and equipment are simple, such as glues, pliers, and cutters....more than 60 fairly easy-to-follow patterns, from a wrapped amber necklace and decorated goblets to a wondrous mesh handbag.”—Booklist. “Fun project ideas.”—Good Housekeeping.",
        "Category": " Crafts & Hobbies , Metal Work",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Mother and Daughter- Friends of the Heart",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Adventures of Huckleberry Finn (Junior Classics for Young Readers) by Marck Twain (2010) Paperback",
        "Authors": "By Marck Twain",
        "Description": "",
        "Category": "",
        "Publisher": "Creative Edge",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Strong Women, Strong Backs: Everything You Need to Know to Prevent, Treat, and Beat Back Pain",
        "Authors": "By Nelson, Miriam E. and Lindner, Lawrence",
        "Description": "From the bestselling author of the Strong Women health series, an essential program for a strong, healthy, pain-free back and a toned midsection.  In this accessible guide, trusted women's health author and exercise physiologist Miriam E. Nelson presents the essential information every woman needs to know to maintain a healthy back. Complete with clear explanations, practical advice, and lively anecdotes from women who have benefited from this simple and effective program, the book discusses:  - the major causes of back pain in women; - how stress and other emotional matters play a key role; - a straightforward exercise program to improve flexibility, strength, and aerobic fitness-designed specifically for women; - advice for creating a back-friendly home and office; and - explanations of the medical options available-and how to know when they might be necessary.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Gary Vaynerchuk's 101 Wines",
        "Authors": "By Vaynerchuk, Gary",
        "Description": "Millions have logged onto Gary Vaynerchuk's Wine Library TV—watching him boldly and unconventionally rate hundreds of wines. Viewers are attracted to his youthful energy, unique voice, and often outrageous descriptions. Now, in Gary Vaynerchuk's 101 Wines, Vaynerchuk reveals his first ranked list of the most exciting and tantalizing spirits he has sampled while traveling the globe.      Deeming himself \"the wine guy for the average Joe,\" Vaynerchuk avoids the pomposity of traditional educators. Unlike wine guides that lack animation and lecture rather than inspire, 101 Wines shows you how to develop the necessary go-drink-wine attitude. Vaynerchuk encourages you to trust your own palate—stressing that your love of a certain wine makes it good regardless of what the experts or the price on the bottle say.      Vaynerchuk's recommendations span a wide range of prices, nations, grapes, and styles—allowing everyone from novices to connoisseurs to expand their wine horizons. Unlock the secret to why Vaynerchuk labels wines \"From Ruins to Riches,\" \"Red with Fish,\" and \"Not Your Father's Spumante.\" Discover wines that taste like ones 10 times their price. Read as Vaynerchuk illuminates his top choices with vivid terminology such as \"Bring the Thunder\" and \"Riding the Rainbow.\" Demystify conventions that once limited your wine-tasting desires. Journey through wine styles and break down barriers with his technical notes and stories behind the vintage. Smile as you realize you too can become a wine aficionado.       With your newfound knowledge, you will out-entertain and enlighten your friends, host extraordinary parties and treat your taste buds to an exhilarating ride. So if you are ready to become a \"Vayniac\"—one devoted to selecting wines based on Vaynerchuk's innovative principles—grab that corkscrew because a wine sampling adventure like no other awaits.",
        "Category": " Cooking , Beverages , Alcoholic , General",
        "Publisher": "Rodale",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Angels All Around",
        "Authors": "By Hickey, Marilyn",
        "Description": "",
        "Category": " Religion , Christian Theology , Angelology & Demonology",
        "Publisher": "Marilyn Hickey Ministry",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Professional Killers",
        "Authors": "By Kerr, Gordon",
        "Description": "",
        "Category": " True Crime , Murder , Serial Killers",
        "Publisher": "Time Warner Books Uk",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Peru (Insight Guide Peru)",
        "Authors": "By Barrett, Pam",
        "Description": "",
        "Category": " Travel , South America , General",
        "Publisher": "APA Publications",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Being Vegetarian (2nd Edition)",
        "Authors": "By Wolfe, Frankie Avalon",
        "Description": "This guide is for anyone who has considered cutting down on meat, fish, or fowl intake, whether going completely vegetarian or not.  It is the perfect introduction to both going meatless and the vegetarian lifestyle.  The author focuses on ways to change eating habits as painlessly as possible.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Alpha",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "King Arthur and his knights;",
        "Authors": "By Frith, Henry",
        "Description": "",
        "Category": "",
        "Publisher": "Junior Deluxe Editions",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "America's Road : A photographic journey across the National Road from Baltimore to East St. Louis",
        "Authors": "By Russell C. Poole",
        "Description": "",
        "Category": "",
        "Publisher": "Phoenix Imagery Press, LLC",
        "Price Starting With ($)": "29.96",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Peter & the Wolf",
        "Authors": "By Prokofiev, Sergey, Loriot, and Muller, Jorg (ILT)",
        "Description": "An adaptation of the musical tale, accompanied by color illustrations of plucky Peter, the little bird, the slinky cat, and the wolf",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Venice ((Timeless Places Series))",
        "Authors": "By Bonfante-Warren, Alexandra",
        "Description": "",
        "Category": "",
        "Publisher": "Barne & Noble Books",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Hawaii: Magnificent wilderness",
        "Authors": "By Gnass, Jeff",
        "Description": "",
        "Category": "",
        "Publisher": "Westcliffe Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Your Garden Homestead on Inches, Yards, or Acres",
        "Authors": "By Powell, Thomas",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin Co (P)",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Realist Image of Man (1965-1914) (Prose and Poetry of America, Volume 2)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "L.W. Singer Company, a division of Random House, Inc.",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "On Your Own Edition",
        "Authors": "By Zuckerman, Laurie",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Upstart Publishing Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Triathlete's Training Bible (2nd Edition)",
        "Authors": "By Friel, Joe",
        "Description": "This new edition of  The Triathlete's Training Bible  covers all of the specialized training needs of triathletes, including completely updated nutrition, recovery, and weight training information. The book also contains seasoned advice on the mental aspects of training. Author Joe Friel shows how to achieve greater fitness by examining personal strengths and weaknesses, and devotes individual chapters to planning, racing, rest, and recovery. Appendices include annual training plan worksheets and suggested swim, bike, run, and combined workouts.",
        "Category": " Sports & Recreation , Triathlon",
        "Publisher": "Velo Press",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The Practical Gardener: The Complete Guide to Creating and Maintaining Every Garden",
        "Authors": "By Squire, David",
        "Description": "A comprehensive guide to such gardening designs as boundary gardens, patio gardens, pond gardens, and greenhouse gardens is accompanied by twenty \"Plant Profile\" spreads that feature ideal plants for particular situations.",
        "Category": " Gardening , General",
        "Publisher": "Random House Value Pub",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Pleasures of the Garden: Images from the Metropolitan Museum of Art",
        "Authors": "By Griswold, Mac",
        "Description": "Looks at paintings, drawings, and prints from around the world that portray the pleasures of gardens, and discusses garden plans, follies, and Oriental gardens",
        "Category": "",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Trouble in Space (Giant First-Start Reader)",
        "Authors": "By Greydanus, Rose and Page, Don (ILT)",
        "Description": "When Teddy's spaceship develops problems, he has to parachute to safety",
        "Category": "",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.45",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Making Yourself at Home: Finding Your Style and Putting It All Together",
        "Authors": "By Seymour, Jane",
        "Description": "The award-winning actress offers a visual tour of her own Malibu home to reveal the innovative design concepts and simple decorating solutions that she uses to create a beautiful home décor, in a decorating handbook that is enhanced by lush full-color photography, personal anecdotes, and helpful design tips and ideas.",
        "Category": " House & Home , Decorating",
        "Publisher": "Dk Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Breaking the Rules: A Novel (Troubleshooters)",
        "Authors": "By Brockmann, Suzanne",
        "Description": "Izzy Zanella wasn’t looking for another reason to butt heads with his Navy SEAL teammate, and nemesis, Danny Gillman. But then he met Danny’s beautiful younger sister, Eden. When she needed it most, he offered her a place to stay, a shoulder to cry on—and more. And when she got pregnant with another man’s child, he offered her marriage. But Eden’s devastating miscarriage shattered their life together—and made the intense bad blood between Izzy and Danny even worse. Now Eden’s back, and she’s on a mission to rescue her teen brother, Ben, from their abusive stepfather. Even if she and Izzy can prove that their broken marriage is still in one piece, winning legal custody of Ben is a long shot. But they’re not alone: Danny and his girlfriend, Jenn, offer to help, and he and Izzy agree to bury the past and fight for Ben’s future. As they plan their strategy, Izzy and Eden grapple with the raw passion that still crackles between them—while Danny and Jenn confront new depths in their own rocky relationship. But events take a terrifying turn after Ben befriends a girl fleeing a child prostitution ring. When the young runaway seeks refuge with Eden and Izzy, her pursuers kidnap Ben—and a deadly standoff begins. Now they must all pull together like never before and strike back, swift and hard, to protect their unconventional little family and everything they hold most precious.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Spud",
        "Authors": "By Van De Ruit, John",
        "Description": "The record-breaking, bestselling Spud arrives in paperbackJOHN ?SPUD? MILTON takes his first hilarious steps toward manhood in this delicious, laugh-out-loud boarding school romp, full of midnight swims, raging hormones, and catastrophic holidays that will leave the entire family in hysterics and thirsty for more!",
        "Category": " Young Adult Fiction , Boys & Men",
        "Publisher": "Razorbill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Cooking With Kids for Dummies",
        "Authors": "By Heyhoe, Kate",
        "Description": "Offering hundreds of cooking ideas, a recipe source that goes beyond the mere cookbook suggests foolproof ways of getting children involved in cooking and meal planning, with step-by-step instructions, nutritional guides, and clever tips. Original.",
        "Category": " Cooking , Reference",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Loving Gifts from Heaven-Comfort and Counsel from Loved Ones Above",
        "Authors": "By Mary Shannon Bell",
        "Description": "",
        "Category": "",
        "Publisher": "Loving Gifts From Heaven, LLC",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Robert Ludlum's The Bourne Objective (Jason Bourne, Book 8)",
        "Authors": "By Lustbader, Eric",
        "Description": "Facing down mercenaries in Africa, Jason Bourne witnesses the death of an art dealer named Tracy Atherton. Her killing dredges up snatches of Bourne's impaired memory, in particular the murder of a young woman on Bali who entrusted him with a strangely engraved ring­­-an artifact of such powerful significance that people have killed to obtain it. Now he's determined to find the ring's owner and purpose. But Bourne never knows what terrible acts he'll discover he committed when he digs into the past.The trail will lead him through layers of conspiracy to a vicious Russian mercenary, Leonid Arkadin, who was also a graduate of the Central Intelligence training program Treadstone. A covert course designed to create ruthless assassins for C.I., it was shuttered by Congress for corruption. Yet before it was dismantled, it produced Bourne and Arkadin, giving them equal skills, equal force, and equal cunning. As Bourne's destiny circles closer to Arkadin's, it becomes clear that the eventual collision of these men is not of their own making. Someone else has been watching and manipulating them. Someone who wants to know, Who is the more deadly agent?",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Vision",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Washington Manual of Medical Therapeutics, 31st Edition",
        "Authors": "By Green, Gopa B. (EDT), Harris, Ian S. (EDT), Lin, Grace A. (EDT), and Moylan, Kyle (EDT)",
        "Description": "Established for over 40 years as the \"Bible\" of the medical ward, The Washington Manual® of Medical Therapeutics is now in its Thirty-First Edition and builds upon that proud tradition—with even more of the current information clinicians need, with a focus on inpatient care, delivered in a timesaving, quick-reference style. This edition includes the latest facts on nosocomial infections, West Nile virus, and agents of bioterrorism; the latest management of AIDS/HIV; and current JNC VII guidelines for management of hypertension. Drug appendices have a new quick-scanning format for rapid information retrieval.  This edition is also available electronically for handheld computers. See Media listing for details.  The Washington Manual® is a registered mark belonging to Washington University in St. Louis to which international legal protection applies. The mark is used in this publication by LWW under license from Washington University.",
        "Category": " Medical , Reference",
        "Publisher": "Lippincott Williams & Wilkins",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Princess Madison and the Royal Darling Pageant (Princess Madison Trilogy)",
        "Authors": "By Linamen, Karen Scalf and Hornung, Phyllis (ILT)",
        "Description": "In an attempt to prove to herself and her sister that she is a real princess, Madison looks for a frog to kiss, ends up sleeping on a small pea, and enters the Royal Darling Pageant in quest of a crown, but she learns that you don't need to dress or act a certain way to be valuable in God's eyes.",
        "Category": " Juvenile Fiction , Social Themes , Self-Esteem & Self-Reliance",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Honey, Garlic, & Vinegar: Home Remedies & Recipes : The People's Guide to Nature's Wonder Medicines",
        "Authors": "By Quillin, Patrick",
        "Description": "",
        "Category": " Health & Fitness , General",
        "Publisher": "Leader Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Nutrition During Pregnancy and Lactation: An Implementation Guide",
        "Authors": "By Institute of Medicine, Subcommittee for a Clinical Applications Guide",
        "Description": "A practical guide for health care professionals to smoothly integrating maternal nutritional care into their practices. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Medical , General",
        "Publisher": "National Academies Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Study Guide for Psychology",
        "Authors": "By Hockenbury, Don H. and Hockenbury, Sandra E.",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Worth Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "A Taint in the Blood: A Novel of the Shadowspawn",
        "Authors": "By Stirling, S. M.",
        "Description": "From S. M. Stirling, the “master of speculative fiction” (Library Journal) and the author of the New York Times bestselling Novels of the Change, comes a new vision, as a man battles the dark forces of the world—including those in his own blood…             Aeons ago, Homo nocturnus ruled the Earth. Possessing extraordinary powers, they were the source of all manner of myths and legends. Though their numbers have been greatly reduced, they exist still—though not as purebreds.Adrian Brézé is one such being. Wealthy and reclusive, he is more Shadowspawn than human. He rebelled against his own kind, choosing to live as an ordinary man, fighting against his darker nature. But Adrian’s sister is determined to bring back the reign of the Shadowspawn, and now she has struck him at his weakest point by kidnapping his human lover, Ellen.                              To save Ellen—and perhaps all of humanity—Adrian must rejoin a battle he swore he would never fight again.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Never Look Back",
        "Authors": "By Linda Lael Miller",
        "Description": "",
        "Category": "",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Just Casseroles: Recipes from Family and Friends",
        "Authors": "By Walker, Jennifer C.",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Casseroles",
        "Publisher": "Tradery House",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Creative Window Treatments (Creating Your Home Series)",
        "Authors": "By Eaglemoss Publications Ltd",
        "Description": "Provides instructions for making curtains, blinds, valances, and accessories",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Betterway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Case of the Dumb Bells (I Can Read Mystery)",
        "Authors": "By Bonsall, Crosby Newell",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Beaky",
        "Authors": "By Alborough, Jez",
        "Description": "Embarking on a joyful journey of self-discovery, Beaky, a fluffy fellow with a bright blue beak and a curly orange tail, tries to determine what sort of creature he is",
        "Category": "",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "The End of Anger: A New Generation's Take on Race and Rage",
        "Authors": "By Cose, Ellis",
        "Description": "“A tremendously important book—gracefully done, painfully perceptive…fearless in its honesty.”—Jonathan Kozol, author of Savage Inequalities“The most authoritative accounting I’ve seen of where our country stands in its unending quest to resolve the racial dilemma on which it was founded.”—Diane McWhorter, Pulitzer Prize-winning author of Carry Me Home“The End of Anger may be the defining work on America’s new racial dynamics.”—Anthony D. Romero, Executive Director of the American Civil Liberties UnionEllis Cose is a venerated voice on American life. With The End of Anger, he offers readers a sharp and insightful contemporary look at the decline of black rage, the demise of white guilt, and the intergenerational shifts in how blacks and whites view and interact with each other. A new generation’s take on race and rage, The End of Anger may be the most important book dealing with race to be published in the last several decades.",
        "Category": " Social Science , Discrimination & Race Relations",
        "Publisher": "Ecco",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Notes from the Edge Times",
        "Authors": "By Pinchbeck, Daniel",
        "Description": "In this unsparing tour of the perils and promises of the current era,   visionary author Daniel Pinchbeck helps us understand that we don't need to wait   for the dawning of the next age to radically change our perspectives.       In the years since his pioneering work 2012, Daniel Pinchbeck has touched   a legion of readers hungry for insight and guidance about new ways of living   amid the crises of the current moment.    Notes from the Edge Times collects Pinchbeck's most penetrating recent   columns, articles, and essays that amount to an extraordinary mosaic view of the   hopes, nightmares, and signs of breakthrough that mark our present era.   Pinchbeck examines the current economic collapse (an event he had foreseen by   many months), radical political and ecological alternatives, the uses of   psychedelics for spiritual insight, the revival of the sexual revolution,   unexplained phenomena such as crop circles and the Norway spiral, the imminent   (and often-misunderstood) question of 2012, and what it means to be an artist in   a time of radical change.    Pinchbeck's virtuosity as a social critic, on full display in these pieces, is   his ability to illuminate real and serious questions within unconventional   topics that most literary intellects are unwilling to touch, from secret weapons   systems to extrasensory abilities to the intelligence of plant life.   In Notes from the Edge Times, Pinchbeck does more than critique present-  day questions and conflicts; he provides fresh ideas for living more consciously   now, and for constructing our own more enlightened futures, even as the world   around us faces profound environmental, social, and spiritual challenges",
        "Category": " Religion , Eschatology",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Against All Odds: My Life of Hardship, Fast Breaks, and Second Chances",
        "Authors": "By Brown, Scott",
        "Description": "Against All Odds is the extraordinary personal story of the man who rose up to meet the challenge of terrific opposition and become one of America's most promising new political figures—Senator Scott Brown. Brown is famous for succeeding popular Massachusetts Senator Ted Kennedy after Kennedy’s death in 2010—but, as he reveals in a compelling memoir reminiscent of Sarah Palin’s Going Rogue and Clarence Thomas’s My Grandfather’s Son, his experiences with struggle and achievement go back a lifetime.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "Toward a True Kinship of Faiths: How the World's Religions Can Come Together",
        "Authors": "By Dalai Lama XIV",
        "Description": "?No country, no culture, no person today is untouched by what happens in the rest of the world.  Technological innovation, environmental degradation, economic gain & loss, nuclear weapons, instant communication have all created unprecedented familiarity among the world’s many cultures. With this historic development, the Dalai Lama understands that the essential task of humanity in the 21st Century is to cultivate peaceful coexistence.   Many believe in the inevitability of an escalating “clash of civilizations”.  Peaceful coexistence has long been problematic with religion, and while previous conflicts over religious differences may have been significant and regrettable, they did not threaten the very survival of humanity. Now, when extremists can persuade followers with the immense emotional power of faith and have access to powerful technological resources, a single spark could ignite a powder keg of frightening proportions.  Yet the Dalai Lama shows how the challenges of globalization can also move us in another direction, to a deeper plane where nations, cultures, and individuals connect through their shared human nature.  All major religions confront the same perennial questions; each have distinct forms of expression. But this marvelous diversity of insight has the potential for inspiring dialogue which can enrich everyone’s pursuit of wisdom.  All faith traditions turn to compassion as a guiding principle for living a good life. It is the task of all people with an aspiration to spiritual perfection to affirm the fundamental value of the compassion. In this way we can truly develop a deep recognition of the value of other faiths, and on that basis, we can cultivate genuine respect. In Toward a True Kinship of Faiths, the Dalai Lama also explores where differences between religions can be genuinely appreciated without serving as a source of conflict. The establishment of genuine harmony is not dependent upon accepting that all religions are fundamentally the same or that they lead to the same place.  Many fear that recognizing the value of another faith is incompatible with having devotion to the truth of one’s own.  Nevertheless, the Dalai Lama profoundly shows how a sincere believer can, with integrity, be a pluralist in relation to other religions without compromising commitment to the essence of the doctrinal teachings of their own faith. An issue of central importance for the Dalai Lama personally and for the entire world in general, Toward a True Kinship of Faiths offers a hopeful yet realistic look at how humanity must step into the future.",
        "Category": " Religion , Buddhism , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Start With Me: A Modern Parable",
        "Authors": "By Seaton, Michael and Blase, John (CON)",
        "Description": "Start with Me is part of start>Becoming a Good Samaritan, a nationwide church and small group experience that features an impressive list of national and international supporters—including host and award-winning author John Ortberg, Eugene Peterson, Philip Yancey, Matthew Sleeth, Jim Cymbala, Chuck Colson, Archbishop Desmond Tutu, Brenda Salter McNeil, Kay Warren, Joni Eareckson Tada, Rob Bell, Shane Claiborne, and many others.In Start with Me, a group of fictional friends in Santa Fe, New Mexico are leading normal, safe, Christian lives. Independently, each of them has begun to wonder, “Isn’t there more?” As their stories unfold, you will begin to experience what it looks like to step out in faith and act upon Jesus’ command to “love our neighbors” in a hurting world.Like the characters in the book your life will be transformed as you search for your own starting point and ask God to direct your path to the person that needs your help, your healing touch, your prayers… your neighborly love!",
        "Category": " Religion , Christian Ministry , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Paris, Baby!: An American Girl's Real-Life Adventures Having a Baby in the City of Lights",
        "Authors": "By Lobe, Kirsten",
        "Description": "Is it possible to maintain chic as a single-mom-to-be in a city where it's all supposed to be effortless and breastfeeding is a horreur?  Does one live by the Parisienne's pregnancy plan of smoking, drinking, and cheese-eating avec vin blanc, but jamais jamais gain more than six kilos? And how to handle a pickup attempt by a married man in the baby department of Bon Marché when you're eight months along?  After all, American girls do things differently: Lamaze class and baby showers, sensible prenatal care and…family to watch you proudly grow more and more pregnant.Paris is full of delights for a new mom: the Luxembourg Gardens, baby boutiques too precious to be passed by, a petit brioche for a teething tot.  But home exerts a powerful pull. Should your child grow up skipping by the Seine or scampering up a tree house?  Should it be \"Mommy\" or \"Maman\"? And can a tall blonde with a taste for Veuve Cliquot and Vuitton ever make it in the land of mom jeans and Happy Meals?Paris, Baby! is novelist Kirsten Lobe's warm, funny memoir about Paris, Frenchmen, friendship, babies, and making it on one's own.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Howard Dean's Prescription for Real Healthcare Reform: How We Can Achieve Affordable Medical Care for Every American and Make Our Jobs Safer",
        "Authors": "By Dean, Howard, Volsky, Igor, and Shakir, Faiz",
        "Description": "\"What would real healthcare reform look like? And how can everyday Americans trump big money and put healthcare back on track? Howard Dean speaks out.\"The success of healthcare reform legislation rises and falls on whether the American public is allowed to opt into a universally available public healthcare program, like Medicare, or not. If Congress issues a bill that gives Americans a public option, then there will be real healthcare reform. If not, we could be back fighting about it for another 20 years before anybody tries again.\"--Howard DeanAmericans have pondered how to reform healthcare since the days of Harry Truman. But, for most Americans, little has changed--except that healthcare costs have soared, health insurance companies have grown richer, and, today, even those Americans who pay dearly for health insurance frequently find that their policies don't adequately cover them when they need their coverage most.Something has got to give. In his bold, new book, Howard Dean-the physician and former governor widely credited for reviving the Democratic Party after the 2004 elections-tells Americans what needs to be done to successfully reform healthcare. One key, he writes, is to offer Americans the option to participate in a public healthcare program, much like Medicare. \"America has had 'socialized' medicine since 1964,\" says Dean. \"It's called Medicare; it covers every American over 65, and the majority of them are happy with the program. The rest of America deserves a similar option.\"In this straight-talking guide to rising above today's healthcare crisis, Dean spells out:What Obama's healthcare plan is all aboutHow other countries handle healthcareWhich special interests are standing in the way of progress and whyHow healthcare reform will help American businesses prosperWhy Americans need choice--between private or public health coverageMillions of Americans lack health insurance; millions more pay for coverage that doesn't protect them from serious illness; and the status quo leaves Americans at the mercy of corporate interests. In this persuasive argument from a passionate political strategist, Americans learn how to take back the healthcare reins.",
        "Category": " Political Science , Public Policy , General",
        "Publisher": "Chelsea Green Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Essential Italian Grammar (Dover Language Guides Essential Grammar)",
        "Authors": "By Ragusa, O.",
        "Description": "In this very useful manual, Dr. Ragusa has presented all the Italian really needed in everyday life and contemporary situations, without devoting space to the intricacies of literary, archaic, and poetic forms that you are not likely to need.It is remarkable how readily Italian grammar lends itself to this form of essential grammar, for within this book Miss Ragusa has presented her material with such clarity that you will probably remember most of what you have read after a single reading. Among the unusual features of this presentation are an extremely clear statement of the complex pronoun situation, an easily followed analysis of the various verb tenses and moods, and a most useful discussion of the many verb idioms that are so important in Italian.All the major aspects of Italian grammar are presented in logical, developmental order: vocabulary, vocabulary building, word order, turning negative sentences into positive and vice versa, forming questions, nouns, articles, prepositions, adjectives, adverbs, verbs, verbal idioms, and whatever else is necessary to a knowledge of essential Italian. An appendix contains clear definitions of all the grammatical terms used in the book.Essential Italian Grammar is not a simplified grammar, not an abridged grammar, but a selected grammar for adult use, with emphasis upon explanation rather than rote memory, and with inclusion of much phrase material for examples. It can be used as a supplement to a course, as an introduction, or as a refresher for those who have already studied Italian.",
        "Category": " Foreign Language Study , Multi-Language Phrasebooks",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1963"
        }
    },
    {
        "Title": "Producer: Lessons Shared from 30 Years in Television",
        "Authors": "By Walker, Wendy, Cagan, Andrea (CON), and King, Larry (FRW)",
        "Description": "For the past seventeen years, Wendy Walker has been the \"woman behind the man\" at Larry King Live. As King's senior executive producer, she has been responsible for landing exclusive interviews with the most important newsmakers and well-known celebrities from around the globe that have been the hallmark of CNN's iconic show.From the shocking death of Michael Jackson to the first television interview with the Watergate scandal's Deep Throat, Wendy Walker has a wealth of never-before-shared stories involving the most relevant events and people of our time.Starting as an ABC secretary over thirty years ago, she has risen through the male-dominated world of television production. Her passion, intellect, and work ethic are undeniable, but it's her heart that has always been her guide. It's with the same zeal and loving spirituality that she shares the insights gained during her long climb to the top. With empowering advice and inspirational thoughts, Wendy Walker has  not only gained a lifetime of experience, but the wisdom to know that it needs to be shared.",
        "Category": " Performing Arts , Television , Direction & Production",
        "Publisher": "Center Street",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "The Self-Compassion Diet: A Step-by-Step Program to Lose Weight with Loving-Kindness",
        "Authors": "By Fain, Jean",
        "Description": "Self-Love: Your Greatest Guide on the Path to Healthy WeightThe secret to sustainable weight loss isn’t counting calories or depriving yourself at the dinner table. Jean Fain tells us it’s about cultivating awareness and self-acceptance wherever you are. With The Self-Compassion Diet, this Harvard Medical School–affiliated psychotherapist prescribes a practical program for transforming the way you think and feel about food and your whole self—a shift that, paradoxically, inspires physical change.Combining loving-kindness, self-hypnosis, and other winning weight-loss strategies, The Self Compassion Diet is available in two complementary formats to help you naturally progress toward genuine self-acceptance and a healthy, sustainable weight.With more than 30 different tools including quizzes, breathing exercises, and visualizations, the book explores four powerful weight-loss methods. The audio edition guides you through 11 key practices described in the book. Used together, this powerful combination can speed learning and boost success. Additional topics include:How to appreciate the everyday activity of eating, and learn to trust your body’s signals that it’s nourishedGradual change—a guided visualization for developing mindful eating habitsA meditation for getting to know the diet coach who knows you best—your compassionate inner advisor“Most dieters try to ‘kill cravings’ and break habits with self-discipline,” teaches Fain. “Self-kindness can help quiet the shame that traditional diets instill, and establish a harmonious relationship with food.” The Self Compassion Diet book and audio offer a treasury of heart-opening mind-body teachings and practices for improving the way you live, breathe, and eat.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Sounds True",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Baseball for Dummies 3rd Edition",
        "Authors": "By Morgan, Joe, Lally, Dick, and Anderson, Sparky (FRW)",
        "Description": "\"Joe Morgan again shows himself a rare bird: an ex-jock with savvy and the ability to communicate it.\"—People\"This book has something for everybody, from longtime fans to Little Leaguers.\"—New York NewsdayBaseball For Dummies, Third Edition, is for baseball fans at all levels, from players and coaches to spectators who love the game. Baseball Hall of Fame player and ESPN baseball analyst Joe Morgan explains baseball with remarkable insight, using down-to-earth language so everyone from the casual observer to the die-hard fan can gain a fuller appreciation of the sport. This updated edition features:Everything you need to know about the game, from what it takes to play each position and how to hit and run the bases to what to watch for in the game and how to appreciate the finer points of the sportCoverage of new star players, new stadiums, and game milestonesThe lowdown on today’s baseball Web resourcesThe latest on stats and sabermetricsThe inside story on the new steroid rulesFrom how to throw a knuckleball or hit an inside pitch to how to keep a scorecard or pick a winning fantasy league team, Morgan covers all the bases, showing you how to get the most out of the game. You’ll see how to:Improve your hitting, pitching, and fieldingFind a team to play on, from Little League on upEvaluate stats, players, and recordsCoach or umpire effectivelyGet more out of a trip to the ballparkComplete with Morgan’s personal lists of top-ten pitchers, fielders, and relievers, as well as new quotes from Derek Jeter and Keith Hernandez, Baseball For Dummies gives you all the inside tips, facts, and stats so you can play like a Major Leaguer!",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Illustrator 10 for Windows & Macintosh",
        "Authors": "By Weinmann, Elaine and Lourekas, Peter",
        "Description": "There's a good chance that anyone who's studied vector-based drawing during the last decade has read an Illustrator Visual QuickStart Guide in one of its many versions. Though this book has become the standard text in many design schools, it has evolved over the years along with the program itself. And with some of the radical changes in Illustrator 10 -- such as live distortion tools, dynamic data-driven graphics, and symbols to create repeating Web graphics and keep file sizes small -- the authors thoroughly revised this popular QuickStart Guide.   Illustrator 10 for Windows and Macintosh: Visual QuickStart Guide includes information on all the latest features, a 24-page color section, and clearly marked locators to both new and improved features that can easily be found by simply flipping through the book. Best of all, it's delivered in a highly readable, entertaining, visual, and easy-to-navigate format. This affordable, task-based book may be the only one users need to create powerful graphics for print or Web.",
        "Category": " Computers , Computer Graphics",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "A Traveller's Wine Guide to Spain (Traveller's Wine Guides)",
        "Authors": "By Begg, Desmond",
        "Description": "",
        "Category": " Travel , Europe , Spain & Portugal",
        "Publisher": "Interlink Pub Group Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The Prodigal",
        "Authors": "By Lewis, Beverly",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "100 Days of Fun at School",
        "Authors": "By Craig, Janet Palazzo and Thronburgh, Rebecca (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Focus on Special Effects",
        "Authors": "By Carroll, Don and Carroll, Marie",
        "Description": "Shows how to create striking photographs using strobes, altered light, front and rear projection, multiple exposures, montage, collage, and other darkroom techniques",
        "Category": " Photography , General",
        "Publisher": "Amphoto",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "Gods, Heroes and Men of Ancient Greece (Mentor)",
        "Authors": "By Rouse, W H D",
        "Description": "",
        "Category": " Fiction , Fairy Tales, Folk Tales, Legends & Mythology",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1957"
        }
    },
    {
        "Title": "The natural history of man (A Doubleday Anchor Book)",
        "Authors": "By Weiner, J. S.",
        "Description": "",
        "Category": "",
        "Publisher": "Anchor",
        "Price Starting With ($)": "6.93",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The baby animal zoo (Start-right elf books)",
        "Authors": "By Fisher, Lester E.",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Knitting for Peace: Make the World a Better Place One Stitch at a Time",
        "Authors": "By Christiansen, Betty and Shirobayashi, Kiriko (PHT)",
        "Description": "All across America, people are knitting for peace. In yarn shops and private homes, churches and synagogues, schools and even prisons, they meet on weekday evenings or weekend afternoons to knit afghans for refugees, mittens for the homeless, socks for soldiers, or preemie caps for AIDS babies. The tradition goes back as far as Martha Washington, who spearheaded knitting efforts for the soldiers of the Revolutionary War, and has seen a recent flourishing in what is nowadays called “charity knitting,” “community knitting,” or “knitting for others.” And whether it’s for world peace, community peace, or peace of mind, today’s various causes have the common goal of knitting the world into a better place one stitch at a time. Knitting for Peace is an exceptional book that celebrates the long heritage of knitting for others. It tells the stories of 28 contemporary knitting-for-peace endeavors, and features patterns for easy-to-knit charity projects such as hats, socks, blankets, and bears, plus a messenger bag emblazoned with the Knitting for Peace logo. Enlivened by anecdotal sidebars and quotations from both knitters and peacemakers, this inspiring book also includes everything readers need to know to start their own knitting-for-peace groups. All across America, people are knitting for peace. In yarn shops and private homes, churches and synagogues, schools and even prisons, they meet on weekday evenings or weekend afternoons to knit afghans for refugees, mittens for the homeless, socks for soldiers, or preemie caps for AIDS babies. The tradition goes back as far as Martha Washington, who spearheaded knitting efforts for the soldiers of the Revolutionary War, and has seen a recent flourishing in what is nowadays called “charity knitting,” “community knitting,” or “knitting for others.” And whether it’s for world peace, community peace, or peace of mind, today’s various causes have the common goal of knitting the world into a better place one stitch at a time. Knitting for Peace is an exceptional book that celebrates the long heritage of knitting for others. It tells the stories of 28 contemporary knitting-for-peace endeavors, and features patterns for easy-to-knit charity projects such as hats, socks, blankets, and bears, plus a messenger bag emblazoned with the Knitting for Peace logo. Enlivened by anecdotal sidebars and quotations from both knitters and peacemakers, this inspiring book also includes everything readers need to know to start their own knitting-for-peace groups.",
        "Category": " Social Science , Philanthropy & Charity",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "5-Ingredient Cookbook",
        "Authors": "By Jean Steiner",
        "Description": "",
        "Category": "",
        "Publisher": "Reiman",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    }
]