[
    {
        "Title": "Have You Seen Hyacinth Macaw?",
        "Authors": "By Giff, Patricia Reilly",
        "Description": "Details the adventures of young detective Abby Jones as she and her friend Potsie search through puzzling clues that will help them find Hyacinth Macaw",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "Dinosaur Cousins?",
        "Authors": "By Most, Bernard",
        "Description": "Clever words and vivid illustrations point out the remarkable similarities between animals of today and dinosaurs of yesterday. “Not a scientifically grounded introduction to dinosaurs but instead an imaginative and interesting piece of whimsy.”--Booklist",
        "Category": " Juvenile Fiction , Animals , Dinosaurs & Prehistoric Creatures",
        "Publisher": "Voyager Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "The Practical Guide to Calligraphy",
        "Authors": "By Sasson, Rosemary",
        "Description": "",
        "Category": "",
        "Publisher": "Mud Puddle Books Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "From Here, You Can't See Paris: Seasons of a French Village and Its Restaurant",
        "Authors": "By Sanders, Michael S.",
        "Description": "From Here, You Can't See Paris is a sweet, leisurely exploration of the life of Les Arques (population 159), a hilltop village in a remote corner of France, untouched by the modern era. It is a story of a dying village's struggle to survive, of a dead artist whose legacy began its rebirth, and of chef Jacques Ratier and his wife, Noëlle, whose bustling restaurant -- the village's sole business -- has helped ensure its future.The author set out to explore the inner workings of a French restaurant kitchen but ended up stumbling onto a wider, much richer world. Whether uncovering the darker secrets of making foie gras, hearing a chef confess his doubts about the Michelin star system, or absorbing the lore of the land around a farmhouse kitchen table after a boar hunt, Michael Sanders learned that life in Les Arques was anything but sleepy. Through the eyes of the author and his family, the reader enters this world, discovers its still-vibrant traditions of food, cooking, and rural living, and comes to know the village's history, sharing along the way an American family's adventures as they find their way in a place that is sometimes lonely, often wondrous, and always fascinating.",
        "Category": " Travel , Europe , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Indian Doctor: Nature's Method of Curing and Preventing Disease According to the Indians",
        "Authors": "By Doane, James",
        "Description": "",
        "Category": "",
        "Publisher": "Nancy Locke Doane",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Team-Building Activities for Every Group",
        "Authors": "By Jones, Alanna",
        "Description": "",
        "Category": " Business & Economics , Training",
        "Publisher": "Rec Room Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Incredible Hulk Book of Strength (DK Readers, Level 4)",
        "Authors": "By Buckley, James",
        "Description": "Explores what strength is and how it can be developed using a comic book character, the Incredible Hulk, to demonstrate, and provides information on that character and how he came to be.",
        "Category": " Juvenile Nonfiction , Readers , Intermediate",
        "Publisher": "Dk Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "We See (Dick and Jane)",
        "Authors": "By Penguin Young Readers",
        "Description": "A collection of reissued stories with simple vocabulary featuring Dick, Jane, and other familiar characters.",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Quick & Tasty Christmas Gifts (Memories in the Making Series)",
        "Authors": "By Childs, Anne",
        "Description": "",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Frommer's Maryland & Delaware (Frommer's Complete Guides)",
        "Authors": "By Tilghman, Mary K.",
        "Description": "You'll never fall into the tourist traps when you travel with Frommer's. It's like having a friend show you around, taking you to the places locals like best. Our expert authors have already gone everywhere you might go--they've done the legwork for you, and they're not afraid to tell it like it is, saving you time and money. No other series offers candid reviews of so many hotels and restaurants in all price ranges. Every Frommer's Travel Guide is up-to-date, with exact prices for everything, dozens of color maps, and exciting coverage of sports, shopping, and nightlife. You'd be lost without us!From Civil War battlefields to Baltimore's National Aquarium, these two states offer a wealth of sightseeing and activities. Frommer's is on top of it all, with complete coverage of the best beaches, Oriole Park at Camden Yards, the world-renowned Longwood Gardens, the Winterthur Museum, scenic Chesapeake Bay, beautiful, mountainous Western Maryland, the best crab houses and brewpubs, outdoor adventures, antiquing, and much more. It's all at your fingertips, in true Frommer's style, with dozens of accurate maps, the best hotels and restaurant s in all price ranges, detailed practical tips, and more. Frommer's Maryland & Delaware offers a wealth of sightseeing, sports, strolls, and special moments--from highlights for the first-time visitor to off-the-beaten-track discoveries that will impress even the most seasoned traveler.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Wheels That Vanished (1) (Scooter Spies)",
        "Authors": "By Dahl, Michael",
        "Description": "Eleven-year-old Max Martin and his fellow scooter riders Oscar Santiago and Lily Blue (and her pet chameleon, Speck) are hot on the trail of a thief in a puzzling case: The Wheels That Vanished. Max saw a strange green bicycle whiz by him onto a bridge. But it never came out the other end! How could it have vanished?  The thief on the bicycle stole two very important things, and now it's up to Max, Oscar, and Lily to use their clues, and their scooters, to find them. It will take the best scooter skills they have, and a wild scooter ride, for the three friends to catch the crook!",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Stolen Innocence: My Story of Growing Up in a Polygamous Sect, Becoming a Teenage Bride, and Breaking Free of Warren Jeffs",
        "Authors": "By Wall, Elissa, Pulitzer, Lisa",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Turkey and Greece: Closer unity--now!",
        "Authors": "By McKinnon, Campbell",
        "Description": "",
        "Category": "",
        "Publisher": "Vantage Press",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Asian Grocery Store Demystified (Take It with You Guides)",
        "Authors": "By Bladholm, Linda",
        "Description": "A food lover's guide to all the best ingredients.Do you want to prepare an Asian meal as delectable as those in restaurants? Are you too intimidated by the exotic ingredients to try? And what's inside those mysterious bottles, bags, and boxes in your local Asian grocery store anyway?This handy Take it With You guide provides the answers. Author Linda Bladholm, who has lived, worked, cooked, and dined in locales as diverse as Singapore, Malaysia, Indonesia, Thailand, Japan, Hong Kong, China, Korea, Laos, and Vietnam, takes you on a tour of a typical Asian grocery store and expertly describes what you'll find.Make Your Next Shopping Trip a Successful and Fascinating Journey.Peppered with over 400 illustrations, plus stories about the ingredients used in every major Asian cuisine, this guidebook identifies and tells you how to use the vast array of meats, fruits, vegetables, noodles, tofu, rice, and delicacies. A bonus section of the author's favorite recipes will help you create savory, authentic dishes that will impress everyone-- and it will open a window onto the remarkable civilizations of the Orient.",
        "Category": " Cooking , Regional & Ethnic , Asian",
        "Publisher": "Renaissance Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Hegemony or Survival: America's Quest for Global Dominance (American Empire Project)",
        "Authors": "By Chomsky, Noam",
        "Description": "\"Reading Chomsky today is sobering and instructive . . . He  is a global phenomenon . . . perhaps the most widely read voice on foreign policy on the planet.\" -The New York Times Book ReviewAn immediate national bestseller, Hegemony or Survival demonstrates how, for more than half a century the United States has been pursuing a grand imperial strategy with the aim of staking out the globe. Our leaders have shown themselves willing-as in the Cuban missile crisis-to follow the dream of dominance no matter how high the risks. World-renowned intellectual Noam Chomsky investigates how we came to this perilous moment and why our rulers are willing to jeopardize the future of our species.With the striking logic that is his trademark, Chomsky tracks the U.S. government's aggressive pursuit of \"full spectrum dominance\" and vividly lays out how the most recent manifestations of the politics of global control-from unilateralism to the dismantling of international agreements to state terrorism-cohere in a drive for hegemony that ultimately threatens our existence. Lucidly written, thoroughly documented, and featuring a new afterword by the author, Hegemony or Survival is a definitive statement from one of today's most influential thinkers.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Since Strangling Isn't An Option... Dealing with Difficult People -- Common Problems and Uncommon Solutions",
        "Authors": "By Crowe, Sandra A.",
        "Description": "For those who feel like they are expending too much energy either engaging in conflict or desperately trying to avoid it, this refreshing, realistic guide provides accessible solutions. Readers will learn why dealing with a difficult person doesn't have to ruin their day, the habits that cause conflict, and the techniques that can turn things around. It also gives readers insight into their own power in shaping relationships, and specific advice for handling different personality types. There really is a better way!",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Sugar Addict's Total Recovery Program: All-Natural, Simple Solutions That Eliminate Food Cravings, Build Energy, Enhance Mental Focus, Heal Depression",
        "Authors": "By Desmaisons, Kathleen",
        "Description": "Building on the science of nutrition that she outlined in her bestselling book, Potatoes Not Prozac, Dr. Kathleen DesMaisons now presents the first complete, in-depth dietary plan for living with–and healing–sugar sensitivity. She explains exactly how you can free your mind and body from the tyranny of sugar and shake off the exhaustion, mental fogginess, and mood swings that sugar dependence causes. Revealing the various ways sugar addiction affects both men and women, and the unique methods for healing it, Dr. DesMaisons encourages you to custom-tailor her simple program to fit your lifestyle and includes information on• How to integrate a “slow-carbs not low-carbs” strategy into your diet • Why regular protein is essential and how to get it with every meal• What to eat when a sugar craving strikes• How to get the nutrition you need on the run–even at fast-food restaurants • How to find an exercise program you’ll enjoy• Ten breakfasts you can prepare in a flash • Menus and recipes for every lifestyle and tastePractical, hands-on, and reader friendly, The Sugar Addict’s Total Recovery Program will transform your life by helping you eat right–starting today!",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Another Day in the Frontal Lobe: A Brain Surgeon Exposes Life on the Inside",
        "Authors": "By Firlik, Katrina",
        "Description": "Katrina Firlik is a neurosurgeon, one of only two hundred or so women among the alpha males who dominate this high-pressure, high-prestige medical specialty. She is also a superbly gifted writer–witty, insightful, at once deeply humane and refreshingly wry. In Another Day in the Frontal Lobe, Dr. Firlik draws on this rare combination to create a neurosurgeon’s Kitchen Confidential–a unique insider’s memoir of a fascinating profession.Neurosurgeons are renowned for their big egos and aggressive self-confidence, and Dr. Firlik confirms that timidity is indeed rare in the field. “They’re the kids who never lost at musical chairs,” she writes. A brain surgeon is not only a highly trained scientist and clinician but also a mechanic who of necessity develops an intimate, hands-on familiarity with the gray matter inside our skulls. It’s the balance between cutting-edge medical technology and manual dexterity, between instinct and expertise, that Firlik finds so appealing–and so difficult to master.  Firlik recounts how her background as a surgeon’s daughter with a strong stomach and a keen interest in the brain led her to this rarefied specialty, and she describes her challenging, atypical trek from medical student to fully qualified surgeon. Among Firlik’s more memorable cases: a young roofer who walked into the hospital with a three-inch-long barbed nail driven into his forehead, the result of an accident with his partner’s nail gun, and a sweet little seven-year-old boy whose untreated earache had become a raging, potentially fatal infection of the brain lining. From OR theatrics to thorny ethical questions, from the surprisingly primitive tools in a neurosurgeon’s kit to glimpses of future techniques like the “brain lift,” Firlik cracks open medicine’s most prestigious and secretive specialty. Candid, smart, clear-eyed, and unfailingly engaging, Another Day in the Frontal Lobe is a mesmerizing behind-the-scenes glimpse into a world of incredible competition and incalculable rewards.",
        "Category": " Medical , Neurology",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "An Open Book: Chapters fom a Reader's Life",
        "Authors": "By Dirda, Michael",
        "Description": "\"All that kid wants to do is stick his nose in a book,\" Michael Dirda's steelworker father used to complain, worried about his son's passion for reading. In An Open Book, one of the most delightful memoirs to emerge in years, the acclaimed literary journalist Michael Dirda re-creates his boyhood in rust-belt Ohio, first in the working-class town of Lorain, then at Oberlin College. In addition to his colorful family and friends, An Open Book also features the great writers and fictional characters who fueled Dirda's imagination: from Green Lantern to Sherlock Holmes, from Candy to Proust. The result is an affectionate homage to small-town America—summer jobs, school fights, sweepstakes contests, and first dates—as well as a paean to what could arguably be called the last great age of reading. \"Dirda is a superb literary essayist.\"—Harold Bloom \"Michael Dirda's memoir—no surprise to me—is so good that I went up to the attic meaning to send him one of my antique Big Little books as a salute to excellence...A great job. I'll be buying An Open Book for my children and grandchildren.\"—Russell Baker, author of Growing Up \"Here, in An Open Book, is the show and tell of a wonderful American story, everything coming together in the immemorial dance of literature and memory, of history and gossip, and of the deeply felt, bittersweet story (his own) of a young life. Read it and rejoice.\"—George Garrett \"A lovely, unapologetically nostalgic remembrance of growing up in a more innocent America, but it is also the touching story of one person's lifelong love affair with words.\"—June Sawyer, San Francisco Chronicle \"Dirda inhabits each book he reads. Inhabits it—and makes a space alongside it for us to join him....He is a rare treasure.\"—James Sallis, Boston Sunday Globe",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Mary, Queen of France: The Tudor Princesses",
        "Authors": "By Plaidy, Jean",
        "Description": "Legendary historical novelist Jean Plaidy brings to life the story of Princess Mary   Tudor, a celebrated beauty and born rebel who would defy the most powerful king in   Europe—her older brother. Princess Mary Rose is the youngest sister of Henry VIII,   and one of the few people whom he adores unconditionally. Known throughout Europe   for her charm and good looks, Mary is the golden child of the Tudor family and is   granted her every wish. Except when it comes to marriage. Henry VIII, locked in   a political showdown with France, decides to offer up his pampered baby sister to   secure peace between the two mighty kingdoms. Innocent, teenage Mary must become   the wife of the elderly  King Louis, a toothless, ailing man in his sixties. Horrified   and furious, Mary has no choice but to sail for France. There she hones her political   skills, bides her time, and remains secretly in love with Charles Brandon, the Duke   of Suffolk. When King Louis dies after only two years of marriage, Mary is determined   not to be sold into another unhappy union. She must act quickly; if she wants to   be with the man she truly loves, she must defy the laws of church and state by marrying   without her brother’s permission. Together, Mary and Charles devise a scheme to outwit   the most ruthless king in Europe and gain their hearts’ desire, not knowing if it   will lead to marital bliss or certain death.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "24 Declassified: Vanishing Point",
        "Authors": "By Cerasini, Marc",
        "Description": "Area 51: America's top-secret advanced military testing ground, hidden away in the Nevada desert, where the awesome weapons of tomorrow are being developed. But a mole inside the impregnable facility has been leaking highly advanced killing technology to America's worst enemies . . . who intend to turn its destructive power on an unsuspecting nation before the day is out.Agent Jack Bauer has a mere twenty-four hours to derail a horrific plot, as a deadly endgame takes shape in the neon glare of nearby Las Vegas. But to do so, the rogue CTU operative will have to lead an impossible assault on Area 51 itself—and expose a lethal string of betrayal and corruption that leads from the terrorists to the underworld and all the way into the heart of the U.S. government.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "HarperEntertainment",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Complete Pasta Cookbook",
        "Authors": "By Williams, Chuck, Kidd, Kristine, Weir, Joanne, Jordan, Michele Anna, and Pool, Joyce Oudkerk (PHT)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "7.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Photographic Atlas of the Human Body",
        "Authors": "By Vidic, Branislav and Suarez, Faustino R.",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Mosby Inc",
        "Price Starting With ($)": "8.72",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "Eye Contact",
        "Authors": "By McGovern, Cammie",
        "Description": "Read Cammie McGovern's posts on the Penguin BlogLike The Lovely Bones and The Curious Incident of the Dog in the Night-Time, Cammie McGovern’s breakout novel is at once a hypnotic thriller and an affecting portrait of people as real as our next-door neighbors. InEye Contact, two children vanish in the woods behind their elementary school. Hours later, nine-year-old Adam is found alive, the sole witness to his playmate’s murder. But because Adam has autism, he is a silent witness. Only his mother, Cara, can help decode his behavior for the police. As the suspense ratchets, Eye Contact becomes a heart-stopping exploration of the bond between a mother and a very special child.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Penguin (Non-Classics)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Long Life Prescription: Fast and Easy Ways to Stay Energized and Healthy at Every Age: Based on More",
        "Authors": "By Harrar, Sari",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest Association",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Twisted",
        "Authors": "By Deaver, Jeffery",
        "Description": "In \"Beautiful\" former supermodel Kari's stalker has followed her to her new home. The police can do nothing. In \"Triangle\" Pete finds a true crime book - and uses the lessons to kill Mo's lover. \"Without Jonathan\" introduces Marissa, about to go on a date with a man she met through the personals.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Hodder & Stoughton Ltd",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Sierra Club Summer Book",
        "Authors": "By Allison, Linda",
        "Description": "A collection of animal facts and summer activities including craft projects and nature discussions",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Sierra Club Books",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Jarhead : A Marine's Chronicle of the Gulf War and Other Battles",
        "Authors": "By Swofford, Anthony",
        "Description": "In his  New York Times  bestselling chronicle of military life, Anthony Swofford weaves his experiences in war with vivid accounts of boot camp, reflections on the marines, and remembrances of battles with lovers and family.  When the U.S. Marines—or “jarheads”—were sent to Saudi Arabia in 1990 for the Gulf War, Anthony Swofford was there. He lived in sand for six months; he was punished by boredom and fear; he considered suicide, pulled a gun on a fellow marine, and was targeted by both enemy and friendly fire. As engagement with the Iraqis drew near, he was forced to consider what it means to be an American, a soldier, a son of a soldier, and a man.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Complete Works of William Shakespeare",
        "Authors": "By William Shakespeare",
        "Description": "",
        "Category": "",
        "Publisher": "Dempsey Parr",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Palm Sunday",
        "Authors": "By Vonnegut, Kurt",
        "Description": "",
        "Category": "",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Gideon's Trumpet: How One Man, a Poor Prisoner, Took His Case to the Supreme Court-and Changed the Law of the United States",
        "Authors": "By Lewis, Anthony",
        "Description": "A history of the landmark case of Clarence Earl Gideon's fight for the right to legal counsel. Notes, table of cases, index. The classic backlist bestseller. More than 800,000 sold since its first pub date of 1964.",
        "Category": " Law , Legal History",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Internet Routing Architectures",
        "Authors": "By Halabi, Bassam",
        "Description": "",
        "Category": " Computers , Internet , General",
        "Publisher": "New Riders Pub",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Gingerbread Man (First Readers)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Life in Rural America",
        "Authors": "By National Geographic Society (U. S.)",
        "Description": "",
        "Category": "",
        "Publisher": "Natl Geographic Society",
        "Price Starting With ($)": "19.25",
        "Publish Date": {
            "Month": "June",
            "Year": "1974"
        }
    },
    {
        "Title": "ABRIENDO PASO LECTURA 2E-TEXT 2001C (Second Edition)",
        "Authors": "By Diaz, Jose M. and Collins, Stephen J.",
        "Description": "",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Prevention's Low-Fat, Low-Cost Cookbook: Over 220 Delicious Recipes",
        "Authors": "By Prevention Magazine Health Books (COR) and Sanders, Sharon (EDT)",
        "Description": "You can eat better for less! This resourceful cookbook puts you in control of your health and your money. Save dollars and shave fat with 20 complete meals that cost a mere $2 per serving! Dozens of other recipes cost only pennies yet offer a wealth of great nutrition. Dishes like Pork Chops with Herbed Apple Dressing, Chicken Lasagna, Shrimp and Orzo Salad, Blueberry-Buttermilk Coffeecake, and Pineapple-Banana-Strawberry Cheesecake won't pad your waistline but will help fatten your bank account.",
        "Category": "",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "A Child is Born (A Treasury Collection Christmas Pop-Up)",
        "Authors": "By Moore, Gary",
        "Description": "",
        "Category": "",
        "Publisher": "Ottenheimer Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Weight Watchers' International Cookbook",
        "Authors": "By Nidetch, Jean",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1977"
        }
    },
    {
        "Title": "The Shape Detectives (Blue's Clues)",
        "Authors": "By Johnson, Traci Paige, Kessler, Todd, Santomero, Angela C., and Craig, Karen (ILT)",
        "Description": "A lift-the-flap board book full of hide-and-seek fun leads young readers on a search for basic shapes all around Blue's house with assistance provided by Shovel, Pail, and Tickety Tock. TV tie-in.",
        "Category": " Juvenile Fiction , Concepts , Size & Shape",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "The Best Mouse Cookie (If You Give...)",
        "Authors": "By Numeroff, Laura Joffe and Bond, Felicia (ILT)",
        "Description": "Join the mouse from If You Give a Mouse a Cookie as he bakes his own cookies in his little mouse house.This board book with sturdy pages is perfect for toddlers, who will enjoy the simple introduction to reading. Each page has one or two sentences. Starring the ever-popular Mouse, this is a sweet addition to the classic and beloved series.",
        "Category": " Juvenile Fiction , Animals , Mice, Hamsters, Guinea Pigs, etc.",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2019"
        }
    },
    {
        "Title": "Southern Living 1992 Annual Recipes",
        "Authors": "By Southern Living",
        "Description": "Drawing on recipes and food stories from an entire year of \"Southern Living,\" this reference to outstanding cuisine offers hundreds of recipes, entertaining ideas, and garnishing tips",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "The Kingfisher First Dictionary (Kingfisher First Reference)",
        "Authors": "By Grisewood, John (EDT), Crawley, Angela (EDT), and Law, Felicia",
        "Description": "Packed with pictures, this dictionary is a visual treasure trove just right for children who are ready to begin using reference books on their own.  Because it's fun for kids to use, this is an ideal first reference. It is the only dictionary for this age level to include word games and activities that entertain as they reinforce dictionary skills. Additional vocabulary words are featured on generously illustrated pages covering such high interest topics as animals, colors, flowers, games, and planets.  Accessible and authoritative, this dictionary also explains confusing words, many word origins, and all the basic information about how we use words. Special Features:  Over 1,000 appealing, colorful photographs and illustrations. Over 1,500 headwords and simple sentences provide examples of word usage and clear and easy-to-understand definitions.  Includes word games and activities.  Vocabulary carefully chosen for the 5-8 year old reading level.  Includes spelling tips and pronunciation guide.",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Complete Cat Care Manual: The Ultimate Illustrated Guide to Caring for Your Cat",
        "Authors": "By Edney, A. T. B.",
        "Description": "Practical guide to every aspect of cat care. Features more than 600 color photos. Published by Dorling Kindersley, Inc., 232 Madison Avenue, New York, NY 10016. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Pets , Cats , General",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Little Bear's Visit (An I Can Read Book)",
        "Authors": "By Minarik, Else Holmelund and Sendak, Maurice (ILT)",
        "Description": "Little Bear likes to visit Grandmother and Grandfather Bear. He likes Grandfather’s hat and Grandmother’s cooking. But most of all, he loves to listen to their stories!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1979"
        }
    },
    {
        "Title": "The Complete Cat Owner's Manual: How to Raise a Happy, Healthy Cat",
        "Authors": "By Susie Page",
        "Description": "",
        "Category": "",
        "Publisher": "Fog City Press",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Independence for Africa",
        "Authors": "By Gwendolen Carter",
        "Description": "",
        "Category": "",
        "Publisher": "Praeger",
        "Price Starting With ($)": "9.77",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "My Friend Jesus",
        "Authors": "By Review, S. Herald, Degering, Etta B.",
        "Description": "",
        "Category": "",
        "Publisher": "Review and Herald Publishing Association",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Absolut Book.: The Absolut Vodka Advertising Story",
        "Authors": "By Lewis, Richard W.",
        "Description": "Highlighting the award-winning marketing and advertising campaign of Absolut Vodka, this art and design book features over 250 pages of magnificent bottle art and iconic ads. The absolute vodka advertising campaign has been running nonstop for fifteen years, which, in advertising, is practically forever.  Industry insiders hail it as one of the most successful campaigns in the history of advertising, and the star of the ads is always the beautiful, artful, chameleon-like bottle from Sweden.The Absolut ads are celebrated as much for their ingenuity as their longevity. They are full of wit, artistry, and imagination as they deftly communicate the brand's values, often containing little challenges to the reader to interpret just what's happening inside the ad.Flip through the over 250 pages of magnificent bottle art featured in this beautiful graphic design book. This advertising book features 15 chapters each chronicling the long life of this world-famous glass art. In Absolute Book author, Richard Lewis of TBWA Chiat/Day, Absolut's advertising agency from the beginning, shares an intriguing, behind-the-scenes account of the birth and growth of this heralded campaign, its personalities and creators, and the paths they've taken to keep it perpetually fresh.",
        "Category": " Business & Economics , Advertising & Promotion",
        "Publisher": "Journey Editions",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Democracy in Action  The Voices of Men in American Government and Politics",
        "Authors": "By Theodore Powell",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Italian Cooking For Dummies",
        "Authors": "By Miller, Bryan, Bishop, Jack, and Casella, Cesare",
        "Description": "Everybody loves Italian food, and with good reason. The cuisine extols hearty and healthy meals with the freshest ingredients, a diversity of flavors, and tried-and-true recipes (some of which date as far back as the Roman Empire) that are naturally low in saturated fats and calories. All this, and it tastes great, too!Discover the mouthwatering joys of Italian cooking with this complete guide to the regions and recipes of Italy. Celebrated chef Cesare Casella and seasoned food writer Jack Bishop lead you step-by-step through an entire full-course Italian meal, from antipasti, salads, and soups to pastas, entrees, and delicious desserts. Discover how to make your own fresh pasta, polenta, and pizza, and how to plan simple or elaborate dinners for every occasion. You'll find all the recipes and tips you need in Italian Cooking For Dummies, along with tons of advice on selecting the right herbs, ingredients, cooking tools, and utensils, and finding more information in print or online. The book also features a complete glossary of cooking terms and ingredients to help you enjoy la dolce vita.",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Dinner For Two",
        "Authors": "By Mike Gayle",
        "Description": "",
        "Category": "",
        "Publisher": "Flame",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Plan and Section Drawing",
        "Authors": "By Wang, Thomas C.",
        "Description": "The Second Edition of this classic, comprehensive guide to plan and section drawing has been completely updated to serve the needs of today's architects and landscape architects. Sweeping stylistic and technical advances made since its original publication fifteen years ago are added to this new edition, which also includes new chapters on process and computer graphics.",
        "Category": " Architecture , Design, Drafting, Drawing & Presentation",
        "Publisher": "Wiley",
        "Price Starting With ($)": "6.71",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "Scooby-Do! Scooby...Don't! (Scooby-Doo)",
        "Authors": "By Marsoli, Lisa Ann",
        "Description": "",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Piggy Toes Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Educational Psychology: Windows on Classrooms (4th Edition)",
        "Authors": "By Kauchak, Donald P. and Eggen, Paul D.",
        "Description": "",
        "Category": " Education , Educational Psychology",
        "Publisher": "Prentice Hall College Div",
        "Price Starting With ($)": "7.22",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "The Gleam of Bayonets: The Battle of Antietam and Robert E. Lee's Maryland Campaign",
        "Authors": "By Murfin, James V.",
        "Description": "One of the bloodiest days in American military history, the Battle of Antietam turned the tide of the Civil War in favor of the North and delivered the first major defeat to Robert E. Lee's army. In The Gleam of Bayonets, James V. Murfin gives a compelling account of the events and personalities involved in this momentous battle. The gentleness and patience of Lincoln, the vacillations of McClellan, and the grandeur of Lee -- all unfold before the reader. The battle itself is presented with precision and scope as Murfin blends together atmosphere and fact, emotions and tactics, into a dramatic and coherent whole. Originally published in 1965, The Gleam of Bayonets is now recognized as a classic and the standard against which all books on Antietam are measured.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Louisiana State Univ Pr",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "1982"
        }
    },
    {
        "Title": "From Fallen To Forgiven: A Spiritual Journey into Wholeness and Healing",
        "Authors": "By O'Neill, Jennifer",
        "Description": "After an international modeling career, Hollywood fame, and eight marriages, Jennifer O'Neill finally found out what she had always been looking for - a true love affair with Jesus Christ.   She candidly discusses her own trials as a lost soul looking for satisfaction in the things of this world.  Jennifer's passion in life and the purpose of this book is to share with women the awesome depths of God's grace and challenge them to truly make Jesus Christ Lord of their lives.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Walt Disney's Snow White and the Seven Dwarfs (Golden Super Shape Book)",
        "Authors": "By Balducci, Rita, Walt Disney Productions (COR), and Williams, Don (ILT)",
        "Description": "Retells the Disney version of the tale of the beautiful princess whose lips were red as blood, skin was white as snow, and hair was black as ebony",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Adaptations",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Old Macdonald Had A Farm (A Little Golden Book)",
        "Authors": "By Golden Books",
        "Description": "The inhabitants of Old MacDonald's farm are described verse by verse. The melody line for this old song is included on the last page.",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The True Darcy Spirit: A Novel",
        "Authors": "By Aston, Elizabeth",
        "Description": "Following on the heels of Mr. Darcy's Daughters and The Exploits & Adventures of Miss Alethea Darcy, Elizabeth Aston delivers an irresistible new novel set in the world of Jane Austen.   After being disowned by her family, Cassandra Darcy -- the artistic eldest daughter of Anne de Bourgh (and granddaughter of the infamous Lady Catherine de Bourgh and Mr. Darcy's cousin in Pride and Prejudice) -- strives to make a living by painting. But struggling to succeed in bohemian London turns out to be the least of her worries! To begin with, there are the unwelcome advances of a certain Lord Usborne, and then there are the letters bequeathed to her by a friend -- highly compromising letters written by Princess Caroline that her husband, the Prince Regent, would very much like to possess. In league with Lord Usborne, the prince enlists the services of Cassandra's cousin, Horatio Darcy, who is a lawyer, to track down the missives. When Horatio's investigation leads him straight to Cassandra, he initially disapproves of her lifestyle until he finds himself utterly charmed by it -- and particularly by her. Romance may prove elusive, however, as social obstacles and the efforts of a vengeful Lord Usborne conspire to divide the two would-be lovers.   Another delightful chapter in the adventures of Aston's spirited Darcy daughters, The True Darcy Spirit is a treat for Jane Austen fans everywhere.",
        "Category": " Fiction , Literary",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Analysis for Financial Management (Irwin/Mcgraw-Hill Series in Finance, Insurance, and Real Estate)",
        "Authors": "By Higgins, Robert C.",
        "Description": "",
        "Category": " Business & Economics , Corporate Finance",
        "Publisher": "Richard d Irwin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Yardsticks: Children in the Classroom Ages 4-14 : A Resource for Parents and Teachers",
        "Authors": "By Wood, Chip",
        "Description": "",
        "Category": " Education , Reference",
        "Publisher": "Center for Responsive Schools Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Two Monsters",
        "Authors": "By McKee, David",
        "Description": "Two monsters living on opposite sides of a mountain, who can't agree on whether day is arriving or night departing, insult each other and hurl rocks until the mountain is destroyed and they make a startling discovery.",
        "Category": " Juvenile Fiction , Horror",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Dictionary of Correct Spelling: A Handy Reference Guide (EH)",
        "Authors": "By Lewis, Norman",
        "Description": "Lists commonly misspelled words and explains the rules which govern their correct form",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Barnes Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Looking at Rocks (My First Field Guides)",
        "Authors": "By Dussling, Jennifer, Haggerty, Tim (ILT), Drew-Brook-Cormack, Deborah (ILT), and Drew-Brook-Cormack, Allan (ILT)",
        "Description": "From the   backyard to the local bank, rock hounds can identify common rocks wherever   they go with this rocking illustrated guide.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Forever and the Night",
        "Authors": "By Miller, Linda Lael",
        "Description": "As senator's aide Neely Wallace becomes closer to charming and reclusive millionaire Aidan Tremayne, she discovers the dark secret that Aidan has been living with for centuries: that he is a vampire. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Almost a Rainbow: A Book of Poems",
        "Authors": "By Anglund, Joan Walsh",
        "Description": "A collection of delicate aphorisms and verses for adults, coupled with a series of decorative drawings by the perennially popular children's author",
        "Category": " Poetry , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "11.53",
        "Publish Date": {
            "Month": "August",
            "Year": "1980"
        }
    },
    {
        "Title": "The Dream violin and other stories of families around the world",
        "Authors": "By Editors of Highlights for Children",
        "Description": "A collection of fifteen stories about children living all over the world, including Joanna, the best knitter in Holland, Ryan, whose ancestors were Vikings, and Guler, who lives on two continents in Turkey.",
        "Category": "",
        "Publisher": "Highlights for Children, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Lore Of The Unicorn",
        "Authors": "By Shepard, Odell",
        "Description": "Unicorns and their magical powers are studied as they appear in legend and literature, including the Bibles of both East and West",
        "Category": " Religion , General",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "The Tale of Despereaux: Being the Story of a Mouse, a Princess, Some Soup, and a Spool of Thread",
        "Authors": "By DiCamillo, Kate and Ering, Timothy Basil (ILT)",
        "Description": "The beloved author of Because of Winn-Dixie enlightens us with a tale of adventure, despair, love, and soup.Welcome to the story of Despereaux Tilling, a mouse who is in love with music, stories, and a princess named Pea. It is also the story of a rat called Roscuro, who lives in the darkness and covets a world filled with light. And it is the story of Miggery Sow, a slow-witted serving girl who harbors a simple, impossible wish. These three characters are about to embark on a journey that will lead them down into a horrible dungeon, up into a glittering castle, and, ultimately, into each other’s lives. And what happens then? As Kate DiCamillo would say: Reader, it is your destiny to find out.From the master storyteller who brought us Because of Winn-Dixie comes another classic, a fairy tale full of quirky, unforgettable characters, featuring twenty-four stunning black-and-white illustrations by Timothy Basil Ering, in an elegant design that pays tribute to the best in classic children’s books and bookmaking traditions.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Cam Jansen: The Mystery of the Stolen Corn Popper #11",
        "Authors": "By Adler, David A. and Natti, Susanna (ILT)",
        "Description": "Fifth-grade sleuth Cam Jansen uses her photographic memory to catch a thief during a department store sale",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "The Black Pearl",
        "Authors": "By O'Dell, Scott",
        "Description": "Ramon cannot believe what he has just found in an oyster he’s brought up from an underwater cave where the Manta Diablo, the monster devilfish, lurks. Ramon is holding a pearl. Not just any pearl, but the most fabulous gem he or anyone else has ever seen. But neither Ramon nor his father can foresee the trouble that such a pearl can bring.",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1977"
        }
    },
    {
        "Title": "The Wisdom of Paul Words for Today From Christ's Fiery Disciple",
        "Authors": "By Family Library, Family Library",
        "Description": "",
        "Category": "",
        "Publisher": "Family Library",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Three-Ring Inferno (2892) (Thorne Twins Adventure Books, 7)",
        "Authors": "By Courtney, Dayle and Ham, John (ILT)",
        "Description": "While working at a circus, the Thorne twins draw upon their Christian values when they and their new friend Neal are threatened by a motorcycle gang.",
        "Category": "",
        "Publisher": "Standard Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1982"
        }
    },
    {
        "Title": "Becoming a Doctor: A Journey of Initiation in Medical School",
        "Authors": "By Konner, Melvin",
        "Description": "The author, already in his mid thirties and distinguished as a scholar, tenured professor, and published writer before beginning medical school, chronicles his third year of medical training",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Quest for Love: True Stories of Passion and Purity",
        "Authors": "By Elliot, Elisabeth",
        "Description": "\"What if I never marry - will God take that desire away?\" \"I have deep feelings for this guy, but he says I am like a sister to him. What should I do?\" \"Why should a man still be expected to initiate romance?\"",
        "Category": " Religion , General",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Storm Chasers (All Aboard Science Reader)",
        "Authors": "By Herman, Gail and Schwinger, Larry (ILT)",
        "Description": "Young readers follow some of the world's boldest scientists as they risk their lives to discover the inner workings of tornadoes and other great storms, in an easy-to-read introduction to some of the world's most dangerous weather phenomena. Simultaneous.",
        "Category": " Juvenile Fiction , Science & Technology",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Monsters ,INC. Randall",
        "Authors": "By Lagonegro, Melissa",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Concise Columbia Encyclopedia",
        "Authors": "By Columbia University Press",
        "Description": "Includes thousands of biographies and articles on science, technology, agriculture, business, medicine, history, and art",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "The Seven Sacraments",
        "Authors": "By Lovasik, Lawrence",
        "Description": "",
        "Category": " Religion , Christian Rituals & Practice , Sacraments",
        "Publisher": "Catholic Book Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Massage : Simple Ways to Achieve Relaxation, Enhance Sensuality, and Enjoy the Healing Power of Touch",
        "Authors": "By Smith, Karen L.",
        "Description": "Massage is one of the oldest and most pleasurable relaxation techniques, and is now enjoying new heights of popularity in the West. It can help you relax, restore vitality and health, and enhance your sensuality. This inspiring and appealing book provides an imaginative introduction to all aspects of massage, from practical advice on basic strokes to innovative ideas on creating atmosphere and attuning oneself to individual moods and seasonal changes. Beautifully illustrated throughout, Massage:Shows how massage is enhanced with the natural therapeutic powers of essential aromatic oils from plants and flowers.Provides a complete and original introduction to massage techniques, using clear step-by-step instructions and over 200 specially commissioned color photographs.Includes a detailed navigational guide for massaging key parts of the body to target areas of particular tension and relax your body and mind.Offers season-by-season advice on appropriate massage techniques and oils to increase healing potential.Explores the sensual pleasures of water, steam, and beauty treatments, both within the home and in a spa environment.Gives authoritative, accessible advice on the therapeutic use of massage for particular conditions, including headaches, asthma, premenstrual syndrome (PMS), and cellulite.Massage is a skill and therapy that everyone can enjoy, and this book enables readers to experience the benefits and pleasures it provides. Visit us online at http://www.mgr.co",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Deep in the Forest",
        "Authors": "By Turkle, Brinton",
        "Description": "",
        "Category": "",
        "Publisher": "Trumpet Club Special Edition",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Harcourt School Publishers Signatures: Library Book Grade 3 Julians Glorious Summer",
        "Authors": "By Cameron, Ann and Leder, Dora (ILT)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "HARCOURT SCHOOL PUBLISHERS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Something Old, Something New (Cedar River Daydreams #11)",
        "Authors": "By Baer, Judy",
        "Description": "When Peggy returns to Cedar River after giving her baby up for adoption, Lexi wonders if she and Peggy can still be friends and whether Peggy will really get a chance for a new start",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "How To Learn Any Language",
        "Authors": "By Farber, Barry J.",
        "Description": "Tells how to learn a foreign language by using all available language tools, taking advantage of brief moments of free time, using a special vocabulary memory system, and reading publications and watching movies in the language one's learning",
        "Category": " Language Arts & Disciplines , Study & Teaching",
        "Publisher": "Kensington Publishing Corp",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Cat Who Went Bananas",
        "Authors": "By Braun, Lilian Jackson",
        "Description": "Autumn has arrived, and the citizens of Pickax find themselves amid a clamor of activity. In addition to the opening of its latest theatrical production, the town is celebrating the dedication of a new bookstore and park built in memory of Pickax's beloved bookshop owner Edd Smith. Columnist Jim Qwilleran, while participating in the festivities, is also busy with his latest book project: an account of a uniquely historic guest residence, the Hibbard House.The merry atmosphere, however, is dampened by the suspicious death of an out-of-town actor and the mysterious theft of a rare book. Qwill's research into the Hibbard House provides unexpected insight into these strange proceedings. Qwill must also rely on his perceptive Siamese Koko, who has been acting particularly odd in regard to the newest resident of the Hibbard House. Has Koko gone bananas, or will his unusual behavior help Qwill unravel this mystery?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Ursula, Under",
        "Authors": "By Hill, Ingrid",
        "Description": "In Michigan's Upper Peninsula, a dangerous rescue effort draws the ears and eyes of the entire country. A two-and-a-half-year-old girl has fallen down a mine shaft—\"the only sound is an astonished tiny intake of breath from Ursula as she goes down, like a penny into the slot of a bank, disappeared, gone.\" It is as if all hope for life on the planet is bound up in the rescue of this little girl, the first and only child of a young woman of Finnish extraction and her Chinese-American husband. One TV viewer following the action notes that the Wong family lives in a decrepit mobile home and wonders why all this time and money is being \"wasted on that half-breed trailer-trash kid.\" In response, the novel takes a breathtaking leap back in time to visit Ursula's most remarkable ancestors: a third-century-B.C. Chinese alchemist; an orphaned playmate of a seventeenth-century Swedish queen; Professor Alabaster Wong, a Chautauqua troupe lecturer (on exotic Chinese topics) traveling the Midwest at the end of the nineteenth century; her great-great-grandfather Jake Maki, who died at twenty-nine in a Michigan iron mine cave-in; and others whose richness and history are contained in the induplicable DNA of just one person—little Ursula Wong.Ursula's story echoes those of her ancestors, many of whom so narrowly escaped not being born that her very existence—like ours—comes to seem a miracle. Ambitious and accomplished, Ursula, Under is, most of all, wonderfully entertaining—a daring saga of culture, history, and heredity.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Digging to America",
        "Authors": "By Tyler, Anne",
        "Description": "In what is perhaps her richest and most deeply searching novel, Anne Tyler gives us a story about what it is to be an American, and about Maryam Yazdan, who afterThirty-five years in this country must finally come to terms with her “outsiderness.”Two families, who would otherwise never have come together, meet by chance at the Baltimore airport—the Donaldsons, a very American couple, and the Yazdans, Maryam’s fully assimilated son and his attractive Iranian American wife. Each couple is awaiting the arrival of an adopted infant daughter from Korea. After the babies from distant Asia are delivered, Bitsy Donaldson impulsively invites the Yazdans to celebrate with an “arrival party,” an event that is repeated every year as the two families become more deeply intertwined.Even independent-minded Maryam is drawn in. But only up to a point. When she finds herself being courted by one of the Donaldson clan, a good-hearted man of her vintage, recently widowed and still recovering from his wife’s death, suddenly all the values she cherishes—her traditions, her privacy, her otherness—are threatened. Somehow this big American takes up so much space that the orderly boundaries of her life feel invaded.A luminous novel brimming with subtle, funny, and tender observations that cast a penetrating light on the American way as seen from two perspectives, those who are born here and those who are still struggling to fit in.",
        "Category": " Fiction , Psychological",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Old Wine Shades",
        "Authors": "By Grimes, Martha",
        "Description": "The latest in New York Times bestselling author Martha Grimes's Richard Jury mystery series  \"The dog came back.\" \"This is a joke, right?\" \"No, it isn't. . . . So do you want to hear the rest of it?\" Dumbly, Jury nodded.  The rest of it is told by Harry Johnson, a stranger who sits down next to Richard Jury as he's drinking in a London pub called the Old Wine Shades. Over three successive nights Harry spins this complicated story about a good friend of his whose wife and son (and dog) disappeared one day as they were viewing property in Surrey. They've been missing for nine months-no trace, no clue, no lead as to what happened.  He's a fascinating bloke, this Harry Johnson-rich, handsome, unattached, and brainy about the esoteric subject of quantum mechanics, a field in which the vanished woman's husband, Hugh Gault, excels: He's an authority on string theory, which has some pretty funny notions about the nature of reality.  Jury wonders, Is Harry Johnson winding him up? Or did it really happen? The dog did come back-but how? And from where? And when Jury investigates, all seems to be just as Harry described it.  Until they find the body.  Praise for Martha Grimes: \"One of the established masters of the genre.\" -Newsweek  \"[Grimes's] gift for evoking mood and emotion is as keen as her talent for inventing a demanding puzzle, and solving it.\" -The Wall Street Journal  \"[Grimes] excels at creating a haunting atmosphere and characters both poignant and preposterous.\" -USA Today  \"Grimes is gifted at exploring the private, sometimes horrifying, yet utterly mundane thoughts of ordinary people.\" -San Francisco Chronicle",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Yevgeny Yevtushenko a Precocious Autobiography",
        "Authors": "By Yevgeny Yevtushenko",
        "Description": "",
        "Category": "",
        "Publisher": "E.P. Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Algebra and Trigonometry With Analytic Geometry (Prindle, Weber and Schmidt Series in Mathematics)",
        "Authors": "By Cole, Jeffery A. and Swokowski, Earl W.",
        "Description": "* Precalculus course taught at both two- and four-year schools..* Takes the right triangle approach to the subject..* Problem sets present a variety of challenging and motivating exercises..* Step-by-step explanations, or side-bar comments, are added to examples.",
        "Category": " Mathematics , Trigonometry",
        "Publisher": "Pws Pub Co",
        "Price Starting With ($)": "7.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "THE CAT ATE MY GYMSUIT",
        "Authors": "By Danziger, Paula",
        "Description": "When the unconventional English teacher who helped her conquer many of her feelings of insecurity is fired, a junior high student uses her new found courage to campaign for the teacher's reinstatement.",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1975"
        }
    },
    {
        "Title": "Obliviously On He Sails: The Bush Administration in Rhyme",
        "Authors": "By Trillin, Calvin",
        "Description": "Does the Bush Administration sound any better in rhyme? In this biting array of verse, it at least sounds funnier. Calvin Trillin employs everything from a Gilbert and Sullivan style, for describing George Bush’s rescue in the South Carolina primary by the Christian Right (“I am, when all is said and done, a Robertson Republican”), to a bilingual approach, when commenting on the President’s casual acknowledgment, after months of trying to persuade the nation otherwise, that there was never any evidence of Iraqi involvement in 9/11: “The Web may say, or maybe Lexis-Nexis / If chutzpa is a word they use in Texas.”Trillin deals not only with George W. Bush but with the people around him—Supreme Commander Karl Rove and Condoleezza (Mushroom Cloud) Rice and Nanny Dick Cheney (“One mystery I’ve tried to disentangle: / Why Cheney’s head is always at an angle . . .”) The armchair warriors Trillin refers to as the Sissy Hawk Brigade are celebrated in such poems as “Richard Perle: Whose Fault Is He?” and “A Sissy Hawk Cheer” (“All-out war is still our druthers— / Fiercely fought, and fought by others.”).Trillin may never be poet laureate—certainly not while George W. Bush is in office—but his wit and his political insight produce what has been called “doggerel for the ages.”",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "the lion king",
        "Authors": "By Ingoglia, Gina",
        "Description": "",
        "Category": "",
        "Publisher": "Golden paperback",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Celine (A Sunburst Book)",
        "Authors": "By Cole, Brock",
        "Description": "\"Show a little maturity,\" he said, which I've doped out to mean: Pass all your courses, avoid detection in all crimes and misdemeanors, don't get pregnant.Celine's father has left her with these instructions. She's not too worried about the last two, but she'll fail English unless she rewrites her Catcher in the Rye essay. And she keeps being interrupted, especially by Jake, the neighbor's boy, who's been dumped on her for the weekend.An ALA Best Book for Young AdultsA School Library Journal Best Book of the YearA Booklist Best Book of the '80sA Publishers Weekly Best Children's Book of the Year",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Berenstain Bear Scouts Ghost Versus Ghost (Berenstain Bear Scouts)",
        "Authors": "By Berenstain, Stan and Berenstain, Mike (ILT)",
        "Description": "Undaunted by rumors that the Great Grizzly Forest is haunted, the Bear Scouts head off to earn their Wilderness Survival badges, but the evening brings a scary surprise. Original.",
        "Category": "",
        "Publisher": "Little Apple",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "How to Think Straight about Psychology, Seventh Edition",
        "Authors": "By Stanovich, Keith E.",
        "Description": "Focusing on critical thinking skills and their application to the standard concepts of psychology, this supplemental text offers tips on recognizing and critically appraising pseudo-science.  It specifically directs scrutiny toward the claims of self-help literature and discussions of psychology in the popular media. Stamovich teaches at the University of Toronto. Annotation (c) Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Psychology , Research & Methodology",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Envy",
        "Authors": "By Brown, Sandra",
        "Description": "In this explosive thriller, a New York City-based book editor travels to a Southern island to meet a mysterious author -- but she's about to uncover the truth about a carefully concealed crime.Maris Matherly-Reed is a renowned New York book editor, the daughter of a publisher and the wife of bestselling author Noah Reed. It's not often that an unsolicited submission tantalizes her, but a new manuscript with blockbuster potential inspires her to search for the elusive author.On an obscure island off the Georgia coast, amid the ruins of an eerie cotton plantation, she finds Parker Evans, a man determined to conceal his identity as well as his past. Working with him chapter by chapter, Maris is riveted by his tale of two friends who charter a boat with a young woman for a night of revelry . . . an excursion from which only one person returns.As the story unfolds, Maris becomes convinced it is more than just fiction. Disturbed about her growing attraction to Parker and gripped by a chilling suspicion about his novel's characters, she searches for the hidden truth about a crime committed decades ago. Then someone close to her dies while an evil presence looms even closer: a man who will use anyone -- and anything -- to get what he wants . . .",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "1776",
        "Authors": "By McCullough, David",
        "Description": "America’s beloved and distinguished historian presents, in a book of breathtaking excitement, drama, and narrative force, the stirring story of the year of our nation’s birth, 1776, interweaving, on both sides of the Atlantic, the actions and decisions that led Great Britain to undertake a war against her rebellious colonial subjects and that placed America’s survival in the hands of George Washington.In this masterful book, David McCullough tells the intensely human story of those who marched with General George Washington in the year of the Declaration of Independence—when the whole American cause was riding on their success, without which all hope for independence would have been dashed and the noble ideals of the Declaration would have amounted to little more than words on paper.  Based on extensive research in both American and British archives, 1776 is a powerful drama written with extraordinary narrative vitality. It is the story of Americans in the ranks, men of every shape, size, and color, farmers, schoolteachers, shoemakers, no-accounts, and mere boys turned soldiers. And it is the story of the King’s men, the British commander, William Howe, and his highly disciplined redcoats who looked on their rebel foes with contempt and fought with a valor too little known.  Written as a companion work to his celebrated biography of John Adams, David McCullough’s 1776 is another landmark in the literature of American history.",
        "Category": " History , United States , Revolutionary Period (1775-1800)",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Bruce Coville's Book of Aliens: Tales to Warp Your Mind",
        "Authors": "By Coville, Bruce and Pierard, John (ILT)",
        "Description": "The author of My Teacher Is an Alien presents ten scary stories--seven originals and three classics--about the exciting adventures of aliens. Original.",
        "Category": "",
        "Publisher": "Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "French Stories / Contes Français (A Dual-Language Book) (English and French Edition)",
        "Authors": "By Fowlie, Wallace (EDT)",
        "Description": "\"The selections are good and the translations are excellent.\" ― Germaine Brée, New York UniversityDrawn from two centuries of French literature, these superb selections by ten great writers span a wide variety of styles, philosophies, and literary creeds. The stories reflect not only the beliefs of various literary schools, but the preoccupations of French civilization, at the various times of their composition, with the metaphysical and psychological problems of man. Contents include Micromégas (Voltaire), La Messe de l'Athée (Honoré de Balzac), La Légende de Saint Julien l'Hospitalier (Gustave Flaubert), Le Spleen de Paris (Charles Baudelaire), Menuet (Guy de Maupassant), Mort de Judas (Paul Claudel), Le Retour de l'Enfant Prodigue (André Gide), Grand-Lebrun (François Mauriac), Le Passe-Muraille (Marcel Aymé), and L'Hôte (Albert Camus). Students of French, or those who wish to refresh their knowledge of the language, will welcome this treasury of masterly fiction. The selections are arranged chronologically, allowing the reader to witness the development of French literary art — from Voltaire to Camus. Excellent English translations appear on pages facing the Original French. Also included are a French-English vocabulary list, textural notes, and exercises.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    }
]