[
    {
        "Title": "Texas Wildflowers",
        "Authors": "By Reid, Jan",
        "Description": "",
        "Category": "",
        "Publisher": "Fog City Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "A Model Crime (The Nancy Drew Files, Case 51)",
        "Authors": "By Keene, Carolyn",
        "Description": "An ultrachic modeling contest draws Nancy into a beauty of a mysteryA major modeling agency, a designer clothes company, and a popular teen magazine promise to make one girl's dreams come true. All are sponsors of the Face of the Year contest -- and Bess is a finalist! With Nancy at her side, she's off to Chicago to seek the fame and fortune that awaits the winner.But the competition is fierce, and deceit proves to be the hottest fashion of all. A desperate campaign of dirty tricks has brought the contest face-to-face with disaster and scandal --and the spotlight falls on Nancy as she tries to unmask the cover girl cover-up.",
        "Category": "",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Running Scared (The Nancy Drew Files)",
        "Authors": "By Keene, Carolyn",
        "Description": "With Nancy's best friend George set to compete in the big race in Chicago, Nancy goes to the Windy City, where she finds herself involved in finding the person who has been sending death threats to top runner Annette Lang. Original.",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Guinea Pig: An Owner's Guide to a Happy Healthy Pet",
        "Authors": "By Pavia, Audrey and Pavia, Audrey (COR)",
        "Description": "This is our sixth set of Happy, Healthy Pet titles. Like the others, they are books pet owners can turn to for the essential information they need to raise a healthy pet.All books contain information on:feedinghousinggroominghealth carewhat to expect from the petbasic trainingAs our series expands and focuses on different kinds of pets, the emphasis remains on making the pet a companion. In addition, owners of more unusual pets will particularly appreciate the expert advice in these books because professional care for their animals may be difficult to come by. As always, the instruction is from expert—people who know their pet intimately, but also remember what it was like to have one for the first time.Happy, Healthy Pet guides are rich with professional quality color photos and are designed to be enjoyable and easy to learn from.",
        "Category": " Pets , Reference",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Puppy Problem (Nancy Drew Notebooks #12)",
        "Authors": "By Keene, Carolyn and Accardo, Anthony (ILT)",
        "Description": "A little puppy is turning into a big problem! Nancy's wish has finally come true: she has a dog of her own. She's a chocolate-colored Labrador retriever, and she's fun and friendly and loves to play. But the pup's also in a sticky situation -- and its up to Nancy to save her. Hannah's fresh-baked muffins have vanished, and a food thief is loose in the neighborhood. And guess who's getting blamed? Nancy's new puppy. It's so unfair, and she's going to prove it...by finding the real thief!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Titanic Crossing",
        "Authors": "By Williams, Barbara",
        "Description": "In 1912, thirteen-year-old Albert considers his younger sister a pest, but things change when they travel with their mother and uncle aboard the Titanic and are caught up in its tragic sinking",
        "Category": "",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The Gigantic Joke Book",
        "Authors": "By Rosenbloom, Joseph",
        "Description": "Over 1,000 jokes, 96 drawings. Index. \"Gr.4-6. A gigantic compendium of rib-tickling, giggle-inspiring one liners, puns, funny stories, put-downs...Clever and witty.\"--SLJ. \"True kid appeal.\"--Learning.    256 pages, b/w illus. throughout, 5 3/8 x 8 1/4.",
        "Category": " Juvenile Nonfiction , Humor , Jokes & Riddles",
        "Publisher": "Union Square Kids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "Pillsbury: Fast and Healthy Cookbook: 350 Easy Recipes for Every Day",
        "Authors": "By Pillsbury Company",
        "Description": "In the latest addition to the Pillsbury home cook's library, Pillsbury: Fast and Healthy Cookbook presents 350 of the best recipes from Pillsbury's Fast and Healthy magazine and proves how simple and appealing healthy eating can be.Presented in the same style as the magazine, Pillsbury: Fast and Healthy Cookbook provides recipes (most 30 minutes or less to prepare!), informative sidebars, tips on storage and selecting ingredients, substitution ideas and short cuts, accompanied by 100 appetizing full-color photographs. For those who are new to healthy eating, there is a thorough introduction with recommended dietary guidelines, an explanation of the food pyramid and how to calculate serving sizes, healthy cooking techniques, a glossary of nutrients and much, much more. The hundreds of recipes include all the foods home cooks have grown to love.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Adventures of Blue Avenger",
        "Authors": "By Howe, Norma",
        "Description": "On his sixteenth birthday, David Schumacher changes his name to Blue Avenger. . . And things start to happen. Within twenty-four hours, David becomes a national hero, starts dating an extraordinary girl named Omaha Nebraska Brown, and bakes an imperfect pie. And that's not all. A tiny sow bug is injured by a lawn mower, some killer bees make their home at San Pablo High School, and there is some activity in the earth's crust. The connection? No one knows for certain. At first, it seems that David's own free will is guiding his momentous decision. But maybe it's something else. Maybe it's the inevitable result of everything that has ever happened to him since his miraculous birth. To find out more about life and death, romance, gun control, lemon meringuepie, and world peace, you'll have to read this book. The decision is yours. Or is it?On his sixteenth birthday, still trying to cope with the unexpected death of his father, David Schumacher decides--or does he--to change his name to Blue Avenger, hoping to find a way to make a difference in his Oakland neighborhood and in the world.",
        "Category": " Young Adult Fiction , Romance , General",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Haven: Finding the Keys to Your Personal Decorating Style",
        "Authors": "By Madden, Chris Casson, Hill, Nancy E. (PHT), and Schultz, Carolyn",
        "Description": "The author of A Room of Her Own uses three distinctive styles--Adventurous, Romantic, and Serene--to show readers how to unlock their individual creative personalities to produce vivid and stylish designs for every room in the house, in a richly illustrated guide to personalizing one's home decorating. 25,000 first printing.",
        "Category": " Architecture , Interior Design , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Teacher's Pet: Wild at Heart (Vet Volunteers)",
        "Authors": "By Anderson, Laurie Halse",
        "Description": "Adjusting to middle school becomes easier for twelve-year-old Maggie when she finds that her biology teacher, who is blind, can learn a few things from her about working with his guide dog.",
        "Category": " Juvenile Fiction , Social Issues , Peer Pressure",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Vampire Trouble (Bailey City Monsters, No.3)",
        "Authors": "By Dadey, Debbie, Jones, Marcia Thornton, and Gurney, John Steven (ILT)",
        "Description": "The weird adult populace of Bailey City is rendered yet stranger with the arrival of Hauntly family of Hauntly Manor Inn, in particular Madame Hauntly, who cheers on the kids at soccer games but nevertheless sleeps in the dirt and bears fangs. Original.",
        "Category": " Juvenile Fiction , Horror",
        "Publisher": "Little Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Over Sea, Under Stone: I (Voyager/HBJ Book)",
        "Authors": "By Cooper, Susan",
        "Description": "Three children on vacation in Cornwall find an ancient manuscript which sends them on a dangerous quest that entraps them in the eternal battle between the forces of the Light and the Dark.",
        "Category": "",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "Straight A's Never Made Anybody Rich: Lessons in Personal Achievement",
        "Authors": "By Roberts, Wess",
        "Description": "A direct approach to gaining personal success discusses the attributes of high achievers, arguing that academic achievement and wealth do not guarantee personal satisfaction",
        "Category": " Psychology , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Patch the Perfect Kitten #6 (Kitten Friends, 6)",
        "Authors": "By Hellard, Susan (ILT) and Dale, Jenny",
        "Description": "Lucy falls in love as soon as she discovers the wet, dirty calico kitten on her doorstep, but even though she knows that Patch is special, she worries that she might not be able to keep her.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Henry and the Clubhouse (Henry Huggins, 5)",
        "Authors": "By Cleary, Beverly",
        "Description": "Fiery Ramona Quimby and the well-meaning Henry Huggins may clash, but in this delightful and hilarious novel by Newbery Medal–winning author Beverly Cleary, it's an unlikely compromise that wins the day.Henry and his friends are building a no-girls-allowed clubhouse. With a private space of their own, and a top-secret password required for entry, the boys are relieved to finally have a hang-out spot they don't have to share. But Henry's about to find out that nothing—not even a sign—will keep gutsy Ramona out of their clubhouse…and her retaliation may just ruin Henry's newspaper career.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2021"
        }
    },
    {
        "Title": "101 Ways to Do Better in School",
        "Authors": "By Colman, Penny and Bogan, Paulette (ILT)",
        "Description": "",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "The Dearly Departed",
        "Authors": "By Lipman, Elinor",
        "Description": "With her trademark humor and warmth, the beloved author of The Ladies' Man and The Inn at Lake Devine explores going home again; about finding light in the dark corners of one's inhospitable past; about love, golf, and DNA. Everyone in King George, New Hampshire, loved Margaret Batten, part-time amateur actress, full-time wallflower, and single mother to a now-distant daughter, Sunny. But accidents happen.  The death of Margaret, side by side with her putative fiancé, brings Sunny back to the scene of the unhappy adolescence she thought she’d left behind. Reentry is to be dreaded; there’s no hiding in a town with one diner, one doctor, one stop sign, one motel.  Yet allies surface; even high school tormentors have grown up in unforeseen and gratifying ways. Just possibly, Sunny begins to think, she wasn’t as beleaguered as she felt she was. And maybe her mother’s life was richer than anyone suspected. Add to the mix a chief of police whose interest in Sunny exceeds his civic duty, and you have the makings of an irresistibly beguiling tale from an author who writes with all the wit and wry authority of a latter-day Jane Austen.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Not So Big Solutions for Your Home",
        "Authors": "By Susanka, Sarah and Susanka Studios (COR)",
        "Description": "Sarah Susanka's Not So Big Solutions for Your Home explores practical design ideas that can transform any house into a great house that looks, works and feels right for the owner.Sarah Susanka, whose previous best-selling books showed homeowners how to appreciate and create a house that is beautiful, visually expansive and reflective of how families really live, now offers readers practical, everyday design ideas on everything from selecting a site for a new home to designing a mail-sorting space. Photographs, along with over 150 drawings from Sarah Susanka's own sketchbook, illustrate practical home design ideas for everyday living.Not So Big Solutions for Your Home is a compilation of over 30 columns written by Sarah Susanka for Fine Homebuilding magazine.-- Makes architecture and design accessible to people who are not trained in the field-- Provides a wide variety of practical, accessible, everyday solutions",
        "Category": " House & Home , Design & Construction",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Home Repair Handbook",
        "Authors": "By Sunset",
        "Description": "",
        "Category": "",
        "Publisher": "Sunset Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Rensime (Sime/Gen Series)",
        "Authors": "By Lichtenberg, Jacqueline",
        "Description": "An explosive election campaign sets off a dangerous crisis in the strange world of the Simes and Gens",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Bottom Line Personal Book of Bests: Inside Information from America's Leading Experts",
        "Authors": "By Bottom",
        "Description": "Based on a popular newsletter, a new guide to living life better provides readers with tips on everything from taxes to calling 911, and includes advice from such experts as Deepak Chopra, Peter Lynch, John Gray, and Kenneth Cooper. Original.",
        "Category": " Business & Economics , Consumer Behavior",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Worst-Case Scenario Survival Handbook: Weddings",
        "Authors": "By Borgenicht, David, Piven, Joshua, Brown, Brenda (ILT), Borgenisht, David, and Jordan, Sarah",
        "Description": "Wedding dress torn? Ring lost? Cake collapsed? Groom gone missing? Despite all the planning, the happy couple might not actually be prepared for The Big Day and all that can go awry. Luckily, the authors of the phenomenally best-selling Worst-Case Scenario Survival Handbook series are back with all new, step-by-step instructions to help the bride and groom&#151;and everyone else&#151;survive the nuptials, from trimming the guest list all the way through to repurposing unwanted presents. This matrimonial magna carta teaches how to charm nightmare in-laws, survive the bachelor party, combat floral allergies, stop a disastrous toast, and respond to honeymoon surprises. A helpful appendix provides creative solutions to other wedding emergencies: how to make a ring&#151;or a bouquet&#151;out of paper, conceal wedding day blemishes, and painlessly generate thank-you notes. No one should say \"I do\" without this essential survival guide: it's the absolutely perfect shower gift, and an indispensible self-help guide to getting hitched without a hitch.",
        "Category": " Reference , Weddings",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Fulton County",
        "Authors": "By Goldman, James",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "The Part of Fortune",
        "Authors": "By Goldman, Laurel",
        "Description": "The women of an old age home in the South tell the stories of their men, children, hopes, disappointments, jobs, lovers, and betrayals to Clara, a middle-aged woman who works as a storyteller",
        "Category": "",
        "Publisher": "Grove Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "God Still Don't Like Ugly",
        "Authors": "By Monroe, Mary",
        "Description": "This powerful sequel to God Don't Like Ugly follows Annette Goode, who has recently reconciled with the father she never knew, as she finds solace in the arms of her childhood sweetheart after a dark secret from her past destroys her engagement and a troubled friend unexpectedly comes back into her life. 50,000 first printing.",
        "Category": " Fiction , African American , General",
        "Publisher": "Dafina",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Everything Homeselling Book (Everything)",
        "Authors": "By Rejnis, Ruth",
        "Description": "An introduction to the world of real estate takes prospective buyers on a tour through the entire process and offers useful advice on selling a house without an agent. Original. $250,000 ad/promo.",
        "Category": " Self-help , General",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Herbs (Burpee American gardening series)",
        "Authors": "By Kraska, Martha E.",
        "Description": "Offers advice on planning a herb garden, describes the most popular species and their care requirements, and answers common questions about herb gardening",
        "Category": "",
        "Publisher": "Prentice Hall Gardening",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Wildflowers: A Quick Identification Guide to the Wildflowers of North America (Macmillan Field Guides)",
        "Authors": "By Mohlenbrock, Robert H.",
        "Description": "Describes the structure of flowers, shows more than three hundred species of wildflowers, and includes information about habitat, range, and characteristics",
        "Category": " Science , General",
        "Publisher": "Collier Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "The Audubon Society Master Guide to Birding, Vol. 2: Gulls to Dippers",
        "Authors": "By Farrand, John (EDT)",
        "Description": "A field handbook for bird watchers shows and describes all of the 835 species of birds in North America",
        "Category": " Science , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "The Audubon Society Master Guide to Birding, Vol. 1: Loons to Sandpipers",
        "Authors": "By Farrand, John (EDT)",
        "Description": "A field handbook for bird watchers shows and describes all of the 835 species of birds in North America",
        "Category": " Science , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "The Harmony Illustrated Encyclopedia of Classical Music",
        "Authors": "By Gammond, Peter",
        "Description": "Relates the history and development of the orchestra and opera, with profiles of outstanding conductors, composers and singers, and includes a look at chamber music and a survey of the instruments used",
        "Category": " Music , Genres & Styles , Classical",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Nobody Likes Me, Everybody Hates Me: The Top 25 Friendship Problems and How to Solve Them",
        "Authors": "By Borba, Michele",
        "Description": "Do you wish your kid had more friends or could keep the ones she has?Is teasing, gossiping, bullying, or cyber-bullying a problem?Is she often left out or rejected by other kids?Does he just follow the crowd? Are you concerned about his friends?Does she complain that she’s unpopular or that nobody likes her?Are you at a loss for how to help your child handle those play dates, sleepovers, being shy, too sensitive, too competitive, or having a bad reputation?Look no further. The resource you need to solve these problems and boost your child’s social competence is in your hands Based on a survey of five thousand teachers and parents, Nobody Likes Me shows how to teach your child the 25 most essential friendship-building skills kids need to find, make, and keep friends, as well as survive that social pressure from peers.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Reflexology Workout: Hand & Foot Massage for Super Health & Rejuvenation",
        "Authors": "By Rick, Stephanie",
        "Description": "This holistic guide offers instruction in stimulating corresponding organs and body parts, controlling the release of hormones, and regulating metabolism by applying pressure to the reflex points of hands and feet",
        "Category": "",
        "Publisher": "Harmony Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "How to Really Love Your Teenager",
        "Authors": "By Ross Campbell",
        "Description": "",
        "Category": "",
        "Publisher": "Chariot Victor Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Joy School (Katie Nash)",
        "Authors": "By Berg, Elizabeth",
        "Description": "In this exquisite new novel by bestselling writer Elizabeth Berg, a young woman falls in love -- and learns how sorrow can lead to an understanding of joy.Katie, the narrator, has relocated to Missouri with her distant, occasionally abusive father, and she feels very much alone: her much-loved mother is dead; her new school is unaccepting of her; and her only friends fall far short of being ideal companions. When she accidentally falls through the ice while skating, she meets Jimmy. He is handsome, far older than she, and married, but she is entranced. As their relationship unfolds, so too does Katie's awareness of the pain and intensity first love can bring.Beautifully written in Berg's irresistible voice, Joy School portrays the soaring happiness of real love, the deep despair one can feel when it goes unrequited, and the stubbornness of hope that will not let us let go. Here also is recognition that love can come in many forms and offer many different things. Joy School illuminates, too, how the things that hurt the most can sometimes teach us the lessons that really matter.About Durable Goods, Elizabeth Berg's first novel, Andre Dubus said, \"Elizabeth Berg writes with humor and a big heart about resilience, loneliness, love and hope. And the transcendence that redeems.\" The same will be said of Joy School, Elizabeth Berg's most luminous novel to date.",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Top 10 of Film",
        "Authors": "By Ash, Russell",
        "Description": "The author expands a popular section from his book The Top Ten of Everything, into this collection, which includes top ten lists sorted by genre, director, actor, and studio. There are also lists of top stars, box office successes (and flops), top films in other countries, highest grossing films of all time, popular DVD and video rentals, and winners of various awards, polls, and festivals. Color photography and film stills complement each page. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Performing Arts , Film , Reference",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Beyond Pritikin: A Total Nutrition Program For Rapid Weight Loss, Longevity, & Good Health",
        "Authors": "By Gittleman, Ann Louise and Desgrey, J. Maxwell",
        "Description": "The proven natural way to a healthier, slimmer life!   Americans have never been more health- and diet-conscious, yet the percentage of overweight Americans is greater than ever before. Could the fat-free diet often promoted for weight loss and health actually be causing sugar cravings, weight gain, fatigue, and other serious problems?Based on a revolutionary dietary model using healthful essential fats and lower carbohydrate intake, Beyond Pritikin is a complete lifestyle regimen for health, weight loss, and longevity. In this updated program, informed by the latest scientific research, Ann Louise Gittleman, former director of nutrition at the Pritikin Longevity Center, tells you how to lower cholesterol, revitalize your immune system, control weight, and slow the aging process—the major health concerns of our time.Beyond Pritikin includes:  • The compete guide to the essential fats: how they work, and what foods and dietary supplements contain them • How carbohydrates, when not balanced in the diet by sufficient protein and fat, stimulate insulin production—which promotes the storage of body fat • Fat-burning nutrients—natural substances that boost the body’s ability to burn fat • The original two-week “fat flush” to help detoxify your body and jump-start weight loss • A 21-day eating program for natural weight loss—including balanced meal plans and delicious recipes to satisfy every taste • Advice on how to purchase, store, and prepare foods on the Beyond Pritikin Diet Plan • Plus vital information on the benefits of foods once considered “bad,” the dangers of some “heart-healthy” foods, and much more!",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Born O'Hurley (The Last Honest Woman / Dance to the Piper)",
        "Authors": "By Roberts, Nora",
        "Description": "Features The Last Honest Woman, in which the widow of a notorious race car champion hides her past from an arrogant biographer, and Dance to the Piper, in which professional dancer Maddy O'Hurley shows a ruthless businessman the importance of love. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Book of Reptiles and Amphibians,",
        "Authors": "By Bevans, Michael H.",
        "Description": "",
        "Category": "",
        "Publisher": "Garden City Publishing Co., Inc.",
        "Price Starting With ($)": "20.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "Cuba",
        "Authors": "By Coonts, Stephen",
        "Description": "In Cuba, an ailing Fidel Castro lies dying. Across the Straits of Florida, an anxious U.S. awaits the inevitable power struggle, determined to have a say in who controls this strategically invaluable island. And the American president has an added reason for concern: an arms-control conference has just begun in Paris and, unbeknownst to either the American public or Cuba, the U.S. has hidden secret weapons inside the American base on Cuba's Guantanamo Bay. But no secret remains one for long, and when one of the Cuban factions finds out about the weapons, the excitement begins.Only Admiral Grafton, on an aircraft carrier off the coast of Cuba, knows the impending danger. Only Grafton can save America from a disaster that would make the Bay of Pigs look like child's play.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "This Time Called Life",
        "Authors": "By Rinder, Walter",
        "Description": "Through poetry and photography the author shares his thoughts about love, caring, understanding, and fulfillment",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "The Complete Unabridged Super Trivia Encyclopedia",
        "Authors": "By Worth, Fred L.",
        "Description": "Compiles hundreds of interesting trivial and not-so-trivial facts about movies, awards, sports, comics, music, tragic historical events, and a host of other topics",
        "Category": "",
        "Publisher": "Brooke House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Beyond Beef: The Rise and Fall of the Cattle Culture",
        "Authors": "By Rifkin, Jeremy",
        "Description": "An analysis of the beef culture incorporates anthropology, history, sociology, economics, and ecology to demonstrate how \"cattle culture\" has changed our world. Reprint. 25,000 first printing. National ad/promo.",
        "Category": " Nature , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Inheritance",
        "Authors": "By Ganesan, Indira",
        "Description": "In her first novel since her debut with The Journey, Indira Ganesan gives us the story of Sonil, who at fifteen has come to her adored grandmother's house on a paradisaical island off the coast of India (\"a tiny eye, to the teardrop that was Sri Lanka\") to mend her shaky health. She has been living on the mainland with her aunts, to whom she was sent by her mother when she was a baby, and she yearns to find out why she was exiled and where her American father might be.Little by little, her spirits revive, and we see Sonil begin to move out of the magical world of her grandmother's compound into the wider life of the island, until she finds the perfect escape from her mother's reflection in a passionate affair with a young American. It is through her feelings for him that she begins to discover the means to forgive her mother and to look to herself for the answers she will need in the coming years.",
        "Category": " Fiction , Literary",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Say ... didn't you used to be George Murphy?",
        "Authors": "By Murphy, George",
        "Description": "",
        "Category": "",
        "Publisher": "Bartholomew House",
        "Price Starting With ($)": "47.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "How to Make War 3rd Edition",
        "Authors": "By Dunnigan, James F.",
        "Description": "Provides a detailed explanation of virtually every facet of modern warfare, examining the world's armed forces, weapons, tactics, logistics, intelligence, and more",
        "Category": "",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "6.13",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "How Your Child Is Smart: A Life-Changing Approach to Learning",
        "Authors": "By Markova, Dawna and Powell, Anne",
        "Description": "Not all children learn in the same way. Written by two educators, How Your Child is Smart identifies six patterns of learning and teaches parents how to help their children learn and communicate most effectively. Through simple questions, activities, and charts, parents can identify their child's pattern and learn how he or she can best be taught in school.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Conari Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Deadly Emotions: Understand the Mind-Body-Spirit Connection That Can Heal or Destroy You",
        "Authors": "By Colbert, Don",
        "Description": "Did you know that negative emotions can adversely affect your health? Depression, anger, guilt, condemnation, low self-esteem-these are only a few of the lethal toxins that threaten body and spirit.Offering a clear definition of deadly emotions-what they are, where they come from, how they manifest themselves, and their effects on the body-Dr. Colbert uses scientific evidence to support his views. He further offers hope in the form of God's power to deliver readers from these toxins, focusing on the power of forgiveness and repentance, the value of a merry heart, and the joy of the Lord. Finally, Dr. Colbert shares insights on the role nutrition plays in removing the physical toxins that inhibit true health.",
        "Category": " Health & Fitness , Healing",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "WOODROW WILSON",
        "Authors": "By Heckscher, August",
        "Description": "",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Scribner",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The Last Best Hope of Earth: Abraham Lincoln and the Promise of America",
        "Authors": "By Neely, Mark E.",
        "Description": "Mark R. Neely, Jr., provides for the general reader the first compact biography of Abraham Lincoln based on new scholarship. There is no comparable, succinct work on this nation's greatest president.The Last Best Hope of Earth vividly recaptures the central place of politics in Lincoln's life. In Illinois, Lincoln was an established and prosperous lawyer, married to a refined and educated southern belle, and the father of four boys. Throughout his life, however, politics remained his first love. In Neely's depiction of Lincoln, power was never sought for its own sake. Having triumphed over the hardscrabble circumstances of his youth in Kentucky and Indiana, Lincoln, early in his political career, tied his ambition to the search for solutions to the economic underdevelopment of the American West. And in the last eleven years of his life, Lincoln's political ambitions became yoked to a fierce nationalism and a keen moral purpose - the preservation of the Union and the demise of slavery. Lincoln could not remember a time when he did not hate slavery, or revere the federal system. He made his position clear in the decade leading up to his presidential election campaign, and a civil war erupted.Through Neely's eyes we see the growth of this president's advanced ideas about military strategy, despite their price in blood; his husbanding of the resources of the home front, regardless of its cost in national treasure; and his complex defense of the Constitution, notwithstanding a momentary loss of civil liberties. We also see Lincoln's steadfast dedication to the Emancipation Proclamation, while the fate of the republic and the future of four million black Americans hung in the balance.Richly illustrated, nuanced and accessible, written with attention to the age in which Lincoln lived, yet ever alert to universal moral questions, this is a portrait of Lincoln as an extraordinary man in his own time and ours.",
        "Category": "",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Cover Letters That Knock 'Em Dead",
        "Authors": "By Yate, Martin John",
        "Description": "Offers advice on writing a professional-looking cover letter that complements the accompanying resume and draws attention to the job applicant, and includes guidance on resumes, interviews, and job hunting.",
        "Category": " Business & Economics , Careers , Resumes",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "CHALLENGE TO LEADERSHIP",
        "Authors": "By Sawhill, Isabel V.",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Urban Institute Press",
        "Price Starting With ($)": "6.15",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "American Academy of Pediatrics Guide to Your Child's Nutrition",
        "Authors": "By American Academy of Pediatrics (COR), Dietz, William H. (EDT), and Stern, Loraine (EDT)",
        "Description": "The American Academy of Pediatrics Guide to Your Child's Nutrition is the most authoritative, easy-to-use, and comprehensive guide to children's diet and eating habits available. This state-of-the-art reference book was written under the direction of two prominent pediatricians, William H. Dietz, M.D., Ph.D., F.A.A.P., and Loraine Stern, M.D., F.A.A.P., and extensively reviewed by an advisory panel of experts.         The American Academy of Pediatrics knows that the real challenge for parents isn't simply being aware of the right foods to feed their children--it's getting children to actually eat those foods. The Guide to Your Child's Nutrition gives parents all the information and strategies they need to take care of the dietary requirements of children from birth through adolescence, as well as providing special insights into the following: ¸   What's best for newborns ¸         Introducing solid foods ¸   Nutrition basics for toddlers, school-age children,         and adolescents ¸   How to deal with outside influences, including         grandparents and TV commercials ¸   Identifying food allergies ¸   Recognizing and treating eating disorders  ¸   Alternative diets and supplements; food safety and additives ¸   How to tell if a child is too fat . . . too thin . . . too short        With vitamin and mineral tables, nutrient-drug interactions, and resources, this accessible and attractively designed book places special emphasis on problem solving: how to plan healthy menus, how to battle the junk-food pressures of television and other media, and how to make mealtime something the whole family looks forward to.     The American Academy of Pediatrics is the most respected authority on child and adolescent health in America, and the Guide to Your Child's Nutrition is an indispensable home reference for every parent.The American Academy of Pediatrics knows that the real challenge for parents isn't simply being aware of the right foods to feed their children--it's getting children to actually eat those foods. The Guide to Your Child's Nutrition gives parents all the information and strategies they need to meet the dietary needs of children from birth through adolescence, as well as the facts about standards of weight and height; eating disorders and special dietary needs; alternative diets and supplements; allergies; and concerns over food safety.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Algebra for Dummies",
        "Authors": "By Sterling, Mary Jane",
        "Description": "One of the most commonly asked questions in a mathematics classroom is, \"Will I ever use this stuff in real life?\" Some teachers can give a good, convincing answer; others hem and haw and stare at the floor. The real response to the question should be, \"Yes, you will, because algebra gives you power\" – the power to help your children with their math homework, the power to manage your finances, the power to be successful in your career (especially if you have to manage the company budget). The list goes on.Algebra is a system of mathematical symbols and rules that are universally understood, no matter what the spoken language. Algebra provides a clear, methodical process that can be followed from beginning to end to solve complex problems. There's no doubt that algebra can be easy to some while extremely challenging to others. For those of you who are challenged by working with numbers, Algebra I For Dummies can provide the help you need.This easy-to-understand reference not only explains algebra in terms you can understand, but it also gives you the necessary tools to solve complex problems. But rest assured, this book is not about memorizing a bunch of meaningless steps; you find out the whys behind algebra to increase your understanding of how algebra works.In Algebra I For Dummies, you'll discover the following topics and more:All about numbers – rational and irrational, variables, and positive and negativeFiguring out fractions and decimalsExplaining exponents and radicalsSolving linear and quadratic equationsUnderstanding formulas and solving story problemsHaving fun with graphsTop Ten lists on common algebraic errors, factoring tips, and divisibility rules.No matter if you're 16 years old or 60 years old; no matter if you're learning algebra for the first time or need a quick refresher course; no matter if you're cramming for an algebra test, helping your kid with his or her homework, or coming up with next year's company budget, Algebra I For Dummies can give you the tools you need to succeed.",
        "Category": " Mathematics , Algebra , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "No Hiding Place",
        "Authors": "By Wesley, Valerie Wilson",
        "Description": "When Newark hoodlum Shawn Raymond is killed, his mother, Bessie, hard-earned money in hand, begs Tamara to look into the unsolved murder. According to Bessie, the cops just didn't give a damn, but Tamara is enough of a realist to know the sad truth that gangsters usually end up getting what they deserve.Yet she can also remember a time when Shawn Raymond was an innocent boy, loved and mentored by her dead brother, Johnny. She knows that the void left by Johnny's suicide may have contributed to the bad choices Shawn made. Tied to the Raymonds by grief and memory, Tamara finally agrees to take Shawn Raymond's case.But Tamara finds that the path to the killer leads not only through the city's mean streets and threatened middle class but into her personal life as well, in a terrible, shattering way. More blood will be spilled before Tamara learns her bitter lesson that when it comes to murder and the evil in people's hearts, there truly is no hiding place.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Love @ First Site: A Novel",
        "Authors": "By McNair, Sylvia",
        "Description": "A look at the geographic, political, economic, religious, and social aspects of Malaysia.",
        "Category": " Juvenile Nonfiction , People & Places , Asia",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Group Retreat Book",
        "Authors": "By Reichter, Arlo",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Group Pub Inc",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Dennis Benson's Creative Bible Studies",
        "Authors": "By Benson, Dennis",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Group Pub Inc",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Sonnets",
        "Authors": "By Shakespeare, William and Robinson, Charles (ILT)",
        "Description": "Shakespeare's sonnets, the greatest of Elizabethan sonnet sequences, were first published in an unauthorized version in 1609.  William Shakespeare was then forty-five years old, a successful playwright, a country gentleman, and an affluent member of the Globe, the most important theatrical enterprise in London.Although the sonnets are among the finest poems in the English language, questions about them have preoccupied scholars for several hundred years.  This edition portrays the sonnets in the order and sequence thought to be traditional.This edition of the sonnets also includes imaginative, flowing illustrations of Charles Robinson.  One of the most popular of Edwardian artists, he was acclaimed for his highly original coloring and flights of fantasy.  His illustrations add an unusual dimension to the sonnets, which are unequalled in their poetic power, exploration of intimate human relationships, and sensitivity to tragedy of human aspirations.",
        "Category": " Poetry , European , English, Irish, Scottish, Welsh",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Life Carries on: Still More Classic Photos from the Pages Amer Favorite Magazn",
        "Authors": "By Life Magazine",
        "Description": "A collection of hilarious photographs from the library of Life magazine features two hundred of the most endearing, comical photographs ever taken. Original. National ad/promo.",
        "Category": " Photography , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "A Murder in Mayfair: A Novel of Suspense",
        "Authors": "By Barnard, Robert",
        "Description": "\"There's one thing you can count on: just when you think you've figured out what Barnard is up to, he'll outfox you again.\" -- People  Mystery readers everywhere cherish their favorites among Robert Barnard's critically acclaimed body of work, but one title high on most lists is A Scandal in Belgravia. With A Murder in Mayfair, Barnard gives us a compelling new story set in the same intriguing London milieu, where power, politics, and personality make a lethal mix.  When Colin Pinnock becomes a junior minister in the new Prime Minister's government, he's understandably thrilled. Still a youngish man, with a shining reputation among his colleagues, he's clearly being groomed for even higher office. Messages of congratulations flow in from near and far.  Basking in the greetings and the praise, Colin picks one soiled postcard out of the stack of congratulatory missives. \"Who Do You Think You Are?\" it asks. Who wrote the card? How did the person know his home address? Does the writer think Colin is getting a big head, or do the words carry a more profound meaning? And, taking the question literally, who, indeed, is Colin? Who were his real parents? What were the circumstances of his birth?  He had a happy childhood in the north of England, but he now recalls some clues that he might have been adopted. His mother is dead and his father is too senile to offer any help on family history. He'll have to find his answers on his own.  Even more puzzling, perhaps, than Colin's origins, is a top civil servant's shocked response when she first encounters him. Whose image does she see in Colin's face, and what possible link does Colin have to an infamous crime of the past? Faced with additional threatening messages that seem to come from somebody who knows his every movement, Colin begins an urgent investigation into his past and a dangerous search for his tormentor.  In a richly textured novel that takes us from the precincts of the powerful to a simple cottage in remotest Ireland, Robert Barnard spins an intricate tale of love and obsession that once again places him among the premier crime writers of our era.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Prophet",
        "Authors": "By Kahlil Gibran",
        "Description": "",
        "Category": "",
        "Publisher": "Senate",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Your Guide to the Sky",
        "Authors": "By Shaffer, Rick",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Lowell House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "The Complete Handbook of Home Brewing: Equipment, Ingredients, Methods, 55 Recipes",
        "Authors": "By Miller, David G. and Stafford, Kay Holmes (ILT)",
        "Description": "Includes 55 recipes for classic ales and lagers as well as equipment, materials, and procedures information. 103,000 copies in print.",
        "Category": " Cooking , Beverages , Beer",
        "Publisher": "Storey Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Snafu: Great American Military Disasters",
        "Authors": "By Regan, Geoffrey",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "The New Complete Joy of Home Brewing",
        "Authors": "By Papazian, Charlie",
        "Description": "Stouts, ales, lagers, porters, bitters, pilseners, specialtybeers, and meads. . .they're all remarkably easy to make! WithThe New Complete Joy of Home Brewing -- acclaimed by criticsand amateur brewmeisters alike as the best and most authoritative guide on the market -- you can learn to make beer just the way you like it! And it's fun! Whether you prefer a richer, creamier head, a more flavorsome, full-bodied brew, or a sparkling, sweeter ale -- from the lightest lager to the darkest stout -- as a home brewer you can make them all and even keg your own like the beer masters of old!Simple, Easy-to-Follow Sections on: Getting your home brewery together: the basics -- malt, hops, yeast and water 10 easy lessons to making your first bubbling batch of beerBrewing exciting world-class styles of beer that will impress and delight your friends Using fruit, honey and herbs for a spicier, feistier brewBrewing with malt extracts for an unlimited range of strengths and flavors. . .and much, much more!Plus: A complete home brewer's glossary; a fascinating look at the history of beer; details about the advanced world of all-grain and mash extract brewing; growing your own hops; more than 50 fantastic recipes-from Cherry Fever Stout to Monkey's Paw Brown Ale.Over 80 Illustrations -- Contains New Up-to-Date Information!",
        "Category": " Cooking , Reference",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Appetizers",
        "Authors": "By Sunset Books",
        "Description": "Includes recipes for a variety of hot, cold, and microwavable appetizers",
        "Category": " Cooking , Courses & Dishes , Appetizers",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Love Is A Choice Recovery for Codependent Relationships",
        "Authors": "By Minirth, Frank, Meier, Paul, and Hemfelt, Robert",
        "Description": "These bestselling doctors walk you through their ten proven stages to recovery from codependency that results from external circustances. Humans are susceptible to codependency because of our sinful tendency to use defense mechanisms to fool ourselves. In codependent relationships, deceitful games are played, and important Christian principles are often taken out of context and abused. God wants us to have healthy relationships with a balance between being dependent and independent. The doctors describe how the most effective means of overcoming codependent relationships is to establish or deepen a relationship with Christ Himself. They describe the causes of codependency, pointing out the factors that perpetuate it, and lead readers through their ten stages of recovery.",
        "Category": " Self-help , Codependency",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The Compass In Your Nose: And Other Astonishing Facts About Humans",
        "Authors": "By Litzinger, Rosanne (ILT) and McCutcheon, Marc",
        "Description": "Gathers little known facts about the human body and discusses sleep, the senses, conception, infancy and mortality",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Adrenalin and Stress",
        "Authors": "By Hart, Archibald",
        "Description": "",
        "Category": "",
        "Publisher": "W. Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "A House in the Cotswolds: The History and Decor of a 17th Century English Home",
        "Authors": "By Clifford, Jane",
        "Description": "",
        "Category": "",
        "Publisher": "Crown Publishers Inc.",
        "Price Starting With ($)": "6.88",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "The Little Engine That Could mini",
        "Authors": "By Piper, Watty",
        "Description": "What do you get when you combine an all-time classic and a tiny format?  The perfect gift for giving.  Share the story of the little blue engine with your pint-sized reader.",
        "Category": " Juvenile Fiction , Toys, Dolls & Puppets",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Neena Gathering",
        "Authors": "By Colander, Valerie Nieman",
        "Description": "Neena and her aunt, Maura, try to start a new life in United States devastated by chemical warfare",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Pageant Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "France (Eyewitness Travel Guide)",
        "Authors": "By Bailey, Rosemary (EDT) and Ardagh, John (EDT)",
        "Description": "",
        "Category": " Travel , Europe , France",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "6.19",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Eye for an Eye: The Doll (Blackstone Chronicles, Part 1)",
        "Authors": "By Saul, John",
        "Description": "When the demolition of Blackstone Asylum is postponed due to financial problems, worried contractor Bill McGuire receives the mysterious gift of an antique doll, which is snatched up by his small daughter and contains a terrible evil. Original.",
        "Category": " Fiction , Horror",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Other People's Children: A Novel",
        "Authors": "By Trollope, Joanna",
        "Description": "Joanna Trollope delves into the dynamics of stepfamily life and  introduces us to two couples whose relationships are complicated by the  enriching-and sometimes enraging-presence of others. From the grown  daughter who insinuates herself into her widowed father's romantic  life, to the sullen teenager whose loyalties lie with her estranged  mother; from the awkwardness of tense celebrations to the discovery of  surprising sources of strength, this novel is \"a bittersweet tale of  the painfully divided affection created whenever a stepfamily is  formed.\" (Kirkus Reviews)",
        "Category": " Fiction , Sagas",
        "Publisher": "Berkley",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Road West",
        "Authors": "By Wright, Gary",
        "Description": "",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Wizards of the Coast",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Jeremy Thatcher, Dragon Hatcher",
        "Authors": "By Coville, Bruce",
        "Description": "If Howard Morton and Freddie the Frog Killer were trying to hold you down so that Mary Lou Hutton could kiss you, you might run as fast as Jeremy Thatcher did the day he stumbled into Mr. Elives' Magic Shop.  And if you stumbled into that strange shop, you, too, might be asked to make a choice.  What would you buy?  The Chinese rings?  The Skull of Truth?  Or the dragon's egg?  And if you did buy the dragon's egg, what would you do when you found out you were supposed to hatch it?",
        "Category": "",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "The Pocket Guide Coffees & Teas: How to select, brew, and appreciate the finest coffees and teas",
        "Authors": "By Anderson, Kenneth",
        "Description": "Describes various blends of coffees, teas and herbal teas, explains how they are grown and prepared, and traces the history of both beverages",
        "Category": " Cooking , General",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1982"
        }
    },
    {
        "Title": "Pigs at the Trough: How Corporate Greed and Political Corruption Are Undermining America",
        "Authors": "By Huffington, Arianna",
        "Description": "Who filled the trough? Who set the table at the banquet of greed? How has it been possible for corporate pigs to gorge themselves on grossly inflated pay packages and heaping helpings of stock options while the average American struggles to make do with their leftovers?Provocative political commentator Arianna Huffington yanks back the curtain on the unholy alliance of CEOs, politicians, lobbyists, and Wall Street bankers who have shown a brutal disregard for those in the office cubicles and on the factory floors. As she puts it: “The economic game is not supposed to be rigged like some shady ring toss on a carnival midway.” Yet it has been, allowing corporate crooks to bilk the public out of trillions of dollars, magically making our pensions and 401(k)s disappear and walking away with astronomical payouts and absurdly lavish perks-for-life.The media have put their fingers on pieces of the sordid puzzle, but Pigs at the Trough presents the whole ugly picture of what’s really going on for the first time—a blistering, wickedly witty portrait of exactly how and why the worst and the greediest are running American business and government into the ground.Tyco’s Dennis Kozlowski, Adelphia’s John Rigas, and the Three Horsemen of the Enron Apocalypse—Ken Lay, Jeff Skilling, and Andrew Fastow—are not just a few bad apples. They are manifestations of a megatrend in corporate leadership—the rise of a callous and avaricious mind-set that is wildly out of whack with the core values of the average American. WorldCom, Enron, Adelphia, Tyco, AOL, Xerox, Merrill Lynch, and the other scandals are only the tip of the tip of the corruption iceberg.Making the case that our public watchdogs have become little more than obedient lapdogs, unwilling to bite the corporate hand that feeds them, Arianna Huffington turns the spotlight on the tough reforms we must demand from Washington. We need, she argues, to go way beyond the lame Corporate Responsibility Act if we are to stop the voracious corporate predators from eating away at the very foundations of our democracy.Devastatingly funny and powerfully indicting, Pigs at the Trough is a rousing call to arms and a must-read for all those who are outraged by the scandalous state of corporate America.From the Hardcover edition.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Pstalemate",
        "Authors": "By Lester Del Rey",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The Time Garden",
        "Authors": "By Eager, Edward and Bodecker, N. M. (ILT)",
        "Description": "Time and again, the children from Knight&#39;s Castle have longed for another magic adventure. But you can&#39;t find magic just anywhere. It doesn&#39;t just grow like grass. It requires the right place and the right time—      Or thyme, as the case may be.      For at Mrs. Whiton&#39;s house, magic grows wild as the fragrant banks of thyme in her garden. Eliza insists that time doesn&#39;t grow, it flies—yet growing in the garden is olden time, future time, and common time. Or so says the Natterjack, the odd toadlike creature who presides over the garden and accompanies the kids on a series of perilous, hilarious, always unpredictable adventures. \"Anything can happen,\" the Natterjack says with a wink, \"when you have all the time in the world.\"",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Odyssey Classics",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "An Enquiry Concerning Human Understanding (Paul Carus Student Editions)",
        "Authors": "By Hume, David",
        "Description": "A superb classroom edition with a detailed introduction and extensive notes by Anthony Flew, author of Hume's Philosophy of Belief. This also includes Hume's autobiography, My Own Life; Hume's An abstract of A Treatise of Human Nature; the key passage Why a Cause is Always Necessary from Hume's Treatise; three letters by Hume, and the famous letter on Hume's death by Adam Smith.",
        "Category": " Philosophy , Epistemology",
        "Publisher": "Open Court",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Fire in the Abyss",
        "Authors": "By Gordon, Stuart",
        "Description": "",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Castle For Rent",
        "Authors": "By Dechancie, John",
        "Description": "Chronicles the efforts of the castle's inhabitants to return to their home from the thousands of universes to which they have been scattered",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Who's Hiding Under the Sea?",
        "Authors": "By Nancy Parent",
        "Description": "",
        "Category": "",
        "Publisher": "Paradise Press",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "A New Christianity for a New World: Why Traditional Faith Is Dying and How a New Faith Is Being Born",
        "Authors": "By Spong, John Shelby",
        "Description": "Bishop John Shelby Spong has devoted his life to championing an authentic Christianity based on love, not hatred. In his bestselling book Why Christianity Must Change or Die, Spong convincingly demonstrated the limits of traditional faith and the toll its outmoded beliefs take on human life. Now the controversial champion of a more open and progressive Christianity courageously presents his inspiring alternative of what true faith should be today, offering a unified vision of authentic Christian belief for the third millennium.What does God look like beyond theism? How do we understand evil? Who is Christ when traditional concepts such as incarnation, atonement, and the Trinity no longer communicate any meaning? In answering these questions, Bishop Spong goes beyond abstract theology to present his vision of a radically new humanity rooted in God, yet matured beyond the need for a supernatural parental deity.A New Christianity for a New World offers an understanding of Christianity that is free of exclusivity and shame. Bishop Spong empowers those who are disillusioned by religion to discover a God who is the source of life and the source of love, unbounded by the limits of any tradition. The Church of tomorrow, lie writes, must be able to \"incorporate all of our reality. It must be able to allow God and Satan to come together in each of us . . . . It must unite Christ with Antichrist, Jesus with Judas, male with female, heterosexual with homosexual.\"After explaining why the traditional understandings of God, Christ, and the rules and dogmas of the Church are not just inoperative but dangerous, Spong offers his contemporary vision of the Church as a community of love, equality, and truth. This work is the ultimate legacy of his struggle to discover and promote a faith system that can live in our new world. Only someone who has spent a lifetime crusading for change and the rights of outcasts in the Church could give voice to such a reasoned, just, and loving faith. With Bishop Spong we can take the brave step to discover the Christianity of tomorrow.",
        "Category": " Religion , Meditations",
        "Publisher": "HarperSanFrancisco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "A Guide to Business Principles and Practices for Interior Designers: Revised Edition",
        "Authors": "By Siegel, Alan M. and Siegel, Harry",
        "Description": "A guide to . . .• The importance of sound business practice in the interior design office• How to establish an interior design practice• Carrying a job through and charging for it• The special requirements of nonresidential work• Forms, relations with trade sources, and other special factors",
        "Category": " Architecture , Interior Design , General",
        "Publisher": "Watson-Guptill",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1982"
        }
    },
    {
        "Title": "What Do People Do All Day?",
        "Authors": "By Scarry, Richard",
        "Description": "Illus. in full color. Shows and tells what busy people do every day to build houses, sail ships, fly planes, keep house, and grow food.",
        "Category": " Juvenile Nonfiction , Careers",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "17.41",
        "Publish Date": {
            "Month": "March",
            "Year": "1968"
        }
    },
    {
        "Title": "You, Staying Young: The Owner's Manual for Extending Your Warranty",
        "Authors": "By Roizen, Michael F., M.D., Oz, Mehmet, M.D., Hallgren, Gary (ILT), Spiker, Ted (CON), Oz, Lisa (CON), Wynett, Craig (CON), and Rudberg, Mark A., M.D. (CON)",
        "Description": "Drs. Oz and Roizen—the bestselling coauthors of the blockbuster YOU series—present their #1 New York Times bestselling indispensable guide to maintaining vibrant health, improving longevity, and aging gracefully.The body is the most fascinating machine ever created, and nobody talks about it in ways that are as illuminating and compelling as Dr. Michael Roizen and Dr. Mehmet Oz. Most people think of the aging of our bodies the same way we think of the aging of our cars: the older we get, the more inevitable it is that we're going to break down. Most of us believe that at age 40 or so, we begin the slow and steady decline of our minds, our eyes, our ears, our joints, our arteries, our libido, and every other system that affects the quality of life (and how long we live it). But according to Dr. Roizen and Dr. Oz, that's a mistake. Aging isn't a decline in our systems. It's actually very purposeful. The very systems and biological processes that age us are designed to help us when we're a little bit younger. So what's our role as part of the aging population? To learn how those systems work so we can reprogram them to work the way they did when we were younger. Your goal should be: die young at any age. That means you live a high quality of life (with everything from working joints to working genitals) until the day you die. At the core of this landmark book are the Major Agers—14 biological processes that control your rate of aging. Some you've heard of, some you haven't, and some you never knew contributed to the aging process. Some speed decline, others inhibit your repair mechanisms. These Major Agers are everything from short telomeres and inefficient mitochondria to stem cells and wacky hormones. The doctors explain the principles of longevity and many of the causes of aging and how to fight the effects. The climax of the book is a 14-day plan to help you along your path to staying young. The doctors want you to be able to integrate important processes into your daily life in order to make staying young routine, but first you'll need to measure your real age and health right now. Staying young encompasses your emotions and mental health as well as your exercise habits, eating habits, personal hygiene, and genes, among other things. Wouldn't you like to know how to prevent your body from aging badly? The original YOU book showed how bodies work in general, and YOU: On a Diet explained how bodies lose weight and stay fit. Now in YOU: Staying Young, Drs. Michael Roizen and Mehmet Oz illuminate the mysterious mechanisms with a lively metaphor—the modern city. What differentiates a vibrant and thriving city that ages gracefully from one that is worn down and rusted out? Despite genetic differences, which are like the geography upon which the city is built, cities age differently because of the way residents treat their education system (stem cells), power plants (mitochondria), electrical grids (brains), transportation routes (blood vessels), and landfills (fat). You—as mayor, resident, and street cleaner—have the power to balance your biological budget to ensure a life that's both long and strong. Thankfully, just as cities can invest in renewal and improving their repair processes, so can you. YOU: Staying Young is filled with signature YOU Tools, including YOU Tests, YOU Tips, and visual and verbal metaphors to bring the science to life.",
        "Category": " Medical , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Life of The Beloved: Spiritual Living in a Secular World",
        "Authors": "By Nouwen, Henri J. M.",
        "Description": "\"All I want to say to you is, 'You are the Beloved,' and all I hope is that you can hear these words as spoken to you with all the tenderness and force that love can hold. My only desire is to make these words reverberate in every corner of your being - 'You are the Beloved.'\"",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Crossroad Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Beep, Beep! - level 1 (Start to Read)",
        "Authors": "By Gregorich, Barbara",
        "Description": "A truck driver is stopped by a very large flock of sheep crossing the road",
        "Category": " Juvenile Fiction , Transportation , Cars & Trucks",
        "Publisher": "School Zone Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "Volcanoes: Mountains That Blow Their Tops (Penguin Young Readers, Level 3)",
        "Authors": "By Nirgiotis, Nicholas and Radencich, Michael (ILT)",
        "Description": "An easy-to-read introduction to one of nature's most spectacular forces provides a close-up look at volcanoes and other seismic activity, explaining how volcanoes are formed, what causes them, and the impact of an eruption on the planet. Simultaneous.",
        "Category": " Juvenile Fiction , People & Places , General",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Rabbit Gets Lost",
        "Authors": "By Gaines, Isabel, Margulies, Teddy Slater, and Studio Orlando (ILT)",
        "Description": "Thinking that Tigger is just too bouncy, Rabbit, Piglet, and Pooh take him out to the forest to give him a scare",
        "Category": " Juvenile Fiction , Interactive Adventures",
        "Publisher": "Disney Pr (Jp)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Meet Abraham Lincoln",
        "Authors": "By Cary, Barbara and Marchesi, Stephen",
        "Description": "This warmly told biography of our sixteenth president is enriched by many authentic but seldom told anecdotes and complemented by bold color illustrations that capture the spirit of Lincoln and his era.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "The Gospel According to Disney: Faith, Trust, and Pixie Dust",
        "Authors": "By Pinsky, Mark I.",
        "Description": "Explores the role that the animated features of Walt Disney played on the moral and spiritual development of generations of children by exploring 31 of the most popular Disney films, as well as recent developments such as the 1990s boycott of Disney by the Southern Baptist Convention.  Original.",
        "Category": " Performing Arts , Film , General",
        "Publisher": "Westminster John Knox Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Guns, Germs, and Steel: The Fates of Human Societies",
        "Authors": "By Diamond, Jared",
        "Description": "In this \"artful, informative, and delightful\" (William H. McNeill, New York Review of Books) book, Jared Diamond convincingly argues that geographical and environmental factors shaped the modern world. Societies that had had a head start in food production advanced beyond the hunter-gatherer stage, and then developed religion --as well as nasty germs and potent weapons of war --and adventured on sea and land to conquer and decimate preliterate cultures. A major advance in our understanding of human societies, Guns, Germs, and Steel chronicles the way that the modern world came to be and stunningly dismantles racially based theories of human history. Winner of the Pulitzer Prize, the Phi Beta Kappa Award in Science, the Rhone-Poulenc Prize, and the Commonwealth club of California's Gold Medal.",
        "Category": " Science , Life Sciences , Evolution",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Something Upstairs (Avon Camelot Books)",
        "Authors": "By Avi",
        "Description": "SOMETHING UPSTAIRSThe house is very, very old-built in 1789. In the kitchen there's a door that opens to a narrow flight of stairs that corkscrew up to a tiny bedroom. If you're curious, you may want to find this place and sleep there some night-even if you know that strange noises may awaken you. But that's not all. In the dark of night, you'll see a white glow, almost shiny, and two hands will rise from a dark stain on the floor...followed by two arms...a head...then a neck. The humanlike shape, radiating a soft, pale, pulsing light, will reach out to you...beckoning. DO NOT FOLLOW...or you may be trapped forever in the unknown horror of this haunted room! SOMETHING UPSTAIRSThe house is very, very old-built in 1789. In the kitchen there's a door that opens to a narrow flight of stairs that corkscrew up to a tiny bedroom. If you're curious, you may want to find this place and sleep there some night-even if you know that strange noises may awaken you. But that's not all. In the dark of night, you'll see a white glow, almost shiny, and two hands will rise from a dark stain on the floor...followed by two arms...a head...then a neck. The humanlike shape, radiating a soft, pale, pulsing light, will reach out to you...beckoning. DO NOT FOLLOW...or you may be trapped forever in the unknown horror of this haunted room!",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Camelot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Plain Truth, Packaging may vary",
        "Authors": "By Picoult, Jodi",
        "Description": "From the bestselling author of My Sister's Keeper comes the riveting story of a murder that shatters the picturesque calm of Amish country -- and tests the heart and soul of the lawyer defending the woman at the center of the storm.The discovery of a dead infant in an Amish barn shakes Lancaster County to its core. But the police investigation leads to a more shocking disclosure: circumstantial evidence suggests that eighteen-year-old Katie Fisher, an unmarried Amish woman believed to be the newborn's mother, took the child's life. When Ellie Hathaway, a disillusioned big-city attorney, comes to Paradise, Pennsylvania, to defend Katie, two cultures collide -- and for the first time in her high-profile career, Ellie faces a system of justice very different from her own. Delving deep inside the world of those who live \"plain,\" Ellie must find a way to reach Katie on her terms. And as she unravels a tangled murder case, Ellie also looks deep within -- to confront her own fears and desires when a man from her past reenters her life.",
        "Category": " Fiction , Legal",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    }
]