[
    {
        "Title": "Science for the airplane passenger",
        "Authors": "By Elizabeth A Wood",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Hummel Art II",
        "Authors": "By Hotchkiss, John F",
        "Description": "Complete collector's guide to figurines, prints, dolls, bells, plates, music boxes and cards, with information on size, name, date of issue and retail values",
        "Category": " Art , General",
        "Publisher": "Wallace-Homestead Book Co",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "1001 Ideas for Color & Paint",
        "Authors": "By Callery, Emma",
        "Description": "For a fresh collection of stylish color schemes, look no further than 1001 Ideas for Color & Paint. Featured ideas range from contemporary treatments to traditional looks, in everything from bold colors to pretty pastels. Readers will also find professional advice for choosing paint and color, descriptions of numerous popular paint techniques, and variations on color themes on a room-by-room basis presented in sketchbook-style illustrations. Over 1,000 color palettes, photographs, and illustrations provide inspiration and tips for success. With 1001 Ideas for Color & Paint readers can give every room in their home a brand new look.",
        "Category": " House & Home , Decorating",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Madame Bovary (Vintage Classics)",
        "Authors": "By Flaubert, Gustave and Steegmuller, Francis (TRN)",
        "Description": "For daring to peer into the heart of an adulteress and enumerate its contents with profound dispassion, the author of Madame Bovary was tried for \"offenses against morality and religion.\" What shocks us today about Flaubert's devastatingly realized tale of a young woman destroyed by the reckless pursuit of her romantic dreams is its pure artistry: the poise of its narrative structure, the opulence of its prose (marvelously captured in the English translation of Francis Steegmuller), and its creation of a world whose minor figures are as vital as its doomed heroine. In reading Madame Bovary, one experiences a work that remains genuinely revolutionary almost a century and a half after its creation.",
        "Category": " Fiction , Classics",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Outgrowing the Earth: The Food Security Challenge in an Age of Falling Water Tables and Rising Temperatures",
        "Authors": "By Brown, Lester R.",
        "Description": "Ever since 9/11, many have considered al Queda to be the leading threat to global security, but falling water tables in countries that contain more than half the world's people and rising temperatures worldwide pose a far more serious threat. Spreading water shortages and crop-withering heat waves are shrinking grain harvests in more and more countries, making it difficult for the world's farmers to feed 70 million more people each year. The risk is that tightening food supplies could drive up food prices, destabilizing governments in low-income grain-importing countries and disrupting global economic progress. Future security, Brown says, now depends on raising water productivity, stabilizing climate by moving beyond fossil fuels, and stabilizing population by filling the family planning gap and educating young people everywhere.If Osama bin Laden and his colleagues succeed in diverting our attention from the real threats to our future security, they may reach their goals for reasons that even they have not imagined.",
        "Category": " Science , Environmental Science",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Rapports: Language, Culture, Communication (English and French Edition)",
        "Authors": "By Walz, Joel and Piriou, Jean-Pierre",
        "Description": "",
        "Category": " Language Arts & Disciplines , Communication Studies",
        "Publisher": "D C Heath & Co",
        "Price Starting With ($)": "6.69",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "USA (Eyewitness Travel Guides)",
        "Authors": "By Sutherland, Mary (EDT), Jensen, Jamie (CON), Hempstead, Andrew (CON), Miller, Joanne (CON), Peterson, Eric (CON), Roe, Kevin (CON), and Stann, Kap (CON)",
        "Description": "Highlights the USA's national parks, scenic routes, the vast wilderness, world-class cities, top museums and galleries. Regional chapters cover the culture, history and sights in-depth. A practical section on visiting the USA helps you plan your trip in advance, giving tips on travel, customs, laws and what to expect while the USA.",
        "Category": " Travel , United States , General",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Wizard's First Rule (Sword of Truth)",
        "Authors": "By Goodkind, Terry",
        "Description": "Basis for the television series Legend of the Seeker, launching in Fall 2008!Millions of readers the world over have been held spellbound by this valiant tale vividly told.Now, enter Terry Goodkind's world, the world of the Sword of Truth.In the aftermath of the brutal murder of his father, a mysterious woman, Kahlan Amnell, appears in Richard Cypher's forest sanctuary seeking help ... and more. His world, his very beliefs, are shattered when ancient debts come due with thundering violence.In their darkest hour, hunted relentlessly, tormented by treachery and loss, Kahlan calls upon Richard to reach beyond his sword-- to invoke within himself something more noble. Neither knows that the rules of battle have just changed ... or that their time has run out.This is the beginning. One book. One Rule. Witness the birth of a legend.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Tor Fantasy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Doctors' Secrets to a Lifetime of Clear Skin",
        "Authors": "By Katie Rodan",
        "Description": "",
        "Category": "",
        "Publisher": "Katie Rodan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Velveteen Rabbit Photograph Album",
        "Authors": "By Green, Donna (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Anthologies",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Backyard Science Experiments",
        "Authors": "By Pearce, Q.L.",
        "Description": "",
        "Category": "",
        "Publisher": "Lowell House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Taking Sides: Clashing Views on Controversial Educational Issues, 12th Edition (Rev. Ed.)",
        "Authors": "By Noll, James Wm.",
        "Description": "This expanded version of Taking Sides: Educational Issues is designed to introduce students to controversies in education. This version will retain all of the content of the twelfth edition and will feature 2 additional issues: \"Can Merit Pay Accelerate School Improvement?\" and \"Has the Supreme Court Reconfigured American Education?\" For additional support on this title, visit our student Web site Dushkin Online (www.dushkin.com/online/.",
        "Category": " Education , Philosophy & Social Aspects",
        "Publisher": "McGraw-Hill/Dushkin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Russian at a Glance: Phrase Book and Dictionary for Travelers (English and Russian Edition)",
        "Authors": "By Beyer, Thomas R.",
        "Description": "",
        "Category": " Travel , Russia",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "The Odyssey",
        "Authors": "By Homer",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "A Young Man After God's Own Heart: Turn Your Life into an Extreme Adventure",
        "Authors": "By George, Jim",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "History of Civilization: 1300-1815",
        "Authors": "By Brinton, Crane",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1971"
        }
    },
    {
        "Title": "Quick-to-Solve Brainteasers (Mensa)",
        "Authors": "By Fernandez, Juan J. De Lucio, Gordon, Peter (EDT), Tizon, Natalia M. (TRN), and American Mensa Limited (COR)",
        "Description": "Don't think too hard or you'll never solve these logic puzzles and riddles. The answers to all 187 are easy once you catch the tricky wording. How can you tie a knot in a napkin by holding one end in each hand without letting go of it? Impossible, you say (or your friends will say, if you bet them). But: Cross your arms and hold a tip of the napkin in each hand. When you uncross your arms, the knot will be formed! Now try this riddle: I climbed up a cherry tree, where I found cherries. I did not pick cherries, nor did I leave cherries. How can you explain this? Answer: I climbed up a cherry tree with two cherries in my hand. I picked only one. I left the other one on the tree. I did not \"pick cherries,\" because I \"picked a cherry.\" Take this dare: My bird can fly faster than any supersonic plane. Here's how: If you put my bird inside any plane and make it fly in the same direction as the plane, it will go faster than the plane.  96 pages, 52 b/w illus., 5 3/8 x 8 1/4.",
        "Category": " Games , Puzzles",
        "Publisher": "Puzzlewright",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Hugs for Mom, Book 2 : Stories, Sayings, and Scriptures to Encourage and Inspire (Hugs Series)",
        "Authors": "By Weiss, Leann and Boultinghouse, Philis",
        "Description": "",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Invitation to a Beheading",
        "Authors": "By Vladimir Nabokov",
        "Description": "",
        "Category": "",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "49.97",
        "Publish Date": {
            "Month": "October",
            "Year": "1959"
        }
    },
    {
        "Title": "Relationships 101 (101 Series)",
        "Authors": "By Maxwell, John C.",
        "Description": "Great leadership is built on great relationships!Leadership is a relationship-intensive endeavor. If your people skills aren't strong, neither will be your leadership. \"If people aren't following you,\" sums up New York Times and Business Week best-selling author Dr. John C. Maxwell, \"then you're not really leading.\" In Relationships 101, Maxwell provides time-tested principles for developing healthy relationships with others—inside and outside of your organization—such as:The fundamentals common to all good relationshipsHow to motivate people by knowing five things everyone has in commonHow to create a lasting connection with people on your teamWhy listening skills can be a leader's best friendThe crucial factor that creates the foundation of all good relationshipsThe most important relationship for any person's successWinning in every area of life comes from winning with people.Improve your leadership and life with Relationships 101!",
        "Category": " Religion , Inspirational",
        "Publisher": "HarperCollins Leadership",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "A Survey of Mathematics with Applications Custom Edition (A Survey of Mathematics with Applications)",
        "Authors": "By Allen R Angel",
        "Description": "",
        "Category": "",
        "Publisher": "Pearson Custom Publishing",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Let's Explore, Baby Einstein Art",
        "Authors": "By Baby Einstien",
        "Description": "",
        "Category": "",
        "Publisher": "Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Carpentry & Trimwork Step-by-Step",
        "Authors": "By Better Homes and Gardens Books (EDT) and Johnston, Larry (EDT)",
        "Description": "Step-by-step instructions ensure great results for beginner and intermediate do-it-yourselfers.Updated photos and detailed illustrations explain woodworking techniques.Includes dozens of doable carpentry projects, with special attention to popular trimwork jobs.Lists time, materials, and skills required for each project.Offers practical advice, including know-how for high-tech tools that make carpentry easier.An understandable format and great value for homeowners with little or no carpentry experience.",
        "Category": " House & Home , Do-It-Yourself , Carpentry",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Heart in the Right Place",
        "Authors": "By Jourdan, Carolyn",
        "Description": "Carolyn Jourdan, an attorney on Capitol Hill, thought she had it made. But when her mother has a heart attack, she returns home—to the Tennessee mountains, where her father is a country doctor and her mother works as his receptionist. Jourdan offers to fill in for her mother until she gets better. But days turn into weeks as she trades her suits for scrubs and finds herself following hazmat regulations for cleaning up bodily fluids; maintaining composure when confronted with a splinter the size of a steak knife; and tending to the loquacious Miss Hiawatha, whose daily doctor visits are never billed. Most important, though, she comes to understand what her caring and patient father means to her close-knit community. With great humor and great tenderness, Heart in the Right Place shows that some of our biggest heroes are the ones living right beside us.",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Dancing Dinos Go to School (Step into Reading)",
        "Authors": "By Lucas, Sally and Lucas, Margeaux",
        "Description": "Dinos dancing in a book.Dinos leaping, look, look, look!Dinos pasting red and blue.Dinos wasting paint and glue!The dancing dinos are back, and this time, when their book turns up in a school library, they leap out and bring their musical mayhem to a kid’s classroom. This fun, rhyming Step 1 reader is perfect for back-to-school!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "A Treasury for One Year Olds",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Backpack Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Alligator Baby",
        "Authors": "By Munsch, Robert N. and Martchenko, Michael (ILT)",
        "Description": "A little girl takes matters into her own hands after her brother is accidentally born in a zoo and her parents repeatedly bring home the wrong baby",
        "Category": " Juvenile Fiction , Animals , Alligators & Crocodiles",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Reshaping the Christian life",
        "Authors": "By Robert Arnold Raines",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Safe Haven",
        "Authors": "By Sparks, Nicholas",
        "Description": "In a small North Carolina town, a mysterious and beautiful woman running from her past slowly falls for a kind-hearted store owner . . . until dark secrets begin to threaten her new life.When a mysterious young woman named Katie appears in the small North Carolina town of Southport, her sudden arrival raises questions about her past. Beautiful yet self-effacing, Katie seems determined to avoid forming personal ties until a series of events draws her into two reluctant relationships: one with Alex, a widowed store owner with a kind heart and two young children; and another with her plainspoken single neighbor, Jo. Despite her reservations, Katie slowly begins to let down her guard, putting down roots in the close-knit community and becoming increasingly attached to Alex and his family.But even as Katie begins to fall in love, she struggles with the dark secret that still haunts and terrifies her . . . a past that set her on a fearful, shattering journey across the country, to the sheltered oasis of Southport. With Jo's empathetic and stubborn support, Katie eventually realizes that she must choose between a life of transient safety and one of riskier rewards . . . and that in the darkest hour, love is the only true safe haven.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Fall of Giants (The Century Trilogy)",
        "Authors": "By Follett, Ken",
        "Description": "Ken Follett’s magnificent new historical epic begins as five interrelated families move through the momentous dramas of the First World War, the Russian Revolution, and the struggle for women’s suffrage. A thirteen-year-old Welsh boy enters a man’s world in the mining pits. . . . An American law student rejected in love finds a surprising new career in Woodrow Wilson’s White House. . . . A housekeeper for the aristocratic Fitzherberts takes a fateful step above her station, while Lady Maud Fitzherbert herself crosses deep into forbidden territory when she falls in love with a German spy. . . . And two orphaned Russian brothers embark on radically different paths when their plan to emigrate to America falls afoul of war, conscription, and revolution. From the dirt and danger of a coal mine to the glittering chandeliers of a palace, from the corridors of power to the bedrooms of the mighty, Fall of Giants takes us into the inextricably entangled fates of five families—and into a century that we thought we knew, but that now will never seem the same again. . . . Look out for Ken's newest book, A Column of Fire, available now.",
        "Category": " Fiction , Sagas",
        "Publisher": "Viking",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Daily Show with Jon Stewart Presents Earth (The Book): A Visitor's Guide to the Human Race",
        "Authors": "By Stewart, Jon, Javerbaum, David, Albanese, Rory, Bodow, Steve, and Lieb, Josh",
        "Description": "The eagerly awaited new book from the Emmy-winning, Oscar-hosting, Daily Show-anchoring Jon Stewart--the man behind the megaseller America (The Book). Where do we come from? Who created us? Why are we here? These questions have puzzled us since the dawn of time, but when it became apparent to Jon Stewart and the writers of The Daily Show that the world was about to end, they embarked on a massive mission to write a book that summed up the human race: What we looked like; what we accomplished; our achievements in society, government, religion, science and culture -- all in a tome of approximately 256 pages with lots of color photos, graphs and charts.  After two weeks of hard work, they had their book.  EARTH (The Book) is the definitive guide to our species.  With their trademark wit, irreverence, and intelligence, Stewart and his team will posthumously answer all of life's most hard-hitting questions, completely unburdened by objectivity, journalistic integrity, or even accuracy.  Also available as an ebook and as an audiobook.",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Pinheads and Patriots: Where You Stand in the Age of Obama",
        "Authors": "By O'Reilly, Bill",
        "Description": "While the changes that took place in America during President Obama's first eighteen months in office are dizzying to even think about, their real-life impact on the average American is a helluva lot stronger than that. Blood pressures have soared and tempers have reached the boiling point over the shifts in health care, immigration, national security, energy, and the environment-and then there's the economy. The President and his administration have gotten folks riled. But some greedy Wall Streeters. Through it all. Bill O'Reilly can be counted on to cut through the rhctoric and tell you what's good and what's bad for you.So which of these moves have been Pinheaded ones and which have been Patriotic?O'Reilly sorts it all out with his trademark mix of humor and bluster in his most impassioned book to date. He's just the person to turn to in transformative times like these. And this is just the book to guide you through the most important issues of the midterm elections and beyond.When Bill O'Reilly interviewed then-Senator Barack Obama during the 2008 presidential elections, the two had a lively debate about the nation's future.Since that time, America has changed rapidly-some would even say seismically. And many believe these shifts are doing more than just rocking the political and social climate; they're rocking the American core.What are these changes? Who, in addition to President Obama, have been the biggest forces behind them? What exactly do they mean for you, the everyday American citizen? How are they affecting your money, health, safety, freedom, and standing in this nation?Which are Pinheaded moves and which are truly Patriotic? In his latest spirited book, O'Reilly prompts further debate with the President and the American people on the current state of the union.After five consecutive, no-nonsense, tell-it-like-it-is megabestsellers, you can count on Bill to offer blunt and constructive political commentary. And as he did in his popular memoir, he offers some introspection too, looking back at his own actions and those of past Pinheads and Patriots who have inspired a code of conduct for such taxing times.As always, O'Reilly is fair, balanced, and uncompromisingly tough when guarding the American way. Only Pinheads would fail to fight for what they love most about this country or to embrace some measure of change to make it better. The rest of us Patriots will read this book to discover the difference between the two.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Cheap Sleeps in Paris: The Revised and Expanded Guide to More Than 100 Charming, Comfortable, and Inexpensive Hotels",
        "Authors": "By Gustafson, Sandra",
        "Description": "Locating a clean, comfortable, inexpensive place to stay in the City of Light is easier than ever with this completely revised and updated sixth edition. Entries include pensions, bed-and-breakfasts, apartments, and student accommodations--with a detailed description and the government's star rating for each.",
        "Category": " Travel , Food, Lodging & Transportation , Hotels, Inns & Hostels",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Good Capitalism, Bad Capitalism, and the Economics of Growth and Prosperity",
        "Authors": "By Baumol, William J., Litan, Robert E., and Schramm, Carl J.",
        "Description": "In this important book, three prominent economists propose that there are different varieties of capitalism in the world today--some good for economic growth, others decidedly bad. Writing in an accessible style, William J. Baumol, Robert E. Litan, and Carl J. Schramm documentfour different varieties of capitalism and identify the conditions that characterize Good Capitalism—the right blend of entrepreneurial and established firms, which can vary among countries—as well as the features of Bad Capitalism. They examine how countries catching up to the United States can move faster toward the economic frontier, while laying out the need for the United States itself to stick to and reinforce the recipe for growth that has enabled it to be the leading economic force in the world. This pathbreaking book is a must read for anyone who cares about global growth and how to ensure America’s economic future.",
        "Category": " Political Science , Reference",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Betrayed (Superbolan)",
        "Authors": "By Pendleton, Don",
        "Description": "On the verge of creating a breakthrough peace initiative in the Middle East, Dr. Sharif Mahoud is on the run, hunted by purveyors of terror who see the true threat of a powerful visionary bringing bitter rivals to the bargaining table. Dr. Mahoud is good for peace, and good for the world—which is why the Oval Office directs Mack Bolan to track down the brilliant negotiator hiding deep within the Afghan hills, locate his stranded family, then get them all to safety. But the mission is compromised from the start with hostile forces dogging Bolan's every move. Soon, the true face of the enemy begins to emerge: beyond the violent radicals and extremist thugs, stand the rich and powerful investors and shadow men who understand that warfare is big business—and will do whatever it takes to keep turning a profit on blood and suffering.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Gold Eagle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Bad Blood: a Virgil Flowers novel",
        "Authors": "By Sandford, John",
        "Description": "The brilliant new Virgil Flowers thriller from the #1 New York Times-bestselling author.  One late fall Sunday in southern Minnesota, a farmer brings a load of soybeans to a local grain elevator- and a young man hits him on the head with a steel bar, drops him into the grain bin, waits until he's sure he's dead, and then calls the sheriff to report the \"accident.\" Suspicious, the sheriff calls in Virgil Flowers, who quickly breaks the kid down...and the next day the boy's found hanging in his cell. Remorse? Virgil isn't so sure, and as he investigates he begins to uncover a multigeneration, multifamily conspiracy-a series of crimes of such monstrosity that, though he's seen an awful lot in his life, even he has difficulty in comprehending it...and in figuring out what to do next.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Wicked Appetite (Lizzy and Diesel)",
        "Authors": "By Evanovich, Janet",
        "Description": "Life in Marblehead has had a pleasant predictability, until Diesel arrives. Rumor has it that a collection of priceless ancient relics representing the Seven Deadly Sins have made their way to Boston's North Shore. Partnered with pastry chef Lizzie Tucker, Diesel bullies and charms his way through historic Salem to track them down--and his criminal mastermind cousin Gerewulf Grimorie. The black-haired, black-hearted Wulf is on the hunt for the relic representing gluttony. Caught in a race against time, Diesel and Lizzie soon find out that more isn't always better, as they battle Wulf and the first of the deadly sins.With delectable characters and non-stop thrills that have made Janet Evanovich a household name,Wicked Appetite will leave you hungry for more.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Even Silence Has an End: My Six Years of Captivity in the Colombian Jungle",
        "Authors": "By Betancourt, Ingrid",
        "Description": "Ingrid Betancourt tells the story of her captivity in the Colombian jungle, sharing powerful teachings of resilience, resistance, and faith.   Born in Bogotá, raised in France, Ingrid Betancourt at the age of thirty-two gave up a life of comfort and safety to return to Colombia to become a political leader in a country that was being slowly destroyed by terrorism, violence, fear, and a pervasive sense of hopelessness. In 2002, while campaigning as a candidate in the Colombian presidential elections, she was abducted by the FARC. Nothing could have prepared her for what came next. She would spend the next six and a half years in the depths of the jungle as a prisoner of the FARC. Even Silence Has an End is her deeply personal and moving account of that time. Chained day and night for much of her captivity, she never stopped dreaming of escape and, in fact, succeeded in getting away several times, always to be recaptured. In her most successful effort she and a fellow captive survived a week away, but were caught when her companion became desperately ill; she learned later that they had been mere miles from freedom.  The facts of her story are astounding, but it is Betancourt's indomitable spirit that drives this very special account, bringing life, nuance, and profundity to the narrative. Attending as intimately to the landscape of her mind as she does to the events of her capture and captivity, Even Silence Has an End is a meditation on the very stuff of life-fear and freedom, hope and what inspires it. Betancourt tracks her metamorphosis, sharing how in the routines she established for herself-listening to her mother and two children broadcast to her over the radio, daily prayer-she was able to do the unthinkable: to move through the pain of the moment and find a place of serenity.  Freed in 2008 by the Colombian army, today Betancourt is determined to draw attention to the plight of hostages and victims of terrorism throughout the world and it is that passion that motivates Even Silence Has an End. The lessons she offers here-in courage, resilience, and humanity-are gifts to treasure.",
        "Category": " Political Science , Political Ideologies , Communism, Post-Communism & Socialism",
        "Publisher": "Penguin Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Squirrel Seeks Chipmunk: A Modest Bestiary",
        "Authors": "By Sedaris, David and Falconer, Ian (ILT)",
        "Description": "Featuring David Sedaris's unique blend of hilarity and heart, this new collection of keen-eyed animal-themed tales is an utter delight. Though the characters may not be human, the situations in these stories bear an uncanny resemblance to the insanity of everyday life. In \"The Toad, the Turtle, and the Duck,\" three strangers commiserate about animal bureaucracy while waiting in a complaint line. In \"Hello Kitty,\" a cynical feline struggles to sit through his prison-mandated AA meetings. In \"The Squirrel and the Chipmunk,\" a pair of star-crossed lovers is separated by prejudiced family members.With original illustrations by Ian Falconer, author of the bestselling Olivia series of children's books, these stories are David Sedaris at his most observant, poignant, and surprising.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Trickle Up Poverty: Stopping Obama's Attack on Our Borders, Economy, and Security",
        "Authors": "By Savage, Michael",
        "Description": "No Longer Can We Be Barack Obama's Sheeple And Let The American Dream Be Trampled, Beaten, And Burned To The GroundTrickle Up Poverty, by bestselling author and revered radio host Dr. Michael Savage, is your best defense against the Obamanomics that are dragging the middle class, and everyone else, into a Marxist-Socialist death spiral. The Savage manifesto you hold in your hands shows how Obama is circumventing the Constitution to push through his radical agendaùand, most important, how we can restore our country to the power and prestige that Barack Obama and his corrupt and degenerate \"czars\" are trying to destroy.The Naked Marxist can and must be stopped. Obama's trickle up poverty is infecting all that we hold to be true and self-evident. Here's how:Impoverishing The Middle Class: Obama's confiscatory taxes, the socializing of our health-care system, and other legislative initiatives are taking away our earnings and our power to choose how we live our lives and putting it in the hands of corrupt and pro-Socialist cohorts.Erasing Our Border With Mexico: The Homeland Security department that can't shoot straight is gutting the Constitution in the name of protecting illegal aliens when it should be focusing on keeping out the terrorists and drug dealers.Defunding The Military And Putting Our Troops In Harm's Way: Obama's beatnik policy of taking apart our nuclear arsenal and destroying NASA, while implementing PC Rules of Engagement that don't allow our troops to protect themselves, is dangerously weakening our security and ending our military dominance.Lining The Pockets Of His Wall Street Buddies: While our 401(k)'s suffer, Obama and his Wall Street heavy contributors are creating their own legislation that is driving down stock prices while allowing his biggest campaign contributors to make trillions of dollars.Propagandizing The Media: Once a forum for free speech, Obama's administration has systematically overrun the media in a hostile takeover with threats and false promises that serve only to pull the wool over the sheeple's eyes.Ignoring The Tea Partyùthe Voice Of The People: No longer a representative government, Obama is blatantly disregarding, and even suppressing, the fastest-growing collective voice in the nation right nowùthat of the patriotic Tea Party. His Union-Crony Purple Shirts have shown up at town-hall meetings and peaceful protests to intimidate and antagonize the democratic process.We Are Dangerously Close To Losing The Nation We Love, But It's Not Too Late. If You Buy Only One Book To Learn And React To What Obama The Destroyer Has Done And Plans On Doing To America, This Is It!",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Assholes Finish First",
        "Authors": "By Max, Tucker",
        "Description": "The best gift for the dudes and bros in your life: the fratire New York Times bestseller Assholes Finish First, featuring twenty-five new and exclusive stories by Tucker Max.What do you do after you write a #1 bestselling book about your drunken, sexual misadventures that makes you rich and famous? Celebrate by getting more drunk and having insane amounts of sex, obviously. And pretty soon you’ve got another bestselling book on your hands.  Stuffed full of ridiculous stories of bad decisions, debauchery, and sexual recklessness, Assholes Finish First starts where I Hope They Serve Beer In Hell left off, then proceeds to “some next-level shit.”  You already know how women react to confidence, game, and vodka, but what happens when you add money and fame to the mix? You get answers to the hard questions you've never thought of asking:  • What’s it like to have sex with a midget? What about two midgets? • What does it do to a man to watch a nineteen-year-old do wind sprints to sober up, so that she can have sex with you before her twin sister does? • At what number of virgins does deflowering them stop being fun and start feeling like a job? • When a girl you met three hours ago decides to tattoo your name on her body, what is the appropriate reaction?  The answers are inside, they are absurd and hilarious, and they are the product of one man's experiences:  His name is Tucker Max, and he is still an asshole.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Gallery",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Bob Warden's Slow Food Fast",
        "Authors": "By Warden, Bob",
        "Description": "For those who love pot roast but hate spending hours in the hot kitchen preparing it, Bob Warden's Perfect Pot Roast recipe for the pressure cooker will have them enjoying this slow-cooked comfort food favorite in just 45 minutes. With this smart cookbook, readers learn Bob's secret to making rich, creamy Vanilla Bean Cheesecake in just 25 minutes. He's even got a recipe for Most Excellent Macaroni and Cheese that tastes just like it was oven baked ? but takes only six minutes in the pressure cooker! In all, this cookbook contains 117 time-saving ways for readers to treat loved ones to the goodness of home-cooked food and still have time to sit down and enjoy it with them. Enhanced with over 50 full-page color photos, Smyth sewn binding, and plenty of tips from Bob, this cookbook is a must-have for pressure cooker novices and pros alike.",
        "Category": " Cooking , Methods , Special Appliances",
        "Publisher": "Dynamic Housewares",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "The Roots of Obama's Rage",
        "Authors": "By D'Souza, Dinesh",
        "Description": "“Stunning...the most profound insight I have read in the last six years about Barack Obama.” —NEWT GINGRICH The Roots of Obama’s Rage reveals Obama for who he really is: a man driven by the anti-colonial ideology of his father and the first American president to actually seek to reduce America's strength, influence, and standard of living. Controversial and compelling, The Roots of Obama’s Rage is poised to be the one book that truly defines Obama and his presidency.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Love, Lust & Faking It: The Naked Truth About Sex, Lies, and True Romance",
        "Authors": "By McCarthy, Jenny",
        "Description": "Inveterate truth teller McCarthy providesa funny, often poignant, and no-holds-barred look at the essence of relationships: love and sex. Jenny explores the intensity of first love, introducing us to Tony, the boy of her teenage dreams, and Tubby, her dirty, sexy stuffed teddy bear. She takes us on a whirlwind tour of the world of aphrodisiacs and fetishes, explains the importance of playing doctor and other nice and naughty fantasies, and gives thanks for the pleasures of chocolate. And she sets the story straight on STDs, man junk and lady bits, why we really cheat, why women are master manipulators, the virtues of sex with the lights off, the power of a \"loving no,\" the satisfaction of the perfect booty call, and much more. Throughout, Jenny reminds us to aim higher, believe in true love, and, most of all, be kind to ourselves.--From publisher description.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Naked Heat (Nikki Heat)",
        "Authors": "By Castle, Richard",
        "Description": "In the sequel to the New York Times bestselling HEAT WAVE, Richard Castle's new thrilling mystery continues the story of NYPD Homicide Detective, Nikki Heat. Tough, sexy, professional, Nikki Heat carries a passion for justice as she leads one of New York City's top homicide squads. In what's sure to be another smash sensation by blockbuster author Richard Castle, readers will once again follow Nikki Heat and hotshot reporter Jameson Rook as they trade barbs and innuendos all while on the trail of a murderer!For the second tie-in with the ABC television show, CASTLE, we will once again be releasing a portion of the chapters electronically, available for digital download in advance of the hardcover publication. The show will integrate the new book in the same way they did for HEAT WAVE, with mentions of the book beginning in episodes that will air in spring and culminating with the publication of the book in Fall 2010, which will be featured on the show.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Spider Bones",
        "Authors": "By Reichs, Kathy",
        "Description": "Kathy Reichs—#1 New York Times bestselling author and producer of the FOX television hit Bones—returns with the thirteenth riveting novel featuring forensic anthropologist Dr. Temperance Brennan.  John Lowery was declared dead in 1968—the victim of a Huey crash in Vietnam, his body buried long ago in North Carolina. Four decades later, Temperance Brennan is called to the scene of a drowning in Hemmingford, Quebec. The victim appears to have died while in the midst of a bizarre sexual practice. The corpse is later identified as John Lowery. But how could Lowery have died twice, and how did an American soldier end up in Canada?  Tempe sets off for the answer, exhuming Lowery’s grave in North Carolina and taking the remains to Hawaii for reanalysis—to the headquarters of JPAC, the U.S. military’s Joint POW/ MIA Accounting Command, which strives to recover Americans who have died in past conflicts. In Hawaii, Tempe is joined by her colleague and ex-lover Detective Andrew Ryan (how “ex” is he?) and by her daughter, who is recovering from her own tragic loss. Soon another set of remains is located, with Lowery’s dog tags tangled among them. Three bodies—all identified as Lowery.  And then Tempe is contacted by Hadley Perry, Honolulu’s flamboyant medical examiner, who needs help identifying the remains of an adolescent boy found offshore. Was he the victim of a shark attack? Or something much more sinister?  A complex and riveting tale of deceit and murder unfolds in this, the thirteenth thrilling novel in Reichs’s “cleverly plotted and expertly maintained series” (The New York Times Book Review). With the smash hit Bones now in its fifth season and in full syndication—and her most recent novel, 206 Bones, an instant New York Times bestseller—Kathy Reichs is at the top of her game.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Outlive Your Life: You Were Made to Make A Difference",
        "Authors": "By Lucado, Max",
        "Description": "Dear Friend,May I share a story that is very dear to my heart?It's a story of hillbillies and simple folk, net casters and tax collectors. A story of a movement that exploded like a just-opened fire hydrant out of Jerusalem and spilled into the ends of the earth: into the streets of Paris, the districts of Rome, and the ports of Athens, Istanbul, Shanghai, and Buenos Aires. A story so mighty, controversial, head spinning, and life changing that two millennia later we wonder:Might it happen again?Heaven knows we hope so. These are devastating times: 1.75 billions people are desperately poor; one billion are hungry. Lonely hearts indwell our neighborhoods and attend our schools. In the midst of it all, here we stand: you, me, and our one-of-a-kind lives. We are given a choice ... an opportunity to make a big difference during a difficult time. What if we did? What if we rocked the world with hope?Worth a try, don't you think?- Max LucadoOne hundred percent of the author's royalties from Outlive Your Life products will benefit children and families through World Vision and other ministries of faith-based compassion.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "White House Diary",
        "Authors": "By Carter, Jimmy",
        "Description": "The edited, annotated diary of President Jimmy Carter--filled with insights into his presidency, his relationships with friends and foes, and his lasting impact on issues that still preoccupy America and the worldEach day during his presidency, Jimmy Carter made several entries in a private diary, recording his thoughts, impressions, delights, and frustrations. He offered unvarnished assessments of cabinet members, congressmen, and foreign leaders; he narrated the progress of secret negotiations such as those that led to the Camp David Accords. When his four-year term came to an end in early 1981, the diary amounted to more than five thousand pages. But this extraordinary document has never been made public--until now. By carefully selecting the most illuminating and relevant entries, Carter has provided us with an astonishingly intimate view of his presidency. Day by day, we see his forceful advocacy for nuclear containment, sustainable energy, human rights, and peace in the Middle East. We witness his interactions with such complex personalities as Ted Kennedy, Henry Kissinger, Joe Biden, Anwar Sadat, and Menachem Begin. We get the inside story of his so-called \"malaise speech,\" his bruising battle for the 1980 Democratic nomination, and the Iranian hostage crisis. Remarkably, we also get Carter's retrospective comments on these topics and more: thirty years after the fact, he has annotated the diary with his candid reflections on the people and events that shaped his presidency, and on the many lessons learned. Carter is now widely seen as one of the truly wise men of our time. Offering an unprecedented look at both the man and his tenure, this fascinating book will stand as a unique contribution to the history of the American presidency.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "A Journey: My Political Life",
        "Authors": "By Blair, Tony",
        "Description": "Tony Blair is a politician who defines our times. His emergence as Labour Party leader in 1994 marked a seismic shift in British politics. Within a few short years, he had transformed his party and rallied the country behind him, becoming prime minister in 1997 with the biggest victory in Labour's history, and bringing to an end eighteen years of Conservative government. He took Labour to a historic three terms in office as Britain's dominant political figure of the last two decades.A Journey is Tony Blair's firsthand account of his years in office and beyond. Here he describes for the first time his role in shaping our recent history, from the aftermath of Princess Diana's death to the war on terror. He reveals the leadership decisions that were necessary to reinvent his party, the relationships with colleagues including Gordon Brown, the grueling negotiations for peace in Northern Ireland, the implementation of the biggest reforms to public services in Britain since 1945, and his relationships with leaders on the world stage---Nelson Mandela, Bill Clinton, Vladimir Putin, George W. Bush. He analyzes the belief in ethical intervention that led to his decisions to go to war in Kosovo, Sierra Leone, Afghanistan, and, most controversially of all, in IraqA Journey is a book about the nature and uses of political power. In frank, unflinching, often wry detail, Tony Blair charts the ups and downs of his career to provide insight into the man as well as the politician and statesman. He explores the challenges of leadership, and the ramifications of standing up, clearly and forcefully, for what one believes in. He also looks ahead, to emerging power relationships and economies, addressing the vital issues and complexities of our global worldFew British prime ministers have shaped the nation's course as profoundly as Tony Blair, and his achievements and his legacy will be debated for years to come. Here, uniquely, we have his own journey, in his own wordsTony Blair became an MP in 1983, leader of the Labour Party in 1994, and was prime minister of the United Kingdom from May 1997 to June 2007. Since leaving office, he has served as the Quartet Representative to the Middle East, representing the U.S., the UN, Russia, and the EU in working with the Palestinians to prepare for statehood as part of the international community's effort to secure peace. In May 2008 he launched the Tony Blair Faith Foundation, which promotes respect and understanding among the major religions. His Africa Governance Initiative works with leaders and their governments on policy delivery and attracting sustainable investment in Rwanda, Sierra Leone, and Liberia. He also works with world leaders to build consensus on an international climate-policy framework.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "No Mercy (Dark-Hunter Novels)",
        "Authors": "By Kenyon, Sherrilyn",
        "Description": "Live fast, fight hard and if you have to die then take as many of your enemies with you as you can. That is the Amazon credo and it was one Samia lived and died by. Now in contemporary New Orleans, the immortal Amazon warrior is about to learn that there's a worse evil coming to slaughter mankind than she's ever faced before.Shapeshifter Dev Peltier has stood guard at the front of Sanctuary for almost two hundred years and in that time, he's seen it all. Or so he thought. Now their enemies have discovered a new source of power- one that makes a mockery of anything faced to date.The war is on and Dev and Sam are guarding ground zero. But in order to win, they will have to break the most cardinal of all rules and pray it doesn't unravel the universe as we know it.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Santa Fe Edge (Ed Eagle Novel)",
        "Authors": "By Woods, Stuart",
        "Description": "If you run into trouble in Santa Fe, Ed Eagle is the man to see.  Ed Eagle, the six-feet-six, take-no-prisoners Santa Fe attorney, has recovered from his encounters with Mexican organized crime and-more treacherously-his ex-wife, Barbara. Now a mysterious new client has come his way, one who may shed light into some dark corners of Ed's past...and put him in danger once more.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Threads West: An American Saga (Threads West, An American Saga Series)",
        "Authors": "By Rosenthal, Reid Lance",
        "Description": "Book One - the #1 bestselling Threads West-winner of eight national awards in the categories of Historical Fiction, Romance and Western. This is the namesake novel of the sweeping Threads West, An American Saga multi-era series compared by reviewers and authors to Lonesome Dove, Centennial, and Louis L'Amour. Called by some The Gone With The Wind of the West and applauded by others as rings true and poignant, as authentic and moving as Dances with Wolves. The tale bursts with the adventure, romance and promise of historical America and the West.   You will recognize the characters who live in these pages.  They are the ancestors of your friends, your neighbors, your co-workers, and your family.  They are you. They are us.  This is not only their story. It is our story.  The epic saga of Threads West, An American Saga begins in 1854 with the first of five, richly textured, complex generations of unforgettable, multicultural characters. The separate lives of these driven men and independent women from Europe and America are drawn to a common destiny that beckons seductively from the wild and remote flanks of the American West. Swept into the dangerous currents of the far-distant frontier by the mysterious rivers of fate, the power of the land and the American spirit, their journeys are turbulent quests intertwined with romance and adversity, passions and pathos, despair and triumph.   One thousand miles to the west of St. Louis lies the lawless untamed spine of the continent, the Rocky Mountains. Their energy draws this vanguard of generations to love and struggle in the beautifully vibrant but unforgiving landscape of the West. The personal conflicts inherent to these brave, passion-filled characters are exacerbated by a nation in transition, the budding enmity between North and South, broken treaties with Native Americans and the accelerating melting pot of diverse cultures that marks this magical moment in American history.   The touchstones of the past are the guideposts to the future. This is the first novel of this epic saga-the tale of America, set in the West-the stirring story of many threads of uncommon cultures, differing origins and competing ambitions that entwine into the American spirit. Lives and generations are woven on the loom of history, propelled by fate and freedom to form the tapestry that becomes the whole cloth of the nation. It is uniquely American, this meld of the mosaic.   In Book Two, Maps of Fate, the heroic but conflicted men and women of Threads West continue their dangerous journeys, pushing relentlessly westward, their paths intersecting with the trails of others, setting in motion generational liaisons that cannot be foreseen.   Momentous change will continue, igniting further greed and compassion, courage and treachery, rugged independence, torrid passions and fierce loyalties. The decades of the Maps of Fate era novels of Threads West, An American Saga book series become the crucible of the souls of generations, the building of the heart of the nation, the destiny of a people, and the relentless energy and beauty of the western landscape. This is the ongoing story of us. Set in authentic locations on three continents and in the jagged peaks of the Rocky Mountains, the life threads of the characters -- whose personalities are forged on the anvil of the land and shaped by the spirit of America -- live, love, struggle, die, fail and succeed. They have neither country nor culture in common -- but the textured, complex and conflicted lives of these independent men and women become part of the fabric of the undulating landscape of the West, and are woven into the rich and adventurous tapestry of an emerging nation and the ever evolving American spirit. The adventure and romance of America, her people and her spirit and the West. This is not only their story. It is our story. It is Threads West, An American Saga.",
        "Category": " Fiction , Romance , Western",
        "Publisher": "Rockin SR Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Play Dead",
        "Authors": "By Coben, Harlan",
        "Description": "The worlds of celebrity and sports are brilliantly dissected and turned upside down in #1 New York Times bestselling author Harlan Coben’s debut thriller.Theirs was a marriage made in tabloid heaven, but no sooner had supermodel Laura Ayars and Celtics star David Baskin said “I do” than tragedy struck. While honeymooning on Australia’s Great Barrier Reef, David went out for a swim—and never returned.Now widowed and grieving, Laura has a thousand questions and no answers. Her search for the truth will draw her into a web of lies and deception that stretches back thirty years—while on the court at Boston Garden, a rookie phenom makes his spectacular debut...",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Coming Economic Armageddon: What Bible Prophecy Warns about the New Global Economy",
        "Authors": "By Jeremiah, David",
        "Description": "Never before have we read such jarring headlines, distressing news analyses, or dire predictions concerning the world's financial future. The American housing market -- or, more sentimentally, the American dream -- began to collapse in 2006, taking with it large chunks of the global financial system. Millions of jobs worldwide have vanished forever. Did Bible prophecy predict this catastrophe? Are there biblical clues to how soon, if ever, a viable, long-term recovery can be sustained? Is the financial collapse just one of several signs that we are living in the final days of Earth's history In THE COMING ECONOMIC ARMAGEDDON, David Jeremiah says we can know the meaning behind what we see in the daily news -- and understand and prepare for living in the New Global Economy.",
        "Category": " Religion , Biblical Studies , Prophecy",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Bloody Crimes: The Chase for Jefferson Davis and the Death Pageant for Lincoln's Corpse",
        "Authors": "By Swanson, James L.",
        "Description": "\"A brilliant narrative that keeps the reader spellbound from beginning to end. James Swanson's vivid style and historical accuracy are unsurpassed, and he makes the parallel journeys of Abraham Lincoln and Jefferson Davis come magically alive. I wish I had written this book.\"---Edward Steers Jr., author of Blood on the Moon: The Assassination of Abraham Lincoln and The Lincoln Assassination EncyclopediaOn the morning of April 2, 1865, Jefferson Davis, president of the Confederacy, received a telegram from General Robert E. Lee. There is no more time---the Yankees are coming, it warned. Shortly before midnight, Davis boarded a train from Richmond and fled the capital, setting off an intense and thrilling chase in which Union cavalry hunted the Confederate president.Two weeks later, President Lincoln was assassinated, and the nation was convinced that Davis was involved in the conspiracy that led to the crime. Lincoln's murder, autopsy, and White House funeral transfixed the nation. His final journey began when soldiers placed his corpse aboard a special train that would carry him home on the 1,600-mile trip to Springfield. Along the way, more than a million Americans looked upon their martyr's face, and several million watched the funeral train roll by. It was the largest and most magnificent funeral pageant in American history.To the Union, Davis was no longer merely a traitor. He became a murderer, a wanted man with a $100,000 bounty on his head. Davis was hunted down and placed in captivity, the beginning of an intense and dramatic odyssey that would transform him into a martyr of the South's Lost Cause.The saga that began with Manhunt continues with the suspenseful and electrifying Bloody Crimes. James Swanson masterfully weaves together the stories of two fallen leaders as they made their last expeditions through the bloody landscape of a wounded nation.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Dog Donovan",
        "Authors": "By Hendry, Diana and Chamberlain, Margaret (ILT)",
        "Description": "The Donovans are afraid of so many things that the family gets a dog from the animal shelter to protect them",
        "Category": "",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Sun Stand Still: What Happens When You Dare to Ask God for the Impossible",
        "Authors": "By Furtick, Steven",
        "Description": "If you're not daring to believe God for the impossible, you may be sleeping through some of the best parts of your Christian Life. This book is not a Snuggie. The words on these pages will not go down like Ambien. I’m not writing to calm or coddle you. With God’s help, I intend to incite a riot in your mind. Trip your breakers and turn out the lights in your favorite hiding places of insecurity and fear. Then flip the switch back on so that God’s truth can illuminate the divine destiny that may have been lying dormant inside you for years. In short, I’m out to activate your audacious faith. To inspire you to ask God for the impossible. And in the process, to reconnect you with your God-sized purpose and potential.—STEVEN FURTICK, from Sun Stand Still“Steven Furtick challenges all of us—from the missionary in the third world to the family in the suburbs—to believe God for the impossible and begin living a life of faith beyond the ordinary.” —ANDY STANLEY, senior pastor, North Point Community Church“I don’t know anyone better positioned to challenge you to rise above mundane living and embrace faith-filled audacity than Steven Furtick.”—CRAIG GROESCHEL, senior pastor, LifeChurch.tv“For too long Christians have embraced a miniscule vision of faith.… Steven Furtick reminds us that the God who accomplished the impossible through the great heroes of faith still desires to do the same through us today.”—JENTEZEN FRANKLIN, senior pastor, Free Chapel“This book will show you that your hopes and expectations are truly just the beginning of what God can do.” —ED YOUNG, senior pastor, Fellowship Church",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Pocket Bible Dictionary: Nelson's Pocket Reference Series",
        "Authors": "By Thomas Nelson Publishers",
        "Description": "A handy, find-it-fast Bible reference series.  Ideal for all Bible students.  A must for every Bible owner! Easy to Understand and Illustrated throughout! Fast Access to over 1,500 entries! Exclusive Fan-Tab™ Thumb Index Reference System! Extensive A to Z Coverage!",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Pocket Bible Concordance: Nelson's Pocket Reference Series",
        "Authors": "By Thomas Nelson Publishers",
        "Description": "A handy, find-it-fast Bible reference series.  Ideal for all Bible students.  A must for every Bible owner! Find it fast in the Bible! Exclusive Fan-Tab™ Thumb Index Reference System! Over 5,000 entries! Aaron to Zophar!",
        "Category": " Religion , Biblical Reference , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Choosing to SEE: A Journey of Struggle and Hope",
        "Authors": "By Vaughn, Ellen (CON), Chapman, Mary Beth, and Chapman, Steven Curtis (FRW)",
        "Description": "I've told my kids for years that God doesn't make mistakes,\" writes Mary Beth Chapman, wife of Grammy award winning recording artist Steven Curtis Chapman. \"Would I believe it now, when my whole world as I knew it came to an end?\"Covering her courtship and marriage to Steven Curtis Chapman, struggles for emotional balance, and living with grief, Mary Beth's story is our story--wondering where God is when the worst happens. In Choosing to SEE, she shows how she wrestles with God even as she has allowed him to write her story--both during times of happiness and those of tragedy. Readers will hear firsthand about the loss of her daughter, the struggle to heal, and the unexpected path God has placed her on. Even as difficult as life can be, Mary Beth Chapman Chooses to SEE. Includes a 16-page full color photo insert.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Revell",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Dark Peril (Carpathian)",
        "Authors": "By Feehan, Christine",
        "Description": "A new Carpathian novel from the #1 New York Times bestselling author.Dominic of the Dragonseeker Carpathians is on a desperate mission, in the very heart of enemy territory. Solange Sangria is one of the last of the jaguar people. She has long been fighting to save women who are able to shift from the hands of the man who slaughtered her family and everyone she loved-her own father. They are two warriors who have lived their lives alone. Now, a the end of their time, they find each other, a complication neither saw coming.Watch a Video",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "The Cobra",
        "Authors": "By Forsyth, Frederick",
        "Description": "An extraordinary cutting-edge thriller from the New York Times-bestselling grandmaster of international suspense.  Meticulous research, crisp narratives, plots as current as today's headlines-Frederick Forsyth has helped define the international thriller as we know it. And now he does it again. What if you had carte blanche to fight evil? Nothing held back, nothing off the table. What would you do? For decades, the world has been fighting the drug cartels, and losing, their billions of dollars making them the most powerful and destructive organizations on earth. Until one man is asked to take charge. Paul Devereaux used to run Special Operations for the CIA before they retired him for being too ruthless. Now he can have anything he requires, do anything he thinks necessary. No boundaries, no rules, no questions asked. The war is on-though who the ultimate winner will be, no one can tell...",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Aftershock: The Next Economy and America's Future",
        "Authors": "By Reich, Robert B.",
        "Description": "A brilliant new reading of the economic crisis—and a plan for dealing with the challenge of its aftermath—by one of our most trenchant and informed experts.When the nation’s economy foundered in 2008, blame was directed almost universally at Wall Street. But Robert B. Reich suggests a different reason for the meltdown, and for a perilous road ahead. He argues that the real problem is structural: it lies in the increasing concentration of income and wealth at the top, and in a middle class that has had to go deeply into debt to maintain a decent standard of living.Persuasively and straightforwardly, Reich reveals how precarious our situation still is. The last time in American history when wealth was so highly concentrated at the top—indeed, when the top 1 percent of the population was paid 23 percent of the nation’s income—was in 1928, just before the Great Depression. Such a disparity leads to ever greater booms followed by ever deeper busts. Reich’s thoughtful and detailed account of where we are headed over the next decades reveals the essential truth about our economy that is driving our politics and shaping our future. With keen insight, he shows us how the middle class lacks enough purchasing power to buy what the economy can produce and has adopted coping mechanisms that have a negative impact on their quality of life; how the rich use their increasing wealth to speculate; and how an angrier politics emerges as more Americans conclude that the game is rigged for the benefit of a few. Unless this trend is reversed, the Great Recession will only be repeated. Reich’s assessment of what must be done to reverse course and ensure that prosperity is widely shared represents the path to a necessary and long-overdue transformation. Aftershock is a practical, humane, and much-needed blueprint for both restoring America’s economy and rebuilding our society.",
        "Category": " Social Science , Future Studies",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Finkler Question",
        "Authors": "By Jacobson, Howard",
        "Description": "Julian Treslove, a professionally unspectacular and disappointed BBC worker, and Sam Finkler, a popular Jewish philosopher, writer and television personality, are old school friends. Despite a prickly relationship and very different lives, they've never quite lost touch with each other - or with their former teacher, Libor Sevick, a Czechoslovakian always more concerned with the wider world than with exam results.Now, both Libor and Finkler are recently widowed, and with Treslove, his chequered and unsuccessful record with women rendering him an honorary third widower, they dine at Libor's grand, central London apartment.It's a sweetly painful evening of reminiscence in which all three remove themselves to a time before they had loved and lost; a time before they had fathered children, before the devastation of separations, before they had prized anything greatly enough to fear the loss of it. Better, perhaps, to go through life without knowing happiness at all because that way you had less to mourn? Treslove finds he has tears enough for the unbearable sadness of both his friends' losses.And it's that very evening, at exactly 11:30pm, as Treslove hesitates a moment outside the window of the oldest violin dealer in the country as he walks home, that he is attacked. After this, his whole sense of who and what he is will slowly and ineluctably change.The Finkler Question is a scorching story of exclusion and belonging, justice and love, aging, wisdom and humanity. Funny, furious, unflinching, this extraordinary novel shows one of our finest writers at his brilliant best.",
        "Category": " Fiction , Literary",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Forever Young: The Science of Nutrigenomics for Glowing, Wrinkle-Free Skin and Radiant Health at Every Age",
        "Authors": "By Perricone, Nicholas",
        "Description": "Dr. Perricone’s FOREVER YOUNG makes an extraordinary promise: by following a program designed to decrease wrinkles and dramatically improve the appearance of the skin, the reader is also guaranteed more energy, less fat and an improved mood.  The core of Dr. Perricone’s appeal is his scientific grounding and authority.  In a field notorious for the triumph of style over substance, Dr. Perricone is at the cutting edge of new science which is scientifically proven to work.    At the core of the new book is an exciting new science on skin:  Nutrigenomics and gene expression. With his innovative vision, Dr. Perricone has applied the new science to ease wrinkles, make the skin supple, smooth and glowing.  His prescriptive program will shave years off the reader's appearance and will give the reader more energy.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Debt-Free U: How I Paid for an Outstanding College Education Without Loans, Scholarships, or Mooching off My Parents",
        "Authors": "By Bissonnette, Zac and Tobias, Andrew (FRW)",
        "Description": "This book can save you more than $100,000. These days, most people assume you need to pay a boatload of money for a  quality college education. As a result, students and their parents are  willing to go into years of debt and potentially sabotage their entire  financial futures just to get a fancy name on their diploma. But Zac Bissonnette is walking proof that this assumption is not only  false, but dangerous-a class con game designed to rip you off and doom  your student to a post-graduation life of near poverty . From his unique  double perspective-he's a personal finance expert (at Daily Finance)  AND a current senior at the University of Massachusetts-Zac figured out  how to get an outstanding education at a public college, without  bankrupting his parents or taking on massive loans. Armed with  his personal knowledge, the latest data, and smart analysis, Zac takes  on the sacred cows of the higher education establishment. He reveals why  a lot of the conventional wisdom about choosing and financing college  is not only wrong but hazardous to you and your child's financial  future. You'll discover, for instance, that: * Student loans  are NOT a necessary evil. Ordinary middle class families can- and must-find  ways to avoid them, even without scholarships. * College  \"rankings\" are useless-designed to sell magazines and generate hype. If  you trust one of the major guides when picking a college, you face a  potential financial disaster. * The elite graduate programs  accept lots of people with non-elite bachelors degrees. So do America's  most selective employers. The name on a diploma ultimately won't help  your child have a more successful career or earn more money. Zac can prove every one of those bold assertions - and more. No matter  what your current financial situation, he has a simple message for  parents: \"RELAX! Your kid will be able to get a champagne education on a  beer budget!\"",
        "Category": " Study Aids , Financial Aid",
        "Publisher": "Portfolio",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Taken by Midnight (The Midnight Breed, Book 8)",
        "Authors": "By Adrian, Lara",
        "Description": "AT THE CROSSROADS OF DEATH AND DESIRE, A WOMAN TASTES A PLEASURE NO MORTAL IS MEANT TO SURVIVE. In the frozen Alaskan wilderness, former state trooper Jenna Darrow survives an unspeakable breach of body and soul. But with her narrow escape comes an even greater challenge. For strange changes are taking place within her, as she struggles to understand—and control—a new hunger. To do so, she will seek shelter in the Boston compound of the Order, an ancient race of vampire warriors whose very existence is shrouded in mystery. Perhaps the most mysterious of them all is Brock, a brooding, dark-eyed alpha male whose hands hold the power to comfort, heal . . . and arouse. As she recovers under Brock’s care, Jenna finds herself drawn to the Order’s mission: to stop a ruthless enemy and its army of assassins from subjecting Earth to a reign of terror. Yet in spite of their resolve, a purely physical relationship without strings soon binds Brock and Jenna together with a desire fiercer than life and stronger than death itself—until a secret from Brock’s past and Jenna’s own mortality challenges their forbidden love to the ultimate trial by fire.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "If You Really Trust Me, Why Can't I Stay Out Later? (Devotionals for Teens)",
        "Authors": "By Peterson, Lorraine",
        "Description": "A collection of devotional readings based on the wisdom of Solomon as expressed in the Book of Proverbs.",
        "Category": " Religion , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Third World America: How Our Politicians Are Abandoning the Middle Class and Betraying the American Dream",
        "Authors": "By Huffington, Arianna",
        "Description": "\"A voice of conscience in a time when we need conscience more than ever... Arianna Huffington is right: it's not too late for citizens to wake up politicians of to take matters into their own hands. Time is short: read this book now.\"ùElizabeth Warren, Harvard Law School professor and author of The Two-Income Trap\"Luckily for Congress, the White House, and corporate America, no one reads anymore, because if people discover this book, America will become a very different place.\"ùBill Maher, Host of Real Time with Bill Maher\"Restoring the values that have made America strong-a thriving middle class and a sense of basic fair play-are of crucial importance to all Americans, left and right. Third World America is a powerful plea for our country to wake up so that we can change course-before it's too late.\"ùJoe Scarborough, host of Morning Joe\"Politicians talk endlessly about 'protecting the middle class,' yet, over the last thirty years, the middle class has taken a relentless pounding. In precise, graphic, and shocking terms that will bring the crisis home to everyone, Arianna Huffington explains why: special interests have become too powerful, money dominates our politics... The national spirit that builds America lies in tatters. Turning this situation around will require strong new leadership. How long will that take? That depends on you-read this book and push hard for change.\"ùSimon Johnson, Professor of economics at MIT Sloan School of Management and coauthor of 13 Bankers\"Arianna Huffington is one of the very few people in America committed to say things the way they are and to expose the monstrous elephants in the room ignored by the dominant discourse. Even rarer, she does so in a lively, engaging, and, mostly, charming way.\"ùNassim Nicholas TALEB, author of The Black Swan\"Blending outrage and optimism- indignation at how america's crony capitalists have wrecked the nation's great middle class, and unremitting hope that our people will rise and put things right-she explains what's happened and what must be done. Here, clearly, is a book for our times.\"ùRobert B. Reich, professor of public policy, University of California, Berkeley, and former U.S. secretary of labor\"An alarming account of the plight of the American middle class.\"ùJoseph Stiglitz, professor of economics at Columbia University and Nobel Prize laureateIt's not an exaggeration to say that middle-class Americans are an endangered species and that the American Dream of a secure, comfortable standard of living has become as outdated as an Edsel with an eight-track player. The United States of America is in danger of becoming a Third World nation.The evidence is all around us: Our industrial base is vanishing, taking with it the kind of jobs that have formed the backbone of our economy for more than a century; our education system is in shambles, making it harder for tomorrow's workforce to acquire the information and training it needs to land good twenty-first-century jobs; our infrastructureùroads, bridges, water, and electrical systemsùis crumbling; our economic system has been reduced to recurring episodes of Corporations Gone Wild; our political system is broken, in thrall to a small financial elite using the power of the checkbook to control both parties.And America's middle class, the driver of so much of our economic success and political stability, is rapidly disappearing, forcing us to confront the fear that we are slipping as a nationùthat our children and grandchildren will enjoy fewer opportunities and face a lower standard of living than we did.It's the dark flipside of the American Dreamùan American Nightmare of our own making.Arianna Huffington, editor in chief of the must-read Huffington Post, has her finger on the pulse of America and unflinchingly tracks the gradual demise of the nation as an industrial, political, and economic leader. In the vein of her fiery bestseller Pigs at the Trough, Third World America points fingers, names names, and details who's killing the American Dream.Calling on the can-do attitude that is part of America's DNA, Huffington shows precisely what we need to do to stop our free fall and keep our country from turning into a Third World nation.Third World America is required reading for anyone who is disturbed by our country's steady descent from twentieth-century superpower to backwater banana republic.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Boy Who Came Back from Heaven: A Remarkable Account of Miracles, Angels, and Life beyond This World",
        "Authors": "By Malarkey, Kevin and Malarkey, Alex",
        "Description": "In 2004, Kevin Malarkey and his six-year-old son, Alex, suffered a horrific car accident. The impact from the crash paralyzed Alex--and medically speaking, he could not survive. \"I think Alex has gone to be with Jesus,\" a friend told the stricken dad. When Alex awoke from a comaover two monthslater, not only had the most severe of his spinal injuries been healed without medical intervention, but he had an incredible story to share.  Of events at the accident scene and in the hospital while he was unconscious. Of the angels that took him through the gates of heaven itself. Of the unearthly music that sounded just terrible to a six-year-old. And, most amazing of all...of meeting and talking to Jesus.The Boy Who Came Back from Heavenis the true story of an ordinary boy's most extraordinary journey. As you see heaven and earth through Alex's eyes, you’ll come away with new insightson miracles, life beyond this world, and the power of a father's love.",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Tyndale House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "The Orange Revolution: How One Great Team Can Transform an Entire Organization",
        "Authors": "By Gostick, Adrian and Elton, Chester",
        "Description": "From New York Times bestselling authors and renowned leadership consultants Adrian Gostick and Chester Elton comes a groundbreaking guide to building high-performance teams.What is the true driver of a thriving organization’s exceptional success? Is it a genius leader? An iron-clad business plan? Gostick and Elton shatter these preconceptions of corporate achievement. Their research shows that breakthrough success is guided by a particular breed of high-performing team that generates its own momentum—an engaged group of colleagues in the trenches, working passionately together to pursue a shared vision. Their research also shows that only 20 percent of teams are working anywhere near this optimal capacity. How can your team become one of them?  Based on a groundbreaking 350,000-person study by the Best Companies Group, as well as extraordinary research into exceptional teams at leading companies, including Zappos.com, Pepsi Beverages Company, and Madison Square Garden, the authors have determined a key set of characteristics displayed by members of breakthrough teams, and have identified a set of rules great teams live by, which generate a culture of positive teamwork and lead to extraordinary results.  Using a wealth of specific stories from the breakthrough teams they studied, they reveal in detail how these teams operate and how managers can transform their own teams into such high performers by fostering:  -Stronger clarity of goals -Greater trust among team members -More open and honest dialogue -Stronger accountability for all team members -Purpose-based recognition of team members’ contributions  The remarkable stories they tell about these teams in action provide a simple and powerful step-by-step guide to taking your team to the breakthrough level, igniting the passion and vision to bring about an Orange Revolution.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Growing Up Laughing: My Story and the Story of Funny",
        "Authors": "By Thomas, Marlo",
        "Description": "Growing Up Laughing: My Story and the Story of Funny is a book that only Marlo Thomas could write—a smart and gracious, witty and confident autobiographical journey.For as long as Marlo Thomas can remember, she’s lived with laughter. Born to comedy royalty—TV and nightclub star Danny Thomas—she grew up among legendary funny men, carved much of her career in comedy and, to this day, surrounds herself with people who love and live to make others laugh. In this long-awaited memoir, Thomas takes us on a funny and heartwarming adventure, from her Beverly Hills childhood, to her groundbreaking creation of That Girl and Free to Be . . . You and Me, to her rise as one of America’s most beloved actress-comediennes, to her marriage to talk-show king Phil Donahue.Her youth was star-studded—Milton Berle performed magic tricks (badly) at her backyard birthday parties. George Burns, Bob Hope, Sid Caesar, Bob Newhart and other great comics passed countless hours gathered around her family’s dinner table. And behind it all was the rich laughter nurtured by a close and loving family.Growing Up Laughing is not just the story of an iconic entertainer, but also the story of comedy. In a voice that is curious, generous and often gleeful, Thomas not only opens the doors on the funny in her own life, but also explores the comic roots of today’s most celebrated comedians, in personal interviews with: Alan Alda, Joy Behar, Stephen Colbert, Billy Crystal, Tina Fey, Whoopi Goldberg, Kathy Griffin, Jay Leno, George Lopez, Elaine May, Conan O’Brien, Don Rickles, Joan Rivers, Chris Rock, Jerry Seinfeld, Jon Stewart, Ben and Jerry Stiller, Lily Tomlin, Robin Williams and Steven Wright.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Last Boy: Mickey Mantle and the End of America's Childhood",
        "Authors": "By Leavy, Jane",
        "Description": "\"In Leavy's hands, the life of Mantle no longer defies logic: it seems invitable, She's hit a long home run.\"---Publishers Weekly (starred review) \"A masterpiece of sports biography.\"---Booklist (starred review)Mickey Mantle's sweater hangs on the door to my office. I put it there the day I decided to write this book... It has followed me from closet to closet and house to house since he gave it to me twenty-seven years ago. I packed it away in an old garment bag right after I said goodbye to him. I thought I was done with the Mick.---from the prefaceJane Leavy, the acclaimed author of the New York Times bestseller Sandy Koufax: A Lefty's Legacy, returns with a biography of an American original---number 7, Mickey Mantle, Drawing on more than five hundred interviews with friends and family, teammates, and opponents, she delivers the definitive account of Mantle's life, mining the mythology of The Mick for the true story of a luminous and illustrious talent with an achingly damaged soul.Meticulously reported and elegantly written, The Last Boy is a baseball tapestry that weaves together episodes from the author's weekend with The Mick in Atlantic City, where she interviewed her hero in 1983, after he was banned from baseball, with reminiscences from friends and family of the boy from Commerce, Oklahoma, who would lead the Yankees to seven world championships, be voted the American League's Most Valuable Player three times, win the Triple Crown in 1956, and duel teammate Roger Maris for Babe Ruth's home run crown in the summer of 1961---the same boy who would never grow up.As she did so memorably in her biography of Sandy Koufax, Jane Leavy transcends the hyperbole of hero worship to reveal the man behind the coast-to-coast smile, who grappled with a wrenching childhood, crippling injuries, and a genetic predisposition to alcoholism. In The Last Boy she chronicles her search to find out more about the person he was and, given what she discovers, to explain his mystifying hold on a generation of baseball fans, who were seduced by that lopsided, gap-toothed grin. It is an uncommon biography, with literary overtones: not only a portrait of an icon, but an investigation of memory itself. How long was the Tape Measure Home Run? Did Mantle swing the same way right-handed and left-handed? What really happened to the red-haired, freckle-faced boy known back home as Mickey Charles?\"I believe in memory, not memorabilia,\" Leavy writes in her preface. But in The Last Boy, she discovers that what we remember of our heroes---and even what they remember of themselves---is only where the story begins.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "16.48",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Waiting for \"\"SUPERMAN\"\": How We Can Save America's Failing Public Schools (Participant Guide Media)",
        "Authors": "By Weber, Karl (EDT)",
        "Description": "Each book includes a 15 gift card from DonorsChoose.org to give to a classroom in need. The American public school system is in crisis, failing millions of students, producing as many drop-outs as graduates, and threatening our economic future. By 2020, the United States will have 123 million high-skill jobs to fill'and fewer than 50 million Americans qualified to fill them. Educators, parents, political leaders, business people, and concerned citizens are determined to save our educational system. Waiting for \"Superman\" offers powerful insights from some of those at the leading edge of educational innovation, including Bill and Melinda Gates, Michelle Rhee, Geoffrey Canada, and more. Waiting for \"Superman\" is an inspiring call for reform and includes special chapters that provide resources, ideas, and hands-on suggestions for improving the schools in your own community as well as throughout the nation.  For parents, teachers, and concerned citizens alike, Waiting for \"Superman\" is an essential guide to the issues, challenges, and opportunities facing America's schools.",
        "Category": " Education , Evaluation & Assessment",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Cross Roads (Sisterhood)",
        "Authors": "By Michaels, Fern",
        "Description": "The Sisterhood Will Not Be BrokenIt's been a year and a half since the women of the Sisterhood received their presidential pardons, but the freedom they craved has come at a high price. The impossibly lucrative positions handed out to them by the mysterious Global Securities company have turned out to be golden handcuffs--scattering them around the world, cutting off communication, and leaving them in miserable isolation. But a happy homecoming at the old Virginia farmhouse is marred by the hijacking of Nikki and Kathryn's private jet. It seems their few fellow passengers are not ordinary travelers--they're an elite group of Interpol agents who urgently need the Sisterhood's help. Now the ladies face a stark choice: resume their vigilante status for one of their most hazardous assignments yet, or try to outwit a group of powerful adversaries willing to use truly desperate measures. This time, everything is in the balance--their lives, their friendship, and the freedom they fought so hard to gain.  .  .Praise for Fern Michaels and her Sisterhood novels.  .  .\"Revenge is a dish best served with cloth napkins and floral centerpieces.  .  .fast-paced.  .  .puts poetic justice first.\"--Publishers Weekly on Payback\"Delectable.  .  .deliver[s] revenge that's creatively swift and sweet, Michaels-style.\"--Publishers Weekly on Hokus Pokus",
        "Category": " Fiction , Women",
        "Publisher": "Zebra",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Taste of Home Christmas 2010",
        "Authors": "By Catherine Cassidy",
        "Description": "",
        "Category": "",
        "Publisher": "Reiman",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "To the End of the Land",
        "Authors": "By Grossman, David and Cohen, Jessica (TRN)",
        "Description": "From one of Israel’s most acclaimed writers comes a novel of extraordinary power about family life—the greatest human drama—and the cost of war. Ora, a  middle-aged Israeli mother, is on the verge of celebrating her son Ofer’s release from army service when he returns to the front for a major offensive. In a fit of preemptive grief and magical thinking, she sets out for a hike in the Galilee, leaving no forwarding information for the “notifiers” who might darken her door with the worst possible news. Recently estranged from her husband, Ilan, she drags along an unlikely companion: their former best friend and her former lover Avram, once a brilliant artistic spirit. Avram served in the army alongside Ilan when they were young, but their lives were forever changed one weekend when the two jokingly had Ora draw lots to see which of them would get the few days’ leave being offered by their commander—a chance act that sent Avram into Egpyt and the Yom Kippur War, where he was brutally tortured as  POW. In the aftermath, a virtual hermit, he refused to keep in touch with the family and has never met the boy. Now, as Ora and Avram sleep out in the hills, ford rivers, and cross valleys, avoiding all news from the front, she gives him the gift of Ofer, word by word; she supplies the whole story of her motherhood, a retelling that keeps Ofer very much alive for Ora and for the reader, and opens Avram to human bonds undreamed of in his broken world. Their walk has a “war and peace” rhythm, as their conversation places the most hideous trials of war next to the joys and anguish of raising children. Never have we seen so clearly the reality and surreality of daily life in Israel, the currents of ambivalence about war within one household, and the burdens that fall on each generation anew. Grossman’s rich imagining of a family in love and crisis makes for one of the great antiwar novels of our time.",
        "Category": " Fiction , Literary",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Painted Ladies (Spenser Mysteries, No. 39)",
        "Authors": "By Parker, Robert B.",
        "Description": "The brilliant new Spenser novel from the beloved New York Times-bestselling author Robert B. Parker.  Called upon by The Hammond Museum and renowned art scholar Dr. Ashton Prince, Spenser accepts his latest case: to provide protection during a ransom exchange-money for a stolen painting. The case becomes personal when Spenser fails to protect his client and the valuable painting remains stolen. Convinced that Ashton Prince played a bigger role than just ransom delivery boy, Spenser enters into a daring game of cat-and-mouse with the thieves. But this is a game he might not come out of alive... Completed the year before he passed away, Painted Ladies is Spenser and Robert B. Parker at their electrifying best.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "The Fort: A Novel of the Revolutionary War",
        "Authors": "By Cornwell, Bernard",
        "Description": "“The most prolific and successful historical novelist in the world today.” —Wall Street Journal“Readers who haven’t discovered Bernard Cornwell don’t know what they are missing.” —New York Times bestselling author Vince FlynnFrom the New York Times bestselling author of Agincourt, the Saxon Tales, and the beloved Richard Sharpe series, Bernard Cornwell’s The Fort plunges prow-first into the largest naval clash of the Revolutionary War. Fans of the Nathaniel Starbuck Chronicles and The Burning Land will thrill to Cornwell’s triumphant return to American historical fiction in this gripping story of courage, strength and patriotism.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Our Kind of Traitor: A Novel",
        "Authors": "By Le Carre, John",
        "Description": "Watch a video                  The unrivaled master of spy fiction returns with a taut and suspenseful tale of dirty money and dirtier politics.    For nearly half a century, John le Carré's limitless imagination has enthralled millions of readers   and moviegoers around the globe. From the cold war to the bitter fruits of colonialism to unrest in the Middle East,   he has reinvented the spy novel again and again. Now, le Carré makes his Viking debut with a stunning tour-de-  force that only a craftsman of his caliber could pen. As menacing and flawlessly paced as The Little Drummer   Girl and as morally complex as The Constant Gardener, Our Kind of Traitor is signature le Carré.  Perry and Gail are idealistic and very much in love when they splurge on a tennis vacation at a posh   beach resort in Antigua. But the charm begins to pall when a big-time Russian money launderer enlists their help to   defect. In exchange for amnesty, Dima is ready to rat out his vory (Russian criminal brotherhood)   compatriots and expose corruption throughout the so-called legitimate financial and political worlds. Soon, the   guileless couple find themselves pawns in a deadly endgame whose outcome will be determined by the victor of the   British Secret Service's ruthless internecine battles.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Sabotaged (The Missing, Book 3)",
        "Authors": "By Haddix, Margaret Peterson",
        "Description": "After helping Chip and Alex survive 15th century London, Jonah and Katherine are summoned to help another missing child, Andrea, face her fate. Andrea is really Virginia Dare, from the Lost Colony of Roanoke. Jonah and Katherine are confident in their ability to help Andrea fix history, but when their journey goes dangerously awry, they realize that they may be in over their head. They've landed in the wrong time period. Andrea doesn't seem that interested in leaving the past. And even worse, it appears that someone has deliberately sabotaged their mission...",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "College Essays That Made a Difference, 2nd Edition (College Admissions Guides)",
        "Authors": "By Magrey, Erica (EDT)",
        "Description": "What's the scariest part of the college application? For most, it's that big white space where an essay is supposed to go, and this book puts you in the admissions officer's seat as you set out to write those college application essays.College Essays That Made a Difference, 2nd Edition includes 123 real-life essays written by applicants to Harvard, Princeton, Stanford, Yale, MIT, and more, as well as complete application profiles of all the students, including test scores, GPAs, demographic information, and where they got in and where they didn't. Inside you'll find interviews with admissions pros at Amherst College, Bucknell University, Colgate University, Cooper Union, Deep Springs College, Franklin W. Olin College of Engineering, Johns Hopkins University, Macalester College, Northwestern University, University of North Carolina—Chapel Hill, University of Virginia, Wake Forest University, and Yale University.You'll also find real essays written for applications to the following colleges: Amherst College, Barnard College, Bates College, Boston College, Bowdoin College, Brown University, California Institute of Technology, Carleton College, Claremont McKenna College, Colby College, Columbia University, Cornell University, Dartmouth College, Davidson College, Duke University, Georgetown University, Harvard College, Haverford College, Johns Hopkins University, Macalester College, Massachusetts Institute of Technology, Middlebury College, New College of Florida, Northwestern University, Pomona College, Princeton University, Rice University, Stanford University, Swarthmore College, Tufts University, United States Air Force Academy, United States Coast Guard Academy, United States Naval Academy, University of Chicago, University of Notre Dame, University of Pennsylvania, Washington and Lee University, Washington University in St. Louis, Wellesley College, Wesleyan University, Williams College, and Yale University.",
        "Category": " Study Aids , College Entrance",
        "Publisher": "Princeton Review",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The High King of Montival: A Novel of the Change (Change Series)",
        "Authors": "By Stirling, S. M.",
        "Description": "The New York Times bestselling author continues his post- apocalyptic series chronicling a modern world without technology.With The Sword of the Lady, Rudi Mackenzie's destiny was determined. Now he returns to Montival in the Pacific Northwest, where he will face the legions of the Prophet. To achieve victory, Rudi must assemble a coalition of those who had been his enemies a few months before and forge them into an army that will rescue his homeland.Only then will Rudi be able to come to terms with how the Sword has changed him, as well as the world, and assume his place as Artos, High King of Montival...",
        "Category": " Fiction , Alternative History",
        "Publisher": "Roc",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Bird's Best Friend (Step into Reading) (UP Movie Tie In)",
        "Authors": "By Jordan, Apple, Tilley, Scott (ILT), Naggi, Elena (ILT), Egan, Caroline (ILT), and Mosqueda, Olga (ILT)",
        "Description": "The sky’s no longer the limit with Disney•Pixar’s next hit, Up!Who is a bird's best friend? Why, a Junior Wilderness Explorer, of course! When the precocious Russell meets a huge flightless jungle bird named Kevin, they become the best—and most unlikely—of friends. Share their heartwarming story in this Step 2 Reader based on the latest Disney•Pixar release, Up.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Three Stations: An Arkady Renko Novel (7) (The Arkady Renko Novels)",
        "Authors": "By Smith, Martin Cruz",
        "Description": "\"[Smith] takes what in essence is a police procedural and elevates it to the level of absorbing fiction.\"---Nicholas A. Basbanes, Los Angeles Times\"Martin Cruz Smith Knows his Russia. Every page reeks of Moscow: dirty snow, the stink of cigarette and vodka fumes, the cynicism and tasteless opulence of the mafia, the all-pervasive corruption.\"---The Economist\"The sustained success of Smith's Renko books is based on much more than Renko. This author's gift for tart, succinct description creates a poisonous political backdrop, one that makes his characters' survival skills as important as any of their other attributes. [This is] one top-flight series, still sharply honed, none the worse for wear.\"---Janet Maslin, The New York Times\"There are few thriller practitioners indeed who can weld a story to a graceful chassis of literature and send it barreling away at top speed. Martin Cruz Smith is one of them.\"---Andrew Z. Galarneau, The Buffalo News\"As always, Smith elevates a police procedural story to a taste of Russia, a glass of vodka poured quivering to the brim.\"---Jennifer Kay, Associated PressA passenger train hurtling through the night. An unwed teenage mother headed to Moscow to seek a new life. A cruel-hearted soldier looking furtively, forcibly, for sex. An infant disappearing without a trace.So begins Martin Cruz Smith`s masterful Three Stations, a suspenseful, intricately constructed novel featuring Investigator Arkady Renko. For the last three decades, beginning with the trailblazing Gorky Park, Renko (and Smith) have captivated readers with detective tales set in Russia. Renko is the ironic, brilliantly observant cop who finds solutions to heinous crimes when other lawmen refuse to even acknowledge that crimes have occurred. He uses his biting humor and intuitive leaps to fight not only wrongdoers but the corrupt state apparatus as wellIn Three Stations, Renko`s skills are put to their most severe test. Though he has been technically suspended from the prosecutor's office for once again turning up unpleasant truths, he strives to solve a last case: the death of an elegant young woman whose body is found in a construction trailer on the perimeter of Moscow's main rail hub. It looks like a simple drug overdose to everyone---except to Renko, whose examination of the crime scene turns up some inexplicable clues, most notably an invitation to Russia's premier charity ball, the billionaires' Nijinksy Fair. Thus a sordid death becomes interwoven with the lifestyles of Moscow's rich and famous, many of whom are clinging to their cash in the face of Putin's crackdown on the very oligarchs who placed him in powerRenko uncovers a web of death, money, madness and a kidnapping that threatens the woman he is coming to love and the lives of children he is desperate to protect. In Three Stations, Smith produces a complex and haunting vision of an emergent Russia's secret underclass of street urchins, greedy thugs and a bureaucracy still paralyzed by power and fear.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "12.48",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "I'll Never Lie to You",
        "Authors": "By Carter, Jimmy",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1976"
        }
    },
    {
        "Title": "Child of the Dark: The Diary of Carolina Maria de Jesus",
        "Authors": "By De Jesus, Carolina Maria",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "8.17",
        "Publish Date": {
            "Month": "September",
            "Year": "1963"
        }
    },
    {
        "Title": "The Causes of the Civil War",
        "Authors": "By Kenneth M Stampp",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "The everybody club (Collections for young scholars)",
        "Authors": "By O'Brien, Anne",
        "Description": "",
        "Category": "",
        "Publisher": "Open Court Pub Co",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Toy to Toy (Disney/Pixar Toy Story 3) (Step into Reading)",
        "Authors": "By Tilley, Scott (ILT), Brown, Adrienne (ILT), Egan, Caroline (ILT), and Redbank, Tennant",
        "Description": "The creators of the Toy Story films reopen the toy box and bring moviegoers back to the delightful world of our favorite gang of toy characters in Toy Story 3. Woody, Buzz Lightyear, and the rest of Andy’s toys are as fun and adventurous as always, but none of them can deny that things in Andy’s room have changed. Andy is seventeen now and just three days away from heading off to college. Find out what happens to the beloved toys when they’re compelled to leave Andy’s room behind and embark on an all-new comedic adventure in Toy Story 3. This step 1 leveled reader features all the beloved characters from the new Disney/Pixar film.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Public Records Online",
        "Authors": "By Sankey, Michael L. (EDT), Flowers, James R., Weber, Peter J., Sankey, Michael L., Flowers, James R. (EDT), and Weber, Peter J. (EDT)",
        "Description": "A directory of sources for public records, including criminal records, asset/lien records, and motor vehicle records.",
        "Category": " Political Science , Reference",
        "Publisher": "Facts On Demand Press",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Cook This, Not That! Easy & Awesome 350-Calorie Meals",
        "Authors": "By Zinczenko, David and Goudeket, Maurice",
        "Description": "Tired of always being too hungry (and tired!) to make smart food choices? Ever wonder why the less food you try to eat, the more fat you seem to gain? Ready to start enjoying all your favorite foods and never see an ounce of weight gain? Cook This, Not That! 350-Calorie Meals - by David Zinczenko with Matt Goulding - is the ultimate cookbook for people who love to eat-even if they don't love to cook. The authors of the best-selling diet and weight loss series Eat This, Not That! teach you how easy it is to turn the expensive and unhealthy foods in America's restaurants into fat-blasting superfoods that cost just pennies-and take just minutes to make! Can you believe... - At Olive Garden, an order of Chicken Parmigiana will cost you half a day's calories-and a day and a half's worth of sodium! Cook our Chicken Parm recipe at home and save 730 calories and $9.94! - At T.G.I.Friday's, a Santa Fe Chopped Salad carries a whopping 1,800 calories-the equivalent of three Pepperoni Personal Pan Pizzas from Pizza Hut! (You call that a salad???) Try the Cook This, Not That! home version and save 1,460 calories! - Hungry for a panini? At Panera Bread, the Italian Combo on Ciabatta comes loaded with more than 1,000 calories and a side of 45 grams of fat! (In less time than it takes to order their version, you can whip up ours and save 690 calories) With this illustrated guide to hundreds of delicious, simple, lightning-quick recipes-along with the nutrition secrets that lead to fast and permanent weight loss-you'll make the smartest choices for you and your family every time. Additional features in Cook This, Not That: Easy & Awesome 350 -Calorie Meals include: - A step-by-step illustrated guide to every cooking technique you'll ever need to know - The 50 Best Foods in the Supermarket - The Milk Shake Matrix - The Rules of the Grill - 12 Ways to Better a Burger - The World's Best Condiments - And more!",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Time Windows",
        "Authors": "By Reiss, Kathryn",
        "Description": "When Miranda moves with her family to a new house in a small Massachusetts town, she discovers a mysterious antique--a dollhouse. Through the windows, she is shocked to find what seem to be living people in the tiny rooms, and gradually she realizes that scenes from the lives of the big house’s past inhabitants are being replayed there.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Pirate Latitudes",
        "Authors": "By Crichton, Michael",
        "Description": "“Crichton’s ultimate adventure.”—San Francisco Chronicle “Pirates Latitudes has the loot: Gore, sex, action….A lusty, rollicking 17th century adventure.”—USA Today “Riveting….Great entertainment….The pages and minutes fly by.”—Cleveland Plain Dealer #1 New York Times bestselling author, the incomparable Michael Crichton (“One of the great storytellers of our age” —Newsday) takes to the high Caribbean seas for an irresistible adventure of swashbuckling pirates, lost treasure, sword fights, duplicity, and hair-breadth escapes in the New World.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Eat This, Not That! 2011: Thousands of easy food swaps that can save you 10, 20, 30 pounds--or more!",
        "Authors": "By Zinczenko, David and Goulding, Matt",
        "Description": "That brand-new physique you've been waiting for, the leaner, fitter, healthier body you thought you'd never had. Eat This, Not That! 2011—the latest, most up-to-date book in the best-selling weight loss franchise—is ready to start stripping extra pounds from your body today. And once you lose that weight, you're going to keep it off. Forever.That's because Eat This, Not That! is a tool. It's designed to make smart food choices easier, no matter where you're making them. Consider just a handful of real stories from real people who've shed 25, 50, 75 pounds—or more!—and you'll understand why Eat This, Not That! is \"The no-diet weight-loss solution\":• Michael Colombo of Staten Island, New York, shed 91 pounds in just over 8 months and conquered life-threatening sleep apnea, after picking up a copy of Eat This, Not That!. \"My confidence has sky-rocketed!\" he says.• Erika Bowen of Minneapolis, Minnesota, dropped 84 pounds—without dieting. \"I feel like I've always wanted to feel,\" Bowen reports. Once she discovered the truth about her food, she learned she could lose weight and never feel hungry.• Dana Bickelman of Waltham, Massachusetts, lost 70 pounds after discovering the shocking truth about the foods she was eating. Her secret: She learned to indulge—even at her favorite restaurants—but to do it more smartly. Eat This, Not That! teaches you how to read nutrition labels and decipher misleading menu descriptions. It pairs classic food swaps, and helps you cut hundreds—or even thousands—of calories from your daily diet, without feeling like you've deprived yourself at all. Consider:*One of America's chain restaurants is serving a pasta dish with more than 2,700 calories? (That's nearly a pound of flab—in one meal!)*Choosing Breyer's Reese's Peanut Butter Cups Ice Cream over Ben & Jerry's Peanut Butter Cup Ice Cream will save you 200 calories per scoop?*The wrong milk shake at Cold Stone will cost you more than a day's worth of calories? (But a smart swap will eliminate 1,520 of them!)Additional features in Eat This, Not That! 2011 include:• The Truth About What's REALLY In Your Food (Think a Chicken McNugget is made out of just chicken? Think again)• The Eat This, Not That! No-Diet Cheat Sheets• Foods That Cure Any Problem• The 20 Worst Foods in America• Top Swaps at the Ballpark, the Mall, the Cocktail Party, Thanksgiving Dinner, and more!• Restaurant Report Card—for Kids• And more!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "The Paleo Solution: The Original Human Diet",
        "Authors": "By Wolf, Robb and Cordain, Loren (FRW)",
        "Description": "Do you want to lose fat and stay young, all while avoiding cancer, diabetes, heart disease, Parkinson's, Alzheimer's and a host of other illnesses? The Paleo Solution incorporates the latest, cutting edge research from genetics, biochemistry and anthropology to help you look, feel and perform your best. Written by Robb Wolf, a research biochemist who traded in his lab coat and pocket protector for a whistle and a stopwatch to become one of the most sought after strength and conditioning coaches in the world. With Robb's unique perspective as both scientist and coach you will learn how simple nutrition, exercise and lifestyle changes can radically change your appearance and health for the better.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Victory Belt Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Princess Within: Restoring the Soul of a Woman",
        "Authors": "By Jakes, Serita Ann",
        "Description": "In her personal, intimate style, Serita Ann Jakes speaks to the hearts of women. Her words resonate with those who feel trapped, but who long to be restored as the \"princesses\" God created them to be. As she shares her life experiences, Serita's insights and encouragement will surround readers with hope, giving them the courage and strength to break free and experience wholeness in Christ.",
        "Category": " Religion , Inspirational",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Keep on Swinging! (Everyone's Hero)",
        "Authors": "By West, Tracey",
        "Description": "Yankee Irving loves baseball--especially Babe Ruth--so when Babe's bat is stolen, Yankee enlists the aid of a talking baseball to go after the thief.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "1,000 Best Movies on DVD",
        "Authors": "By Travers, Peter",
        "Description": "The film critic and senior film editor at Rolling Stone shares his selections for the finest one thousand movies available on DVD, covering everything from Citizen Kane to Dodgball, while providing information on the actors, directors, deleted scenes, bonus features, trivia, and more. Original.",
        "Category": " Performing Arts , Film & Video , History & Criticism",
        "Publisher": "Wenner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Retiring Well on a Poor Man's Budget: 1,001 Ways to Stretch Your Income and Enjoy Your Golden Years",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "FC&A Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    }
]