[
    {
        "Title": "Size Matters: The Hard Facts About Male Sexuality That Every Woman Should Know",
        "Authors": "By Fisch, Harry, M.D. and Baskin, Kara",
        "Description": "A man’s anatomy is a lot easier to understand than his mind, and knowing what’s going on down there is just as important to a happy relationship as figuring out the deeper meaning of his every word. You can analyze your relationship with your girlfriends, but who can you turn to with the more . . . sensitive questions? In Size Matters, Dr. Harry Fisch, an expert on the male reproductive system, and writer Kara Baskin team up to introduce you, metaphorically speaking, to the penis.Clearing up mysteries about male anatomy, orgasm, masturbation, STDs, testosterone, impotence, sexual response, and much more, Size Matters is the first women’s user manual for male sexuality—a guidebook that will answer all your questions and lead you to a better sex life. For example:Can masturbation have any effect on sex? Can he do it too much . . . or too little?He always orgasms before me . . . is there any way to slow him down?Do grown men still have wet dreams?Can his weight affect our sex life?Size Matters is a fun, prescriptive, easy-to-understand troubleshooting guide for women who have questions about male sexuality or who want to have better sex. You might not always understand what’s going on in his mind, but now you can know what’s going on in his pants.",
        "Category": " Psychology , Human Sexuality",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "A Return to Modesty: Discovering the Lost Virtue",
        "Authors": "By Shalit, Wendy",
        "Description": "Where once a young woman had to be ashamed of her sexual experience, today she is ashamed of her sexual inexperience. Where not long ago an unmarried woman was ashamed to give public evidence of sexual desire by living with someone, today she must be ashamed to give evidence of romantic desire. From sex education in grade school to coed bathrooms in college, today's young woman is being pressured relentlessly to overcome her embarrassment, her \"hang-ups,\" and especially her romantic hopes.  Meanwhile, the problems young women struggle with grow steadily more extreme: from sexual harassment, stalking, and date rape to anorexia and self-mutilation. Both men and women endlessly lament the loss of privacy and of real intimacy. What is it all about?  Beholden neither to conservatives who discount as exaggeration the dangers facing young women, nor to feminists who steadfastly affix blame on the patriarchy, Wendy Shalit proposes that, in fact, we have lost our respect for an important classical virtue -- that of sexual modesty. A Return to Modesty is a deeply personal account as well as a fascinating intellectual exploration. From seventeenth-century manners guides to Antonio Canova's sculpture, Venus Italico, to Frank Loesser's 1948 tune, \"Baby, It's Cold Outside,\" A Return to Modesty unfolds like a detective's search for a lost idea as Shalit uncovers opinions about this lost virtue's importance, from Balzac to Simone de Beauvoir, that have not been aired for decades. Then she knocks down the accompanying myths one by one. Female modesty is not about a \"sexual double standard,\" as is often thought, but is related to male virtue and honor. Modesty is not a social construct, but a natural response. And modesty is not prudery, but a way to preserve a sense of the erotic in our lives.  With humor and piercing insight, Shalit invites us to look beyond the blush and consider the new power to be found in an old ideal. She maintains that the sex education curriculum forced on those of her generation from an early age is fundamentally flawed, centered as it is on overcoming reticence -- what we today call \"hang-ups.\" Shalit surprisingly and persuasively argues that without these misnamed hang-ups there can be no true surrender, no richness and depth to relations between the sexes. The natural inclination toward modesty is not a hang-up that we should set out to cure, but rather a wonderful instinct that, if rediscovered and given the right social support, has the power to transform society.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Goldwater: The Man Who Made A Revolution",
        "Authors": "By Edwards, Lee",
        "Description": "A comprehensive biography of Barry Goldwater--the eighty-six-year-old conservative who often has radically liberal opinions in recent years--reveals the profound affect he has had on American politics in five decades of championing conservative causes. IP.",
        "Category": "",
        "Publisher": "Regnery Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Exhaustion Cure: Up Your Energy from Low to Go in 21 Days",
        "Authors": "By Stack, Laura",
        "Description": "Feeling fatigued? Wish you could have more get-up-and-go? If you’re like millions of Americans, you get home from a long day with barely enough energy to lift the remote control. But with Laura Stack’s comprehensive plan, you can regain your vitality in just three weeks. Let The Productivity Pro® help you eliminate the “energy bandits” from all aspects of your life--from your diet and your work schedule to your environment and your relationships--so you can start living in a way that will boost your energy. Focusing on simple changes that make a huge difference, The Exhaustion Cure presents manageable ways to:Cut down on “energy bandits” and fill up on “energy boosters.”Stop relying on caffeine, cigarettes and other substances to keep you going.Avoid letting negative situations or people control your thoughts and actions.Sneak in time for fitness during the busiest days.Accomplish your goals and find more time to devote to your family.LAURA STACK, MBA, CSP, is a personal productivity expert and the author of Leave the Office Earlier and Find More Time. As a professional speaker, she helps workers Leave the Office Earlier® with Maximum Results in Minimum Time™. Laura is the president of The Productivity Pro®, Inc., an international time management company whose clients include Microsoft, GM, Time Warner, Lockheed Martin, and Bank of America.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Audacity of Deceit: Barack Obama's War on American Values",
        "Authors": "By O'Leary, Brad",
        "Description": "What lies beneath Barack Obama's well-polished rhetoric will shock you. Obama touts change but his version is nothing less than a frontal assault on American values and traditions. Obama's goal? Bring America to her knees through a policy of managed decline. On his watch, our great nation will become a second-rate country on a downhill slide. In The Audacity of Deceit, Brad O'Leary takes you deep inside Obama's plans to dismantle the Second Amendment and destroy our economy while putting us in thrall to the United Nations and laying waste to all that millions of Americans hold dear.You'll learn:.How Obama's fatherless childhood mirrors that of Bill Clinton's and fuels his obsession with fame and power at any cost..How his tax plan would raise rates to a Hoover-like 60% and eviscerate America's economy..How the U.S. Treasury will become the United Nations' ATM..Why Obama wants to keep fuel prices high and Americans immobilized..The 0 to 5 initiative designed to transfer child-rearing from parents to the state.Here are the ugly facts about Barack Hussein Obama.",
        "Category": " Political Science , Political Ideologies , General",
        "Publisher": "WND Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "How to Organize Your Work and Your Life",
        "Authors": "By Moskowitz, Robert",
        "Description": "Explains how to order priorities, work to a deadline, organize an effective filing system, set career goals, delegate work, and accomplish personal objectives",
        "Category": "",
        "Publisher": "Main Street Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "Blended Families: Creating Harmony as You Build a New Home Life",
        "Authors": "By Marsolini, Maxine",
        "Description": "When re-married couples bring their families together, they face unique  challenges. Somehow, they must bring unity out of diversity. Maxine Marsolini points  to biblical solutions to the conflict commonly found in divorce and remarriage situations.  'Growth and Application' questions make this an excellent resource for small groups  or Christian counseling.",
        "Category": " Religion , Christian Living , Family & Relationships",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Country Woman Christmas 2007",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Taste of Home Books",
        "Price Starting With ($)": "14.95",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "For Common Things: Irony, Trust, and Commitment in America Today",
        "Authors": "By Purdy, Jedediah",
        "Description": "Calling for a rewewed commitment to and faith in American political and civic life, a blueprint for a sound society assesses the satisfaction of social and political reengagement as it examines such topics as the breakdown of the political process and the ethical and legal complexities of technological development. 35,000 first printing. Tour.",
        "Category": " Social Science , Sociology , Marriage & Family",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Daisy Miller and Washington Square",
        "Authors": "By James, Henry and Kassanoff, Jennie A. (INT)",
        "Description": "&&LDIV&&R&&LDIV&&R&&LI&&RDaisy Miller and Washington Square&&L/I&&R, by &&LB&&RHenry James&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&RStrikingly modern in its psychological insight, social observation and stylistic innovation, &&LB&&RHenry James&&L/B&&R’s fiction continues to attract and intrigue readers a century after its initial appearance. This volume offers two of his most popular and critically admired novellas: &&LI&&RDaisy Miller&&L/I&&R and &&LI&&RWashington Square&&L/I&&R.&&LBR&&R&&LBR&&RIn &&LI&&RDaisy Miller&&L/I&&R, James paints a vivid portrait of a vibrant young American girl visiting Europe for the first time. Lovely, flirtatious, eager for experience, Daisy meets a wealthy American, Mr. Winterbourne, and a penniless but passionate Italian. Her complex encounters with them and others allow James to explore one of his favorite themes, the effect of Americans and Europeans on each other.&&LBR&&R&&LBR&&R&&LI&&RWashington Square&&L/I&&R’s Catherine Sloper is Daisy Miller’s opposite. Neither pretty nor charming, she lives with her wealthy, widowed, tyrannical father, Dr. Austin Sloper, who can barely conceal his disdain for his shy, awkward daughter. When a handsome suitor, Morris Townsend, comes calling, Catherine’s father refuses to believe he is anything other than a heartless fortune hunter and sets out to destroy her romance.&&LBR&&R&&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LSTRONG&&RJennie A. Kassanoff&&L/B&&R is Assistant Professor of English at Barnard College. Her articles have appeared in &&LI&&RArizona Quarterly&&L/I&&R and &&LI&&RPMLA&&L/I&&R. Her book, &&LI&&REdith Wharton and the Politics of Race&&L/I&&R, is forthcoming from Cambridge University Press.&&L/P&&R&&L/DIV&&R",
        "Category": " Fiction , Literary",
        "Publisher": "Sterling Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Millennials Rising: The Next Great Generation",
        "Authors": "By Strauss, William and Howe, Neil",
        "Description": "By the authors of the bestselling 13th Gen, an incisive, in-depth examination of the Millennials--the generation born after 1982.In this remarkable account, certain to stir the interest of educators, counselors, parents, and people in all types of business as well as young people themselves, Neil Howe and William Strauss provide the definitive analysis of a powerful generation: the Millennials. Having looked at oceans of data, taken their own polls, talked to hundreds of kids, parents, and teachers, and reflected on the rhythms of history, Howe and Strauss explain how Millennials have turned out to be so dramatically different from Xers and boomers. Millennials Rising provides a fascinating narrative of America's next great generation.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "What's Going on Down There?: A Boy's Guide to Growing Up",
        "Authors": "By Leighton, Robert (ILT), Gravelle, Karen, Castro, Nick, and Castro, Chava",
        "Description": "Why is my voice making such weird sounds? When will I be able to start shaving? Why do I keep getting pimples? What is a wet dream? Your body has been behaving very strangely lately. You hardly know what to expect from one day to the next. Karen Gravelle, with some help from her two young advisors, Nick and Chava Castro, has written a down-to-earth and practical book that will help guide you through this confusing time in your life. What's Going On Down There? answers any questions you might have about puberty, from what it is and what it feels like, to what puberty is like for girls, to how to handle the sexual feelings you may be starting to experience. Robert Leighton's funny and informative cartoons ease the confusion and exasperation you might feel. Part manual, part older brother, What's Going On Down There? will give you the facts you need to feel comfortable and confident about this new phase of your life.",
        "Category": " Young Adult Nonfiction , Social Topics , General",
        "Publisher": "Walker Childrens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The sound of drums and cymbals",
        "Authors": "By Wilder, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Putnam",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "A Kiss Is Still a Kiss",
        "Authors": "By Ebert, Roger",
        "Description": "The Pulitzer Prize-winning film critic and co-host of television's \"At the Movies\" offers an inside look at the film industry and its stars, power brokers, festivals, writers, producers, directors, and films",
        "Category": " Performing Arts , General",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "5.65",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Matinee Idylls: Reflections on the Movies",
        "Authors": "By Schickel, Richard",
        "Description": "Some of the movies' greatest figures, some of the most important issues raised by the medium, come under close, highly personal, and deeply informed reflection in this new book by one of our most prominent and influential critics. \"A pleasure to read...intelligent, well-informed, insightful and unfailingly gracious.\"—Martin Scorsese.",
        "Category": " Performing Arts , Film , History & Criticism",
        "Publisher": "Ivan R. Dee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Little French Cookbook",
        "Authors": "By Laurence, Janet and Leadbetter, Diana",
        "Description": "Contains recipes for snacks, main dishes, and desserts originating in France",
        "Category": " Cooking , Regional & Ethnic , French",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Under the Spell of Mother Earth",
        "Authors": "By Kjos, Berit",
        "Description": "",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "America's Best Cooking",
        "Authors": "By Ed, Landolls Inc",
        "Description": "",
        "Category": "",
        "Publisher": "Landoll Inc",
        "Price Starting With ($)": "9.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Rainbow (Wordsworth Classics)",
        "Authors": "By Lawrence, D. H.",
        "Description": "",
        "Category": " Comics & Graphic Novels , General",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Adventures with Grandpa Ek: Washington, D.C.",
        "Authors": "By Jerrold Perlet",
        "Description": "",
        "Category": "",
        "Publisher": "1979",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The making of the Middle Ages (Yale paperbounds Y-46)",
        "Authors": "By Southern, R. W",
        "Description": "",
        "Category": "",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Better Homes and Gardens Step-By-Step Basic Wiring",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Helps the homeowner understand electricity and how it works, showing through detailed directions and clear illustrations how to make a variety of electrical repairs and improvements",
        "Category": " Reference , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Little Girls In Church (Pitt Poetry Series)",
        "Authors": "By Norris, Kathleen",
        "Description": "Although Kathleen Norris’s best-selling Dakota: A Spiritual Geography has brought her to the attention of many thousands of readers, she is first and last a poet.  Like Robert Frost, another poet identified with a particular landscape, she can reveal the miraculous in the ordinary, and she writes with clarity, humor, and deep sympathy for her subjects.",
        "Category": " Poetry , American , General",
        "Publisher": "University of Pittsburgh Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The New York Times Book of Broadway: On the Aisle for the Unforgettable Plays of the Last Century",
        "Authors": "By Brantley, Ben (EDT)",
        "Description": "From the New York Times comes a rich mosaic of the most unforgettable Broadway and Off Broadway moments of the last hundred years. Experience the night a star was born, a director's brilliant debut, a play that broke new ground, a musical that redefined the genre, and even a terrible play that ran for years - or another that closed after one night.This volume, essential for anyone who loves Broadway, includes a full introduction by Ben Brantley, chief theater critic of The Times, his selection of 25 of the influential Broadway plays that defined the twentieth century, and his choice of 100 other, memorable plays - right up through plays currently running on Broadway.The definitive 25 are accompanied by photographs, pull-out stats, and highlights from the opening night review. Each of the unforgettable 125 includes the full, original New York Times review by eminent critics of the day, such as Frank Rich, Clive Barnes, Walter Kerr, Brooks Atkinson, Alexander Woollcott and others. Cast boxes, vintage photographs, and statistics about the productions complete this authoritative volume about timeless Broadway theater.",
        "Category": " Performing Arts , Theater , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Selected Poetry (The Oxford Poetry Library)",
        "Authors": "By Hardy, Thomas and Hynes, Samuel (EDT)",
        "Description": "Thomas Hardy is among the best-loved of the great English poets, perhaps drawing his great popularity from the elegaic tone of much of his finest verse and the universality of his subject matter: birth, childhood, love, marriage, age, and death.  Those elegies inspired by the death of his first wife Emma are some of his best, and are well represented in this new selection of his verse.  Prepared by Samuel Hynes, the editor of the definitive Oxford English Texts Complete Works of Thomas Hardy, this volume includes a selection of Hardy's poetry that spans his life, verses that influenced later poets as diverse as Robert Graves and Philip Larkin, Ezra Pound and W.H. Auden.",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Tough Choices: A Memoir",
        "Authors": "By Fiorina, Carly",
        "Description": "A former CEO, president, and chairperson of Hewlett-Packard traces her educational upsets before entering the business world in her twenties, her struggles as a high-profile businesswoman in a male-dominated arena, her role in HP's controversial merger, and her public firing. 250,000 first printing.",
        "Category": " Biography & Autobiography , Business",
        "Publisher": "Portfolio Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "American Crawl (Vassar Miller Prize in Poetry)",
        "Authors": "By Allen, Paul",
        "Description": "Winner of the Vassar Miller Prize in Poetry, 1996.",
        "Category": " Poetry , American , General",
        "Publisher": "University of North Texas Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Savage Beauty: The Life of Edna St. Vincent Millay",
        "Authors": "By Milford, Nancy",
        "Description": "Thirty years after the smashing success of Zelda, Nancy Milford returns with a stunning  second act.  Savage Beauty is the portrait of a passionate, fearless woman who obsessed  American ever as she tormented herself. If F. Scott Fitzgerald was the hero of the  Jazz Age, Edna St. Vincent Millay, as flamboyant in her love affairs as she was in  her art, was its heroine.  The first woman ever to win the Pulitzer Prize, Millay  was dazzling in the performance of herself.  Her voice was likened to an instrument  of seduction and her impact on crowds, and on men, was legendary. Yet beneath her  studied act, all was not well.  Milford calls her book \"a family romance\"—for the  love between the three Millay sisters and their mother was so deep as to be dangerous.   As a family, they were like real-life Little Women, with a touch of Mommie Dearest. Nancy Milford was given exclusive access to Millay's papers, and what she found  was an extraordinary treasure.  Boxes and boxes of letter flew back and forth among  the three sisters and their mother—and Millay kept the most intimate diary, one  whose ruthless honesty brings to mind Sylvia Plath.  Written with passion and flair,  Savage Beauty is an iconic portrait of a woman's life.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Rolling Thunder (The Truth Chasers Series #1)",
        "Authors": "By Mynheir, Mark",
        "Description": "Law Enforcement Agents Can Do It All. But Forgive? John Russell is the Florida Department of Law Enforcement agent assigned to the missing Dylan Jacobs’ case. But while he’s tracking down clues in his professional life, a murderer is hot on his trail—his own flesh and blood. John’s father relentlessly seeks something John refuses to offer: forgiveness. Forced to face the source of his paralyzing fear of thunder and his stolen childhood, can John find the missing boy without his personal life completely unraveling?Ten-year-old Dylan Jacobs is missing from state care. John Russell is the team leader of the Florida Department of Law Enforcement task force trying to find him. Although the governor has declared this a top priority, all the team is turning up are corruption and crime of a different sort. Could Dylan still be alive after disappearing from the system six years ago?Meanwhile, John’s own long-buried nightmare is unearthed when a paroled killer shows up in his driveway. He struggles to leave old horrors where they belong—in the past. Determined to protect her children and help her husband, his wife, Marie, does some investigating of her own. Because she soon realizes, what you don’t know can hurt you. Join the agents of the FDLE as they seek the truth behind the crime and grapple with Truth in their personal lives. Dealing with depravity all day, every day, it doesn’t always seem like God is in control. Which just makes victory all that much sweeter when it comes. “Drawing upon his real-life experience as a police detective, Mark Mynheir has given us a realistic story and characters to care for. Mark presents us with a fresh new voice who writes from a unique perspective.”Angela Hunt, bestselling author of Unspoken “A remarkable first novel, with strong action and a solid moral. Readers will eagerly await the next installment from Mark Mynheir.”T. Davis Bunn, bestselling author “Rolling Thunder is a compelling story examining the struggles, importance, and power of forgiveness.”Bill Myers, bestselling author of Soul Tracker Story Behind the BookMark Mynheir’s experience as a homicide detective enables him to accurately expose, from an insider’s view, the exciting world of law enforcement and crime investigation. It also sets an unassuming scene for the serious spiritual work that needs to be accomplished in Mynheir’s main character. While the story unfolds, the reality becomes clear of how many Christians welcome God’s grace and forgiveness for themselves but struggle to extend it to others. They harbor unresolved anger and resentment, often for years, against those who have hurt them. Mynheir challenges readers to identify with fictional characters and to initiate the process of forgiveness in their own lives.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Eagle's Shadow",
        "Authors": "By Hertsgaard, Mark",
        "Description": "On September 11, 2001, Mark Hertsgaard was completing a trip around the world, gathering perceptions about America from people in fifteen countries. Whether sophisticated business leaders, starry-eyed teenagers, or Islamic fundamentalists, his subjects were both admiring and uneasy about the United States, enchanted yet bewildered, appalled yet envious. Exploring such paradoxes, Hertsgaard exposes truths that force natives and outsiders alike to see America with fresh eyes. In a world growing more American by the day, The Eagle's Shadow is a major statement about and to the place everyone discusses but few understand.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Selected Canterbury Tales",
        "Authors": "By Chaucer, Geoffrey",
        "Description": "At the Tabard Inn in Southwark, in the London of the late 1300s, a band of men and women from all walks of life have gathered to begin a pilgrimage to the shrine of Thomas à Becket at Canterbury. To relieve the tedium of the journey, the host of the inn proposes that each of the pilgrims tell a favorite story, promising that the best storyteller will be treated to a fi ne dinner on the group's return to Southwark.So begins one of the earliest masterpieces of English literature, a collection of stories as much prized for the portraits of its story tellers as for the stories they tell — portraits that reveal much of the rich social fabric of 14th-century England. Now three of the most popular tales — along with the charming General Prologue have been selected for this edition: The Knight's Tale, The Miller's Prologue and Tale, and The Wife of Bath's Prologue and Tale.Animated by Chaucer's sly humor, flair for characterization and wise humanity, the stories have been recast into modern verse that captures the lively spirit of the originals. Highly entertaining, they represent an excellent entree to the rest of The Canterbury Tales and to the pleasures of medieval poetry in general. A selection of the Common Core State Standards Initiative.",
        "Category": " Poetry , European , English, Irish, Scottish, Welsh",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "In Search of Theater",
        "Authors": "By Bentley, Eric",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1954"
        }
    },
    {
        "Title": "Three Books: Body Rags/ Mortal Acts Mortal Words/the Past",
        "Authors": "By Kinnell, Galway",
        "Description": "These three books--Body Rags, Mortal Acts, Mortal Words, and The Past--are central to the life's work of one of the masters of contemporary poetry. Published here in one volume, they include many of Galway Kinnell's best loved and most anthologized poems. In a note, Galway Kinnell comments on the numerous revisions he has made to many of the poems for this edition.",
        "Category": " Poetry , American , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Saber-Tooth Curriculum",
        "Authors": "By J. Abner Peddiwell",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill Book Company",
        "Price Starting With ($)": "7.87",
        "Publish Date": {
            "Month": "January",
            "Year": "1939"
        }
    },
    {
        "Title": "A Field Guide to Christianity: Answering Common Misconceptions",
        "Authors": "By Allan, John and Eyre, G.",
        "Description": "Answers common questions about God, Jesus, the Bible, the Christian church, conversion, death, tragedies, and the Christian life.",
        "Category": " Religion , General",
        "Publisher": "Moody Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "The Red Badge of Courage",
        "Authors": "By Stephen Crane",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Videohound's World Cinema: The Adventurer's Guide to Movie Watching",
        "Authors": "By Wilhelm, Elliott",
        "Description": "",
        "Category": " Performing Arts , Film & Video , Guides & Reviews",
        "Publisher": "Visible Ink Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The A List: The National Society Of Film Critics' 100 Essential Films",
        "Authors": "By Carr, Jay (EDT) and National Society of Film Critics (COR)",
        "Description": "People love movies. People love lists. So The A-List is a natural. While there are plenty of encyclopedic lists of films, this compulsively readable book of 100 essays&#151;most written expressly for this volume-flags the best of the best as chosen by a consensus of the National Society of Film Critics. The Society is a world-renowned, marquee&#151;name organization embracing some of America's most distinguished critics: more than forty writers who have national followings as well as devoted local constituencies in such major cities as New York, Chicago, Los Angeles, Boston, Philadelphia, Atlanta, and Minneapolis. But make no mistake about it: This isn't a collection of esoteric \"critic's choice\" movies. The Society has made its selections based on a film's intrinsic merits, its role in the development of the motion-picture art, and its impact on culture and society. Some of the choices are controversial. So are some of the omissions. It will be a jumping-off point for discussions for years to come. And since the volume spans all international films from the very beginning, it will act as a balance to recent guides dominated by films of the last two decades (hardly film's golden age). Here is a book that is definitely ready for its close-up.",
        "Category": " Performing Arts , Film , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Moonstone (Wordsworth Classics)",
        "Authors": "By Collins, Wilkie",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "A Room With a View",
        "Authors": "By Forster, E. M.",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Last Word: Final Scenes from Your Favorite Motion Pictures",
        "Authors": "By Gross, Josh",
        "Description": "A collection of the last scenes--in words and pictures--of sixty of America's favorite movies captures the emotional pre-fade out moments of such classics as Gone with the Wind, The African Queen, The Wizard of Oz, E.T., and others. Original.",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "The Jameses: A Family Narrative",
        "Authors": "By Lewis, R. W. B.",
        "Description": "Lewis presents an account of one of the foremost intellectual families in American history. He begins with the originator's, William James of Albany, emigration in 1789 from Ireland and concludes with the death in 1916 of the great novelist Henry James. The emphasis throughout is the family narrative and not the works produced by family members, although these are considered. The lives most detailed are those of the brothers William, the psychologist, and Henry, the novelist, along with their sister Alice, political radical and lifelong invalid. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Reference , General",
        "Publisher": "Farrar Straus & Giroux",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Beowulf (Dover Thrift Editions)",
        "Authors": "By Beowulf and Gordon, R. K. (TRN)",
        "Description": "One of the most universally studied of the English classics, Beowulf is considered the finest heroic poem in Old English. Written ten centuries ago, it celebrates the character and exploits of Beowulf, a young nobleman of the Geats, a people of southern Sweden.Beowulf first rescues the royal house of Denmark from two marauding monsters, then returns to rule his people for 50 years, ultimately losing life in a battle to defend the Geats from a dragon's rampage. The poem combines mythical elements, Christian and pagan sensibilities, and actual historical figures and events in a narrative that ranges from vivid descriptions of fierce fighting and detailed portrayals of court life to earnest considerations of social and moral dilemmas. Originally written in Old English verse, it is presented here in an authoritative prose translation by R. K. Gordon.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Longest Journey",
        "Authors": "By Forster, E. M.",
        "Description": "In this searching tragicomedy of manners, personalities, and world views, E. M. Forster explores the \"idea of England\" he would later develop in Howard's End.  Bookish, sensitive, and given to wild  enthusiasms, Rickie Elliot is virtually made for a life at Cambridge, where he can subsist on a regimen of biscuits and philosophical debate.  But the love-smitten Rickie leaves his natural habitat to marry the devastatingly practical Agnes Pembroke, who brings with her — as a sort of dowry — a teaching position at the abominable Sawston School.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Drama: A Pocket Anthology",
        "Authors": "By Gwynn, R. S. (EDT)",
        "Description": "The perfect alternative to lengthy drama anthologies, this brief, affordable collection of 9 most widely taught plays provides a concise but complete introduction to the study of drama.   \"Writing About Drama\" section offers a brief overview of organizational strategies, research methods, style and MLA style citation. Index of critical terms provides a cross-referenced list of terms covered. 6 New Plays including Fences, by August Wilson and The Heidi Chronicles, by Wendy Wasserstein.",
        "Category": " Drama , Anthologies (multiple authors)",
        "Publisher": "Pearson",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "60 Days of Low-Fat, Low-Cost Meals in Minutes: Over 150 Delicious, Healthy Recipes & Menus That Fit Your Budget",
        "Authors": "By Smith, M. J.",
        "Description": "Explains the benefits of a low-fat diet and shares healthful recipes for breads, salads, soups, casseroles, vegetables, meat, poultry, fish, snacks, and desserts",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Chronimed Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Cooking Under Cover: One-Pot Wonders- A Treasury of Soups, Stews, Braises and Casseroles",
        "Authors": "By Richardson, Alan (PHT), Griffith, Linda, and Griffith, Fred",
        "Description": "Once considered humble fare, braised lamb shanks, richly flavored French Stew, and spicy Cajan gumbos have become cornerstones of sophisticated restaurant menus.  At home, too, whether for family or company, few dinners are easier or more welcome than a one-pot meal, which can bubble along unattended and be served in the same dish.This mouthwatering collection by the James Beard Award-winning authors of the bestseller Onions, Onions, Onions contains over 200 stylish recipes for everything from appetizers to deserts.",
        "Category": " Cooking , General",
        "Publisher": "Chapters Pub Ltd",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Supermarket Epicure: The Cookbook For Gourmet Food At Supermarket Prices",
        "Authors": "By Pruess, Joanna",
        "Description": "",
        "Category": "",
        "Publisher": "Quill / William Morrow & Co.",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Rebel Angels (The Gemma Doyle Trilogy Book #2)",
        "Authors": "By Bray, Libba",
        "Description": "Gemma Doyle is looking forward to a holiday from Spence Academy—spending time with her friends in the city, attending balls in fancy gowns with plunging necklines, and dallying with the handsome Lord Denby. Yet amid these distractions, her visions intensify—visions of three girls dressed in white, to whom something horrific has happened that only the realms can explain.The lure is strong, and soon Gemma, Felicity, and Ann are turning flowers into butterflies in the enchanted world that Gemma takes them to. To the girls' great joy, their beloved Pippa is there as well, eager to complete their circle of friendship.But all is not well in the realms—or out. Kartik is back, desperately insisting to Gemma that she must bind the magic, lest colossal disaster befall her. Gemma is willing to comply, for this would bring her face-to-face with her late mother's greatest friend, now Gemma's foe—Circe. Until Circe is destroyed, Gemma cannot live out her destiny. But finding Circe proves a most perilous task. . . .This sumptuous companion to A Great and Terrible Beauty teems with Victorian thrills and chills that play out against the rich backdrop of 1895 London, a place of shadows and light . . . where inside great beauty can lie a rebel angel.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Ember",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Looking Around: A Journey Through Architecture",
        "Authors": "By Rybczynski, Witold",
        "Description": "From the opening sentences of his first book on architecture. Home, Witold Rybczynski seduced readers into a new appreciation of the spaces they live in. He also introduced us to \"an unerringly lucid writer who knows how to translate architectural ideas into layman's terms\" (The Dallas Morning News). Rybczynski's vast knowledge, his sense of wonder, and his elegantly uncluttered prose shine on every page of his latest meditation on the art of building.Looking Around is about architecture as an art of compromise - between beauty and function, aspiration and engineering, builders and clients. It is the story of the Seagram Building in New York and the Wexner Center for the Visual Arts in Columbus, Ohio - a museum that opened without a single painting on view, so that critics could better appreciate its design. But what of the visitors who want a building that displays art well? What of those who work in the building?Looking Around explores the notion of the architect as superstar and assesses giants from Palladio to Michael Graves, styles from classicism to high tech. It demonstrates how architecture actually works - or doesn't - in corporate headquarters, airports, private homes, and the special buildings designed to represent our civilization. For all its erudition, Looking Around is also bracingly straightforward. Rybczynski looks closely and critically at structures that may once have dazzled us with their ostentation and expense, and sees them as triumphs or failures - of aesthetic ideals and of lasting function. This is a fascinating and illuminating book about an art form integral to our lives.",
        "Category": " Architecture , History , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.98",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Arctic Drift (A Dirk Pitt Novel, #20) (Dirk Pitt Adventure)",
        "Authors": "By Cussler, Clive and Cussler, Dirk",
        "Description": "A potential breakthrough discovery to reverse global warming ... a series of unexplained sudden deaths in British Columbia ... a rash of international incidents between the United States and one of its closest allies that threatens to erupt into an actual shooting war ... NUMA director Dirk Pitt and his children, Dirk Jr. and Summer, have reason to believe there's a connection here somewhere, but they also know they have very little time to find it before events escalate out of control. Their only real clue might just be a mysterious silvery mineral traced to a long-ago expedition in search of the fabled Northwest Passage. But no one survived from that doomed mission, captain and crew perished to a man - and if Pitt and his colleague Al Giordino aren't careful, the very same fate may await them.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Bird Watching For Dummies",
        "Authors": "By Thompson, Bill and Bird Watchers Digest Press (EDT)",
        "Description": "Millions of people worldwide enjoy bird watching; it offers them a chance to get back to nature and enjoy the beauty of the outdoors. Bird Watching For Dummies covers all the basics of bird watching, leading you on a guided tour of the gorgeous world of birds. From identifying birds by sight and sound to making your own &apos;life list,&apos; you&apos;ll find all the tips and advice you need right here.  Whether you&apos;ve been bird watching for years or you&apos;re just starting out, Bird Watching For Dummies has all your bases covered. It&apos;s full of practical tips and proven advice to make your bird watching experiences as fun and rewarding as possible. It&apos;s your first aid kit for finding, identifying, feeding, and even housing birds. Plus, there&apos;s more:  Designing a bird-friendly backyard Purchasing bird feeders, birdhouses, binoculars, clothing, and more Keeping notes and records of the birds you spot Joining bird clubs, taking field trips, and attending bird festivals Booking bird watching tours that fit your budget and expertise Choosing and using field guides  You won&apos;t find a more straightforward and reliable bird watching guide than this one. Written by Bill Thompson III, and the staff of Bird Watcher&apos;s Digest, it covers everything from backyard bird watching to field trips across the globe. No matter what your level of experience, this guide offers everything you need for unforgettable bird watching:  Tackling pests and other feeder problems Bird-friendly gardening tips Optics and how to use them Birding by habitat and hotspots Songs, calls, and non-vocal identifying sounds Attracting and spotting hummingbirds Understanding the terminology Dressing for success  If you need help getting started in your new hobby, or you&apos;re an old hand who just wants a quick-and-easy reference, Bird Watching For Dummies is the fun and simple way to stay up on all the latest in the world of bird watching. With unbeatable advice and practical guidance from the experts at Bird Watcher&apos;s Digest, this handy resource is the only bird watching guide you need.  NOTE: Birdwatching For Dummies no longer contains a 32 page color insert.",
        "Category": " Nature , Birdwatching Guides",
        "Publisher": "John Wiley & Sons",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "All the Parables of the Bible: A Study and Analysis of the More Than 250 Parables in Scripture",
        "Authors": "By Lockyer, Herbert",
        "Description": "This book is a study and analysis of the more than 250 parables in Scripture. This monumental work is not another tramp over the well-raked field of the parables found in the gospels, but a comprehensive survey of the uses of parabolic illustration and instruction in the whole of the Bible, from Genesis to Revelation. Never before has this aspect of truth been combined into one volume.",
        "Category": " Religion , Biblical Reference , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "9.0",
        "Publish Date": {
            "Month": "June",
            "Year": "1973"
        }
    },
    {
        "Title": "Shelves, Closets & Cabinets",
        "Authors": "By Jones, Peter, Tong, Gary, Kornblum, Mary, and Chepikian, Minas",
        "Description": "A Popular Science sourcebook with 304 ways to solve storage problems in every room of your home, shop or office. “Contains a large number of clearly illustrated plans for all types of storage facilities.”—Fine Woodworking. It’s quick and easy with 2-color drawings, hundreds of photos, and step-by-step instructions. “Will be of use to the home handyman and do-it-yourselfer.”—Fine Woodworking.",
        "Category": " House & Home , Do-It-Yourself , Carpentry",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "Mathematical Reasoning: For Elementary Teachers",
        "Authors": "By Long, Calvin T. and Detemple, Duane W.",
        "Description": "",
        "Category": " Mathematics , General",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "9.23",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "A Letter to America",
        "Authors": "By Boren, David",
        "Description": "A powerful wake-up call to all AmericansWith only 6 percent of the world’s population, how long will the United States remain a global superpower? The answer, David Boren tells us in A Letter to America, depends on asking ourselves tough questions. A powerful wake-up call to Americans, A Letter to America, forces us to take a bold, objective look at ourselves.In A Letter to America, Boren explains with unsparing clarity why the country is at a crossroads and why decisive action is urgently needed and offers us an ambitious, hopeful plan.What the country needs, Boren asserts, are major reforms to restore the ability of our political system to act responsibly. By relying on our shared values, we can replace cynicism with hope and strengthen our determination to build a better future. We must fashion a post–Cold War foreign policy that fits twenty-first-century realities—including multiple contending superpowers. We must adopt campaign finance reform that curbs the influence of special interests and restores political power to the voters. Universal health care coverage, budget deficit reduction, affordable higher education, and a more progressive tax structure will strengthen the middle class.Boren also describes how we can renew our emphasis on quality primary and secondary education, revitalize our spirit of community, and promote volunteerism. He urges the teaching of more American history and government, for without educated citizens our system cannot function and our rights will not be preserved. Unless we understand how we became great, we will not remain great.The plan Boren puts forward is optimistic and challenges Americans to look into the future, decide what we want to be and where we want to go, and then implement the policies and actions we need to take us there.",
        "Category": " Political Science , Essays",
        "Publisher": "University of Oklahoma Press",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Letter to a Christian Nation",
        "Authors": "By Harris, Sam",
        "Description": "“Thousands of people have written to tell me that I am wrong not to believe in God. The most hostile of these communications have come from Christians. This is ironic, as Christians generally imagine that no faith imparts the virtues of love and forgiveness more effectively than their own. The truth is that many who claim to be transformed by Christ’s love are deeply, even murderously, intolerant of criticism. While we may want to ascribe this to human nature, it is clear that such hatred draws considerable support from the Bible. How do I know this? The most disturbed of my correspondents always cite chapter and verse.”So begins Letter to a Christian Nation…www.samharris.org",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Ladies Home Journal Adventure In Cooking",
        "Authors": "By Journal, Ladies Home",
        "Description": "",
        "Category": "",
        "Publisher": "Random House~trade",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Fat can be beautiful: Stop dieting, start living : one-third of all Americans are overweight, of these, twenty million are born to be fat",
        "Authors": "By Friedman, Abraham I",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley Pub. Corp. : distributed by Putnam",
        "Price Starting With ($)": "9.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Who Stole Halloween?",
        "Authors": "By martha-freeman",
        "Description": "",
        "Category": "",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "We Are Sisters",
        "Authors": "By Brestin, Dee",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Chariot Victor Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Lipton Creative Cookery",
        "Authors": "By Lipton",
        "Description": "A collection of time-saving recipes for dishes made with Lipton Soup Mix",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "The Complete Chicken Cookbook",
        "Authors": "By Merehurst",
        "Description": "",
        "Category": "",
        "Publisher": "Murdoch Books",
        "Price Starting With ($)": "7.32",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Balsamic Vinegar Cookbook",
        "Authors": "By Barnhurst, Noel (PHT) and Halm, Meesha",
        "Description": "An estimated 1.75 million liters of commercial balsamic vinegar and 1,760 liters of traditional balsamic vinegar are sold annually. Noted for its rich color, intense fruity aroma and exquisite sweet-and-sour flavor, it has become America's most coveted condiment. It is now served in the trendiest restaurants and is frequently featured in gourmet food magazines.   For gourmets who want to learn more about this uncommon elixir and use it to add a touch of flavor to their own home-cooked meals comes The Balsamic Vinegar Cookbook.  Featuring more than 40 tantalizing recipes that make the most of balsamic vinegar's assertive, complex flavor, it offers dishes such as Minestrone Modena-Style, Maple-glazed Balsamic Carrots, Salmon with Gingered Balsamic Vinegar and Strawberry Granita. An engaging history of balsamic vinegar combined with a fascinating look at how it is produced round out this tribute, which also defines terms, clears up misconceptions and provides a list of mail-order sources to ensure that readers have access to the best balsamic vinegar possible.",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "A View from the Bridge (Penguin Plays)",
        "Authors": "By Miller, Arthur",
        "Description": "America's greatest playwright weaves \"a vivid, crackling, idiomatic psychosexual horror tale.\" —Frank Rich, The New York TimesWinner of the 2016 Tony Awards for Best Revival of a Play and Best Direction of a Play: Ivo van Hove.In A View from the Bridge Arthur Miller explores the intersection between one man's self-delusion and the brutal trajectory of fate.  Eddie Carbone is a Brooklyn longshoreman, a hard-working man whose life has been soothingly predictable.  He hasn't counted on the arrival of two of his wife's relatives, illegal immigrants from Italy; nor has he recognized his true feelings for his beautiful niece, Catherine.  And in due course, what Eddie doesn't know—about her, about life, about his own heart—will have devastating consequences. \"The play has moments of intense power. . . . Miller plays on the audience with the skill of a master.\" —Clive Barnes, New York Post",
        "Category": " Drama , American , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1977"
        }
    },
    {
        "Title": "Marie Claire Style: Brunches",
        "Authors": "By Jody Vassallo",
        "Description": "",
        "Category": "",
        "Publisher": "Time Life Medical",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Betty Crocker's Best Recipes for Weekend Breakfasts (Betty Crocker's Red Spoon Collection)",
        "Authors": "By Crocker",
        "Description": "Gathers recipes for breads, omeletes, quiche, pancakes, potatoes, fruit, biscuits, coffee cakes, muffins, and beverages",
        "Category": " Cooking , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The High Kings",
        "Authors": "By Chant, Joy",
        "Description": "A storyteller in the court of King Arthur recounts the legendary tales about the adventures of the King's ancestors",
        "Category": " Fiction , Fantasy , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Spaceshots",
        "Authors": "By Ferris, Timothy",
        "Description": "An album of photographs of outer space collected from an international group of observatories and photographers that features photographs of Martian landscapes, the corona of the sun, and the volcanoes of Jupiter",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Choke",
        "Authors": "By PALAHNIUK, Chuck",
        "Description": "Victor Mancini, a medical-school dropout, is an antihero for our deranged times. Needing to pay elder care for his mother, Victor has devised an ingenious scam: he pretends to choke on pieces of food while dining in upscale restaurants. He then allows himself to be “saved” by fellow patrons who, feeling responsible for Victor’s life, go on to send checks to support him. When he’s not pulling this stunt, Victor cruises sexual addiction recovery workshops for action, visits his addled mom, and spends his days working at a colonial theme park. His creator, Chuck Palahniuk, is the visionary we need and the satirist we deserve.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Bacchae and Other Plays (Penguin Classics)",
        "Authors": "By Euripides and Vellacott, Philip",
        "Description": "The plays of Euripides have stimulated audiences since the fifth century BC. This volume, containing Phoenician Women, Bacchae, Iphigenia at Aulis, Orestes, and Rhesuscompletes the new editions of Euripides in Penguin Classics.Features a general introduction, individual prefaces to each play, chronology, notes, bibliography, and glossary",
        "Category": " Drama , Ancient & Classical",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1954"
        }
    },
    {
        "Title": "The Knights, Peace, Wealth/the Birds, the Assemblywomen",
        "Authors": "By Aristophanes",
        "Description": "",
        "Category": " Drama , General",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1978"
        }
    },
    {
        "Title": "Killing Critics (Kathleen Mallory Novels)",
        "Authors": "By O'Connell, Carol",
        "Description": "NYPD sergeant Kathleen Mallory, a wild child turned policewoman, possessed of a ferocious intelligence and a unique inner compass of right and wrong, is about to be sorely tested.Killing Critics begins with a discreet murder - the almost unnoticed death of a hack artist at a gallery opening - but quickly connects with a much more brutal crime - a twelve-year-old double homicide and dismemberment originally investigated by Mallory's now deceased adoptive father, Louis Markowitz. A quick confession ended that case, but as Mallory probes into the new murder, the ghosts of the old will not be still. She finds herself traveling in an intricately connected world of envy, greed, and lethal passions: a place where no relationship is what it seems, and the secrets, very deep and very dark indeed, strike closer and closer to home. By the end, she will come to know the truth - but the truth may be the most dangerous illusion of all.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Balm in Gilead and Other Plays (Spotlight Dramabook)",
        "Authors": "By Wilson, Lanford",
        "Description": "",
        "Category": "",
        "Publisher": "Hill & Wang",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "Ayana the Tall Tales From the Serengeti",
        "Authors": "By Creative Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "4540348",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Give Me My Spirit Back: The Autobiography of Cecil Ward White, Major, U.S. Army, Retired, The Last of the Buffalo Soldier",
        "Authors": "By Cecil Ward White",
        "Description": "",
        "Category": "",
        "Publisher": "Cecil Ward White Book Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Book of Q: A Novel",
        "Authors": "By Rabb, Jonathan",
        "Description": "In his national bestseller The Overseer, Jonathan Rabb demonstrated his imaginative power and keen understanding of history with a superb thriller that dazzled critics and fans alike. The Book of Q now brings his gifts to full, stunning fruition.Asia Minor, sixth century: After several centuries of conflict with the early Christian church, the Manichaeans, a heretical sect, vanish from the historical record. Bosnia, 1992: Ian Pearse, a young American relief worker destined for the priesthood, has his faith tested by the horrors of war, but is jolted from his despair by a passionate affair with a Croatian woman named Petra.Rome, present day: Father Pearse, now a researcher at the Vatican Library, comes into possession of an ancient scroll after the mysterious death of one Vatican priest and the disappearance of another. His scholar's curiosity aroused, he has the document translated by an old friend in Rome. He is stunned to learn that the scroll contains ingeniously coded letters and the text of the \"Perfect Light,\" a Manichaean prayer that has never been found in its written form. In the early days of the Christian church the Manichaeans had been an overly zealous, highly organized secret society, scorned by the church and seemingly driven out of existence. But these newly discovered documents indicate an earth-shattering alternate history, a long-dormant, highly evolved conspiracy carefully nurtured for centuries, and an even more important scroll hinted at in the letters that will facilitate \"the great awakening.\"When the pope dies of a sudden illness, Pearse is roughed up by Vatican security, who want the scroll, and when the woman who translated the prayer for him is kidnapped, he realizes that \"the great awakening\" is not an academic concept but something very real and dangerous. With his friend's life at stake, Pearse must find the document that holds the key to this Manichaean conspiracy. Racing from the Vatican to Greece and back to Bosnia, Pearse has to decipher the cryptograms and codes that have been passed down for centuries from one Manichaean sect to another in the documents he finds. He is also reunited with Petra, the passionate, determined Croatian woman who has lingered in his mind since their time together in Bosnia years earlier. Together they must face a heresy that has been vigilantly guarded and cared for throughout the centuries until the time is right to unleash it on the world. And the time is now. . . .",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Show Business Nobody Knows",
        "Authors": "By Wilson, Earl",
        "Description": "",
        "Category": "",
        "Publisher": "Cowles Book Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Kiss, Bow, or Shake Hands: How to Do Business in Sixty Countries",
        "Authors": "By Morrison, Terri, Conaway, Wayne A., and Borden, George A.",
        "Description": "Provides overviews of sixty cultures, and describes behavior, negotiating techniques, and business practices in each country",
        "Category": " Business & Economics , General",
        "Publisher": "Bob Adams, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Principles of Christian Theology",
        "Authors": "By MacQuarrie, John",
        "Description": "",
        "Category": "",
        "Publisher": "CHARLES SCRIBNER'S SONS",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Santa Fe Recipe",
        "Authors": "By Stromquist, Carl and Stromquist, Joan",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Tierra Pubns",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Roy's Feasts from Hawaii",
        "Authors": "By Harrisson, John and Yamaguchi, Roy",
        "Description": "A feast for the eye and the palate, this is the ultimate presentation of the new cuisine from Hawaii and the Pacific Rim created by its most celebrated and honored chef, Roy Yamaguchi. He takes the reader on a journey of discovery as he presents some 100 recipes based on the rich variety and freshness of the foods of the islands (and shows how they can be created anywhere). Unique, dazzling color photos complete this portrait of a brilliant new cuisine.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Crafts and Keepsakes for the Holidays (Christmas With Martha Stewart Living)",
        "Authors": "By Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Martha stewart Living",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Inspector General (Dover Thrift Editions)",
        "Authors": "By Gogol, Nikolai Vasilevich",
        "Description": "Considered the high point of Gogol's writing for the stage and a masterpiece of dramatic satire, The Inspector General skewers the stupidity, greed, and venality of Russian provincial officials. When it is announced that the Inspector General is coming to visit incognito, Anton, the chief of police, hastens to clean up the town before his arrival. Local officials scurry to hide evidence of bribe-taking and other misdeeds, setting the stage for the arrival from St. Petersburg of Ivan, a penurious gambler and rake who is promptly taken by the townspeople to be the dreaded Inspector General. Ivan, and his servant, Osip, soon take advantage of the situation with hilarious results. First performed in 1836, the play transcends regional and national boundaries to offer a biting, highly entertaining glimpse of universal human foibles and failings.",
        "Category": " Drama , European , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2011"
        }
    },
    {
        "Title": "From Crossbow to H-Bomb:The Evolution of the Weapons and Tactics of Warfare",
        "Authors": "By Brodie, Bernard and Brodie, Fawn M.",
        "Description": "... offers the quickest way I know to acquire the basic historical background that we ought all to have.\" —Louis J. Halle, SurvivalThis classic in the field of military history covers weaponry from Archimedes’ catapult down to MIRV and the ABM, emphasizes the contributions of science to warfare, and includes an extensive new chapter on the weapons of the nuclear age.",
        "Category": " History , Military , General",
        "Publisher": "Indiana University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1973"
        }
    },
    {
        "Title": "Secrets of an Irresistible Woman: Smart Rules for Capturing His Heart",
        "Authors": "By McKinney Hammond, Michelle",
        "Description": "Drawn from Scripture, life experiences, and the wisdom of others, this guide, filled with time-tested strategies, helps every reader to become the woman God created her to be--beautiful, desirable, and loving. Reprint.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Dresser",
        "Authors": "By Harwood, Ronald",
        "Description": "",
        "Category": "",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "November",
            "Year": "1981"
        }
    },
    {
        "Title": "Ordinary Women, Extraordinary Sex: Releasing the Passion Within",
        "Authors": "By Scantling, Sandra and Browder, Sue",
        "Description": "A woman's guide to sexual experience that stresses expanding pleasure in all areas of life shows how to release latent sexual energy, making the mind/body connection that leads to fulfillment",
        "Category": " Family & Relationships , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Single Over Thirty",
        "Authors": "By Husband, John D.",
        "Description": "Provides commentaries on the life of single people over the age of thirty.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Talywain Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "I Kissed Dating Goodbye : The Study Guide",
        "Authors": "By Harris, Joshua, Harris, Shannon, and Mahaney, Nicole",
        "Description": "The I Kissed Dating Goodbye Study Guide, based on Joshua Harris's phenomenal bestseller, with over 300,000 copies sold, provides youth with a new resource for living a lifestyle of sincere love, true purity, and purposeful singleness. Honest and practical, this powerful study guide helps teens and young adults remap their romantic lives in the light of God's Word. It also includes healthy challenges to today's cultural assumptions about relationships and provides solid, biblical alternatives to society's norms.From the Trade Paperback edition.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Defending the Cavewoman: And Other Tales of Evolutionary Neurology",
        "Authors": "By Klawans, Harold",
        "Description": "Noted neurologist Harold Klawans presents thirteen thought-provoking clinical tales describing a range of neurological problems and how he figured out what caused them.  Cases include a young girl with arrested language acquisition, a peculiar case of \"painful foot and moving toe syndrome,\" and an aphasic orchestra conductor. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Medical , Neurology",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The New Oxford Book of Victorian Verse (Oxford Books of Verse)",
        "Authors": "By Ricks, Christopher",
        "Description": "The New Oxford Book of Victorian Verse brings to life a great age of poetry which past generations have viewed with condescension because of its supposed prudery, sentimentality, and lack of irony. Christopher Ricks' selection of 560 poems written by 115 different poets offers our generation a wonderful opportunity to reevaluate the Victorians.     Bringing together the best and most inspiring verse written between 1837 and 1901, this marvelous anthology presents inspiring selections by the great figures--Tennyson, Wordsworth, Browning, Swinburne, and Hopkins among them--as well as the less well-known, but equally rewarding, verse by William Barnes, Coventry Patmore, Elizabeth Siddal, and others.  Demonstrating unprecedented respect for the integrity of the poems, Ricks uses excerpts only in cases where the poet provided distinct breaks in a work, and he also reproduces a number of longer masterpieces in their entirety.  Readers will find this anthology a source of delight and surprise as they discover that the Victorians are not so very different from ourselves.",
        "Category": " Photography , Reference",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Beneath the Wheel: A Novel",
        "Authors": "By Hesse, Hermann and Roloff, Michael",
        "Description": "Hans Giebernath lives among the dull and respectable townsfolk of a sleepy Black Forest village. When he is discovered to be an exceptionally gifted student, the entire community presses him onto a path of serious scholarship. Hans dutifully follows the regimen of study and endless examinations, his success rewarded only with more crushing assignments. When Hans befriends a rebellious young poet, he begins to imagine other possibilities outside the narrowly circumscribed world of the academy. Finally sent home after a nervous breakdown, Hans is revived by nature and romance, and vows never to return to the gray conformity of the academic system.",
        "Category": " Fiction , Literary",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Norton Anthology of American Literature",
        "Authors": "By Baym, Nina",
        "Description": "",
        "Category": "",
        "Publisher": "W. W. Norton",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Herbs",
        "Authors": "By Time-Life Books Editorial Staff",
        "Description": "",
        "Category": "",
        "Publisher": "Time-Life, Incorporated",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "Words of War (Time-Life Encyclopedia of Gardening)",
        "Authors": "By Curtis Prendergast, Donald Wyman",
        "Description": "",
        "Category": "",
        "Publisher": "Time Life Medical",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Continual Pilgrimage: American Writers in Paris, 1944-1960",
        "Authors": "By Sawyer-Laucanno, Christopher",
        "Description": "Between 1944 and 1960 a second great wave of American writers took up residence in Paris, seeking the artistically charged atmosphere so pervasive during the Jazz Age. While much has been written about the Lost Generation between the wars, little attention has been paid to their postwar successors as a group. And yet, what a dazzling array of talent was present in Paris during this period! Richard Wright, James Baldwin, William Styron, James Jones, Chester Himes, George Plimpton, John Ashbery, Harry Mathews, Allen Ginsberg, Lawrence Ferlinghetti, Alexander Trocchi, and William Burroughs are among those who flocked to Paris and who flourished through the experience. Indeed, many of these literary wanderers and expatriates produced some of their most important and enduring poetry and fiction during these years, their collective efforts inspiring new creative directions for the second half of the century.The Continual Pilgrimage is a biographical/historical portrait of the friendships and associations they formed, the cross-cultural influences they occasioned, what they discovered, and what they brought back. Christopher Sawyer-Laucanno merges the Paris of glamorous legend with the sometimes starker reality they encountered into a highly entertaining and anecdotal account of writers following a dream and finding a vision.",
        "Category": " Travel , Europe , France",
        "Publisher": "Grove Pr",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Tacky and the Emperor (Tacky the Penguin)",
        "Authors": "By Munsinger, Lynn (ILT) and Lester, Helen",
        "Description": "It’s common knowledge that Tacky was never the best- dressed penguin, but when he and his friends prepare for the arrival of the emperor, Tacky gets carried away and ends up in more than just elegant attire!     Tacky brings his own unique brand of humor and entertainment to the emperor’s visit. Here is another wacky addition to Tacky’s myriad adventures in which friendship, kindness, and laughter always win out! Tacky fans will be carried to new heights of hilarity by this latest Tacky tale.",
        "Category": " Juvenile Fiction , Animals , General",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "11.88",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The New Adventures of Curious George (Curious George Green Light Reader - Level 1)",
        "Authors": "By Rey, H. A. and Rey, Margret",
        "Description": "H. A. Rey and his wife, Margret, first introduced young readers to the big-hearted, fun-loving troublemaker-hero Curious George in 1941. In this two-hundred-page hardcover treasury, Curious George fans will find eight stories based on the popular primate, painted in Rey’s original watercolor and charcoal style: Curious George Goes to a Chocolate Factory (1998), Curious George and the Puppies (1998), Curious George Makes Pancakes (1998), Curious George Feeds the Animals (1998), Curious George Goes to a Movie (1998), Curious George and the Hot Air Balloon (1998), Curious George in the Snow (1998), and Curious George’s Dream (1998). A five-page essay about the author-illustrator team closes this appealing collection of adventures for Curious George fans young and old.For more monkey fun, investigate www.curiousgeorge.com and discover all the latest on Curious George, books, promotions, games, activities, and more!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Ward No. 6 and Other Stories (Barnes & Noble Classics Series)",
        "Authors": "By Chekhov, Anton Pavlovich, Garnett, Constance Black (TRN), and Plante, David (INT)",
        "Description": "&&LDIV&&R&&LDIV&&R&&LI&&RWard No. 6 and Other Stories&&L/I&&R, by &&LSTRONG&&RAnton Chekhov&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R&&LSTRONG&&R&&L/B&&R &&L/DIV&&R&&LDIV&&R&&LSTRONG&&RAnton Chekhov&&L/B&&R invented the modern short story. With writing that is concise, realistic, and evocative, he became a sort of photographer in words, less interested in plot than in the subtleties of mood and atmosphere, and the telling detail. His characters, always vividly drawn, come from all walks of life and often seem to be caught up in a world they don’t quite understand. &&L/DIV&&R&&LP&&REarly in his brief literary career, Chekhov outlined in a letter to his brother his idea of the ingredients of a good short story. Arguing against moral judgments and political, economic, or social commentary, he wrote, “To describe . . . you need . . . to free yourself from the personal expression. . . . Subjectivity is a terrible thing.” Instead, he favored objectivity, truthfulness, originality, compassion, and brevity. Although his writing developed and matured, he remained largely faithful to these principles. &&L/P&&R&&LP&&RThis new selection of twenty-three stories explores the entire range of Chekhov’s short fiction, from early sketches, such as “The Cook’s Wedding” (1885) and “On the Road” (1886) to late works, such as “In the Ravine” (1900) and “The Bishop\" (1902). &&LI&&RWard No. 6 and Other Stories&&L/I&&R includes some of his most popular tales, such as the title story and “The Lady with the Dog” (1899), as well as several lesser-known works, no less masterful in their composition. &&L/P&&R&&LP&&R&&LB&&RDavid Plante&&L/B&&R is a Professor of Writing at Columbia University. He is the author of many novels, including &&LI&&RThe Ghost of Henry James, The Family&&L/I&&R (nominated for the National Book Award), and &&LI&&RThe Woods&&L/I&&R. He has been a contributor to &&LI&&RThe New Yorker, Esquir&&L/I&&Re, and &&LI&&RVogue&&L/I&&R, and a reviewer and features writer for the &&LI&&RNew York Times Book Review&&L/I&&R. &&L/P&&R",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Barnes & Noble Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    }
]