[
    {
        "Title": "Grandma's Casseroles: One-Dish Meals for Breakfast, Lunch and Dinner",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Fisicalbook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Field Guide to the Nature Conservancy: An Insider's Handbook to Places and Projects around the World",
        "Authors": "By 1886765103",
        "Description": "",
        "Category": "",
        "Publisher": "The Nature Conservancy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "My Enemy, My Brother: Men and Days of Gettysburg",
        "Authors": "By Persico, Joseph E.",
        "Description": "\"An eloquent documentary, forming the facts into a mosaic that shows the terribleness of war. . . . Striking, poignant, tragic.\"--New York TimesIn July 1863 the invading Army of Northern Virginia, confident from its victory at Chancellorsville, unexpectedly encountered the Army of the Potomac, still without a general Lincoln could trust, at a small town in Pennsylvania. And there, among the verdant hills, rich fields, and sparkling brooks around Gettysburg, the two armies slaughtered each other in fearful numbers. My Enemy, My Brother is a remarkable re-creation of that battle, told not as military strategists have told it, but the way soldiers, doctors, shopkeepers, farmers, and wives lived it. Drawn from the letters, diaries, and memoirs of the people at Gettysburg, Persico's powerful work chronicles the passions and beliefs, the day-to-day routines, the pain and the terror of those caught up in the epic conflict that, for thousands, became their last role on earth.",
        "Category": " History , Military , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "My Book About God",
        "Authors": "By Varga, Judith",
        "Description": "",
        "Category": "",
        "Publisher": "Wonder Books",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "Happy Halloween! (Max and Ruby)",
        "Authors": "By Wells, Rosemary",
        "Description": "Little brother Max is determined to scare Ruby, but can?t seem to do the trick. Will Max be able to spook Ruby before Halloween is over? Based on the successful Max & Ruby TV series, this seasonal story will be a must have for Max & Ruby fans and includes foil on the cover!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Children of the Night: A Diana Tregarde Investigation",
        "Authors": "By Lackey, Mercedes",
        "Description": "Rock band Wanderlust is about to hit it big, guitarist Dave Kendall is sure of that. They're playing better venues, in front of bigger crowds-and the people showing up at the after parties are increasingly good-looking and cool. Some even radiate power, like \"Master\" Jeffries, the tall, saturnine man who seems to have some sort of weird control over Dave's fellow bandmates.But Dave's too tired to pay much attention to Jeffries. He's tired a lot, lately, and making music isn't as much fun as it used to be. Probably he's just working-and partying-too hard.Luckily, Dave has a friend who takes what's happening to him very seriously. Diana Tregarde is a practicing witch and a Guardian of the Earth. It's her job to keep an eye on innocents like Dave and make sure they stay out of trouble and don't become someone's lunch.Jeffries has been on Diana's hit list since she first spotted him pursuing a young Romany. Di wasn't fast enough to stop him, but the Rom have their own protector-a dashing, charming, very attractive vampire named Andre Le Brel. Together, the witch and the vampire face Jeffries and his evil minions in a battle for the soul of rock 'n' roll... in Children of the Night by Mercedes Lackey.",
        "Category": "",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Noah's Compass: A Novel",
        "Authors": "By Tyler, Anne",
        "Description": "Liam Pennywell, who set out to be a philosopher and ended up teaching fifth grade, never much liked the job at that run-down private school, so early retirement doesn’t bother him. But he is troubled by his inability to remember anything about the first night that he moved into his new and spare condominium on the outskirts of Baltimore. All he knows when he wakes up the next day in the hospital is that his head is sore and bandaged. His effort to recover the moments of his life that have been stolen from him leads him on an unexpected detour. What he needs is someone who can do the remembering for him. What he gets is . . . well, something quite different.",
        "Category": " Fiction , Psychological",
        "Publisher": "Ballantine Books Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The Cat in the Hat",
        "Authors": "By Dr. Seuss",
        "Description": "",
        "Category": "",
        "Publisher": "I Can Read It All By Myself Beginner Books/  Random House",
        "Price Starting With ($)": "49.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Happy Birthday : Cheerful Wishes, Warm Thoughts, and Delightful Recipes That Celebrate Your Special Day",
        "Authors": "By Ohrbach, Barbara Milo",
        "Description": "In Happy Birthday, Barbara Milo Ohrbach, best-selling author of The Scented Room and A Token of Friendship, celebrates the day that has a very special meaning for us all. Here are cheerful wishes and warm thoughts -- from Will Rogers and Helen Hayes to Jack Benny and Edith Wharton -- that express the various feelings many of us have about the marking of one more year. Also included in this unique little birthday gift book are favorite poems; the official birthstone, flower, color, and astrological sign for each month; and easy recipes for frosted birthday cakes and other irresistible treats such as Quick Party Pizza, Sunshine Cake, and Ice-cream Roll.\"Age is strictly a case of mind over matter. If you don't mind, it doesn't matter.\"--Jack Benny\"We are always the same age inside.\"--Gertrude Stein\"It takes a long time to grow young.\"--Pablo Picasso\"Wrinkles should merely indicate where smiles have been.\"--Mark TwainCharmingly illustrated with nostalgic birthday cards that celebrate the occasion, Happy Birthday is just the right gift to tie up with ribbons and give to someone on their special day.",
        "Category": " Social Science , Holidays (non-religious)",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Women Make the Best Salesmen: Isn\u0092t it Time You Started Using their Secrets?",
        "Authors": "By Brem, Marion Luna",
        "Description": "Inc. magazine Entrepreneur of the Year and International Automotive Hall of Fame member Marion Luna Brem reveals the strategies she learned that have made her successful in sales—and in life. As Brem makes clear, we’re all  salesmen in one way or another. Whenever we try to make a good first impression or persuade someone else of our point of view, we’re selling ourselves. Brem shows how to do it better.It was the definition of a “living nightmare.” Marion Luna Brem, a thirty-year-old mother of two, had just been told the most dreadful words anyone could hear: “You have two to five years to live.” She had no job. No health insurance. Her marriage would collapse under the stress of her treatment. And her most pressing concern: How do I pay next month’s rent?“You’ve always been good with people. Why don’t you try sales?” her best friend suggested.After sixteen fruitless job interviews, Brem landed her first major “sale” – a job as a car salesman. Within two months, Brem had become salesperson of the month, and by the end of her first year, salesperson of the year. Four and a half years after selling her first car, Brem bought her own dealership, and in the next decade went on to open additional dealerships and businesses.In WOMEN MAKE THE BEST SALESMEN, Marion Luna Brem reveals countless unconventional sales stratagems she discovered, refined, and applied to build a multimillion dollar enterprise. As she makes abundantly clear, the skills one learns in sales are transferable to all walks of life. “The fact is we are all ‘salesmen’ – whether we are selling ourselves at a job interview or operating a register at a department store, trying to get our children into a special program or looking for a lifelong companion. And women, with their natural social skills and acute emotional antennae, have natural advantages both sexes can learn from.” Using examples from her own business and personal life, Brem reveals how to create a niche and name for yourself, how to turn a no into a yes, how to persuade even the most difficult people, how to open new doors, and how to close deals",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Doubleday Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Complete Book of 400 Soups",
        "Authors": "By Anne Sheasby",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House; Unstated edition (2007-01-01)",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Best loved poems of all time (Hallmark editions)",
        "Authors": "By Cunningham, Gail Harano",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark Cards",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Sparks of the Divine: Finding Inspiration in Our Everyday World",
        "Authors": "By Leder, Drew",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Sorin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Stone That Rolled Away: Living the Miracle of Easter",
        "Authors": "By Guideposts",
        "Description": "",
        "Category": "",
        "Publisher": "Guideposts",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Legend of Thunderfoot",
        "Authors": "By bill-wallace",
        "Description": "",
        "Category": "",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Count The Puppies",
        "Authors": "By Carolyn Dee",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Dynamic Duos (Sports Illustrated Kids)",
        "Authors": "By MATT HIGGINS",
        "Description": "",
        "Category": "",
        "Publisher": "Sports Illustrated Kids",
        "Price Starting With ($)": "6.61",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Man in Africa",
        "Authors": "By Turnbull, Colin M.",
        "Description": "",
        "Category": "",
        "Publisher": "Anchor Doubleday, 1977",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Making of the President 1960",
        "Authors": "By Theodore H. White",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1967"
        }
    },
    {
        "Title": "Resort to Murder",
        "Authors": "By Hughes, Mary Ellen",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Avalon Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Lifeviews: Understanding the Ideas That Shape Society Today (A Crucial Questions Book)",
        "Authors": "By R. C. Sproul",
        "Description": "Offers a Christian perspective on the secular philosophies which influence modern American life, and discusses the Christian's attitude towards economics, science, art, literature, and government",
        "Category": "",
        "Publisher": "Fleming H. Revell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "When Will This Cruel War Be Over? (Dear America Series) (Dear America Series)",
        "Authors": "By Denenberg, Barry",
        "Description": "",
        "Category": "",
        "Publisher": "Scholastie",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Sheep in a Shop (Sheep in a Jeep)",
        "Authors": "By Shaw, Nancy and Apple, Margot (ILT)",
        "Description": "The \"lovable muttonheads\" are off to the store in search of the perfect birthday gift in this latest in the sheep series of rhymed read-alouds.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Skindiver's Bible (Outdoor Bible Series)",
        "Authors": "By Lee, Owen",
        "Description": "A guide to the selection and use of equipment, physiological considerations, elementary techniques, and safety precautions for scuba and snorkel diving",
        "Category": " Sports & Recreation , Reference",
        "Publisher": "Main Street Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "The Polysyllabic Spree: A Hilarious and True Account of One Man's Struggle with the Monthly Tide of the Books He's Bought and the Books He's Been Meaning to Read",
        "Authors": "By Hornby, Nick",
        "Description": "\"Books are, let's face it, better than everything else,\" writes Nick Hornby in his \"Stuff I've Been Reading\" column in The Believer. \"If we played cultural Fantasy Boxing League, and made books go 15 rounds in the ring against the best that any other art form had to offer, then books would win pretty much every time. Go on, try it. The Magic Flute v. Middlemarch? Middlemarch in six. The Last Supper v. Crime and Punishment? Fyodor on point And every now and again you'd get a shock, because that happens in sport, so Back to the Future III might land a lucky punch on Rabbit, Run; but I'm still backing literature 29 times out of 30.\" This book collects Hornby's popular columns in a single, artfully illustrated volume with selected passages from the novels, biographies, collections of poetry, and comics under discussion.",
        "Category": " Literary Criticism , European , English, Irish, Scottish, Welsh",
        "Publisher": "Believer Magazine",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Origin of Species: By Means of Natural Selection or the Preservation of Favoured Races in the Struggle for Life (Mentor)",
        "Authors": "By Darwin, Charles",
        "Description": "The classic book that changed the course of scientific inquiry and exploded some of humankind's most enduring myths is reissued with a special introduction by Sir Julian Huxley. Reissue.",
        "Category": " Social Science , General",
        "Publisher": "Mentor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Bringing Out the Best in Teachers: What Effective Principals Do",
        "Authors": "By Blase, Joseph and Kirby, Peggy C.",
        "Description": "The authors show how to develop open, honest, and sincere relationships with teachers and how it is possible to create a school environment that focuses on the social and educational welfare of students.",
        "Category": " Education , Educational Psychology",
        "Publisher": "Corwin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Lesson: A Fable for Our Times",
        "Authors": "By Pearson, Carol Lynn and Peterson, Kathleen B.",
        "Description": "Original edition has sold more than 85,000 copies Told in the charming, straightforward tradition of a classic fable, and illustrated as richly as a favorite children’s story, Pearson’s modern-day tale will inspire every adult facing his or her own life challenges.",
        "Category": " Fiction , Religious",
        "Publisher": "Gibbs Smith",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "No Sweat!: A Guide to 50 TV Sports",
        "Authors": "By Wale, Michael",
        "Description": "A guide to all those strange and wonderful sports that confuse you on the TV—as well as the ones you thought you knew everything about. The book includes jargon, rules of play, scoring systems, famous players, places, unusual tactics, gossipy facts, and much more.",
        "Category": " Juvenile Nonfiction , Sports & Recreation , General",
        "Publisher": "Macmillan UK",
        "Price Starting With ($)": "5.98",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "So You Want to Be a Mortgage Broker",
        "Authors": "By Kamadia, Ameen",
        "Description": "",
        "Category": " Business & Economics , Banks & Banking",
        "Publisher": "Kamrock Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Houghton Mifflin Reading: The Nation's Choice: Theme Paperbacks, On-Level Grade 3.2 Theme 6 - The Big Idea",
        "Authors": "By Houghton Mifflin Company (COR)",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , Reading & Phonics",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "11.88",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Life's Little Book Of Wisdom For Friends",
        "Authors": "By Barbour Publishing (NA)",
        "Description": "",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Casino (TM) Magazine's Play Smart and Win: How to Beat Most Popl Casino Games",
        "Authors": "By Royer, Victor H.",
        "Description": "A guide to what every gambler needs to know to be a winner at all types of games includes tips for smart plays, specific, easy-to-remember instructions, and entertaining success stories to help high rollers play their cards right. Original.",
        "Category": " Games , Gambling , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Craftsmanship and Character: A History of the Vinson & Elkins Law Firm of Houston, 1917-1997 (Studies in the Legal History of the South Ser.)",
        "Authors": "By Hyman, Harold M.",
        "Description": "This pioneering work by one of the country's leading legal historians is perhaps the most complete history ever written of a major American multinational law firm. Granted unprecedented access to the private files of the Vinson & Elkins firm in Houston, Texas, Harold M. Hyman has crafted a unique and detailed history and analysis of the founding, growth, and operation of a prototypical multinational firm.The history of Vinson & Elkins both mirrors and contrasts with that of many othe",
        "Category": " Law , Legal History",
        "Publisher": "University of Georgia Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Another Country: Navigating the Emotional Terrain of Our Elders",
        "Authors": "By Pipher, Mary Bray",
        "Description": "An exploration by the best-selling author of Reviving Ophelia into the period of transition that marks the beginnings of old age offers a compassionate and wise view of ways to build communication between generations, presenting insights into empathy and understanding. 80,000 first printing. Tour.",
        "Category": " Family & Relationships , Eldercare",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Very First Christmas (The Beginner's Bible)",
        "Authors": "By Zondervan",
        "Description": "The Very First Christmas introduces children to one of the most wonderful stories of all time, the birth of Jesus.  Using the popular and vibrant artwork from The Beginner’s Bible, children will learn the events leading up to Jesus’ birth and his miraculous arrival.  By the end of the story, children will understand why we celebrate this special day.  This low-cost picture book is great for outreach events and distributing at Christmas celebrations.The Beginner’s Bible is the bestselling story Bible with over 7 million copies sold.  It’s full of life and fun!",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Zonderkidz",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Great Commission New Testament",
        "Authors": "By holman bible",
        "Description": "",
        "Category": "",
        "Publisher": "Holman Bible",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The synagogue (JPS popular Judaica library)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Jewish Publication Society of America",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "How Emily Blair Got Her Fabulous Hair",
        "Authors": "By Priceman, Marjorie (ILT), Beroza, Susan Garrison, and Garrison, Susan",
        "Description": "Young Emily Blair is unhappy with her straight hair, until she finds just the right style for it",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Wine Journal",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Compass Marketing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Cable Car and the Dragon",
        "Authors": "By Caen, Herb and Byfield, Barbara Ninde (ILT)",
        "Description": "This is the rollicking tale of the adventures of Charlie, the youngest cable car. Only sixty years old, he is tired of the same old rut. One night as he's puffing himself up Nob Hill, he hears a lot of excitement down below: Chinese New year! Suddenly, Charlie takes a right turn at Jackson Street, rather than the left he has taken for sixty years, and he finds himself in the middle of the parade. There he meets a friendly dragon named Chu Chin Chow, who is bored with his job. Charlie treats Chu to a cable car ride that looks as if it will end in a disastrous plunge into the San Francisco Bay--unless a miracle occurs.",
        "Category": " Juvenile Fiction , People & Places , United States , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Spoon River Anthology (Signet Classics)",
        "Authors": "By Masters, Edgar Lee",
        "Description": "The dead arise from their sleep in the cemetery of a small town to tell their individual stories about an entire community caught in a web of scandal, sin, and vice in the early twentieth century",
        "Category": " Fiction , Classics",
        "Publisher": "Signet Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "James McNair's Salmon Cookbook",
        "Authors": "By McNair, James",
        "Description": "This bounty of mouth-watering recipes includes salmon prepared by poaching, steaming, simmering, baking, roasting, sauteing, grilling, barbecuing, broiling, smoking, and curing. There are also dishes that use up leftover cooked fish. A wide range of hot and cold sauces round out the book. Mix and match them with various salmon preparations according to whim.",
        "Category": " Cooking , Specific Ingredients , Seafood",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Black Writer's and the American Civil War",
        "Authors": "By Long, Richard A.",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Ashes and Lace (Song of Erin #2)",
        "Authors": "By Hoff, B. J.",
        "Description": "Value priced! B. J. Hoff, the best-selling author of the highly acclaimed Emerald Ballad series, continues her inspiring Irish-American saga begun in Cloth of Heaven with this epic sequel—a story of two unlikely families joined by suffering and secrets, virtue and violence, courage, faith . . . and the mysterious hand of God. Along with Cloth of Heaven, this book will draw readers with its attractive cover and larger-than-normal size, celebrating B. J. Hoff as the premier writer of historical fiction in CBA today.Song of Erin #2: Ashes and Lace",
        "Category": " Fiction , Religious",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "DK 101 Barbecue (101 Essential Tips)",
        "Authors": "By Spieler, Marlene",
        "Description": "From preparing the fire to recipes for special marinades, this step-by-step guide breaks down barbecuing skills into 101 easy tips.  Handy guides that use pictures to give readers the information they need, 101 Essential Tips feature comprehensive coverage, beautiful full-color images, and straightforward, practical information on a wide variety of subjects. Every point can be absorbed quickly and easily with 101 authoritative tips that will make anyone an expert in an instant.",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "DK",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Fix-It and Enjoy-It 5-Ingredient Recipes: Quick And Easy--For Stove-Top And Oven!",
        "Authors": "By Good, Phyllis Pellman",
        "Description": "Announcing a third volume in the bestselling Fix-It and Enjoy-It cookbook series&#151;Fix-It and Enjoy-It 5-Ingredient Recipes: Quick and Easy for Stove-Top and Oven! Phyllis Pellman Good, author of the wildly popular Fix-It and Forget-It and Fix-It and Enjoy-It cookbooks, continues her commitment to making it easy to cook and to eat at home. \"Nothing quite replaces the satisfaction of cooking, and then eating around the table together with family or friends. But who has time? And what if you lack confidence in your cooking skills? \"Fix-It-and Enjoy-It 5-Ingredient Recipes is my brand new solution to both questions,\" says Good. \"This cookbook wonder is a treasury of more than 700 make-it-again recipes, which I've gathered from great home cooks scattered across the country. They are homey favorites for every day!\"           Fix-It and Enjoy-It 5-Ingredient Recipes&#151; calls for ingredients which you already have at home or can easily find in the grocery store; includes the Prep and Cooking Times for each of the 700+ easy-to-prepare recipes; offers recipes that work. They're satisfying delicious favorites from the kitchens of selected home cooks from across the country; is a \"cousin\" to the beloved Fix-It and Forget-It Cookbook series which has already sold more than 8.8 million copies! You can love to cook with Fix-It and Enjoy-It 5-Ingredient Recipes! It is packed with 700 quick- and easy-to-prepare dishes that will bring eager family and friends to your dinner table, and send them away happy!Skyhorse Publishing, along with our Good Books and Arcade imprints, is proud to publish a broad range of cookbooks, including books on juicing, grilling, baking, frying, home brewing and winemaking, slow cookers, and cast iron cooking. We’ve been successful with books on gluten-free cooking, vegetarian and vegan cooking, paleo, raw foods, and more. Our list includes French cooking, Swedish cooking, Austrian and German cooking, Cajun cooking, as well as books on jerky, canning and preserving, peanut butter, meatballs, oil and vinegar, bone broth, and more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Good Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Claws of the Bear: The History of the Red Army from the Revolution to the Present",
        "Authors": "By Moynahan, Brian",
        "Description": "Chronicles the history of the Red Army, from the Revolution of 1917, to their part in the battles of World War II, to their present-day position as an omenously powerful enterprise",
        "Category": " Political Science , General",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Wacky soccer facts to kick around",
        "Authors": "By Sweeny, Sheila",
        "Description": "",
        "Category": "",
        "Publisher": "Sports Illustrated for Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Matagorda",
        "Authors": "By L'Amour, Louis",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "The Last Apprentice: Curse of the Bane (Book 2) (Last Apprentice, 2)",
        "Authors": "By Delaney, Joseph",
        "Description": "The Spook and his apprentice, Thomas Ward, rid the county of witches, ghosts, boggarts, and other creatures of the dark. And there's some unfinished business to attend to in Priestown. Deep in the catacombs lurks a creature the Spook has never been able to defeat; a force so evil that the whole county is in danger. The Bane!But the Bane is not their only enemy. The Quisitor arrives, intent on hunting down anyone who meddles with the dark. Thomas Ward and the Spook must prepare for the battle of their lives.",
        "Category": " Young Adult Fiction , Fantasy , Dark Fantasy",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Look Up What Can I See (Sight Word Readers)",
        "Authors": "By Williams, Rozanne Lanczak",
        "Description": "",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Creative Teaching Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Hamlet (Barnes & Noble Shakespeare)",
        "Authors": "By Shakespeare, William and Dolven, Jeff (EDT)",
        "Description": "Hamlet, by William Shakespeare, is part of the Barnes & Noble Shakespeare series.  This unique series features newly edited texts prepared by leading scholars from America and Great Britain, in collaboration with one of the world’s foremost Shakespeare authorities, David Scott Kastan of Columbia University. Together they have produced texts as faithful as possible to those that Shakespeare wrote. Each volume in the Barnes & Noble Shakespeare includes:New Scholarship – Premiere scholars introduce each play with contemporary scholarship. An essay on editing the text provides an in-depth look at the quartos and folios used in the edition. Contextualizing Essays – Essays on Shakespeare’s England, language, and life, along with essays on performing Shakespeare and significant performances frame the play in both historical and theatrical context for readers. A look at the lasting influence of the play on music, art, film, and dance creates an interdisciplinary framework with which to approach the play. Better Notes – Through one-word margin definitions, facing-page glosses, and longer end notes after the play, our innovative approach to notes pulls readers away from the text fewer times while providing them with more information and comprehensive analysis. Further Reading – An annotated bibliography of titles, hand-selected by the introduction author, takes readers beyond the edition for further reading.Shakespeare’s compelling treatment of guilt and revenge in Hamlet has fascinated playgoers and readers for 400 years. The editor, Jeff Dolven, brings a professional poet’s eye to the introduction and notes, providing a uniquely informative take on the play.",
        "Category": " Drama , European , English, Irish, Scottish, Welsh",
        "Publisher": "Barnes & Noble Shakespeare",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Frames of Reference for Pediatric Occupational Therapy",
        "Authors": "By Hinojosa, Jim (EDT) and Kramer, Paula",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Williams & Wilkins",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Building Your Mate's Self-Esteem: Personal Study Guide",
        "Authors": "By Rainey, Dennis, Rainey, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "Regal Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1981"
        }
    },
    {
        "Title": "Is This Any Way To Run A Democratic Election?, 3rd Edition",
        "Authors": "By Wayne, Stephen J.",
        "Description": "Wayne (government, Georgetown U.) reviews the controversies and debates surrounding the American electoral process and connects them to general questions of democratic theory in a manner intended to be accessible to the average reader. Individual chapters explore issues of suffrage and turnout, democratic representation, money in the electoral process, the media, and political parties. He also discusses the mechanics of the electoral process--the nominating process and the general election--and considers the impact of elections on governing. He has updated the new edition in order to consider issues of recent concern, including the Electoral College-popular vote discrepancy, fraud and voting irregularities, lack of competitiveness in congressional elections, and misinformation in political advertising and the news media. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "C.Q. Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "How To Draw Indian Arts & Crafts",
        "Authors": "By Meiczinger, John (ILT)",
        "Description": "Shows how to draw teepees, wigwams, longhouses, Indian headdresses, peace pipes, bows and arrows, tomahawks, canoes, toboggins, wampum, baskets, pottery, totem poles, masks, and Kachina dolls",
        "Category": " Juvenile Nonfiction , Art , Drawing",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Coaching Youth Basketball (Coaching Youth Sports)",
        "Authors": "By American Sport Education Program",
        "Description": "",
        "Category": " Sports & Recreation , Basketball",
        "Publisher": "Human Kinetics (Trade)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Oxford Dictionary Of Quotations - Third Edition",
        "Authors": "By Oxford University Press",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "For Time & Eternity (Sister Wife)",
        "Authors": "By Pittman, Allison",
        "Description": "All Camilla Deardon knows of the Mormons camping nearby is the songs she hears floating on the breeze. Then she meets one of them—a young man named Nathan Fox. Never did she imagine he would be so handsome, so charming, especially after Mama and Papa’s warnings to stay away. Though she knows she should obey her parents, Camilla can’t refuse her heart. But even Nathan’s promises cannot prepare her for what she will face in Utah.",
        "Category": " Fiction , Christian , Historical",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Heart Healthy Handbook",
        "Authors": "By FC&A Medical Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "FC&A",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "How Our Bible Came to Us Back to the Bible",
        "Authors": "By Herklots, H. G. G",
        "Description": "",
        "Category": "",
        "Publisher": "A Galaxy Book/ Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "American Express Pocket Guide to England and Wales (American Express Pocket Travel Guides)",
        "Authors": "By Tomes, John",
        "Description": "Briefly describes the history and culture of England and Wales, looks at the major towns and regions, and offers advice on sightseeing, shopping, dining, and entertainment",
        "Category": " Travel , General",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "365 Things to Make and Do: Hundreds of Ideas for Hand-crafted Models, Toys, Useful Gifts, and Games",
        "Authors": "By Bolton, Vivienne",
        "Description": "",
        "Category": " Juvenile Nonfiction , Crafts & Hobbies",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "How to Work With the One You Love and Live to Tell About It",
        "Authors": "By Partow, Donna and Partow, Cameron",
        "Description": "",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "1001 Questions and Answers",
        "Authors": "By Simon Mugford, Alexander Gordon Smith",
        "Description": "",
        "Category": "",
        "Publisher": "Books Are Fun, Ltd.",
        "Price Starting With ($)": "6.09",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Blue and White China: The Connoisseur's Guide (Christie's Collectibles)",
        "Authors": "By Tippet, Paul",
        "Description": "The tradition of decorating white china with a blue underglaze can be traced back as far as the 14th century. First produced in the Far East, this distinctive china was eventually exported - and even made - all over the world. The book takes a look at the history of the pottery and the styles of decoration, from the ancient Ming dynasty to 19th-century Spode, from Florentine mythological beasts to the popular willow pattern.",
        "Category": " Antiques & Collectibles , Porcelain & China",
        "Publisher": "Bulfinch Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Norton Anthology of American Literature: Whitman and Dickenson",
        "Authors": "By Baym, Nina (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Georgia's Kitchen",
        "Authors": "By Nelson, Jenny",
        "Description": "At thirty-three, talented chef Georgia Gray has everything a woman could want—the top job at one of Manhattan’s best restaurants; a posse of smart and savvy gal pals who never let her down; and a platinum-set, cushion-cut diamond engagement ring courtesy of Glenn, the handsome entertainment lawyer who Georgia’s overbearing mother can’t wait for her to marry. The table is set for the ambitious bride-to-be until a scathing restaurant review destroys her reputation. To add salt to her wounds, Glenn suddenly calls off the wedding. Brokenhearted, Georgia escapes to the Italian countryside, where she sharpens her skills at a trattoria run by a world-class chef who seems to have it all—a devoted lover, a magnificent villa, and most important, a kitchen of her own. Georgia quells her longings with Italy’s delectable offerings: fine wine, luscious cheeses, cerulean blue skies, and irresistible Gianni—an expert in the vineyard and the bedroom. So when Gianni tempts Georgia to stay in Italy with an offer no sane top chef could refuse, why can’t she say yes? An appetite for something more looms large in Georgia’s heart – the desire to run her own restaurant in the city she loves. But having left New York with her career in flames, she’ll need to stir up more than just courage if she’s to realize her dreams and find her way home.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "House on the Rock",
        "Authors": "By Sell, Charles",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Scripture Press Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "The Country Bread Cookbook From Ideals",
        "Authors": "By Darlene Kronschnabel",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "Wee Sing and Play book (reissue)",
        "Authors": "By Beall, Pamela Conn, Nipp, Susan Hagen, and Klein, Nancy Spence (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , Religious , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Black & Decker The Complete Guide to Landscape Construction: 60 Step-by-step Projects for Creating a Perfect Landscape (Black & Decker Complete Guide)",
        "Authors": "By Creative Publishing International",
        "Description": "Once the arena of professional contractors, major landscape construction projects are now achievable by ordinary homeowners armed with new DIY-friendly tools and materials, the right information and the willingness to get their hands dirty.Black & Decker The Complete Guide to Landscape Construction is designed to guide the DIYer of any skill level through 60 of the most significant \"hardscape\" projects for the yard and garden. Projects range from basic earthmoving and yard shaping to creating privacy fences, pathways and watercourses, and everything in between. The book also features the latest in tools and techniques, as well as the latest landscaping products and materials popular with today's homeowners, including vinyl fencing, tumbled retaining wall block and outdoor fireplaces.",
        "Category": " House & Home , Design & Construction",
        "Publisher": "Cool Springs Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "More About Paddington (Paddington Bear)",
        "Authors": "By Bond, Michael and Fortnum, Peggy (ILT)",
        "Description": "This new revised edition of the third book about Paddington captures all the playfulness of the incorrigible little bear. Living with the Brown family in London, Paddington has a talent for getting into trouble. His intentions are always the best, but he is seldom far from disaster. While his independent spirit and curious nature often get him into sticky situations, Paddington is always loved for the cheer he brings, and his stories have been a source of delight for young readers ever since he first appeared on the scene more than thirty years ago. Now, in an updated edition with a delightful new jacket by Diane DeGroat, Paddington is sure to capture the hearts of a new generation of children.",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "One-Dish Collection - 3 Cookbooks in 1 - Featuring: Hearty Soups & Stews, French's One-Dish Meals, All-Time Favorite Casseroles",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Girl Who Fell From the Sky",
        "Authors": "By Durrow, Heidi W.",
        "Description": "Rachel, the daughter of a Danish mother and a black G.I., becomes the sole survivor of a family tragedy after a fateful morning on their Chicago rooftop.  Forced to move to a new city, with her strict African American grandmother as her guardian, Rachel is thrust for the first time into a mostly black community, where her light brown skin, blue eyes, and beauty bring a constant stream of attention her way. It’s there, as she grows up and tries to swallow her grief, that she comes to understand how the mystery and tragedy of her mother might be connected to her own uncertain identity.  This searing and heartwrenching portrait of a young biracial girl dealing with society’s ideas of race and class is the winner of the Bellwether Prize for best fiction manuscript addressing issues of social justice.",
        "Category": " Fiction , African American , General",
        "Publisher": "Algonquin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Lament: The Faerie Queen's Deception",
        "Authors": "By Stiefvater, Maggie",
        "Description": "Sixteen-year-old Deirdre Monaghan is a painfully shy but prodigiously gifted musician. She's about to find out she's also a cloverhandâ??one who can see faeries. Deirdre finds herself infatuated with a mysterious boy who enters her ordinary suburban life, seemingly out of thin air. Trouble is, the enigmatic and gorgeous Luke turns out to be a gallowglassâ??a soulless faerie assassin. An equally hunkyâ??and equally dangerousâ??dark faerie soldier named Aodhan is also stalking Deirdre. Sworn enemies, Luke and Aodhan each have a deadly assignment from the Faerie Queen. Namely, kill Deirdre before her music captures the attention of the Fae and threatens the Queen's sovereignty. Caught in the crossfire with Deirdre is James, her wisecracking but loyal best friend. Deirdre had been wishing her life weren't so dull, but getting trapped in the middle of a centuries-old faerie war isn't exactly what she had in mind . . . Lament is a dark faerie fantasy that features authentic Celtic faerie lore, plus cover art and interior illustrations by acclaimed faerie artist Julia Jeffrey. FROM THE AUTHOR OF THE NEW YORK TIMES BESTSELLING NOVEL SHIVER",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Flux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "A Promise of Hope (Kauffman Amish Bakery)",
        "Authors": "By Clipston, Amy",
        "Description": "Take a trip to Bird-in-Hand, Pennsylvania, where you’ll meet the women of the Kauffman Amish Bakery in Lancaster County. As each woman’s story unfolds, you will share in her heartaches, trials, joys, dreams … and secrets. You’ll discover how the simplicity of the Amish lifestyle can clash with the “English” way of life—and the decisions and consequences that follow. Most importantly, you will be encouraged by the hope and faith of these women, and the importance they place on their families. In A Promise of Hope, the second installment in the Kauffman Amish Bakery series, bestselling author Amy Clipston continues to unfold the tensions, loves, and faith of the inhabitants of Bird-in-Hand, Pennsylvania, and the family bakery that serves as an anchor point for the series. When Sarah Troyer tragically loses her husband Peter, she is left to raise infant twins alone. Overwhelmed and grieving, she lives with her parents in the Amish community of Bird-in-Hand, Pennsylvania. Sarah is taken completely by surprise when a stranger arrives claiming connections to Peter’s past—Peter had told her he was an orphan with no family. From Luke, she learns her husband hid a secret life, one with ramifications that will change her own. Sarah’s family, concerned for her and the future of her twins, encourages her to marry again. It should make sense … but Sarah’s heart says no. She feels trapped. Should she marry a man she doesn’t love? Or discover if her growing interest in Luke can be trusted? A Promise of Hope is filled with surprising twists that will grip you to the very last words.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Antiques and Their History",
        "Authors": "By Buckley, L.J.",
        "Description": "",
        "Category": "",
        "Publisher": "Buckley of Binghamton",
        "Price Starting With ($)": "5.84",
        "Publish Date": {
            "Month": "January",
            "Year": "1927"
        }
    },
    {
        "Title": "The Bantam Illustrated Guide to Early American Furniture",
        "Authors": "By Davidson, Marshall B",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Boston Red Sox: Yesterday & Today",
        "Authors": "By Nick Cafardo",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Time and Money Workbook (Disney Adventures in Learning) Grade 2",
        "Authors": "By disney-learning",
        "Description": "",
        "Category": "",
        "Publisher": "Bendon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Oxford Book of Modern Fairy Tales",
        "Authors": "By Lurie, Alison (EDT)",
        "Description": "The stories of magic and transformation that we call fairy tales are among the oldest known forms of literature, and many the most popular.  \"Jack and the Beanstalk,\" \"Sleeping Beauty,\" \"Little Red Ridinghood\"--these ageless tales seem to have been written an almost magically long time ago. Yet fairy tales are still being created to this very day.  And while they are principally directed to children and have child protagonists, these modern fairy tales, like the classics, have messages to those of all ages.     In The Oxford Book of Modern Fairy Tales, Alison Lurie has collected forty tales that date from the late nineteenth century up to the present.  Here are trolls and princesses, magic and mayhem, morals to be told and lessons to be learned--all the elements of the classic fairy tale, in new and fantastical trappings. In Charles Dickens's \"The Magic Fishbone,\" we find an unusually pragmatic princess who uses her one wish only after she has tried to solve her family's problems through hard work. Angela Carter's \"The Courtship of Mr. Lyon\" is a \"Beauty and the Beast\" tale with a contemporary twist, in which Beauty leaves Beast to live the high life, becoming a society brat who \"smiled at herself in mirrors too much.\"  And in T.H. White's \"The Troll,\" we find out how his father killed the troll that tried to eat him.     In these enchanting pages we also see how modern writers have taken the classic fairy tale and adapted it to their times in a variety of ways. Francis Browne, for example, takes a poke at Victorian standards of beauty in \"The Story of Fairyfoot,\" about a young prince who is cast out of the kingdom of Stumpinghame because, unlike the fashion of the town, his feet are too small.  Some writers, such as Ursula Le Guin, have taken familiar myths and turned them upside down.  In Le Guin's \"The Wife's Story,\" a mother sees the horrible transformation of her husband into \"the hateful one\", and then watches her sister and neighbors mob and kill this \"creature whose hair had begun to come away all over his body...the eyes gone blue...staring at me out of that flat, soft, white face.\"  And L.F. Baum's \"The Queen of Quok,\" contains a castle and royal characters in a kingdom run by common sense and small-town American values.  At one point the boy king of Quok has to borrow a dime from his counsellor to buy a ham sandwich, and greed transforms his young queen-to-be into a haggard old woman.     With tales from the likes of Nathaniel Hawthorne, Oscar Wilde, Carl Sandburg, James Thurber, Donald Barthelme, Louise Erdrich, and many more, The Oxford Book of Modern Fairy Tales brings us through the modern-day world of the supernatural, the mystical, the moral, and reminds us that fairy tales are still very much alive.",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "The Coming Cashless Society",
        "Authors": "By Ice, Thomas and Demy, Timothy J.",
        "Description": "Describes how the convenience of automatic tellers, debit cards, and computer shopping may cause loss of private files and personal finanical information",
        "Category": " Social Science , General",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Rose Fairy Princess (Angelina Ballerina)",
        "Authors": "By Craig, Helen (ILT), Holabird, Katharine, and Slade, Barbara",
        "Description": "Angelina longs to play the part of the Rose Fairy Princess in the new ballet, until she leans that the princess flies above the stage on a single wire.",
        "Category": " Juvenile Fiction , Performing Arts , Dance",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Our Simple Gifts: Civil War Christmas Tales",
        "Authors": "By Parry, Owen",
        "Description": "A true holiday classic from acclaimed author Owen Parry, Our Simple Gifts is a heartwarming collection of four Christmas stories set during the Civil War. A writer whose work has been called, “gripping” (Washington Post), “top-notch” (Chicago Tribune), and “marvelous historical fiction” (St. Louis Post-Dispatch), Parry brings us a moving quartet of unforgettable tales that celebrate the simple and often forgotten pleasures of generosity, friends, kindness, and family. Our Simple Gifts is a wonderful gift of hope and joy from an unparalleled storyteller.",
        "Category": " Fiction , Historical , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Pinocchio's Promise",
        "Authors": "By Walt Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Nevada Wildlife Viewing Guide (Wildlife Viewing Guides Series)",
        "Authors": "By Clark, Jeanne L.",
        "Description": "Where-to guide to 55 viewing sites of the best locations to watch wildlife including mammals and birds in their natural environment. Offical field guide of the Watchable Wildlife Series.",
        "Category": " Nature , Animals , Wildlife",
        "Publisher": "Falcon Guides",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Genealogy",
        "Authors": "By Rose, Christine and Ingalls, Kay Germain",
        "Description": "You're no idiot, of course.  You know your grandmother's maiden name and the story of how your great uncle decided to settle in Oklahoma.  But when it comes fo digging up the rest of the facts and growing a family tree, you feel like you're looking at an impossible job.  Stop trying to dig with your bare hands!  The Complete Idiot's Guide to Genalogy provides you with the tools you need, from tracking down family records to locating long-lost relatives.  Feel confident about interviewing family members, organizing photos, visiting courthouses to find information, and more!  In this Complete Idiot's Guide, you get:",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Soccerhead",
        "Authors": "By Haner, Jim",
        "Description": "A YOUTH SOCCER COACH'S INVESTIGATION INTO THE ORIGINS OF SOCCERMANIA Before his son enlisted for a season of Youth Soccer at the neighborhood Boys and Girls Club in College Park, Maryland, Jim Haner was just your typical white, middle-class, suburban father. And as an award-winning journalist for The Sun (Baltimore), he was more likely to write about scoundrels than soccer. But his son caught the bug, and before long, Haner was giving pep talks to nine-year-olds in shin guards and cleats and the game had become an all-consuming obsession.Digging deep into the historical record, Haner sets out to document the soccer craze from the bottom up, tracing the rises and falls in the game's popularity in the decades since \"Mob Ball\" fever was spread by the influx of immigrants on our shores, up to the current wave of \"soccermania.\" The result is a rollicking and timely read.\"[Haner's] enthusiasm and good humor is infectious, the history is genuinely interesting, and anyone who doubts that soccer games between nine-year-olds can be chronicled with the same verve and intensity of professional or collegiate sports need look no further . . . Belongs with Franklin Foer's How Soccer Explains the World (2004) as a must-read for people puzzled by soccer's popularity.\" --Booklist (starred review)",
        "Category": " Sports & Recreation , Soccer",
        "Publisher": "North Point Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Alice Walker (Black Americans of Achievement)",
        "Authors": "By Gentry, Tony",
        "Description": "The life story of Alice Walker is as interesting as fiction as it portrays her gracefully triumphing over troubles and tears to become one of the most celebrated black American writers.",
        "Category": " Young Adult Nonfiction , Biography & Autobiography , Cultural Heritage",
        "Publisher": "Chelsea House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Dear Lady: Coming to America",
        "Authors": "By Robin Lee Hatcher",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan 2000/00",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Story Of Dinosaurs - Pbk (Now I Know)",
        "Authors": "By Eastman, David and Snyder, Joel (ILT)",
        "Description": "Depicts the ways of life of various dinosaurs, including the tyrannosaurus rex, brachiosaurus, brontosaurus, and diplodocus",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "Becoming A Dad: A Spiritual, Emotional And Practical Guide",
        "Authors": "By James Stephen and Thomas, David",
        "Description": "Prepares men for the disruptive, redemptive, and transforming experience called fatherhood by getting them to face deep questions of the soul, instead of by teaching them the mechanics of baby care.  Original.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Relevant Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "The Secret of the Mezuzah (Passport to Danger #1)",
        "Authors": "By Bell, Mary Reeves",
        "Description": "During a search for spies in his Viennese neighborhood, thirteen-year-old Con, an American living in Austria with his mother, gains a new awareness of antisemitism and the events of the Holocaust.",
        "Category": "",
        "Publisher": "Navpress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "A Gathering of Days: A New England Girl's Journal, 1830-32",
        "Authors": "By Blos, Joan W.",
        "Description": "The journal of a fourteen-year-old girl, kept the last year she lived on the family farm, records daily events in her small New Hampshire town, her father's remarriage, and the death of her best friend",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Nala (The Puppy Place #41)",
        "Authors": "By Miles, Ellen",
        "Description": "Charles and Lizzie Peterson love puppies. Their family fosters these young dogs, giving them love and proper care, until they can find the perfect forever home. Charles first spots this beautiful collie, a frightened stray, on his way to school. It&#39;s not easy to win her trust - she&#39;s very skittish - but once she is with the Petersons she begins to learn how to love and be loved.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2016"
        }
    },
    {
        "Title": "A Sister's Memories: A Keepsake Book",
        "Authors": "By Barbara Briggs Morrow",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Lt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Antiques at a Glance: Furniture",
        "Authors": "By MacKay, James",
        "Description": "Learn to tell the difference as experts explain the signatures and styles of particular makers, firms, and even owners worldwide. Special sections cover stools and chairs, sofas and settees, tables and desks, bookcases and cabinets, and bed and bath furnishings. Along with tips on finding truly valuable pieces come illustrated indicators for detecting  repairs, restorations, and more that lower value.",
        "Category": " Antiques & Collectibles , Furniture",
        "Publisher": "PRC Publishing",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Forbidden Advice: 1703 Rarely Divulged Secrets to Save Time, Moeny, and Trouble",
        "Authors": "By Bredenberg, Jeff",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest Association",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    }
]